{
	"id": "462C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.04",
	"title": "462C.04 PROGRAM REVIEW.",
	"text": "MS 1994 [Repealed, 1995 c 167 s 16]\nA public hearing shall be held on each program after one publication of notice in a newspaper circulating generally in the city, at least 15 days before the hearing. On or before the day on which notice of the public hearing is published, the city shall submit the program to the Metropolitan Council, if the city is located in the metropolitan area as defined in section 473.121, subdivision 2, or to the regional development commission for the area in which the city is located, if any, for review and comment. The appropriate reviewing agency shall comment on:\n(a) whether the program furthers local and regional housing policies and is consistent with the Metropolitan Development Guide, if the city is located in the metropolitan area, or adopted policies of the regional development commission; and\n(b) the compatibility of the program with the housing portion of the comprehensive plan of the city, if any.\nReview of the program may be conducted either by the board of the reviewing agency or by the staff of the agency. Any comment submitted by the reviewing agency to the city must be presented to the body considering the proposed program at the public hearing held on the program.\nA member or employee of the reviewing agency shall be permitted to present the comments of the reviewing agency at the public hearing. After conducting the public hearing, the program may be adopted with or without amendment, provided that any amendments must not be inconsistent with the comments, if any, of the reviewing agency and must not contain any material changes from the program submitted to the reviewing agency other than changes in the financial aspects of any proposed issue of bonds or obligations. If any material change other than a change in the financial aspects of a proposed issue of bonds or obligations, or any change which is inconsistent with the comments of the reviewing agency is adopted, the amended program shall be resubmitted to the appropriate reviewing agency for review and comment, and a public hearing shall be held on the amended program after one publication of notice in a newspaper circulating generally in the city at least 15 days before the hearing. The amended program shall be considered after the public hearing in the same manner as consideration of the initial program.\nMS 2013 Supp [Repealed, 2014 c 161 art 2 s 1]\nMS 2013 Supp [Repealed, 2014 c 161 art 2 s 1]",
	"repealed": false
}