{
	"id": "103E.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.221",
	"title": "103E.221 IMPROVING OUTLETS.",
	"text": "If a public or private proposed drainage project or existing drainage system has waters draining into an existing drainage system, watercourse, or body of water, and the construction or proposed construction of the drainage project causes an overflow of the existing drainage system, watercourse, or body of water on adjoining property, an affected county or the owners of the overflowed property may start outlet improvement proceedings under this section.\n(a) A petition must be signed by the board of an affected county, by at least 26 percent of the owners of adjoining overflowed property, or by the owners of at least 26 percent of the area of the overflowed property. The petition must:\n(1) describe the property that has been or is likely to be overflowed including the names and addresses of the property owners from records in the county assessor's office;\n(2) state in general terms by number or otherwise the drainage systems that have caused or are likely to cause the overflow;\n(3) describe the location of the overflowed drainage system, watercourse, or body of water and the outlet;\n(4) show the necessity of the improvement by enlarging the system or controlling the waters by off-take ditches, additional outlets, or otherwise;\n(5) show that the outlet improvement will protect the adjoining property from overflow;\n(6) state that the improvement will be of public benefit and utility and improve the public health; and\n(7) state that the petitioners will pay all costs incurred if the proceedings are dismissed or a contract for construction of the outlet improvement is not awarded.\n(b) The petitioners, except for a petition made by the board, shall give the required bond.\nThe petition shall be filed with the county auditor. If the board makes the petition, it must be addressed to the drainage authority and filed with the auditor. If part of the improvement or the overflowed property is located in more than one county, the petition must be filed with the auditor of the county with the greatest affected area.\nAfter the petition is filed, the board or joint county drainage authority where the petition is filed has jurisdiction of the petition, the improvement, the affected property, and all proceedings for the establishment and construction of the outlet improvement and the assessment of property benefited by the outlet improvement, as provided for establishment and construction of a drainage project under this chapter.\nIn the preliminary survey report, the engineer shall show the existing or proposed drainage projects or systems that cause the overflow, the property drained or to be drained by the drainage project, and the names of affected property owners.\nIf, after the preliminary survey report hearing, a detailed survey is ordered and viewers are appointed, the viewers shall determine and report the benefits to all property from the outlet improvement including property drained or to be drained by the existing drainage system and proposed drainage project.",
	"repealed": false
}