{
	"id": "359.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/359.03",
	"title": "359.03 STAMP; REGISTER.",
	"text": "Every notary, including an ex officio notary under section 358.15, shall obtain an official notarial stamp as specified in subdivision 3, with which to authenticate official acts. The official notarial stamp, and the notary's official journal, are the personal property of the notary and are exempt from execution.\n(a) All instruments heretofore duly made and executed which have been acknowledged before a notary public as provided by law, but the seal or stamp used thereon has engraved on it \"notary public,\" are hereby validated and legalized, and in case such instruments are recorded, the recording is hereby validated and legalized, and all such instruments are validated to the same extent as though properly sealed at the time of their acknowledgment. This subdivision shall not affect any action now pending in any of the courts of this state.\n(b) The official notarial stamp required by this section, whether applied to the record physically or electronically, is deemed to be a \"seal\" for purposes of the admission of a document in court.\n(a) The official notarial stamp consists of the seal of the state of Minnesota, the name of the notary as it appears on the commission or the name of the ex officio notary, the words \"Notary Public,\" or \"Notarial Officer\" in the case of an ex officio notary, and the words \"My commission expires ............... (or where applicable) My term is indeterminate,\" with the expiration date shown on it and must be able to be reproduced in any legibly reproducible manner. The official notarial stamp shall be a rectangular form of not more than three-fourths of an inch vertically by 2-1/2 inches horizontally, with a serrated or milled edge border, and shall contain the information required by this subdivision.\n(b) A notarial stamp that complied with these requirements at the time of issuance may continue to be used during the remainder of the current term of the notary even if changes to any of these requirements subsequently become effective.\nThe information required by this section may be affixed electronically and shall be logically and securely affixed or associated with the electronic record being notarized.",
	"repealed": false
}