{
	"id": "201.054",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.054",
	"title": "201.054 METHODS OF REGISTERING; PROHIBITIONS; PENALTY.",
	"text": "(a) An individual may register to vote:\n(1) at any time before the 20th day preceding any election as provided in section 201.061, subdivision 1;\n(2) on the day of an election as provided in section 201.061, subdivision 3; or\n(3) when submitting an absentee ballot, by enclosing a completed registration application as provided in section 203B.04, subdivision 4.\n(b) An individual who is under the age of 18, but who is at least 16 years of age and otherwise eligible, may submit a voter registration application as provided in section 201.061, subdivisions 1 and 1b.\nNo individual shall intentionally:\n(1) cause or attempt to cause the individual's name to be registered in any precinct if the individual is not eligible to vote, except as permitted by section 201.061, subdivision 1b;\n(2) cause or attempt to cause the individual's name to be registered for the purpose of voting in more than one precinct;\n(3) misrepresent the individual's identity when attempting to register to vote; or\n(4) aid, abet, counsel, or procure any other individual to violate this subdivision.\nA violation of this subdivision is a felony.\n(a) No individual may be compensated for the solicitation, collection, or acceptance of voter registration applications from voters for submission to the secretary of state, a county auditor, or other local election official in a manner in which payment is calculated by multiplying (1) either a set or variable payment rate, by (2) the number of voter registration applications solicited, collected, or accepted.\n(b) No individual may be deprived of compensation or have compensation automatically reduced exclusively for failure to solicit, collect, or accept a minimum number of voter registration applications, and no individual may receive additional compensation for reaching or exceeding a minimum number of voter registration applications.\n(c) A person who violates this subdivision is guilty of a petty misdemeanor.",
	"repealed": false
}