{
	"id": "144E.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.001",
	"title": "144E.001 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Advanced airway management\" means insertion of an endotracheal tube or creation of a surgical airway.\n\"Advanced life support\" means rendering basic life support and rendering intravenous therapy, drug therapy, intubation, and defibrillation as outlined in the United States Department of Transportation paramedic standards or its equivalent, as approved by the director.\n\"Ambulance\" means any vehicle designed or intended for and actually used in providing ambulance service to ill or injured persons or expectant mothers.\n\"Ambulance service\" means transportation and treatment which is rendered or offered to be rendered preliminary to or during transportation to, from, or between health care facilities for ill or injured persons or expectant mothers. The term includes all transportation involving the use of a stretcher, unless the person to be transported is not likely to require medical treatment during the course of transport.\n\"Ambulance service personnel\" means individuals who are authorized by a licensed ambulance service to provide emergency care for the ambulance service and are:\n(1) EMTs, AEMTs, or paramedics;\n(2) Minnesota registered nurses who are: (i) EMTs, are currently practicing nursing, and have been approved by the ambulance service medical director; (ii) on the roster of an ambulance service on or before January 1, 2000; (iii) after petitioning the director, deemed by the director to have training and skills equivalent to an EMT, as determined on a case-by-case basis; or (iv) certified as a certified flight registered nurse or certified emergency nurse; or\n(3) Minnesota licensed physician assistants who are: (i) EMTs, are currently practicing as physician assistants, and have been approved by the ambulance service medical director; (ii) on the roster of an ambulance service on or before January 1, 2000; or (iii) after petitioning the director, deemed by the director to have training and skills equivalent to an EMT, as determined on a case-by-case basis.\n\"Base of operations\" means the address at which the physical plant housing ambulances, related equipment, and personnel is located.\n\"Basic airway management\" means:\n(1) resuscitation by mouth-to-mouth, mouth-to-mask, bag valve mask, or oxygen powered ventilators; or\n(2) insertion of an oropharyngeal, nasal pharyngeal, or esophageal tracheal airway.\n\"Basic life support\" means rendering basic-level emergency care, including, but not limited to, basic airway management, cardiopulmonary resuscitation, controlling shock and bleeding, and splinting fractures, as outlined in the United States Department of Transportation emergency medical technician education standards or its equivalent, as approved by the director.\nMS 2022 [Repealed, 2024 c 122 art 1 s 25; 2024 c 127 art 63 s 23]\n[See Note.]\n\"Clinical training site\" means a licensed health care facility.\n\"Defibrillator\" means an automatic, semiautomatic, or manual device that delivers an electric shock at a preset voltage to the myocardium through the chest wall and that is used to restore the normal cardiac rhythm and rate when the heart has stopped beating or is fibrillating.\n\"Emergency medical technician\" or \"EMT\" means a person who has successfully completed the United States Department of Transportation emergency medical technician standards course or its equivalent, as approved by the director, and has been issued valid certification by the director.\n\"Advanced emergency medical technician\" or \"AEMT\" means a person who has successfully completed the United States Department of Transportation advanced emergency medical technician standards course or its equivalent, as approved by the director, and has been issued valid certification by the director.\n\"Paramedic\" means a person who has successfully completed the United States Department of Transportation paramedic course or its equivalent, as approved by the director, and has been issued valid certification by the director.\n\"Community paramedic\" means a person who is certified as a paramedic and who meets the requirements for additional certification as a community paramedic as specified in section 144E.28, subdivision 9.\n\"Emergency medical responder group\" means a group of certified or registered personnel who respond to medical emergencies and have a medical director.\n\"Community emergency medical technician\" or \"CEMT\" means a person who is certified as an emergency medical technician, who is a member of a registered medical response unit under section 144E.275 or a basic life support ambulance service, and who meets the requirements for additional certification as a CEMT as specified in section 144E.275, subdivision 7.\n\"Emergency medical responder\" or \"EMR\" means an individual who is registered by the director to perform, at a minimum, basic emergency skills before the arrival of a licensed ambulance service, and is a member of an organized service recognized by a local political subdivision whose primary responsibility is to respond to medical emergencies to provide initial medical care before the arrival of a licensed ambulance service or is on the roster of a Minnesota licensed ambulance service.\n\"In-service ambulance\" means the ambulance is licensed by the director and is in compliance with ambulance service requirements in this chapter and Minnesota Rules, chapter 4690.\n\"Intravenous infusion\" means the establishment of an intravenous line or interosseous access and administration of an intravenous fluid, other than blood, or intravenous fluids that have additives not for specific therapeutic purposes into a vein.\n\"Intravenous therapy\" means the administration of intravenous fluids, medications, and other substances designed for specific therapeutic response.\n\"Level I trauma hospital\" means an adult or pediatric hospital located in the state of Minnesota that has been designated by the commissioner of health as meeting the criteria for level I designation according to section 144.605, subdivision 3.\n\"License\" means authority granted by the director for the operation of an ambulance service in the state of Minnesota.\n\"Licensee\" means a natural person, partnership, association, corporation, Indian tribe, or unit of government which possesses an ambulance service license.\n\"Medical control\" means direction by a physician or a physician's designee of out-of-hospital emergency medical care.\n\"Medical resource communication center\" means an entity that:\n(1) facilitates hospital-to-ambulance communications for ambulance services, the regional emergency medical services systems, and the director by coordinating patient care and transportation for ground and air operations;\n(2) is integrated with the state's Allied Radio Matrix for Emergency Response (ARMER) radio system; and\n(3) is the point of contact and a communication resource for statewide public safety entities, hospitals, and communities.\n\"Municipality\" means any city of any class, however organized, and any town.\n\"Part-time advanced life support\" means rendering basic life support and advanced life support for less than 24 hours of every day.\n\"Physician\" means a person licensed to practice medicine under chapter 147.\n\"Physician assistant\" means a person licensed to practice as a physician assistant under chapter 147A.\n\"Prehospital care data\" means information collected by ambulance service personnel about the circumstances related to an emergency response and patient care activities provided by the ambulance service personnel in a prehospital setting.\n\"Primary service area\" means the geographic area that can reasonably be served by an ambulance service.\n\"Program medical director\" means a physician who is responsible for ensuring an accurate and thorough presentation of the medical content of an emergency care education program; certifying that each student has successfully completed the education course; and in conjunction with the program coordinator, planning the clinical training.\n\"Registered nurse\" means a person licensed to practice professional nursing under chapter 148.\n\"Standing order\" means a type of medical protocol that provides specific, written orders for actions, techniques, or drug administration when communication has not been established for direct medical control.\n\"Education program coordinator\" means an individual who serves as the administrator of an emergency care education program and who is responsible for planning, conducting, and evaluating the program; selecting students and instructors; documenting and maintaining records; developing a curriculum according to the National EMS Education Standards by the National Highway Transportation Safety Administration (NHTSA), United States Department of Transportation; and assisting in the coordination of examination sessions and clinical training.\n\"Tribe\" means a federally recognized Indian tribe, as defined in United States Code, title 25, section 450b, paragraph (e), located within the state of Minnesota.\n\"Volunteer ambulance attendant\" means a person who provides emergency medical services for a Minnesota licensed ambulance service without the expectation of remuneration and who does not depend in any way upon the provision of these services for the person's livelihood. An individual may be considered a volunteer ambulance attendant even though the individual receives an hourly stipend for each hour of actual service provided, except for hours on standby alert, or other nominal fee, and even though the hourly stipend or other nominal fee is regarded as taxable income for purposes of state or federal law, provided that the hourly stipend and other nominal fees do not exceed $6,000 annually.\n\"Director\" means the director of the Office of Emergency Medical Services.\n\"Office\" means the Office of Emergency Medical Services.",
	"repealed": false
}