{
	"id": "504B.268",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.268",
	"title": "504B.268 RIGHT TO COUNSEL IN PUBLIC HOUSING; BREACH OF LEASE EVICTION ACTIONS.",
	"text": "A defendant in housing subsidized by the United States Department of Housing and Urban Development under Section 9 of the United States Housing Act of 1937 or the Consolidated and Further Continuing Appropriations Act of 2012, Public Law 112-55, 125 Stat. 673, subject to an eviction action under sections 504B.281 to 504B.371 alleging breach of lease under section 504B.171 or 504B.285 who is financially unable to obtain counsel has the right to counsel appointed by the court. The complaint required by section 504B.321 shall include the notice on the first page of the complaint in bold 12-point type: \"If financially unable to obtain counsel, the defendant has the right to a court-appointed attorney.\" At the initial hearing, the court shall ask the defendant if the defendant wants court-appointed counsel and shall explain what such appointed counsel can accomplish for the defendant.\nCounsel appointed by the court must: (1) have a minimum of two years' experience handling public housing evictions; (2) have training in handling public housing evictions; or (3) be supervised by an attorney who meets the minimum qualifications under clause (1) or (2).\nBy January 15, 2024, and every year thereafter, the chief judge of the judicial district, after consultation with public housing attorneys, legal aid attorneys, and members of the private bar in the district, shall establish a compensation rate for attorney fees and costs associated with representation under subdivision 1. The compensation to be paid to an attorney for such service rendered to a defendant under this subdivision may not exceed $5,000, exclusive of reimbursement for expenses reasonably incurred, unless payment in excess of that limit is certified by the chief judge of the district as necessary to provide fair compensation for services of an unusual character or duration.",
	"repealed": false
}