{
	"id": "142A.417",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.417",
	"title": "142A.417 CHILD PROTECTION GRANTS TO ADDRESS CHILD WELFARE DISPARITIES.",
	"text": "The commissioner may award grants to eligible entities for the development, implementation, and evaluation of activities to address racial disparities and disproportionality in the child welfare system by:\n(1) identifying and addressing structural factors that contribute to inequities in outcomes;\n(2) identifying and implementing strategies to reduce racial disparities in treatment and outcomes;\n(3) using cultural values, beliefs, and practices of families, communities, and tribes for case planning, service design, and decision-making processes;\n(4) using placement and reunification strategies to maintain and support relationships and connections between parents, siblings, children, kin, significant others, and tribes; and\n(5) supporting families in the context of their communities and tribes to safely divert them from the child welfare system, whenever possible.\nThe commissioner, in partnership with the legislative task force on child protection; culturally based community organizations; the Indian Affairs Council under section 3.922; the Minnesota Council on Latino Affairs under section 15.0145; the Council for Minnesotans of African Heritage under section 15.0145; the Council on Asian-Pacific Minnesotans under section 15.0145; the American Indian Child Welfare Advisory Council under section 260.835; counties; and tribal governments, shall develop and implement a comprehensive, coordinated plan to award funds under this section for the priority areas identified in subdivision 1.\nThe commissioner, in consultation with the state-community partners listed in subdivision 2, shall establish measurable outcomes to determine the effectiveness of the grants and other activities funded under this section in reducing disparities identified in subdivision 1. The development of measurable outcomes must be completed before any funds are distributed under this section.\n(a) The commissioner, in consultation with the state-community partners listed in subdivision 2, shall develop the criteria and procedures to allocate competitive grants under this section. In developing the criteria, the commissioner shall establish an administrative cost limit for grant recipients. A county awarded a grant shall not spend more than three percent of the grant on administrative costs. When a grant is awarded, the commissioner must provide a grant recipient with information on the outcomes established according to subdivision 3.\n(b) A grant recipient must coordinate its activities with other entities receiving funds under this section that are in the grant recipient's service area.\n(c) Grant funds must not be used to supplant any state or federal funds received for child welfare services.\n(a) The commissioner shall award competitive grants to eligible applicants for local or regional projects and initiatives directed at reducing disparities in the child welfare system.\n(b) The commissioner may award up to 20 percent of the funds available as planning grants. Planning grants must be used to address such areas as community assessment, coordination activities, and development of community-supported strategies.\n(c) Eligible applicants may include, but are not limited to, faith-based organizations, social service organizations, community nonprofit organizations, counties, and tribal governments. Applicants must submit proposals to the commissioner. A proposal must specify the strategies to be implemented to address one or more of the priority areas in subdivision 1 and must be targeted to achieve the outcomes established according to subdivision 3.\n(d) The commissioner shall give priority to applicants who demonstrate that their proposed project or initiative:\n(1) is supported by the community the applicant will serve;\n(2) is evidence-based;\n(3) is designed to complement other related community activities;\n(4) utilizes strategies that positively impact priority areas;\n(5) reflects culturally appropriate approaches; or\n(6) will be implemented through or with community-based organizations that reflect the culture of the population to be reached.\n(a) Using the outcomes established according to subdivision 3, the commissioner shall conduct a biennial evaluation of the grant program funded under this section. Grant recipients shall cooperate with the commissioner in the evaluation and shall provide the commissioner with the information needed to conduct the evaluation.\n(b) The commissioner shall consult with the legislative task force on child protection during the evaluation process.\n(c) The commissioner shall submit a biennial evaluation report to the task force and to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over child protection funding. This paragraph expires January 1, 2032.\nOf the amount appropriated for purposes of this section, the commissioner shall award $75,000 to each tribe authorized to provide tribal delivery of child welfare services under section 142A.03, subdivision 9. To receive funds under this subdivision, a participating tribe is not required to apply to the commissioner for grant funds. Participating tribes are also eligible for competitive grant funds under this section.",
	"repealed": false
}