{
	"id": "458A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.05",
	"title": "458A.05 REVENUE BONDS.",
	"text": "The commission shall have authority to issue negotiable revenue bonds for any one or more of its powers and purposes, including the following: to construct and equip terminal facilities, maintenance and garage facilities, ramps, parking areas, or similar facilities used or useful in connection with a public transit system or part thereof; to acquire, improve, extend, or reconstruct any public transit system or any part thereof; to acquire any property or equipment useful for the construction, reconstruction, extension, improvement, or operation of any public transit system or any part thereof; to acquire any other real or personal property, franchises, easements, transit lanes, rights-of-way or other rights used or useful in connection with a public transit system or any part thereof; and to refund revenue bonds issued for any such purposes.\nRevenue bonds under this section shall be issued in such amounts, times, and series as the commission by resolution shall determine and shall mature within 40 years from their date. No election shall be necessary to authorize the issuance of revenue bonds by the commission. Such revenue bonds may be sold at public or private sale or may be issued in exchange for bonds refunded thereby or property acquisitions or contract obligations funded thereby. Except as otherwise provided by this section, the maturities, any right of prior redemption, execution, paying agency, provision for interest and other terms of the bonds shall be subject to the provisions of sections 475.54 to 475.56.\nRevenue bonds issued under this section shall not constitute a debt of the state or of any municipal corporation or political subdivision and no ad valorem tax levy may be compelled for their payment except as provided in section 458A.10 where the wheelage tax is held invalid but they shall be payable only from the revenues of the commission pledged by the commission to payment of principal thereof and interest thereon, and they shall so recite. At or before the issuance of revenue bonds, the commission shall pledge and appropriate to the payment of principal and interest the gross or net revenues of the public transit system or some part thereof, and may pledge and appropriate other revenues of the commission, as described and defined in the authorizing resolution.\nBy the authorizing resolution, the commission may provide covenants for the protection of the bondholders relating to disposition of bond proceeds and revenues; reserves and investment thereof; construction, acquisition, repair, replacement, operation and insurance of the public transit system facilities; accounting and reports; issuance of parity or subordinate lien bonds; rates and charges to be established or maintained; competing public transit systems; and such other covenants as the commission shall find to be usual and reasonably necessary for the protection of transit system revenue bondholders. Among other covenants, the commission is authorized to covenant on behalf of the state that the state will not limit or alter the power and obligation of the commission to establish, increase and collect pledged moneys sufficient to pay expenses of operation and maintenance and provide debt service on the bonds and to covenant on behalf of the state and each municipality or other political subdivision that no franchise, license, or permit shall be granted or renewed for any public transit system or part thereof which would compete with the public transit system or part thereof the revenues of which are pledged. The commission may also define the event or events of default and other requisites for suit by bondholders or their representatives, conditions of bond registration or replacement, and conditions upon which any covenant may be amended. Any terms, covenants, or conditions of revenue bonds to be provided by resolution of the commission may instead be set forth in a trust indenture with a corporation having trust powers appointed by the commission to represent and act for bondholders and to hold and disburse pledged moneys and to perform such other duties as may be provided in the trust indenture, but no such trust indenture shall confer or authorize any mortgage lien on the real or operating properties or general funds of the commission.\nRevenue bonds issued by the commission may be purchased by the State Board of Investment for any trust fund of the state or other fund administered by such board, and shall be proper for investment of any funds by any savings bank, trust company, insurance company or public or municipal corporation, and may be pledged by any bank or trust company as security for the deposit of public moneys.\nRevenue bonds of the commission shall be deemed and treated as instrumentalities and obligations of a public government agency.",
	"repealed": false
}