{
	"id": "14.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.15",
	"title": "14.15 ADMINISTRATIVE LAW JUDGE'S REPORT.",
	"text": "After allowing a comment period during which written material may be submitted and recorded in the hearing record for five working days after the public hearing ends, or for a longer period not to exceed 20 days if ordered by the administrative law judge, the administrative law judge assigned to the hearing shall write a report as provided for in section 14.50. Before writing the report, the administrative law judge shall allow the agency and interested persons a rebuttal period of five working days after the comment period ends to respond in writing to any new information submitted. During the comment period and five-day rebuttal period, the agency may indicate in writing whether there are amendments suggested by other persons which the agency is willing to adopt. Additional evidence may not be submitted during this five-day rebuttal period. The written responses must be added to the rulemaking record.\nThe report shall be completed within 30 days after the close of the hearing record unless the chief administrative law judge, upon written request of the agency or the administrative law judge, orders an extension. An extension shall not be granted if the chief administrative law judge determines that an extension would prohibit a rule from being adopted or becoming effective until after a date for adoption or effectiveness as required by statute. The report shall be available to all affected persons upon request for at least five working days before the agency takes any further action on the rule.\nIf the report contains a finding that a rule has been modified in a way which makes it substantially different, as determined under section 14.05, subdivision 2, from that which was originally proposed, or that the agency has not met the requirements of sections 14.131 to 14.18, it shall be submitted to the chief administrative law judge for approval. If the chief administrative law judge approves the finding of the administrative law judge, the chief administrative law judge shall advise the agency and the revisor of statutes of actions which will correct the defects. The agency shall not adopt the rule until the chief administrative law judge determines that the defects have been corrected or, if applicable, that the agency has satisfied the rule requirements for the adoption of a substantially different rule.\nIf the chief administrative law judge determines that the need for or reasonableness of the rule has not been established pursuant to section 14.14, subdivision 2, and if the agency does not elect to follow the suggested actions of the chief administrative law judge to correct that defect, then the agency shall submit the proposed rule to the Legislative Coordinating Commission and to the house of representatives and senate policy committees with primary jurisdiction over state governmental operations for advice and comment. The agency may not adopt the rule until it has received and considered the advice of the commission and committees. However, the agency is not required to wait for advice for more than 60 days after the commission and committees have received the agency's submission.\nThe administrative law judge shall disregard any error or defect in the proceeding due to the agency's failure to satisfy any procedural requirement imposed by law or rule if the administrative law judge finds:\n(1) that the failure did not deprive any person or entity of an opportunity to participate meaningfully in the rulemaking process; or\n(2) that the agency has taken corrective action to cure the error or defect so that the failure did not deprive any person or entity of an opportunity to participate meaningfully in the rulemaking process.",
	"repealed": false
}