{
	"id": "64B.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/64B.43",
	"title": "64B.43 FRATERNAL AUTHORIZED CONTROL LEVEL EVENT; DOMESTIC SOCIETIES.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Fraternal authorized control level event\" means any of the following events:\n(1) the filing of a risk-based capital report by the society that indicates that the society's total adjusted capital is less than its fraternal authorized control level risk-based capital;\n(2) the notification by the commissioner to the society of an adjusted risk-based capital report that indicates the event in clause (1), provided the society does not challenge the adjusted risk-based capital report under section 64B.44;\n(3) if, pursuant to section 64B.44, the society challenges an adjusted risk-based capital report that indicates the event in clause (1), notification by the commissioner to the society that the commissioner has, after a hearing, rejected the society's challenge;\n(4) the failure of the society to respond, in a manner satisfactory to the commissioner, to a corrective order, provided the society has not challenged the corrective order under section 64B.44;\n(5) if the society has challenged a corrective order under section 64B.44 and the commissioner has, after a hearing, rejected the challenge or modified the corrective order, the failure of the society to respond, in a manner satisfactory to the commissioner, to the corrective order subsequent to rejection or modification by the commissioner;\n(6) the failure of the society to submit a risk-based capital plan to the commissioner within the time period in section 64B.42;\n(7) notification by the commissioner to the society that:\n(i) the risk-based capital plan or revised risk-based capital plan submitted by the society is, in the judgment of the commissioner, unsatisfactory; and\n(ii) the society has not challenged the determination under section 64B.44;\n(8) if, pursuant to section 64B.44, the society challenges a determination by the commissioner under the notification by the commissioner to the society that the commissioner has, after a hearing, rejected the challenge;\n(9) notification by the commissioner to the society that the society has failed to adhere to its risk-based capital plan or revised risk-based capital plan, but only if the failure has a substantial adverse effect on the ability of the society to eliminate the fraternal action level event according to its risk-based capital plan or revised risk-based capital plan and the commissioner has so stated in the notification, provided the society has not challenged the determination under section 64B.44; or\n(10) if, pursuant to section 64B.44, the society challenges a determination by the commissioner under clause (9), the notification by the commissioner to the society that the commissioner has, after a hearing, rejected the challenge.\n(c) \"Qualifying society\" means a fraternal benefit society, whether foreign or domestic, that has the financial strength and administrative capability to accept a transfer of certificates under subdivision 3 and is domiciled in a state accredited by the National Association of Insurance Commissioners.\n(d) \"Society\" means a domestic fraternal benefit society organized and operated under the laws of this state.\nIn the event of a fraternal authorized control level event with respect to a society, the commissioner shall:\n(1) take the actions required under section 64B.42 regarding a society with respect to which a fraternal action level event has occurred; or\n(2) if the commissioner considers it to be in the best interests of the certificate holders of the society, require the society to take one or more of the following actions:\n(i) merge or otherwise consolidate with another willing authorized society;\n(ii) cede any individual risk or risks, in whole or in part, to a willing society or life insurer;\n(iii) suspend the issuance of new business; and\n(iv) discontinue its insurance operations; or\n(3) take the actions necessary to cause the society to be placed under regulatory control under chapter 60B. In the event the commissioner takes these actions, the fraternal authorized control level event is considered sufficient grounds for the commissioner to take action under chapter 60B, and the commissioner has the rights, powers, and duties with respect to the society set forth in chapter 60B. In the event the commissioner takes actions under this clause pursuant to an adjusted risk-based capital report, the society is entitled to the protections afforded to societies under section 60B.11 pertaining to summary proceedings.\n(a) Within 45 days of a fraternal authorized control level event with respect to a society, the society shall present to the commissioner a plan to protect the interests of its members. The plan shall include transferring all members, certificates, and related assets and liabilities of the society, together with any other assets and liabilities the society desires to transfer, to another firm, corporation, or organization through merger, consolidation, assumption, or other means. Any transfer shall constitute a novation of the transferring society's certificates effective upon the date of transfer. The commissioner shall review the plan within 45 days of its submission and may approve the plan within that time frame if the plan provides sound financial security for the payment of obligations arising under the certificates of the society and is otherwise in the best interest of the members.\n(b) The transfer shall be:\n(1) concluded within the time frame established by the commissioner, which shall not exceed 90 days;\n(2) approved by the society upon majority vote of its board of directors prior to the submission of the plan to the commissioner; and\n(3) effective notwithstanding the provisions of section 64B.14 or any other requirement of statute or rule or the laws of the society requiring another form of notice to members or approval by the supreme governing body.\nAny notice to or approval of a transfer required by the laws of the society or statute or rule shall be suspended by this subdivision.\n(c) Upon application, the commissioner may approve a transfer under this subdivision to a foreign qualifying society that does not have a certificate of authority to transact insurance in this state. If the commissioner determines that the foreign fraternal benefit society has sufficient financial strength and servicing capabilities to satisfy the obligations arising under the transferring society's certificates, the commissioner may issue an order to authorize the foreign fraternal benefit society to service the certificates resulting from a transfer, including issuing any amendments or revisions requested by the holder of the certificate and to fulfill all obligations arising under the certificate, but not to otherwise transact insurance business in this state.\n(d) Upon the effective date of a transfer to an insurer with a certificate of authority to do business in this state and in consideration of that transfer, each member of the society shall be deemed to agree that any terms of a certificate subjecting the certificate to the laws of the society or providing rights or obligations of membership, except to the extent of any outstanding lien not released by the terms of the transfer, shall be null and void and the insurer shall endorse the certificates accordingly.\n(e) Upon the effective date of a transfer to a firm, corporation, or organization that is not a fraternal benefit society and in consideration of that transfer, each member of the society shall be deemed to agree that any terms of a certificate subjecting the certificate to the laws of the society or providing rights or obligations of membership, except to the extent of any outstanding lien not released by the terms of the transfer, shall be null and void and the firm, corporation, or organization shall endorse the certificates accordingly.\n(f) The board of directors of a society may suspend or modify its qualifications for membership as necessary or appropriate to facilitate a transfer under this subdivision, notwithstanding the laws of the society or any statute or rule to the contrary.\n(g) Each society shall amend its laws to permit the transactions contemplated by this subdivision, including suspending any provisions requiring any notice to members or approval of the supreme governing body with respect to the transfer of its certificates if the society has a fraternal authorized control level event and the transfer is approved by the commissioner.\n(a) In the event of a fraternal authorized control level event with respect to a society under circumstances the commissioner determines will not be promptly remedied pursuant to the authorization provided in subdivision 3, the commissioner may apply for a verified petition to commence liquidation of the society under section 60B.20. These circumstances shall be deemed to satisfy grounds to commence a liquidation under section 60B.20. The commissioner may issue an order declaring the society to be in hazardous financial condition under the standards of section 60G.20, subdivision 1, clause (15), and initiate proceedings pursuant to this subdivision. Nothing in this subdivision prevents the commissioner from applying for an order to commence the liquidation of a society under any of the grounds in section 60B.20.\n(b) Liquidation proceedings for a society shall be governed by chapter 60B, except to the extent the provisions of chapter 60B are in conflict or inconsistent with any provisions in this chapter.\n(c) Liquidation proceedings for a society shall be conducted consistent with the purposes of section 60B.01, subdivision 4, paragraph (c), in a manner designed to conserve assets and to limit expenses of the liquidation under section 60B.44, subdivision 2.",
	"repealed": false
}