{
	"id": "142D.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.32",
	"title": "142D.32 EARLY CHILDHOOD REGISTERED APPRENTICESHIP GRANT PROGRAM.",
	"text": "The commissioner of children, youth, and families shall, in coordination with the commissioner of labor and industry, establish an apprenticeship grant program to provide employment-based training and mentoring opportunities for early childhood workers.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Apprentice\" means an employee participating in an early childhood registered apprenticeship program.\n(c) \"Early childhood registered apprenticeship program\" means an organization holding the TEACH license with the Department of Children, Youth, and Families that is registered with the Department of Labor and Industry under chapter 178.\n(d) \"Early childhood signatory employer\" means an employer that participates in an early childhood registered apprenticeship program and employs an apprentice and that is:\n(1) a licensed child care center under Minnesota Rules, chapter 9503;\n(2) a licensed family and group family child care provider under Minnesota Rules, chapter 9502;\n(3) an early childhood family education program under section 142D.10; a school readiness program under section 142D.05; a voluntary prekindergarten program under section 142D.08; a special education program under chapter 125A; or a school readiness plus program under section 142D.07;\n(4) a Head Start program under United States Code, title 42, section 9801, et seq.;\n(5) a certified license-exempt child care center under chapter 142C; or\n(6) a Tribally licensed child care program.\n(e) \"Mentor\" means an early childhood registered apprenticeship program journeyworker under section 178.011, subdivision 9, who has a career lattice step of nine or higher.\nThe organization holding the TEACH license with the Department of Children, Youth, and Families shall distribute the grant and must use the grant for:\n(1) tuition scholarships for apprentices for courses leading to a higher education degree in early childhood;\n(2) stipends for mentors; or\n(3) stipends for early childhood signatory employers.\nAn apprentice may receive a higher education scholarship of up to $10,000 for up to 24 months under this section, provided the apprentice:\n(1) enrolls in an early childhood registered apprenticeship program;\n(2) is a current participant in good standing in the TEACH scholarship program under section 142D.31;\n(3) participates in meetings and on-the-job learning with a mentor consistent with the requirements in the apprenticeship program standards;\n(4) works toward meeting early childhood competencies identified in Minnesota's Knowledge and Competency Framework for early childhood professionals, as observed by a mentor; and\n(5) works toward the attainment of a higher education degree in early childhood.\nA mentor shall receive up to $4,000 for each apprentice mentored under this section, provided the mentor complies with the requirements in the apprenticeship program standard and completes eight weeks of mentor training and additional training on observation. Mentors may use money received through stipends for personal expenses. The training must be free of charge to mentors.\n(a) An early childhood signatory employer shall receive up to $5,000 for each apprentice employed under this section, provided the early childhood signatory employer complies with the requirements in the apprenticeship program standard and the following requirements:\n(1) sponsor each apprentice's TEACH scholarship under section 142D.31; and\n(2) provide each apprentice at least three hours a week of paid release time for coursework.\n(b) An early childhood signatory employer may not employ more than three apprentices at one site in a 12-month period.",
	"repealed": false
}