{
	"id": "270C.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.95",
	"title": "270C.95 QUALIFICATION OF ASSESSORS; REASSESSMENT, HOW MADE.",
	"text": "Every special assessor and deputy appointed under the provisions of section 270C.94 shall subscribe and file with the commissioner an oath to faithfully and fairly perform the duties of office. Such special assessor, assisted by deputies, shall thereupon proceed to carefully examine and reassess the property so to be reassessed and prepare duplicate lists of such reassessment in such form as the commissioner may prescribe, showing the property or person so reassessed, the amount of the original assessment thereof made in such year, and opposite the same the reassessment so made by such special assessor. The special assessor shall file both copies of such list with the commissioner; and the commissioner shall thereupon examine, equalize, and correct such reassessment so as to substantially conform with the assessment of like property throughout the state and transmit to the auditor of the county wherein such reassessment was so made one copy of such reassessment by the commissioner so corrected and equalized. Such list shall for all purposes supersede and be in place of the original assessment made for such year upon such property and the county auditor, upon receipt thereof, shall extend and levy against such property so reassessed the taxes thereon for such year according to such reassessment in the same manner as though such list was the original assessment list of such property. Any person feeling aggrieved by an assessment so made against the person, or upon any property at that time owned by the person, may appeal therefrom to the district court of the county in which such assessment is made. To render the appeal effective for any purpose, the appellant shall file a notice of the appeal with the auditor of such county within 30 days after the making of the assessment, which notice shall specify the ground upon which the appeal was taken, and no other or different service shall be required to perfect it. Upon the filing of the notice the county auditor shall make and file in the office of the court administrator of the district court a certified copy of the notice and of the particular assessment appealed from and notify the county attorney of such county of the pendency of the appeal. Thereupon the district court shall be deemed to have acquired jurisdiction of the matter and proceed to hear and determine it in like manner as other tax matters are tried and determined in the district courts of this state. The county attorney of such county shall appear for and defend the interests of the state in such matter.",
	"repealed": false
}