{
	"id": "473.4465",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.4465",
	"title": "473.4465 REGIONAL TRANSPORTATION SALES AND USE TAX USES.",
	"text": "For purposes of this section, \"sales tax revenue\" means the portion of revenue from the regional transportation sales and use tax under section 297A.9915 that is allocated to the council for purposes of this section.\n(a) Sales tax revenue is available as follows:\n(1) five percent for active transportation, as determined by the Transportation Advisory Board under subdivision 3; and\n(2) 95 percent for transit system purposes under sections 473.371 to 473.452, including but not limited to operations, maintenance, and capital projects.\n(b) The council must expend a portion of sales tax revenue in each of the following categories:\n(1) improvements to regular route bus service levels;\n(2) improvements related to transit safety, including additional transit officials, as defined under section 473.4075;\n(3) maintenance and improvements to bus accessibility at transit stops and transit centers;\n(4) transit shelter replacement and improvements under section 473.41;\n(5) planning and project development for expansion of arterial bus rapid transit lines;\n(6) operations and capital maintenance of arterial bus rapid transit;\n(7) planning and project development for expansion of highway bus rapid transit and bus guideway lines;\n(8) operations and capital maintenance of highway bus rapid transit and bus guideways;\n(9) zero-emission bus procurement and associated costs in conformance with the zero-emission and electric transit vehicle transition plan under section 473.3927;\n(10) demand response microtransit service provided by the council;\n(11) financial assistance to replacement service providers under section 473.388, to provide for service, vehicle purchases, and capital investments related to demand response microtransit service;\n(12) financial assistance to political subdivisions and tax-exempt organizations under section 501(c)(3) of the Internal Revenue Code for active transportation; and\n(13) wage adjustments for Metro Transit hourly operations employees.\n(a) Sales tax revenue allocated to the Transportation Advisory Board under subdivision 2, clause (1), is for grants to support active transportation within the metropolitan area.\n(b) The Transportation Advisory Board must establish eligibility requirements and a selection process to provide the grant awards. The process must include: solicitation; evaluation and prioritization, including technical review, scoring, and ranking; project selection; and award of funds. To the extent practicable and subject to paragraph (c), the process must align with procedures and requirements established for allocation of other sources of funds.\n(c) The selection process must include criteria and prioritization of projects based on:\n(1) the project's inclusion in a municipal or regional nonmotorized transportation system plan;\n(2) the extent to which policies or practices of the political subdivision encourage and promote complete streets planning, design, and construction;\n(3) the extent to which the project supports connections between communities and to key destinations within a community;\n(4) identified barriers or deficiencies in the nonmotorized transportation system;\n(5) identified safety or health benefits;\n(6) geographic equity in project benefits, with an emphasis on communities that are historically and currently underrepresented in local or regional planning; and\n(7) the ability of a grantee to maintain the active transportation infrastructure following project completion.\n(a) A metropolitan county must use revenue from the regional transportation sales and use tax under section 297A.9915 in conformance with the requirements under section 174.49, subdivision 6.\n(b) By February 15 of each even-numbered year, a metropolitan county must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance on the use of funds received under section 297A.9915. This report must be submitted in conjunction with the report required under section 297A.993, subdivision 2a. At a minimum, the report must include:\n(1) actual sales tax collections allocated to the county over the previous five calendar years;\n(2) an estimation of the total sales tax revenue that is estimated to be allocated to the county in the current year and for the next ten calendar years; and\n(3) for each of the previous five calendar years, the current calendar year, and for the next ten calendar years:\n(i) the amount of sales tax revenue expended or proposed to be expended for each of the allowable uses under section 174.49, subdivision 6;\n(ii) completed, current, planned, and eligible projects or programs for each category under item (i); and\n(iii) an estimated balance of unspent or undesignated regional transportation sales and use tax revenue.\n(a) The council is prohibited from expending sales tax revenue on the Southwest light rail transit (Green Line Extension) project.\n(b) Paragraph (a) expires on the date of expiration of the Metropolitan Governance Task Force as specified under Laws 2023, chapter 68, article 4, section 123, subdivision 11.\n(a) The council must maintain separate financial information on sales tax revenue that includes:\n(1) a summary of annual revenue and expenditures, including but not limited to balances and anticipated revenue in the forecast period under section 16A.103; and\n(2) for active transportation under subdivision 3 and each of the categories specified under subdivision 2 in the most recent prior three fiscal years:\n(i) specification of annual expenditures; and\n(ii) an overview of the projects or services.\n(b) The council must publish the information required under paragraph (a) on the council's website.",
	"repealed": false
}