{
	"id": "273.1325",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1325",
	"title": "273.1325 ADJUSTMENT OF NET TAX CAPACITY.",
	"text": "The Department of Revenue must annually conduct an assessment/sales ratio study of the taxable property in each county, city, town, and school district in accordance with the procedures in subdivisions 2 and 3. Based upon the results of this assessment/sales ratio study, the Department of Revenue must determine an equalized net tax capacity for the various classes of taxable property in each taxing district, the aggregate of which is designated as the adjusted net tax capacity. The adjusted net tax capacity must be reduced by the captured tax capacity of tax increment districts under section 469.177, subdivision 2, fiscal disparities contribution tax capacities under sections 276A.06 and 473F.08, and the tax capacity of transmission lines required to be subtracted from the local tax base under section 273.425; and increased by fiscal disparities distribution tax capacities under sections 276A.06 and 473F.08. The adjusted net tax capacities shall be determined using the net tax capacity percentages in effect for the assessment year following the assessment year of the study. The Department of Revenue must make whatever estimates are necessary to account for changes in the classification system. The Department of Revenue may incur the expense necessary to make the determinations. The commissioner of revenue may reimburse any county or governmental official for requested services performed in ascertaining the adjusted net tax capacity. On or before March 15 annually, the Department of Revenue shall file with the chair of the Tax Committee of the house of representatives and the chair of the Committee on Taxes and Tax laws of the senate a report of adjusted net tax capacities for school districts. On or before June 30 annually, the Department of Revenue shall file its final report on the adjusted net tax capacities for school districts established by the previous year's assessments and the current year's net tax capacity percentages with the commissioner of education and each county auditor for those school districts for which the auditor has the responsibility for determination of local tax rates. A copy of the report so filed shall be mailed to the clerk of each school district involved and to the county assessor or supervisor of assessments of the county or counties in which each school district is located.\nIn making its annual assessment/sales ratio studies, the Department of Revenue must use a methodology consistent with the most recent Standard on Assessment Ratio Studies published by the assessment standards committee of the International Association of Assessing Officers. The commissioner of revenue shall supplement this general methodology with specific procedures necessary for execution of the study in accordance with other Minnesota laws impacting the assessment/sales ratio study. The commissioner shall document these specific procedures in writing and shall publish the procedures in the State Register, but these procedures will not be considered \"rules\" pursuant to the Minnesota Administrative Procedure Act. When property is sold and the purchaser changes its use in a manner that would result in a change of classification of the property, the assessment sales ratio study under this subdivision must take into account that changed classification as soon as practicable. A change in status from homestead to nonhomestead or from nonhomestead to homestead is not a change under this subdivision. For purposes of this section, sections 270.12, subdivision 2, clause (6), and 278.05, subdivision 4, the commissioner of revenue shall exclude from the assessment/sales ratio study the sale of any nonagricultural property which does not contain an improvement, if (1) the statutory basis on which the property's taxable value as most recently assessed is less than market value as defined in section 273.11, or (2) the property has undergone significant physical change or a change of use since the most recent assessment.\nFor purposes of determining the adjusted net tax capacity of agricultural lands for the calculation of adjusted net tax capacities, the market value of agricultural lands must be the price for which the property would sell in an arm's-length transaction.\nThe commissioner of revenue may include forced sales in the assessment/sales ratio studies if it is determined by the commissioner of revenue that these forced sales indicate true market value.\nThe estimated market value to be used in calculating sales ratios must be the value established by the assessor before any stipulations resulting from appeals by property owners and before any abatement unless the abatement was granted for the purpose of correcting mere clerical errors.\nSeparate sales ratios must be calculated for commercial property and for industrial property. These two classes shall be combined only in jurisdictions in which there is not an adequate sample of sales in each class.",
	"repealed": false
}