{
	"id": "147C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/147C.01",
	"title": "147C.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Advisory council\" means the Respiratory Care Advisory Council established under section 147C.35.\n\"Approved education program\" means a university, college, or other postsecondary education program leading to eligibility for registry or certification in respiratory care, that, at the time the student completes the program, is accredited by a national accrediting organization approved by the board.\n\"Board\" means the Board of Medical Practice or its designee.\n\"Contact hour\" means an instructional session of 50 consecutive minutes, excluding coffee breaks, registration, meals without a speaker, and social activities.\n\"Credential\" means a license or other evidence of qualification or authorization to engage in respiratory care practice in this state or any other state.\n\"Credentialing examination\" means an examination administered by the National Board for Respiratory Care, its successor organization, or the Canadian Society for Respiratory Care for credentialing as a respiratory therapist or other title indicating an entry or advanced level respiratory care practitioner.\n\"Equipment maintenance\" includes, but is not limited to, downloading and subsequent reporting of stored compliance and physiological data, adjustments to respiratory equipment based on compliance downloads, protocols, and provider orders specific to noninvasive continuous positive airway pressure, bi-level devices.\n\"Health care facility\" means a hospital as defined in section 144.50, subdivision 2, a medical facility as defined in section 144.561, subdivision 1, paragraph (b), or a nursing home as defined in section 144A.01, subdivision 5, a long-term acute care facility, a subacute care facility, an outpatient clinic, a physician's office, a rehabilitation facility, or a hospice.\n\"Qualified medical direction\" means direction from a licensed physician who is on the staff or is a consultant of a health care facility or home care agency or home medical equipment provider and who has a special interest in and knowledge of the diagnosis and treatment of deficiencies, abnormalities, and diseases of the cardiopulmonary system.\n\"Patient instruction\" includes, but is not limited to, patient education on the care, use, and maintenance of respiratory equipment, patient interface fittings, and adjustments.\n\"Respiratory care\" means the provision of services described under section 147C.05 for the assessment, treatment, education, management, evaluation, and care of patients with deficiencies, abnormalities, and diseases of the cardiopulmonary system, under the supervision of a physician and pursuant to a referral, or a verbal, written, or telecommunicated order from a physician, advanced practice registered nurse, or physician assistant. Respiratory care includes, but is not limited to, education pertaining to health promotion, disease prevention and management, patient care, and treatment.",
	"repealed": false
}