{
	"id": "142A.602",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.602",
	"title": "142A.602 DEFINITIONS.",
	"text": "For the purposes of sections 142A.60 to 142A.612, the terms defined in this section have the meanings given them.\n\"Adoption assistance\" means medical coverage as allowable under section 256B.055 and reimbursement of nonrecurring expenses associated with adoption and may include financial support provided under agreement with the financially responsible agency, the commissioner, and the parents of an adoptive child whose special needs would otherwise make it difficult to place the child for adoption to assist with the cost of caring for the child. Financial support may include a basic rate payment and a supplemental difficulty of care rate.\n\"Assessment\" means the process under section 142A.607 that determines the benefits an eligible child may receive under section 142A.609.\n\"At-risk child\" means a child who does not have a documented disability but who is at risk of developing a physical, mental, emotional, or behavioral disability based on being related within the first or second degree to persons who have an inheritable physical, mental, emotional, or behavioral disabling condition, or from a background which has the potential to cause the child to develop a physical, mental, emotional, or behavioral disability that the child is at risk of developing. The disability must manifest during childhood.\n\"Basic rate\" means the maintenance payment made on behalf of a child to support the costs caregivers incur to provide for a child's needs consistent with the care parents customarily provide, including: food, clothing, shelter, daily supervision, school supplies, and a child's personal incidentals. It also supports typical travel to the child's home for visitation, and reasonable travel for the child to remain in the school in which the child is enrolled at the time of placement.\n\"Caregiver\" means the foster parent or parents of a child in foster care who meet the requirements of emergency relative placement, licensed foster parents under chapter 142B, or foster parents licensed or approved by a tribe; the relative custodian or custodians; or the adoptive parent or parents who have legally adopted a child.\n\"Commissioner\" means the commissioner of children, youth, and families or any employee of the Department of Children, Youth, and Families to whom the commissioner has delegated appropriate authority.\n\"County board\" means the board of county commissioners in each county.\n\"Disability\" means a physical, mental, emotional, or behavioral impairment that substantially limits one or more major life activities. Major life activities include, but are not limited to: thinking, walking, hearing, breathing, working, seeing, speaking, communicating, learning, developing and maintaining healthy relationships, safely caring for oneself, and performing manual tasks. The nature, duration, and severity of the impairment must be considered in determining if the limitation is substantial.\n\"Financially responsible agency\" means the agency that is financially responsible for a child. These agencies include both local social service agencies under section 393.07 and tribal social service agencies authorized in section 142A.03, subdivision 9, as part of the American Indian Child Welfare Initiative, and Minnesota tribes who assume financial responsibility of children from other states. Under Northstar Care for Children, the agency that is financially responsible at the time of placement for foster care continues to be responsible under section 142A.611 for the local share of any maintenance payments, even after finalization of the adoption or transfer of permanent legal and physical custody of a child.\n\"Human Services Board\" means a board established under section 402.02; Laws 1974, chapter 293; or Laws 1976, chapter 340.\n\"Initial assessment\" means the assessment conducted within the first 30 days of a child's initial placement into foster care under section 142A.607, subdivisions 6 and 7.\n\"Legally responsible agency\" means the Minnesota agency that is assigned responsibility for placement, care, and supervision of the child through a court order, voluntary placement agreement, or voluntary relinquishment. These agencies include local social service agencies under section 393.07, tribal social service agencies authorized in section 142A.03, subdivision 9, and Minnesota tribes that assume court jurisdiction when legal responsibility is transferred to the tribal social service agency through a Minnesota district court order. A Minnesota local social service agency is otherwise financially responsible.\n\"Licensed child foster parent\" means an individual or family who is licensed for child foster care under Minnesota Rules, chapter 2960, excluding foster residence settings licensed under Minnesota Rules, parts 2960.3200 to 2960.3230, or licensed or approved by a Minnesota tribe in accordance with tribal standards with whom the foster child resides.\n\"Maintenance payments\" means the basic rate plus any supplemental difficulty of care rate under Northstar Care for Children. It specifically does not include the cost of initial clothing allowance, payment for social services, or administrative payments to a child-placing agency. Payments are paid consistent with section 142A.609.\n\"Northstar kinship assistance\" means medical coverage, as allowable under section 256B.055, and reimbursement of nonrecurring expenses associated with obtaining permanent legal and physical custody of a child, and may include financial support provided under agreement with the financially responsible agency, the commissioner, and the relative who has received a transfer of permanent legal and physical custody of a child. Financial support may include a basic rate payment and a supplemental difficulty of care rate to assist with the cost of caring for the child.\n\"Permanent legal and physical custody\" means: (1) a full transfer of permanent legal and physical custody of a child ordered by a Minnesota juvenile court under section 260C.515, subdivision 4, to a relative who is not the child's parent as defined in section 260C.007, subdivision 25; or (2) for a child under jurisdiction of a tribal court, a judicial determination under a similar provision in tribal code which means that a relative will assume the duty and authority to provide care, control, and protection of a child who is residing in foster care, and to make decisions regarding the child's education, health care, and general welfare until adulthood. To establish eligibility for Northstar kinship assistance, permanent legal and physical custody does not include joint legal custody, joint physical custody, or joint legal and joint physical custody of a child shared by the child's parent and relative custodian.\n\"Reassessment\" means an update of a previous assessment through the process under section 142A.607 for a child who has been continuously eligible for Northstar Care for Children, or when a child identified as an at-risk child (Level A) under adoption assistance has manifested the disability upon which eligibility for the agreement was based according to section 142A.608, subdivision 4, paragraph (b). A reassessment may be used to update an initial assessment, a special assessment, or a previous reassessment.\n\"Relative,\" as described in section 260C.007, subdivision 27, means a person related to the child by blood, marriage, or adoption, or an individual who is an important friend with whom the child has resided or had significant contact. For an Indian child, relative, as described in section 260C.007, subdivision 26b, means a person who is a member of the Indian child's family as defined in the Indian Child Welfare Act of 1978, United States Code, title 25, section 1903, paragraphs (2), (6), and (9).\n\"Relative custodian\" means a person to whom permanent legal and physical custody of a child has been transferred under section 260C.515, subdivision 4, or for a child under jurisdiction of a tribal court, a judicial determination under a similar provision in tribal code, which means that a relative will assume the duty and authority to provide care, control, and protection of a child who is residing in foster care, and to make decisions regarding the child's education, health care, and general welfare until adulthood.\n\"Special assessment\" means an assessment performed under section 142A.607 that determines the benefits that an eligible child may receive under section 142A.609 at the time when a special assessment is required. A special assessment is used when a child's status within Northstar Care is shifted from a pre-Northstar Care program into Northstar Care for Children and when the commissioner determines that a special assessment is appropriate instead of assigning the transition child to a level under section 142A.612.\n\"Supplemental difficulty of care rate\" means the supplemental payment under section 142A.609, if any, as determined by the financially responsible agency or the state, based upon an assessment under section 142A.607. The rate must support activities consistent with the care a parent provides a child with special needs and not the equivalent of a purchased service. The rate must consider the capacity and intensity of the activities associated with parenting duties provided in the home to nurture the child, preserve the child's connections, and support the child's functioning in the home and community.",
	"repealed": false
}