{
	"id": "124E.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.03",
	"title": "124E.03 APPLICABLE LAW.",
	"text": "A charter school is a public school and is part of the state's system of public education. A charter school is exempt from all statutes and rules applicable to a school, school board, or school district unless a statute or rule is made specifically applicable to a charter school or is included in this chapter.\n(a) A charter school shall meet all federal, state, and local health and safety requirements applicable to school districts.\n(b) A school must comply with statewide accountability requirements governing standards and assessments in chapter 120B.\n(c) A charter school must comply with the Minnesota Public School Fee Law, sections 123B.34 to 123B.39.\n(d) A charter school is a district for the purposes of tort liability under chapter 466.\n(e) A charter school must comply with the Pledge of Allegiance requirement under section 121A.11, subdivision 3.\n(f) A charter school and charter school board of directors must comply with chapter 181 governing requirements for employment.\n(g) A charter school must comply with continuing truant notification under section 260A.03.\n(h) A charter school must develop and implement a teacher evaluation and peer review process under section 122A.40, subdivision 8, paragraph (b), clauses (2) to (13), and place students in classrooms in accordance with section 122A.40, subdivision 8, paragraph (d). The teacher evaluation process in this paragraph does not create any additional employment rights for teachers.\n(i) A charter school must adopt a plan, budget, and process, consistent with section 120B.11, to review curriculum, instruction, and student achievement and strive for comprehensive achievement and civic readiness.\n(j) A charter school is subject to and must comply with the Pupil Fair Dismissal Act, sections 121A.40 to 121A.56 and 121A.575, 121A.60, 121A.61, and 121A.65.\nA charter school must comply with sections 125A.02, 125A.03 to 125A.24, 125A.65, and 125A.75 and rules relating to the education of pupils with a disability as though it were a district. A charter school enrolling prekindergarten pupils with a disability under section 124E.11, paragraph (h), must comply with sections 125A.259 to 125A.48 and rules relating to the Interagency Early Intervention System as though it were a school district.\n(a) A charter school must release a student for religious instruction, consistent with section 120A.22, subdivision 12, clause (3).\n(b) A charter school must comply with chapter 363A governing the Minnesota Human Rights Act and section 121A.04 governing student athletics and sex discrimination in schools.\n(c) A charter school must comply with section 121A.031 governing policies on bullying.\n(a) A charter school must comply with chapter 13 governing government data; and sections 121A.75 governing access to juvenile justice records, and 260B.171, subdivisions 3 and 5, governing juvenile justice records.\n(b) A charter school must comply with section 120A.22, subdivision 7, governing the transfer of students' educational records and sections 138.163 and 138.17 governing the management of local records.\nA charter school must comply with chapter 13D governing open meetings.\nA charter school must provide instruction each year for at least the number of hours required by section 120A.41. It may provide instruction throughout the year under sections 124D.12 to 124D.127 or 124D.128 governing learning year programs.\n(a) A charter school offering online courses or programs must comply with section 124D.094 governing online instruction.\n(b) A charter school that provides early childhood health and developmental screening must comply with sections 142D.09 to 142D.093 governing early childhood screening.\n(c) A charter school that provides school-sponsored youth athletic activities must comply with section 121A.38 governing policies on concussions.\nA charter school is subject to and must comply with section 121A.58 as though it were a district.\n(a) A charter school is subject to and must comply with the Education for English Learners Act under sections 124D.58 to 124D.64 as though the charter school were a district.\n(b) A charter school must adopt and review a language access plan under section 123B.32 as though the charter school were a district.\nA charter school board must comply with section 123B.02, subdivision 25.",
	"repealed": false
}