{
	"id": "122A.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.55",
	"title": "122A.55 STAFF EXCHANGE PROGRAM.",
	"text": "A staff exchange program is established to allow local districts to arrange temporary and voluntary exchanges among members of their kindergarten through grade 12 instructional and administrative staffs. The purpose of the program is to provide participants with an understanding of the educational concerns of other local school districts, including concerns of class organization, curriculum development, instructional practices, and characteristics of the student population.\nThe educational needs and interests of the host district and the training, experience, and interests of the participants must determine the assignments of the participants in the host district. Participants may teach courses, provide counseling and tutorial services, work with teachers to better prepare students for future educational experiences, serve an underserved population in the district, or assist with administrative functions. The assignments participants perform for the host district must be comparable to the assignments the participants perform for the district employing the participants. Participation in the exchange program need not be limited to one school or one school district and may involve other education organizations including education districts and SCs.\nAll staff exchanges made under this section are subject to the requirements in this subdivision.\n(a) A school district employing a participating staff member must not adversely affect the staff member's salary, seniority, or other employment benefits, or otherwise penalize the staff member for participating in the program.\n(b) Upon completion or termination of an exchange, a district employing a participating staff member must permit the staff member to return to the same assignment the staff member performed in the district before the exchange, if available, or, if not, a similar assignment.\n(c) A district employing a participating staff member must continue to provide the staff member's salary and other employment benefits during the period of the exchange.\n(d) A participant must be licensed and tenured.\n(e) Participation in the program must be voluntary.\n(f) The length of participation in the program must be no less than one-half of a school year and no more than one school year, and any premature termination of participation must be upon the mutual agreement of the participant and the participating district.\n(g) A participant is responsible for transportation to and from the host district.\n(h) This subdivision does not abrogate or change rights of staff members participating in the staff exchange program or the terms of an agreement between the exclusive representative of the school district employees and the district.\n(i) Participating districts may enter into supplementary agreements with the exclusive representative of the school district employees to accomplish the purpose of this section.\nThe school board of a district must decide by resolution to participate in the staff exchange program. A staff member wishing to participate in the exchange program must submit an application to the school district employing the staff member. The district must, in a timely and appropriate manner, provide to the exclusive bargaining representatives of teachers in the state the number and names of prospective participants within the district, the assignments available within the district, and the length of time for each exchange. The exclusive bargaining representatives are requested to cooperatively participate in the coordination of exchanges to facilitate exchanges across all geographical regions of the state. Prospective participants must contact teachers and districts with whom they are interested in making an exchange. The prospective participants must make all arrangements to accomplish their exchange and the superintendents of the participating districts must approve the arrangements for the exchange in writing.",
	"repealed": false
}