{
	"id": "260B.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.225",
	"title": "260B.225 JUVENILE TRAFFIC OFFENDER; PROCEDURES; DISPOSITIONS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Major traffic offense\" includes any violation of a state or local traffic law, ordinance, or regulation, or a federal, state, or local water traffic law not included within the provisions of paragraph (c).\n(c) \"Adult court traffic offense\" means:\n(1) a petty misdemeanor violation of a state or local traffic law, ordinance, or regulation, or a petty misdemeanor violation of a federal, state, or local water traffic law; or\n(2) a violation of section 169A.20 or any other misdemeanor- or gross misdemeanor-level traffic violation committed as part of the same behavioral incident as a violation of section 169A.20.\nA child who commits a major traffic offense shall be adjudicated a \"juvenile highway traffic offender\" or a \"juvenile water traffic offender,\" as the case may be, and shall not be adjudicated delinquent, unless, as in the case of any other child alleged to be delinquent, a petition is filed in the manner provided in section 260B.141, summons issued, notice given, a hearing held, and the court finds as a further fact that the child is also delinquent within the meaning and purpose of the laws relating to juvenile courts.\nExcept as provided in subdivision 4, a child who commits an adult court traffic offense and at the time of the offense was at least 16 years old shall be subject to the laws and court procedures controlling adult traffic violators and shall not be under the jurisdiction of the juvenile court. When a child is alleged to have committed an adult court traffic offense and is at least 16 years old at the time of the offense, the peace officer making the charge shall follow the arrest procedures prescribed in section 169.91 and shall make reasonable effort to notify the child's parent or guardian of the nature of the charge.\nThe juvenile court has original jurisdiction over:\n(1) all juveniles age 15 and under alleged to have committed any traffic offense; and\n(2) 16- and 17-year-olds alleged to have committed any major traffic offense, except that the adult court has original jurisdiction over:\n(i) petty traffic misdemeanors not a part of the same behavioral incident of a misdemeanor being handled in juvenile court; and\n(ii) violations of section 169A.20 (driving while impaired), and any other misdemeanor or gross misdemeanor level traffic violations committed as part of the same behavioral incident as a violation of section 169A.20.\nWhen a child is alleged to have committed a major traffic offense, the peace officer making the charge shall file a signed copy of the notice to appear, as provided in section 169.91, with the juvenile court of the county in which the violation occurred, and the notice to appear has the effect of a petition and gives the juvenile court jurisdiction. Filing with the court a notice to appear containing the name and address of the child allegedly committing a major traffic offense and specifying the offense charged, the time and place of the alleged violation shall have the effect of a petition and give the juvenile court jurisdiction. Any reputable person having knowledge of a child who commits a major traffic offense may petition the juvenile court in the manner provided in section 260B.141. Whenever a notice to appear or petition is filed alleging that a child is a juvenile highway traffic offender or a juvenile water traffic offender, the court shall summon and notify the persons required to be summoned or notified as provided in sections 260B.151 and 260B.152. However, it is not necessary to (1) notify more than one parent, or (2) publish any notice, or (3) personally serve outside the state.\nBefore making a disposition of any child found to be a juvenile major traffic offender or to have violated a misdemeanor- or gross misdemeanor-level traffic law, the court shall obtain from the department of public safety information of any previous traffic violation by this juvenile. In the case of a juvenile water traffic offender, the court shall obtain from the office where the information is now or hereafter may be kept information of any previous water traffic violation by the juvenile.\nIf after a hearing the court finds that the welfare of a juvenile major traffic offender or a juvenile water traffic offender or the public safety would be better served under the laws controlling adult traffic violators, the court may transfer the case to any court of competent jurisdiction presided over by a salaried judge if there is one in the county. The juvenile court transfers the case by forwarding to the appropriate court the documents in the court's file together with an order to transfer. The court to which the case is transferred shall proceed with the case as if the jurisdiction of the juvenile court had never attached.\n(a) A juvenile who is charged with an adult court traffic offense in district court shall be treated as an adult before trial, except that the juvenile may be held in secure, pretrial custody only in a secure juvenile detention facility.\n(b) A juvenile who is convicted of an adult court traffic offense in district court shall be treated as an adult for sentencing purposes, except that the court may order the juvenile placed out of the home only in a residential treatment facility or in a juvenile correctional facility.\n(c) The disposition of an adult court traffic offender remains with the county in which the adjudication occurred.\nIf the juvenile court finds that the child is a juvenile major highway or water traffic offender, it may make any one or more of the following dispositions of the case:\n(1) reprimand the child and counsel with the child and the parents;\n(2) continue the case for a reasonable period under such conditions governing the child's use and operation of any motor vehicles or boat as the court may set;\n(3) require the child to attend a driver improvement school if one is available within the county;\n(4) recommend to the Department of Public Safety suspension of the child's driver's license as provided in section 171.16;\n(5) if the child is found to have committed two moving highway traffic violations or to have contributed to a highway accident involving death, injury, or physical damage in excess of $100, the court may recommend to the commissioner of public safety or to the licensing authority of another state the cancellation of the child's license until the child reaches the age of 18 years, and the commissioner of public safety is hereby authorized to cancel the license without hearing. At any time before the termination of the period of cancellation, the court may, for good cause, recommend to the commissioner of public safety, or to the licensing authority of another state, that the child's license be returned, and the commissioner of public safety is authorized to return the license;\n(6) place the child under the supervision of a probation officer in the child's own home under conditions prescribed by the court including reasonable rules relating to operation and use of motor vehicles or boats directed to the correction of the child's driving habits;\n(7) if the child is found to have violated a state or local law or ordinance and the violation resulted in damage to the person or property of another, the court may order the child to make reasonable restitution for the damage;\n(8) require the child to pay a fine of up to $1,000. The court shall order payment of the fine in accordance with a time payment schedule which shall not impose an undue financial hardship on the child;\n(9) if the court finds that the child committed an offense described in section 169A.20, the court shall order that a chemical use assessment be conducted and a report submitted to the court in the manner prescribed in section 169A.70. If the assessment concludes that the child meets the level of care criteria for placement under rules adopted under section 254A.03, subdivision 3, the report must recommend a level of care for the child. The court may require that level of care in its disposition order. In addition, the court may require any child ordered to undergo an assessment to pay a chemical dependency assessment charge of $75. The court shall forward the assessment charge to the commissioner of management and budget to be credited to the general fund. The state shall reimburse counties for the total cost of the assessment in the manner provided in section 169A.284.\nThe juvenile court records of juvenile highway traffic offenders and juvenile water traffic offenders shall be kept separate from delinquency matters.",
	"repealed": false
}