{
	"id": "256B.0943",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0943",
	"title": "256B.0943 CHILDREN'S THERAPEUTIC SERVICES AND SUPPORTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Children's therapeutic services and supports\" means the flexible package of mental health services for children who require varying therapeutic and rehabilitative levels of intervention to treat a diagnosed emotional disturbance, as defined in section 245.4871, subdivision 15, or a diagnosed mental illness, as defined in section 245.462, subdivision 20. The services are time-limited interventions that are delivered using various treatment modalities and combinations of services designed to reach treatment outcomes identified in the individual treatment plan.\n(c) \"Clinical trainee\" means a staff person who is qualified according to section 245I.04, subdivision 6.\n(d) \"Crisis planning\" has the meaning given in section 245.4871, subdivision 9a.\n(e) \"Culturally competent provider\" means a provider who understands and can utilize to a client's benefit the client's culture when providing services to the client. A provider may be culturally competent because the provider is of the same cultural or ethnic group as the client or the provider has developed the knowledge and skills through training and experience to provide services to culturally diverse clients.\n(f) \"Day treatment program\" for children means a site-based structured mental health program consisting of psychotherapy for three or more individuals and individual or group skills training provided by a team, under the treatment supervision of a mental health professional.\n(g) \"Direct service time\" means the time that a mental health professional, clinical trainee, mental health practitioner, or mental health behavioral aide spends face-to-face with a client and the client's family or providing covered services through telehealth as defined under section 256B.0625, subdivision 3b. Direct service time includes time in which the provider obtains a client's history, develops a client's treatment plan, records individual treatment outcomes, or provides service components of children's therapeutic services and supports. Direct service time does not include time doing work before and after providing direct services, including scheduling or maintaining clinical records.\n(h) \"Direction of mental health behavioral aide\" means the activities of a mental health professional, clinical trainee, or mental health practitioner in guiding the mental health behavioral aide in providing services to a client. The direction of a mental health behavioral aide must be based on the client's individual treatment plan and meet the requirements in subdivision 6, paragraph (b), clause (7).\n(i) \"Emotional disturbance\" has the meaning given in section 245.4871, subdivision 15.\n(j) \"Individual treatment plan\" means the plan described in section 245I.10, subdivisions 7 and 8.\n(k) \"Mental health behavioral aide services\" means medically necessary one-on-one activities performed by a mental health behavioral aide qualified according to section 245I.04, subdivision 16, to assist a child retain or generalize psychosocial skills as previously trained by a mental health professional, clinical trainee, or mental health practitioner and as described in the child's individual treatment plan and individual behavior plan. Activities involve working directly with the child or child's family as provided in subdivision 9, paragraph (b), clause (4).\n(l) \"Mental health certified family peer specialist\" means a staff person who is qualified according to section 245I.04, subdivision 12.\n(m) \"Mental health practitioner\" means a staff person who is qualified according to section 245I.04, subdivision 4.\n(n) \"Mental health professional\" means a staff person who is qualified according to section 245I.04, subdivision 2.\n(o) \"Mental health service plan development\" includes:\n(1) development and revision of a child's individual treatment plan; and\n(2) administering and reporting standardized outcome measurements approved by the commissioner, as periodically needed to evaluate the effectiveness of treatment.\n(p) \"Mental illness,\" for persons at least age 18 but under age 21, has the meaning given in section 245.462, subdivision 20, paragraph (a).\n(q) \"Psychotherapy\" means the treatment described in section 256B.0671, subdivision 11.\n(r) \"Rehabilitative services\" or \"psychiatric rehabilitation services\" means interventions to: (1) restore a child or adolescent to an age-appropriate developmental trajectory that had been disrupted by a psychiatric illness; or (2) enable the child to self-monitor, compensate for, cope with, counteract, or replace psychosocial skills deficits or maladaptive skills acquired over the course of a psychiatric illness. Psychiatric rehabilitation services for children combine coordinated psychotherapy to address internal psychological, emotional, and intellectual processing deficits, and skills training to restore personal and social functioning. Psychiatric rehabilitation services establish a progressive series of goals with each achievement building upon a prior achievement.\n(s) \"Skills training\" means individual, family, or group training, delivered by or under the supervision of a mental health professional, designed to facilitate the acquisition of psychosocial skills that are medically necessary to rehabilitate the child to an age-appropriate developmental trajectory heretofore disrupted by a psychiatric illness or to enable the child to self-monitor, compensate for, cope with, counteract, or replace skills deficits or maladaptive skills acquired over the course of a psychiatric illness. Skills training is subject to the service delivery requirements under subdivision 9, paragraph (b), clause (2).\n(t) \"Standard diagnostic assessment\" means the assessment described in section 245I.10, subdivision 6.\n(u) \"Treatment supervision\" means the supervision described in section 245I.06.\n[See Note.]\n(a) Subject to federal approval, medical assistance covers medically necessary children's therapeutic services and supports when the services are provided by an eligible provider entity certified under and meeting the standards in this section. The provider entity must make reasonable and good faith efforts to report individual client outcomes to the commissioner, using instruments and protocols approved by the commissioner.\n(b) The service components of children's therapeutic services and supports are:\n(1) patient and/or family psychotherapy, family psychotherapy, psychotherapy for crisis, and group psychotherapy;\n(2) individual, family, or group skills training provided by a mental health professional, clinical trainee, or mental health practitioner;\n(3) crisis planning;\n(4) mental health behavioral aide services;\n(5) direction of a mental health behavioral aide;\n(6) mental health service plan development; and\n(7) children's day treatment.\n(a) A client's eligibility to receive children's therapeutic services and supports under this section shall be determined based on a standard diagnostic assessment by a mental health professional or a clinical trainee that is performed within one year before the initial start of service and updated as required under section 245I.10, subdivision 2. The standard diagnostic assessment must:\n(1) determine whether a child under age 18 has a diagnosis of emotional disturbance or, if the person is between the ages of 18 and 21, whether the person has a mental illness;\n(2) document children's therapeutic services and supports as medically necessary to address an identified disability, functional impairment, and the individual client's needs and goals; and\n(3) be used in the development of the individual treatment plan.\n(b) Notwithstanding paragraph (a), a client may be determined to be eligible for up to five days of day treatment under this section based on a hospital's medical history and presentation examination of the client.\n(c) Children's therapeutic services and supports include development and rehabilitative services that support a child's developmental treatment needs.\n[See Note.]\n(a) The commissioner shall establish an initial provider entity application and certification process and recertification process to determine whether a provider entity has an administrative and clinical infrastructure that meets the requirements in subdivisions 5 and 6. A provider entity must be certified for the three core rehabilitation services of psychotherapy, skills training, and crisis planning. The commissioner shall recertify a provider entity every three years using the individual provider's certification anniversary or the calendar year end, whichever is later. The commissioner may approve a recertification extension, in the interest of sustaining services, when a certain date for recertification is identified. The commissioner shall establish a process for decertification of a provider entity and shall require corrective action, medical assistance repayment, or decertification of a provider entity that no longer meets the requirements in this section or that fails to meet the clinical quality standards or administrative standards provided by the commissioner in the application and certification process.\n(b) The commissioner must provide the following to providers for the certification, recertification, and decertification processes:\n(1) a structured listing of required provider certification criteria;\n(2) a formal written letter with a determination of certification, recertification, or decertification, signed by the commissioner or the appropriate division director; and\n(3) a formal written communication outlining the process for necessary corrective action and follow-up by the commissioner, if applicable.\n(c) For purposes of this section, a provider entity must meet the standards in this section and chapter 245I, as required under section 245I.011, subdivision 5, and be:\n(1) an Indian health services facility or a facility owned and operated by a tribe or tribal organization operating as a 638 facility under Public Law 93-638 certified by the state;\n(2) a county-operated entity certified by the state; or\n(3) a noncounty entity certified by the state.\n[See Note.]\n(a) An eligible provider entity shall demonstrate the availability, by means of employment or contract, of at least one backup mental health professional in the event of the primary mental health professional's absence.\n(b) In addition to the policies and procedures required under section 245I.03, the policies and procedures must include:\n(1) fiscal procedures, including internal fiscal control practices and a process for collecting revenue that is compliant with federal and state laws; and\n(2) a client-specific treatment outcomes measurement system, including baseline measures, to measure a client's progress toward achieving mental health rehabilitation goals.\n(c) A provider entity that uses a restrictive procedure with a client must meet the requirements of section 245.8261.\nThe requirements for background studies under section 245I.011, subdivision 5, paragraph (b), may be met by a children's therapeutic services and supports services agency through the commissioner's NETStudy system as provided under sections 245C.03, subdivision 7, and 245C.10, subdivision 8.\n(a) To be an eligible provider entity under this section, a provider entity must have a clinical infrastructure that utilizes diagnostic assessment, individual treatment plans, service delivery, and individual treatment plan review that are culturally competent, child-centered, and family-driven to achieve maximum benefit for the client. The provider entity must review, and update as necessary, the clinical policies and procedures every three years, must distribute the policies and procedures to staff initially and upon each subsequent update, and must train staff accordingly.\n(b) The clinical infrastructure written policies and procedures must include policies and procedures for meeting the requirements in this subdivision:\n(1) providing or obtaining a client's standard diagnostic assessment, including a standard diagnostic assessment. When required components of the standard diagnostic assessment are not provided in an outside or independent assessment or cannot be attained immediately, the provider entity must determine the missing information within 30 days and amend the child's standard diagnostic assessment or incorporate the information into the child's individual treatment plan;\n(2) developing an individual treatment plan;\n(3) providing treatment supervision plans for staff according to section 245I.06. Treatment supervision does not include the authority to make or terminate court-ordered placements of the child. A treatment supervisor must be available for urgent consultation as required by the individual client's needs or the situation;\n(4) requiring a mental health professional to determine the level of supervision for a behavioral health aide and to document and sign the supervision determination in the behavioral health aide's supervision plan;\n(5) ensuring the immediate accessibility of a mental health professional, clinical trainee, or mental health practitioner to the behavioral aide during service delivery;\n(6) providing service delivery that implements the individual treatment plan and meets the requirements under subdivision 9; and\n(7) individual treatment plan review. The review must determine the extent to which the services have met each of the goals and objectives in the treatment plan. The review must assess the client's progress and ensure that services and treatment goals continue to be necessary and appropriate to the client and the client's family or foster family.\n[See Note.]\n(a) An individual or team provider working within the scope of the provider's practice or qualifications may provide service components of children's therapeutic services and supports that are identified as medically necessary in a client's individual treatment plan.\n(b) An individual provider must be qualified as a:\n(1) mental health professional;\n(2) clinical trainee;\n(3) mental health practitioner;\n(4) mental health certified family peer specialist; or\n(5) mental health behavioral aide.\n(c) A day treatment team must include one mental health professional or clinical trainee.\n[See Note.]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nThe commissioner of human services, in collaboration with children's mental health providers and the Board of Trustees of the Minnesota State Colleges and Universities, shall develop a certificate program for level II mental health behavioral aides.\n[See Note.]\n(a) In delivering services under this section, a certified provider entity must ensure that:\n(1) the provider's caseload size should reasonably enable the provider to play an active role in service planning, monitoring, and delivering services to meet the client's and client's family's needs, as specified in each client's individual treatment plan;\n(2) site-based programs, including day treatment programs, provide staffing and facilities to ensure the client's health, safety, and protection of rights, and that the programs are able to implement each client's individual treatment plan; and\n(3) a day treatment program is provided to a group of clients by a team under the treatment supervision of a mental health professional. The day treatment program must be provided in and by: (i) an outpatient hospital accredited by the Joint Commission on Accreditation of Health Organizations and licensed under sections 144.50 to 144.55; (ii) a community mental health center under section 245.62; or (iii) an entity that is certified under subdivision 4 to operate a program that meets the requirements of section 245.4884, subdivision 2, and Minnesota Rules, parts 9505.0170 to 9505.0475. The day treatment program must stabilize the client's mental health status while developing and improving the client's independent living and socialization skills. The goal of the day treatment program must be to reduce or relieve the effects of mental illness and provide training to enable the client to live in the community. The remainder of the structured treatment program may include patient and/or family or group psychotherapy, and individual or group skills training, if included in the client's individual treatment plan. Day treatment programs are not part of inpatient or residential treatment services. When a day treatment group that meets the minimum group size requirement temporarily falls below the minimum group size because of a member's temporary absence, medical assistance covers a group session conducted for the group members in attendance. A day treatment program may provide fewer than the minimally required hours for a particular child during a billing period in which the child is transitioning into, or out of, the program.\n(b) To be eligible for medical assistance payment, a provider entity must deliver the service components of children's therapeutic services and supports in compliance with the following requirements:\n(1) psychotherapy to address the child's underlying mental health disorder must be documented as part of the child's ongoing treatment. A provider must deliver or arrange for medically necessary psychotherapy unless the child's parent or caregiver chooses not to receive it or the provider determines that psychotherapy is no longer medically necessary. When a provider determines that psychotherapy is no longer medically necessary, the provider must update required documentation, including but not limited to the individual treatment plan, the child's medical record, or other authorizations, to include the determination. When a provider determines that a child needs psychotherapy but psychotherapy cannot be delivered due to a shortage of licensed mental health professionals in the child's community, the provider must document the lack of access in the child's medical record;\n(2) individual, family, or group skills training is subject to the following requirements:\n(i) a mental health professional, clinical trainee, or mental health practitioner shall provide skills training;\n(ii) skills training delivered to a child or the child's family must be targeted to the specific deficits or maladaptations of the child's mental health disorder and must be prescribed in the child's individual treatment plan;\n(iii) group skills training may be provided to multiple recipients who, because of the nature of their emotional, behavioral, or social dysfunction, can derive mutual benefit from interaction in a group setting, which must be staffed as follows:\n(A) one mental health professional, clinical trainee, or mental health practitioner must work with a group of three to eight clients; or\n(B) any combination of two mental health professionals, clinical trainees, or mental health practitioners must work with a group of nine to 12 clients;\n(iv) a mental health professional, clinical trainee, or mental health practitioner must have taught the psychosocial skill before a mental health behavioral aide may practice that skill with the client; and\n(v) for group skills training, when a skills group that meets the minimum group size requirement temporarily falls below the minimum group size because of a group member's temporary absence, the provider may conduct the session for the group members in attendance;\n(3) crisis planning to a child and family must include development of a written plan that anticipates the particular factors specific to the child that may precipitate a psychiatric crisis for the child in the near future. The written plan must document actions that the family should be prepared to take to resolve or stabilize a crisis, such as advance arrangements for direct intervention and support services to the child and the child's family. Crisis planning must include preparing resources designed to address abrupt or substantial changes in the functioning of the child or the child's family when sudden change in behavior or a loss of usual coping mechanisms is observed, or the child begins to present a danger to self or others;\n(4) mental health behavioral aide services must be medically necessary treatment services, identified in the child's individual treatment plan.\nTo be eligible for medical assistance payment, mental health behavioral aide services must be delivered to a child who has been diagnosed with an emotional disturbance or a mental illness, as provided in subdivision 1, paragraph (a). The mental health behavioral aide must document the delivery of services in written progress notes. Progress notes must reflect implementation of the treatment strategies, as performed by the mental health behavioral aide and the child's responses to the treatment strategies; and\n(5) mental health service plan development must be performed in consultation with the child's family and, when appropriate, with other key participants in the child's life by the child's treating mental health professional or clinical trainee or by a mental health practitioner and approved by the treating mental health professional. Treatment plan drafting consists of development, review, and revision by face-to-face or electronic communication. The provider must document events, including the time spent with the family and other key participants in the child's life to approve the individual treatment plan. Medical assistance covers service plan development before completion of the child's individual treatment plan. Service plan development is covered only if a treatment plan is completed for the child. If upon review it is determined that a treatment plan was not completed for the child, the commissioner shall recover the payment for the service plan development.\n[See Note.]\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n(a) A provider entity must document the services it provides under this section. The provider entity must ensure that documentation complies with Minnesota Rules, parts 9505.2175 and 9505.2197. Services billed under this section that are not documented according to this subdivision shall be subject to monetary recovery by the commissioner. Billing for covered service components under subdivision 2, paragraph (b), must not include anything other than direct service time.\n(b) Required documentation must be completed for each individual provider and service modality for each day a child receives a service under subdivision 2, paragraph (b).\n[See Note.]\nThe following services are not eligible for medical assistance payment as children's therapeutic services and supports:\n(1) service components of children's therapeutic services and supports simultaneously provided by more than one provider entity unless prior authorization is obtained;\n(2) treatment by multiple providers within the same agency at the same clock time, unless one service is delivered to the child and the other service is delivered to the child's family or treatment team without the child present;\n(3) children's therapeutic services and supports provided in violation of medical assistance policy in Minnesota Rules, part 9505.0220;\n(4) mental health behavioral aide services provided by a personal care assistant who is not qualified as a mental health behavioral aide and employed by a certified children's therapeutic services and supports provider entity;\n(5) service components of CTSS that are the responsibility of a residential or program license holder, including foster care providers under the terms of a service agreement or administrative rules governing licensure; and\n(6) adjunctive activities that may be offered by a provider entity but are not otherwise covered by medical assistance, including:\n(i) a service that is primarily recreation oriented or that is provided in a setting that is not medically supervised. This includes sports activities, exercise groups, activities such as craft hours, leisure time, social hours, meal or snack time, trips to community activities, and tours;\n(ii) a social or educational service that does not have or cannot reasonably be expected to have a therapeutic outcome related to the client's emotional disturbance;\n(iii) prevention or education programs provided to the community; and\n(iv) treatment for clients with primary diagnoses of alcohol or other drug abuse.\nNotwithstanding subdivision 12, up to 15 hours of children's therapeutic services and supports provided within a six-month period to a child with severe emotional disturbance who is residing in a hospital; a residential treatment facility licensed under Minnesota Rules, parts 2960.0580 to 2960.0690; a psychiatric residential treatment facility under section 256B.0625, subdivision 45a; a regional treatment center; or other institutional group setting or who is participating in a program of partial hospitalization are eligible for medical assistance payment if part of the discharge plan.",
	"repealed": false
}