{
	"id": "116G.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/116G.151",
	"title": "116G.151 REQUIRED ENVIRONMENTAL ASSESSMENT WORKSHEET; FACILITIES IN MISSISSIPPI RIVER AREA.",
	"text": "(a) Until completion of an environmental assessment worksheet that complies with the rules of the Environmental Quality Board and this section, a state or local agency may not issue a permit for construction or operation of a metal materials shredding project with a processing capacity in excess of 20,000 tons per month that would be located in the Mississippi River critical area, as described in section 116G.15, upstream from United States Corps of Engineers Lock and Dam Number One.\n(b) The Pollution Control Agency is the responsible governmental unit for the preparation of an environmental assessment worksheet required under this section.\n(c) In addition to the contents required under law and rule, an environmental assessment worksheet completed under this section must also include the following major categories:\n(1) effects of operation of the project, including vibrations and airborne particulates and dust, on the Mississippi River;\n(2) effects of operation of the project, including vibrations and airborne particulates and dust, on adjacent businesses and on residents and neighborhoods;\n(3) effects of operation of the project on barge and street traffic;\n(4) discussion of alternative sites considered by the project proposer for the proposed project, possible design modifications including site layout, and the magnitude of the project;\n(5) mitigation measures that could eliminate or minimize any adverse environmental effects of the proposed project;\n(6) impact of the proposed project on the housing, park, and recreational use of the river;\n(7) effects of waste and implication of the disposal of waste generated from the proposed project;\n(8) effects on water quality from the project operations, including wastewater generated from operations of the proposed project;\n(9) potential effects from fugitive emissions, fumes, dust, noise, and vibrations from project operations;\n(10) compatibility of the existing operation and proposed operation with other existing uses;\n(11) the report of the expert required by paragraph (g).\n(d) In addition to the publication and distribution provisions relating to environmental assessment worksheets under law and rule, notice of environmental assessment worksheets performed by this section shall also be published in a newspaper of general circulation as well as community newspapers in the affected neighborhoods.\n(e) A public meeting in the affected communities must be held on the environmental assessment worksheet prepared under this section. After the public meeting on the environmental assessment worksheet, there must be an additional 30-day period for review and comment on the environmental assessment worksheet.\n(f) If the Pollution Control Agency determines that information necessary to make a reasonable decision about potential of significant environmental impacts is insufficient, the agency shall make a positive declaration and proceed with an environmental impact statement.\n(g) The Pollution Control Agency shall retain an expert in the field of toxicology who is capable of properly analyzing the potential effects and content of any airborne particulates, fugitive emissions, and dust that could be produced by a metal materials shredding project. The Pollution Control Agency shall obtain any existing reports or documents from a governmental entity or project proposer that analyzes or evaluates the potential hazards of airborne particulates, fugitive emissions, or dust from the construction or operation of a metal materials shredding project in preparing the environmental assessment worksheet. The agency and the expert shall prepare, as part of the report, a risk assessment of the types of metals permitted to be shredded as compared to the types of materials that are likely to be processed at the facility. In performing the risk assessment, the agency and the expert must consider any actual experience at similar facilities. The report must be included as part of the environmental assessment worksheet.\n(h) If the Pollution Control Agency determines that under the rules of the Environmental Quality Board an environmental impact statement should be prepared, the Pollution Control Agency shall be the responsible governmental unit for preparation of the environmental impact statement.",
	"repealed": false
}