{
	"id": "169.685",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.685",
	"title": "169.685 SEAT BELT; PASSENGER RESTRAINT SYSTEM FOR CHILDREN.",
	"text": "After January 1, 1964, all new motor vehicles, not exempt from Minnesota license fees, other than a bus, school bus, motorcycle, motorized bicycle, farm tractor, road tractor, and truck, sold or offered for sale or registered in Minnesota shall be equipped to permit the installation of seat belts in the front seat thereof.\nWithin 30 days after the registration of such motor vehicle, it shall be equipped with seat belts installed for use in the left front and right front seats thereof.\nThe specifications and requirements for seat belts or seat belt assemblies shall conform with the minimum standards for seat belts or seat belt assemblies heretofore adopted by the Society of Automotive Engineers and in effect on January 1, 1963.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Booster seat\" means a child passenger restraint system that meets applicable federal motor vehicle safety standards and is designed to provide belt-positioning that elevates a child to be properly seated with a safety belt.\n(c) \"Child passenger restraint system\" means a device that:\n(1) meets applicable federal motor vehicle safety standards of the United States Department of Transportation and complies with any other applicable federal regulations;\n(2) is designed to restrain, seat, or position children; and\n(3) is appropriate to the age of the child being restrained.\nChild passenger restraint system includes a booster seat.\n(d) \"Properly restrained\" means restrained or secured according to the instructions of both the motor vehicle manufacturer and the child passenger restraint system manufacturer.\n(e) \"Secured with a safety belt\" means restrained or secured by a seat belt that (1) meets applicable federal motor vehicle safety standards, and (2) is properly adjusted and fastened, including both the shoulder and lap straps when equipped in the vehicle.\n(a) Except as provided in paragraph (b), proof of the use or failure to use seat belts or a child passenger restraint system as described in subdivision 4a, or proof of the installation or failure of installation of seat belts or a child passenger restraint system as described in subdivision 4a is not admissible in evidence in any litigation involving personal injuries or property damage resulting from the use or operation of any motor vehicle.\n(b) Paragraph (a) does not affect the right of a person to bring an action for damages arising out of an incident that involves a defectively designed, manufactured, installed, or operating seat belt or child passenger restraint system. Paragraph (a) does not prohibit the introduction of evidence pertaining to the use of a seat belt or child passenger restraint system in an action described in this paragraph.\n(a) Except as provided in paragraph (c), every driver in this state who transports a child or children under the age of 18 years in a motor vehicle that is in motion or a part of traffic and is required under federal motor vehicle safety standards to be equipped with a safety belt or lower anchors and tethers for children in a passenger seating position must have the child or children secured as follows:\n(1) a child who is younger than two years of age must be properly restrained in a rear-facing child passenger restraint system with an internal harness, until the child reaches the weight or height limit of the child passenger restraint system;\n(2) a child who is at least two years of age and exceeds the rear-facing weight or height limit of the child passenger restraint system must be properly restrained in a forward-facing child passenger restraint system with an internal harness, until the child reaches the weight or height limit of the child passenger restraint system;\n(3) a child who is at least four years of age and exceeds the weight or height limit of the forward-facing child passenger restraint system must be properly restrained in a booster seat and secured with a safety belt;\n(4) a child who is at least nine years of age or exceeds the weight or height limit of the child passenger restraint system or the booster seat must be secured with a safety belt adjusted and fastened around the child's body to fit correctly. The safety belt fits correctly when the child sits all the way back against the vehicle seat, the child's knees bend over the edge of the vehicle seat, the lap strap fits snugly across the child's thighs and lower hips and not the child's abdomen, and the shoulder strap snugly crosses the center of the child's chest and not the child's neck;\n(5) a child who is younger than 13 years of age must be transported in the rear seat of a motor vehicle, when available, and must be properly restrained in a child passenger restraint system or booster seat or secured with a safety belt; and\n(6) a child who, because of age or weight, can be placed in more than one category under this paragraph must be placed in the more protective category, where clause (1) provides for the most protective and clause (5) provides for the least protective.\n(b) The driver of a motor vehicle transporting a child who is younger than six years of age or weighs less than 60 pounds must transport the child in a rear seat if:\n(1) the vehicle is equipped with a passenger side air bag supplemental restraint system;\n(2) the air bag system is activated; and\n(3) a rear seat is available.\n(c) When the number of children in the motor vehicle under 13 years of age exceeds the number of age- or size-appropriate child passenger restraint systems and safety belts available in the motor vehicle, the unrestrained children must be seated in a rear seat, if rear seats are available.\n(d) The weight and height limits of a child passenger restraint system under this subdivision are as established by the child passenger restraint system manufacturer.\n(a) Any motor vehicle operator who violates subdivision 4a is guilty of a petty misdemeanor and may be sentenced to pay a fine of not more than $50. The fine may be waived or the amount reduced if the motor vehicle operator produces evidence that within 14 days after the date of the violation a child passenger restraint system meeting federal motor vehicle safety standards was purchased or obtained for the exclusive use of the operator.\n(b) At the time of issuance of a citation under this subdivision, a peace officer may provide to the violator information on obtaining a free or low-cost child passenger restraint system.\n(c) The fines collected for violations of this subdivision must be deposited in the Minnesota child passenger restraint and education account.\n(a) This section does not apply to:\n(1) a person transporting a child in an emergency medical vehicle while in the performance of official duties and when the physical or medical needs of the child make the use of a child passenger restraint system unreasonable or when a child passenger restraint system is not available;\n(2) a peace officer transporting a child while in the performance of official duties and when a child passenger restraint system is not available, provided that a seat belt must be substituted;\n(3) a person while operating a motor vehicle for hire, including a taxi, airport limousine, and bus, but excluding a rented, leased, or borrowed motor vehicle; and\n(4) a person while operating a school bus that has a gross vehicle weight rating of greater than 10,000 pounds.\n(b) A child passenger restraint system is not required for a child who cannot, in the judgment of a licensed physician, be safely transported in a child passenger restraint system because of a medical condition, body size, or physical disability. A motor vehicle operator claiming exemption for a child under this paragraph must possess a typewritten statement from the physician stating that the child cannot be safely transported in a child passenger restraint system. The statement must give the name and birth date of the child, be dated within the previous six months, and be made on the physician's letterhead or contain the physician's name, address, and telephone number. A person charged with violating subdivision 5 may not be convicted if the person produces the physician's statement in court or in the office of the arresting officer.\n(c) A person offering a motor vehicle for rent or lease shall provide a child passenger restraint device to a customer renting or leasing the motor vehicle who requests the device. A reasonable rent or fee may be charged for use of the child passenger restraint device.\nThe Minnesota child passenger restraint and education account is created in the special revenue fund, consisting of fines collected under subdivision 5 and other money appropriated or donated. The money in the account is annually appropriated to the commissioner of public safety to be used to provide child passenger restraint systems to families in financial need, school districts and child care providers that provide for the transportation of pupils to and from school using type III vehicles or school buses with a gross vehicle weight rating of 10,000 pounds or less, and to provide an educational program on the need for and proper use of child passenger restraint systems. Information on the commissioner's activities and expenditure of funds under this section must be available upon request.",
	"repealed": false
}