{
	"id": "118A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/118A.04",
	"title": "118A.04 INVESTMENTS.",
	"text": "Any public funds, not presently needed for other purposes or restricted for other purposes, may be invested in the manner and subject to the conditions provided for in this section.\nPublic funds may be invested in governmental bonds, notes, bills, mortgages (excluding high-risk mortgage-backed securities), and other securities, which are direct obligations or are guaranteed or insured issues of the United States, its agencies, its instrumentalities, or organizations created by an act of Congress.\nFunds may be invested in the following:\n(1) any security which is a general obligation of any state or local government with taxing powers which is rated \"A\" or better by a national bond rating service;\n(2) any security which is a revenue obligation of any state or local government which is rated \"AA\" or better by a national bond rating service;\n(3) a general obligation of the Minnesota housing finance agency which is a moral obligation of the state of Minnesota and is rated \"A\" or better by a national bond rating agency; and\n(4) any security which is an obligation of a school district with an original maturity not exceeding 13 months and (i) rated in the highest category by a national bond rating service or (ii) enrolled in the credit enhancement program pursuant to section 126C.55.\nFunds may be invested in commercial paper issued by United States corporations or their Canadian subsidiaries that is rated in the highest quality category by at least two nationally recognized rating agencies and matures in 270 days or less.\nFunds may be invested in time deposits that are fully insured by the Federal Deposit Insurance Corporation, the National Credit Union Administration, or bankers acceptances of United States banks.\nFor the purposes of this section and section 118A.05, \"high-risk mortgage-backed securities\" are:\n(1) interest-only or principal-only mortgage-backed securities; and\n(2) any mortgage derivative security that:\n(i) has an expected average life greater than ten years;\n(ii) has an expected average life that:\n(A) will extend by more than four years as the result of an immediate and sustained parallel shift in the yield curve of plus 300 basis points; or\n(B) will shorten by more than six years as the result of an immediate and sustained parallel shift in the yield curve of minus 300 basis points; or\n(iii) will have an estimated change in price of more than 17 percent as the result of an immediate and sustained parallel shift in the yield curve of plus or minus 300 basis points.\nFunds may be invested in general obligation temporary bonds of the same government entity issued under section 429.091, subdivision 7, 469.178, subdivision 5, or 475.61, subdivision 6.\nFunds held in a debt service fund may be used to purchase any obligation, whether general or special, of an issue which is payable from the fund, at such price, which may include a premium, as shall be agreed to by the holder, or may be used to redeem any obligation of such an issue prior to maturity in accordance with its terms. The securities representing any such investment may be sold by the government entity at any time, but the money so received remains part of the fund until used for the purpose for which the fund was created. Any obligation held in a debt service fund from which it is payable may be canceled at any time unless otherwise provided in a resolution or other instrument securing obligations payable from the fund.\n(a) For the purpose of this section and section 118A.05, the term \"broker\" means a broker-dealer, broker, or agent of a government entity, who transfers, purchases, sells, or obtains securities for, or on behalf of, a government entity.\n(b) Prior to completing an initial transaction with a broker, a government entity shall provide annually to the broker a written statement of investment restrictions which shall include a provision that all future investments are to be made in accordance with Minnesota Statutes governing the investment of public funds.\n(c) A broker must acknowledge annually receipt of the statement of investment restrictions in writing and agree to handle the government entity's account in accordance with these restrictions. A government entity may not enter into a transaction with a broker until the broker has provided this written agreement to the government entity.\n(d) The state auditor shall prepare uniform notification forms which shall be used by the government entities and the brokers to meet the requirements of this subdivision.",
	"repealed": false
}