{
	"id": "325F.6945",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.6945",
	"title": "325F.6945 INTERNET SERVICE PROVIDERS; PROHIBITED ACTIONS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Broadband Internet access service\" means:\n(1) a mass-market retail service by wire or radio that provides the capability, including any capability that is incidental to and enables the operation of the communications service, to transmit data to and receive data from all or substantially all Internet endpoints;\n(2) any service that provides a functional equivalent of the service described in clause (1); or\n(3) any service that is used to evade the protections established under this section.\nBroadband Internet access service includes a service that serves end users at fixed endpoints using stationary equipment or end users using mobile stations, but does not include dial-up Internet access service.\n(c) \"Edge provider\" means any person or entity that provides:\n(1) any content, application, or service over the Internet; or\n(2) a device used to access any content, application, or service over the Internet.\nEdge provider does not include a person or entity providing obscene material, as defined in section 617.241.\n(d) \"Impairing or degrading lawful Internet traffic on the basis of Internet content, application, or service, or use of a nonharmful device\" means impairing or degrading any of the following:\n(1) particular content, applications, or services;\n(2) particular classes of content, applications, or services;\n(3) lawful Internet traffic to particular nonharmful devices; or\n(4) lawful Internet traffic to particular classes of nonharmful devices.\nImpairing or degrading lawful Internet traffic on the basis of Internet content, application, or service, or use of a nonharmful device includes, without limitation, differentiating positively or negatively between any of the following:\n(i) particular content, applications, or services;\n(ii) particular classes of content, applications, or services;\n(iii) lawful Internet traffic to particular nonharmful devices; or\n(iv) lawful Internet traffic to particular classes of nonharmful devices.\n(e) \"Internet service provider\" means a business that provides broadband Internet access service to a customer in Minnesota.\n(f) \"Paid prioritization\" means the management of an Internet service provider's network to directly or indirectly favor some traffic over other traffic:\n(1) in exchange for monetary or other consideration from a third party; or\n(2) to benefit an affiliated entity.\n(g) \"Reasonable network management\" means a network management practice that has a primarily technical network-management justification, but does not include other business practices, which is reasonable if the practice is primarily used for and tailored to achieving a legitimate network-management purpose, taking into account the particular network architecture and technology of the broadband Internet access service.\n(h) \"Zero-rating\" means exempting some Internet traffic from a customer's data usage allowance.\nAn Internet service provider is prohibited from engaging in any of the following activities with respect to any of the Internet service provider's Minnesota customers:\n(1) subject to reasonable network management, blocking lawful content, applications, services, or nonharmful devices;\n(2) subject to reasonable network management, impairing, impeding, or degrading lawful Internet traffic on the basis of (i) Internet content, application, or service, or (ii) use of a nonharmful device;\n(3) engaging in paid prioritization;\n(4) unreasonably interfering with or unreasonably disadvantaging:\n(i) a customer's ability to select, access, and use broadband Internet service or lawful Internet content, applications, services, or devices of the customer's choice; or\n(ii) an edge provider's ability to provide lawful Internet content, applications, services, or devices to a customer.\nReasonable network management is not a violation of this clause;\n(5) engaging in deceptive or misleading marketing practices that misrepresent the treatment of Internet traffic or content;\n(6) engaging in zero-rating in exchange for consideration, monetary or otherwise, from a third party; or\n(7) zero-rating some Internet content, applications, services, or devices in a category of Internet content, applications, services, or devices, but not the entire category.\nThis section does not apply to software or applications sponsored by the federal government, a state government, or a federally recognized Tribal government when the Internet service provider allows an advantage to customers for free or improved access, or data for access to government services and programs.\nThis section does not: (1) supersede any obligation or authorization an Internet service provider may have to address the needs of emergency communications or law enforcement, public safety, or national security authorities, consistent with or as permitted by applicable law; or (2) limit the provider's ability to meet, address, or comply with the needs identified in clause (1).\nA violation of subdivision 2 may be enforced by the commissioner of commerce under section 45.027. The venue for enforcement proceedings is Ramsey County.",
	"repealed": false
}