{
	"id": "508A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.35",
	"title": "508A.35 FORMS OF CPT.",
	"text": "The CPT shall contain the name and residence of the owner, a description of the land and of the estate of the owner, and shall by memorial contain a description of all encumbrances, liens, and interests to which the estate of the owner is subject. In case the land is held in trust or subject to any condition or limitation, it shall state the nature and character of it. It shall be in substantially the following form:\nCERTIFICATE OF POSSESSORY TITLE (CPT)\nFirst Certificate of Possessory Title, pursuant to the Directive of the Examiner of Titles, County of ..........., and State of Minnesota, date .................., .....\nRegistration of Possessory Title\nThis is to certify that ........................, whose address is .................. in the ........... of ................ and State of ......................, is now the owner of a fee simple estate of and in the following described land situated in the county of ....... and state of Minnesota, ........................................ Subject to the encumbrances, liens, and interests noted by the memorial underwritten or endorsed hereon; and subject to the following rights or encumbrances subsisting, namely:\n(1) Liens, claims, or rights arising under the laws or the Constitution of the United States, which the statutes of this state cannot require to appear of record;\n(2) Any real property tax or special assessment;\n(3) Any lease for a period not exceeding three years, when there is actual occupation of the premises under the lease;\n(4) All rights in public highways upon the land;\n(5) The rights of any person in possession under deed or contract for deed from the owner of the CPT;\n(6) Any claims that may be made pursuant to section 508A.17 within five years from the date of the first CPT; and\n(7) Any outstanding mechanics lien rights which may exist under sections 514.01 to 514.17.\nIn witness whereof, I have hereunto subscribed my name and affixed the seal of my office, this ............ day of ...................., .....\nAll CPTs issued subsequent to the first shall be in like form except that they shall be entitled \"Transfer from number (here give the number of the next previous CPT relating to the same land),\" and shall also contain the words \"Originally registered (date, volume, and page of registration).\"\nCPTs shall be indexed and maintained in the same manner as provided for certificates of title under chapter 508.",
	"repealed": false
}