{
	"id": "325G.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.08",
	"title": "325G.08 WRITING REQUIRED; NOTICE OF RIGHT TO CANCEL; NOTICE OF CANCELLATION.",
	"text": "In a home solicitation sale, at the time the sale occurs, the seller shall:\n(a) inform the buyer orally of the right to cancel;\n(b) furnish the buyer with a fully completed receipt or copy of a contract pertaining to the sale which shows the date of the transaction, contains the name and address of the seller, and in immediate proximity to the space reserved in the contract for the signature of the buyer or on the front page of the receipt if a contract is not used and in boldface type of a minimum size of ten points, a statement in substantially the following form:\n\"You, the buyer, may cancel this purchase at any time prior to midnight of the third business day after the date of this purchase. See attached notice of cancellation form for an explanation of this right.\"; and\n(c) furnish each buyer a fully completed form in duplicate, captioned, \"NOTICE OF CANCELLATION,\" which shall be attached to the contract or receipt and easily detachable, and which shall contain in boldface type of a minimum size of ten points the following information and statements:\nIf you do not want the goods or services described above, you may cancel your purchase by mailing or delivering a signed and dated copy of this cancellation notice or any other written notice, or send a telegram to (Name of seller), at (Address of Seller's Place of Business) not later than midnight of (Date). If you cancel, any payments made by you under the contract or sale, any property traded in, and any instrument executed by you will be returned within ten business days following receipt by the seller of your cancellation notice, and any security interest arising out of the transaction will be canceled.\nIf you cancel, you must make available to the seller at your residence, in substantially as good condition as when received, any goods delivered to you under this contract or sale; or you may, if you wish, comply with the written instructions of the seller regarding the return shipment of the goods at the seller's expense and risk.\nIf the seller does not pick up the goods within 20 days of the date of your notice of cancellation, you may retain or dispose of them without any further obligation.\nIn lieu of the notice of cancellation required by subdivision 1, the seller may provide a notice which conforms to applicable federal law or regulation so long as it provides the information required by subdivision 1. Until the seller has complied with this section the buyer may cancel the home solicitation sale by notifying the seller in any manner and by any means of the intention to cancel.",
	"repealed": false
}