{
	"id": "3.302",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.302",
	"title": "3.302 LEGISLATIVE REFERENCE LIBRARY.",
	"text": "A Legislative Reference Library is established under the control of the Legislative Coordinating Commission.\nThe library shall collect, index, and make available in suitable form information relative to governmental and legislative subjects which will aid members of the legislature to perform their duties in an efficient and economical manner. It shall maintain an adequate collection of public documents of Minnesota and other states. It may enter into loan agreements with other libraries.\nThe library is a depository of all documents published by the state and shall receive them automatically without cost to the legislature or library. As used in this chapter, \"document\" includes any publication issued by the state, constitutional officers, departments, commissions, councils, bureaus, research centers, societies, task forces, including advisory task forces created under section 15.014 or 15.0593, or other agencies supported by state funds, or any publication prepared for the state by private individuals or organizations considered to be of interest or value to the library. Intraoffice or interoffice memos and forms and information concerning only the internal operation of an agency are not included.\nFor all documents deposited under subdivision 3, the library shall require that the issuing agency supply proper bibliographic identification. The identification shall appear on the title page of each volume and include a complete title, a statement of authorship, the name of the publisher, and the date and place of publication. If possible the document shall be consecutively paged. The issuing agency shall include a statement citing the statute or session law with which the report complies, if there is one.\nThe library may use its collection to prepare studies and reports to provide pertinent information about subjects of concern to members of the legislature. It may publish the studies and reports.",
	"repealed": false
}