{
	"id": "103E.325",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.325",
	"title": "103E.325 FINAL HEARING NOTICE.",
	"text": "Promptly after the filing of the viewers' report and the commissioner's final advisory report, the drainage authority after consulting with the auditor shall set a time and location for the final hearing on the petition, the detailed survey report, and the viewers' report. The hearing must be set 25 to 50 days after the date of the final hearing notice.\n(a) The final hearing notice must state:\n(1) that the petition is pending;\n(2) that the detailed survey report is filed;\n(3) that the viewers' report is filed;\n(4) the time and place set for the final hearing;\n(5) a brief description of the proposed drainage project and affected drainage system, giving in general terms the starting point, terminus, and general course of the main ditch and branches;\n(6) a description of property benefited and damaged, and the names of the owners of the property; and\n(7) the municipal and other corporations affected by the proposed drainage project as shown by the detailed survey report and viewers' report.\n(b) Names may be listed in a narrative form and property affected may be separately listed in narrative form by governmental sections or otherwise.\n(c) For a joint county proceeding, separate notice may be prepared for each county affected, showing the portion of the proposed drainage project and the names and descriptions of affected property in the county.\nThe auditor shall notify the drainage authority, auditors of affected counties, and all interested persons of the time and location of the final hearing by publication, posting, and mail. A printed copy of the final hearing notice for each affected county must be posted at least three weeks before the date of the final hearing at the front door of the courthouse in each county. Within one week after the first publication of the notice, the auditor shall give notice by mail of the time and location of the final hearing to the commissioner, all property owners, and others affected by the proposed drainage project and listed in the detailed survey report and the viewers' report.\nIf the final hearing notice is not given or is not legally given, the auditor shall properly publish, post, and mail the notice or provide the notice under the provisions to cure defective notice in section 103E.035.",
	"repealed": false
}