{
	"id": "103D.311",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.311",
	"title": "103D.311 APPOINTING MANAGERS.",
	"text": "A person may not be appointed as a manager who:\n(1) is not a voting resident of the watershed district; and\n(2) is a public officer of the county, state, or federal government, except that a soil and water conservation supervisor may be a manager.\n(a) At least 30 days before the terms of office of the first managers named by the board expire, the county commissioners of each county responsible for appointing a manager to the watershed district must meet and appoint successors.\n(b) The county commissioners must meet at least 30 days before the term of office of any manager expires and appoint a successor.\n(c) A vacancy occurring in an office of a manager must be filled by the appointing county board.\n(d) Appointing county boards shall provide public notice before making appointments. Published notice must be given at least once by publication in a newspaper of general circulation in the watershed district at least 15 days before an appointment or reappointment is made. The notice must state that persons interested in being appointed to serve as a watershed district manager may submit their names to the county board for consideration.\n(a) If the establishment petition that initiated the watershed district originated from a majority of the cities within the watershed district, the county commissioners must appoint the managers from a list of persons nominated by one or more of the townships and municipalities located within the watershed district. If the district is wholly within the metropolitan area, the county commissioners shall appoint the managers from a list of persons nominated jointly or severally by the towns and municipalities within the district. The list must contain at least three nominees for each manager's position to be filled. The list must be submitted to the county boards affected by the watershed district at least 60 days before the manager's term of office expires. The county commissioners may appoint any managers from towns and municipalities that fail to submit a list of nominees.\n(b) If the list is not submitted 60 days before the managers' terms of office expire, the county commissioners must appoint the managers from eligible persons residing in the watershed district.\n(c) Managers of a watershed district entirely within the metropolitan area must be appointed to fairly represent the various hydrologic areas within the watershed district by residence of the manager appointed.\nA record of all appointments made under this section must be filed with the county auditor of each county affected by the watershed district, the secretary or administrator of the board of managers, and the Board of Water and Soil Resources.",
	"repealed": false
}