{
	"id": "79.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.61",
	"title": "79.61 DATA SERVICE ORGANIZATIONS; REQUIRED AND PERMITTED ACTIVITY.",
	"text": "(a) Any data service organization shall perform the following activities:\n(1) file statistical plans, including classification definitions, amendments to the plans, and definitions, with the commissioner for approval, and assign each compensation risk written by its members to its approved classification for reporting purposes;\n(2) establish requirements for data reporting and monitoring methods to maintain a high quality database;\n(3) prepare and distribute a periodic report, in a form prescribed by the commissioner, on ratemaking including but not limited to the following elements:\n(i) losses developed to their ultimate level;\n(ii) trended losses;\n(iii) loss adjustment expenses;\n(iv) pure premium relativities for the approved classification system for which data are reported, provided that the relativities for insureds engaged in similar occupations and presenting substantially similar risks shall, if different, differ by at least ten percent; and\n(v) an evaluation of the effects of changes in law on loss data;\n(4) collect, compile, summarize, and distribute data from members or other sources pursuant to a statistical plan approved by the commissioner;\n(5) prepare merit rating plan and calculate any variable factors necessary for utilization of the plan. Such a plan may be used by any of its members, at the option of the member provided that the application of a plan shall not result in rates that are unfairly discriminatory;\n(6) provide loss data specific to an insured to the insured at a reasonable cost;\n(7) distribute information to an insured or interested party that is filed with the commissioner and is open to public inspection; and\n(8) assess its members for operating expenses on a fair and equitable basis.\n(b) The report under paragraph (a), clause (3), shall also include explicit discussion and explanation of methodology, alternatives examined, assumptions adopted, and areas of judgment and reasoning supporting judgments entered into, and the effect of various combinations of these elements on indications for modification of an overall pure premium rate level change. The pure premium relativities and rate level indications shall not include a loading for expenses or profit and no expense or profit data or recommendations relating to expense or profit shall be included in the report or collected by a data service organization. For purposes of this subdivision, \"expenses\" means expenses other than loss adjustment expenses.\nIn addition to any other activities not prohibited by this chapter, any data service organization may:\n(1) collect and analyze data in order to investigate, identify, and classify information relating to causes or prevention of losses;\n(2) make inspections for the sole purpose of reporting and maintaining data quality;\n(3) contract with another data service organization to fulfill any of the above requirements; and\n(4) prepare and file with the commissioner a rating plan for use by any of its members, provided that no member may be required to use any part of the plan.",
	"repealed": false
}