{
	"id": "13.871",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.871",
	"title": "13.871 CRIMINAL JUSTICE DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside this chapter. Those sections classify criminal justice data as other than public, place restrictions on access to government data, or involve data sharing.\nCertain mental health data received by law enforcement from health care providers is classified under section 144.294, subdivision 2.\nData on certain convictions for controlled substances offenses may be expunged under section 152.18, subdivision 3.\n(a) Sources of presentence investigation reports. Disclosure of confidential sources in presentence investigation reports is governed by section 609.115, subdivision 4.\n(b) Domestic abuse investigation report. Data contained in domestic abuse investigation reports are classified under section 609.2244.\n(c) Use of motor vehicle to patronize prostitutes. Use of a motor vehicle in the commission of an offense under section 609.324 is noted on the offender's driving records and the notation is classified pursuant to section 609.324, subdivision 5.\n(d) Sex offender assessment. Assessor access to data relevant to sex offender assessments is governed under section 609.3457.\n(e) Sexual assault crime victims. Data on sexual assault victims are governed by section 609.3471.\n(f) Data for assessment of offenders. Access to data for the purpose of a mental health assessment of an offender convicted of harassment or stalking is governed by section 609.749, subdivision 6.\n(a) Disclosure of financial information. Disclosure of financial information provided by a defendant seeking public defender services is governed by section 611.17.\n(b) Criminal justice data. Access to the criminal justice data network is governed by section 611.272.\n(a) Crime victim notice of release. Data on crime victims who request notice of an offender's release are classified under section 611A.06.\n(b) Sex offender HIV tests. Results of HIV tests of sex offenders under section 611A.19, subdivision 2, are classified under that section.\n(c) Battered women. Data on battered women maintained by grantees for emergency shelter and support services for battered women are governed by section 611A.32, subdivision 5.\n(d) Victims of domestic abuse. Data on battered women and victims of domestic abuse maintained by grantees and recipients of per diem payments for emergency shelter for battered women and support services for battered women and victims of domestic abuse are governed by sections 611A.32, subdivision 5, and 611A.371, subdivision 3.\n(e) Personal history; internal auditing. Certain personal history and internal auditing data is classified by section 611A.46.\n(f) Crime victim claims for reimbursement. Claims and supporting documents filed by crime victims seeking reimbursement are classified under section 611A.57, subdivision 6.\n(g) Crime Victim Oversight Act. Data maintained by the commissioner of public safety under the Crime Victim Oversight Act are classified under section 611A.74, subdivision 2.\n(h) Victim identity data. Data relating to the identity of the victims of certain criminal sexual conduct is governed by section 609.3471.\n(i) Victim notification. Data on victims requesting a notice of release of an arrested or detained person are classified under sections 629.72 and 629.73.\n(j) Immigration status certification. Disclosure of the immigration status of a crime victim and the classification of that data is governed by section 611A.95, subdivision 4.\n(a) Reports of gunshot wounds. Disclosure of the name of a person making a report under section 626.52, subdivision 2, is governed by section 626.53.\n(b) Child abuse report records. Data contained in child abuse report records are classified under chapter 260E.\n(c) Interstate data exchange. Disclosure of child abuse reports to agencies of another state is classified under section 260E.35, subdivision 3, paragraphs (b) and (c).\n(d) Release to family court services. Release of child abuse data to a court services agency is authorized under section 260E.35, subdivision 3, paragraphs (d) and (e).\n(e) Release of data to mandated reporters. Release of child abuse data to mandated reporters who have an ongoing responsibility for the health, education, or welfare of a child affected by the data is authorized under section 260E.35, subdivision 4.\n(f) Release of child abuse assessment or investigative records to other counties. Release of child abuse investigative records to local welfare agencies is authorized under section 260E.35, subdivision 3, paragraph (f).\n(g) Classifying and sharing records and reports of child abuse. The classification of child abuse data and the sharing of records and reports of child abuse by and between local welfare agencies and law enforcement agencies are governed under sections 260E.21, subdivision 1, and 260E.35.\n(h) Disclosure of information not required in certain cases. Disclosure of certain data obtained from interviewing a minor is governed by section 260E.35, subdivision 8.\n(i) Data received from law enforcement. Classifying child abuse data received by certain agencies from law enforcement agencies is governed under section 260E.35, subdivision 3, paragraph (p).\n(j) Disclosure in child fatality cases. Disclosure of information relating to a child fatality is governed under section 260E.35, subdivision 7.\n(k) Reports of prenatal exposure to controlled substances. Data on persons making reports under section 260E.31 are classified under section 260E.35, subdivision 3.\n(l) Vulnerable adult report records. Data contained in vulnerable adult report records are classified under section 626.557, subdivision 12b.\n(m) Adult protection team information sharing. Sharing of local welfare agency vulnerable adult data with a protection team is governed by section 626.5571, subdivision 3.\n(n) Child protection team. Data acquired by a case consultation committee or subcommittee of a child protection team are classified by section 260E.02, subdivision 4.\n(o) Peace officer discipline procedures. Access by an officer under investigation to the investigating agency's investigative report on the officer is governed by section 626.89, subdivision 6.\n(p) Racial profiling study data. Racial profiling study data is governed by Minnesota Statutes 2006, section 626.951.\nPolice reports on domestic incidents are classified under section 629.341.\nAccess to records of the Clemency Review Commission is governed by section 638.20.\nData on persons permitted to carry pistols under the terms of a permit must be shared as required by section 624.714, subdivision 6.\nData contained in discharge and dismissal records are classified under section 609.3751, subdivision 5.\nData in e-charging is governed by section 299C.41.\nData regarding contact information provided by a citizen requesting a crime alert are classified under section 611A.0393.\nData contained in orders for protection, harassment restraining orders, and no contact orders are classified in section 299C.46, subdivision 6.\n(a) Provisions regarding the classification and sharing of data contained in a petition for expungement of a criminal record are included in section 609A.03.\n(b) Provisions regarding the classification and sharing of data related to automatic expungements are included in sections 299C.097 and 609A.015.\nData collected, created, received, maintained, or disseminated by the Cannabis Expungement Board are classified under section 609A.06, subdivision 11.",
	"repealed": false
}