{
	"id": "469.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.125",
	"title": "469.125 DEFINITIONS.",
	"text": "In sections 469.124 to 469.133, the terms defined in this section have the meanings given them herein unless the context indicates a different meaning.\n\"City\" means any home rule charter or statutory city.\nA \"development program\" is a statement of objectives of the city for improvement of a development district which contains a statement as to the public facilities to be constructed within the district, the open space to be created, the environmental controls to be applied, the proposed reuse of private property, and the proposed operations of the district after the capital improvements within the district have been completed.\n\"Pedestrian skyway system\" means any system of providing for pedestrian traffic circulation, mechanical or otherwise, elevated aboveground, within and without the public right-of-way, and through or above private property and buildings, and includes overpasses, bridges, passageways, walkways, concourses, hallways, corridors, arcades, courts, plazas, malls, elevators, escalators, heated canopies and accesses and all fixtures, furniture, signs, equipment, facilities, services, and appurtenances which in the judgment of the governing body of the city will enhance the movement, safety, security, convenience, and enjoyment of pedestrians and benefit the city and adjoining properties. The use of a public street or public right-of-way for pedestrian skyway travel only constitutes a public use and shall not require a vacation of the street or right-of-way.\n\"Special lighting systems\" means lights or light displays of any type located within or without the public right-of-way.\n\"Parking structure\" means any building the principal use of which is designed for and intended for parking of motor vehicles or any parking lot.\n\"Maintenance and operation\" means all activities necessary to maintain facilities after they have been developed and all activities necessary to operate the facilities including informational and educational programs, and safety and surveillance activities.\n\"Governing body\" means the city council.\nA \"development district\" is an area within the corporate limits of a city which has been so designated and separately numbered by the governing body.",
	"repealed": false
}