{
	"id": "4.046",
	"url": "https://www.revisor.mn.gov/statutes/cite/4.046",
	"title": "4.046 OPIOIDS, SUBSTANCE USE, AND ADDICTION SUBCABINET.",
	"text": "The Opioids, Substance Use, and Addiction Subcabinet is established. The purposes of the subcabinet are to identify:\n(1) challenges that exist within state government that create silos around addiction, treatment, prevention, and recovery; that limit access to treatment options or addiction-related services for all Minnesotans; and that prevent successful treatment outcomes;\n(2) opportunities that exist within state government that support accessible and effective substance use disorder treatment options or addiction-related services;\n(3) barriers and gaps in service for all Minnesotans seeking treatment for opioid or substance use disorder, particularly those barriers and gaps affecting members of communities disproportionately impacted by substance use and addiction;\n(4) potential solutions to barriers and gaps identified in clause (3);\n(5) how the state can address addiction as a chronic disease, emphasizing that there are multiple ways to enter sobriety; and\n(6) policies and strategies that address prevention efforts, including addressing underlying causes of addiction and public awareness and education around the dangers of issues including but not limited to opioid abuse, use of fentanyl and other synthetic opioids, other substance use, excessive alcohol consumption, and addiction.\nThe subcabinet consists of the following members:\n(1) the commissioner of human services;\n(2) the commissioner of health;\n(3) the commissioner of education;\n(4) the commissioner of public safety;\n(5) the commissioner of corrections;\n(6) the commissioner of management and budget;\n(7) the commissioner of higher education;\n(8) the chair of the Interagency Council on Homelessness; and\n(9) the governor's director of addiction and recovery, who shall serve as chair of the subcabinet.\nThe subcabinet must engage in the following duties related to the development of opioid use, substance use, and addiction policy and strategy:\n(1) identify challenges and opportunities that exist relating to accessing treatment and support services and develop recommendations to overcome these barriers for all Minnesotans;\n(2) with input from affected communities, develop policies and strategies that will reduce barriers and gaps in service for all Minnesotans seeking treatment for opioid or substance use disorder, particularly for those Minnesotans who are members of communities disproportionately impacted by substance use and addiction;\n(3) develop policies and strategies that the state may adopt to expand Minnesota's recovery infrastructure, including detoxification or withdrawal management facilities, treatment facilities, and sober housing;\n(4) identify innovative services and strategies for effective treatment and support;\n(5) develop policies and strategies to expand services and support for people in Minnesota suffering from opioid or substance use disorder through partnership with the Opioid Epidemic Response Advisory Council and other relevant partnerships;\n(6) develop policies and strategies for agencies to manage addiction and the relationship it has with co-occurring conditions;\n(7) identify policies and strategies to address opioid or substance use disorder among Minnesotans experiencing homelessness; and\n(8) submit recommendations to the legislature addressing opioid use, substance use, and addiction in Minnesota.\nThe subcabinet must develop and implement a framework to ensure meaningful public engagement is conducted by the subcabinet's agencies and boards. The purpose of the framework is to:\n(1) engage with and seek feedback from all affected Minnesotans, including members of the 11 Tribal Nations within Minnesota;\n(2) build partnerships and shared understanding with all affected Minnesotans, including members of Tribal communities in urban areas, communities of color, local communities, and industries, including but not limited to the health and business sectors;\n(3) provide a platform for dialogue about the needs and challenges of those in active addiction or in recovery and to identify effective solutions and how those solutions will impact the lives of people in Minnesota, including those who are members of communities disproportionately impacted by addiction, including opioid addiction; and\n(4) gather and share ideas for how Minnesotans can get involved with and stay informed about addiction issues that matter to them.\n(a) The Governor's Advisory Council on Opioids, Substance Use, and Addiction is established to advise the subcabinet on the purposes and duties described in this section. The advisory council consists of up to 18 members appointed by the governor. The governor must seek representation from community leaders, individuals with direct experience with addiction, individuals providing treatment services, and other relevant stakeholders in making appointments to the council. The governor will appoint one member as chair of the advisory council.\n(b) The advisory council must:\n(1) meet up to four times per year to identify opportunities for and barriers to the development and implementation of policies and strategies to expand access to effective services for people in Minnesota suffering from addiction;\n(2) examine what services and supports are needed in communities that are disproportionately impacted by the opioid epidemic; and\n(3) provide opportunities for Minnesotans who have directly experienced addiction to address needs, challenges, and solutions.\n(c) The terms, compensation, and removal of members of the advisory council are governed by section 15.059.\nThe Office of Addiction and Recovery is created in the Department of Management and Budget. The governor must appoint an addiction and recovery director, who shall serve as chair of the subcabinet and administer the Office of Addiction and Recovery. The director shall serve in the unclassified service and shall report to the governor. The director must:\n(1) make efforts to break down silos and work across agencies to better target the state's role in addressing addiction, treatment, and recovery for youth and adults;\n(2) assist in leading the subcabinet and the advisory council toward progress on measurable goals that track the state's efforts in combatting addiction for youth and adults, and preventing substance use and addiction among the state's youth population; and\n(3) establish and manage external partnerships and build relationships with communities, community leaders, and those who have direct experience with addiction to ensure that all voices of recovery are represented in the work of the subcabinet and advisory council.\nThe commissioner of management and budget, in coordination with other state agencies and boards as applicable, must provide staffing and administrative support to the Office of Addiction and Recovery, the addiction and recovery director, the subcabinet, and the advisory council established in this section.",
	"repealed": false
}