{
	"id": "268.052",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.052",
	"title": "268.052 PAYMENT TO TRUST FUND BY STATE AND POLITICAL SUBDIVISIONS.",
	"text": "In lieu of taxes payable on a quarterly basis, the state of Minnesota or its political subdivisions must reimburse the trust fund the amount of unemployment benefits charged to its reimbursable account under section 268.047. Reimbursements in the amount of unemployment benefits charged to the reimbursable account during a calendar quarter must be received by the department on or before the last day of the month following the month that the notice of unemployment benefits paid is sent under section 268.047, subdivision 5. Past due reimbursements are subject to the same interest charges and collection procedures that apply to past due taxes.\n(a) The state or political subdivision may elect to be a taxpaying employer if a notice of election is filed. The election is effective at the beginning of the next calendar quarter. Upon election, the state or political subdivision must be assigned the new employer tax rate under section 268.051, subdivision 5, for the calendar year of the election and unless or until it qualifies for an experience rating under section 268.051, subdivision 3.\nAn election is for a minimum period of eight calendar quarters following the effective date of the election and continue unless a notice terminating the election is filed. The termination is effective at the beginning of the next calendar quarter.\n(b) The method of payments to the trust fund under subdivisions 3 and 4 applies to all taxes paid by or due from the state or political subdivision that elects to be taxpaying employers under this subdivision.\n(c) A notice of election or a notice terminating election must be filed by electronic transmission in a format prescribed by the commissioner.\nTo discharge its liability, the state and its wholly owned instrumentalities must pay the trust fund as follows:\n(1) Every self-sustaining department, institution and wholly owned instrumentality must pay the trust fund in accordance with subdivision 1. For the purposes of this clause a \"self-sustaining department, institution or wholly owned instrumentality\" is one where the dedicated income and revenue substantially offsets its cost of operation.\n(2) Every partially self-sustaining department, institution and wholly owned instrumentality must pay the trust fund that same proportion of the amount that has been charged to its employer account as the proportion of the total of its income and revenue is to its annual cost of operation.\n(3) Every department, institution or wholly owned instrumentality that is not self-sustaining must pay the trust fund to the extent funds are available from appropriated funds.\n(4) The departments, institutions and wholly owned instrumentalities, including the University of Minnesota, that have money available must pay the trust fund in accordance with subdivision 1. If an applicant was paid during the base period from a special account provided by law, the payment to the trust fund must be made from the special account with the approval of the Department of Administration and the amounts are appropriated.\n(5) For those departments, institutions and wholly owned instrumentalities that cannot pay the trust fund, the commissioner must certify on November 1 of each calendar year to the commissioner of management and budget the unpaid balances. Upon receipt of the certification, the commissioner of management and budget must include the unpaid balances in the biennial budget submitted to the legislature.\nA political subdivision or instrumentality thereof is authorized and directed to pay its liabilities by money collected from taxes or other revenues. Every political subdivision authorized to levy taxes except school districts may include in its tax levy the amount necessary to pay its liabilities. School districts may levy according to section 126C.43, subdivision 2. If the taxes authorized to be levied cause the total amount of taxes levied to exceed any limitation upon the power of a political subdivision to levy taxes, the political subdivision may levy taxes in excess of the limitations in the amounts necessary to meet its liability. The expenditures authorized must not be included in computing the cost of government as defined in any home rule charter. The governing body of a municipality, for the purpose of meeting its liabilities, in the event of a deficit, may issue its obligations payable in not more than two years, in an amount that may cause its indebtedness to exceed any statutory or charter limitations, without an election, and may levy taxes in the manner provided in section 475.61.\nIf the state of Minnesota or its political subdivisions choose not to be a taxpaying employer under subdivision 2, the state or its political subdivision are considered, for purposes of the Minnesota unemployment insurance program, to have elected to be liable for reimbursements under subdivision 1.",
	"repealed": false
}