{
	"id": "62D.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.181",
	"title": "62D.181 INSOLVENCY; MCHA ALTERNATIVE COVERAGE.",
	"text": "\"Association\" means the Minnesota Comprehensive Health Association created in section 62E.10.\nAn individual is eligible for alternative coverage under this section if:\n(1) the individual had individual health coverage through a health maintenance organization or community integrated service network, the coverage is no longer available due to the insolvency of the health maintenance organization or community integrated service network, and the individual has not obtained alternative coverage; or\n(2) the individual had group health coverage through a health maintenance organization or community integrated service network, the coverage is no longer available due to the insolvency of the health maintenance organization or community integrated service network, and the individual has not obtained alternative coverage.\nIf a health maintenance organization or community integrated service network will be liquidated, individuals eligible for alternative coverage under subdivision 2 may apply to the association to obtain alternative coverage. Upon receiving an application and evidence that the applicant was enrolled in the health maintenance organization or community integrated service network at the time of an order for liquidation, the association shall issue policies to eligible individuals, without the limitation on preexisting conditions described in section 62E.14, subdivision 3.\nAlternative coverage issued under this section must be at least a number two qualified plan, as described in section 62E.06, subdivision 2, or for individuals over age 65, a basic Medicare supplement plan, as described in section 62A.316.\nThe premium for alternative coverage issued under this section must not exceed 80 percent of the premium for the comparable coverage offered by the association.\nThe duration of alternative coverage issued under this section is:\n(1) for individuals eligible under subdivision 2, clause (1), 90 days; and\n(2) for individuals eligible under subdivision 2, clause (2), 90 days or the length of time remaining in the group contract with the insolvent health maintenance organization or community integrated service network, whichever is greater.\nThe association is not obligated to offer replacement coverage under this chapter at the end of the periods specified in subdivision 6. Any continuation obligation arising under this chapter or chapter 62A will cease at the end of the periods specified in subdivision 6.\nClaims expenses resulting from the operation of this section which exceed premiums received shall be borne by contributing members of the association in accordance with section 62E.11, subdivision 5.\nIf an insolvent health maintenance organization or community integrated service network has insolvency insurance coverage at the time of an order for liquidation, the association may coordinate the benefits of the policy issued under this section with those of the insolvency insurance policy available to the enrollees. The premium level for the combined association policy and the insolvency insurance policy may not exceed those described in subdivision 5.",
	"repealed": false
}