{
	"id": "256L.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.07",
	"title": "256L.07 ELIGIBILITY FOR MINNESOTACARE.",
	"text": "Individuals enrolled in MinnesotaCare under section 256L.04, subdivision 1, and individuals enrolled in MinnesotaCare under section 256L.04, subdivision 7, whose income increases above 200 percent of the federal poverty guidelines, are no longer eligible for the program and shall be disenrolled by the commissioner. For persons disenrolled under this subdivision, MinnesotaCare coverage terminates the last day of the calendar month in which the commissioner sends advance notice according to Code of Federal Regulations, title 42, section 431.211, that indicates the income of a family or individual exceeds program income limits.\n(a) To be eligible, a family or individual must not have access to subsidized health coverage that is affordable and provides minimum value as defined in Code of Federal Regulations, title 26, section 1.36B-2.\n(b) Notwithstanding paragraph (a), an individual who has access through a spouse's or parent's employer to subsidized health coverage that is deemed minimum essential coverage under Code of Federal Regulations, title 26, section 1.36B-2, is eligible for MinnesotaCare if the employee's portion of the annual premium for employee and dependent coverage exceeds the required contribution percentage, as defined for premium tax credit eligibility under United States Code, title 26, section 36B(c)(2)(C)(i)(II), as indexed according to item (iv) of that section, of the individual's household income for the coverage year.\n(c) This subdivision does not apply to a family or individual who no longer has employer-subsidized coverage due to the employer terminating health care coverage as an employee benefit.\n[Repealed, 2007 c 147 art 5 s 41]\n(a) To be eligible, a family or individual must not have minimum essential health coverage, as defined by section 5000A of the Internal Revenue Code.\n(b) For purposes of this subdivision, an applicant or enrollee who is entitled to Medicare Part A or enrolled in Medicare Part B coverage under title XVIII of the Social Security Act, United States Code, title 42, sections 1395c to 1395w-152, is considered to have minimum essential health coverage. An applicant or enrollee who is entitled to premium-free Medicare Part A may not refuse to apply for or enroll in Medicare coverage to establish eligibility for MinnesotaCare.\nPremiums for families with children when a parent has been determined to be in need of substance use disorder treatment pursuant to an assessment conducted by the county under section 260E.20, subdivision 1, paragraph (g), or in need of chemical dependency treatment pursuant to a case plan under section 260C.201, subdivision 6, or 260C.212, who are eligible for MinnesotaCare under section 256L.04, subdivision 1, may be paid by the county of residence of the person in need of treatment for one year from the date the family is determined to be eligible or if the family is currently enrolled in MinnesotaCare from the date the person is determined to be in need of substance use disorder treatment. Upon renewal, the family is responsible for any premiums owed under section 256L.15. If the family is not currently enrolled in MinnesotaCare, the local county human services agency shall determine whether the family appears to meet the eligibility requirements and shall assist the family in applying for the MinnesotaCare program.\n[Repealed, 2013 c 108 art 1 s 68]\n[Repealed, 2010 c 200 art 1 s 21]\n[Repealed, 1Sp2011 c 9 art 6 s 97]\n[Repealed, 2013 c 108 art 1 s 68]\n[Repealed, 2013 c 108 art 1 s 68]",
	"repealed": false
}