{
	"id": "3.9216",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.9216",
	"title": "3.9216 AMERICAN INDIAN COMMUNITY-SPECIFIC BOARD.",
	"text": "The board consists of five members who are members of a federally recognized Tribe or members of the American Indian community. The chair of the Indian Affairs Council shall appoint the members of the board. In making appointments, the chair must consult with other members of the council.\nMembers do not receive compensation but are entitled to receive reimbursement for reasonable and necessary expenses incurred doing board-related work, including travel for meetings, trainings, and presentations. Board members may also receive per diem payments in a manner and amount prescribed by the board.\nThe board shall meet regularly at the request of the appointing chair, board chair, or ombudsperson. The board must meet at least quarterly. The appointing chair, board chair, or ombudsperson may also call special or emergency meetings as necessary.\n(a) A member may be removed by the appointing authority at any time, either for cause, as described in paragraph (b), or after missing three consecutive meetings, as described in paragraph (c).\n(b) If a removal is for cause, the member must be given notice and an opportunity for a hearing before removal.\n(c) After a member misses two consecutive meetings, and before the next meeting, the board chair shall notify the member in writing that the member may be removed if the member misses the next meeting. If a member misses three consecutive meetings, the board chair must notify the appointing authority.\n(d) If there is a vacancy on the board, the appointing authority shall appoint a person to fill the vacancy for the remainder of the unexpired term.\n(a) The board shall appoint the Ombudsperson for American Indian Families and shall advise and assist the ombudsperson in various ways, including but not limited to:\n(1) selecting matters for attention;\n(2) developing policies, plans, and programs to carry out the ombudsperson's functions and powers;\n(3) attending policy meetings when requested by the ombudsperson;\n(4) establishing protocols for working with American Indian communities;\n(5) developing procedures for the ombudsperson's use of the subpoena power to compel testimony and evidence from individuals who are not agency personnel; and\n(6) making reports and recommendations for changes designed to improve standards of competence, efficiency, justice, and protection of rights.\n(b) The board shall not make individual case recommendations.\nThe board may apply for grants for the purpose of training and educating the American Indian community on child protection issues involving American Indian families. The board may also accept gifts, donations, and appropriations for training and education. Grants, gifts, donations, and appropriations received by the board shall be used for training and education purposes. The board may seek and apply for grants to develop new programs and initiatives and to continue existing programs and initiatives. These funds may also be used to reimburse board members for reasonable and necessary expenses incurred in aiding and assisting the Office of the Ombudsperson for American Indian Families in Office of the Ombudsperson for American Indian Families programs and initiatives, but may not be used for operating expenses for the Office of Ombudsperson for American Indian Families.\nThe terms and expiration of board membership are governed by section 15.0575.",
	"repealed": false
}