{
	"id": "145.928",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.928",
	"title": "145.928 ELIMINATING HEALTH DISPARITIES.",
	"text": "It is the goal of the state to decrease the disparities in infant mortality rates and adult and child immunization rates for American Indians and populations of color, as compared with rates for whites. To do so and to achieve other measurable outcomes, the commissioner of health shall establish a program to close the gap in the health status of American Indians and populations of color as compared with whites in the following priority areas: infant mortality, access to and utilization of high-quality prenatal care, breast and cervical cancer screening, HIV/AIDS and sexually transmitted infections, adult and child immunizations, cardiovascular disease, diabetes, and accidental injuries and violence.\nThe commissioner, in partnership with culturally based community organizations; the Indian Affairs Council under section 3.922; the Minnesota Council on Latino Affairs under section 15.0145; the Council for Minnesotans of African Heritage under section 15.0145; the Council on Asian-Pacific Minnesotans under section 15.0145; community health boards as defined in section 145A.02; and tribal governments, shall develop and implement a comprehensive, coordinated plan to reduce health disparities in the health disparity priority areas identified in subdivision 1.\nThe commissioner, in consultation with the community partners listed in subdivision 2, shall establish measurable outcomes to achieve the goal specified in subdivision 1 and to determine the effectiveness of the grants and other activities funded under this section in reducing health disparities in the priority areas identified in subdivision 1. The development of measurable outcomes must be completed before any funds are distributed under this section.\nThe commissioner shall enhance current data tools to ensure a statewide assessment of the risk behaviors associated with the health disparity priority areas identified in subdivision 1. The statewide assessment must be used to establish a baseline to measure the effect of activities funded under this section. To the extent feasible, the commissioner shall conduct the assessment so that the results may be compared to national data.\nThe commissioner shall provide the necessary expertise to grant applicants to ensure that submitted proposals are likely to be successful in reducing the health disparities identified in subdivision 1. The commissioner shall provide grant recipients with guidance and training on best or most promising strategies to use to reduce the health disparities identified in subdivision 1. The commissioner shall also assist grant recipients in the development of materials and procedures to evaluate local community activities.\n(a) The commissioner, in consultation with the community partners listed in subdivision 2, shall develop the criteria and procedures used to allocate grants under this section. In developing the criteria, the commissioner shall establish an administrative cost limit for grant recipients. At the time a grant is awarded, the commissioner must provide a grant recipient with information on the outcomes established according to subdivision 3.\n(b) A grant recipient must coordinate its activities to reduce health disparities with other entities receiving funds under this section that are in the grant recipient's service area.\n(a) The commissioner shall award grants to eligible applicants for local or regional projects and initiatives directed at reducing health disparities in one or more of the following priority areas:\n(1) decreasing racial and ethnic disparities in infant mortality rates;\n(2) decreasing racial and ethnic disparities in access to and utilization of high-quality prenatal care; or\n(3) increasing adult and child immunization rates in nonwhite racial and ethnic populations.\n(b) The commissioner may award up to 20 percent of the funds available as planning grants. Planning grants must be used to address such areas as community assessment, coordination activities, and development of community supported strategies.\n(c) Eligible applicants may include, but are not limited to, faith-based organizations, social service organizations, community nonprofit organizations, community health boards, tribal governments, and community clinics. Applicants must submit proposals to the commissioner. A proposal must specify the strategies to be implemented to address one or more of the priority areas listed in paragraph (a) and must be targeted to achieve the outcomes established according to subdivision 3.\n(d) The commissioner shall give priority to applicants who demonstrate that their proposed project or initiative:\n(1) is supported by the community the applicant will serve;\n(2) is research-based or based on promising strategies;\n(3) is designed to complement other related community activities;\n(4) utilizes strategies that positively impact two or more priority areas;\n(5) reflects racially and ethnically appropriate approaches; and\n(6) will be implemented through or with community-based organizations that reflect the race or ethnicity of the population to be reached.\nThe commissioner shall award grants to minority-run health care professional associations to achieve the following:\n(1) provide collaborative mental health services to minority residents;\n(2) provide collaborative, holistic, and culturally competent health care services in communities with high concentrations of minority residents; and\n(3) collaborate on recruitment, training, and placement of minorities with health care providers.\n(a) The commissioner shall award grants to eligible applicants for local or regional projects and initiatives directed at reducing health disparities in one or more of the following priority areas:\n(1) decreasing racial and ethnic disparities in morbidity and mortality rates from breast and cervical cancer;\n(2) decreasing racial and ethnic disparities in morbidity and mortality rates from HIV/AIDS and sexually transmitted infections;\n(3) decreasing racial and ethnic disparities in morbidity and mortality rates from cardiovascular disease;\n(4) decreasing racial and ethnic disparities in morbidity and mortality rates from diabetes; or\n(5) decreasing racial and ethnic disparities in morbidity and mortality rates from accidental injuries or violence.\n(b) The commissioner may award up to 20 percent of the funds available as planning grants. Planning grants must be used to address such areas as community assessment, determining community priority areas, coordination activities, and development of community supported strategies.\n(c) Eligible applicants may include, but are not limited to, faith-based organizations, social service organizations, community nonprofit organizations, community health boards, and community clinics. Applicants shall submit proposals to the commissioner. A proposal must specify the strategies to be implemented to address one or more of the priority areas listed in paragraph (a) and must be targeted to achieve the outcomes established according to subdivision 3.\n(d) The commissioner shall give priority to applicants who demonstrate that their proposed project or initiative:\n(1) is supported by the community the applicant will serve;\n(2) is research-based or based on promising strategies;\n(3) is designed to complement other related community activities;\n(4) utilizes strategies that positively impact more than one priority area;\n(5) reflects racially and ethnically appropriate approaches; and\n(6) will be implemented through or with community-based organizations that reflect the race or ethnicity of the population to be reached.\n(a) The commissioner shall distribute funds to community health boards for health screening and follow-up services for tuberculosis for foreign-born persons. Funds shall be distributed based on the following formula:\n(1) $1,500 per foreign-born person with pulmonary tuberculosis in the community health board's service area;\n(2) $500 per foreign-born person with extrapulmonary tuberculosis in the community health board's service area;\n(3) $500 per month of directly observed therapy provided by the community health board for each uninsured foreign-born person with pulmonary or extrapulmonary tuberculosis; and\n(4) $50 per foreign-born person in the community health board's service area.\n(b) Payments must be made at the end of each state fiscal year. The amount paid per tuberculosis case, per month of directly observed therapy, and per foreign-born person must be proportionately increased or decreased to fit the actual amount appropriated for that fiscal year.\nThe commissioner shall award grants to American Indian tribal governments for implementation of community interventions to reduce health disparities for the priority areas listed in subdivisions 7 and 8. A community intervention must be targeted to achieve the outcomes established according to subdivision 3. Tribal governments must submit proposals to the commissioner and must demonstrate partnerships with local public health entities. The distribution formula shall be determined by the commissioner, in consultation with the tribal governments.\nThe commissioner shall coordinate the projects and initiatives funded under this section with other efforts at the local, state, or national level to avoid duplication and promote complementary efforts.\nUsing the outcomes established according to subdivision 3, the commissioner shall conduct a biennial evaluation of the community grant programs, community health board activities, and tribal government activities funded under this section. Grant recipients, tribal governments, and community health boards shall cooperate with the commissioner in the evaluation and shall provide the commissioner with the information needed to conduct the evaluation.\n(a) The commissioner shall submit a biennial report to the legislature on the local community projects, tribal government, and community health board prevention activities funded under this section. These reports must include information on grant recipients, activities that were conducted using grant funds, evaluation data, and outcome measures, if available. These reports are due by January 15 of every other year, beginning in the year 2003.\n(b) The commissioner shall release an annual report to the public on grants made under subdivision 7 to decrease racial and ethnic disparities in infant mortality rates. The report must provide specific information on the amount of each grant awarded to each agency or organization, an itemized list submitted to the commissioner by each agency or organization awarded a grant specifying all uses of grant funds and the amount expended for each use, the population served by each agency or organization, outcomes of the programs funded by each grant, and the amount of the appropriation retained by the commissioner for administrative and associated expenses. The commissioner shall issue a report each January 15 for the previous fiscal year beginning January 15, 2016.\nFunds received under this section must be used to develop new programs or expand current programs that reduce health disparities. Funds must not be used to supplant current county or tribal expenditures.\nFor all grants awarded under this section, the commissioner shall consider applicants that present evidence of a promising strategy to accomplish the applicant's objective. A promising strategy shall be given the same weight as a research or evidence-based strategy based on potential value and measurable outcomes.",
	"repealed": false
}