{
	"id": "326A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/326A.13",
	"title": "326A.13 WORKING PAPERS; CLIENTS' RECORDS.",
	"text": "(a) Subject to the provisions of section 326A.12, all statements, records, schedules, working papers, and memoranda made by a licensee or a partner, shareholder, officer, director, member, manager, or employee of a licensee, incident to, or in the course of, rendering services to a client while a licensee, except the reports submitted by the licensee to the client and except for records that are part of the client's records, remain the property of the licensee in the absence of an express agreement between the licensee and the client to the contrary. No statement, record, schedule, working paper, or memorandum may be sold, transferred, or bequeathed, without the consent of the client or the client's personal representative or assignee, to anyone other than one or more surviving partners, stockholders, members or new partners, new stockholders, new members of the licensee, or any combined or merged firm or successor in interest to the licensee. Nothing in this section may be construed as prohibiting any temporary transfer of work papers or other material necessary in the course of carrying out peer reviews or as otherwise interfering with the disclosure of information pursuant to section 326A.12.\n(b) A licensee shall furnish to a client or former client, upon request and reasonable notice:\n(1) a copy of the licensee's working papers, to the extent that the working papers include records that would ordinarily constitute part of the client's records and are not otherwise available to the client; and\n(2) any accounting or other records belonging to, or obtained from or on behalf of, the client that the licensee removed from the client's premises or received for the client's account. The licensee may make and retain copies of such documents of the client when they form the basis for work done by the licensee.\n(c) Nothing in this section requires a licensee to keep any work paper beyond the period prescribed in any other applicable statute.\n(d) This section also applies to persons registered under section 326A.06, paragraph (b), and to persons granted a practice privilege under section 326A.14.",
	"repealed": false
}