{
	"id": "62K.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/62K.14",
	"title": "62K.14 LIMITED-SCOPE PEDIATRIC DENTAL PLANS.",
	"text": "(a) Limited-scope pediatric dental plans must be offered to the extent permitted under the Affordable Care Act: (1) on a guaranteed issue and guaranteed renewable basis; (2) with premiums rated on allowable rating factors used for health plans; and (3) without any exclusions or limitations based on preexisting conditions.\n(b) Notwithstanding paragraph (a), a health carrier may discontinue a limited scope pediatric dental plan at the end of a plan year if the health carrier provides written notice to enrollees before coverage is to be discontinued that the particular plan is being discontinued and the health carrier offers enrollees other dental plan options that are the same or substantially similar to the dental plan being discontinued in terms of premiums, benefits, cost-sharing requirements, and network adequacy. The written notice to enrollees must be provided at least 105 days before the end of the plan year.\n(c) Limited-scope pediatric dental plans must ensure primary care dental services are available within 60 miles or 60 minutes' travel time.\n(d) If a stand-alone dental plan as defined under the Affordable Care Act or a limited-scope pediatric dental plan is offered, either separately or in conjunction with a health plan offered to individuals or small employers, the health plan shall not be considered in noncompliance with the requirements of the essential benefit package in the Affordable Care Act because the health plan does not offer coverage of pediatric dental benefits if these benefits are covered through the stand-alone or limited-scope pediatric dental plan, to the extent permitted under the Affordable Care Act.\n(e) Health carriers offering limited-scope pediatric dental plans must comply with this section and sections 62K.07, 62K.08, 62K.13, and 62K.15.\n(f) The commissioner of commerce shall enforce paragraphs (a) and (b). Any limited-scope pediatric dental plan that is to be offered to replace a discontinued dental plan under paragraph (b) must be approved by the commissioner of commerce in terms of cost and benefit similarity, and the commissioner of health in terms of network adequacy similarity. The commissioner of health shall enforce paragraph (c).",
	"repealed": false
}