{
	"id": "297I.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.05",
	"title": "297I.05 TAX IMPOSED.",
	"text": "Except as otherwise provided in this section, a tax is imposed on every domestic and foreign insurance company. The rate of tax is equal to two percent of all gross premiums less return premiums on all direct business received by the insurer or agents of the insurer in Minnesota, in cash or otherwise, during the year.\nA tax is imposed on township mutual insurance companies. The rate of tax is equal to one percent of gross premiums less return premiums on all direct business received by the insurer or agents of the insurer in Minnesota, in cash or otherwise, during the year.\nA tax is imposed on mutual property and casualty companies with assets of $5,000,000 or less at the end of the calendar year. The rate of tax is equal to one percent of gross premiums less return premiums on all direct business received by the insurer or agents of the insurer in Minnesota, in cash or otherwise, during the year.\nA tax is imposed on:\n(1) mutual insurance companies that sell both property and casualty insurance that had total assets greater than $5,000,000 at the end of the calendar year but that had total assets less than $1,600,000,000 on December 31, 1989; and\n(2) a mutual insurance company created pursuant to Laws 1983, chapter 287, article 2, that sells only casualty insurance.\nThe rate of tax is equal to 1.26 percent of gross premiums less return premiums on all direct business received by the insurer or agents of the insurer in Minnesota, in cash or otherwise, during the year.\n(a) A tax is imposed on health maintenance organizations, community integrated service networks, and nonprofit health care service plan corporations. The rate of tax is equal to one percent of gross premiums less return premiums on all direct business received by the organization, network, or corporation or its agents in Minnesota, in cash or otherwise, in the calendar year.\n(b) The commissioner shall deposit all revenues, including penalties and interest, collected under this chapter from health maintenance organizations, community integrated service networks, and nonprofit health service plan corporations in the health care access fund. Refunds of overpayments of tax imposed by this subdivision must be paid from the health care access fund. There is annually appropriated from the health care access fund to the commissioner the amount necessary to make any refunds of the tax imposed under this subdivision.\nMS 2006 [Repealed, 2006 c 217 s 4,5]\n(a) A tax is imposed on surplus lines brokers. The rate of tax is equal to three percent of the gross premiums less return premiums paid by an insured whose home state is Minnesota.\n(b) A tax is imposed on a person, firm, corporation, or purchasing group as defined in section 60E.02, or any member of a purchasing group, that procures insurance directly from a nonadmitted insurer. The rate of tax is equal to two percent of the gross premiums less return premiums paid by an insured whose home state is Minnesota.\n(c) No state other than the home state of an insured may require any premium tax payment for nonadmitted insurance. When Minnesota is the home state of the insured, as provided under section 297I.01, 100 percent of the gross premiums are taxable in Minnesota with no allocation of the tax to other states.\n[Repealed, 1Sp2001 c 5 art 13 s 15]\n[Repealed, 1Sp2011 c 7 art 8 s 14]\n[Repealed, 1Sp2011 c 7 art 8 s 14]\n(a) If any other state or country imposes any taxes, fines, deposits, penalties, licenses, or fees upon any insurance companies of this state and their agents doing business in another state or country that are in addition to or in excess of those imposed by the laws of this state upon foreign insurance companies and their agents doing business in this state, the same taxes, fines, deposits, penalties, licenses, and fees are imposed upon every similar insurance company of that state or country and their agents doing or applying to do business in this state.\n(b) If any conditions precedent to the right to do business in any other state or country are imposed by the laws of that state or country, beyond those imposed upon foreign companies by the laws of this state, the same conditions precedent are imposed upon every similar insurance company of that state or country and their agents doing or applying to do business in that state.\n(c) For purposes of this subdivision, \"taxes, fines, deposits, penalties, licenses, or fees\" means an amount of money that is deposited in the general revenue fund of the state or other similar fund in another state or country and is not dedicated to a special purpose or use or money deposited in the general revenue fund of the state or other similar fund in another state or country and appropriated to the commissioner of commerce or insurance for the operation of the Department of Commerce or other similar agency with jurisdiction over insurance. Taxes, fines, deposits, penalties, licenses, or fees do not include:\n(1) special purpose obligations or assessments imposed in connection with particular kinds of insurance, including but not limited to assessments imposed in connection with residual market mechanisms; or\n(2) assessments made by the insurance guaranty association, life and health guarantee association, or similar association.\n(d) This subdivision applies to taxes imposed under subdivisions 1; 3; 4; 12, paragraph (a), clauses (1) and (2); and 14.\n(e) This subdivision does not apply to insurance companies organized or domiciled in a state or country, the laws of which do not impose retaliatory taxes, fines, deposits, penalties, licenses, or fees or which grant, on a reciprocal basis, exemptions from retaliatory taxes, fines, deposits, penalties, licenses, or fees to insurance companies domiciled in this state.\n(a) A tax is imposed equal to two percent of:\n(1) gross premiums less return premiums written for risks resident or located in Minnesota by a risk retention group;\n(2) gross premiums less return premiums received by an attorney in fact acting in accordance with chapter 71A;\n(3) gross premiums less return premiums received pursuant to assigned risk policies and contracts of coverage under chapter 79; and\n(4) the direct funded premium received by the reinsurance association under section 79.34 from self-insurers approved under section 176.181 and political subdivisions that self-insure.\n(b) A tax is imposed on a joint self-insurance plan operating under chapter 60F. The rate of tax is equal to two percent of the total amount of claims paid during the fund year, with no deduction for claims wholly or partially reimbursed through stop-loss insurance.\n(c) A tax is imposed on a joint self-insurance plan operating under chapter 62H, except as provided in section 62H.18, subdivision 8. The rate of tax is equal to two percent of the total amount of claims paid during the fund's fiscal year, with no deduction for claims wholly or partially reimbursed through stop-loss insurance.\n(d) A tax is imposed equal to the tax imposed under subdivision 5 on the gross premiums less return premiums on all coverages received by an accountable provider network or agents of an accountable provider network in Minnesota, in cash or otherwise, during the year.\nUnless otherwise specified in this chapter, all amounts collected by the commissioner under this chapter must be deposited in the general fund.\nA tax is imposed on life insurance. The rate of tax equals 1.5 percent of gross premiums less return premiums on all direct business received by the insurer or agents of the insurer in Minnesota for life insurance, in cash or otherwise, during the year.",
	"repealed": false
}