{
	"id": "136A.1794",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1794",
	"title": "136A.1794 AGRICULTURAL EDUCATION LOAN FORGIVENESS PROGRAM.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Qualified education loan\" means a government, commercial, or foundation loan for actual costs paid for tuition, reasonable education expenses, and reasonable living expenses related to the graduate or undergraduate education of a qualified teacher.\n(c) \"Qualified teacher\" means a teacher licensed under chapter 122A who:\n(1) is employed in a nonadministrative position teaching agricultural education in any grade from grades 5 through 12 at a Minnesota school during the current year; and\n(2) has completed an undergraduate or graduate program in agricultural education at a college or university approved by the state of Minnesota to prepare persons for teacher licensure.\n(d) \"School\" means the following:\n(1) a school or program operated by a school district or a group of school districts;\n(2) a tribal contract school eligible to receive aid according to section 124D.83;\n(3) a charter school; or\n(4) a private school.\nAn agricultural education loan forgiveness account is established in the special revenue fund to provide qualified teachers with financial assistance to repay qualified education loans. Money in the account, including interest, is appropriated to the commissioner for purposes of this section.\n(a) To be eligible to participate in the loan forgiveness program under this section, an individual must:\n(1) be a qualified teacher;\n(2) have qualified education loans; and\n(3) submit an application to the commissioner in the form and manner prescribed by the commissioner.\n(b) An applicant selected to participate must sign a contract to agree to serve a minimum one-year full-time service obligation according to subdivision 4. To complete the service obligation, the applicant must work full time in Minnesota as a qualified teacher. A participant must complete one year of service under this paragraph for each year the participant receives an award under this section.\n(a) Before receiving loan repayment disbursements and as requested, a participant must verify to the commissioner that the participant is employed in a position that fulfills the service obligation as required under subdivision 3, paragraph (b).\n(b) If a participant does not fulfill the required service obligation, the commissioner must collect from the participant the total amount paid to the participant under the loan forgiveness program plus interest at a rate established according to section 270C.40. The commissioner must deposit the money collected in the agricultural education loan forgiveness account. The commissioner must allow waivers of all or part of the money owed the commissioner as a result of a nonfulfillment penalty if emergency circumstances prevented fulfillment of the minimum service commitment.\n(a) The commissioner may select eligible applicants each year for participation in the agricultural education loan forgiveness program, within the limits of available funding. Applicants are responsible for securing their own qualified education loans.\n(b) The commissioner must make annual disbursements directly to the eligible participant of $3,000 or the balance of the participant's qualified education loans, whichever is less, for each year that the participant meets the eligibility requirements under subdivision 3, up to a maximum of five years.\n(c) The participant must provide the commissioner with verification that the full amount of the loan repayment disbursement received by the participant has been applied toward the designated qualified education loan. After each disbursement, verification must be received by the commissioner and approved before the next repayment disbursement is made.",
	"repealed": false
}