{
	"id": "59A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/59A.11",
	"title": "59A.11 CANCELLATION OF INSURANCE CONTRACT UPON DEFAULT.",
	"text": "When a premium finance agreement contains a power of attorney or other authority enabling the insurance premium finance company to cancel any insurance contract listed in the agreement, the insurance contract or contracts shall not be canceled by the premium finance company unless such cancellation is effectuated in accordance with this section.\nNot less than ten days' written notice shall be mailed to the insured setting forth the intent of the insurance premium finance company to cancel the insurance contract unless the default is cured prior to the date stated in the notice. The insurance agent or insurance broker indicated on the premium finance agreement shall also be given ten days' notice of this action in a manner agreed upon between the insurance premium finance company and insurance agent or insurance broker.\n(a) Pursuant to the power of attorney or other authority referred to above, the insurance premium finance company may cancel on behalf of the insured by mailing to the insurer written notice stating when thereafter the cancellation shall be effective, and the insurance contract shall be canceled as if such notice of cancellation had been submitted by the insured personally, but without requiring the return of the insurance contract. In the event that the insurer or its agent does not provide the insurance premium finance company with a specific mailing address for the purposes of receipt of the above notice, then mailing by the insurance premium finance company to the insurer at the address which is on file and of record with the commissioner of commerce pursuant to the provisions of chapters 60A and 72A shall be considered sufficient notice under this section. The notice requirements of this paragraph only apply if an insurance premium finance company and an insurer have not agreed on a method of providing notice of cancellation.\n(b) The insurance premium finance company shall also mail a notice of cancellation to the insured at the insured's last known address.\n(c) Written notice of the cancellation must also be given to the insurance agent or insurance broker indicated on the premium finance agreement. Written notice to the insurance agent or broker required by this paragraph may be given in a manner agreed upon between the insurance premium finance company, insurer, agent, or broker.\nWhere statutory, regulatory or contractual restrictions provide that the insurance contract may not be canceled unless notice is given to a governmental agency, mortgagee, or other third party, the insurer shall give the prescribed notice on behalf of itself or the insured to the governmental agency, mortgagee or other third party within ten days after the day it receives the notice of cancellation from the premium finance company. When the above restrictions require the continuation of insurance beyond the effective date of cancellation specified by the premium finance company, the insurance shall be limited to the coverage to which the restrictions relate and to the persons they are designed to protect.",
	"repealed": false
}