{
	"id": "609.531",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.531",
	"title": "609.531 FORFEITURES.",
	"text": "For the purpose of sections 609.531 to 609.5318, the following terms have the meanings given them.\n(a) \"Conveyance device\" means a device used for transportation and includes, but is not limited to, a motor vehicle, trailer, snowmobile, airplane, and vessel and any equipment attached to it. The term \"conveyance device\" does not include property which is, in fact, itself stolen or taken in violation of the law.\n(b) \"Weapon used\" means a dangerous weapon as defined under section 609.02, subdivision 6, that the actor used or had in possession in furtherance of a crime.\n(c) \"Property\" means property as defined in section 609.52, subdivision 1, clause (1).\n(d) \"Contraband\" means property which is illegal to possess under Minnesota law.\n(e) \"Appropriate agency\" means the Bureau of Criminal Apprehension, the Department of Commerce Fraud Bureau, the Minnesota Division of Driver and Vehicle Services, the Minnesota State Patrol, a county sheriff's department, the Three Rivers Park District Department of Public Safety, the Department of Natural Resources Division of Enforcement, the University of Minnesota Police Department, the Department of Corrections Fugitive Apprehension Unit, a city, metropolitan transit, or airport police department; or a multijurisdictional entity established under section 299A.642 or 299A.681.\n(f) \"Designated offense\" includes:\n(1) for weapons used: any violation of this chapter, chapter 152 or 624;\n(2) for driver's license or identification card transactions: any violation of section 171.22; and\n(3) for all other purposes: a felony violation of, or a felony-level attempt or conspiracy to violate, section 325E.17; 325E.18; 609.185; 609.19; 609.195; 609.2112; 609.2113; 609.2114; 609.221; 609.222; 609.223; 609.2231; 609.2335; 609.24; 609.245; 609.247; 609.25; 609.255; 609.282; 609.283; 609.322; 609.342, subdivision 1, or subdivision 1a, clauses (a) to (f) and (i); 609.343, subdivision 1, or subdivision 1a, clauses (a) to (f) and (i); 609.344, subdivision 1, or subdivision 1a, clauses (a) to (e), (h), or (i); 609.345, subdivision 1, or subdivision 1a, clauses (a) to (e), (h), and (i); 609.352; 609.42; 609.425; 609.466; 609.485; 609.487; 609.52; 609.525; 609.527; 609.528; 609.53; 609.54; 609.551; 609.561; 609.562; 609.563; 609.582; 609.59; 609.595; 609.611; 609.631; 609.66, subdivision 1e; 609.671, subdivisions 3, 4, 5, 8, and 12; 609.687; 609.821; 609.825; 609.86; 609.88; 609.89; 609.893; 609.895; 617.246; 617.247; or a gross misdemeanor or felony violation of section 609.891 or 624.7181; or any violation of section 609.324; or a felony violation of, or a felony-level attempt or conspiracy to violate, Minnesota Statutes 2012, section 609.21.\n(g) \"Controlled substance\" has the meaning given in section 152.01, subdivision 4.\n(h) \"Prosecuting authority\" means the attorney who is responsible for prosecuting an offense that is the basis for a forfeiture under sections 609.531 to 609.5318.\n(i) \"Asserting person\" means a person, other than the driver alleged to have used a vehicle in the transportation or exchange of a controlled substance intended for distribution or sale, claiming an ownership interest in a vehicle that has been seized or restrained under this section.\nSections 609.531 to 609.5318 must be liberally construed to carry out the following remedial purposes:\n(1) to enforce the law;\n(2) to deter crime;\n(3) to reduce the economic incentive to engage in criminal enterprise;\n(4) to increase the pecuniary loss resulting from the detection of criminal activity; and\n(5) to forfeit property unlawfully used or acquired and divert the property to law enforcement purposes.\n[Repealed, 1988 c 665 s 17]\n[Repealed, 1988 c 665 s 17]\n(a) Property subject to forfeiture under sections 609.531 to 609.5318 may be seized by the appropriate agency upon process issued by any court having jurisdiction over the property. Property may be seized without process if:\n(1) the seizure is incident to a lawful arrest or a lawful search;\n(2) the property subject to seizure has been the subject of a prior judgment in favor of the state in a criminal injunction or forfeiture proceeding under this chapter; or\n(3) the appropriate agency has probable cause to believe that the delay occasioned by the necessity to obtain process would result in the removal or destruction of the property and that:\n(i) the property was used or is intended to be used in commission of a felony; or\n(ii) the property is dangerous to health or safety.\nIf property is seized without process under item (i), the prosecuting authority must institute a forfeiture action under section 609.5313 as soon as is reasonably possible.\n(b) When property is seized, the officer must provide a receipt to the person found in possession of the property; or in the absence of any person, the officer must leave a receipt in the place where the property was found, if reasonably possible.\nAll right, title, and interest in property subject to forfeiture under sections 609.531 to 609.5318 vests in the appropriate agency upon commission of the act or omission giving rise to the forfeiture. Any property seized under sections 609.531 to 609.5318 is not subject to replevin, but is deemed to be in the custody of the appropriate agency subject to the orders and decrees of the court having jurisdiction over the forfeiture proceedings. When property is so seized, the appropriate agency shall use reasonable diligence to secure the property and prevent waste and may do any of the following:\n(1) place the property under seal;\n(2) remove the property to a place designated by it; and\n(3) in the case of controlled substances, require the state Board of Pharmacy to take custody of the property and remove it to an appropriate location for disposition in accordance with law.\n(a) If the owner of property that has been seized under sections 609.531 to 609.5318 seeks possession of the property before the forfeiture action is determined, the owner may give security or post bond payable to the appropriate agency in an amount equal to the retail value of the seized property. On posting the security or bond, the seized property must be returned to the owner and the forfeiture action shall proceed against the security as if it were the seized property. This subdivision does not apply to contraband property or property being held for investigatory purposes.\n(b) If the owner of a motor vehicle that has been seized under this section seeks possession of the vehicle before the forfeiture action is determined, the owner may surrender the vehicle's certificate of title in exchange for the vehicle. The motor vehicle must be returned to the owner within 24 hours if the owner surrenders the motor vehicle's certificate of title to the appropriate agency, pending resolution of the forfeiture action. If the certificate is surrendered, the owner may not be ordered to post security or bond as a condition of release of the vehicle. When a certificate of title is surrendered under this provision, the agency shall notify the Department of Public Safety and any secured party noted on the certificate. The agency shall also notify the department and the secured party when it returns a surrendered title to the motor vehicle owner.\n[Repealed, 1988 c 665 s 17]\n(a) An action for forfeiture is a civil in rem action and is independent of any criminal prosecution, except as provided in this subdivision.\n(b) An asset is subject to forfeiture by judicial determination under sections 609.5311 to 609.5318 only if:\n(1) a person is convicted of the criminal offense related to the action for forfeiture; or\n(2) a person is not charged with a criminal offense under chapter 152 related to the action for forfeiture based in whole or in part on the person's agreement to provide information regarding the criminal activity of another person.\nFor purposes of clause (1), an admission of guilt to an offense chargeable under chapter 152, a sentence under section 152.152, a stay of adjudication under section 152.18, or a referral to a diversion program for an offense chargeable under chapter 152 is considered a conviction.\n(c) The appropriate agency handling the judicial forfeiture may introduce into evidence in the judicial forfeiture case in civil court the agreement in paragraph (b), clause (2).\n(d) The appropriate agency handling the judicial forfeiture bears the burden of proving by clear and convincing evidence that the property is an instrument or represents the proceeds of the underlying offense.\nPrior to the entry of a court order disposing with the forfeiture action, any person who has an interest in forfeited property may file with the prosecuting authority a petition for remission or mitigation of the forfeiture. The prosecuting authority may remit or mitigate the forfeiture upon terms and conditions the prosecuting authority deems reasonable if the prosecuting authority finds that: (1) the forfeiture was incurred without willful negligence or without any intention on the part of the petitioner to violate the law; or (2) extenuating circumstances justify the remission or mitigation of the forfeiture.\n(a) By December 1, 2010, the Peace Officer Standards and Training Board, after consulting with the Minnesota County Attorneys Association, the Minnesota Sheriffs' Association, the Minnesota Chiefs of Police Association, and the Minnesota Police and Peace Officers Association, shall develop a model policy that articulates best practices for forfeiture and is designed to encourage the uniform application of forfeiture laws statewide. At a minimum, the policy shall address the following:\n(1) best practices in pursuing, seizing, and tracking forfeitures;\n(2) type and frequency of training for law enforcement on forfeiture laws; and\n(3) situations in which forfeitures should not be pursued.\n(b) By December 1, 2010, the Minnesota County Attorneys Association, after consulting with the attorney general, the Peace Officer Standards and Training Board, the Minnesota Sheriffs' Association, the Minnesota Chiefs of Police Association, and the Minnesota Police and Peace Officers Association, shall develop a model policy that articulates best practices for forfeiture and is designed to encourage the uniform application of forfeiture laws statewide. At a minimum, the policy shall address the following:\n(1) statutory role of prosecuting authorities in forfeiture procedures;\n(2) best practices for timely and fair resolution of forfeiture cases;\n(3) type and frequency of training for prosecuting authorities on forfeiture laws; and\n(4) situations in which forfeitures should not be pursued.\n(c) By December 1, 2010, the Minnesota County Attorneys Association and the Peace Officer Standards and Training Board shall forward an electronic copy of its respective model policy to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over criminal justice and civil law policy.\n(d) By March 1, 2011, the chief law enforcement officer of every state and local law enforcement agency and every prosecution office in the state shall adopt and implement a written policy on forfeiture that is identical or substantially similar to the model policies developed under paragraphs (a) and (b). The written policy shall be made available to the public upon request.\nThe appropriate agency shall not directly or indirectly transfer property subject to forfeiture under sections 609.531 to 609.5318 to a federal agency for adoption if the forfeiture would be prohibited under state law.",
	"repealed": false
}