{
	"id": "260C.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.331",
	"title": "260C.331 COSTS OF CARE.",
	"text": "(a) Except where parental rights are terminated,\n(1) whenever legal custody of a child is transferred by the court to a responsible social services agency,\n(2) whenever legal custody is transferred to a person other than the responsible social services agency, but under the supervision of the responsible social services agency, or\n(3) whenever a child is given physical or mental examinations or treatment under order of the court, and no provision is otherwise made by law for payment for the care, examination, or treatment of the child, these costs are a charge upon the welfare funds of the county in which proceedings are held upon certification of the judge of juvenile court.\n(b) The court may order, and the responsible social services agency may require, the parents or custodian of a child, while the child is under the age of 18, to use income and resources attributable to the child for the period of care, examination, or treatment, except for clothing and personal needs allowance as provided in section 256B.35, to reimburse the county for the cost of care, examination, or treatment. Income and resources attributable to the child include, but are not limited to, Social Security benefits, Supplemental Security Income (SSI), veterans benefits, railroad retirement benefits and child support. When the child is over the age of 18, and continues to receive care, examination, or treatment, the court may order, and the responsible social services agency may require, reimbursement from the child for the cost of care, examination, or treatment from the income and resources attributable to the child less the clothing and personal needs allowance. Income does not include earnings from a child over the age of 18 who is working as part of a plan under section 260C.212, subdivision 1, paragraph (c), clause (12), to transition from foster care, or the income and resources that are needed to complete the requirements listed in section 260C.203. The responsible social services agency shall determine whether requiring reimbursement, either through child support or parental fees, for the cost of care, examination, or treatment from the parents or custodian of a child is in the child's best interests. In determining whether to require reimbursement, the responsible social services agency shall consider:\n(1) whether requiring reimbursement would compromise the parent's ability to meet the requirements of the reunification plan;\n(2) whether requiring reimbursement would compromise the parent's ability to meet the child's needs after reunification; and\n(3) whether redirecting existing child support payments or changing the representative payee of social security benefits to the responsible social services agency would limit the parent's ability to maintain financial stability for the child.\n(c) If the income and resources attributable to the child are not enough to reimburse the county for the full cost of the care, examination, or treatment, the court may inquire into the ability of the parents to reimburse the county for the cost of care, examination, or treatment and, after giving the parents a reasonable opportunity to be heard, the court may order, and the responsible social services agency may require, the parents to contribute to the cost of care, examination, or treatment of the child. When determining the amount to be contributed by the parents, the court shall use a fee schedule based upon ability to pay that is established by the responsible social services agency and approved by the commissioner of children, youth, and families. The income of a stepparent who has not adopted a child shall be excluded in calculating the parental contribution under this section. In determining whether to require reimbursement, the responsible social services agency shall consider:\n(1) whether requiring reimbursement would compromise the parent's ability to meet the requirements of the reunification plan;\n(2) whether requiring reimbursement would compromise the parent's ability to meet the child's needs after reunification; and\n(3) whether requiring reimbursement would compromise the parent's ability to meet the needs of the family.\n(d) If the responsible social services agency determines that reimbursement is in the child's best interests, the court shall order the amount of reimbursement attributable to the parents or custodian, or attributable to the child, or attributable to both sources, withheld under chapter 518A from the income of the parents or the custodian of the child. A parent or custodian who fails to pay without good reason may be proceeded against for contempt, or the court may inform the county attorney, who shall proceed to collect the unpaid sums, or both procedures may be used.\n(e) If the court orders a physical or mental examination for a child, the examination is a medically necessary service for purposes of determining whether the service is covered by a health insurance policy, health maintenance contract, or other health coverage plan. Court-ordered treatment shall be subject to policy, contract, or plan requirements for medical necessity. Nothing in this paragraph changes or eliminates benefit limits, conditions of coverage, co-payments or deductibles, provider restrictions, or other requirements in the policy, contract, or plan that relate to coverage of other medically necessary services.\n(f) Notwithstanding paragraph (b), (c), or (d), a parent, custodian, or guardian of the child is not required to use income and resources attributable to the child to reimburse the county for costs of care and is not required to contribute to the cost of care of the child during any period of time when the child is returned to the home of that parent, custodian, or guardian pursuant to a trial home visit under section 260C.201, subdivision 1, paragraph (a).\nWhenever a child is placed in a group foster care facility as provided in section 260C.201, subdivision 1, paragraph (b), clause (2) or (3), the cost of providing the care shall, upon certification by the juvenile court, be paid from the welfare fund of the county in which the proceedings were held. To reimburse the counties for the costs of promoting the establishment of suitable group foster homes, the state shall quarterly, from funds appropriated for that purpose, reimburse counties 50 percent of the costs not paid by federal and other available state aids and grants. Reimbursement shall be prorated if the appropriation is insufficient.\nThe commissioner of corrections shall establish procedures for reimbursement and certify to the commissioner of management and budget each county entitled to receive state aid under the provisions of this subdivision. Upon receipt of a certificate the commissioner of management and budget shall issue a state payment to the county treasurer for the amount due, together with a copy of the certificate prepared by the commissioner of corrections.\nThe following expenses are a charge upon the county in which proceedings are held upon certification of the judge of juvenile court or upon such other authorization provided by law:\n(1) the fees and mileage of witnesses, and the expenses and mileage of officers serving notices and subpoenas ordered by the court, as prescribed by law;\n(2) the expense of transporting a child to a place designated by a child-placing agency for the care of the child if the court transfers legal custody to a child-placing agency;\n(3) the expense of transporting a minor to a place designated by the court;\n(4) reasonable compensation for an attorney appointed by the court to serve as counsel.\nThe State Guardian Ad Litem Board shall pay for guardian ad litem expenses and reasonable compensation for an attorney to serve as counsel for a guardian ad litem, if necessary. In no event may the court order that guardian ad litem expenses or compensation for an attorney serving as counsel for a guardian ad litem be charged to a county.\nThe county charged with the costs and expenses under subdivisions 1 and 3 may recover these costs and expenses from the county where the minor has legal settlement for general assistance purposes by filing verified claims which shall be payable as are other claims against the county. A detailed statement of the facts upon which the claim is based shall accompany the claim. If a dispute relating to general assistance settlement arises, the responsible social services agency of the county denying legal settlement shall send a detailed statement of the facts upon which the claim is denied together with a copy of the detailed statement of the facts upon which the claim is based to the commissioner of human services. The commissioner shall immediately investigate and determine the question of general assistance settlement and shall certify findings to the responsible social services agency of each county. The decision of the commissioner is final and shall be complied with unless, within 30 days thereafter, action is taken in district court as provided in section 142A.20.\n(a) In proceedings in which the court has appointed counsel pursuant to sections 260C.163, subdivision 3, and 611.14, clause (4), for a minor unable to employ counsel, the court shall inquire into the ability of the parents to pay for such counsel's services and, after giving the parents a reasonable opportunity to be heard, may order the parents to pay attorney fees.\n(b) In proceedings in which the court has appointed counsel pursuant to section 260C.163, subdivision 3, for a parent, guardian, or custodian, the court shall inquire into the ability of the parents, guardians, or custodians to pay for such counsel's services and, after giving these persons a reasonable opportunity to be heard, may order the appropriate person to pay attorney fees.\n(c) The court may order the appropriate person or persons under paragraph (a) or (b), or both, to reimburse the governmental unit providing counsel for the cost of appointed counsel. In determining the amount of reimbursement, the court shall consider the appropriate person's income, assets, and employment. If reimbursement is required under this subdivision, the court shall order the reimbursement when counsel is first appointed or as soon as possible after the court determines that reimbursement is required. The court may accept partial reimbursement from a person if the person's financial circumstances warrant establishing a reduced reimbursement schedule. If the person does not agree to make payments, the court may order the person's employer to withhold a percentage of the person's income to be turned over to the court.\n(a) In proceedings in which the court appoints a guardian ad litem pursuant to section 260C.163, subdivision 5, paragraph (a), the court may inquire into the ability of the parents to pay for the guardian ad litem's services and, after giving the parents a reasonable opportunity to be heard, may order the parents to pay guardian ad litem fees.\n(b) In each fiscal year, the commissioner of management and budget shall deposit guardian ad litem reimbursements in the special revenue fund and credit them to a separate account with the State Guardian Ad Litem Board. The balance of this account is appropriated to the State Guardian Ad Litem Board and does not cancel but is available until expended. Revenue from this account must be spent in the judicial district in which the reimbursement is collected.\n(a) If the responsible social services agency receives Retirement, Survivors, and Disability Insurance; Supplemental Security Income; veteran's benefits; railroad retirement benefits; or black lung benefits on behalf of a child, it must provide written notice by certified mail, return receipt requested to:\n(1) the child, if the child is 13 years of age or older;\n(2) the child's parent, guardian, or custodian or if there is no legal parent or custodian, the child's relative selected by the agency;\n(3) the guardian ad litem;\n(4) the legally responsible agency as defined in section 142A.602, if different than the responsible social services agency; and\n(5) the counsel appointed for the child pursuant to section 260C.163, subdivision 3.\n(b) If the responsible social services agency receives benefits under this subdivision on behalf of a child 13 years of age or older, the legally responsible agency as defined in section 142A.602, subdivision 13, if different, and the guardian ad litem must disclose this information to the child in person in a manner that best helps the child understand the information. This paragraph does not apply in circumstances where the child is living outside of Minnesota.\n(c) If the responsible social services agency receives the benefits listed under this subdivision on behalf of a child, it cannot use those funds for any other purpose than the care of that child. The responsible social services agency must not commingle any benefits received under this subdivision and must not put the benefits received on behalf of a child into a general fund.\n(d) If the responsible social services agency receives any benefits listed under this subdivision, it must keep a record of:\n(1) the total dollar amount it received on behalf of all children it receives benefits for;\n(2) the total number of children it applied to be a payee for; and\n(3) the total number of children it receives benefits for. By July 1, 2025, and each July 1 thereafter, the responsible social services agency must submit a report to the commissioner that includes the information required under this paragraph.",
	"repealed": false
}