{
	"id": "149A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.20",
	"title": "149A.20 LICENSE TO PRACTICE MORTUARY SCIENCE.",
	"text": "Except as provided in section 149A.01, subdivision 3, any person who takes charge of or removes from the place of death a dead human body, or prepares a dead human body for final disposition in any manner, or arranges, directs, or supervises a funeral, memorial service, or graveside service must possess a valid license to practice mortuary science issued by the commissioner. A funeral establishment may provide a nonlicensed individual to direct or supervise a memorial service provided they disclose that information to the person or persons with the authority to make the funeral arrangement as provided in section 149A.80.\nThe requirements in subdivisions 3 to 13 for initial licensure in mortuary science are effective on July 1, 1997, except as provided in this chapter.\nThe person must be at least 21 years of age.\nThe person shall have:\n(1) received a bachelor of science degree with a major in mortuary science from an accredited college or university;\n(2) received a bachelor of science or arts degree from an accredited college or university and completed a separate course of study in mortuary science from a college of funeral service education accredited by the American Board of Funeral Service Education; or\n(3) completed credit hours at accredited colleges or universities that in the numerical aggregate and distribution are the functional equivalent of a bachelor of arts or science degree and have completed a separate course of study in mortuary science from a program of mortuary science accredited by the American Board of Funeral Service Education.\nAfter having met the educational requirements of subdivision 4, a person must attain a passing score on the National Board Examination administered by the Conference of Funeral Service Examining Boards of the United States, Inc. or any other examination that, in the determination of the commissioner, adequately and accurately assesses the knowledge and skills required to practice mortuary science. In addition, a person must attain a passing score on the state licensing examination administered by or on behalf of the commissioner. The state examination shall encompass the laws and rules of Minnesota that pertain to the practice of mortuary science. The commissioner shall make available copies of all pertinent laws and rules prior to administration of the state licensing examination. If a passing score is not attained on the state examination, the individual must wait two weeks before they can retake the examination.\n(a) A person who attains a passing score on both examinations in subdivision 5 must complete a registered internship under the direct supervision of an individual currently licensed to practice mortuary science in Minnesota. Interns must file with the commissioner:\n(1) the appropriate fee; and\n(2) a registration form indicating the name and home address of the intern, the date the internship begins, and the name, license number, and business address of the supervising mortuary science licensee.\n(b) Any changes in information provided in the registration must be immediately reported to the commissioner. The internship shall be a minimum of 2,080 hours to be completed within a three-year period, however, the commissioner may waive up to 520 hours of the internship time requirement upon satisfactory completion of a clinical or practicum in mortuary science administered through the program of mortuary science of the University of Minnesota or a substantially similar program approved by the commissioner. Registrations must be renewed on an annual basis if they exceed one calendar year. During the internship period, the intern must be under the direct supervision of a person holding a current license to practice mortuary science in Minnesota. An intern may be registered under only one licensee at any given time and may be directed and supervised only by the registered licensee. The registered licensee shall have only one intern registered at any given time. The commissioner shall issue to each registered intern a registration permit that must be displayed with the other establishment and practice licenses. While under the direct supervision of the licensee, the intern must complete 25 case reports in each of the following areas: embalming, funeral arrangements, and services. Case reports, on forms provided by the commissioner, shall be completed by the intern and filed with the commissioner prior to the completion of the internship. Information contained in these reports that identifies the subject or the family of the subject embalmed or the subject or the family of the subject of the funeral shall be classified as licensing data under section 13.41, subdivision 2.\nAfter completing the registered internship, the applicant for an initial license to practice mortuary science must submit to the commissioner a complete application and the appropriate fee. A complete application includes:\n(1) a completed application form, as provided by the commissioner;\n(2) proof of age;\n(3) an official transcript from each post high school educational institution attended, including colleges of funeral service education;\n(4) certification of a passing score on the National Board Examination from the commissioner of the Conference of Funeral Service Examining Boards of the United States, Inc.;\n(5) a copy of the notification of a passing score on the state licensing examination; and\n(6) a signed, dated, and notarized affidavit from the licensee who supervised the Minnesota internship stating the date the internship began and ended and that both the applicant and the supervising licensee fulfilled the requirements under subdivision 6.\nUpon receipt of the completed application and appropriate fee, the commissioner shall review and verify all information. Upon completion of the verification process and resolution of any deficiencies in the application information, the commissioner shall make a determination, based on all the information available, to grant or deny licensure. If the commissioner's determination is to grant licensure, the applicant shall be notified and the license shall issue and remain valid for a period prescribed on the license, but not to exceed one calendar year from the date of issuance of the license. If the commissioner's determination is to deny licensure, the commissioner must notify the applicant, in writing, of the denial and provide the specific reason for the denial.\n[Repealed, 2013 c 108 art 12 s 109]\nAll licenses to practice mortuary science issued by the commissioner shall be valid for one calendar year, beginning on January 1 and ending on December 31 regardless of the date of issuance. Fees may not be prorated.\nEach license to practice mortuary science must be conspicuously displayed at all times in the holder's place of business. Conspicuous display means in a location where a member of the general public within the holder's place of business will be able to observe and read the license.\nA license to practice mortuary science is not assignable or transferable and is not valid for any person other than the individual named.\nAny change of license information must be reported to the commissioner, on forms provided by the commissioner, no later than 30 calendar days after the change occurs. Failure to report changes is grounds for disciplinary action.\nAll information submitted to the commissioner by an applicant for licensure to practice mortuary science is classified as licensing data under section 13.41, with the exception of the name and address of the applicant. Upon issuance of a license to practice mortuary science, all application information becomes licensing data under section 13.41, subdivision 5, with the exception of internship case report data as classified under subdivision 6.",
	"repealed": false
}