{
	"id": "308C.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/308C.005",
	"title": "308C.005 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Address\" means the mailing address, including a zip code. In the case of a registered address, the term means mailing address and the actual office location, which may not be a post office box.\n\"Alternative ballot\" means a method of voting on a candidate or issue prescribed by the board of directors in advance of the vote and may include voting by electronic, telephonic, Internet, or other means that reasonably allow members the opportunity to vote.\n\"Articles\" means the articles of organization of a cooperative as originally filed and subsequently amended.\n\"Association\" means an organization conducting business on a cooperative plan under the laws of this state or another state that is chartered to conduct business under other laws of this state.\n\"Board of directors\" or \"board\" means the board of directors of a cooperative.\n\"Business entity\" means a company, limited liability company, limited liability partnership, or other legal entity, whether domestic or foreign, association, or body vested with the power or function of a legal entity.\n\"Chapter\" means sections 308C.001 to 308C.975.\n\"Cooperative\" means a cooperative organized under this chapter providing housing opportunities on a cooperative plan as provided under this chapter.\n\"Common elements\" means all portions of the cooperative other than a dwelling unit or a manufactured home.\n\"Common expenses\" means expenditures made or liabilities incurred by or on behalf of the cooperative together with any allocations to reserves.\n\"Common expense liability\" means the liability for common expenses allocated to each dwelling unit which shall be allocated by a method provided for in the bylaws pursuant to section 308C.241, subdivision 2, paragraph (a), clause 7.\n\"Developer\" means a real estate developer in the business of building dwelling units that will be owned and operated by a cooperative organized under this chapter.\n\"Domestic business entity\" means a business entity organized under the laws of this state.\n\"Domestic cooperative\" means a cooperative organized under this chapter, chapter 308A, or chapter 308B.\n\"Dwelling unit\" means a residential housing unit consisting of a group of rooms and hallways which are designated or intended for use as living quarters for an individual, family, or other persons living together.\n\"Filed with the secretary of state\" means a document meeting the applicable requirements of this chapter, signed and accompanied by the required filing fee that has been delivered to the Office of the Secretary of State. The secretary of state shall endorse on the document the word \"filed\" or a similar word determined by the secretary of state; the month, day, and year of filing; record the document in the Office of the Secretary of State; and return the document to the person or entity who delivered it for filing.\n\"Foreign business entity\" means a business entity that is not a domestic business entity.\n\"Foreign cooperative\" means a foreign business entity organized to conduct business on a cooperative plan consistent with this chapter, chapter 308A, or chapter 308B.\n\"Housing cooperative\" means a housing cooperative governed by this chapter to provide housing on a not-for-profit and cooperative basis in accordance with the organizational purposes contemplated in this chapter.\n\"Housing facility\" means a multiunit dwelling, a manufactured home park, shared wall units or townhomes, and one or more single-family homes or detached homes or structures intended to be used for residential housing.\n\"Limited equity cooperative\" means a cooperative governed by this chapter that limits the appreciation and value of a membership interest to a formula price set forth in the bylaws that is defined as the transfer value herein. A limited equity cooperative also sets limits on the extent to which a member may transfer a membership interest and provides for a right of first refusal to purchase the interest in favor of the cooperative.\n\"Low income\" means having income that is less than or equal to 80 percent of median income for the area, adjusted for family size, in accordance with federal standards generally accepted at the time of organization and comparable to standards of the United States Department of Housing and Urban Development existing on June 16, 1988.\n\"Lot\" means an area within a manufactured home park or another parcel of real property, designed or used for the accommodation of a manufactured home or structure intended to be used for residential housing.\n\"Manufactured home\" means a structure, not affixed to or part of real estate, transportable in one or more sections that is eight body feet or more in width or 40 body feet or more in length in the traveling mode, or, when erected on site is 320 or more square feet, and is built on a permanent chassis and designed to be used as a dwelling with or without a permanent foundation when connected to the required utilities, and includes the plumbing, heating, air conditioning, and electrical systems contained in the home.\n\"Manufactured home park\" means any site, lot, field, or tract of land upon which two or more occupied manufactured homes are located, either free of charge or for compensation, and includes any building, structure, tent, vehicle, or enclosure used or intended for use as part of the equipment of the manufactured home park.\n\"Member\" means any person who is approved for membership in the cooperative pursuant to the articles of organization or bylaws and who is identified as a member on the books and records of the cooperative and has been issued a membership certificate. Membership certificates include owner members and nonoccupant members.\n\"Membership certificate\" means a certificate evidencing ownership of a membership interest in the cooperative.\n\"Membership interest\" means a member's interest in a cooperative consisting of a member's financial rights, a member's right to assign financial rights, a member's governance rights, and a member's right to assign governance rights. Membership interest includes occupant membership interests and nonoccupant membership interests.\n\"Member meeting\" means a regular or special meeting of the members.\n\"Membership purchase and sale agreement\" means the contract for purchase of a membership interest to which a particular dwelling unit is appurtenant between the member who is selling the membership interest and an incoming prospective member of the cooperative who has been approved for membership by the cooperative's board of directors.\n\"Minnesota limited liability company\" means a limited liability company governed by chapter 322C.\n\"Moderate income\" means less than or equal to 100 percent of median income for the area, adjusted for family size, in accordance with federal standards generally accepted at the time of organization and comparable to standards of the United States Department of Housing and Urban Development existing on June 16, 1988.\n\"Nonoccupant membership interest\" means a membership interest that does not require the holder to be an occupant or resident of the cooperative.\n\"Occupant\" means any person legally entitled to occupy a dwelling unit, whether a member, spouse or partner of a member, or permitted sublessee or guest of a member.\n\"Occupant membership interest\" means the composite ownership of both a membership certificate issued by the cooperative and a possessory right of occupancy of a dwelling unit or lot pursuant to an occupancy agreement or proprietary lease, including a member's financial rights and a member's governance rights.\n\"Occupancy agreement\" means the agreement between the member and the cooperative describing the terms and conditions under which the member will occupy the dwelling unit or lot appurtenant to the member's membership interest.\n\"Older persons\" means natural persons who are age 55 and older in accordance with the applicable provisions of the Fair Housing Act, Title VIII of the Civil Rights Act of 1968, as amended; United States Code, title 42, chapter 3607, section 807(a)(b)(1)(2), and the rules and regulations of the United States Department of Housing and Urban Development applicable with respect to housing for older persons contained in Code of Federal Regulations, title 24, subtitle B, chapter I, subpart E, section 100.300-308.\n\"Person\" means a natural person, domestic or foreign business or nonprofit corporation, domestic and foreign limited liability company, limited partnership, joint venture, association, trust, estate, enterprise, or other legal or commercial entity.\n\"Project\" means the real property and improvements on the real property owned by the cooperative and appurtenant facilities, constituting the cooperative's housing facility or a manufactured home park.\n\"Proprietary lease\" means an agreement with a cooperative governing a member's right to occupancy under which a member has an exclusive possessory interest in a unit or lot.\n\"Resident\" means any occupant of space owned by the cooperative or an owner of a manufactured home who rents a lot in a manufactured home park and includes the members of the resident's household.\n\"Security interest\" means the lien on and security interest in a membership and occupancy agreement.\n\"Senior housing cooperative\" means a housing cooperative governed by this chapter to provide housing on a not-for-profit and cooperative basis to older persons in accordance with the applicable provisions of the Fair Housing Act, Title VIII of the Civil Rights Act of 1968, as amended; United States Code, title 42, chapter 3607, section 807(a)(b)(1)(2), and the rules and regulations of the United States Department of Housing and Urban Development applicable with respect to housing for older persons contained in Code of Federal Regulations, title 24, subtitle B, chapter I, subpart E, section 100.300-308.\nThe signature of a person subscribed on a document, with respect to a document required by this chapter to be filed with the secretary of state, means that the document has been signed by a person authorized to do so by this chapter, the articles or bylaws, or by a resolution approved by the directors or the members. A signature on a document may be a facsimile affixed, engraved, printed, placed, stamped with indelible ink, transmitted by facsimile or electronically, or in any other manner reproduced on the document.\n\"Subscription agreement\" means the contract of purchase between a prospective member and the cooperative of a membership interest in the cooperative.\n\"Transfer value\" means the formula price at which the cooperative may purchase the membership interest of a deceased or departing member in a limited equity cooperative.\n\"Unit\" means a portion of the cooperative property leased for exclusive occupancy by a member under a proprietary lease or leased to a tenant by an occupancy agreement.",
	"repealed": false
}