{
	"id": "193.146",
	"url": "https://www.revisor.mn.gov/statutes/cite/193.146",
	"title": "193.146 ISSUANCE OF BONDS.",
	"text": "In anticipation of the receipt of such corporation of the tax proceeds, appropriations, rents, and profits specified in section 193.145, and of income from any other source, and for the purpose of securing funds as needed for payment of the cost of such new armories and for other purposes herein authorized, such corporation is hereby authorized to issue its bonds bearing interest at a rate not to exceed the maximum prescribed by section 475.55, payable semiannually.\nSuch bonds shall be of such date, denomination, place of payment, form, and details as may be determined by such corporation not inconsistent with the provisions of sections 193.141 to 193.149. Such bonds shall mature serially, the first installment to fall due in not more than five years and the last in not more than 40 years from their date, and no annual maturing installment shall exceed by 2-1/2 times the amount of the smallest annual maturing installment; provided, that the amount of such installments of principal may be such that the increase thereof from year to year shall approximately equal the decrease from year to year in the interest on the bonds remaining unpaid.\nSuch bonds shall be signed by the adjutant general, as chair, attested by the secretary, and countersigned by the treasurer of such corporation, and the interest coupons to be thereto attached shall be executed and authenticated by the printed, engraved, or lithographed facsimile signatures of such chair and secretary.\nThe bonds shall be sold by the corporation under notice and upon the terms and at times as the corporation shall deem best. The bonds shall not be deemed or construed to be debts of the state of Minnesota or of the county or municipality in which the armory is situated, nor to impose any personal liability upon any member of the corporation, but shall be payable solely out of the income to be received by the corporation as specified herein. Bonds legally issued pursuant hereto shall be deemed authorized securities within the provisions of section 50.14, and laws supplemental thereto, and shall be proper for the investment of capital, surplus, or deposits of any savings bank or trust company, and for the investment of funds of any insurance company, and for the investment of any sinking funds held by any public or municipal corporation, and may be pledged by any bank or trust company as security for the deposit of public moneys therein in lieu of surety bonds. The bonds shall be deemed and treated as instrumentalities and obligations of a public governmental agency.",
	"repealed": false
}