{
	"id": "325E.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.06",
	"title": "325E.06 REPURCHASE OF FARM MACHINERY, IMPLEMENTS, ATTACHMENTS AND PARTS UPON TERMINATION OF CONTRACT.",
	"text": "Whenever any person, firm, or corporation engaged in the business of selling and retailing farm implements and repair parts for farm implements enters into a written or oral contract, sales agreement, or security agreement whereby the retailer agrees with any wholesaler, manufacturer, or distributor of farm implements, machinery, attachments or repair parts or outdoor power equipment, attachments, or repair parts to maintain a stock of parts or complete or whole machines, or attachments, and thereafter the written or oral contract, sales agreement, or security agreement is terminated, canceled, or discontinued, then the wholesaler, manufacturer, or distributor shall pay to the retailer or credit to the retailer's account, if the retailer has outstanding any sums owing the wholesaler, manufacturer, or distributor, unless the retailer should desire and has a contractual right to keep such merchandise, a sum equal to 100 percent of the net cost of all unused complete farm implements, machinery, and attachments or outdoor power equipment and attachments in new condition which have been purchased by the retailer from the wholesaler, manufacturer, or distributor within the 24 months immediately preceding notification by either party of intent to terminate, cancel, or discontinue the contract, including transportation charges and reasonable assembly charges which have been paid by the retailer, or invoiced to retailer's account by the wholesaler, manufacturer, or distributor and the following:\n(a) 95 percent of the current net prices on repair parts, including superseded parts listed in current price lists or catalogs in use by the wholesaler, manufacturer, or distributor or its predecessor on the date of the termination, cancellation, or discontinuance of the contract;\n(b) as to any parts not listed in current price lists or catalogs, 100 percent of the invoiced price of the repair part for which the retailer has an invoice which parts had previously been purchased by the retailer from the wholesaler, manufacturer, or distributor and are held by the retailer on the date of the termination, cancellation, or discontinuance of the contract or thereafter received by the retailer from the wholesaler, manufacturer, or distributor;\n(c) 50 percent of the most recently published price of all other parts provided the price list or catalog is not more than ten years old as of the date of the cancellation or discontinuance of the contract;\n(d) net cost less 20 percent per year depreciation for five years following purchase of all data processing and communications hardware and software the retailer purchased from the wholesaler, manufacturer, or distributor, or an approved vendor of the wholesaler, manufacturer, or distributor, to meet the minimum requirements for the hardware and software as set forth by the wholesaler, manufacturer, or distributor; and\n(e) an amount equal to 75 percent of the net cost to the retailer of specialized repair tools, including computerized diagnostic hardware and software, and signage purchased by the retailer pursuant to the requirements of the wholesaler, manufacturer, or distributor, except that specialized repair tools and signage that has never been used must be repurchased at 100 percent of the retailer's cost. Specialized repair tools must be unique to the wholesaler's, manufacturer's, or distributor's product line, specifically required by the wholesaler, manufacturer, or distributor, and must be in complete and usable condition. The wholesaler, manufacturer, or distributor may require by contract or agreement that the retailer resell to the wholesaler, manufacturer, or distributor the specialized repair tools and signage for the amounts established in this section or the amount specified in the dealer agreement or contract or fair market value, whichever is greater.\nThe wholesaler, manufacturer, or distributor shall also pay the retailer or credit to the retailer's account a sum equal to five percent of the prices required to be paid or credited by this subdivision for all parts, data processing and communications hardware and software, and specialized repair tools and signage returned for the handling, packing, and loading of the parts back to the wholesaler, manufacturer, or distributor unless the wholesaler, manufacturer, or distributor elects to perform inventorying, packing, and loading of the parts, data processing and communications hardware and software, and specialized repair tools and signage itself. Upon the payment or allowance of credit to the retailer's account of the sum required by this subdivision, the title to the farm implements, farm machinery, attachments or repair parts, or outdoor power equipment and repair parts for outdoor power equipment, data processing and communications hardware and software, and specialized repair tools and signage shall pass to the manufacturer, wholesaler, or distributor making the payment or allowing the credit and the manufacturer, wholesaler, or distributor shall be entitled to the possession of the farm implements, machinery, attachments or repair parts, or outdoor power equipment and repair parts for outdoor power equipment, data processing and communications hardware and software, and specialized repair tools and signage. However, this section shall not in any way affect any security interest which the wholesaler, manufacturer, or distributor may have in the inventory of the retailer.\nPayment required to be made under this subdivision must be made not later than 60 days from the date the farm implements, machinery, attachments, repair parts, outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage are received by the manufacturer, and if not by then paid, the amount payable by the wholesaler, manufacturer, or distributor bears interest at the maximum rate allowed by law from the date the contract was terminated, canceled, or discontinued until the date payment is received by the retailer.\nIn lieu of the return of the farm implements, machinery, attachments, and repair parts, or outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage to the wholesaler, manufacturer, or distributor, the retailer may advise the wholesaler, manufacturer, or distributor that the retailer has implements, machinery, attachments, or repair parts, or outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage that the retailer intends to return. The notice of the dealer's intention to return must be in writing, sworn to before a notary public as to the accuracy of the listing of implements, machinery, attachments, or repair parts, or outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage and that all of the items are in usable condition. The notice must include the name and business address of the person or business who has possession and custody of the machinery and parts and where the machinery and parts may be inspected and the list of farm implements, machinery, attachments, or repair parts, or outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage may be verified. The notice must also state the name and business address of the person or business who has the authority to serve as the escrow agent of the retailer, to accept payment or a credit to the retailer's account on behalf of the retailer, and to release the machinery and parts to the wholesaler, manufacturer, or distributor. The notice constitutes the appointment of the escrow agent to act on the retailer's behalf. The wholesaler, manufacturer, or distributor has 30 days from the date of the mailing of the notice, which shall be by certified mail, in which to inspect the machinery and parts and verify the accuracy of the retailer's list. The wholesaler, manufacturer, or distributor shall, within ten days after inspection:\n(1) pay the escrow agent;\n(2) give evidence that a credit to the account of the retailer has been made if the retailer has outstanding sums due the wholesaler, manufacturer, or distributor; or\n(3) send to the escrow agent a \"dummy credit list\" and shipping labels for the return of the machinery or parts to the wholesaler, manufacturer, or distributor that are acceptable as returns.\nIf the wholesaler, manufacturer, or distributor sends a credit list to the escrow agent, payment or a credit against the dealer's indebtedness in accordance with this subdivision for the acceptable returns shall accompany the credit list. On the receipt of the payment, evidence of a credit to the account of the retailer or the credit list with payment, the title to the farm implements, farm machinery, attachments, or repair parts, outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage acceptable as returns passes to the manufacturer, wholesaler, or distributor making the payment or allowing the credit and the manufacturer, wholesaler, or distributor is entitled to keep the farm implements, machinery, attachments, or repair parts, or outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage. The escrow agent shall ship or cause to be shipped the machinery and parts acceptable as returns to the wholesaler, manufacturer, or distributor unless the wholesaler, manufacturer, or distributor elects to personally perform the inventorying, packing and loading of the machinery and parts. When the machinery or parts have been received by the wholesaler, manufacturer, or distributor, notice of the receipt of the machinery or parts shall be sent by certified mail to the escrow agent who shall then disburse 90 percent of the payment it has received, less its actual expenses and a reasonable fee for its services, to the retailer. The escrow agent shall keep the balance of the funds in the retailer's escrow account until it is notified that an agreement has been reached as to the nonreturnables after which the escrow agent shall disburse the remaining funds and dispose of any remaining parts or machinery as provided in the settlement. If no settlement is reached in a reasonable time, the escrow agent may refer the matter to an arbitrator who has authority to resolve all unsettled issues in the dispute.\nThe provisions of this section shall be supplemental to any agreement between the retailer and the manufacturer, wholesaler or distributor covering the return of farm implements, machinery, attachments and repair parts. The retailer can elect to pursue either the retailer's contract remedy or the remedy provided herein, and an election by the retailer to pursue the contract remedy shall not bar the retailer's right to the remedy provided herein as to those farm implements, machinery, attachments and repair parts not affected by the contract remedy. Notwithstanding anything contained herein, the rights of a manufacturer, wholesaler or distributor to charge back to the retailer's account amounts previously paid or credited as a discount incident to the retailer's purchase of goods shall not be affected. Further, any repurchase hereunder shall not be subject to the provisions of the bulk sales law.\nIn the event of the death of the retail dealer or majority stockholder in a corporation operating a retail dealership in the business of selling and retailing farm implements, machinery, attachments or repair parts therefor, the manufacturer, wholesaler or distributor shall, unless the heir or heirs of the deceased agree to continue to operate the dealership, repurchase the merchandise from the heir or heirs upon the same terms and conditions as are otherwise provided in this section. In the event the heir or heirs do not agree to continue to operate the retail dealership, it shall be deemed a cancellation or discontinuance of the contract by the retailer under the provisions of subdivision 1.\nIn the event that any manufacturer, wholesaler, or distributor of farm implements, machinery, attachments and repair parts, or outdoor power equipment and attachments and repair parts, data processing and communications hardware and software, and specialized repair tools and signage, upon the cancellation of a contract by either a retailer or such manufacturer, wholesaler, or distributor, fails or refuses to make payment to the dealer or the dealer's heir or heirs as required by this section, the manufacturer, wholesaler, or distributor shall be liable in a civil action to be brought by the retailer or the retailer's heir or heirs for (a) 100 percent of the net cost of the farm implements, machinery, and attachments, (b) transportation charges and reasonable assembly which have been paid by the retailer, (c) 95 percent of the current net price of repair parts, 100 percent of invoiced prices and 50 percent of the price of all other parts as provided in subdivision 1, and (d) five percent for handling, packing and loading, if applicable.\nUnless a retailer has delivered parts to an escrow agent pursuant to subdivision 1, this section shall not require the repurchase from a retailer of a repair part where the retailer previously has failed to return the repair part to the wholesaler, manufacturer, or distributor after being offered a reasonable opportunity to return the repair part at a price not less than (a) 95 percent of the net price of the repair part as listed in the then current price list or catalog, (b) 100 percent of the invoiced price, and (c) 50 percent of the most recent published price as provided in subdivision 1. This section shall not require the repurchase from a retailer of repair parts which have a limited storage life or are otherwise subject to deterioration, such as rubber items, gaskets and batteries, unless those items have been purchased from the wholesaler, manufacturer, or distributor within the past two years; repair parts which because of their condition are not resalable as new parts without reconditioning; repair parts which have lost required traceability for quality assurance requirements; and repair parts that were marked nonreturnable or future nonreturnable when the retailer ordered them.\n(a) For the purposes of this section \"farm implements\" mean every vehicle designed or adapted and used exclusively for agricultural operations and only incidentally operated or used upon the highways.\n(b) For the purposes of this section, \"outdoor power equipment\" does not include motorcycles, boats, personal watercraft, snowmobiles, or all-terrain vehicles designed for recreation.\nThe obligations under this section of a wholesaler, manufacturer, or distributor apply to its successor in interest or assignee. A successor in interest includes a purchaser of assets or stock, a surviving corporation resulting from a merger or liquidation, a receiver, and a trustee of the original wholesaler, manufacturer, or distributor.",
	"repealed": false
}