{
	"id": "480.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.45",
	"title": "480.45 REMOVAL OF PERSONAL INFORMATION.",
	"text": "If personal information about a judicial official is publicly posted to the Internet by a person, business, association, or government entity, the judicial official may submit a sworn affidavit to the person, business, association, or government entity requesting that the publicly posted personal information be removed. The affidavit shall:\n(1) state that the individual whose information was disseminated is a judicial official as defined in section 480.40;\n(2) describe with specificity the personal information that the judicial official seeks to remove; and\n(3) state the name of the publication, website, or otherwise identify where the judicial official's personal information is available to the public.\n(a) Upon receipt of an affidavit requesting removal of the personal information of a judicial official that meets the requirements of subdivision 1, the person, business, association, or government entity shall remove the publicly posted personal information within 30 days. If the person, business, association, or government entity fails to remove the publicly posted personal information within 30 days after an affidavit is submitted, the judicial official may file a civil action in a court of competent jurisdiction seeking a court order compelling compliance, including injunctive and declarative relief.\n(b) Paragraph (a) shall not apply to personal information contained in:\n(1) real property records as defined in section 13.045, subdivision 1, clause (5);\n(2) uniform commercial code filings and tax liens maintained by the secretary of state; and\n(3) any other records maintained by a government entity evidencing title to, or any lien, judgment, or other encumbrance on, real or personal property.\nIf a person, business, association, or government entity knowingly violates an order granting injunctive or declarative relief, the court issuing such an order may award to the judicial official an amount equal to the actual damages sustained by the judicial official, and court costs and reasonable attorney fees.",
	"repealed": false
}