{
	"id": "62J.87",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.87",
	"title": "62J.87 PRESCRIPTION DRUG AFFORDABILITY BOARD.",
	"text": "The commissioner of commerce shall establish the Prescription Drug Affordability Board, which shall be governed as a board under section 15.012, paragraph (a), to protect consumers, state and local governments, health plan companies, providers, pharmacies, and other health care system stakeholders from unaffordable costs of certain prescription drugs.\n(a) The Prescription Drug Affordability Board consists of nine members appointed as follows:\n(1) seven voting members appointed by the governor;\n(2) one nonvoting member appointed by the majority leader of the senate; and\n(3) one nonvoting member appointed by the speaker of the house.\n(b) All members appointed must have knowledge and demonstrated expertise in pharmaceutical economics and finance or health care economics and finance. A member must not be an employee of, a board member of, or a consultant to a manufacturer or trade association for manufacturers, or a pharmacy benefit manager or trade association for pharmacy benefit managers.\n(c) Initial appointments must be made by January 1, 2024.\n(a) Board appointees shall serve four-year terms, except that initial appointees shall serve staggered terms of two, three, or four years as determined by lot by the secretary of state. A board member shall serve no more than two consecutive terms.\n(b) A board member may resign at any time by giving written notice to the board.\n(a) The governor shall designate an acting chair from the members appointed by the governor.\n(b) The board shall elect a chair to replace the acting chair at the first meeting of the board by a majority of the members. The chair shall serve for one year.\n(c) The board shall elect a vice-chair and other officers from its membership as it deems necessary.\n(a) The board shall hire an executive director and other staff, who shall serve in the unclassified service. The executive director must have knowledge and demonstrated expertise in pharmacoeconomics, pharmacology, health policy, health services research, medicine, or a related field or discipline.\n(b) The commissioner of health shall provide technical assistance to the board. The board may also employ or contract for professional and technical assistance as the board deems necessary to perform the board's duties.\n(c) The attorney general shall provide legal services to the board.\nThe board members shall not receive compensation but may receive reimbursement for expenses as authorized under section 15.059, subdivision 3.\n(a) Meetings of the board are subject to chapter 13D. The board shall meet publicly at least every three months to review prescription drug product information submitted to the board under section 62J.90. If there are no pending submissions, the chair of the board may cancel or postpone the required meeting. The board may meet in closed session when reviewing proprietary information, as determined under the standards developed in accordance with section 62J.91, subdivision 3.\n(b) The board shall announce each public meeting at least three weeks prior to the scheduled date of the meeting. Any materials for the meeting shall be made public at least two weeks prior to the scheduled date of the meeting.\n(c) At each public meeting, the board shall provide the opportunity for comments from the public, including the opportunity for written comments to be submitted to the board prior to a decision by the board.",
	"repealed": false
}