{
	"id": "514.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.93",
	"title": "514.93 SUMMARY SALE OF UNCLAIMED ANIMAL; NOTICE; PROCEEDS; RECORD.",
	"text": "Any unclaimed animal held by a veterinarian for more than ten days after the completion of veterinary care and treatment requested by the owner or lawful possessor of said animal may be summarily sold by the veterinarian for the reasonable value of said animal upon compliance with the procedures set forth in this section. Written notice of the completion of care and treatment and written notice of the proposed sale of said animal shall be given to the owner or lawful possessor of said animal by certified mail. If the whereabouts of the owner or lawful possessor of the animal cannot be ascertained with reasonable diligence, a notice of the proposed sale shall be published in a legal newspaper circulated in the county where the animal is located at least ten days preceding the sale. The notice shall state the amount due and the date, place and time of sale. The proceeds of such sale shall first be used to reimburse the veterinarian for an amount equal to the reasonable value of the veterinary care and treatment plus any other care and board given said animal; the excess amount, if any, from such sale shall be paid to the owner or lawful possessor of said animal or to other persons legally entitled thereto. Any veterinarian making a sale hereunder shall make a record in writing verified by the veterinarian's oath, setting forth the kind and number of animals sold, the amount realized from any such sale, the amount claimed due by the veterinarian, the name of the former owner or lawful possessor requesting the care and treatment performed by the veterinarian on the animal or animals sold, the dates when the treatment was commenced and was completed, the date or dates when notice of the proposed sale was given the owner or lawful possessor of the animal or animals sold, the description of the animal or animals sold, and if branded, the brand thereon, the name and address of the veterinarian making the sale and the name and address of purchaser or purchasers of the animal or animals sold. The record so made shall be filed within five days of the sale in the office of the county recorder of the county in which such sale is made.",
	"repealed": false
}