{
	"id": "524.5-108",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-108",
	"title": "524.5-108 VENUE.",
	"text": "(a) Venue for a guardianship proceeding for a minor is in the county of this state in which the minor resides or is present at the time the proceeding is commenced.\n(b) Venue for a guardianship proceeding for an incapacitated person is in the county of this state in which the respondent resides and, if the respondent has been admitted to an institution by order of a court of competent jurisdiction, in the county in which that court is located. Venue for the appointment of an emergency or a temporary guardian of an incapacitated person is also in the county in which the respondent is present.\n(c) Venue for a protective proceeding is in the county of this state in which the respondent resides, whether or not a guardian has been appointed in another place or, if the respondent does not reside in this state, in any county of this state in which property of the respondent is located.\n(d) If a proceeding under this article is brought in more than one county in this state, the court of the county in which the proceeding is first brought has the exclusive right to proceed unless that court determines that venue is properly in another court or that the interests of justice otherwise require that the proceeding be transferred.\n(e) If it is in the best interest of the person subject to guardianship or conservatorship, the venue may be transferred to another county. Upon the filing of a petition by any interested person, or upon the court's own motion, the court shall fix a time and place for the hearing on the transfer. Notice must be given to interested persons, the district court of the county to which venue is proposed to be transferred, and any other party the court designates. Upon proof that a transfer of venue is in the best interest of the person subject to guardianship or conservatorship or the estate of the person subject to guardianship or conservatorship, and upon settlement and allowance of the conservator's accounts, if any, to the time of the hearing, the court shall transmit the entire file to the court of the other county, where all subsequent proceedings must be held.",
	"repealed": false
}