{
	"id": "18K.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/18K.04",
	"title": "18K.04 LICENSING.",
	"text": "(a) A person must obtain a license from the commissioner before (1) growing industrial hemp, (2) processing industrial hemp, or (3) researching industrial hemp.\n(b) To obtain a license under paragraph (a), a person must apply to the commissioner in the form prescribed by the commissioner and must pay the annual registration and inspection fee established by the commissioner in accordance with section 16A.1285, subdivision 2.\n(c) For a license to grow industrial hemp, the license application must include the name and address of the applicant and the legal description of the land area or areas where industrial hemp will be grown by the applicant and any other information required under Code of Federal Regulations, title 7, part 990.\n(d) For a license to process industrial hemp, the license application must include the name and address of the applicant, the legal description of the processing location, and any other information required by the commissioner.\n(e) A licensee is responsible for compliance with the license requirements irrespective of the acts or omissions of an authorized representative acting on behalf of the licensee.\n(f) When an applicant has paid the fee and completed the application process to the satisfaction of the commissioner, the commissioner must issue a license which is valid until December 31 of the year of application.\n(g) A person licensed under paragraph (a) to grow industrial hemp is presumed to be growing industrial hemp for commercial or research purposes.\nThe commissioner must require each first-time applicant for a license to submit to a background investigation conducted by the Bureau of Criminal Apprehension as a condition of licensure. Any first-time authorized representatives designated by the applicant must also submit to a background investigation. As part of the background investigation, the Bureau of Criminal Apprehension must conduct criminal history checks of Minnesota records and is authorized to exchange fingerprints with the United States Department of Justice, Federal Bureau of Investigation for the purpose of a criminal background check of the national files. The cost of the investigation must be paid by the applicant. Criminal history records provided to the commissioner under this section must be treated as private data on individuals, as defined in section 13.02, subdivision 12.\nThe applicant must demonstrate to the satisfaction of the commissioner that the applicant has complied with all applicable federal requirements pertaining to the processing, production, distribution, and sale of industrial hemp.\n(a) In addition to data classified pursuant to section 13.41, the following data collected, created, or maintained by the commissioner under this chapter is classified as private data, as defined in section 13.02, subdivision 12, or nonpublic data, as defined in section 13.02, subdivision 9:\n(1) nondesignated addresses provided by licensees and applicants; and\n(2) data that identify the specific locations where licensees and applicants grow or process, or will grow or process, industrial hemp, including but not limited to legal descriptions, street addresses, geospatial locations, maps, and property boundaries and dimensions.\n(b) The commissioner may disclose data classified as private data or nonpublic data under this subdivision if the commissioner determines that there is a substantive threat to human health or safety or to the environment, or to aid in the law enforcement process.\n(a) The commissioner must establish written procedures to ensure that only individuals authorized by law may access the private data and nonpublic data identified in subdivision 4. An authorized individual's ability to enter, update, or access data must correspond to the official duties or training level of the individual and to the statutory authorization granting access for that purpose. All queries and responses, including the specific purpose for which data is requested and, if applicable, disclosed, and all actions in which data are entered, updated, accessed, shared, or disseminated, must be recorded in the data audit trail. Data contained in the audit trail are public to the extent the data are not otherwise classified by law.\n(b) The commissioner must immediately and permanently revoke the authorization of any individual who willfully entered, updated, accessed, shared, or disseminated data in violation of state or federal law. If an individual willfully gained access to data without authorization by law, the commissioner must forward the matter to the appropriate prosecuting authority for prosecution.\n(c) By January 15 of each odd-numbered year, the commissioner must provide a copy of the data audit trail required under paragraph (a) to the commissioner of administration; the chairs and ranking members of the legislative committees and divisions with jurisdiction over agriculture policy and finance, public safety, and data practices; and the Legislative Commission on Data Practices and Personal Data Privacy or its successor commission.",
	"repealed": false
}