{
	"id": "181.635",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.635",
	"title": "181.635 RECRUITMENT; FOOD PROCESSING EMPLOYMENT.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Employer\" means a person who employs another to perform a service for hire. Employer includes any agent or attorney of an employer who, for money or other valuable consideration paid or promised to be paid, performs any recruiting.\n(b) \"Person\" means a corporation, partnership, limited liability company, limited liability partnership, association, individual, or group of persons.\n(c) \"Recruits\" means to induce an individual, directly or through an agent, to relocate to Minnesota or within Minnesota to work in food processing by an offer of employment or of the possibility of employment.\n(d) \"Food processing\" means canning, packing, or otherwise processing poultry or meat for consumption.\n(e) \"Terms and conditions of employment\" means the following:\n(1) nature of the work to be performed;\n(2) wage rate, nature and amount of deductions for tools, clothing, supplies, or other items;\n(3) anticipated hours of work per week, including overtime;\n(4) anticipated slowdown or shutdown or if hours of work per week vary more than 25 percent from clause (3);\n(5) duration of the work;\n(6) workers' compensation coverage and name, address, and telephone number of insurer and Department of Labor and Industry;\n(7) employee benefits available, including any health plans, sick leave, or paid vacation;\n(8) transportation and relocation arrangements with allocation of costs between employer and employee;\n(9) availability and description of housing and any costs to employee associated with housing; and\n(10) any other item of value offered, and allocation of costs of item between employer and employee.\n(a) An employer shall provide written disclosure of the terms and conditions of employment to a person at the time it recruits the person to relocate to work in the food processing industry. The disclosure requirement does not apply to an exempt employee as defined in United States Code, title 29, section 213(a)(1). The disclosure must be written in English and Spanish, or English and another language if the person's preferred language is not English or Spanish, dated and signed by the employer and the person recruited, and maintained by the employer for three years. A copy of the signed and completed disclosure must be delivered immediately to the recruited person. The disclosure may not be construed as an employment contract.\n(b) The requirements under this subdivision are in addition to the requirements under section 181.032.\nA person injured by a violation of this section has a cause of action for damages for the greater of $1,000 per violation or twice their actual damages, plus costs and reasonable attorney's fees. A damage award shall be the greater of $1,400 or three times actual damages for a person injured by an intentional violation of this section.\nThe Department of Labor and Industry shall fine an employer not less than $400 or more than $1,000 for each violation of this section. The fine shall be payable to the employee aggrieved.\nA public agency providing employment services is not an employer under this section.\nThe Department of Labor and Industry shall provide a standard form for use at the employer's option in making the disclosure required in subdivision 2. The form shall be available in English and Spanish and additional languages upon request.",
	"repealed": false
}