{
	"id": "80A.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.85",
	"title": "80A.85 SECTION 608; UNIFORMITY AND COOPERATION WITH OTHER AGENCIES.",
	"text": "(a) Objective of uniformity. The administrator shall, in its discretion, cooperate, coordinate, consult, and, subject to section 80A.84, share records and information with the securities regulator of another state, Canada, a Canadian province or territory, a foreign jurisdiction, the Securities and Exchange Commission, the United States Department of Justice, the Commodity Futures Trading Commission, the Federal Trade Commission, the Securities Investor Protection Corporation, a self-regulatory organization, a national or international organization of securities regulators, a federal or state banking and insurance regulator, and a governmental law enforcement agency to effectuate greater uniformity in securities matters among the federal government, self-regulatory organizations, states, and foreign governments.\n(b) Policies to consider. In cooperating, coordinating, consulting, and sharing records and information under this section and in acting by rule, order, or waiver under this chapter, the administrator shall, in its discretion, take into consideration in carrying out the public interest the following general policies:\n(1) maximizing effectiveness of regulation for the protection of investors;\n(2) maximizing uniformity in federal and state regulatory standards; and\n(3) minimizing burdens on the business of capital formation, without adversely effecting essentials of investor protection.\n(c) Subjects for cooperation. The cooperation, coordination, consultation, and sharing of records and information authorized by this section includes:\n(1) establishing or employing one or more designees as a central depository for registration and notice filings under this chapter and for records required or allowed to be maintained under this chapter;\n(2) developing and maintaining uniform forms;\n(3) conducting a joint examination or investigation;\n(4) holding a joint administrative hearing;\n(5) instituting and prosecuting a joint civil or administrative proceeding;\n(6) sharing and exchanging personnel;\n(7) coordinating registrations under sections 80A.49 and 80A.56 through 80A.58 and exemptions under section 80A.47;\n(8) sharing and exchanging records, subject to section 80A.84;\n(9) formulating rules, statements of policy, guidelines, forms, and interpretative opinions and releases;\n(10) formulating common systems and procedures;\n(11) notifying the public of proposed rules, forms, statements of policy, and guidelines;\n(12) attending conferences and other meetings among securities regulators, which may include representatives of governmental and private sector organizations involved in capital formation, deemed necessary or appropriate to promote or achieve uniformity; and\n(13) developing and maintaining a uniform exemption from registration for small issuers, and taking other steps to reduce the burden of raising investment capital by small businesses.",
	"repealed": false
}