{
	"id": "270C.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.61",
	"title": "270C.61 LEGAL ACTION; CONFESSION OF JUDGMENT.",
	"text": "(a) In addition to all other methods authorized by law for the collection of tax, if any tax payable to the commissioner or to the department, including penalties and interest thereon, is not paid within 60 days after it is required by law to be paid, the commissioner may proceed under this subdivision. Within five years after the date of assessment of the tax or at any time a lien filed under section 270C.63 is enforceable, or, if the action is to renew or enforce a judgment, at any time before the judgment's expiration, the commissioner may bring an action in court against the person liable for the payment or collection of the tax, in the name of the state, for the recovery of the tax and interest and penalties due in respect thereof. The action may be commenced by the commissioner in the same manner as any other civil action.\n(b) The commissioner may also serve the summons and complaint by mailing a copy to the taxpayer's last known address by certified mail. Service by certified mail is complete when mailed in acceptable form with the United States Postal Service or with the central mail system of the state of Minnesota.\nIn addition to other remedies that may be available, the commissioner may bring an action in equity by the state against a taxpayer for an injunction ordering the taxpayer to file a complete and proper return or amended return. The district courts of this state have jurisdiction over the action and disobedience of an injunction issued under this subdivision will be punished as a contempt of district court. The action may be commenced by the commissioner in the same manner as any other civil action.\nThe commissioner may request the county attorney or the attorney general to conduct the proceedings on behalf of the state.\nEither party to an action or a judgment for the recovery of any taxes, interest, or penalties under subdivision 1 may appeal the judgment as in other civil cases.\nThe tax, as assessed by the commissioner, with any penalties included therein, shall be presumed to be valid and correctly determined and assessed, and the burden shall be upon the taxpayer to show its incorrectness or invalidity. A statement filed by the commissioner showing the amount of the tax and penalties as determined or assessed by the commissioner, is admissible in evidence and shall establish prima facie the facts set forth therein.\n(a) The commissioner may, within 3-1/2 years after any return is filed, notwithstanding section 541.09, enter judgment on any confession of judgment contained in the return after ten days' notice served upon the taxpayer by mail at the address shown in the return. The judgment shall be entered by the court administrator of district court upon the filing of a photocopy or similar reproduction of that part of the return containing the confession of judgment along with a statement of the commissioner or an agent that the tax has not been paid. The commissioner may prescribe the words for the confession of judgment statement contained on the return.\n(b) Notwithstanding any other provision of the law to the contrary, the commissioner may, within five years after a written agreement is signed by the taxpayer and the commissioner under the provisions of section 270C.52, subdivision 2, enter judgment on the confession of judgment contained within the agreement after ten days' notice served upon the taxpayer at the address shown in the agreement. Such judgment shall be entered by the court administrator of district court upon the filing of the agreement or a certified copy thereof along with a statement of the commissioner or an agent that the tax has not been paid.",
	"repealed": false
}