{
	"id": "299F.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.08",
	"title": "299F.08 PREMISES, WHEN ENTERED.",
	"text": "In the performance of the duties imposed by the provisions of this chapter, the state fire marshal and subordinates, during and within a reasonable time after a fire has been extinguished, may enter any building or premises where a fire has occurred and other buildings and premises adjoining or near thereto to investigate and gather evidence. In determining whether a search is reasonable within the meaning of this subdivision, the need for investigatory search for the cause of the fire shall be balanced against the privacy rights of the occupant or owner of the building or premises.\n(a) After the reasonable time prescribed by subdivision 1 for an investigatory search has expired, subsequent entries to the building or premises to investigate and gather evidence may be made only if there is consent from the owner or occupant of the building or premises or pursuant to an administrative search warrant issued by a judge.\n(b) In determining whether to issue an administrative search warrant for the purposes of this subdivision, the judge, in conforming the decision to constitutional doctrine governing warrant procedures for administrative searches, shall consider but not be limited to the following factors:\n(1) scope of the proposed search;\n(2) number of prior entries by fire officials;\n(3) time of day when the search is proposed to be made;\n(4) lapse of time since the fire;\n(5) continued use of the building; and\n(6) the owner's or occupant's efforts to secure the building against intruders.\nIf during the course of an investigatory search under an administrative search warrant issued in accordance with subdivision 2, the fire marshal or subordinates find probable cause to believe arson has occurred and require further access to the building or premises to gather evidence for possible prosecution, a criminal search warrant must be obtained from a judge.\nIn order to prevent the loss, destruction, or alteration of evidence at a fire scene, fire officials may secure fire scenes for up to 48 hours after having extinguished the fire while warrants are obtained or while the investigation authorized in this section is conducted. Fire scene security may be accomplished by preventing any person from entering the fire scene or from removing property from the fire scene. An individual may enter the fire scene if accompanied by the fire official conducting the investigation, or if the individual obtains the fire official's written permission. Persons not complying with the fire security measures under this subdivision are guilty of obstructing legal process as defined in section 609.50. Nothing in this subdivision shall be construed to increase the civil liability of fire officials or to decrease municipal or state immunities as set forth in section 3.736 or 466.03.",
	"repealed": false
}