{
	"id": "469.177",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.177",
	"title": "469.177 COMPUTATION OF TAX INCREMENT.",
	"text": "(a) Upon or after adoption of a tax increment financing plan, the auditor of any county in which the district is situated shall, upon request of the authority, certify the original net tax capacity of the tax increment financing district and that portion of the district overlying any subdistrict as described in the tax increment financing plan and shall certify in each year thereafter the amount by which the original net tax capacity has increased or decreased as a result of a change in tax exempt status of property within the district and any subdistrict, reduction or enlargement of the district or changes pursuant to subdivision 4. The auditor shall certify the amount within 30 days after receipt of the request and sufficient information to identify the parcels included in the district. The certification relates to the taxes payable year as provided in subdivision 6.\n(b) If the classification under section 273.13 of property located in a district changes to a classification that has a different assessment ratio, the original net tax capacity of that property must be redetermined at the time when its use is changed as if the property had originally been classified in the same class in which it is classified after its use is changed.\n(c) The amount to be added to the original net tax capacity of the district as a result of previously tax exempt real property within the district becoming taxable equals the net tax capacity of the real property as most recently assessed pursuant to information reported to the commissioner under section 270C.85, subdivision 2, clause (4), or, if that assessment was made more than one year prior to the date of title transfer rendering the property taxable, the net tax capacity assessed by the assessor at the time of the transfer. If improvements are made to tax exempt property after the municipality approves the district and before the parcel becomes taxable, the assessor shall, at the request of the authority, separately assess the estimated market value of the improvements. If the property becomes taxable, the county auditor shall add to original net tax capacity, the net tax capacity of the parcel, excluding the separately assessed improvements. If substantial taxable improvements were made to a parcel after certification of the district and if the property later becomes tax exempt, in whole or part, as a result of the authority acquiring the property through foreclosure or exercise of remedies under a lease or other revenue agreement or as a result of tax forfeiture, the amount to be added to the original net tax capacity of the district as a result of the property again becoming taxable is the amount of the parcel's value that was included in original net tax capacity when the parcel was first certified. The amount to be added to the original net tax capacity of the district as a result of enlargements equals the net tax capacity of the added real property as most recently certified by the commissioner of revenue as of the date of modification of the tax increment financing plan pursuant to section 469.175, subdivision 4.\n(d) If the net tax capacity of a property increases because the property no longer qualifies under the Minnesota Agricultural Property Tax Law, section 273.111; the Minnesota Open Space Property Tax Law, section 273.112; or the Metropolitan Agricultural Preserves Act, chapter 473H, the Rural Preserve Property Tax Program under section 273.114, or because platted, unimproved property is improved or market value is increased after approval of the plat under section 273.11, subdivision 14a or 14b, the increase in net tax capacity must be added to the original net tax capacity. If the net tax capacity of a property increases because the property no longer qualifies for the homestead market value exclusion under section 273.13, subdivision 35, the increase in net tax capacity must be added to original net tax capacity if the original construction of the affected home was completed before the date the assessor certified the original net tax capacity of the district.\n(e) The amount to be subtracted from the original net tax capacity of the district as a result of previously taxable real property within the district becoming tax exempt or qualifying in whole or part for an exclusion from taxable market value, or a reduction in the geographic area of the district, shall be the amount of original net tax capacity initially attributed to the property becoming tax exempt, being excluded from taxable market value, or being removed from the district. If the net tax capacity of property located within the tax increment financing district is reduced by reason of a court-ordered abatement, stipulation agreement, voluntary abatement made by the assessor or auditor or by order of the commissioner of revenue, the reduction shall be applied to the original net tax capacity of the district when the property upon which the abatement is made has not been improved since the date of certification of the district and to the captured net tax capacity of the district in each year thereafter when the abatement relates to improvements made after the date of certification. The county auditor may specify reasonable form and content of the request for certification of the authority and any modification thereof pursuant to section 469.175, subdivision 4.\n(f) If a parcel of property contained a substandard building or improvements described in section 469.174, subdivision 10, paragraph (e), that were demolished or removed and if the authority elects to treat the parcel as occupied by a substandard building under section 469.174, subdivision 10, paragraph (b), or by improvements under section 469.174, subdivision 10, paragraph (e), the auditor shall certify the original net tax capacity of the parcel using the greater of (1) the current net tax capacity of the parcel, or (2) the estimated market value of the parcel for the year in which the building or other improvements were demolished or removed, but applying the classification rates for the current year.\n(g) For a redevelopment district qualifying under section 469.174, subdivision 10, paragraph (a), clause (4), as a qualified disaster area, the auditor shall certify the value of the land as the original tax capacity for any parcel in the district that contains a building that suffered substantial damage as a result of the disaster or emergency.\nAt the time of the initial certification of the original net tax capacity for a tax increment financing district or a subdistrict, the county auditor shall certify the original local tax rate that applies to the district or subdistrict. The original local tax rate is the sum of all the local tax rates, excluding that portion of the school rate attributable to the general education levy under section 126C.13, that apply to a property in the district or subdistrict. The local tax rate to be certified is the rate in effect for the same taxes payable year applicable to the tax capacity values certified as the district's or subdistrict's original tax capacity. The resulting tax capacity rate is the original local tax rate for the life of the district or subdistrict.\nThe original local tax rate and any other tax rate or amount used to calculate the amount of tax increment does not include any rate or amount attributable to a state levy, whether the state levy is imposed by section 275.02 or another provision of law.\n(a) The provisions of this subdivision apply to a district located in a disaster area, as described in section 273.1231, subdivision 3, paragraph (a), clause (1), and are effective for taxes payable in the first calendar year beginning at least four months after the date of the determination.\n(b) For a district certified before the date of the disaster area determination as provided in section 273.1231, subdivision 3, paragraph (a), clause (1), upon the request of the municipality, the county auditor shall reduce the original net tax capacity of the district by the reduction in the net tax capacity of properties in the district that is attributable to the physical effects of the disaster, but not below zero. The assessor shall determine the amount of the reduction in market value that is attributable to the physical effects of the disaster to be used by the county auditor in computing the reduction in net tax capacity.\n(c) For a district that does not qualify under paragraph (b) and for which the request for certification is made in the same calendar year as the disaster area determination, upon the request of the municipality, the assessor shall determine the reduction in market value of properties in the district that is attributable to the physical effects of the disaster. The county auditor shall use the reduced market value in certifying the original net tax capacity of the district.\n(a) Upon approval by the municipality, by resolution, the authority may elect to reduce the original net tax capacity of a qualified district by the amount of the tax capacity attributable to the market value exclusion under section 273.13, subdivision 35, for taxes payable in the year preceding the election. The amount of the reduction may not reduce the original net tax capacity below zero.\n(b) For purposes of this subdivision, a qualified district means a tax increment financing district that satisfies the following conditions:\n(1) for taxes payable in 2011, the authority received a homestead market value credit reimbursement under section 273.1384 for the district of $10,000 or more;\n(2) for taxes payable in 2013, the reduction in captured tax capacity resulting from the market value exclusion for the district was equal to or greater than 1.75 percent of the district's captured tax capacity; and\n(3) either (i) the authority is permitted to expend increments on activities under the provisions of section 469.1763, subdivision 3, or an equivalent provision of special law on July 1, 2013, or (ii) the district's tax increments received for taxes payable in 2012 were less than the amount of debt service payments due during calendar year 2012 on bonds issued under section 469.178 to which the district's increments are pledged.\nThe calculation of the amount under clause (2) must reflect any adjustments to original net tax capacity made under subdivision 1, paragraphs (d) and (e), for the homestead market value exclusion.\n(c) The authority must notify the county auditor of its election under this section no later than July 1, 2014. Notifications made by July 1, 2013, are effective beginning for taxes payable in 2014, and notifications made after July 1, 2013, are effective beginning for taxes payable in 2015.\n(a) For any tax increment financing district that satisfies the requirements of paragraph (b), the original net tax capacity must be reduced by the full amount of the original net tax capacity or $20,000, whichever is less.\n(b) A tax increment financing district qualifies under this subdivision if it satisfies the following conditions:\n(1) the district was certified after January 1, 2011, and before January 1, 2012;\n(2) for assessment year 2012, at least 75 percent of the tax capacity of the district is class 4d property; and\n(3) for assessment year 2012, the average estimated market value is over $115,000 per housing unit for the portion of the property that is class 4d.\n(c) An authority or a property owner within a tax increment financing district must notify the county assessor of a district that qualifies under this subdivision by July 1, 2013.\n(d) This subdivision expires on December 31, 2021.\n(a) The county auditor shall certify the amount of the captured net tax capacity to the authority each year, together with the proportion that the captured net tax capacity bears to the total net tax capacity of the real property within the tax increment financing district and any subdistrict for that year.\n(b) An authority may choose to retain any part or all of the captured net tax capacity for purposes of tax increment financing according to one of the following options:\n(1) If the plan provides that all the captured net tax capacity is necessary to finance or otherwise make permissible expenditures under section 469.176, subdivision 4, the authority may retain the full captured net tax capacity.\n(2) If the plan provides that only a portion of the captured net tax capacity is necessary to finance or otherwise make permissible expenditures under section 469.176, subdivision 4, only that portion shall be set aside and the remainder shall be distributed among the affected taxing districts by the county auditor.\n(c) The portion of captured net tax capacity that an authority intends to use for purposes of tax increment financing must be clearly stated in the tax increment financing plan.\n(a) Unless the governing body elects pursuant to paragraph (b) the following method of computation shall apply to a district:\n(1) The original net tax capacity and the current net tax capacity shall be determined before the application of the fiscal disparity provisions of chapter 276A or 473F. Where the original net tax capacity is equal to or greater than the current net tax capacity, there is no captured net tax capacity and no tax increment determination. Where the original net tax capacity is less than the current net tax capacity, the difference between the original net tax capacity and the current net tax capacity is the captured net tax capacity. This amount less any portion thereof which the authority has designated, in its tax increment financing plan, to share with the local taxing districts is the retained captured net tax capacity of the authority.\n(2) The county auditor shall exclude the retained captured net tax capacity of the authority from the net tax capacity of the local taxing districts in determining local taxing district tax rates. The local tax rates so determined are to be extended against the retained captured net tax capacity of the authority as well as the net tax capacity of the local taxing districts. The tax generated by the extension of the lesser of (A) the local taxing district tax rates or (B) the original local tax rate to the retained captured net tax capacity of the authority is the tax increment of the authority.\n(b) The following method of computation applies to any other district for which the governing body, by resolution approving the tax increment financing plan pursuant to section 469.175, subdivision 3, elects:\n(1) The original net tax capacity shall be determined before the application of the fiscal disparity provisions of chapter 276A or 473F. The current net tax capacity shall exclude any fiscal disparity commercial-industrial net tax capacity increase between the original year and the current year multiplied by the fiscal disparity ratio determined pursuant to section 276A.06, subdivision 7, or 473F.08, subdivision 6. Where the original net tax capacity is equal to or greater than the current net tax capacity, there is no captured net tax capacity and no tax increment determination. Where the original net tax capacity is less than the current net tax capacity, the difference between the original net tax capacity and the current net tax capacity is the captured net tax capacity. This amount less any portion thereof which the authority has designated, in its tax increment financing plan, to share with the local taxing districts is the retained captured net tax capacity of the authority.\n(2) The county auditor shall exclude the retained captured net tax capacity of the authority from the net tax capacity of the local taxing districts in determining local taxing district tax rates. The local tax rates so determined are to be extended against the retained captured net tax capacity of the authority as well as the net tax capacity of the local taxing districts. The tax generated by the extension of the lesser of (A) the local taxing district tax rates or (B) the original local tax rate to the retained captured net tax capacity of the authority is the tax increment of the authority.\n(3) An election by the governing body pursuant to paragraph (b) shall be submitted to the county auditor by the authority at the time of the request for certification pursuant to subdivision 1.\n(c) The method of computation of tax increment applied to a district pursuant to paragraph (a) or (b) shall remain the same for the duration of the district, except that the governing body may elect to change its election from the method of computation in paragraph (a) to the method in paragraph (b).\nThe authority shall, after diligent search, accompany its request for certification to the county auditor pursuant to subdivision 1, or its notice of district enlargement pursuant to section 469.175, subdivision 4, with a listing of all properties within the tax increment financing district or area of enlargement for which building permits have been issued during the 18 months immediately preceding approval of the tax increment financing plan by the municipality pursuant to section 469.175, subdivision 3. The county auditor shall increase the original net tax capacity of the district by the net tax capacity of each improvement for which a building permit was issued.\nThe tax increment received with respect to any district shall be segregated by the authority in a special account or accounts on its official books and records or as otherwise established by resolution of the authority to be held by a trustee or trustees for the benefit of holders of the bonds.\nA request for certification of a new tax increment financing district pursuant to subdivision 1 or of a modification to an existing tax increment financing district pursuant to section 469.175, subdivision 4, received by the county auditor on or before June 30 of the calendar year shall be recognized by the county auditor in determining local tax rates for the current and subsequent levy years. Requests received by the county auditor after June 30 of the calendar year shall not be recognized by the county auditor in determining local tax rates for the current levy year but shall be recognized by the county auditor in determining local tax rates for subsequent levy years.\nWhen any law governing the classification of real property and determining the percentage of market value to be assessed for ad valorem taxation purposes is amended, the increase or decrease in net tax capacity resulting therefrom shall be applied proportionately to original net tax capacity and captured net tax capacity of any tax increment financing district in each year thereafter. This subdivision applies to tax increment districts created pursuant to sections 469.174 to 469.178 or any prior tax increment law.\nAn authority may enter into a written assessment agreement with any person establishing a minimum market value of land, existing improvements, or improvements to be constructed in a district, if the property is owned or will be owned by the person. The minimum market value established by an assessment agreement may be fixed, or increase or decrease in later years from the initial minimum market value. If an agreement is fully executed before July 1 of an assessment year, the market value as provided under the agreement must be used by the county or local assessor as the taxable market value of the property for that assessment. Agreements executed on or after July 1 of an assessment year become effective for assessment purposes in the following assessment year. An assessment agreement terminates on the earliest of the date on which conditions in the assessment agreement for termination are satisfied, the termination date specified in the agreement, or the date when tax increment is no longer paid to the authority under section 469.176, subdivision 1. The assessment agreement shall be presented to the county assessor, or city assessor having the powers of the county assessor, of the jurisdiction in which the tax increment financing district and the property that is the subject of the agreement is located. The assessor shall review the plans and specifications for the improvements to be constructed, review the market value previously assigned to the land upon which the improvements are to be constructed and, so long as the minimum market value contained in the assessment agreement appears, in the judgment of the assessor, to be a reasonable estimate, shall execute the following certification upon the agreement:\nThe undersigned assessor, being legally responsible for the assessment of the above described property, certifies that the market values assigned to the land and improvements are reasonable\nThe assessment agreement shall be filed for record and recorded in the office of the county recorder or the registrar of titles of each county where the real estate or any part thereof is situated. After the agreement becomes effective for assessment purposes, the assessor shall value the property under section 273.11, except that the market value assigned shall not be less than the minimum market value established by the assessment agreement. The assessor may assign a market value to the property in excess of the minimum market value established by the assessment agreement. The owner of the property may seek, through the exercise of administrative and legal remedies, a reduction in market value for property tax purposes, but no city assessor, county assessor, county auditor, board of review, board of equalization, commissioner of revenue, or court of this state shall grant a reduction of the market value below the minimum market value established by the assessment agreement during the term of the agreement filed of record regardless of actual market values which may result from incomplete construction of improvements, destruction, or diminution by any cause, insured or uninsured, except in the case of acquisition or reacquisition of the property by a public entity. Recording an assessment agreement constitutes notice of the agreement to anyone who acquires any interest in the land or improvements that is subject to the assessment agreement, and the agreement is binding upon them.\nAn assessment agreement may be modified or terminated by mutual consent of the current parties to the agreement. Modification or termination of an assessment agreement must be approved by the governing body of the municipality. If the estimated market value for the property for the most recently available assessment is less than the minimum market value established by the assessment agreement for that or any later year and if bond counsel does not conclude that termination of the agreement is necessary to preserve the tax exempt status of outstanding bonds or refunding bonds to be issued, the modification or termination of the assessment agreement also must be approved by the governing bodies of the county and the school district. A document modifying or terminating an agreement, including records of the municipality, county, and school district approval, must be filed for record. The assessor's review and certification is not required if the document terminates an agreement. A change to an agreement not fully executed before July 1 of an assessment year is not effective for assessment purposes for that assessment year. If an assessment agreement has been modified or prematurely terminated, a person may seek a reduction in market value or tax through the exercise of any administrative or legal remedy. The remedy may not provide for reduction of the market value below the minimum provided under a modified assessment agreement that remains in effect. In no event may a reduction be sought for a year other than the current taxes payable year.\n(a) If the amount of tax paid on captured net tax capacity exceeds the amount of tax increment, the county auditor shall distribute the excess, except increment attributable to the general education levy, to the municipality, county, and school district as follows: each governmental unit's share of the excess equals\n(1) the total amount of the excess for the tax increment financing district, multiplied by\n(2) a fraction, the numerator of which is the current local tax rate of the governmental unit less the governmental unit's local tax rate for the year the original local tax rate for the district was certified (in no case may this amount be less than zero) and the denominator of which is the sum of the numerators for the municipality, county, and school district.\nIf the entire increase in the local tax rate is attributable to a taxing district, other than the municipality, county, or school district, then the excess must be distributed to the municipality, county, and school district in proportion to their respective local tax rates.\n(b) The amounts distributed shall be deducted in computing the levy limits of the taxing district for the succeeding taxable year.\n(c) In the case of distributions to a school district, the county auditor shall report amounts distributed to the commissioner of education in the same manner as provided for excess increments under section 469.176, subdivision 2, and the distribution shall be deducted from the school district's state aid payments and levy limitation according to section 127A.49, subdivision 3.\n(d) The amount of taxes attributable to imposing the general education levy under section 126C.13 must be returned to the school district within which the tax increment financing district is located.\nMS 2013 Supp [Repealed, 2014 c 308 art 9 s 94]\n(a) The county treasurer shall deduct an amount equal to 0.25 percent of any increment distributed to an authority or municipality. The county treasurer shall pay the amount deducted to the commissioner of management and budget for deposit in an account in the special revenue fund.\n(b) The amounts deducted and paid under paragraph (a) are appropriated to the state auditor for the cost of (1) the financial reporting of tax increment financing information and (2) the cost of examining and auditing of authorities' use of tax increment financing as provided under section 469.1771, subdivision 1. Notwithstanding section 16A.28 or any other law to the contrary, this appropriation does not cancel and remains available until spent.\n(c) For taxes payable in 2002 and thereafter, the commissioner of revenue shall increase the percent in paragraph (a) to a percent equal to the product of the percent in paragraph (a) and the amount that the statewide tax increment levy for taxes payable in 2002 would have been without the classification rate changes in Laws 2001, First Special Session chapter 5, and the elimination of the general education levy in Laws 2001, First Special Session chapter 5, divided by the statewide tax increment levy for taxes payable in 2002.\nThe county auditor shall decertify a tax increment financing district when the earliest of the following times is reached:\n(1) the applicable maximum duration limit under section 469.176, subdivisions 1a to 1g;\n(2) the maximum duration limit, if any, provided by the municipality pursuant to section 469.176, subdivision 1;\n(3) the time of decertification specified in section 469.1761, subdivision 4, if the commissioner of revenue issues an order of noncompliance and the maximum duration limit for economic development districts has been exceeded;\n(4) upon completion of the required actions to allow decertification under section 469.1763, subdivision 4; or\n(5) upon the later of receipt by the county auditor of a written request for decertification from the authority that requested certification of the original net tax capacity of the district or its successor or the decertification date specified in the request.\n(a) If the county auditor, as a result of an error or mistake, decertifies a district, fails to certify a district, incorrectly certifies a district, or otherwise fails to correctly compute the amount of increment, the county auditor may undertake one or more of the following actions to correct the error or mistake:\n(1) certify the original tax capacity of the affected parcels at the appropriate value for a later taxes payable year and extend the duration of the district, in whole or in part, to compensate;\n(2) recertify the affected parcels and extend duration of the district, in whole or in part, to compensate;\n(3) recertify or correct the original tax capacity rate for the district;\n(4) adjust the tax rates of one or more of the taxing districts imposing taxes in the tax increment financing districts for one or more years to recoup amounts advanced by the county or other entity to the authority to replace the reduced increments; or\n(5) take other appropriate action so that the amount of increment compensates for or offsets the error or mistake and correctly reflects application of the law.\n(b) At least 30 days before exercising authority under this subdivision, the county auditor must notify the authority and the municipality, in writing, of the intent to do so, including supporting information to describe reason for the proposed action. The authority and municipality may waive the time requirement of this paragraph. If the city or the authority objects before expiration of the 30-day period, the matter must be submitted to the commissioner of revenue for a decision or resolution of the dispute. The commissioner of revenue shall consult with the Office of the State Auditor before making a decision.\n(c) The county auditor must notify the commissioner of revenue and the Office of the State Auditor of corrections made under this subdivision. The notification must be made in the form and manner and at the time prescribed by the commissioner. The commissioner shall incorporate the corrections in the tax increment financing district tax list supplement, as appropriate.",
	"repealed": false
}