{
	"id": "245G.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.12",
	"title": "245G.12 PROVIDER POLICIES AND PROCEDURES.",
	"text": "A license holder must develop a written policies and procedures manual, indexed according to section 245A.04, subdivision 14, paragraph (c), that provides staff members immediate access to all policies and procedures and provides a client and other authorized parties access to all policies and procedures. The manual must contain the following materials:\n(1) assessment and treatment planning policies, including screening for mental health concerns and treatment objectives related to the client's identified mental health concerns in the client's treatment plan;\n(2) policies and procedures regarding HIV according to section 245A.19;\n(3) the license holder's methods and resources to provide information on tuberculosis and tuberculosis screening to each client and to report a known tuberculosis infection according to section 144.4804;\n(4) personnel policies according to section 245G.13;\n(5) policies and procedures that protect a client's rights according to section 245G.15;\n(6) a medical services plan according to section 245G.08;\n(7) emergency procedures according to section 245G.16;\n(8) policies and procedures for maintaining client records according to section 245G.09;\n(9) procedures for reporting the maltreatment of minors according to chapter 260E, and vulnerable adults according to sections 245A.65, 626.557, and 626.5572;\n(10) a description of treatment services that: (i) includes the amount and type of services provided; (ii) identifies which services meet the definition of group counseling under section 245G.01, subdivision 13a; (iii) identifies which groups and topics on which a guest speaker could provide services under the direct observation of an alcohol and drug counselor; and (iv) defines the program's treatment week;\n(11) the methods used to achieve desired client outcomes;\n(12) the hours of operation; and\n(13) the target population served.",
	"repealed": false
}