{
	"id": "123B.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.91",
	"title": "123B.91 SCHOOL DISTRICT BUS SAFETY RESPONSIBILITIES.",
	"text": "Each district shall develop and implement a comprehensive, written policy governing pupil transportation safety, including transportation of nonpublic school students, when applicable. The policy, at minimum, must contain:\n(1) provisions for appropriate student bus safety training under section 123B.90;\n(2) rules governing student conduct on school buses and in school bus loading and unloading areas;\n(3) a statement of parent or guardian responsibilities relating to school bus safety;\n(4) an intradistrict system for reporting school bus accidents or misconduct and a system for dealing with local law enforcement officials in cases of criminal conduct on a school bus;\n(5) a discipline policy to address violations of school bus safety rules, including procedures for revoking a student's bus riding privileges in cases of serious or repeated misconduct;\n(6) a system for integrating school bus misconduct records with other discipline records;\n(7) where applicable, provisions governing bus monitor qualifications, training, and duties;\n(8) rules governing the use and maintenance of type III vehicles, drivers of type III vehicles, qualifications to drive a type III vehicle, qualifications for a type III vehicle, and the circumstances under which a student may be transported in a type III vehicle;\n(9) operating rules and procedures;\n(10) emergency procedures;\n(11) a system for maintaining and inspecting equipment; and\n(12) any other requirements of the school district.\nA nonpublic or charter school student transported by a public school district shall comply with student bus conduct and student bus discipline policies of the transporting public school district.\nEach board shall designate a school transportation safety director to oversee and implement pupil transportation safety policies. The director shall have day-to-day responsibility for pupil transportation safety within the district, including transportation of nonpublic school children when provided by the district.",
	"repealed": false
}