{
	"id": "84.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.66",
	"title": "84.66 MINNESOTA FORESTS FOR THE FUTURE PROGRAM.",
	"text": "The Minnesota forests for the future program identifies and protects private, working forest lands for their timber, scenic, recreational, fish and wildlife habitat, threatened and endangered species, and other cultural and environmental values.\nFor the purpose of this section, the following terms have the meanings given:\n(1) \"forest land\" has the meaning given under section 89.001, subdivision 4;\n(2) \"forest resources\" has the meaning given under section 89.001, subdivision 8;\n(3) \"guidelines\" has the meaning given under section 89A.01, subdivision 8;\n(4) \"riparian land\" has the meaning given under section 103F.511, subdivision 8c; and\n(5) \"working forest land\" means land that provides a broad range of goods and services, including forest products, recreation, fish and wildlife habitat, clean air and water, and carbon sequestration.\nThe commissioner of natural resources shall establish and administer a Minnesota forests for the future program. Land selected for inclusion in the program shall be evaluated on the land's potential for:\n(1) producing timber and other forest products;\n(2) maintaining forest landscapes;\n(3) providing public recreation; and\n(4) providing ecological, fish and wildlife habitat, and other cultural and environmental values and values consistent with working forest lands.\nLand may be placed in the Minnesota forests for the future program if it:\n(1) is:\n(i) forest land;\n(ii) desirable land adjacent to forest land, as determined by the commissioner; or\n(iii) beneficial to forest resource protection;\n(2) is at least five acres in size, except for a riparian area or an area providing access to state forest land; and\n(3) is not set aside, enrolled, or diverted under another federal or state program, unless enrollment in the Minnesota forests for the future program would provide additional conservation benefits or a longer enrollment term than under the current federal or state program.\nThe commissioner may acquire permanent interests in lands by fee title, easement acquisition, gift, or donation. An acquired easement shall require a forestry management plan unless the requirement is waived or modified by the commissioner. The plan will guide forest management activities consistent with the purposes and terms of the easement and shall incorporate guidelines and other forest management practices as determined by the commissioner to provide perpetuation of the forest. The plan shall be developed in accordance with the guidelines.\nThe commissioner shall accept applications from owners of eligible lands at the time, in the form, and containing the information as the commissioner may prescribe. If the number of applications exceeds the ability to fund them all, priority shall be given to those applications covering lands providing the greatest public benefits for timber productivity, public access, and ecological and wildlife values.\nThe commissioner may enroll eligible land in the program by signing an easement in recordable form with a landowner in which the landowner agrees to:\n(1) convey to the state a permanent easement that is not subject to any prior title, lien, or encumbrance, except for preexisting easements that are acceptable to the commissioner; and\n(2) manage the land in a manner consistent with the purposes for which the land was selected for the program and not convert the land to other uses.\nTo correct errors in legal descriptions for easements that affect the ownership interests in the state and adjacent landowners, the commissioner may, in the name of the state, convey without consideration, interests of the state necessary to correct legal descriptions of boundaries. The conveyance must be by quitclaim deed or release in a form approved by the attorney general.\nThe commissioner may terminate an easement, with the consent of the property owner, if the commissioner determines termination to be in the public interest. The commissioner may modify the terms of an easement if the commissioner determines that modification will help implement the Minnesota forests for the future program or facilitate the program's administration.\nPayments to landowners under the Minnesota forests for the future program shall be made in accordance with law and Department of Natural Resources acquisition policies, procedures, and other funding requirements.\n(a) The commissioner shall establish a long-term program for monitoring and enforcing Minnesota forests for the future easements. The program must require that a financial contribution be made for each easement to cover the costs of managing, monitoring, and enforcing the easement.\n(b) A landowner who violates the terms of an easement under this section or induces, assists, or allows another to do so is liable to the state for damages due to the loss of timber, scenic, recreational, fish and wildlife habitat, threatened and endangered species, and other cultural and environmental values.\n(c) Upon request of the commissioner, the attorney general may commence an action for specific performance, injunctive relief, damages, including attorney fees, and any other appropriate relief to enforce this section in district court in the county where all or part of the violation is alleged to have been committed or where the landowner resides or has a principal place of business.\nEasements agreed to under this section are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.",
	"repealed": false
}