{
	"id": "260B.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.105",
	"title": "260B.105 VENUE.",
	"text": "Except where otherwise provided, venue for any proceedings under section 260B.101 shall be in the county where the child is found, or the county of the child's residence. If delinquency, a juvenile petty offense, or a juvenile traffic offense is alleged, proceedings shall be brought in the county where the alleged delinquency or juvenile traffic offense occurred.\nThe judge of the juvenile court may transfer any proceedings brought under section 260B.101, to the juvenile court of a county having venue as provided in subdivision 1 in the following manner. When it appears that the best interests of the child, society, or the convenience of proceedings will be served by a transfer, the court may transfer the case to the juvenile court of the county of the child's residence. With the consent of the receiving court, the court may also transfer the case to the juvenile court of the county where the child is found. If delinquency, a juvenile petty offense, or a juvenile traffic offense is alleged, the court shall first hear the case and then may transfer the case to the juvenile court of the county of the child's residence for disposition after a finding or admission of guilt. The court transfers the case by ordering a continuance and by forwarding to the court administrator of the appropriate juvenile court a certified copy of all papers filed, together with an order of transfer.\nExcept when a child is alleged to have committed an adult court traffic offense, as defined in section 260B.225, subdivision 1, paragraph (c), if it appears at any stage of the proceeding that a child before the court is a resident of another state, the court may invoke the provisions of the Interstate Compact on Juveniles or, if it is in the best interests of the child or the public to do so, the court may place the child in the custody of the child's parent, guardian, or custodian, if the parent, guardian, or custodian agrees to accept custody of the child and return the child to the child's state.",
	"repealed": false
}