{
	"id": "356.636",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.636",
	"title": "356.636 CORRECTION OF ERRORS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Pension fund\" means the Minnesota State Retirement System, the Public Employees Retirement Association, the Teachers Retirement Association, and the St. Paul Teachers Retirement Fund Association.\n(c) \"Tax qualification\" means compliance with all applicable requirements of section 401(a) or 457(b) of the Internal Revenue Code.\n(a) The executive director of a pension fund may correct an operational, demographic, or employer or employee eligibility error, or an error in a plan document that is not a statute if the executive director determines that correction is necessary or appropriate to preserve and protect the tax qualification of any pension or retirement plan listed in section 356.611, subdivision 6, that is part of the pension fund. The method of correction must comply with the Internal Revenue Service Employee Plans Compliance Resolution System (EPCRS) or any successor thereto, if the EPCRS addresses the error and correction.\n(b) To the extent deemed necessary by the executive director to implement correction, the executive director may:\n(1) make distributions;\n(2) transfer assets;\n(3) recover an overpayment by reducing future benefit payments or designating appropriate revenue or source of funding that will restore to the plan the amount of the overpayment; or\n(4) take any other action that will restore the plan and any affected member or participant to the position the plan, member, or participant would have been in had the error not occurred.\n(c) An executive director may correct an error under paragraph (a) or (b) without regard to any statute that imposes a time limitation on making such correction.\nThe executive director of each pension fund must report annually, no later than each February 1, to the chair and executive director of the Legislative Commission on Pensions and Retirement on whether the executive director of the pension fund corrected any operational, demographic, employer or employee eligibility, or plan document error during the preceding calendar year. The report must describe the error, the pension or retirement plan affected by the error, the method of correction, and the cost, if any, to the pension or retirement plan, employee, or employer of the error and correction.",
	"repealed": false
}