{
	"id": "256R.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.47",
	"title": "256R.47 RATE ADJUSTMENT FOR CRITICAL ACCESS NURSING FACILITIES.",
	"text": "(a) The commissioner, in consultation with the commissioner of health, may designate certain nursing facilities as critical access nursing facilities. The designation shall be granted on a competitive basis, within the limits of funds appropriated for this purpose.\n(b) The commissioner shall request proposals from nursing facilities every two years. Proposals must be submitted in the form and according to the timelines established by the commissioner. In selecting applicants to designate, the commissioner, in consultation with the commissioner of health, and with input from stakeholders, shall develop criteria designed to preserve access to nursing facility services in isolated areas, rebalance long-term care, and improve quality. To the extent practicable, the commissioner shall ensure an even distribution of designations across the state.\n(c) For nursing facilities designated as critical access nursing facilities, the commissioner shall allow a supplemental payment above a facility's operating payment rate as determined to be necessary by the commissioner to maintain access to nursing facility services in isolated areas identified in paragraph (b). The commissioner must approve the amounts of supplemental payments through a memorandum of understanding. Supplemental payments to facilities under this section must be in the form of time-limited rate adjustments included in the external fixed costs payment rate under section 256R.25.\n(d) Designation of a critical access nursing facility is for a maximum period of up to two years, after which the benefit allowed under paragraph (c) shall be removed. Designated facilities may apply for continued designation.\n(e) The memorandum of understanding required by paragraph (c) must state that the designation of a critical access nursing facility must be removed if the facility undergoes a change of ownership as defined in section 144A.06, subdivision 2.",
	"repealed": false
}