{
	"id": "256.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.045",
	"title": "256.045 ADMINISTRATIVE AND JUDICIAL REVIEW OF HUMAN SERVICES MATTERS.",
	"text": "The commissioner of human services, in consultation with the Direct Care and Treatment executive board, may appoint one or more state human services judges to conduct hearings and recommend orders in accordance with subdivisions 3, 3a, 3b, 4a, 5, and 5a. Human services judges designated pursuant to this section may administer oaths and shall be under the control and supervision of the commissioner of human services and shall not be a part of the Office of Administrative Hearings established pursuant to sections 14.48 to 14.56. The commissioner shall only appoint as a full-time human services judge an individual who is licensed to practice law in Minnesota and who is:\n(1) in active status;\n(2) an inactive resident;\n(3) retired;\n(4) on disabled status; or\n(5) on retired senior status.\nFor purposes of this section, \"Direct Care and Treatment executive board\" or \"executive board\" means the Direct Care and Treatment executive board established under section 246C.06.\n[Repealed, 1987 c 148 s 9]\n(a) State agency hearings are available for the following:\n(1) any person:\n(i) applying for, receiving or having received public assistance, medical care, or a program of social services administered by the commissioner or a county agency on behalf of the commissioner; and\n(ii) whose application for assistance is denied, not acted upon with reasonable promptness, or whose assistance is suspended, reduced, terminated, or claimed to have been incorrectly paid;\n(2) any patient or relative aggrieved by an order of the commissioner under section 252.27;\n(3) a party aggrieved by a ruling of a prepaid health plan;\n(4) except as provided under chapter 245C, any individual or facility determined by a lead investigative agency to have maltreated a vulnerable adult under section 626.557 after they have exercised their right to administrative reconsideration under section 626.557;\n(5) any person to whom a right of appeal according to this section is given by other provision of law;\n(6) an applicant aggrieved by an adverse decision to an application for a hardship waiver under section 256B.15;\n(7) an applicant aggrieved by an adverse decision to an application or redetermination for a Medicare Part D prescription drug subsidy under section 256B.04, subdivision 4a;\n(8) except as provided under chapter 245A, an individual or facility determined to have maltreated a minor under chapter 260E, after the individual or facility has exercised the right to administrative reconsideration under chapter 260E;\n(9) except as provided under chapter 245C, an individual disqualified under sections 245C.14 and 245C.15, following a reconsideration decision issued under section 245C.23, on the basis of serious or recurring maltreatment; a preponderance of the evidence that the individual has committed an act or acts that meet the definition of any of the crimes listed in section 245C.15, subdivisions 1 to 4; or for failing to make reports required under section 260E.06, subdivision 1, or 626.557, subdivision 3. Hearings regarding a maltreatment determination under clause (4) or (8), and a disqualification under this clause in which the basis for a disqualification is serious or recurring maltreatment, shall be consolidated into a single fair hearing. In such cases, the scope of review by the human services judge shall include both the maltreatment determination and the disqualification. The failure to exercise the right to an administrative reconsideration shall not be a bar to a hearing under this section if federal law provides an individual the right to a hearing to dispute a finding of maltreatment;\n(10) any person with an outstanding debt resulting from receipt of public assistance administered by the commissioner or medical care who is contesting a setoff claim by the Department of Human Services or a county agency. The scope of the appeal is the validity of the claimant agency's intention to request a setoff of a refund under chapter 270A against the debt;\n(11) a person issued a notice of service termination under section 245D.10, subdivision 3a, by a licensed provider of any residential supports or services listed in section 245D.03, subdivision 1, paragraphs (b) and (c), that is not otherwise subject to appeal under subdivision 4a;\n(12) an individual disability waiver recipient based on a denial of a request for a rate exception under section 256B.4914;\n(13) a person issued a notice of service termination under section 245A.11, subdivision 11, that is not otherwise subject to appeal under subdivision 4a; or\n(14) a recovery community organization seeking medical assistance vendor eligibility under section 254B.01, subdivision 8, that is aggrieved by a membership or accreditation determination and that believes the organization meets the requirements under section 254B.05, subdivision 1, paragraph (d), clauses (1) to (10). The scope of the review by the human services judge shall be limited to whether the organization meets each of the requirements under section 254B.05, subdivision 1, paragraph (d), clauses (1) to (10).\n(b) The hearing for an individual or facility under paragraph (a), clause (4), (8), or (9), is the only administrative appeal to the final agency determination specifically, including a challenge to the accuracy and completeness of data under section 13.04. Hearings requested under paragraph (a), clause (4), apply only to incidents of maltreatment that occur on or after October 1, 1995. Hearings requested by nursing assistants in nursing homes alleged to have maltreated a resident prior to October 1, 1995, shall be held as a contested case proceeding under the provisions of chapter 14. Hearings requested under paragraph (a), clause (8), apply only to incidents of maltreatment that occur on or after July 1, 1997. A hearing for an individual or facility under paragraph (a), clause (4), (8), or (9), is only available when there is no district court action pending. If such action is filed in district court while an administrative review is pending that arises out of some or all of the events or circumstances on which the appeal is based, the administrative review must be suspended until the judicial actions are completed. If the district court proceedings are completed, dismissed, or overturned, the matter may be considered in an administrative hearing.\n(c) For purposes of this section, bargaining unit grievance procedures are not an administrative appeal.\n(d) The scope of hearings involving claims to foster care payments under section 142A.20, subdivision 2, clause (2), shall be limited to the issue of whether the county is legally responsible for a child's placement under court order or voluntary placement agreement and, if so, the correct amount of foster care payment to be made on the child's behalf and shall not include review of the propriety of the county's child protection determination or child placement decision.\n(e) The scope of hearings under paragraph (a), clauses (11) and (13), shall be limited to whether the proposed termination of services is authorized under section 245D.10, subdivision 3a, paragraph (b), or 245A.11, subdivision 11, and whether the requirements of section 245D.10, subdivision 3a, paragraphs (c) to (e), or 245A.11, subdivision 2a, paragraphs (d) and (e), were met. If the appeal includes a request for a temporary stay of termination of services, the scope of the hearing shall also include whether the case management provider has finalized arrangements for a residential facility, a program, or services that will meet the assessed needs of the recipient by the effective date of the service termination.\n(f) A vendor of medical care as defined in section 256B.02, subdivision 7, or a vendor under contract with a county agency to provide social services is not a party and may not request a hearing under this section, except if assisting a recipient as provided in subdivision 4.\n(g) An applicant or recipient is not entitled to receive social services beyond the services prescribed under chapter 256M or other social services the person is eligible for under state law.\n(h) The commissioner may summarily affirm the county or state agency's proposed action without a hearing when the sole issue is an automatic change due to a change in state or federal law, except in matters covered by paragraph (i).\n(i) When the subject of an administrative review is a matter within the jurisdiction of the Direct Care and Treatment executive board as a part of the board's powers and duties under chapter 246C, the executive board may summarily affirm the county or state agency's proposed action without a hearing when the sole issue is an automatic change due to a change in state or federal law.\n(j) Unless federal or Minnesota law specifies a different time frame in which to file an appeal, an individual or organization specified in this section may contest the specified action, decision, or final disposition before the state agency by submitting a written request for a hearing to the state agency within 30 days after receiving written notice of the action, decision, or final disposition, or within 90 days of such written notice if the applicant, recipient, patient, or relative shows good cause, as defined in section 256.0451, subdivision 13, why the request was not submitted within the 30-day time limit. The individual filing the appeal has the burden of proving good cause by a preponderance of the evidence.\n(a) All prepaid health plans under contract to the commissioner under chapter 256B must provide for a complaint system according to section 62D.11. When a prepaid health plan denies, reduces, or terminates a health service or denies a request to authorize a previously authorized health service, the prepaid health plan must notify the recipient of the right to file a complaint or an appeal. The notice must include the name and telephone number of the ombudsman and notice of the recipient's right to request a hearing under paragraph (b). Recipients may request the assistance of the ombudsman in the complaint system process. The prepaid health plan must issue a written resolution of the complaint to the recipient within 30 days after the complaint is filed with the prepaid health plan. A recipient is required to exhaust the complaint system procedures in order to request a hearing under paragraph (b).\n(b) Recipients enrolled in a prepaid health plan under chapter 256B may contest a prepaid health plan's denial, reduction, or termination of health services, a prepaid health plan's denial of a request to authorize a previously authorized health service, or the prepaid health plan's written resolution of a complaint by submitting a written request for a hearing according to subdivision 3. A state human services judge shall conduct a hearing on the matter and shall recommend an order to the commissioner of human services. The commissioner need not grant a hearing if the sole issue raised by a recipient is the commissioner's authority to require mandatory enrollment in a prepaid health plan in a county where prepaid health plans are under contract with the commissioner. The state human services judge may order a second medical opinion from a nonprepaid health plan provider at the expense of the Department of Human Services. Recipients may request the assistance of the ombudsman in the appeal process.\n(c) In the written request for a hearing to appeal from a prepaid health plan's denial, reduction, or termination of a health service, a prepaid health plan's denial of a request to authorize a previously authorized service, or the prepaid health plan's written resolution to a complaint, a recipient may request an expedited hearing. If an expedited appeal is warranted, the state human services judge shall hear the appeal and render a decision within a time commensurate with the level of urgency involved, based on the individual circumstances of the case.\n(d) Beginning January 1, 2018, the requirements of Code of Federal Regulations, part 42, sections 438.400 to 438.424, take precedence over any conflicting provisions in this subdivision. All other provisions of this section remain in effect.\n(a) The state human services judge shall determine that maltreatment has occurred if a preponderance of evidence exists to support the final disposition under section 626.557 and chapter 260E. For purposes of hearings regarding disqualification, the state human services judge shall affirm the proposed disqualification in an appeal under subdivision 3, paragraph (a), clause (9), if a preponderance of the evidence shows the individual has:\n(1) committed maltreatment under section 626.557 or chapter 260E that is serious or recurring;\n(2) committed an act or acts meeting the definition of any of the crimes listed in section 245C.15, subdivisions 1 to 4; or\n(3) failed to make required reports under section 626.557 or chapter 260E, for incidents in which the final disposition under section 626.557 or chapter 260E was substantiated maltreatment that was serious or recurring.\n(b) If the disqualification is affirmed, the state human services judge shall determine whether the individual poses a risk of harm in accordance with the requirements of section 245C.22, and whether the disqualification should be set aside or not set aside. In determining whether the disqualification should be set aside, the human services judge shall consider all of the characteristics that cause the individual to be disqualified, including those characteristics that were not subject to review under paragraph (a), in order to determine whether the individual poses a risk of harm. A decision to set aside a disqualification that is the subject of the hearing constitutes a determination that the individual does not pose a risk of harm and that the individual may provide direct contact services in the individual program specified in the set aside.\n(c) If a disqualification is based solely on a conviction or is conclusive for any reason under section 245C.29, the disqualified individual does not have a right to a hearing under this section.\n(d) The state human services judge shall recommend an order to the commissioner of health; education; children, youth, and families; or human services, as applicable, who shall issue a final order. The commissioner shall affirm, reverse, or modify the final disposition. Any order of the commissioner issued in accordance with this subdivision is conclusive upon the parties unless appeal is taken in the manner provided in subdivision 7. In any licensing appeal under chapters 245A and 245C and sections 144.50 to 144.58 and 144A.02 to 144A.482, the commissioner's determination as to maltreatment is conclusive, as provided under section 245C.29.\n[Repealed, 2005 c 98 art 2 s 18]\n(a) All hearings held pursuant to subdivision 3, 3a, 3b, or 4a shall be conducted according to the provisions of the federal Social Security Act and the regulations implemented in accordance with that act to enable this state to qualify for federal grants-in-aid, and according to the rules and written policies of the commissioner of human services. County agencies shall install equipment necessary to conduct telephone hearings. A state human services judge may schedule a telephone conference hearing when the distance or time required to travel to the county agency offices will cause a delay in the issuance of an order, or to promote efficiency, or at the mutual request of the parties. Hearings may be conducted by telephone conferences unless the applicant, recipient, former recipient, person, or facility contesting maltreatment objects. A human services judge may grant a request for a hearing in person by holding the hearing by interactive video technology or in person. The human services judge must hear the case in person if the person asserts that either the person or a witness has a physical or mental disability that would impair the person's or witness's ability to fully participate in a hearing held by interactive video technology. The hearing shall not be held earlier than five days after filing of the required notice with the county or state agency. The state human services judge shall notify all interested persons of the time, date, and location of the hearing at least five days before the date of the hearing. Interested persons may be represented by legal counsel or other representative of their choice, including a provider of therapy services, at the hearing and may appear personally, testify and offer evidence, and examine and cross-examine witnesses. The applicant, recipient, former recipient, person, or facility contesting maltreatment shall have the opportunity to examine the contents of the case file and all documents and records to be used by the county or state agency at the hearing at a reasonable time before the date of the hearing and during the hearing. In hearings under subdivision 3, paragraph (a), clauses (4), (8), and (9), either party may subpoena the private data relating to the investigation prepared by the agency under section 626.557 or chapter 260E that is not otherwise accessible under section 13.04, provided the identity of the reporter may not be disclosed.\n(b) The private data obtained by subpoena in a hearing under subdivision 3, paragraph (a), clause (4), (8), or (9), must be subject to a protective order which prohibits its disclosure for any other purpose outside the hearing provided for in this section without prior order of the district court. Disclosure without court order is punishable by a sentence of not more than 90 days imprisonment or a fine of not more than $1,000, or both. These restrictions on the use of private data do not prohibit access to the data under section 13.03, subdivision 6. Except for appeals under subdivision 3, paragraph (a), clauses (4), (8), and (9), upon request, the county agency shall provide reimbursement for transportation, child care, photocopying, medical assessment, witness fee, and other necessary and reasonable costs incurred by the applicant, recipient, or former recipient in connection with the appeal. All evidence, except that privileged by law, commonly accepted by reasonable people in the conduct of their affairs as having probative value with respect to the issues shall be submitted at the hearing and such hearing shall not be \"a contested case\" within the meaning of section 14.02, subdivision 3. The agency must present its evidence prior to or at the hearing, and may not submit evidence after the hearing except by agreement of the parties at the hearing, provided the petitioner has the opportunity to respond.\n(c) In hearings under subdivision 3, paragraph (a), clause (4), (8), or (9), involving determinations of maltreatment or disqualification made by more than one county agency, by a county agency and a state agency, or by more than one state agency, the hearings may be consolidated into a single fair hearing upon the consent of all parties and the state human services judge.\n(d) For hearings under subdivision 3, paragraph (a), clause (4) or (9), involving a vulnerable adult, the human services judge shall notify the vulnerable adult who is the subject of the maltreatment determination and, if known, a guardian of the vulnerable adult appointed under section 524.5-310, or a health care agent designated by the vulnerable adult in a health care directive that is currently effective under section 145C.06 and whose authority to make health care decisions is not suspended under section 524.5-310, of the hearing. The notice must be sent by certified mail and inform the vulnerable adult of the right to file a signed written statement in the proceedings. A guardian or health care agent who prepares or files a written statement for the vulnerable adult must indicate in the statement that the person is the vulnerable adult's guardian or health care agent and sign the statement in that capacity. The vulnerable adult, the guardian, or the health care agent may file a written statement with the human services judge hearing the case no later than five business days before commencement of the hearing. The human services judge shall include the written statement in the hearing record and consider the statement in deciding the appeal. This subdivision does not limit, prevent, or excuse the vulnerable adult from being called as a witness testifying at the hearing or grant the vulnerable adult, the guardian, or health care agent a right to participate in the proceedings or appeal the human services judge's decision in the case. The lead investigative agency must consider including the vulnerable adult victim of maltreatment as a witness in the hearing. If the lead investigative agency determines that participation in the hearing would endanger the well-being of the vulnerable adult or not be in the best interests of the vulnerable adult, the lead investigative agency shall inform the human services judge of the basis for this determination, which must be included in the final order. If the human services judge is not reasonably able to determine the address of the vulnerable adult, the guardian, or the health care agent, the human services judge is not required to send a hearing notice under this subdivision.\nAny recipient of case management services pursuant to section 256B.092, who contests the county agency's action or failure to act in the provision of those services, other than a failure to act with reasonable promptness or a suspension, reduction, denial, or termination of services, must submit a written request for a conciliation conference to the county agency. The county agency shall inform the commissioner of the receipt of a request when it is submitted and shall schedule a conciliation conference. The county agency shall notify the recipient, the commissioner, and all interested persons of the time, date, and location of the conciliation conference. The commissioner may assist the county by providing mediation services or by identifying other resources that may assist in the mediation between the parties. Within 30 days, the county agency shall conduct the conciliation conference and inform the recipient in writing of the action the county agency is going to take and when that action will be taken and notify the recipient of the right to a hearing under this subdivision. The conciliation conference shall be conducted in a manner consistent with the commissioner's instructions. If the county fails to conduct the conciliation conference and issue its report within 30 days, or, at any time up to 90 days after the conciliation conference is held, a recipient may submit to the commissioner a written request for a hearing before a state human services judge to determine whether case management services have been provided in accordance with applicable laws and rules or whether the county agency has assured that the services identified in the recipient's individual service plan have been delivered in accordance with the laws and rules governing the provision of those services. The state human services judge shall recommend an order to the commissioner, who shall, in accordance with the procedure in subdivision 5, issue a final order within 60 days of the receipt of the request for a hearing, unless the commissioner refuses to accept the recommended order, in which event a final order shall issue within 90 days of the receipt of that request. The order may direct the county agency to take those actions necessary to comply with applicable laws or rules. The commissioner may issue a temporary order prohibiting the demission of a recipient of case management services from a residential or day habilitation program licensed under chapter 245A, while a county agency review process or an appeal brought by a recipient under this subdivision is pending, or for the period of time necessary for the county agency to implement the commissioner's order. The commissioner shall not issue a final order staying the demission of a recipient of case management services from a residential or day habilitation program licensed under chapter 245A.\n(a) Except as provided for under subdivision 5a for matters under the jurisdiction of the Direct Care and Treatment executive board and for hearings held under section 142A.20, subdivision 2, a state human services judge shall conduct a hearing on the appeal and shall recommend an order to the commissioner of human services. The recommended order must be based on all relevant evidence and must not be limited to a review of the propriety of the state or county agency's action. A human services judge may take official notice of adjudicative facts. The commissioner of human services may accept the recommended order of a state human services judge and issue the order to the county agency and the applicant, recipient, former recipient, or prepaid health plan. The commissioner on refusing to accept the recommended order of the state human services judge, shall notify the petitioner, the agency, or prepaid health plan of that fact and shall state reasons therefor and shall allow each party ten days' time to submit additional written argument on the matter. After the expiration of the ten-day period, the commissioner shall issue an order on the matter to the petitioner, the agency, or prepaid health plan.\n(b) A party aggrieved by an order of the commissioner may appeal under subdivision 7, or request reconsideration by the commissioner within 30 days after the date the commissioner issues the order. The commissioner may reconsider an order upon request of any party or on the commissioner's own motion. A request for reconsideration does not stay implementation of the commissioner's order. The person seeking reconsideration has the burden to demonstrate why the matter should be reconsidered. The request for reconsideration may include legal argument and proposed additional evidence supporting the request. If proposed additional evidence is submitted, the person must explain why the proposed additional evidence was not provided at the time of the hearing. If reconsideration is granted, the other participants must be sent a copy of all material submitted in support of the request for reconsideration and must be given ten days to respond. Upon reconsideration, the commissioner may issue an amended order or an order affirming the original order.\n(c) Any order of the commissioner issued under this subdivision shall be conclusive upon the parties unless appeal is taken in the manner provided by subdivision 7. Any order of the commissioner is binding on the parties and must be implemented by the state agency, a county agency, or a prepaid health plan according to subdivision 3a, until the order is reversed by the district court, or unless the commissioner or a district court orders monthly assistance or aid or services paid or provided under subdivision 10.\n(d) A vendor of medical care as defined in section 256B.02, subdivision 7, or a vendor under contract with a county agency to provide social services is not a party and may not request a hearing or seek judicial review of an order issued under this section, unless assisting a recipient as provided in subdivision 4. A prepaid health plan is a party to an appeal under subdivision 3a, but cannot seek judicial review of an order issued under this section.\n(a) When the subject of an administrative review is a matter within the jurisdiction of the Direct Care and Treatment executive board as a part of the board's powers and duties under chapter 246C, a state human services judge shall conduct a hearing on the appeal and shall recommend an order to the executive board. The recommended order must be based on all relevant evidence and must not be limited to a review of the propriety of the state or county agency's action. A human services judge may take official notice of adjudicative facts. The Direct Care and Treatment executive board may accept the recommended order of a state human services judge and issue the order to the parties. The executive board, on refusing to accept the recommended order of the state human services judge, shall notify the parties of the refusal and the reasoning and shall allow each party ten days to submit additional written argument on the matter. After the expiration of the ten-day period, the executive board shall issue an order on the matter to the parties.\n(b) A party aggrieved by an order of the executive board may appeal under subdivision 7, or request reconsideration by the executive board within 30 days after the date the executive board issues the order. The executive board may reconsider an order upon request of any party or on the executive board's own motion. A request for reconsideration does not stay implementation of the executive board's order. The person seeking reconsideration has the burden to demonstrate why the matter should be reconsidered. The request for reconsideration may include legal argument and proposed additional evidence supporting the request. If proposed additional evidence is submitted, the person must explain why the proposed additional evidence was not provided at the time of the hearing. If reconsideration is granted, the other participants must be sent a copy of all material submitted in support of the request for reconsideration and must be given ten days to respond. Upon reconsideration, the executive board may issue an amended order or an order affirming the original order.\n(c) Any order of the executive board issued under this subdivision shall be conclusive upon the parties unless appeal is taken in the manner provided by subdivision 7. Any order of the executive board is binding on the parties and must be implemented by the state agency or a county agency, until the order is reversed by the district court, or unless the executive board or a district court orders monthly services paid or provided under subdivision 10.\n(d) A vendor of medical care as defined in section 256B.02, subdivision 7, or a vendor under contract with a county agency to provide social services is not a party and may not request a hearing or seek judicial review of an order issued under this section, unless assisting a recipient as provided in subdivision 4. Direct Care and Treatment is not a vendor for the purposes of this paragraph.\n(a) The commissioner of human services, the commissioner of health for matters within the commissioner's jurisdiction under subdivision 3b, or the Direct Care and Treatment executive board for matters within the jurisdiction of the executive board under subdivision 5a, may initiate a review of any action or decision of a county agency and direct that the matter be presented to a state human services judge for a hearing held under subdivision 3, 3a, 3b, or 4a. In all matters dealing with human services committed by law to the discretion of the county agency, the judgment of the applicable commissioner or executive board may be substituted for that of the county agency. The applicable commissioner or executive board may order an independent examination when appropriate.\n(b) Any party to a hearing held pursuant to subdivision 3, 3a, 3b, or 4a may request that the applicable commissioner or executive board issue a subpoena to compel the attendance of witnesses and the production of records at the hearing. A local agency may request that the applicable commissioner or executive board issue a subpoena to compel the release of information from third parties prior to a request for a hearing under section 256.046 upon a showing of relevance to such a proceeding. The issuance, service, and enforcement of subpoenas under this subdivision is governed by section 357.22 and the Minnesota Rules of Civil Procedure.\n(c) The commissioner of human services may issue a temporary order staying a proposed demission by a residential facility licensed under chapter 245A:\n(1) while an appeal by a recipient under subdivision 3 is pending;\n(2) for the period of time necessary for the case management provider to implement the commissioner's order; or\n(3) for appeals under subdivision 3, paragraph (a), clause (11), when the individual is seeking a temporary stay of demission on the basis that the county has not yet finalized an alternative arrangement for a residential facility, a program, or services that will meet the assessed needs of the individual by the effective date of the service termination, a temporary stay of demission may be issued for no more than 30 calendar days to allow for such arrangements to be finalized.\nExcept for a prepaid health plan, any party who is aggrieved by an order of the commissioner of human services; the commissioner of health; or the commissioner of children, youth, and families in appeals within the commissioner's jurisdiction under subdivision 3b; or the Direct Care and Treatment executive board in appeals within the jurisdiction of the executive board under subdivision 5a may appeal the order to the district court of the county responsible for furnishing assistance, or, in appeals under subdivision 3b, the county where the maltreatment occurred, by serving a written copy of a notice of appeal upon the applicable commissioner or executive board and any adverse party of record within 30 days after the date the commissioner or executive board issued the order, the amended order, or order affirming the original order, and by filing the original notice and proof of service with the court administrator of the district court. Service may be made personally or by mail; service by mail is complete upon mailing; no filing fee shall be required by the court administrator in appeals taken pursuant to this subdivision, with the exception of appeals taken under subdivision 3b. The applicable commissioner or executive board may elect to become a party to the proceedings in the district court. Except for appeals under subdivision 3b, any party may demand that the commissioner or executive board furnish all parties to the proceedings with a copy of the decision, and a transcript of any testimony, evidence, or other supporting papers from the hearing held before the human services judge, by serving a written demand upon the applicable commissioner or executive board within 30 days after service of the notice of appeal. Any party aggrieved by the failure of an adverse party to obey an order issued by the commissioner or executive board under subdivision 5 or 5a may compel performance according to the order in the manner prescribed in sections 586.01 to 586.12.\nAny party may obtain a hearing at a special term of the district court by serving a written notice of the time and place of the hearing at least ten days prior to the date of the hearing. The court may consider the matter in or out of chambers, and shall take no new or additional evidence unless it determines that such evidence is necessary for a more equitable disposition of the appeal.\nAny party aggrieved by the order of the district court may appeal the order as in other civil cases. Except for appeals under subdivision 3b, no costs or disbursements shall be taxed against any party nor shall any filing fee or bond be required of any party.\nIf the commissioner of human services or district court orders monthly assistance or aid or services paid or provided in any proceeding under this section, it shall be paid or provided pending appeal to the commissioner of human services, district court, court of appeals, or supreme court. The human services judge may order the local human services agency to reduce or terminate medical assistance to a recipient before a final order is issued under this section if: (1) the human services judge determines at the hearing that the sole issue on appeal is one of a change in state or federal law; and (2) the commissioner or the local agency notifies the recipient before the action. The state or county agency has a claim for cash payments, medical assistance, and MinnesotaCare program payments made to or on behalf of a recipient or former recipient while an appeal is pending if the recipient or former recipient is determined ineligible for cash payments, medical assistance, or MinnesotaCare as a result of the appeal, except for medical assistance made on behalf of a recipient pursuant to a court order. In enforcing a claim on MinnesotaCare program payments, the state or county agency shall reduce the claim amount by the value of any premium payments made by a recipient or former recipient during the period for which the recipient or former recipient has been determined to be ineligible. Provision of a health care service by the state agency under medical assistance or MinnesotaCare pending appeal shall not render moot the state agency's position in a court of law.",
	"repealed": false
}