{
	"id": "115.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.44",
	"title": "115.44 CLASSIFICATION OF WATERS; STANDARDS OF QUALITY AND PURITY.",
	"text": "It is recognized that, due to variable factors, no single standard of quality and purity of the waters is applicable to all waters of the state or to different segments of the same waters.\nIn order to attain the objectives of sections 115.41 to 115.53, the agency after proper study, and after conducting public hearing upon due notice, shall, as soon as practicable, group the designated waters of the state into classes, and adopt classifications and standards of purity and quality therefor. Such classification shall be made in accordance with considerations of best usage in the interest of the public and with regard to the considerations mentioned in subdivision 3 hereof.\nIn adopting the classification of waters and the standards of purity and quality above mentioned, the agency shall give consideration to:\n(1) the size, depth, surface area covered, volume, direction and rate of flow, stream gradient and temperature of the water;\n(2) the character of the district bordering said waters and its peculiar suitability for the particular uses, and with a view to conserving the value of the same and encouraging the most appropriate use of lands bordering said waters, for residential, agricultural, industrial, or recreational purposes;\n(3) the uses which have been made, are being made, or may be made of said waters for transportation, domestic and industrial consumption, bathing, fishing and fish culture, fire prevention, the disposal of sewage, industrial wastes and other wastes or other uses within this state, and, at the discretion of the agency, any such uses in another state on interstate waters flowing through or originating in this state;\n(4) the extent of present defilement or fouling of said waters which has already occurred or resulted from past discharges therein;\n(5) the need for standards for effluent from disposal systems entering waters of the state;\n(6) such other considerations as the agency deems proper.\nThe agency, after proper study, and in accordance with chapter 14, shall adopt and design standards of quality and purity for each classification necessary for the public use or benefit contemplated by the classification. The standards shall prescribe what qualities and properties of water indicate a polluted condition of the waters of the state which is actually or potentially deleterious, harmful, detrimental, or injurious to the public health, safety, or welfare; to terrestrial or aquatic life or to its growth and propagation; or to the use of the waters for domestic, commercial and industrial, agricultural, recreational, or other reasonable purposes, with respect to the various classes established pursuant to subdivision 2. The standards may also contain other provisions that the agency deems proper. Wherever practicable and advisable, the agency shall establish standards for effluent of disposal systems entering classified waters.\n(a) In establishing such standards, consideration should be given to the following factors:\n(1) the extent, if any, to which floating solids may be permitted in the water;\n(2) the extent to which suspended solids, colloids or a combination of solids with other substances suspended in water, may be permitted;\n(3) the extent to which organism of the coliform group (intestinal bacilli) or any other bacteriological organisms may be permitted in the water;\n(4) the extent of the oxygen demand which may be permitted in the receiving waters;\n(5) such other chemical or biological properties necessary for the attainment of the objectives of this chapter and, with respect to pollution of the waters of the state, chapter 116.\n(b) Wherever deemed practicable and advisable by the agency, standards specifying the quality and purity, or maximum permissible pollutional content, of effluent entering waters of the state may be established without respect to water quality standards; provided, however, that whenever the owner or operator of any point source, after opportunity for public hearing, can demonstrate to the satisfaction of the agency that any effluent limitation proposed for the control of the heat component of any discharge from such source will require effluent limitations more stringent than necessary to assure the protection and propagation of a balanced, indigenous population of fish and wildlife in and on the body of water into which the discharge is to be made, the agency may impose an effluent limitation for such plan, with respect to the heat component of such discharge, taking into account the interaction of such heat component with other pollutants, that will assure the protection and propagation of a balanced, indigenous population of fish and wildlife in and on that body of water; and provided further that notwithstanding any other provision of this chapter and, with respect to the pollution of the waters of the state, chapter 116, any point source of a discharge having a heat component, the modification of which point source is commenced after May 20, 1973, and which, as modified, meets applicable effluent limitations, and which effluent limitations will assure protection and propagation of a balanced, indigenous population of fish and wildlife in or on the water into which the discharge is made, shall not be subject to any more stringent effluent limitation with respect to the heat component of its discharge during a ten-year period beginning on the date of completion of such modification or during the period of depreciation or amortization of such facility for the purpose of section 167 or 169, or both, of the Internal Revenue Code of 1954, whichever period ends first.\nThe adoption, alteration, or modification of the standards of quality and purity in subdivision 4 shall be made by the agency in accordance with chapter 14.\nFor rules authorized under this section, the notices required to be mailed under sections 14.14, subdivision 1a, and 14.22 must also be mailed to the governing body of each municipality bordering or through which the waters for which standards are sought to be adopted flow.\n(a) If the agency finds in order to comply with the Federal Water Pollution Control Act or any other federal law or rule or regulation promulgated thereunder that it is impracticable to comply with the requirements of this section in classifying waters or adopting standards or in meeting any of the requirements thereof, compliance with the requirements of such section are waived to the extent necessary to enable the agency to comply with federal laws and rules and regulations promulgated thereunder. The agency may classify waters and adopt criteria and standards in such form and based upon such evidence as it may deem necessary and sufficient for the purposes of meeting requirements of such federal laws, notwithstanding any provisions in this chapter or any other state law to the contrary. In the event waters are classified and criteria and standards are adopted to meet the requirements of federal law, the agency shall thereafter proceed to otherwise comply with the provisions of this section which were waived as rapidly as is practicable. This authority shall extend to proceedings pending before the agency on May 20, 1973.\n(b) Notwithstanding the provisions of subdivision 4, wherever advisable and practicable the agency may establish standards for effluent or disposal systems discharging into waters of the state regardless of whether such waters are or are not classified.\nMS 2022 [Repealed, 2023 c 60 art 3 s 38]",
	"repealed": false
}