{
	"id": "72A.497",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.497",
	"title": "72A.497 ACCESS TO PERSONAL INFORMATION.",
	"text": "(a) If an individual, after proper identification, submits a written request to an insurer, insurance agent, or insurance-support organization for access to personal information about the individual, the insurer, insurance agent, or insurance-support organization shall within 30 business days from the date the request is received:\n(1) inform the individual of the nature and substance of the personal information that they possess in writing, by telephone, or by other oral communication, whichever the insurer, insurance agent, or insurance-support organization elects;\n(2) permit the individual to see and copy, in person, the personal information pertaining to that person;\n(3) permit the individual to obtain by mail a copy of all of the personal information or a reasonably described portion thereof, whichever the individual requests;\n(4) disclose to the individual the identity of those persons to whom the insurer, insurance agent, or insurance-support organization has disclosed the personal information within two years before the request; and\n(5) provide the individual with a summary of the procedures by which the person may request correction, amendment, or deletion of personal information, as provided under section 72A.498.\n(b) If the personal information is in coded form, an accurate translation in plain language must be provided in writing.\n(c) If credit information is requested that federal law prohibits an insurer to disclose, the insurer must disclose that the individual has the right to receive the credit information from the credit reporting agency. The insurer must disclose the name, address, and telephone number of the credit reporting agency that supplied the insurer with the credit information.\nAny personal information collected must specifically identify the source of the information.\n(a) Health record information requested under subdivision 1 that has been supplied by a health care institution or a health professional must provide the identity of the health professional or health care institution that supplied the information. The health record information must be provided either directly to the individual or to a health professional designated by the person who is licensed to provide health care with respect to the condition to which the information relates, whichever the individual elects. If the information is provided to a designated health professional, the insurer, insurance agent, or insurance-support organization shall notify the person, at the time of the disclosure, that the information has been provided to the health professional.\n(b) If a health professional or a health care institution has provided health information to an insurer, insurance-support organization, or insurance agent that the health professional or health care institution has determined and indicates in writing that the release of the health record information is detrimental to the physical or mental health of the person, or is likely to cause the individual to inflict self-harm or to harm another, the insurer, insurance agent, or insurance-support organization may provide that information directly to the individual only with the approval of the health professional with treatment responsibility for the condition to which the information relates. If approval is not obtained, the information must be provided to the health professional designated by the individual.\n(c) Nothing in this section may reduce or affect a patient's rights under sections 144.291 to 144.298.\nAn insurer, insurance agent, or insurance-support organization may charge a reasonable fee, not to exceed the actual costs, to copy information provided under this section. If an individual is requesting information as a result of an adverse underwriting decision, the insurer, insurance agent, or insurance-support organization must provide the information free of any charge.\nThe obligations imposed by this section upon an insurer or insurance agent may be satisfied by another insurer or insurance agent authorized to act on its behalf. With respect to the copying and disclosure of personal information under a request under subdivision 1, an insurer, insurance agent, or insurance-support organization may make arrangements with an insurance-support organization or a consumer reporting agency to copy and disclose personal information on its behalf.\nThe rights granted under this section and section 72A.498 do not extend to privileged information.",
	"repealed": false
}