{
	"id": "115C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.02",
	"title": "115C.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n[Repealed, 1995 c 254 art 1 s 97]\n\"Agency\" means the Pollution Control Agency.\n\"Applicant\" means a person eligible under section 115C.09 to receive reimbursement from the fund.\n\"Board\" means the Petroleum Tank Release Compensation Board.\n\"Corrective action\" means an action taken to minimize, eliminate, or clean up a release to protect the public health and welfare or the environment. Corrective action may include environmental covenants pursuant to chapter 114E, an affidavit required under section 116.48, subdivision 6, or similar notice of a release recorded with real property records.\n\"Commissioner\" means the commissioner of the Pollution Control Agency.\n\"Consultant\" means an individual, partnership, association, private corporation, or any other legal entity that actually performs consulting services. Consulting services include the rendering of professional opinion, advice, or analysis regarding a release.\n\"Contractor\" means an individual, partnership, association, private corporation, or any other legal entity that actually performs contractor services. Contractor services means products and services within a scope of work that can be defined by typical written plans and specifications including, but not limited to, excavation, treatment of contaminated soil and groundwater, soil borings and well installations, laboratory analysis, surveying, electrical work, plumbing, carpentry, and equipment.\n[Renumbered subd 1a]\n\"Fund\" means the petroleum tank release cleanup fund.\n\"Operator\" means a person in control of, or having responsibility for, the daily operation of a tank.\n\"Owner\" means a person who holds title to, controls, or possesses an interest in a tank. \"Owner\" does not include a person who holds an interest in a tank solely for financial security, unless through foreclosure or other related actions the holder of a security interest has taken possession of the tank and fails to take all necessary corrective action as a volunteer under section 115C.09. The state or an agency of the state is not an owner solely because it holds title to a tank or to real property where the tank is located in trust for taxing districts as a result of forfeiture of title for nonpayment of taxes.\n\"Person\" means an individual, partnership, association, public or private corporation, or other legal entity, including the United States government, an interstate commission or other body, the state, or any agency, board, bureau, office, department, or political subdivision of the state.\n\"Petroleum\" means:\n(1) liquid petroleum products as defined in section 296A.01;\n(2) new and used lubricating oils; and\n(3) new and used hydraulic oils used in lifts to raise motor vehicles or farm equipment and for servicing or repairing motor vehicles or farm equipment.\n\"Petroleum refinery\" means a facility engaged in producing gasoline, kerosene, distillate fuel oils, residual fuel oil, lubricants, or other products through distillation of petroleum or through redistillation, cracking, or reforming of unfinished petroleum derivatives. \"Petroleum refinery\" includes fluid catalytic cracking unit catalyst regenerators, fluid catalytic cracking unit incinerator-waste heat boilers, fuel gas combustion devices, and indirect heating equipment associated with the refinery.\n\"Political subdivision\" means a county, a town, or a statutory or home rule charter city.\n[Repealed, 1Sp2001 c 2 s 162]\n\"Release\" means a spilling, leaking, emitting, discharging, escaping, leaching, or disposing of petroleum from a tank into the environment whether occurring before or after June 4, 1987, but does not include discharges or designed venting allowed under agency rules.\n[Repealed, 1Sp2001 c 2 s 162]\n\"Responsible person\" means a person who is responsible for a release under section 115C.021.\n(a) \"Tank\" means any one or a combination of containers, vessels, and enclosures, including structures and appurtenances connected to them, that is, or has been, used to contain, dispense, or store petroleum.\n(b) \"Tank\" does not include:\n(1) mobile tanks, except for tanks in transport; or\n(2) pipeline facilities, including gathering lines, regulated under the Natural Gas Pipeline Safety Act of 1968, United States Code, title 49, chapter 24, or the Hazardous Liquid Pipeline Safety Act of 1979, United States Code, title 49, chapter 29.\n\"Tank facility\" means a contiguous area where tanks are located that are under the same ownership or control.\n\"Tank in transport\" means a liquid fuel cargo tank with a capacity of greater than 250 gallons used to deliver petroleum into storage tanks or dispense petroleum into mobile tanks.",
	"repealed": false
}