{
	"id": "273.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.11",
	"title": "273.11 VALUATION OF PROPERTY.",
	"text": "Except as provided in this section or section 273.17, subdivision 1, all property shall be valued at its market value. The market value as determined pursuant to this section shall be stated such that any amount under $100 is rounded up to $100 and any amount exceeding $100 shall be rounded to the nearest $100. In estimating and determining such value, the assessor shall not adopt a lower or different standard of value because the same is to serve as a basis of taxation, nor shall the assessor adopt as a criterion of value the price for which such property would sell at a forced sale, or in the aggregate with all the property in the town or district; but the assessor shall value each article or description of property by itself, and at such sum or price as the assessor believes the same to be fairly worth in money. The assessor shall take into account the effect on the market value of property of environmental factors in the vicinity of the property. In assessing any tract or lot of real property, the value of the land, exclusive of structures and improvements, shall be determined, and also the value of all structures and improvements thereon, and the aggregate value of the property, including all structures and improvements, excluding the value of crops growing upon cultivated land. In valuing real property upon which there is a mine or quarry, it shall be valued at such price as such property, including the mine or quarry, would sell for at a fair, voluntary sale, for cash, if the material being mined or quarried is not subject to taxation under section 298.015 and the mine or quarry is not exempt from the general property tax under section 298.25. In valuing real property which is vacant, platted property shall be assessed as provided in subdivisions 14a and 14c. All property, or the use thereof, which is taxable under section 272.01, subdivision 2, or 273.19, shall be valued at the market value of such property and not at the value of a leasehold estate in such property, or at some lesser value than its market value.\nMS 2012 [Repealed, 2013 c 143 art 17 s 18]\nMS 1978 [Repealed, 1979 c 303 art 2 s 38]\nMS 1974 [Repealed, 1975 c 437 art 8 s 10]\nMS 1974 [Repealed, 1976 c 345 s 3]\nNotwithstanding any other provision of law to the contrary, the limitation contained in subdivisions 1 and 1a shall also apply to the authority of the local board of review as provided in section 274.01, the county board of equalization as provided in section 274.13, the State Board of Equalization and the commissioner of revenue as provided in sections 270.11, subdivision 1, 270.12, 270C.92, and 270C.94.\nFor purposes of property taxation, the market value of real and personal property installed prior to January 1, 1984, which is a solar, wind, or agriculturally derived methane gas system used as a heating, cooling, or electric power source of a building or structure shall be excluded from the market value of that building or structure if the property is not used to provide energy for sale.\nFor purposes of property taxation, the market value of automatic fire-safety sprinkler systems installed in existing buildings after January 1, 1992, meeting the standards of the Minnesota Fire Code shall be excluded from the market value of (1) existing multifamily residential real estate containing four or more units and used or held for use by the owner or by the tenants or lessees of the owner as a residence and (2) existing real estate containing four or more contiguous residential units for use by customers of the owner, such as hotels, motels, and lodging houses and (3) existing office buildings or mixed use commercial-residential buildings, in which at least one story capable of occupancy is at least 75 feet above the ground. The market value exclusion under this section shall expire if the property is sold.\nMS 1983 Supp [Repealed, 1984 c 502 art 3 s 36]\nFor the purposes of this subdivision, the terms defined in this subdivision have the meanings given them.\nA \"limited equity cooperative\" is a corporation organized under chapter 308A, 308B, or 308C, which has as its primary purpose the provision of housing and related services to its members which meets one of the following criteria with respect to the income of its members: (1) a minimum of 75 percent of members must have incomes at or less than 90 percent of area median income, (2) a minimum of 40 percent of members must have incomes at or less than 60 percent of area median income, or (3) a minimum of 20 percent of members must have incomes at or less than 50 percent of area median income. For purposes of this clause, \"member income\" shall mean the income of a member existing at the time the member acquires cooperative membership, and median income shall mean the St. Paul-Minneapolis metropolitan area median income as determined by the United States Department of Housing and Urban Development. It must also meet the following requirements:\n(a) The articles of incorporation set the sale price of occupancy entitling cooperative shares or memberships at no more than a transfer value determined as provided in the articles. That value may not exceed the sum of the following:\n(1) the consideration paid for the membership or shares by the first occupant of the unit, as shown in the records of the corporation;\n(2) the fair market value, as shown in the records of the corporation, of any improvements to the real property that were installed at the sole expense of the member with the prior approval of the board of directors;\n(3) accumulated interest, or an inflation allowance not to exceed the greater of a ten percent annual noncompounded increase on the consideration paid for the membership or share by the first occupant of the unit, or the amount that would have been paid on that consideration if interest had been paid on it at the rate of the percentage increase in the revised Consumer Price Index for All Urban Consumers for the Minneapolis-St. Paul metropolitan area prepared by the United States Department of Labor, provided that the amount determined pursuant to this clause may not exceed $500 for each year or fraction of a year the membership or share was owned; plus\n(4) real property capital contributions shown in the records of the corporation to have been paid by the transferor member and previous holders of the same membership, or of separate memberships that had entitled occupancy to the unit of the member involved. These contributions include contributions to a corporate reserve account the use of which is restricted to real property improvements or acquisitions, contributions to the corporation which are used for real property improvements or acquisitions, and the amount of principal amortized by the corporation on its indebtedness due to the financing of real property acquisition or improvement or the averaging of principal paid by the corporation over the term of its real property-related indebtedness.\n(b) The articles of incorporation require that the board of directors limit the purchase price of stock or membership interests for new member-occupants or resident shareholders to an amount which does not exceed the transfer value for the membership or stock as defined in clause (a).\n(c) The articles of incorporation require that the total distribution out of capital to a member shall not exceed that transfer value.\n(d) The articles of incorporation require that upon liquidation of the corporation any assets remaining after retirement of corporate debts and distribution to members will be conveyed to a charitable organization described in section 501(c)(3) of the Internal Revenue Code or a public agency.\nA \"limited equity cooperative apartment\" is a dwelling unit owned by a limited equity cooperative.\n\"Occupancy entitling cooperative share or membership\" is the ownership interest in a cooperative organization which entitles the holder to an exclusive right to occupy a dwelling unit owned or leased by the cooperative.\nFor purposes of taxation, the assessor shall value a unit owned by a limited equity cooperative at the lesser of its market value or the value determined by capitalizing the net operating income of a comparable apartment operated on a rental basis at the capitalization rate used in valuing comparable buildings that are not limited equity cooperatives. If a cooperative fails to operate in accordance with the provisions of clauses (a) to (d), the property shall be subject to additional property taxes in the amount of the difference between the taxes determined in accordance with this subdivision for the last ten years that the property had been assessed pursuant to this subdivision and the amount that would have been paid if the provisions of this subdivision had not applied to it. The additional taxes, plus interest at the rate specified in section 549.09, shall be extended against the property on the tax list for the current year.\n[See Note.]\nNotwithstanding any other provision of law to the contrary, for purposes of property taxation, condominium property shall be valued in accordance with this subdivision.\n(a) A structure or building that is initially constructed as condominiums shall be identified as separate units after the filing of a declaration. The market value of the residential units in that structure or building and included in the declaration shall be valued as condominiums.\n(b) When 60 percent or more of the residential units in a structure or building being converted to condominiums have been sold as condominiums including those units that the converters retain for their own investment, the market value of the remaining residential units in that structure or building which are included in the declaration shall be valued as condominiums. If not all of the residential units in the structure or building are included in the declaration, the 60 percent factor shall apply to those in the declaration. A separate description shall be recognized when a declaration is filed. For purposes of this paragraph, \"retain\" shall mean units that are rented and completed units that are not available for sale.\n(c) For purposes of this subdivision, a \"sale\" is defined as the date when the first written document for the purchase or conveyance of the property is signed, unless that document is revoked.\nMS 1988 [Repealed, 1999 c 243 art 5 s 54]\nWetlands restored by the federal, state, or local government, or by a nonprofit organization, or preserved under the terms of a temporary or perpetual easement by the federal or state government, must be valued by assessors at their wetland value. \"Wetland value\" in this subdivision means the market value of wetlands in any potential use in which the wetland character is not permanently altered. Wetland value shall not reflect potential uses of the wetland that would violate the terms of any existing conservation easement, or any onetime payment received by the wetland owner under the terms of a state or federal conservation easement. Wetland value shall reflect any potential income consistent with a property's wetland character, including but not limited to lease payments for hunting or other recreational uses. The commissioner of revenue shall issue a bulletin advising assessors of the provisions of this section by October 1, 1991.\nFor purposes of this subdivision, \"wetlands\" means lands transitional between terrestrial and aquatic systems where the water table is usually at or near the surface or the land is covered by shallow water. For purposes of this definition, wetlands must have the following three attributes:\n(1) have a predominance of hydric soils;\n(2) are inundated or saturated by surface or ground water at a frequency and duration sufficient to support a prevalence of hydrophytic vegetation typically adapted for life in saturated soil conditions; and\n(3) under normal circumstances support a prevalence of such vegetation.\n(a) A community land trust, as defined under chapter 462A, is (i) a community-based nonprofit corporation organized under chapter 317A, which qualifies for tax exempt status under 501(c)(3), or (ii) a \"city\" as defined in section 462C.02, subdivision 6, which has received funding from the Minnesota housing finance agency for purposes of the community land trust program. The Minnesota Housing Finance Agency shall set the criteria for community land trusts.\n(b) Before the community land trust can rent or sell a unit to an applicant, the community land trust shall verify to the satisfaction of the administering agency or the city that the family income of each person or family applying for a unit in the community land trust building is within the income criteria provided in section 462A.30, subdivision 9. The administering agency or the city shall verify to the satisfaction of the county assessor that the occupant meets the income criteria under section 462A.30, subdivision 9. The property tax benefits under paragraph (c) shall be granted only to property owned or rented by persons or families within the qualifying income limits. The family income criteria and verification is only necessary at the time of initial occupancy in the property.\n(c) A unit which is owned by the occupant and used as a homestead by the occupant qualifies for homestead treatment as class 1a under section 273.13, subdivision 22, unless the unit meets the requirements of section 273.13, subdivision 25, paragraph (e), clause (2), in which case the unit shall be classified as 4d(2). A unit which is rented by the occupant and used as a homestead by the occupant shall be class 4a or 4b property, under section 273.13, subdivision 25, whichever is applicable. Any remaining portion of the property not used for residential purposes shall be classified by the assessor in the appropriate class based upon the use of that portion of the property owned by the community land trust. The land upon which the building is located shall be assessed at the same classification rate as the units within the building, provided that if the building contains some units assessed as class 1a or class 4d(2) and some units assessed as class 4a or 4b, the market value of the land will be assessed in the same proportions as the value of the building.\nOnly accredited assessors or senior accredited assessors or other licensed assessors who have successfully completed at least two income-producing property appraisal courses may value income-producing property for ad valorem tax purposes. \"Income-producing property\" as used in this subdivision means the taxable property in class 3a and 3b in section 273.13, subdivision 24; class 4a and 4c, except for seasonal recreational property not used for commercial purposes; and class 5 in section 273.13, subdivision 31. \"Income-producing property\" includes any property in class 4e in section 273.13, subdivision 25, that would be income-producing property under the definition in this subdivision if it were not substandard. \"Income-producing property appraisal course\" as used in this subdivision means a course of study of approximately 30 instructional hours, with a final comprehensive test. An assessor must successfully complete the final examination for each of the two required courses. The course must be approved by the board of assessors.\nMS 2006 [Repealed, 2008 c 366 art 6 s 52]\n(a) Except as provided in subdivision 14c, all land platted on or after August 1, 2001, located in a metropolitan county, and not improved with a permanent structure, shall be assessed as provided in this subdivision. The assessor shall determine the market value of each individual lot based upon the highest and best use of the property as unplatted land. In establishing the market value of the property, the assessor shall consider the sale price of the unplatted land or comparable sales of unplatted land of similar use and similar availability of public utilities.\n(b) The market value determined in paragraph (a) shall be increased as follows for each of the three assessment years immediately following the final approval of the plat: one-third of the difference between the property's unplatted market value as determined under paragraph (a) and the market value based upon the highest and best use of the land as platted property shall be added in each of the three subsequent assessment years.\n(c) Any increase in market value after the first assessment year following the plat's final approval shall be added to the property's market value in the next assessment year. Notwithstanding paragraph (b), if the property is sold or transferred, or construction begins before the expiration of the three years in paragraph (b), that lot shall be eligible for revaluation in the next assessment year. The market value of a platted lot determined under this subdivision shall not exceed the value of that lot based upon the highest and best use of the property as platted land.\n(d) For purposes of this section, \"metropolitan county\" means the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington.\n(a) All land platted on or after August 1, 2001, located in a nonmetropolitan county, and not improved with a permanent structure, shall be assessed as provided in this subdivision. The assessor shall determine the market value of each individual lot based upon the highest and best use of the property as unplatted land. In establishing the market value of the property, the assessor shall consider the sale price of the unplatted land or comparable sales of unplatted land of similar use and similar availability of public utilities.\n(b) The market value determined in paragraph (a) shall be increased as follows for each of the seven assessment years immediately following the final approval of the plat: one-seventh of the difference between the property's unplatted market value as determined under paragraph (a) and the market value based upon the highest and best use of the land as platted property shall be added in each of the seven subsequent assessment years.\n(c) Any increase in market value after the first assessment year following the plat's final approval shall be added to the property's market value in the next assessment year. Notwithstanding paragraph (b), if the property is sold or transferred, or construction begins before the expiration of the seven years in paragraph (b), that lot shall be eligible for revaluation in the next assessment year. The market value of a platted lot determined under this subdivision shall not exceed the value of that lot based upon the highest and best use of the property as platted land.\n(a) All land platted on or after August 1, 2001, located in a metropolitan county and not improved with a structure shall be eligible for the phase-in assessment schedule under this subdivision, provided the property (i) is classified homestead under section 273.13, subdivision 22 or 23, in the assessment year prior to the year the initial platting begins on the property; (ii) has been owned or part-owned by the same person for the ten consecutive years prior to the initial platting; and (iii) remains under the same ownership in the current assessment year.\n(b) Based upon the assessor's records, the assessor shall obtain the estimated market value of each individual lot based upon the highest and best use of the property as unplatted land for the assessment year that the property was platted. In establishing the market value of the property, the assessor shall have considered the sale price of the unplatted land or comparable sales of unplatted land of similar use and similar availability of public utilities.\n(c) To the market value determined in paragraph (b) shall be added one-seventh of the difference between the property's unplatted market value as determined under paragraph (b) and the market value based upon the highest and best use of the land as platted property in the current year, multiplied by the number of assessment years since the property was platted, in each of the subsequent assessment years.\n(d) Notwithstanding paragraph (c), if the property is sold or transferred, or construction begins before the expiration of the phase-in in paragraph (c), that lot shall be eligible for revaluation in the next assessment year. The market value of a platted lot determined under this subdivision shall not exceed the value of that lot based upon the highest and best use of the property as platted land.\n(e) Any owner of eligible property platted before July 1, 2008, must file an application with the assessor in order to receive the phase-in under this subdivision for the remainder of the seven-year period. The application must be filed before July 1 in order for the property to be eligible for the current year's assessment. The commissioner shall prescribe a uniform application form and instructions.\n(f) For purposes of this section, \"metropolitan county\" means the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington.\nIn valuing a hospital, as defined in section 144.50, subdivision 2, that is located outside of a metropolitan county, as defined in section 473.121, subdivision 4, and that on the date of sale is vacant and not used for hospital purposes or for any other purpose, the assessor's estimated market value for taxes levied in the year of the sale shall be no greater than the sales price of the property, including both the land and the buildings, as adjusted for terms of financing. If the sale is made later than December 15, the market value as determined under this subdivision shall be used for taxes levied in the following year. This subdivision applies only if the sales price of the property was determined under an arm's-length transaction.\nMS 2022 [Repealed, 2024 c 85 s 115]\n(a) In determining the market value of property containing contaminants, the assessor shall reduce the market value of the property by the contamination value of the property. The contamination value is the amount of the market value reduction that results from the presence of the contaminants, but it may not exceed the cost of a reasonable response action plan or asbestos abatement plan or management program for the property.\n(b) For purposes of this subdivision, \"asbestos abatement plan,\" \"contaminants,\" and \"response action plan\" have the meanings as used in sections 270.91 and 270.92.\nNo seller of real property shall sell or offer for sale property that, for purposes of property taxation, has an exclusion from market value for home improvements under subdivision 16, without disclosing to the buyer the existence of the excluded valuation and informing the buyer that the exclusion will end upon the sale of the property and that the property's estimated market value for property tax purposes will increase accordingly.\nProperty classified under section 273.13, subdivision 24, which is eligible for the preferred classification rate on the market value up to $150,000, shall qualify for a valuation exclusion for assessment purposes, provided all of the following conditions are met:\n(1) the building must be at least 50 years old at the time of the improvement or damaged by the 1997 floods;\n(2) the building must be located in a city or town with a population of 10,000 or less that is located outside the seven-county metropolitan area, as defined in section 473.121, subdivision 2;\n(3) the total estimated market value of the land and buildings must be $100,000 or less prior to the improvement and prior to the damage caused by the 1997 floods;\n(4) the current year's estimated market value of the property must be equal to or less than the property's estimated market value in each of the two previous years' assessments;\n(5) a building permit must have been issued prior to the commencement of the improvement, or if the building is located in a city or town which does not have a building permit process, the property owner must notify the assessor prior to the commencement of the improvement;\n(6) the property, including its improvements, has received no public assistance, grants or financing except, that in the case of property damaged by the 1997 floods, the property is eligible to the extent that the flood losses are not reimbursed by insurance or any public assistance, grants, or financing;\n(7) the property is not receiving a property tax abatement under section 469.1813; and\n(8) the improvements are made after the effective date of Laws 1997, chapter 231, and prior to January 1, 1999.\nThe assessor shall estimate the market value of the building in the assessment year immediately following the year that (1) the building permit was taken out, or (2) the taxpayer notified the assessor that an improvement was to be made. If the estimated market value of the building has increased over the prior year's assessment, the assessor shall note the amount of the increase on the property's record, and that amount shall be subtracted from the value of the property in each year for five years after the improvement has been made, at which time an amount equal to 20 percent of the excluded value shall be added back in each of the five subsequent assessment years.\nFor any property, there can be no more than two improvements qualifying for exclusion under this subdivision. The maximum amount of value that can be excluded from any property under this subdivision is $50,000.\nThe assessor shall require an application, including documentation of the age of the building from the owner, if unknown by the assessor. Applications must be received prior to July 1 of any year in order to be effective for taxes payable in the following year.\nFor purposes of this subdivision, \"population\" has the same meaning given in section 477A.011, subdivision 3.\nProperty classified under section 273.13, subdivision 24, qualifies for a valuation exclusion for assessment purposes, provided all of the following conditions are met:\n(1) the building must have been damaged by the 2002 floods;\n(2) the building must be located in a city or town with a population of 10,000 or less that is located in a county in the area included in DR-1419;\n(3) the total estimated market value of the land and buildings must be $150,000 or less for assessment year 2002;\n(4) a building permit must have been issued prior to the commencement of the improvement, or if the building is located in a city or town which does not have a building permit process, the property owner must notify the assessor prior to the commencement of the improvement;\n(5) the property is not receiving a property tax abatement under section 469.1813; and\n(6) the improvements are made before January 1, 2004.\nThe assessor shall estimate the market value of the building in the assessment year immediately following the year that (1) the building permit was taken out, or (2) the taxpayer notified the assessor that an improvement was to be made. If the estimated market value of the building has increased over the 2002 assessment before any reassessment due to flood damage, the assessor shall note the amount of the increase on the property's record, and that amount shall be subtracted from the value of the property in each year for five years after the improvement has been made. In each of the next five subsequent assessment years, an amount equal to 20 percent of the value excluded in the fifth year for that improvement shall be added back.\nThe maximum amount of value that can be excluded for all improvements to any property under this subdivision is $50,000.\nThe assessor shall require an application. Applications must be received by December 31, 2002, or December 31, 2003, in order to be effective for taxes payable in the following year.\nFor purposes of this subdivision, \"population\" has the meaning given in section 477A.011, subdivision 3.\n(a) The owner of homestead property may apply in writing to the assessor for a reduction in the market value of the property that has been damaged by mold. The notification must include the estimated cost to cure the mold condition provided by a licensed contractor. The estimated cost must be at least $20,000. Upon completion of the work, the owner must file an application on a form prescribed by the commissioner of revenue, accompanied by a copy of the contractor's estimate.\n(b) If the conditions in paragraph (a) are met, the county board must grant a reduction in the market value of the homestead dwelling equal to the estimated cost to cure the mold condition. If a property owner applies for a reduction under this subdivision between January 1 and June 30 of any year, the reduction applies for taxes payable in the following year. If a property owner applies for a reduction under this subdivision between July 1 and December 31 of any year, the reduction applies for taxes payable in the second following year.\n(c) A denial of a reduction under this section by the county board may be appealed to the Tax Court. If the county board takes no action on the application within 90 days after its receipt, it is considered an approval.\n(d) For purposes of subdivision 1a, in the assessment year following the assessment year when a valuation reduction has occurred under this section, any market value added by the assessor to the property resulting from curing the mold condition must be considered an increase in value due to new construction.\nMS 2012 [Repealed, 2013 c 143 art 17 s 18]\n(a) The commissioner of revenue shall annually certify the first tier limit for agricultural homestead property. For assessment year 2024, the limit is $3,500,000. Beginning with assessment year 2025, the limit is the product of (i) the first tier limit for the preceding assessment year, and (ii) the ratio of the statewide average taxable market value of agricultural property per acre of deeded farm land in the preceding assessment year to the statewide average taxable market value of agricultural property per acre of deeded farm land for the second preceding assessment year. The limit shall be rounded to the nearest $10,000.\n(b) For the purposes of this subdivision, \"agricultural property\" means all class 2a property under section 273.13, subdivision 23, except for property consisting of the house, garage, and immediately surrounding one acre of land of an agricultural homestead.\n(c) The commissioner shall certify the limit by January 2 of each assessment year.",
	"repealed": false
}