{
	"id": "515B.4-1152",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.4-1152",
	"title": "515B.4-1152 STATUTE OF LIMITATIONS FOR WARRANTIES; CIC CREATED ON OR AFTER AUGUST 1, 2011.",
	"text": "(a) A judicial proceeding for breach of an obligation arising under section 515B.4-101(e) or 515B.4-106(d) shall be commenced within 12 months after the conveyance of the unit or other parcel of real estate.\n(b) A judicial proceeding for breach of an obligation arising under section 515B.4-112 or 515B.4-113 shall be commenced within six years after the cause of action accrues, but the parties may agree to reduce the period of limitation to not less than two years. An agreement reducing the period of limitation signed by one purchaser of a unit shall be binding on any copurchasers of the unit. If an agreement reducing the period of limitations is recorded in compliance with applicable law, the agreement is binding on the purchaser's and copurchaser's successors in title to the unit. With respect to a unit that may be occupied for residential use, an agreement to reduce the period of limitation must be evidenced by an instrument separate from the purchase agreement signed by a purchaser of the unit.\n(c) Subject to subsection (d), a cause of action under section 515B.4-112 or 515B.4-113, regardless of the purchaser's lack of knowledge of the breach, accrues:\n(1) as to a unit, at the earlier of the time of conveyance of any interest in the unit by a declarant to a bona fide purchaser, other than an affiliate of a declarant, or the time a purchaser enters into possession of the unit. As to a unit subject to time shares, a cause of action accrues upon the earlier of the conveyance of the unit or the conveyance of the first time share interest in the unit to a purchaser; and\n(2) as to each common element, the latest of (i) the time the common element is completed; (ii) the time the first interest in a unit in the common interest community is conveyed to a bona fide purchaser, or, if the common element is located on property that was additional real estate, at the time the first interest in a unit created thereon is conveyed to a bona fide purchaser; or (iii) the termination of the period of declarant control.\n(d) If a warranty explicitly extends to future performance or duration of any improvement or component of the common interest community, the cause of action accrues at the time the breach is discovered or at the end of the period for which the warranty explicitly extends, whichever is earlier.\n(e) This section applies only to common interest communities created on or after August 1, 2011.",
	"repealed": false
}