{
	"id": "142D.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.22",
	"title": "142D.22 SHARED SERVICES GRANTS.",
	"text": "The commissioner of children, youth, and families shall establish a grant program to award money to public entities and private for-profit and nonprofit organizations for planning, establishment, expansion, improvement, or operation of shared services alliances.\nFor purposes of this section, \"shared services alliances\" are networks of eligible entities that share services to reduce costs and achieve efficiencies. \"Eligible entities\" are:\n(1) family and group family child care homes licensed under Minnesota Rules, chapter 9502;\n(2) Tribally licensed family child care programs; and\n(3) individuals in the process of starting a family or group family child care home.\nGrantees must use money received under this section to deliver one or more of the following services:\n(1) pooling management of payroll and benefits, banking, janitorial services, food services, and other operations;\n(2) shared administrative staff for tasks such as record keeping and complying with reporting requirements for programs, including but not limited to the child care assistance program, Head Start, the child and adult care food program, and early learning scholarships;\n(3) coordination of bulk purchasing;\n(4) management of a substitute pool;\n(5) support for implementing shared curriculum and assessments;\n(6) mentoring of child care providers to improve business practices;\n(7) provision of and training in child care management software to simplify processes such as enrollment, billing, and tracking expenditures;\n(8) support for a group of providers sharing one or more physical spaces within a larger building; or\n(9) other services as determined by the commissioner.\n(a) The commissioner must develop a process to award grants under this section that includes application forms, timelines, and standards for renewals.\n(b) The commissioner must develop a process by which grantees will report to the department on how grant money was spent.",
	"repealed": false
}