{
	"id": "103E.711",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.711",
	"title": "103E.711 COST APPORTIONMENT FOR JOINT COUNTY DRAINAGE SYSTEMS.",
	"text": "For a joint county drainage system the auditor of a county that has made repairs may present a repair cost statement at the end of each year, or other convenient period after completion, to each affected county. The repair cost statement must show the nature and cost of the repairs to the drainage system and must be based on the original apportionment of cost following the establishment of the drainage system. If a board approves the repair costs, the amount of the statement must be paid to the county submitting the statement.\n(a) If a county does not pay the amount of the repair cost statement, the board of an affected county may petition the joint county drainage authority. The petition must:\n(1) show the nature and necessity of the repairs made to the drainage system in the county during the period;\n(2) show the cost of the repairs; and\n(3) request the drainage authority to apportion the costs, by order, among the affected counties.\n(b) When the petition is filed, the drainage authority shall, by order, set a time and location for a hearing to apportion the costs, and direct the auditor to give notice of the hearing to each affected county by publication and notice by mail to its auditor. At or before the hearing, the auditor of each affected county, except the petitioner, shall file with the drainage authority a statement showing:\n(1) all repairs made to the drainage system in that county, not previously reimbursed;\n(2) the nature and necessity of the repairs; and\n(3) the cost of the repairs.\n(c) The drainage authority has jurisdiction over the affected counties and shall hear all interested parties. The drainage authority shall determine which repairs were necessary and reasonable and proper costs. For the allowed repairs the drainage authority shall balance the accounts among the affected counties, by charging each county with its proportionate share of the cost of all repairs made and crediting each county with the amount paid for the repairs. The drainage authority shall order a just reimbursement among the affected counties. A certified copy of the order must be filed by the auditor with the auditors of affected counties, and the boards shall make the required reimbursement.",
	"repealed": false
}