{
	"id": "115B.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.28",
	"title": "115B.28 POWERS AND DUTIES OF AGENCY.",
	"text": "In addition to performing duties specified in sections 115B.25 to 115B.37 or in other law, and subject to the limitations on disclosure contained in section 115B.35, the agency shall:\n(1) adopt rules, including rules governing practice and procedure before the agency, the form and procedure for applications for compensation, and procedures for claims investigations;\n(2) publicize the availability of compensation and application procedures on a statewide basis with special emphasis on geographical areas surrounding sites identified by the agency as having releases from a facility where a harmful substance was placed or came to be located prior to July 1, 1983;\n(3) collect, analyze, and make available to the public, in consultation with the Department of Health, the Pollution Control Agency, the University of Minnesota Medical and Public Health Schools, and the medical community, data regarding injuries relating to exposure to harmful substances; and\n(4) prepare and transmit the legislative report required under section 115B.20, subdivision 6, to include (i) a summary of agency activity under clause (3); (ii) data determined by the agency from actual cases, including but not limited to number of cases, actual compensation received by each claimant, types of cases, and types of injuries compensated, as they relate to types of harmful substances as well as length of exposure, but excluding identification of the claimants; (iii) all administrative costs associated with the business of the agency; and (iv) agency recommendations for legislative changes, further study, or any other recommendation aimed at improving the system of compensation.\nIn addition to exercising any powers specified in sections 115B.25 to 115B.37 or in other law, the agency may:\n(1) in reviewing a claim, consider any information relevant to the claim, in accordance with the evidentiary standards contained in section 115B.35;\n(2) contract for consultant or other services necessary to carry out the agency's duties under sections 115B.25 to 115B.37;\n(3) grant reasonable partial compensation on an emergency basis pending the final decision on a claim if the claim is one with respect to which an award will probably be made and undue hardship will result to the claimant if immediate payment is not made;\n(4) limit access to information collected and maintained by the agency and take any other action necessary to protect not public data as defined in section 13.02, subdivision 8a, and protected information, in accordance with the limitations contained in section 115B.35.\n(a) The agency may investigate any claim for compensation and for this purpose it may require from the claimant and request from any person information regarding any matter, fact, or circumstance which is relevant to determination of a claim under section 115B.33. In exercising its powers under this subdivision, the agency may collect information reasonably calculated to lead to the discovery of evidence admissible under section 115B.35. The agency shall reimburse the person requested to provide information the actual cost of copies of documents, papers, samples, or other tangible items necessary to respond to the request from the agency. In order to obtain this information the agency, subject to any applicable privilege, may:\n(1) request any person to produce documents, papers, books, or other tangible things in the possession, custody, or control of that person;\n(2) request the sworn testimony of any person as to any relevant fact or opinion;\n(3) direct written questions to any person and request written answers and objections;\n(4) request a mental or physical examination of the claimant or autopsy of any deceased person whose death is the basis of the claim, provided that notice is given to the claimant and the claimant receives a copy of the report; and\n(5) request a waiver of medical privilege by the claimant.\n(b) The agency shall give written notice of any request under this subdivision at least 15 days before the person is expected to comply with the request. If a person fails or refuses to comply with a request for information relevant to the release of a harmful substance, the agency may issue a subpoena for the production of the information and may petition the district court for an order enforcing the subpoena. If a person fails or refuses to comply with a request for other information relevant to determination of the claim, the agency may petition the district court for an order to compel compliance with the request. If the claimant refuses to comply with a request by the agency for information relevant to the claim, the agency may dismiss the claim.\nIn order to perform its duties, the agency may request information from the supervising officer of any state agency or state institution of higher education. When requesting health data as defined in section 13.3805, subdivision 1, or sections 144.671 to 144.69, the agency must submit a written release signed by the subject of the data or, if the subject is deceased, a representative of the deceased, authorizing release of the data in whole or in part. The supervising officer shall comply with the agency's request to the extent possible considering available agency or institution appropriations and may assign agency or institution employees to assist the agency in performing its duties under sections 115B.25 to 115B.37.",
	"repealed": false
}