{
	"id": "268B.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.145",
	"title": "268B.145 INCOME TAX WITHHOLDING AND STATE TAXATION.",
	"text": "If the Internal Revenue Service determines that benefits received under this chapter are subject to federal income tax, the applicant may elect to have federal income tax deducted and withheld from the applicant's benefits.\nBenefits received under this chapter are subject to state income tax. If the applicant elects to have federal income tax withheld, the applicant may, in addition, elect to have Minnesota state income tax withheld.\nUpon filing an application for benefits, the applicant must be informed that:\n(1) benefits are subject to federal and state income tax;\n(2) there are requirements for filing estimated tax payments;\n(3) the applicant may elect to have federal income tax withheld from benefits;\n(4) if the applicant elects to have federal income tax withheld, the applicant may, in addition, elect to have Minnesota state income tax withheld; and\n(5) at any time during the benefit year the applicant may change a prior election.\nIf an applicant elects to have federal income tax withheld, the commissioner must deduct ten percent for federal income tax. If an applicant also elects to have Minnesota state income tax withheld, the commissioner must make an additional five percent deduction for state income tax. Any amount deducted under section 268B.06 has priority over any amounts deducted under this section. Federal income tax withholding has priority over state income tax withholding. An election to have income tax withheld may not be retroactive and only applies to benefits paid after the election.\nThe amount of any benefits deducted under this section remains in the family and medical benefit insurance account until transferred to the Internal Revenue Service, or the Department of Revenue, as an income tax payment on behalf of the applicant.\nAny error that resulted in underwithholding or overwithholding under this section must not be corrected retroactively.\nAny amount deducted under this section is considered as benefits paid to the applicant.",
	"repealed": false
}