{
	"id": "121A.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.34",
	"title": "121A.34 SCHOOL SAFETY PATROLS.",
	"text": "In the exercise of authorized control and supervision over pupils attending schools and other educational institutions, both public and private, the governing board or other directing authority of any such school or institution is empowered to authorize the organization and supervision of school safety patrols for the purpose of influencing and encouraging other pupils to refrain from crossing public highways at points other than regular crossings and for the purpose of directing pupils when and where to cross highways.\nUnless the parents or guardian of a pupil object in writing to the school authorities to the appointment of the pupil on a school safety patrol, it is lawful for any pupil over nine years of age to be appointed and designated as a member of the patrol in any school in which there are no pupils who have attained such age, any pupil in the highest grade therein may be so appointed and designated. School authorities may also appoint and designate nonpupil adults as members of a school safety patrol on a voluntary or for-hire basis.\nNo liability shall attach either to the school, educational institution, governing board, directing authority, or any individual director, board member, superintendent, principal, teacher, or other school authority by virtue of the organization, maintenance, or operation of such a school safety patrol because of injuries sustained by any pupil, whether a member of the patrol or otherwise by reason of the operation and maintenance of the patrol.\nIdentification and operation of school safety patrols shall be uniform throughout the state and the method of identification and signals to be used shall be as prescribed by the commissioner of public safety. School safety patrol members may wear fluorescent reflective vests.\nNotwithstanding Minnesota Rules, part 7415.0300, vests, sashes, ponchos, and Sam Browne belts worn by school safety patrol members may be fluorescent yellow, fluorescent yellow-green, or blaze orange.\nNotwithstanding any rule of the commissioner of public safety, school safety patrol flags may be (1) blaze orange with a yellow octagon bearing the word \"Stop\" in black letters, or (2) fluorescent yellow or fluorescent yellow-green with an octagon of sharply contrasting color bearing the word \"Stop\" in black letters.",
	"repealed": false
}