{
	"id": "246.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.54",
	"title": "246.54 LIABILITY OF COUNTY; REIMBURSEMENT.",
	"text": "Except for substance use disorder services provided under sections 254B.01 to 254B.09, the client's county shall pay to the state of Minnesota a portion of the cost of care provided in a regional treatment center or a state nursing facility to a client for which the county is the county of financial responsibility under section 256B.02. A county must pay from the county's own sources of revenue. Payments must equal a percentage of the cost of care, as determined by the executive board, for each day, or the portion thereof, that the client spends at a regional treatment center or a state nursing facility.\n(a) A county's payment of the cost of care provided at Anoka-Metro Regional Treatment Center shall be according to the following schedule:\n(1) zero percent for the first 30 days;\n(2) 20 percent for days 31 and over if the stay is determined to be clinically appropriate for the client; and\n(3) 100 percent for each day during the stay, including the day of admission, when the facility determines that it is clinically appropriate for the client to be discharged.\n(b) If payments received by the state under sections 246.50 to 246.53 exceed 80 percent of the cost of care for days over 31 for clients who meet the criteria in paragraph (a), clause (2), the county shall be responsible for paying the state only the remaining amount. The county shall not be entitled to reimbursement from the client, the client's estate, or from the client's relatives, except as provided in section 246.53.\n(c) Between July 1, 2023, and March 31, 2025, the county is not responsible for the cost of care under paragraph (a), clause (3), for a person who is committed as a person who has a mental illness and is dangerous to the public under section 253B.18 and who is awaiting transfer to another state-operated facility or program. This paragraph expires March 31, 2025.\n(d) Between April 1, 2025, and June 30, 2025, the county is not responsible for the cost of care under paragraph (a), clause (3), for a person who is civilly committed, if the client is awaiting transfer:\n(1) to a facility operated by the Department of Corrections; or\n(2) to another state-operated facility or program, and the Direct Care and Treatment executive medical director's office or a designee has determined that:\n(i) the client meets criteria for admission to that state-operated facility or program; and\n(ii) the state-operated facility or program is the only facility or program that can reasonably serve the client. This paragraph expires June 30, 2025.\n(e) Notwithstanding any law to the contrary, the client is not responsible for payment of the cost of care under this subdivision.\n(a) A county's payment of the cost of care provided at state-operated community-based behavioral health hospitals for adults and children shall be according to the following schedule:\n(1) 100 percent for each day during the stay, including the day of admission, when the facility determines that it is clinically appropriate for the client to be discharged; and\n(2) the county shall not be entitled to reimbursement from the client, the client's estate, or from the client's relatives, except as provided in section 246.53.\n(b) Between July 1, 2023, and March 31, 2025, the county is not responsible for the cost of care under paragraph (a), clause (1), for a person committed as a person who has a mental illness and is dangerous to the public under section 253B.18 and who is awaiting transfer to another state-operated facility or program. This paragraph expires March 31, 2025.\n(c) Between April 1, 2025, and June 30, 2025, the county is not responsible for the cost of care under paragraph (a), clause (1), for a person who is civilly committed, if the client is awaiting transfer:\n(1) to a facility operated by the Department of Corrections; or\n(2) to another state-operated facility or program, and the Direct Care and Treatment executive medical director's office or a designee has determined that:\n(i) the client meets criteria for admission to that state-operated facility or program; and\n(ii) the state-operated facility or program is the only facility or program that can reasonably serve the client. This paragraph expires June 30, 2025.\n(d) Notwithstanding any law to the contrary, the client is not responsible for payment of the cost of care under this subdivision.\nA county's payment of the cost of care provided at state-operated forensic services shall be according to the following schedule:\n(1) Minnesota Security Hospital: ten percent for each day, or portion thereof, that the client spends in a Minnesota Security Hospital program. If payments received by the state under sections 246.50 to 246.53 for services provided at the Minnesota Security Hospital exceed 90 percent of the cost of care, the county shall be responsible for paying the state only the remaining amount. The county shall not be entitled to reimbursement from the client, the client's estate, or the client's relatives except as provided in section 246.53;\n(2) forensic nursing home: ten percent for each day, or portion thereof, that the client spends in a forensic nursing home program. If payments received by the state under sections 246.50 to 246.53 for services provided at the forensic nursing home exceed 90 percent of the cost of care, the county shall be responsible for paying the state only the remaining amount. The county shall not be entitled to reimbursement from the client, the client's estate, or the client's relatives except as provided in section 246.53;\n(3) forensic transition services: 50 percent for each day, or portion thereof, that the client spends in the forensic transition services program. If payments received by the state under sections 246.50 to 246.53 for services provided in the forensic transition services exceed 50 percent of the cost of care, the county shall be responsible for paying the state only the remaining amount. The county shall not be entitled to reimbursement from the client, the client's estate, or the client's relatives except as provided in section 246.53; and\n(4) residential competency restoration program:\n(i) 20 percent for each day, or portion thereof, that the client spends in a residential competency restoration program while the client is in need of restoration services;\n(ii) 50 percent for each day, or portion thereof, that the client spends in a residential competency restoration program once the examiner determines that the client no longer needs restoration services; and\n(iii) 100 percent for each day, or portion thereof, once charges against a client have been resolved or dropped.\nRegardless of the facility to which the client is committed, subdivisions 1, 1a, 1b, and 1c, do not apply to the following individuals:\n(1) clients who are committed as sexual psychopathic personalities under section 253D.02, subdivision 15; and\n(2) clients who are committed as sexually dangerous persons under section 253D.02, subdivision 16.\n(a) The county of financial responsibility may submit a written request for administrative review by the executive board of the county's payment of the cost of care when a delay in discharge of a client from a regional treatment center, state-operated community-based behavioral health hospital, or other state-operated facility results from the following actions by the facility:\n(1) the facility did not provide notice to the county that the facility has determined that it is clinically appropriate for a client to be discharged;\n(2) the notice to the county that the facility has determined that it is clinically appropriate for a client to be discharged was communicated on a holiday or weekend;\n(3) the required documentation or procedures for discharge were not completed in order for the discharge to occur in a timely manner; or\n(4) the facility disagrees with the county's discharge plan.\n(b) The county of financial responsibility may not appeal the determination that it is clinically appropriate for a client to be discharged from a regional treatment center, state-operated community-based behavioral health hospital, or other state-operated facility.\n(c) The executive board must evaluate the request for administrative review and determine if the facility's actions listed in paragraph (a) caused undue delay in discharging the client. If the executive board determines that the facility's actions listed in paragraph (a) caused undue delay in discharging the client, the county's liability must be reduced to the level of the cost of care for a client whose stay in a facility is determined to be clinically appropriate, effective on the date of the facility's action or failure to act that caused the delay. The executive board's determination under this subdivision is final and not subject to appeal.\n(d) If a county's liability is reduced pursuant to paragraph (c), a county's liability must return to the level of the cost of care for a client whose stay in a facility is determined to no longer be appropriate effective on the date the facility rectifies the action or failure to act that caused the delay under paragraph (a).\n(e) Any difference in the county cost of care liability resulting from administrative review under this subdivision must not be billed to the client or applied to future reimbursement from the client's estate or relatives.",
	"repealed": false
}