{
	"id": "60L.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/60L.14",
	"title": "60L.14 COMMISSIONER'S ORDERS.",
	"text": "If the commissioner determines that an insurer's investment practices do not meet the requirements of sections 60L.01 to 60L.15, the commissioner may, after notification to the insurer of the commissioner's findings, order the insurer to make changes necessary to comply with the requirements of sections 60L.01 to 60L.15.\nIf the commissioner determines that by reason of the financial condition, current investment practice, or current investment plan of an insurer, the interests of insureds, creditors, or the general public are or may be endangered, the commissioner may impose reasonable additional restrictions upon the admissibility or valuation of investments or may impose restrictions on the investment practices of an insurer, including prohibition, divestment, or requiring investments by insurers to be governed by section 60A.11 in the case of insurers other than life insurers, and sections 61A.28; 61A.282, subdivision 2; 61A.283; 61A.29; 61A.31; and 61A.315 in the case of life insurers.\nThe commissioner may count toward satisfaction of the minimum asset requirement any assets in which an insurer is required to invest under the laws of a country other than the United States as a condition for doing business in that country if the commissioner finds that counting them does not endanger the interests of insureds, creditors, or the general public.\nIf the commissioner is satisfied by evidence of the solidity of an insurer and the competence of management and its investment advisors, the commissioner, after a hearing, may by order adjust the class limitations under section 60L.08, for that insurer, to the extent that the commissioner is satisfied that the interests of insureds, creditors, and the public are sufficiently protected in other ways. Adjustments to the class limitations granted under section 60L.08, in aggregate, are limited to an amount equal to ten percent of the insurer's liabilities.",
	"repealed": false
}