{
	"id": "103B.551",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.551",
	"title": "103B.551 BOARD OF DIRECTORS.",
	"text": "After a lake improvement district is established, the county board, joint county authority, or commissioner that established the district shall appoint persons to serve as an initial board of directors for the district. Subsequent board members must be elected by persons owning property in the district at the annual meeting of the district. The number, qualifications, terms of office, and method of election, removal, and filling of vacancies of directors shall be as provided in the order creating the board of directors. The initial and all subsequent boards of directors must include persons owning property within the district, and a majority of the directors must be residents of the district.\nThe directors shall serve with compensation as determined by the property owners at the annual meeting and may be reimbursed for their actual expenses necessarily incurred in the performance of their duties in the manner provided for county employees.\nCounty boards, joint county authorities, statutory and home rule cities, and towns may, by order, delegate the powers in this section to the board of directors of a district to be exercised within the district. Programs and services undertaken must be consistent with the statewide water and related land resources plan prepared by the commissioner of natural resources and with regional water and related land resources plans. A body of water may not be improved by using authority granted under this section unless the public has access to some portion of the shoreline. County boards, joint county authorities, statutory and home rule cities, and towns may delegate their authority to a district board of directors to:\n(1) acquire by gift or purchase an existing dam or control works that affects the level of waters in the district;\n(2) construct and operate water control structures that are approved by the commissioner of natural resources under section 103G.245;\n(3) undertake projects to change the course current or cross section of public waters that are approved by the commissioner of natural resources under section 103G.245;\n(4) acquire property, equipment, or other facilities, by gift or purchase to improve navigation;\n(5) contract with a board of managers of a watershed district within the lake improvement district or the board of supervisors of a soil and water conservation district within the district for improvements under chapters 103C and 103D;\n(6) undertake research to determine the condition and development of the body of water and the water entering it and to transmit the results of the studies to the Pollution Control Agency and other interested authorities;\n(7) develop and implement a comprehensive plan to eliminate water pollution;\n(8) conduct a program of water improvement and conservation;\n(9) construct a water, sewer, or water and sewer system in the manner provided by section 444.075 or other applicable laws;\n(10) receive financial assistance from and participate in projects or enter into contracts with federal and state agencies for the study and treatment of pollution problems and related demonstration programs;\n(11) make cooperative agreements with the United States or state government or other counties or cities to effectuate water and related land resource programs;\n(12) maintain public beaches, public docks, and other public facilities for access to the body of water;\n(13) provide and finance a government service of the county or statutory or home rule city that is not provided throughout the county or, if the government service is provided, the service is at an increased level within the district; and\n(14) regulate water surface use as provided in sections 86B.205, 103G.605, and 103G.621.",
	"repealed": false
}