{
	"id": "126C.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.48",
	"title": "126C.48 LEVY PROCEDURE.",
	"text": "(a) By September 8, the commissioner shall notify the school districts of their levy limits. The commissioner shall certify to the county auditors the levy limits for all districts headquartered in the respective counties together with adjustments for errors in levies not penalized pursuant to subdivision 3, as well as adjustments to final pupil unit counts. A district may require the commissioner to review the certification and to present evidence in support of modification of the certification.\nThe county auditor shall reduce levies for any excess of levies over levy limitations pursuant to section 275.16. Such reduction in excess levies may, at the discretion of the school district, be spread over two calendar years.\n(b) As part of the commissioner's certification under paragraph (a), the commissioner shall certify the amount by which a district's levy for its general fund was reduced under subdivision 8.\nBy October 7 of each year each district must notify the commissioner of the proposed levies in compliance with the levy limitations of this chapter and chapters 120B, 122A, 123A, 123B, 124D, 125A, 127A, and 136D. A school district that has reached an agreement with its home county auditor to extend the date of certification of its proposed levy under section 275.065, subdivision 1, must submit its notice of proposed levies to the commissioner no later than October 10 of each year. By January 7 of each year each district must notify the commissioner of the final levies certified. The commissioner shall prescribe the form of these notifications and may request any additional information necessary to compute certified levy amounts.\nIf any district levy is found to be excessive as a result of a decision of the Tax Court or a redetermination by the commissioner of revenue under section 127A.48, subdivisions 7 to 16, or for any other reason, the amount of the excess shall be deducted from the levy certified in the next year for the same purpose. If no levy is certified in the next year for the same purpose or if the amount certified is less than the amount of the excess, the excess must be deducted from that levy and the general fund levy certified pursuant to chapters 122A, 123A, 123B, 124D, and 126C. If the amount of any aid would have been increased in a prior year as a result of a decision of the Tax Court or a redetermination by the commissioner of revenue, the amount of the increase shall be added to the amount of current aid for the same purposes.\nNotwithstanding any other charter provision, general or special laws to the contrary, every school district in the state shall abide by the terms and provisions of this section and chapters 120B, 122A, 123A, 123B, 124D, 125A, 126C, and 127A.\nThe computation of levy limitations pursuant to this chapter and chapters 120B, 122A, 123A, 123B, 124D, 125A, 127A, 136C, and 136D shall be based on estimates where necessary. If as a result of using estimates for these computations the amount of any levy is different from the amount which could actually have been levied if actual data had been available, levy limitations in the first year when the actual data is known shall be adjusted to reflect for this difference. The amount of any adjustment to levy limitations pursuant to this subdivision shall be recognized as revenue in the school year when the levy for which the levy limitation is so adjusted is recognized as revenue.\nWhenever a change enacted in law changes the levy authority for a school district or an intermediate school district for a fiscal year after the levy for that fiscal year has been certified by the district under section 275.07, the department must adjust the next levy certified by the district by the amount of the change in levy authority for that fiscal year resulting from the change. Notwithstanding section 123B.75, the entire amount of the levy adjustment must be recognized as revenue in the fiscal year the levy is certified, if sufficient levy resources are available under generally accepted accounting principles in the district fund where the adjustment is to occur. Districts that do not have sufficient levy resources available in the fund where the adjustment is to occur must recognize in the fiscal year the levy is certified an amount equal to the levy resources available. The remaining adjustment amount must be recognized as revenue in the fiscal year after the levy is certified.\nFor each tax settlement, the county auditor shall report to each school district by fund, the district tax settlement revenue defined in section 123B.75, subdivision 1a, on the form specified in section 276.10. The county auditor shall send to the district a copy of the spread levy report specified in section 275.124.\n(1) Reductions in levies pursuant to subdivision 1 must be made prior to the reductions in clause (2).\n(2) Notwithstanding any other law to the contrary, districts that have revenue pursuant to sections 298.018; 298.225; 298.24 to 298.28, except an amount distributed under sections 298.26; 298.28, subdivision 4, paragraphs (c), clause (ii), and (d); 298.34 to 298.39; 298.391 to 298.396; 298.405; 477A.15; and any law imposing a tax upon severed mineral values must reduce the levies authorized by this chapter and chapters 120B, 122A, 123A, 123B, 124A, 124D, 125A, and 127A by 95 percent of the sum of the previous year's revenue specified under this clause and the amount attributable to the same production year distributed to the cities and townships within the school district under section 298.28, subdivision 2, paragraph (c).\n(3) The amount of any voter approved referendum, facilities down payment, and debt levies shall not be reduced by more than 50 percent under this subdivision, except that payments under section 298.28, subdivision 7a, may reduce the debt service levy by more than 50 percent. In administering this paragraph, the commissioner shall first reduce the nonvoter approved levies of a district; then, if any payments, severed mineral value tax revenue or recognized revenue under paragraph (2) remains, the commissioner shall reduce any voter approved referendum levies authorized under section 126C.17; then, if any payments, severed mineral value tax revenue or recognized revenue under paragraph (2) remains, the commissioner shall reduce any voter approved facilities down payment levies authorized under section 123B.63 and then, if any payments, severed mineral value tax revenue or recognized revenue under paragraph (2) remains, the commissioner shall reduce any voter approved debt levies.\n(4) Before computing the reduction pursuant to this subdivision of the long-term facilities maintenance levy authorized by section 123B.595, the commissioner shall ascertain from each affected school district the amount it proposes to levy. The reduction shall be computed on the basis of the amount so ascertained.\n(5) To the extent the levy reduction calculated under paragraph (2) exceeds the limitation in paragraph (3), an amount equal to the excess must be distributed from the school district's distribution under sections 298.225, 298.28, and 477A.15 in the following year to the cities and townships within the school district in the proportion that their taxable net tax capacity within the school district bears to the taxable net tax capacity of the school district for property taxes payable in the year prior to distribution. No city or township shall receive a distribution greater than its levy for taxes payable in the year prior to distribution. The commissioner of revenue shall certify the distributions of cities and towns under this paragraph to the county auditor by September 30 of the year preceding distribution. The county auditor shall reduce the proposed and final levies of cities and towns receiving distributions by the amount of their distribution. Distributions to the cities and towns shall be made at the times provided under section 298.27.",
	"repealed": false
}