{
	"id": "14.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.131",
	"title": "14.131 STATEMENT OF NEED AND REASONABLENESS.",
	"text": "By the date of the section 14.14, subdivision 1a, notice, the agency must prepare, review, and make available for public review a statement of the need for and reasonableness of the rule. The statement of need and reasonableness must be prepared under rules adopted by the chief administrative law judge and must include the following to the extent the agency, through reasonable effort, can ascertain this information:\n(1) a description of the classes of persons who probably will be affected by the proposed rule, including classes that will bear the costs of the proposed rule and classes that will benefit from the proposed rule;\n(2) the probable costs to the agency and to any other agency of the implementation and enforcement of the proposed rule and any anticipated effect on state revenues;\n(3) a determination of whether there are less costly methods or less intrusive methods for achieving the purpose of the proposed rule;\n(4) a description of any alternative methods for achieving the purpose of the proposed rule that were seriously considered by the agency and the reasons why they were rejected in favor of the proposed rule;\n(5) the probable costs of complying with the proposed rule, including the portion of the total costs that will be borne by identifiable categories of affected parties, such as separate classes of governmental units, businesses, or individuals;\n(6) the probable costs or consequences of not adopting the proposed rule, including those costs or consequences borne by identifiable categories of affected parties, such as separate classes of government units, businesses, or individuals;\n(7) an assessment of any differences between the proposed rule and existing federal regulations and a specific analysis of the need for and reasonableness of each difference; and\n(8) an assessment of the cumulative effect of the rule with other federal and state regulations related to the specific purpose of the rule.\nThe statement must describe how the agency, in developing the rules, considered and implemented the legislative policy supporting performance-based regulatory systems set forth in section 14.002.\nFor purposes of clause (8), \"cumulative effect\" means the impact that results from incremental impact of the proposed rule in addition to other rules, regardless of what state or federal agency has adopted the other rules. Cumulative effects can result from individually minor but collectively significant rules adopted over a period of time.\nThe statement must also describe the agency's efforts to provide additional notification under section 14.14, subdivision 1a, to persons or classes of persons who may be affected by the proposed rule or must explain why these efforts were not made.\nThe agency must consult with the commissioner of management and budget to help evaluate the fiscal impact and fiscal benefits of the proposed rule on units of local government. The agency must send a copy of the statement of need and reasonableness to the Legislative Reference Library when the notice of hearing is mailed under section 14.14, subdivision 1a.",
	"repealed": false
}