{
	"id": "114D.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/114D.15",
	"title": "114D.15 DEFINITIONS.",
	"text": "The definitions provided in this section apply to the terms used in this chapter.\n\"Citizen monitoring\" means monitoring of surface water quality by individuals and nongovernmental organizations that is consistent with section 115.06, subdivision 4, and Pollution Control Agency guidance on monitoring procedures, quality assurance protocols, and data management.\n\"Clean Water Council\" or \"council\" means the Clean Water Council created pursuant to section 114D.30, subdivision 1.\n\"Comprehensive local water management plan\" has the meaning given under section 103B.3363, subdivision 3.\n\"Comprehensive watershed management plan\" has the meaning given under section 103B.3363, subdivision 3a.\n\"Federal TMDL requirements\" means the requirements of section 303(d) of the Clean Water Act, United States Code, title 33, section 1313(d), and associated regulations and guidance.\n\"Impaired water\" means surface water that does not meet applicable water quality standards.\n\"Public agencies\" means all state agencies, political subdivisions, joint powers organizations, and special purpose units of government with authority, responsibility, or expertise in protecting, restoring, or preserving the quality of surface waters, managing or planning for surface waters and related lands, or financing waters-related projects. Public agencies includes the University of Minnesota and other public education institutions.\n\"Restoration\" means actions taken to pursue, achieve, and maintain water quality standards for impaired waters.\n\"Surface waters\" means waters of the state as defined in section 115.01, subdivision 22, excluding groundwater as defined in section 115.01, subdivision 6.\n\"Third-party TMDL\" means a TMDL by the Pollution Control Agency that is developed in whole or in part by a qualified public agency other than the Pollution Control Agency consistent with the goals, policies, and priorities in section 114D.20.\n\"Total maximum daily load\" or \"TMDL\" means a scientific study that contains a calculation of the maximum amount of a pollutant that may be introduced into a surface water and still ensure that applicable water quality standards for that water are restored and maintained. A TMDL also is the sum of the pollutant load allocations for all sources of the pollutant, including a wasteload allocation for point sources, a load allocation for nonpoint sources and natural background, an allocation for future growth of point and nonpoint sources, and a margin of safety to account for uncertainty about the relationship between pollutant loads and the quality of the receiving surface water. \"Natural background\" means characteristics of the water body resulting from the multiplicity of factors in nature, including climate and ecosystem dynamics, that affect the physical, chemical, or biological conditions in a water body, but does not include measurable and distinguishable pollution that is attributable to human activity or influence. A TMDL must take into account seasonal variations.\n\"TMDL implementation plan\" means a document detailing restoration strategies or activities needed to meet approved TMDL pollutant load allocations for point and nonpoint sources. This could include a WRAPS, a comprehensive watershed management plan, a comprehensive local water management plan, or another document or strategy that the commissioner of the Pollution Control Agency determines to be, in whole or in part, sufficient to provide reasonable assurance of achieving applicable water quality standards.\n\"Water quality standards\" for Minnesota surface waters are found in Minnesota Rules, chapters 7050 and 7052.\n\"Watershed restoration and protection strategy\" or \"WRAPS\" means a document summarizing scientific studies of a major watershed at approximately a hydrologic unit code 8 scale with strategies designed to achieve and maintain water quality standards and goals.",
	"repealed": false
}