{
	"id": "501C.0102",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.0102",
	"title": "501C.0102 SCOPE.",
	"text": "(a) This chapter applies to express trusts, charitable or noncharitable, and trusts created pursuant to a statute, judgment, or decree that require the trust to be administered in the manner of an express trust.\n(b) Sections 501C.0201 to 501C.0208 do not apply to trusts in the nature of mortgages or to trusts commonly known as voting trusts. Sections 501C.0201 to 501C.0208 apply, unless otherwise provided in the trust instrument, to trusts established in connection with bonds issued under chapter 469, and, at the sole election of the issuer of bonds issued under chapter 469, without a trust indenture, to the pledges and other bond covenants made by the issuer in one or more resolutions with respect to the bonds. If the issuer elects to apply sections 501C.0201 to 501C.0208, for such purposes only, pledges and other bond covenants shall be deemed the \"trust,\" the resolution or resolutions shall be deemed the \"trust instrument,\" and the issuer shall be deemed the \"trustee\" notwithstanding the absence of any fiduciary responsibility owed by the \"issuer\" toward the bondholders. Nothing in this section precludes the issuer from seeking approval under sections 501C.0201 to 501C.0208 of the creation of any express trust under a trust indenture and the appointment of a trustee to act as fiduciary for the benefit of the bondholders. As used in sections 501C.0201 to 501C.0208, \"beneficiary\" includes a bondholder.\n(c) This chapter does not apply to corporate trusts, except that sections 501C.0201 to 501C.0208 apply to corporate trusts that are administered by a trustee located in this state. For purposes of this paragraph, the following terms have the meanings given:\n(1) \"Corporate trust\" means any trust created pursuant to a corporate trust agreement; and\n(2) \"Corporate trust agreement\" means any indenture, pooling and servicing agreement, collateral agency agreement, or other contractual arrangement that establishes an express trust either before or upon the occurrence of an event of default and was entered into with a trustee as a party to facilitate a commercial transaction for the issuance of debt or equity securities or for the creation of other similar rights or interests, whether or not the securities are subject to any securities laws, including but not limited to the Trust Indenture Act of 1939, as amended.",
	"repealed": false
}