{
	"id": "142D.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.15",
	"title": "142D.15 FAMILY SERVICES AND COMMUNITY-BASED COLLABORATIVES.",
	"text": "(a) In order to qualify as a family services collaborative, a minimum of one school district, one county, one public health entity, one community action agency as defined in section 142F.301, and one Head Start grantee if the community action agency is not the designated federal grantee for the Head Start program must agree in writing to provide coordinated family services and commit resources to an integrated fund. Collaboratives are expected to have broad community representation, which may include other local providers, including additional school districts, counties, and public health entities, other municipalities, public libraries, existing culturally specific community organizations, tribal entities, local health organizations, private and nonprofit service providers, child care providers, local foundations, community-based service groups, businesses, local transit authorities or other transportation providers, community action agencies under section 142F.301, senior citizen volunteer organizations, parent organizations, parents, and sectarian organizations that provide nonsectarian services.\n(b) Members of the governing bodies of political subdivisions involved in the establishment of a family services collaborative shall select representatives of the nongovernmental entities listed in paragraph (a) to serve on the governing board of a collaborative. The governing body members of the political subdivisions shall select one or more representatives of the nongovernmental entities within the family service collaborative.\n(c) Two or more family services collaboratives or children's mental health collaboratives may consolidate decision-making, pool resources, and collectively act on behalf of the individual collaboratives, based on a written agreement among the participating collaboratives.\n(a) Each collaborative must:\n(1) establish, with assistance from families and service providers, clear goals for addressing the health, developmental, educational, and family-related needs of children and youth and use outcome-based indicators to measure progress toward achieving those goals;\n(2) establish a comprehensive planning process that involves all sectors of the community, identifies local needs, and surveys existing local programs;\n(3) integrate service funding sources so that children and their families obtain services from providers best able to anticipate and meet their needs;\n(4) coordinate families' services to avoid duplicative and overlapping assessment and intake procedures;\n(5) focus primarily on family-centered services;\n(6) encourage parents and volunteers to actively participate by using flexible scheduling and actively recruiting volunteers;\n(7) provide services in locations that are readily accessible to children and families;\n(8) use new or reallocated funds to improve or enhance services provided to children and their families;\n(9) identify federal, state, and local institutional barriers to coordinating services and suggest ways to remove these barriers; and\n(10) design and implement an integrated local service delivery system for children and their families that coordinates services across agencies and is client centered. The delivery system shall provide a continuum of services for children birth to age 18, or birth through age 21 for individuals with disabilities. The collaborative shall describe the community plan for serving pregnant women and children from birth to age six.\n(b) The outcome-based indicators developed in paragraph (a), clause (1), may include the number of low birth weight babies, the infant mortality rate, the number of children who are adequately immunized and healthy, require out-of-home placement or long-term special education services, and the number of minor parents.\nBy mutual agreement of the collaborative and a coordinating body listed in this subdivision, a family services collaborative may assume the duties of a community transition interagency committee established under section 125A.22; an interagency early intervention committee established under section 125A.30; or a local advisory council established under section 245.4875, subdivision 5.\nA collaborative must design an integrated local service delivery system that coordinates funding streams and the delivery of services between existing agencies. The integrated local service delivery system may:\n(1) improve outreach and early identification of children and families in need of services and intervene across service systems on behalf of families;\n(2) offer an inclusive service system that supports all families within a community;\n(3) coordinate services that eliminate the need to match funding streams, provider eligibilities, or clients with multiple providers;\n(4) improve access to services by coordinating transportation services;\n(5) provide initial outreach to all new mothers and periodic family visits to children who are potentially at risk;\n(6) coordinate assessment across systems to determine which children and families need coordinated multiagency services and supplemental services;\n(7) include multiagency service plans and coordinate unitary case management; and\n(8) integrate funding of services.\n(a) The school district, county, and public health entity members of a family services collaborative may inform each other as to whether an individual or family is being served by the member, without the consent of the subject of the data. If further information sharing is necessary in order for the collaborative to carry out duties under subdivision 2 or 3, the collaborative may share data if the individual, as defined in section 13.02, subdivision 8, gives written informed consent. Data on individuals shared under this subdivision retain the original classification as defined under section 13.02, as to each member of the collaborative with whom the data is shared.\n(b) If a federal law or regulation impedes information sharing that is necessary in order for a collaborative to carry out duties under subdivision 2 or 3, the appropriate state agencies shall seek a waiver or exemption from the applicable law or regulation.\n(a) A collaborative must establish an integrated fund to help provide an integrated service system and fund additional supplemental services. The integrated fund may consist of federal, state, local, or private resources. The collaborative agreement must specify a minimum financial commitment by the contributors to an integrated fund. Contributors may not reduce their financial commitment except as specified in the agreement or by federal declaration.\n(b) A collaborative must seek to maximize federal and private funds by designating local expenditures for services that can be matched with federal or private grant funds and by designing services to meet the requirements for state or federal reimbursement.\n(c) Collaboratives may seek to maximize federal reimbursement of funds under section 256F.10.\nThe collaborative plan must describe how the collaborative will carry out the duties and implement the integrated local services delivery system required under this section. The plan must include a list of the collaborative participants, a copy of the agreement required under subdivision 1, the amount and source of resources each participant will contribute to the integrated fund, and methods for increasing local participation in the collaborative, involving parents and other community members in implementing and operating the collaborative, and providing effective outreach services to all families with young children in the community. The plan must also include specific goals that the collaborative intends to achieve and methods for objectively measuring progress toward meeting the goals.\n(a) The Children's Cabinet must approve local plans for collaboratives. In approving local plans, the Children's Cabinet must give highest priority to a plan that provides:\n(1) early intervention and family outreach services;\n(2) parenting time services;\n(3) a continuum of services for children from birth to age 18;\n(4) family preservation services;\n(5) culturally sensitive approaches for delivering services and utilizing culturally specific organizations;\n(6) clearly defined outcomes and valid methods of assessment;\n(7) effective service coordination;\n(8) participation by the maximum number of jurisdictions and local, county, and state funding sources;\n(9) integrated community service providers and local resources;\n(10) integrated transportation services;\n(11) integrated housing services; and\n(12) coordinated services that include a children's mental health collaborative authorized by law.\n(b) The Children's Cabinet must ensure that the collaboratives established under this section do not conflict with any state or federal policy or program and do not negatively impact the state budget.\nThe commissioner of children, youth, and families may designate one collaborative to act as a lead collaborative for purposes of obtaining liability coverage for participating collaboratives.",
	"repealed": false
}