{
	"id": "92.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.50",
	"title": "92.50 UNSOLD LANDS SUBJECT TO SALE MAY BE LEASED.",
	"text": "(a) The commissioner of natural resources may lease land under the commissioner's jurisdiction and control:\n(1) to remove sand, gravel, clay, rock, marl, peat, and black dirt;\n(2) to store ore, waste materials from mines, or rock and tailings from ore milling plants;\n(3) for roads or railroads;\n(4) to compensate the permanent school fund according to section 92.122; or\n(5) for other uses consistent with the interests of the state.\n(b) The commissioner shall offer the lease at public or private sale for an amount and under terms and conditions prescribed by the commissioner. Commercial leases for more than ten years and leases for removal of peat that cover 320 or more acres must be approved by the Executive Council.\n(c) The lease term may not exceed 21 years except:\n(1) leases of lands for storage sites for ore, waste materials from mines, or rock and tailings from ore milling plants or for the removal of peat for nonagricultural purposes may not exceed a term of 25 years; and\n(2) leases for commercial purposes, including major resort, convention center, or recreational area purposes, may not exceed a term of 40 years.\n(d) Leases must be subject to sale and leasing of the land for mineral purposes and contain a provision for cancellation for just cause at any time by the commissioner upon six months' written notice. A longer notice period, not exceeding three years, may be provided in leases for storing ore, waste materials from mines, or rock or tailings from ore milling plants. The commissioner may determine the terms and conditions, including the notice period, for cancellation of a lease for the removal of peat and commercial leases.\n(e) Money received from leases under this section must be credited to the fund to which the land belongs.\n(a) The commissioner may grant leases and licenses to deposit tailings from any iron ore beneficiation plant in any public lake not exceeding 160 acres in area after holding a public hearing in the manner and under the procedure provided in Laws 1937, chapter 468, as amended and finding in pursuance of the hearing:\n(1) that such use of each lake is necessary and in the best interests of the public; and\n(2) that the proposed use will not result in pollution or sedimentation of any outlet stream.\n(b) The lease or license may not exceed a term of 25 years and must be subject to cancellation on three years' notice. The commissioner may further restrict use of the lake to safeguard the public interest, and may require that the lessee or licensee acquire suitable permits or easements from the owners of lands riparian to the lake. Money received from the leases or licenses must be deposited in the permanent school fund.\nThe commissioner may require a performance bond, security deposit, or other form of security for removing any improvements or personal property left on the leased premises by the lessee upon termination or cancellation of the lease.\nIn addition to other payments required by this section, the applicant must reimburse the state for costs incurred for cultural resources review, monitoring, or other services provided by the Minnesota Historical Society under contract with the commissioner of natural resources or the State Historic Preservation Office of the Department of Administration in connection with reviewing the lease request, preparing the lease terms, or constructing improvements on the leased premises.",
	"repealed": false
}