{
	"id": "28A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.21",
	"title": "28A.21 FOOD SAFETY AND DEFENSE TASK FORCE.",
	"text": "The Food Safety and Defense Task Force is established to advise the commissioner and the legislature on food issues and food safety.\n(a) The Food Safety and Defense Task Force consists of:\n(1) the commissioner of agriculture or the commissioner's designee;\n(2) the commissioner of health or the commissioner's designee;\n(3) a representative of the United States Food and Drug Administration;\n(4) a representative of the United States Department of Agriculture;\n(5) a representative of the Agricultural Utilization Research Institute;\n(6) one member of the Minnesota Grocers Association;\n(7) one member from the University of Minnesota knowledgeable in food and food safety issues; and\n(8) ten members appointed by the governor who are interested in food and food safety, of whom:\n(i) two persons are health or food professionals;\n(ii) one person represents a statewide general farm organization;\n(iii) one person represents a local food inspection agency;\n(iv) one person represents a food-oriented consumer group;\n(v) one person represents a Minnesota-based manufacturer of microbial detection equipment and remediation products; and\n(vi) one person is knowledgeable in cybersecurity.\n(b) Members shall serve without compensation. Members appointed by the governor shall serve four-year terms.\n(a) The commissioner or the commissioner's designee shall convene the first meeting of the task force.\n(b) The task force shall meet monthly or as determined by the chair.\n(c) The members of the task force shall annually elect a chair and other officers as the members deem necessary.\nThe commissioner shall provide support staff, office space, and administrative services for the task force.\nThe task force shall:\n(1) coordinate educational efforts regarding food safety and defense;\n(2) provide advice and coordination to state agencies as requested by the agencies;\n(3) serve as a source of information and referral for the public, news media, and others concerned with food safety and defense; and\n(4) make recommendations to Congress, the legislative committees with jurisdiction over agriculture finance and policy, the legislature, and others about appropriate action to improve food safety and defense in the state.\nThis section expires June 30, 2037.",
	"repealed": false
}