{
	"id": "231.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/231.08",
	"title": "231.08 WAREHOUSE OPERATOR AND HOUSEHOLD GOODS WAREHOUSE OPERATOR REQUIREMENTS.",
	"text": "Every warehouse operator and household goods warehouse operator shall furnish all information required by the department to administer this chapter and make specific answers to all questions submitted by the department, under oath. A warehouse operator or household goods warehouse operator which is a corporation shall answer under the oath of one of its duly authorized officers.\nA warehouse operator or household goods warehouse operator shall obey and comply with every order, decision, direction, or rule made or prescribed by the department in the matters specified in this chapter; and do everything necessary or proper to secure the compliance with and the observance of the same, by all its officers, agents, and employees.\nNothing in this chapter shall be construed as limiting the rights of any warehouse operator or household goods warehouse operator to lease or let for any storage purpose any portion of a building.\nAt the time of or prior to tender of goods for storage by a depositor, a storage order must be signed in writing by the depositor or the depositor's duly authorized representative and must show the name and address of the warehouse operator in whose custody the goods are to be deposited.\nA warehouse operator who receives a lot of goods must identify each article or lot by tag or lot number, as recorded on the operator's books and on the warehouse receipt or contract.\nAll warehouses must be protected against fire in accordance with the State Fire Code.\nA warehouse floor or part of a floor must not at any time be loaded or stored with a greater weight of goods or materials per square foot than the floor will sustain with safety. If the department directs a warehouse operator to ascertain from a competent registered architect or engineer or from the proper municipal authorities what may be the safe load capacity in pounds per square foot of each floor of the operator's warehouse or warehouses, the operator must do so without unnecessary delay and must post signs in several conspicuous places on each floor stating the safe live load that floor will sustain.\n(a) On each floor where there is open storage of goods, wares, or merchandise, there must be aisles wide enough to permit the free and unimpeded passage of goods, wares, or merchandise. All aisles must be kept free from obstructions, dust, and litter.\n(b) Pieces of overstuffed furniture, mattresses, rugs, carpets, and other goods not stored in containers must be protected by wrapping before being placed in permanent storage.",
	"repealed": false
}