{
	"id": "515B.3-1041",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-1041",
	"title": "515B.3-1041 SPECIAL DECLARANT RIGHTS; TRANSFER, LIABILITY OF TRANSFEROR AND TRANSFEREE, AND TERMINATION; SPECIAL DECLARANT RIGHTS TRANSFERRED ON OR AFTER AUGUST 1, 2010.",
	"text": "(a) Except as set forth in subsection (b) or (c), a special declarant right, as defined in section 515B.1-103(33b), does not run with title and may only be transferred pursuant to a separate transfer instrument, titled a \"Transfer of Special Declarant Rights,\" that both the transferor and the transferee execute.\n(1) A transfer shall be recorded in compliance with applicable law, and is not effective unless the transferee is the owner of record of a unit or additional real estate at the time the transfer is recorded. Transfers recorded on or after June 1, 2011, shall be recorded against title to all units in the common interest community.\n(2) A transferor may transfer fewer than all of the special declarant rights the transferor holds provided that any special declarant rights not transferred are subject to item (i).\n(3) If as a result of a transfer there will be multiple declarants holding special declarant rights, the transfer shall describe the allocation of each special declarant right between or among the transferor and each transferee, including, at a minimum, a description of the units or additional real estate to which the respective special declarant rights apply and the name and address of the owner or owners of record of the respective units or additional real estate at the time the transfer is recorded.\n(b) If a declarant's ownership interest in a unit, or in additional real estate that may become subject to the declaration pursuant to the exercise of a special declarant right, is transferred to another person as a result of the foreclosure, termination, or cancellation of a security interest, foreclosure of a judgment lien, tax judgment sale, tax-forfeited land sale, sale or transfer under bankruptcy code or receivership proceedings, or other sale or transfer approved by a court, or is transferred by a deed in lieu of foreclosure, then all special declarant rights that are reserved to the declarant in the declaration and that relate to the units or additional real estate transferred are automatically transferred to the person acquiring title from the declarant, and the transfer is effective as to all special declarant rights, unless or until: (i) the security instrument in the case of the foreclosure, termination, or cancellation of a security interest, (ii) the instrument effecting the involuntary transfer, or (iii) a separate instrument executed by the transferee and recorded in compliance with applicable law within 60 days after the date the transferee acquires title to the declarant's ownership interest, provides for the transfer of fewer than all of the declarant's special declarant rights. From and after June 1, 2011, a separate instrument recorded pursuant to subsection (b), item (iii), shall be recorded against title to all units in the common interest community. For purposes of this subsection, the transferee shall be deemed to acquire title upon the expiration of the owner's period of redemption, or reinstatement in the case of contract for deed. The transferor shall cease to have and shall not exercise any special declarant right that relates to the transferor's ownership interest in the units or additional real estate transferred, whether or not the transferee subsequently disclaims the right, but the transferor retains all reserved special declarant rights that relate to its ownership interest that is not transferred to the transferee.\n(c) If a declarant is an individual rather than a legal entity, and the individual dies, than all special declarant rights that are reserved to the declarant in the declaration and that relate to the units or additional real estate owned by the declarant are automatically transferred with the title to said units or additional real estate.\n(d) A transferor's liability for the performance of obligations that this chapter imposes upon a declarant is as follows:\n(1) A transferor remains liable under this chapter for all obligations that this chapter imposes upon a declarant that arise on or before the effective date of the transfer, except that a transferor is not liable under section 515B.4-112 for any express warranties that a transferee makes to a purchaser. Except as set forth in subsection (d), clauses (2) and (3), a transferor is not liable under this chapter for the performance of any obligations that this chapter imposes upon a declarant and arising after the effective date of the transfer.\n(2) If a transferor and a transferee are affiliates, the transferor and the transferee are jointly and severally liable under this chapter for the performance of all the obligations that this chapter imposes upon a declarant, whether such obligations arise before, on, or after the effective date of the transfer. Upon a subsequent transfer, a prior transferor remains liable to the extent its transferee remains liable under subsection (d) and is relieved of liability to the same extent that its transferee is relieved of liability under subsection (e).\n(3) If, following a transfer of special declarant rights, the transferor retains special declarant rights, the transferor and transferee are jointly and severally liable for the performance of all the obligations that this chapter imposes upon a declarant and that arise after the effective date of the transfer, except that the transferor is not liable under section 515B.4-101(b) or 515B.4-102(b), and section 515B.4-109, 515B.4-110, 515B.4-111, 515B.4-112, 515B.4-113, 515B.4-117, or 515B.4-118, to any purchaser from or through the transferee.\n(e) Except as provided in subsections (g) and (h), a transferee's liability for the performance of obligations that this chapter imposes upon a declarant is as follows:\n(1) Except as set forth in subsection (e), clause (3), a transferee is liable under this chapter for all obligations that this chapter imposes upon a declarant and that arise after the effective date of the transfer. A transferee is not liable under this chapter for the performance of any obligations that this chapter imposes upon a declarant and that arise before or on the effective date of the transfer, except that a transferee is liable under section 515B.4-112 for any express warranties the transferee makes to a purchaser before or on the effective date of the transfer.\n(2) If a transferor and a transferee are affiliates, the transferor and the transferee are jointly and severally liable under this chapter for the performance of all the obligations that this chapter imposes upon a declarant, whether such obligations arise before, on, or after the effective date of the transfer. Upon a subsequent transfer, a prior transferor remains liable to the extent its transferee remains liable under subsection (d) and is relieved of liability to the same extent that its transferee is relieved of liability under this subsection.\n(3) If, following a transfer of special declarant rights under subsection (a) or (b), the transferor retains special declarant rights, the transferor and transferee are jointly and severally liable for the performance of all the obligations that this chapter imposes upon a declarant and that arise after the effective date of the transfer, except that the transferee is not liable under section 515B.4-101(b) or 515B.4-102(b), and section 515B.4-109, 515B.4-110, 515B.4-111, 515B.4-112, 515B.4-113, 515B.4-117, or 515B.4-118, to any purchaser from or through the transferor.\n(f) For purposes of this section, a declarant's obligations under section 515B.3-111(a) arise when the tort or contract violation occurs, a declarant's obligations to a purchaser under section 515B.4-112 arise when the declarant makes an express warranty to the purchaser and a declarant's obligations to a purchaser under sections 515B.4-113 and 515B.4-118(a) arise when the declarant conveys a unit to the purchaser.\n(g) A transferee who acquires special declarant rights pursuant to subsection (b) and who is not an affiliate of the transferor may record an instrument in compliance with subsection (b) stating that the transferee elects to acquire only the special declarant rights described in section 515B.1-103(33b)(i), (ii), and (iv). In that case, the transferee is liable as a declarant only to purchasers from said transferee and only for the obligations of a declarant under sections 515B.4-101(b) and 515B.4-102(b), and sections 515B.4-109, 515B.4-110, 515B.4-111, 515B.4-113, 515B.4-117, and 515B.4-118, and for any express warranties under section 515B.4-112 that the transferee makes to purchasers.\n(h) A transferee who acquires special declarant rights pursuant to subsection (b) and who is not an affiliate of the transferor may record an instrument in compliance with subsection (b) stating that the transferee elects to acquire the special declarant rights solely for subsequent retransfer to another person who acquires title to units or additional real estate from said transferee. In that case, (i) the transferee may not utilize special declarant rights in the sale of units or otherwise sell units, except to a person who also acquires one or more special declarant rights the transferee holds with respect to the units or additional real estate sold; (ii) the transferee may not exercise any special declarant rights other than the rights described in section 515B.1-103(33b)(v); (iii) the transferee is not liable to make up any operating deficit under section 515B.3-115(a)(2); and (iv) the transferee is liable as a declarant only for the obligations of a declarant under sections 515B.3-103, 515B.3-111, and 515B.3-120, as applicable. A transferee who makes the election described in this subsection may subsequently rescind the election in whole or in part by recording an instrument in compliance with applicable law, and upon the recording of such an instrument the transferee's rights and obligations as a declarant shall be as otherwise set forth in this section.\n(i) Nothing in this section shall subject any transferee of a special declarant right to any claims against or other obligations of a transferor, other than claims and obligations arising under this chapter, or the declaration or bylaws.\n(j) A special declarant right held by a declarant terminates upon the earlier of: (i) that declarant's voluntary surrender of the special declarant right by giving written notice to the unit owners pursuant to section 515B.1-115; or (ii) the conveyance, whether voluntary or involuntary, by that declarant, of all of the units and additional real estate owned by that declarant, unless immediately after the conveyance the special declarant right is transferred to the grantee. All special declarant rights terminate ten years after the date of the first conveyance of a unit to a person other than a declarant unless extended by the vote or written agreement of unit owners entitled to cast at least 67 percent of the votes allocated to units not owned by a declarant.\n(k) No person shall exercise special declarant rights unless, at the time of exercise, the person holds title of record to one or more units or additional real estate. Any exercise of a special declarant right in violation of this section shall be void, and the person attempting to exercise the right shall be liable for all damages and costs arising from its actions.\n(l) Subsections (a) through (i) apply only to transfers of special declarant rights that are effective on or after August 1, 2010. Subsections (j) and (k) apply only to special declarant rights reserved in a declaration that is first recorded on or after August 1, 2010.",
	"repealed": false
}