{
	"id": "268B.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.155",
	"title": "268B.155 CHILD SUPPORT DEDUCTION FROM BENEFITS.",
	"text": "As used in this section:\n(1) \"child support agency\" means the public agency responsible for child support enforcement, including federally approved comprehensive Tribal IV-D programs; and\n(2) \"child support obligations\" means obligations that are being enforced by a child support agency in accordance with a plan described in United States Code, title 42, sections 454 and 455, of the Social Security Act that has been approved by the secretary of health and human services under part D of title IV of the Social Security Act. This does not include any type of spousal maintenance or foster care payments.\nIn an application for family or medical leave benefits, the applicant must disclose if child support obligations are owed and, if so, in what state and county. If child support obligations are owed, the commissioner must, if the applicant establishes a leave, notify the child support agency.\n[See Note.]\nThe commissioner must deduct and withhold from any family or medical leave benefits payable to an applicant who owes child support obligations:\n(1) the amount required under a proper order of a court or administrative agency; or\n(2) if clause (1) is not applicable, the amount determined under an agreement under United States Code, title 42, section 454(20)(B)(i), of the Social Security Act; or\n(3) if clause (1) or (2) is not applicable, the amount specified by the applicant.\nAny amount deducted and withheld must be paid to the child support agency, must for all purposes be treated as if it were paid to the applicant as family or medical leave benefits and paid by the applicant to the child support agency in satisfaction of the applicant's child support obligations.\nThe child support agency must pay the costs incurred by the commissioner in the implementation and administration of this section and sections 518A.50 and 518A.53.",
	"repealed": false
}