{
	"id": "273.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.061",
	"title": "273.061 ESTABLISHMENT OF OFFICE FOR EACH COUNTY.",
	"text": "Every county in this state shall have a county assessor. The county assessor shall be appointed by the board of county commissioners. The assessor shall be selected and appointed because of knowledge and training in the field of property taxation and appointment shall be approved by the commissioner of revenue before the same shall become effective. Upon receipt by the county commissioners of the commissioner of revenue's refusal to approve an appointment, the term of the appointee shall terminate at the end of that day.\nThe commissioner of revenue may grant approval on a probationary basis for a period of two years. The commissioner must base the decision to impose a probationary period on objective and consistent criteria. At the end of the two-year probationary period, the commissioner may either refuse to approve the person's appointment for the remainder of the person's four-year term, approve the person's appointment but only for another two-year probationary period, or unconditionally approve the person's appointment for the remainder of the four-year term for which the person was originally appointed by the county board. The criteria shall not be considered rules and are not subject to the Administrative Procedure Act.\nNotwithstanding any law to the contrary, a county assessor must have senior accreditation from the state Board of Assessors by January 1, 1992, or within two years of the assessor's first appointment under this section, whichever is later.\nA person appointed as the county assessor also may serve as the county auditor, county treasurer, or county auditor-treasurer if those offices are appointive, provided that the person in the combined appointed office must not serve on the county board of appeal and equalization under section 274.13. In a county in which the functions of the county assessor are combined with those of the county auditor or county auditor-treasurer, the county board may not delegate any authority, power, or responsibility under section 375.192, subdivision 4.\nIn a county in which the office of auditor, treasurer, or auditor-treasurer is an elective position, a person appointed as the county assessor also may serve as the county auditor, county treasurer, or county auditor-treasurer if a proposal to make the affected office appointive has been approved as required by other law and will be effective within five years.\nThe person appointed as the county assessor must not also be the county attorney, a county board member, an elected county auditor, an elected county treasurer, an elected county auditor-treasurer, a town board supervisor for a town in the same county, or a city mayor or council member for a city in the same county. The person appointed as the city assessor must not also be a city council member or mayor for the same city. A person appointed as the town assessor must not also be a town board supervisor for the same town. Except as provided in subdivision 1b, an assessor who accepts a position that is incompatible with the office of assessor is deemed to have resigned from the assessor position.\n(a) The terms of county assessors appointed under this section shall be four years. A new term shall begin on January 1 of every fourth year after 1973. When any vacancy in the office occurs, the board of county commissioners, within 90 days thereafter, shall fill the same by appointment for the remainder of the term, following the procedure prescribed in subdivision 1. The term of the county assessor may be terminated by the board of county commissioners at any time, on charges of malfeasance, misfeasance, or nonfeasance by the commissioner of revenue. If the board of county commissioners does not intend to reappoint a county assessor who has been certified by the state Board of Assessors, the board shall present written notice to the county assessor not later than 90 days prior to the termination of the assessor's term, that it does not intend to reappoint the assessor. If written notice is not timely made, the county assessor will automatically be reappointed by the board of county commissioners.\n(b) In the event of a vacancy in the office of county assessor, through death, resignation or other reasons, the deputy (or chief deputy, if more than one) shall perform the functions of the office. If there is no deputy, the county auditor shall designate a person to perform the duties of the office until an appointment is made as provided in clause (a). Such person shall perform the duties of the office for a period not exceeding 90 days during which the county board must appoint a county assessor. Such 90-day period may, however, be extended by written approval of the commissioner of revenue.\n(c) In the case of the first appointment under paragraph (a) of a county assessor who is accredited but who does not have senior accreditation, an approval of the appointment by the commissioner shall be provisional, provided that a county assessor appointed to a provisional term under this paragraph must reapply to the commissioner at the end of the provisional term. A provisional term may not exceed two years. The commissioner shall not approve the appointment for the remainder of the four-year term unless the assessor has obtained senior accreditation.\nEvery county assessor, before entering upon duties, shall take and subscribe the oath required of public officials.\nWith the approval of the board of county commissioners, the county assessor may employ one or more assistants and sufficient clerical help to perform the duties of the assessor's office.\nThe board of county commissioners shall provide suitable office space and equipment at the county seat for the county assessor, assistants and clerical help, and shall furnish such books, maps, stationery, postage and supplies as may be necessary for the discharge of the duties of the office.\nThe salaries of the county assessor and assistants and clerical help, shall be fixed by the board of county commissioners and shall be payable out of the general revenue fund of the county.\nIn addition to their salaries, the county assessor and assistants shall be allowed their expenses for reasonable and necessary travel in the performance of their duties, including necessary travel, lodging and meal expense incurred by them while attending meetings of instructions or official hearings called by the commissioner of revenue. These expenses shall be payable out of the general revenue fund of the county, and shall be allowed on the same basis as such expenses are allowed to other county officers.\nThe duty of the duly appointed local assessor shall be to view and appraise the value of all property as provided by law, but all the book work shall be done by the county assessor, or the assessor's assistants, and the value of all property subject to assessment and taxation shall be determined by the county assessor, except as otherwise hereinafter provided. If directed by the county assessor, the local assessor must perform the duties enumerated in subdivision 8, clause (16), and must enter construction and valuation data into the records in the manner prescribed by the county assessor.\nThe county assessor shall have the following powers and duties:\n(1) To call upon and confer with the township and city assessors in the county, and advise and give them the necessary instructions and directions as to their duties under the laws of this state, to the end that a uniform assessment of all real property in the county will be attained.\n(2) To assist and instruct the local assessors in the preparation and proper use of land maps and record cards, in the property classification of real and personal property, and in the determination of proper standards of value.\n(3) To keep the local assessors in the county advised of all changes in assessment laws and all instructions which the assessor receives from the commissioner of revenue relating to their duties.\n(4) To have authority to require the attendance of groups of local assessors at sectional meetings called by the assessor for the purpose of giving them further assistance and instruction as to their duties.\n(5) To immediately commence the preparation of a large scale topographical land map of the county, in such form as may be prescribed by the commissioner of revenue, showing thereon the location of all railroads, highways and roads, bridges, rivers and lakes, swamp areas, wooded tracts, stony ridges and other features which might affect the value of the land. Appropriate symbols shall be used to indicate the best, the fair, and the poor land of the county. For use in connection with the topographical land map, the assessor shall prepare and keep available in the assessor's office tables showing fair average minimum and maximum market values per acre of cultivated, meadow, pasture, cutover, timber and waste lands of each township. The assessor shall keep the map and tables available in the office for the guidance of town assessors, boards of review, and the county board of equalization.\n(6) To also prepare and keep available in the office for the guidance of town assessors, boards of review and the county board of equalization, a land valuation map of the county, in such form as may be prescribed by the commissioner of revenue. This map, which shall include the bordering tier of townships of each county adjoining, shall show the average market value per acre, both with and without improvements, as finally equalized in the last assessment of real estate, of all land in each town or unorganized township which lies outside the corporate limits of cities.\n(7) To regularly examine all conveyances of land outside the corporate limits of cities of the first and second class, filed with the county recorder of the county, and keep a file, by descriptions, of the considerations shown thereon. From the information obtained by comparing the considerations shown with the market values assessed, the assessor shall make recommendations to the county board of equalization of necessary changes in individual assessments or aggregate valuations.\n(8) To become familiar with the values of the different items of personal property so as to be in a position when called upon to advise the boards of review and the county board of equalization concerning property, market values thereof.\n(9) While the county board of equalization is in session, to give it every possible assistance to enable it to perform its duties. The assessor shall furnish the board with all necessary charts, tables, comparisons, and data which it requires in its deliberations, and shall make whatever investigations the board may desire.\n(10) At the request of either the board of county commissioners or the commissioner of revenue, to investigate applications for reductions of valuation and abatements and settlements of taxes, examine the real or personal property involved, and submit written reports and recommendations with respect to the applications, in such form as may be prescribed by the board of county commissioners and commissioner of revenue.\n(11) To make diligent search each year for real and personal property which has been omitted from assessment in the county, and report all such omissions to the county auditor.\n(12) To regularly confer with county assessors in all adjacent counties about the assessment of property in order to uniformly assess and equalize the value of similar properties and classes of property located in adjacent counties. The conference shall emphasize the assessment of agricultural and commercial and industrial property or other properties that may have an inadequate number of sales in a single county.\n(13) To render such other services pertaining to the assessment of real and personal property in the county as are not inconsistent with the duties set forth in this section, and as may be required by the board of county commissioners or by the commissioner of revenue.\n(14) To maintain a record, in conjunction with other county offices, of all transfers of property to assist in determining the proper classification of property, including but not limited to, transferring homestead property and name changes on homestead property.\n(15) To determine if a homestead application is required due to the transfer of homestead property or an owner's name change on homestead property.\n(16) To perform appraisals of property, review the original assessment and determine the accuracy of the original assessment, prepare an appraisal or appraisal report, and testify before any court or other body as an expert or otherwise on behalf of the assessor's jurisdiction with respect to properties in that jurisdiction.\nNotwithstanding any provision of law to the contrary, in order to promote a uniform assessment and review of assessments, the commissioner of revenue, county assessors and local assessors may exchange data on property which are classified under chapter 13 as public, nonpublic or private. The data for any property may include but is not limited to its sales, income, expenses, vacancies, rentable or usable areas, anticipated income and expenses, projected vacancies, lease information, and private multiple listing service data. Data exchanged under this provision that is classified as nonpublic or private data shall retain its classification.\nAdditional duties of the county assessor are as follows:\n(1) to make all assessments, based upon the appraised values reported by the local assessors or assistants and the county assessor's own knowledge of the value of the property assessed;\n(2) to personally view and determine the value of any property that because of its type or character may be difficult for the local assessor to appraise;\n(3) to make all changes ordered by the local boards of review, relative to the net tax capacity of the property of any individual, firm or corporation after notice has been given and hearings held as provided by law;\n(4) to enter all assessments in the assessment books, furnished by the county auditor, with each book and the tabular statements for each book in correct balance;\n(5) to prepare all assessment cards, charts, maps and any other forms prescribed by the commissioner of revenue;\n(6) to attend the meeting of the county board of equalization; to investigate and report on any assessment ordered by said board; to enter all changes made by said board in the assessment books and prepare information reported to the commissioner under section 270C.85, subdivision 2, clause (4); to enter all changes made by the State Board of Equalization in the assessment books; to deduct all exemptions authorized by law from each assessment and certify to the county auditor the taxable value of each parcel of land, as described and listed in the assessment books by the county auditor, and the taxable value of the personal property of each person, firm, or corporation assessed;\n(7) to investigate and make recommendations relative to all applications for the abatement of taxes or applications for the reduction of the net tax capacity of any property; and\n(8) to perform all other duties relating to the assessment of property for the purpose of taxation which may be required by the commissioner of revenue.\nIn counties having unorganized territory divided into one or more assessment districts, the board of county commissioners may appoint the county assessor for all such districts. In such case the assessor shall receive no compensation for performing the duties of assessor. The assessor shall, however, be allowed expenses for reasonable and necessary travel in the performance of duties. Such expenses shall be payable out of the general revenue fund of the county.\nMS 1980 [Repealed, 1Sp1981 c 4 art 1 s 189]",
	"repealed": false
}