{
	"id": "148E.0751",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.0751",
	"title": "148E.0751 TEMPORARY LEAVE LICENSE STATUS.",
	"text": "(a) At the time of license renewal, a licensee may apply for temporary leave license status by:\n(1) submitting a completed, signed application on a form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(2) paying the fee specified in section 148E.180; and\n(3) demonstrating to the satisfaction of the board that the licensee is not engaged in the practice of social work as defined in section 148E.010, subdivisions 6 and 11, in any setting, including settings in which social workers are exempt from licensure according to section 148E.065.\n(b) By submitting an application for temporary leave license status, an applicant authorizes the board to:\n(1) investigate any information provided or requested in the application. The board may request that the applicant provide additional information, verification, or documentation;\n(2) determine if the applicant has met the continuing education requirements specified in sections 148E.130 to 148E.145; and\n(3) determine whether the applicant has met the supervision requirements specified in sections 148E.100 to 148E.125.\n(c) An application that the applicant has not completed and signed, or that is not accompanied by the correct fee, is void. The board must return the application to the applicant, along with any fee.\n(a) A temporary leave license status may not exceed four consecutive years. If a licensee fails to restore the license to active status according to section 148E.080, the license automatically expires at the end of the four-year term.\n(b) The board must send a notice to a licensee at least 45 days before the expiration date of the temporary leave license status. The board may send the renewal notice to the licensee's last known mailing address or electronically.\nA licensee with temporary leave license status may restore their license to active license status according to section 148E.080, including documenting required continuing education hours.\nA licensee who has temporary leave license status: (1) must not practice, attempt to practice, offer to practice, or advertise or hold out as being authorized to practice social work; and (2) must include \"temporary leave\" in any use of the license credential LSW, LGSW, LISW, or LICSW.\nThe board may resolve any pending complaints against a licensee before approving an application for temporary leave license status specified in this section. The board may take action according to sections 148E.255 to 148E.290 against a licensee who has temporary leave license status specified in this section based on conduct occurring before the temporary leave license status or conduct occurring while the license is in temporary leave license status.",
	"repealed": false
}