{
	"id": "327.742",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.742",
	"title": "327.742 SMOKING IN DESIGNATED NONSMOKING ROOMS.",
	"text": "No person shall smoke cigarettes, cigars, pipes, or other smoking material in a hotel sleeping room designated nonsmoking.\nA person who violates this section is guilty of a petty misdemeanor. Upon conviction, the court may require a person who violates this section to reimburse the innkeeper for actual costs incurred to restore the room to its previolation condition.\nUnless a court orders reimbursement under subdivision 2, a person who violates this section is liable to the innkeeper for the cost of restoring the damaged room to its previolation condition and a service charge of $30. The service charge may be imposed immediately upon the mailing of the notice required under subdivision 4, if the notice of the charge was displayed according to subdivision 3. If the person does not reimburse the innkeeper within 30 days after the innkeeper has mailed notice under subdivision 4, the innkeeper may seek a civil judgment for the cost of restoring the room to previolation condition, the service charge, and a civil penalty not to exceed $100. If the innkeeper prevails, the court shall order payment of:\n(1) interest at the legal rate for judgments under section 549.09 from the date of nonpayment; and\n(2) reasonable attorney fees, not to exceed $500.\nA court may not impose a civil penalty under 30 days after the mailing of the notice under subdivision 4.\nInnkeepers shall post signs conspicuously in all nonsmoking sleeping rooms stating that smoking is not permitted and advising occupants of the provisions of this section including the innkeepers' right to seek reimbursement and to impose a civil penalty and service charge.\nNotice of nonpayment that includes a citation to this section and a description of the penalties contained in it must be sent by the innkeeper to the violating party by regular mail, supported by an affidavit of service by mailing, to the address the person provided to the innkeeper. Failure of the person to receive a notice of damage is not a defense to liability under this section. The notice must include a statement that additional civil penalties will be imposed if payment is not received within 30 days. Only one service charge may be imposed under this subdivision for each incident.\nIf, within the 30-day period under subdivision 2a, the violating party sends written notice to the innkeeper disputing the innkeeper's claim that the person smoked in a nonsmoking room, the innkeeper may collect the cost of restoring the room to previolation condition and the civil penalties imposed by this section only under a judgment rendered by a court of competent jurisdiction. Upon receipt of notice of dispute, the innkeeper shall cease all collection efforts.\nCivil liability under this section does not preclude criminal liability under subdivision 2.",
	"repealed": false
}