{
	"id": "375.194",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.194",
	"title": "375.194 ECONOMIC DEVELOPMENT TAX ABATEMENT.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"Eligible county\" means a county whose county government average tax rate is at least 45 points higher than an adjacent neighboring county's county government average tax rate in the initial year that the tax abatement is granted on the eligible property. An eligible county cannot be one of the seven metropolitan counties under section 473.121, subdivision 4.\n(b) \"Neighboring county\" means a county whose average county government tax rate is at least 45 points lower than the average county government tax rate of an adjacent county that is an eligible county, in the initial year that the tax abatement is granted.\n(c) \"Eligible property\" means property located in an eligible county within 20 miles of the neighboring county and is either (i) commercial property classified under section 273.13, subdivision 24, whose estimated market value has increased by at least $400,000 from improvements made on that property by the taxpayer after January 2, 1996, or (ii) industrial property classified under section 273.13, subdivision 24, whose estimated market value has increased by at least $100,000 from improvements made on that property by the taxpayer after January 2, 1996.\n(d) \"Improvements\" means (i) new construction, and (ii) rehabilitation, reconstruction, and additions to existing structures.\n(e) \"Maximum tax abatement\" for any given year means the difference between (i) the eligible county's current year county government tax rate times the net tax capacity of the eligible property, and (ii) the neighboring county's current year county government tax rate times the net tax capacity of the eligible property.\n(f) \"Taxpayer\" means the person who is responsible for payment of the property tax, including a lessee who pays the taxes on the eligible property.\nThe county board of an eligible county may enter into a written agreement with the taxpayer of eligible property to grant a property tax abatement to the taxpayer. The agreement must specify the percentage of the maximum tax abatement to be granted for each of the designated tax abatement years. The agreement must not provide a property tax abatement for any given year that exceeds the maximum tax abatement under subdivision 1, paragraph (e). The maximum length of the agreement is ten years. Even if the difference in the two county average tax rates in any given year is less than the required 45-point minimum, the agreement shall remain in effect for its duration. The agreement is binding unless both the eligible county's county board and the taxpayer mutually agree upon any changes in the agreement.\nThe actual tax abatement shall be computed annually by the county auditor of the county in which the eligible property is located using (i) the difference between the eligible county's current year average county government tax rate and the neighboring county's current year average county government tax rate, and (ii) the percentage of the maximum tax abatement specified in the agreement.\nIf the improvements are made over two calendar years, the county board is allowed to grant the initial tax abatement based on improvements of less than the $100,000 estimated market value for industrial property and $400,000 estimated market value for commercial property, provided that the county board has finalized the agreement and is reasonably assured that the minimum dollar requirements provided in subdivision 1 will be met over the two-year time period. However, the agreement's ten-year maximum time period begins with the year the first abatement is granted.\nFor purposes of determining the eligible property's taxes on the proposed property tax statement under section 275.065, the amount shown will be the amount before the deduction of the tax abatement under subdivision 3. The property taxes shown on the final property tax statement shall reflect both the taxes before and after the tax abatement granted under this section.\nThe eligible county's proposed and final tax rates shall be determined by dividing the certified levy by the total taxable net tax capacity, without regard to any abatements granted under this section.\nEligible property may be located in a tax increment financing district, provided that (i) the governing body of the municipality containing the district approves the written agreement under subdivision 2, and (ii) the county treasurer, when making property tax settlements of the property tax collected on eligible property, shall deduct the full amount of the tax abatement granted to the eligible property under this section from the property tax distribution made to the tax increment financing district.",
	"repealed": false
}