{
	"id": "93.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.47",
	"title": "93.47 DUTIES AND AUTHORITY OF COMMISSIONER.",
	"text": "The commissioner shall conduct a comprehensive study and survey in order to determine, consistent with the declared policy of sections 93.44 to 93.51, the extent to which regulation of mining areas is necessary in the interest of the general welfare.\n(a) In determining the extent and type of regulation required, the commissioner shall give due consideration to the effects of mining upon the following:\n(1) environment;\n(2) the future utilization of the land upon completion of mining; and\n(3) the wise utilization and protection of the natural resources including but not limited to the control of erosion, the prevention of land or rock slides, and air and water pollution.\n(b) The commissioner also shall give due consideration to:\n(1) the future and economic effect of such regulations upon the mine operators and landowners, the surrounding communities, and the state of Minnesota;\n(2) the effect upon employment in the state;\n(3) the effect upon the future mining and development of metallic minerals owned by the state of Minnesota and others, and the revenues received therefrom; and\n(4) the practical problems of the mine operators and mineral owners including, but not limited to, slope gradients as achieved by good mining or soil stabilization practices.\nUpon completion of the study and survey and consistent with the declared policy of sections 93.44 to 93.51, the commissioner, pursuant to chapter 14, may adopt rules pertaining to that portion of mining operations conducted subsequent to the effective date of such rules and subject to the provisions of any rights existing pursuant to any permit, license, lease or other valid existing authorization issued by the commissioner, the Pollution Control Agency or any other governmental entity, or their predecessors in office, and subject to any applicable mine safety laws or rules now existing or hereafter adopted, in regard to the following: (1) mine-waste disposal, (2) mining areas, including but not limited to plant facilities and equipment, and (3) permits to mine, as required by section 93.481. To the greatest extent possible, within the authority possessed by the commissioner, the rules so promulgated shall substantially comply with or exceed any minimum mine land reclamation requirements which may be established pursuant to a federal mine land reclamation act. The rules so promulgated also shall conform with any state and local land use planning program; provided further the commissioner shall develop procedures that will identify areas or types of areas which, if mined, cannot be reclaimed with existing techniques to satisfy the rules promulgated under this subdivision, and the commissioner will not issue permits to mine such areas until the commissioner determines technology is available to satisfy the rules so promulgated.\nThe commissioner shall administer and enforce sections 93.44 to 93.51 and the rules adopted pursuant hereto. In so doing the commissioner may:\n(1) conduct such investigations and inspections as the commissioner deems necessary for the proper administration of sections 93.44 to 93.51;\n(2) enter upon any parts of the mining areas in connection with any such investigation and inspection without liability to the operator or landowner provided that reasonable prior notice of intention to do so shall have been given the operator or landowner;\n(3) conduct such research or enter into contracts related to mining areas and the reclamation thereof as may be necessary to carry out the provisions of sections 93.46 to 93.50; and\n(4) allocate surplus wetland credits that are approved by the commissioner under a permit to mine on or after July 1, 1991, and that are not otherwise deposited in a state wetland bank.\nFor the purpose of information and to assist the commissioner in the proper enforcement of the rules promulgated under sections 93.44 to 93.51, each operator shall within 120 days of May 28, 1969, file with the commissioner a plan map in such form as shall be determined by the commissioner showing all existing mining areas or areas subjected to mining by said operator. Annually thereafter, on or before the 15th day of March, and until the operator's reclamation or restoration plan is approved pursuant to section 93.481, the operator shall file a plan map in similar form showing any changes made during the preceding calendar year and the mining area which it is anticipated will be subjected to mining during the current calendar year. After approval of a permit to mine, the commissioner may periodically at such times as the commissioner deems necessary require additional reclamation or restoration information or plans from the operator.",
	"repealed": false
}