{
	"id": "178.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/178.03",
	"title": "178.03 DIVISION OF APPRENTICESHIP.",
	"text": "There is established a Division of Apprenticeship in the Department of Labor and Industry. This division shall be administered by a director, and be under the supervision of the commissioner.\n[Repealed, 2014 c 305 s 32]\n(a) The division shall be administered as prescribed by this chapter and in accordance with Code of Federal Regulations, title 29, part 29; to promote equal employment opportunity in apprenticeship and other on-the-job learning and to establish a Minnesota plan for equal employment opportunity in apprenticeship which shall be consistent with standards established under Code of Federal Regulations, title 29, part 30, as amended.\n(b) The division shall have the authority to make wage determinations applicable to the graduated schedule of wages and journeyworker wage rate for apprenticeship agreements, giving consideration to the existing wage rates prevailing throughout the state, except that no wage determination by the director shall alter an existing wage provision for apprentices or journeyworkers that is contained in a bargaining agreement in effect between an employer and an organization of employees, nor shall the director make any determination for the beginning rate for an apprentice that is below the wage minimum established by federal or state law.\n(c) The division shall:\n(1) issue certificates of registration to sponsors of approved apprenticeship programs;\n(2) approve apprenticeship agreements if the division determines that approval is in the best interest of the apprentice and the agreement meets the standards established in this chapter;\n(3) terminate any apprenticeship agreement according to the provisions of the agreement and this chapter;\n(4) maintain a record of apprenticeship agreements and their disposition;\n(5) issue certificates of completion of apprentices; and\n(6) perform other duties as the commissioner deems necessary to carry out the intent of this chapter.\nThe commissioner, if requested by a program sponsor, shall grant reciprocity approval to apprentices, apprenticeship programs, and standards that are registered in other states. Program sponsors seeking reciprocal approval must meet the requirements of this chapter including the wage and hour provisions and apprentice ratio standards.\n[Repealed, 1987 c 403 art 2 s 164]",
	"repealed": false
}