{
	"id": "353.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.30",
	"title": "353.30 ANNUITIES UPON RETIREMENT.",
	"text": "[Repealed, 2007 c 134 art 2 s 50]\nUpon termination of public service under section 353.01, subdivision 11a, a person who first became a public employee or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, and whose attained age plus credited allowable service totals 90 years is entitled upon application to a retirement annuity in an amount equal to the applicable normal annuity provided in section 353.29, subdivision 3, paragraph (a); section 353.651, subdivision 3; or section 353E.04, subdivision 3. Such annuity is not subject to a reduction for early retirement.\nUpon termination of public service under section 353.01, subdivision 11a, a person who first became a public employee or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, and has 30 years or more of allowable service credit, and who elects to retire prior to normal retirement age, shall receive an annuity in an amount equal to the normal annuity provided under section 353.29, subdivision 3, paragraph (a), reduced by one-quarter of one percent for each month that the member is under age 62 at the time of retirement.\nUpon termination of public service under section 353.01, subdivision 11a, a person who first became a public employee or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, and is at least 55 years old but is younger than normal retirement age, and who is vested under section 353.01, subdivision 47, is entitled, upon application, to a retirement annuity in an amount equal to the applicable normal annuity provided in section 353.29, subdivision 3, paragraph (a). Such annuity must be reduced by one-quarter of one percent for each month that the member is under normal retirement age at the time of retirement.\n[Repealed, 1971 c 106 s 40]\n(a) The board of trustees shall establish optional annuities which shall take the form of a joint and survivor annuity. Except as provided in subdivision 3a, the optional annuity forms shall be actuarially equivalent to the forms provided in section 353.29 and subdivisions 1, 1a, 1b, 1c, and 5. In establishing those optional forms, the board shall obtain the written recommendation of the actuary retained under section 356.214. The recommendations shall be a part of the permanent records of the board. A member or former member may select an optional form of annuity, subject to the provisions of section 356.46, in lieu of accepting any other form of annuity which might otherwise be available.\n(b) For purposes of computing a joint and survivor annuity, the investment return assumption specified in section 356.461 must be used rather than the investment return specified in section 356.215, subdivision 8.\n(a) If a former member or disabilitant selects a joint and survivor annuity option under subdivision 3 after June 30, 1989, the former member or disabilitant must receive a normal single life annuity if the designated optional annuity beneficiary dies before the former member or disabilitant. Under this option, no reduction may be made in the person's annuity to provide for restoration of the normal single life annuity in the event of the death of the designated optional annuity beneficiary.\n(b) The annuity adjustment specified in paragraph (a) also applies to joint and survivor annuity options under subdivision 3 elected before July 1, 1989. The annuity adjustment under this paragraph occurs on July 1, 1989, or on the first day of the first month following the death of the designated optional annuity beneficiary, whichever is later. This paragraph may not be interpreted as authorizing retroactive payments.\n(a) The board of trustees must provide a joint and survivor annuity option to members of the police and fire fund. If a joint and survivor annuity is elected on or after July 1, 1989, the former member or disabilitant must receive a normal single life annuity if the designated optional annuity beneficiary dies before the former member or disabilitant. Under this option, no reduction may be made in the person's annuity to provide for restoration of the normal single life annuity in the event of the death of the designated optional annuity beneficiary.\n(b) The annuity adjustment specified in paragraph (a) also applies to joint and survivor annuity options under subdivision 3 elected before July 1, 1989. The annuity adjustment under this paragraph occurs on July 1, 1989, or on the first day of the first month following the death of the designated optional annuity beneficiary, whichever is later. This paragraph may not be interpreted as authorizing retroactive payments.\nIn the event of the death of the designated optional annuity beneficiary before the retired employee or disabilitant, the restoration of the normal single life annuity under subdivision 3a or 3b will take effect on the first of the month following the date of death of the designated optional annuity beneficiary or up to five months before the first of the month in which satisfactory verification of the death is established by the executive director, whichever date is later.\nMS 2018 [Repealed, 2020 c 108 art 6 s 17]\n(a) This subdivision applies to a member who has become at least 55 years old and first became a public employee after June 30, 1989, and to any other member who has become at least 55 years old and whose annuity is higher when calculated under section 353.29, subdivision 3, paragraph (b), in conjunction with this subdivision than when calculated under section 353.29, subdivision 3, paragraph (a), in conjunction with subdivision 1, 1a, 1b, or 1c. An employee who retires before normal retirement age shall be paid the retirement annuity provided in section 353.29, subdivision 3, paragraph (b), reduced as described in paragraph (b) or (c), as applicable.\n(b) For members who begin to receive an annuity on or after July 1, 2019, the reduced annuity is the actuarial equivalent of the annuity that would be payable to the employee if the employee deferred receipt of the annuity until normal retirement age and the annuity amount were augmented at the applicable annual rate, compounded annually, from the annuity starting date until normal retirement age. The applicable annual rate is the rate in effect on the employee's effective date of retirement and shall be considered as fixed for the employee for the period until the employee reaches normal retirement age. The applicable annual rates are the following:\n(1) until June 30, 2019, three percent if the employee became an employee before July 1, 2006, and 2.5 percent if the employee became an employee after June 30, 2006;\n(2) beginning July 1, 2019, through June 30, 2024, a rate that changes each month, on the first day of the month, starting with the rate in clause (1), as applicable to the employee, and reducing the rate to zero in equal monthly increments over the five-year period; and\n(3) after June 30, 2024, zero percent.\nAfter June 30, 2024, actuarial equivalent, for the purpose of determining the reduced annuity commencing before normal retirement age under this paragraph, shall not take into account any augmentation.\n(c) For members who begin to receive an annuity before July 1, 2019, the reduced annuity is the actuarial equivalent of the annuity that would be payable to the employee if the employee deferred receipt of the annuity until normal retirement age and the annuity amount were augmented at an annual rate of three percent, compounded annually, from the annuity starting date until normal retirement age if the employee became an employee before July 1, 2006, and at 2.5 percent, compounded annually, from the annuity starting date until normal retirement age if the employee became an employee after June 30, 2006.",
	"repealed": false
}