{
	"id": "181.961",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.961",
	"title": "181.961 REVIEW OF PERSONNEL RECORD BY EMPLOYEE.",
	"text": "Upon written request by an employee, the employer shall provide the employee with an opportunity to review the employee's personnel record. An employer is not required to provide an employee with an opportunity to review the employee's personnel record if the employee has reviewed the personnel record during the previous six months; except that, upon separation from employment, an employee may review the employee's personnel record once each year after separation for as long as the personnel record is maintained.\n(a) The employer shall comply with a written request pursuant to subdivision 1 no later than seven working days after receipt of the request if the personnel record is located in this state, or no later than 14 working days after receipt of the request if the personnel record is located outside this state.\n(b) With respect to current employees, the personnel record or an accurate copy must be made available for review by the employee during the employer's normal hours of operation at the employee's place of employment or other reasonably nearby location, but need not be made available during the employee's working hours. The employer may require that the review be made in the presence of the employer or the employer's designee. After the review and upon the employee's written request, the employer shall provide a copy of the record to the employee.\n(c) With respect to employees who are separated from employment, upon the employee's written request, the employer shall provide a copy of the personnel record to the employee. Providing a copy of the employee's personnel record to the employee satisfies the employer's responsibility to allow review as stated in subdivision 1.\n(d) The employer may not charge a fee for the copy.\nThe employer may deny the employee the right to review the employee's personnel record if the employee's request to review is not made in good faith. The burden of proof that the request to review is not made in good faith is on the employer.\nFor the purposes of this section, \"employer\" includes a person who has one or more employees.",
	"repealed": false
}