{
	"id": "161.202",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.202",
	"title": "161.202 REPLACEMENT OF PUBLIC LANDS.",
	"text": "For the purposes of this section the following terms shall have the meanings ascribed to them:\n(a) \"Public lands\" means any lands, except streets, roads, or bridges owned by any subdivision of government, including but not limited to, the property of school districts, however organized, towns, cities, municipalities, counties, and any board or commission of any thereof, and public corporations created by the laws of this state.\n(b) \"Affected agency\" means any governing body of any subdivision of government which owns public lands, and shall include any agency, board, or commission charged with the administration of such lands.\n(c) \"Cost of replacement\" means the amount paid by any affected agency to purchase and develop lands to replace public lands acquired for the purpose of constructing or improving trunk highways.\nWhenever it has been determined that the commissioner of transportation is to acquire any public lands for the construction or improvement of a federally aided state trunk highway, including urban extensions thereof, the commissioner may, and in the case of parks shall, upon the request of the affected agency, authorize the affected agency to replace the same within a reasonable time by gift, purchase, or condemnation if granted the power of eminent domain by law. The replacement lands to be acquired by the affected agency shall be designated in an agreement entered into between any affected agencies and the commissioner. Such replacement lands shall be a functional replacement which shall consist of but not be limited to land substantially equal in acreage, use, interest, or estate in the lands to be acquired from the affected agency. If the parties are unable to agree on the designation of the replacement lands, the parties may agree to submit to an arbiter or the district court the issue of which replacement lands proposed by the parties is a functional replacement for the lands to be acquired from the affected agency. After the completion of the acquisition of the replacement lands by the affected agency the cost of replacement shall be ascertained and paid by the state from any funds available for the acquisition of lands.\nThe commissioner of transportation may enter into agreements with an affected agency for the replacement of public lands providing for the payment by the state of a lump sum based on the estimated cost of replacement when the lump sum so agreed upon, which shall be irrevocable, does not exceed $50,000.\nWhen the affected agency is unable to acquire the replacement lands, or if the acquisition of such lands by the affected agency would result in undue delay in the completion of the highway project, upon a request of an affected agency which shall include a recommendation as to the replacement land to be acquired within its jurisdiction, the commissioner of transportation by gift, purchase, or condemnation proceedings, may acquire the designated replacement lands if the commissioner deems that the acquisition would reduce the cost to the state of the highway project and would otherwise be in the public interest. The affected agency shall relinquish to the commissioner its interests in the lands required for the highway project upon its completion of the acquisition of the replacement lands or upon conveyance by the commissioner to the affected agency of the replacement lands designated in the agreement between the affected agency and the commissioner. The commissioner shall convey the lands or interests designated in the agreement to the affected agency.\nThe affected agency, unless otherwise provided for in the agreement, by the acceptance of the replacement lands, shall not be deemed to have waived its right to compensation for the total of the damage to improvements.",
	"repealed": false
}