{
	"id": "256B.0941",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0941",
	"title": "256B.0941 PSYCHIATRIC RESIDENTIAL TREATMENT FACILITY FOR PERSONS YOUNGER THAN 21 YEARS OF AGE.",
	"text": "(a) An individual who is eligible for mental health treatment services in a psychiatric residential treatment facility must meet all of the following criteria:\n(1) before admission, services are determined to be medically necessary according to Code of Federal Regulations, title 42, section 441.152;\n(2) is younger than 21 years of age at the time of admission. Services may continue until the individual meets criteria for discharge or reaches 22 years of age, whichever occurs first;\n(3) has a mental health diagnosis as defined in the most recent edition of the Diagnostic and Statistical Manual for Mental Disorders, as well as clinical evidence of severe aggression, or a finding that the individual is a risk to self or others;\n(4) has functional impairment and a history of difficulty in functioning safely and successfully in the community, school, home, or job; an inability to adequately care for one's physical needs; or caregivers, guardians, or family members who are unable to safely fulfill the individual's needs;\n(5) requires psychiatric residential treatment under the direction of a physician to improve the individual's condition or prevent further regression so that services will no longer be needed;\n(6) utilized and exhausted other community-based mental health services, or clinical evidence indicates that such services cannot provide the level of care needed; and\n(7) was referred for treatment in a psychiatric residential treatment facility by a mental health professional qualified according to section 245I.04, subdivision 2.\n(b) The commissioner shall provide oversight and review the use of referrals for clients admitted to psychiatric residential treatment facilities to ensure that eligibility criteria, clinical services, and treatment planning reflect clinical, state, and federal standards for psychiatric residential treatment facility level of care. The commissioner shall coordinate the production of a statewide list of children and youth who meet the medical necessity criteria for psychiatric residential treatment facility level of care and who are awaiting admission. The commissioner and any recipient of the list shall not use the statewide list to direct admission of children and youth to specific facilities.\nPsychiatric residential treatment facility service providers must offer and have the capacity to provide the following services:\n(1) development of the individual plan of care, review of the individual plan of care every 30 days, and discharge planning by required members of the treatment team according to Code of Federal Regulations, title 42, sections 441.155 to 441.156;\n(2) any services provided by a psychiatrist or physician for development of an individual plan of care, conducting a review of the individual plan of care every 30 days, and discharge planning by required members of the treatment team according to Code of Federal Regulations, title 42, sections 441.155 to 441.156;\n(3) active treatment seven days per week that may include individual, family, or group therapy as determined by the individual care plan;\n(4) individual therapy, provided a minimum of twice per week;\n(5) family engagement activities, provided a minimum of once per week;\n(6) consultation with other professionals, including case managers, primary care professionals, community-based mental health providers, school staff, or other support planners;\n(7) coordination of educational services between local and resident school districts and the facility;\n(8) 24-hour nursing; and\n(9) direct care and supervision, supportive services for daily living and safety, and positive behavior management.\nDuring normal sleeping hours, a psychiatric residential treatment facility provider must provide at least one staff person for every six residents present within a living unit. A provider must adjust sleeping-hour staffing levels based on the clinical needs of the residents in the facility. Sleeping hours must include at least one staff trained and certified to provide emergency medical response. During normal sleeping hours, a registered nurse must be available on call to assess a child's needs and must be available within 60 minutes.\nRelated services that have a bright-line separation from psychiatric residential treatment facility service operations may be delivered in the same facility, including under the same structural roof. In shared site settings, staff must provide services only to programs they are affiliated to through NETStudy 2.0.\n(a) The commissioner must establish one per diem rate per provider for psychiatric residential treatment facility services for individuals 21 years of age or younger. The rate for a provider must not exceed the rate charged by that provider for the same service to other payers. Payment must not be made to more than one entity for each individual for services provided under this section on a given day. The commissioner must set rates prospectively for the annual rate period. The commissioner must require providers to submit annual cost reports on a uniform cost reporting form and must use submitted cost reports to inform the rate-setting process. The cost reporting must be done according to federal requirements for Medicare cost reports.\n(b) The following are included in the rate:\n(1) costs necessary for licensure and accreditation, meeting all staffing standards for participation, meeting all service standards for participation, meeting all requirements for active treatment, maintaining medical records, conducting utilization review, meeting inspection of care, and discharge planning. The direct services costs must be determined using the actual cost of salaries, benefits, payroll taxes, and training of direct services staff and service-related transportation; and\n(2) payment for room and board provided by facilities meeting all accreditation and licensing requirements for participation.\n(c) A facility may submit a claim for payment outside of the per diem for professional services arranged by and provided at the facility by an appropriately licensed professional who is enrolled as a provider with Minnesota health care programs. Arranged services may be billed by either the facility or the licensed professional. These services must be included in the individual plan of care and are subject to prior authorization.\n(d) Medicaid must reimburse for concurrent services as approved by the commissioner to support continuity of care and successful discharge from the facility. \"Concurrent services\" means services provided by another entity or provider while the individual is admitted to a psychiatric residential treatment facility. Payment for concurrent services may be limited and these services are subject to prior authorization by the state's medical review agent. Concurrent services may include targeted case management, assertive community treatment, clinical care consultation, team consultation, and treatment planning.\n(e) Payment rates under this subdivision must not include the costs of providing the following services:\n(1) educational services;\n(2) acute medical care or specialty services for other medical conditions;\n(3) dental services; and\n(4) pharmacy drug costs.\n(f) For purposes of this section, \"actual cost\" means costs that are allowable, allocable, reasonable, and consistent with federal reimbursement requirements in Code of Federal Regulations, title 48, chapter 1, part 31, relating to for-profit entities, and the Office of Management and Budget Circular Number A-122, relating to nonprofit entities.\n(g) The commissioner shall annually adjust psychiatric residential treatment facility services per diem rates to reflect the change in the Centers for Medicare and Medicaid Services Inpatient Psychiatric Facility Market Basket. The commissioner shall use the indices as forecasted for the midpoint of the prior rate year to the midpoint of the current rate year.\n[See Note.]\n(a) Medical assistance covers therapeutic and hospital leave days, provided the recipient was not discharged from the psychiatric residential treatment facility and is expected to return to the psychiatric residential treatment facility. A reserved bed must be held for a recipient on hospital leave or therapeutic leave.\n(b) A therapeutic leave day to home shall be used to prepare for discharge and reintegration and shall be included in the individual plan of care. The state shall reimburse 75 percent of the per diem rate for a reserve bed day while the recipient is on therapeutic leave. A therapeutic leave visit may not exceed three days without prior authorization.\n(c) A hospital leave day shall be a day for which a recipient has been admitted to a hospital for medical or acute psychiatric care and is temporarily absent from the psychiatric residential treatment facility. The state shall reimburse 50 percent of the per diem rate for a reserve bed day while the recipient is receiving medical or psychiatric care in a hospital.\n(a) The commissioner shall establish start-up and capacity-building grants for psychiatric residential treatment facility sites. Start-up grants to prospective psychiatric residential treatment facility sites may be used for:\n(1) administrative expenses;\n(2) consulting services;\n(3) Health Insurance Portability and Accountability Act of 1996 compliance;\n(4) therapeutic resources, including evidence-based, culturally appropriate curriculums and training programs for staff and clients;\n(5) allowable physical renovations to the property; and\n(6) emergency workforce shortage uses, as determined by the commissioner.\n(b) Start-up and capacity-building grants to prospective and current psychiatric residential treatment facilities may be used to support providers who treat and accept individuals with complex support needs, including but not limited to:\n(1) neurocognitive disorders;\n(2) co-occurring intellectual developmental disabilities;\n(3) schizophrenia spectrum disorders;\n(4) manifested or labeled aggressive behaviors; and\n(5) manifested sexually inappropriate behaviors.",
	"repealed": false
}