{
	"id": "218.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/218.041",
	"title": "218.041 DUTIES OF COMMISSIONER.",
	"text": "[Repealed, 2014 c 227 art 1 s 23]\n[Repealed, 2014 c 227 art 1 s 23]\n[Repealed, 1Sp1981 c 4 art 2 s 24]\n(a) The commissioner shall, upon petition, direct the repair, reconstruction, or replacement of any inadequate or unsafe trackage, structure or facility.\n(b) Upon receipt of a petition for action pursuant to this subdivision the commissioner shall give notice to all persons known to the commissioner to have an interest in the matter and publish notice of the petition in the State Register. The commissioner may grant the petition 30 days after notice has been fully made. If the commissioner receives a written objection to the petition from any person within 20 days after the notice of filing has been fully made, the exemption must be granted or denied only after a contested case hearing has been held on the matter. The commissioner may elect to hold a contested case hearing if no objections to the petition or application are received. If a timely objection is not received and the commissioner declines to act without a hearing, the petitioner may request within 30 days of receiving a notice of denial, and must be granted, a contested case hearing on the application.\nThe commissioner shall:\n(1) investigate and determine whether any common carriers are granting rebates or, in any other particular, failing to comply with laws or with orders, rules, or directives of the commissioner; and\n(2) institute and prosecute all actions and proceedings in the appropriate courts for the enforcement of this chapter; the orders, rules, and directives of the commissioner issued under this chapter; and any violations thereof.\nIn the exercise of powers granted in this chapter, the commissioner may:\n(1) subpoena books, papers, or accounts kept by any regulated business within or without the state, or compel production of verified copies;\n(2) prepare all forms or blanks for obtaining information that the commissioner may deem necessary or useful for the proper exercise of the authority and duties of the commissioner in connection with regulated businesses, and prescribe the time and manner within which the blanks and forms must be completed and filed;\n(3) inspect, at all reasonable times, and copy the books, records, memoranda, correspondence, or other documents and records of any business under the commissioner's jurisdiction;\n(4) examine, under oath, any officer, agent, or employee of a business under the commissioner's jurisdiction concerning any matter within the commissioner's jurisdiction; and\n(5) assess common carriers, administer the state rail safety inspection account, and perform other duties on behalf of the state rail safety inspector under section 219.015.\n[Repealed, 2014 c 227 art 1 s 23]\nThe commissioner, as appropriate, may take action to promulgate rules in areas including, but not limited to the following: rates, routes, depots, schedules, quality of service, and safety requirements relating to intrastate rail passenger service.",
	"repealed": false
}