{
	"id": "59C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/59C.05",
	"title": "59C.05 FINANCIAL RESPONSIBILITY.",
	"text": "No vehicle protection product may be sold, or offered for sale in this state unless the warrantor meets either the requirements of subdivision 2 or 3 in order to ensure adequate performance under the warranty. No other financial security requirements or financial standards for warrantors is required.\nThe vehicle protection product warrantor shall be insured under a warranty reimbursement insurance policy issued by an insurer authorized to do business in this state which provides that:\n(1) the insurer will pay to, or on behalf of the warrantor, 100 percent of all sums that the warrantor is legally obligated to pay according to the warrantor's contractual obligations under the warrantor's vehicle protection product warranty;\n(2) a true and correct copy of the warranty reimbursement insurance policy has been filed with the commissioner by the warrantor; and\n(3) the policy contains the provision required in section 59C.06.\n(1) The vehicle protection product warrantor, or its parent company in accordance with clause (2), shall maintain a net worth or stockholders' equity of $50,000,000; and\n(2) the warrantor shall provide the commissioner with a copy of the warrantor's or the warrantor's parent company's most recent Form 10-K or Form 20-F filed with the Securities and Exchange Commission within the last calendar year or, if the warrantor does not file with the Securities and Exchange Commission, a copy of the warrantor or the warrantor's parent company's audited financial statements that shows a net worth of the warrantor or its parent company of at least $50,000,000. If the warrantor's parent company's Form 10-K, Form 20-F, or audited financial statements are filed to meet the warrantor's financial stability requirement, then the parent company shall agree to guarantee the obligations of the warrantor relating to warranties issued by the warrantor in this state. The financial information provided to the commissioner under this clause is trade secret information for purposes of section 13.37.",
	"repealed": false
}