{
	"id": "209.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/209.07",
	"title": "209.07 RESULTS OF CONTEST.",
	"text": "If a nomination is contested, the court shall decide which candidate, if any, was nominated and is entitled to be named in print on the official ballots. When the court decides an election contest for any office other than state senator or state representative, and the time for appeal has expired or, in case of an appeal, if the contestant succeeds in the contest, the court may invalidate and revoke any election certificate which has been issued to the contestee. If the contest involved an error in the counting of ballots, the official authorized to issue the certificate of election shall issue the certificate to the person entitled to it, but if a contestant succeeds in a contest where there is no question as to which of the candidates received the highest number of votes cast at the election, the contestant is not, by reason of the disqualification of the contestee, entitled to the certificate of election.\nIn a contested election, if the court decides that a serious and material defect in the ballots used changed the outcome of the election for the contested office, the election must be declared invalid for that office.\nIf the contestee succeeds, costs of the contest must be paid by the contestant. If the contestant succeeds, costs of the contest must be paid by the contestee; except that if the contestee loses because of an error in the counting of ballots or canvass of the returns or because of any other irregularity in the election procedure, costs must be paid, in the discretion of the judge, by the election jurisdictions responsible for errors which resulted in the reversal of the prior results of the election.\nIf an election approving the issuance of bonds by a school district is contested, the contestant shall file in the district court a surety bond of at least $5,000 or a greater amount determined necessary by the court to provide security for costs of the contest to the school district, including any additional costs that may be incurred by the school district if the bond issue is delayed. The court may waive the requirements of this subdivision to the extent it finds that there is a reasonable likelihood that the contestant will prevail and that filing the bond would impose an undue hardship. If the surety bond is not filed within the time allowed by the court, the contest shall be dismissed with prejudice.",
	"repealed": false
}