{
	"id": "41B.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.045",
	"title": "41B.045 LIVESTOCK EXPANSION AND MODERNIZATION LOAN PROGRAM.",
	"text": "The authority may establish, adopt rules for, and implement a loan program to finance livestock expansions and modernizations in the state.\nThe authority may participate in a livestock expansion and modernization loan with an eligible lender to a livestock farmer who meets the requirements of section 41B.03, subdivision 1, clauses (1) and (2), and who are actively engaged in a livestock operation. A prospective borrower must have a total net worth, including assets and liabilities of the borrower's spouse and dependents, of less than $1,700,000 in 2017 and an amount in subsequent years which is adjusted for inflation by multiplying that amount by the cumulative inflation rate as determined by the United States All-Items Consumer Price Index.\nParticipation is limited to 45 percent of the principal amount of the loan or $625,000, whichever is less. The interest rates and repayment terms of the authority's participation interest may be different from the interest rates and repayment terms of the lender's retained portion of the loan.\nEach loan participation must be secured by a mortgage on real property and such other security as the authority may require.\nThe authority may impose a reasonable nonrefundable application fee for each application for a loan participation and an origination fee for each loan issued under the livestock expansion and modernization loan program. The origination fee initially shall be set at 1.5 percent and the application fee at $50. The authority may review the fees annually and make adjustments as necessary. The fees must be deposited in the state treasury and credited to the Rural Finance Authority administrative account established in section 41B.03.\nThe interest rate per annum on the livestock expansion and modernization loan participation must be at the rate of interest determined by the authority to be necessary to provide for the timely payment of principal and interest when due on bonds or other obligations of the authority issued under this chapter, to provide financing for loan participations made under the livestock expansion and modernization loan program, and to provide for reasonable and necessary costs of issuing, carrying, administering, and securing the bonds or notes and to pay the costs incurred and to be incurred by the authority in the implementation of the livestock expansion and modernization loan program.",
	"repealed": false
}