{
	"id": "120B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.02",
	"title": "120B.02 EDUCATIONAL EXPECTATIONS AND GRADUATION REQUIREMENTS FOR MINNESOTA'S STUDENTS.",
	"text": "(a) The legislature is committed to establishing rigorous academic standards for Minnesota's public school students. To that end, the commissioner shall adopt in rule statewide academic standards. The commissioner shall not prescribe in rule or otherwise the delivery system, classroom assessments, or form of instruction that school sites must use.\n(b) All commissioner actions regarding the rule must be premised on the following:\n(1) the rule is intended to raise academic expectations for students, teachers, and schools;\n(2) any state action regarding the rule must evidence consideration of school district autonomy; and\n(3) the Department of Education, with the assistance of school districts, must make available information about all state initiatives related to the rule to students and parents, teachers, and the general public in a timely format that is appropriate, comprehensive, and readily understandable.\n(c) The commissioner shall periodically review and report on the state's assessment process.\n(d) School districts are not required to adopt specific provisions of the federal School-to-Work programs.\n(a) To graduate from high school, students must demonstrate to their enrolling school district or school their satisfactory completion of the credit requirements under section 120B.024 and their understanding of academic standards. A school district must adopt graduation requirements that meet or exceed state graduation requirements established in law or rule.\n(b) Students ages 19 to 21 who have not yet graduated from a Minnesota high school and, but for their age, are otherwise eligible to participate in an adult basic education program may be admitted to an adult high school diploma program under section 124D.52, subdivisions 8 and 9.\nMS 2022 [Repealed, 2023 c 55 art 2 s 66]",
	"repealed": false
}