{
	"id": "609.911",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.911",
	"title": "609.911 CIVIL REMEDIES.",
	"text": "The prosecuting authority may institute civil proceedings in district court against a person seeking relief from conduct constituting a violation of section 609.903 or to prevent or restrain future violations. If the prosecuting authority proves the alleged violation by a preponderance of the evidence, and the court has made due provision for the rights of innocent persons, the court may:\n(1) order a defendant to divest an interest in an enterprise or in real property;\n(2) impose reasonable restrictions on the future activities or investments of a defendant, including prohibiting a defendant from engaging in the same type of endeavor as the enterprise in which the defendant was engaged in violation of section 609.903;\n(3) order the dissolution or reorganization of an enterprise;\n(4) order the suspension or revocation of a license, permit, or prior approval granted to an enterprise by a state agency; or\n(5) order the surrender of the charter of a corporation organized under Minnesota law, dissolution of an enterprise, or the revocation of a certificate authorizing a foreign corporation to conduct business in Minnesota, if the court finds that:\n(i) the board of directors or a managerial agent acting on behalf of the corporation, in conducting the affairs of the corporation, authorized or engaged in conduct prohibited by section 609.903; and\n(ii) the public interest in preventing future criminal conduct requires the action.\nIn a proceeding under this section, the court may grant injunctive relief.\nThe prosecuting authority may institute proceedings against an enterprise or an individual to recover a civil penalty. The penalty may be imposed in the discretion of the district court for conduct constituting a violation of section 609.903. The civil penalty may not exceed $1,000,000 less a fine imposed under section 609.903. Penalties collected under this section must be applied to the costs and expenses of investigation and prosecution, including costs of resources and personnel incurred in investigation and prosecution, and the balance, if any, to the state general fund.\nIf the district court issues an injunction, or grants other relief under this section, or the prosecuting authority otherwise substantially prevails, the prosecuting authority shall also recover reasonable attorney fees in the trial and appellate courts and costs of investigation and litigation reasonably incurred.\nPersonal service of process in a proceeding under this section may be made on any person outside of Minnesota if the person was a principal in any conduct constituting a violation of section 609.903 in this state. The person is deemed to have submitted to the jurisdiction of the courts of this state for the purposes of this section.",
	"repealed": false
}