{
	"id": "256B.4906",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.4906",
	"title": "256B.4906 SUBMINIMUM WAGES IN HOME AND COMMUNITY-BASED SERVICES REPORTING.",
	"text": "(a) A provider of home and community-based services for people with developmental disabilities under section 256B.092 or home and community-based services for people with disabilities under section 256B.49 that holds a credential listed in clause (1) or (2) as of August 1, 2023, must submit to the commissioner of human services data on individuals who are currently being paid subminimum wages or were being paid subminimum wages by the provider organization as of August 1, 2023:\n(1) a certificate through the United States Department of Labor under United States Code, title 29, section 214(c), of the Fair Labor Standards Act authorizing the payment of subminimum wages to workers with disabilities; or\n(2) a permit by the Minnesota Department of Labor and Industry under section 177.28.\n(b) The report required under paragraph (a) must include the following data about each individual being paid subminimum wages:\n(1) name;\n(2) date of birth;\n(3) identified race and ethnicity;\n(4) disability type;\n(5) key employment status measures as determined by the commissioner; and\n(6) key community-life engagement measures as determined by the commissioner.\n(c) The information in paragraph (b) must be submitted in a format determined by the commissioner.\n(d) A provider must submit the data required under this section annually on a date specified by the commissioner. The commissioner must give a provider at least 30 calendar days to submit the data following notice of the due date. If a provider fails to submit the requested data by the date specified by the commissioner, the commissioner may delay medical assistance reimbursement until the requested data is submitted.\n(e) Individually identifiable data submitted to the commissioner under this section are considered private data on individuals as defined by section 13.02, subdivision 12.\n(f) The commissioner must analyze data annually for tracking employment and community-life engagement outcomes.",
	"repealed": false
}