{
	"id": "204C.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.32",
	"title": "204C.32 CANVASS OF STATE PRIMARIES.",
	"text": "The county canvassing board shall meet at the county auditor's office on either the second or third day following the state primary. After taking the oath of office, the canvassing board shall publicly canvass the election returns delivered to the county auditor. The board shall complete the canvass by the third day following the state primary and shall promptly prepare and file with the county auditor a report that states:\n(a) the number of individuals voting at the election in the county, and in each precinct;\n(b) the number of individuals registering to vote on election day and the number of individuals registered before election day in each precinct;\n(c) for each major political party, the names of the candidates running for each partisan office and the number of votes received by each candidate in the county and in each precinct;\n(d) the names of the candidates of each major political party who are nominated; and\n(e) the number of votes received by each of the candidates for nonpartisan office in each precinct in the county and the names of the candidates nominated for nonpartisan office.\nUpon completion of the canvass, the county auditor shall mail or deliver a notice of nomination to each nominee for county office voted for only in that county. The county auditor shall transmit one of the certified copies of the county canvassing board report for state and federal offices to the secretary of state by express mail or similar service immediately upon conclusion of the county canvass. The secretary of state shall mail a notice of nomination to each nominee for state or federal office.\nThe State Canvassing Board shall meet at a public meeting space located in the Capitol complex area seven days after the state primary to canvass the certified copies of the county canvassing board reports received from the county auditors. Immediately after the canvassing board declares the results, the secretary of state shall certify the names of the nominees to the county auditors. The secretary of state shall mail to each nominee a notice of nomination.",
	"repealed": false
}