{
	"id": "72B.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/72B.135",
	"title": "72B.135 PUBLIC ADJUSTERS.",
	"text": "An insured who has entered into a contract with a public adjuster involving the business for which the person was licensed, has the right to cancel the contract within 72 hours after the contract has been signed. Cancellation is evidenced by the insured giving written notice of cancellation to the public adjuster at the address stated in the contract. Notice of cancellation, if given by mail, is effective upon deposit in a mailbox, properly addressed to the public adjuster and postage prepaid. Notice of cancellation need not take a particular form and is sufficient if it indicates, by any form of written expression, the intention of the insured not to be bound by the contract.\nBefore entering a contract referred to in subdivision 1, the public adjuster must:\n(1) furnish the insured with a statement in boldface type of a minimum size of ten points, in substantially the following form:\n\"You, the insured, may cancel this contract at any time within 72 hours after the contract has been signed between the insured and the public adjuster. See attached notice of cancellation form for an explanation of this right.\"; and\n(2) furnish each insured, a fully completed form in duplicate, captioned, \"NOTICE OF CANCELLATION,\" which shall be attached to the contract and easily detachable, and which shall contain in boldface type of a minimum size of ten points the following information and statements:\n\"NOTICE OF CANCELLATION\nIf you do not want to go forward with the contract with the public adjuster, you may cancel the contract by mailing or delivering a signed and dated copy of this cancellation notice or any other written notice to (Name of Public Adjuster), at (Address of Public Adjuster's Place of Business) not later than midnight of (Date). If you cancel, any payments made by you under the contract will be returned within ten business days following receipt by the public adjuster of your cancellation notice.\nWithin ten days after a contract referred to in subdivision 1 has been canceled, the public adjuster must tender to the insured any payments made by the insured and any note or other evidence of indebtedness. However, if the public adjuster has performed any emergency services within the 72-hour period, the public adjuster is entitled to compensation for such services. Emergency services shall mean the removal of water, boarding up a building, and reconnecting lights and heat.\nNo public adjuster shall:\n(1) pay money or give anything of value to a person in consideration of a direct or indirect referral of a client or potential client;\n(2) pay money or give anything of value to a person as an inducement to refer business or clients;\n(3) rebate to a client a part of a fee specified in an employment contract;\n(4) initiate contact with a prospective client between the hours of 8 p.m. and 8 a.m.;\n(5) split the fee received or pay money to a person for services rendered to a client unless the other person is also licensed as a public adjuster;\n(6) have an interest directly or indirectly in a construction firm, salvage firm, or appraisal firm. \"Firm\" includes a corporation, partnership, association, or individual firm;\n(7) in connection with the transaction of business as a public adjuster, make a willful or knowing misrepresentation of facts or advise a person on questions of law;\n(8) make willful or knowing false statements about an insurance company or its employees, agents, or representatives;\n(9) solicit employment of a client in connection with a loss that is the subject of an employment contract with another public adjuster;\n(10) represent both an insurer and insured simultaneously; or\n(11) advance money to a client pending the settlement of a loss where the amount would be included in a final settlement.\n(a) A public adjuster shall disclose in writing to the client any interest the public adjuster has in loss proceeds other than those acquired by the public adjuster's employment contract.\n(b) A public adjuster in soliciting a client for employment shall display a license and immediately inform the client that the adjuster does not represent an insurance company or insurance company adjusting firm. The adjuster shall inform the client that services are available for a fee to be paid by the client and shall give the client a card identifying the public adjuster. The public adjuster shall disclose in writing to the client the fee charged by the public adjuster.\n(a) A public adjuster shall maintain an office that contains the records of all documents pertaining to the settlement of the claim and files of all clients. The records must be available for inspection by an authorized examiner or employee of the Commerce Department. The records will be kept by the public adjuster for at least five years after the end of the contracted employment period.\n(b) An employment contract used by a public adjuster is valid only if signed by an insured and the property owner of the property involved, or an authorized agent or representative.",
	"repealed": false
}