{
	"id": "129C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/129C.10",
	"title": "129C.10 PERPICH CENTER FOR ARTS EDUCATION.",
	"text": "(a) The board of the Perpich Center for Arts Education shall consist of 16 persons, including the commissioner of education or a person designated by the commissioner of education who must serve as an ex officio member. The remaining 15 members of the board shall be appointed by the governor with the advice and consent of the senate. At least one member must be appointed from each congressional district.\n(b) All board members must complete board training requirements consistent with section 127A.19.\nThe membership terms, compensation, removal of members, and filling of vacancies shall be as provided for in section 15.0575. A member may serve not more than two consecutive terms.\n(a) The board has the powers necessary for the care, management, and control of the Perpich Center for Arts Education and any other school authorized in this chapter, and all their real and personal property. The powers shall include, but are not limited to, those listed in this subdivision.\n(b) The board may employ and discharge necessary employees, and contract for other services to ensure the efficient operation of the Center for Arts Education and any other school authorized in this chapter.\n(c) The board may receive and award grants. The board may establish a charitable foundation and accept, in trust or otherwise, any gift, grant, bequest, or devise for educational purposes and hold, manage, invest, and dispose of them and the proceeds and income of them according to the terms and conditions of the gift, grant, bequest, or devise and its acceptance. The board must adopt internal procedures to administer and monitor aids and grants.\n(d) The board may establish or coordinate evening, continuing education, extension, and summer programs for teachers and pupils.\n(e) The board may identify pupils who have artistic talent, either demonstrated or potential, in dance, literary arts, media arts, music, theater, and visual arts, or in more than one art form.\n(f) The board must educate pupils with artistic talent by providing:\n(1) an interdisciplinary academic and arts program for pupils in the 11th and 12th grades. The total number of pupils accepted under this clause and clause (2) shall not exceed 310;\n(2) additional instruction to pupils for a 13th grade. Pupils eligible for this instruction are those enrolled in 12th grade who need extra instruction and who apply to the board, or pupils enrolled in the 12th grade who do not meet learner outcomes established by the board;\n(3) intensive arts seminars for one or two weeks for pupils in grades 9 to 12;\n(4) summer arts institutes for pupils in grades 9 to 12;\n(5) artist mentor and extension programs in regional sites; and\n(6) teacher education programs for indirect curriculum delivery.\n(g) The board may determine the location for the Perpich Center for Arts Education and any additional facilities related to the center, including the authority to lease a temporary facility.\n(h) The board must plan for the enrollment of pupils on an equal basis from each congressional district.\n(i) The board may establish task forces as needed to advise the board on policies and issues. The task forces expire as provided in section 15.059, subdivision 6.\n(j) The board may request the commissioner of education for assistance and services.\n(k) The board may enter into contracts with other public and private agencies and institutions for residential and building maintenance services if it determines that these services could be provided more efficiently and less expensively by a contractor than by the board itself. The board may also enter into contracts with public or private agencies and institutions, school districts or combinations of school districts, or service cooperatives to provide supplemental educational instruction and services.\n(l) The board may provide or contract for services and programs by and for the Center for Arts Education, including a store, operating in connection with the center; theatrical events; and other programs and services that, in the determination of the board, serve the purposes of the center.\n(m) The board may provide for transportation of pupils to and from the Center for Arts Education for all or part of the school year, as the board considers advisable and subject to its rules. Notwithstanding any other law to the contrary, the board may charge a reasonable fee for transportation of pupils. Every driver providing transportation of pupils under this paragraph must possess all qualifications required by the commissioner of education. The board may contract for furnishing authorized transportation under rules established by the commissioner of education and may purchase and furnish gasoline to a contract carrier for use in the performance of a contract with the board for transportation of pupils to and from the Center for Arts Education. When transportation is provided, scheduling of routes, establishment of the location of bus stops, the manner and method of transportation, the control and discipline of pupils, and any other related matter is within the sole discretion, control, and management of the board.\n(n) The board may provide room and board for its pupils. If the board provides room and board, it shall charge a reasonable fee for the room and board. The fee is not subject to chapter 14 and is not a prohibited fee according to sections 123B.34 to 123B.39.\n(o) The board may establish and set fees for services and programs. If the board sets fees not authorized or prohibited by the Minnesota public school fee law, it may do so without complying with the requirements of section 123B.38.\n(p) The board may apply for all competitive grants administered by agencies of the state and other government or nongovernment sources.\nA center for arts education account is established in the special revenue fund in the state treasury. All money collected by the board, including rental income, must be deposited in the account. Money in the account, including interest earned, is appropriated to the board for the operation of its services and programs.\nA parent who disagrees with a board action that adversely affects the academic program of an enrolled pupil may appeal the board's action to the commissioner of education within 30 days of the board's action. The decision of the commissioner shall be binding on the board. The board must inform each pupil and parent at the time of enrolling of a parent's right to appeal a board action affecting the pupil's academic program.\n(a)(1) The board must appoint a director of the Center for Arts Education who shall serve in the unclassified service. The director must hold a Minnesota superintendent license.\n(2) The board must employ, upon recommendation of the director, a coordinator of resource programs who shall serve in the unclassified service.\n(3) The board must employ, upon recommendation of the director, up to six department chairs who shall serve in the unclassified service. The chairs shall be licensed teachers unless no licensure exists for the subject area or discipline for which the chair is hired.\n(4) The board may employ other necessary employees, upon recommendation of the director.\n(5) The board must employ, upon recommendation of the director, an executive secretary for the director, who shall serve in the unclassified service.\n(6) All persons employed as teachers must hold Minnesota teaching licenses in their respective fields or be approved by the Professional Educator Licensing and Standards Board.\n(b) The employees hired under this subdivision and other necessary employees hired by the board shall be state employees in the executive branch.\n(a) The board may adopt rules for admission to and discharge from the full-time programs for talented pupils, rules regarding discharge from the dormitory, and rules regarding the operation of the center, including transportation of its pupils. Rules covering admission are governed by chapter 14. Rules covering discharge from the full-time program for talented pupils must be consistent with sections 121A.40 to 121A.56, the Pupil Fair Dismissal Act. Rules covering discharge from the dormitory are not governed by the Pupil Fair Dismissal Act as set forth in sections 121A.40 to 121A.56. Rules regarding discharge and the operation of the center are not governed by chapter 14.\n(b) Proceedings concerning the full-time program for talented pupils, including admission, discharge, a pupil's program, and a pupil's progress, are governed by the rules adopted by the board and are not contested cases governed by chapter 14.\n[Repealed, 1991 c 265 art 11 s 26]\n[Repealed, 1Sp2017 c 5 art 5 s 15]\nPublic postsecondary institutions must provide space for programs offered by the Perpich Center for Arts Education at no cost or reasonable cost to the center to the extent that space is available at the public postsecondary institutions.\nTechnical educational equipment may be procured for programs of the Perpich Center for Arts Education by the board either by brand designation or in accordance with standards and specifications the board may adopt, notwithstanding chapters 16B and 16C.\nNotwithstanding section 120A.40, the Perpich Center for Arts Education may begin the school year any day prior to September 1.",
	"repealed": false
}