{
	"id": "216G.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/216G.02",
	"title": "216G.02 ROUTING OF CERTAIN PIPELINES.",
	"text": "(a) For purposes of this section, the following terms defined in this subdivision have the meanings given.\n(b) \"Gas\" means natural gas, flammable gas, carbon dioxide, gas that is toxic, or gas that is corrosive, regardless of whether the material has been compressed or cooled to a liquid or supercritical state.\n(c) \"Hazardous liquid\" means petroleum, petroleum products, anhydrous ammonia, or a substance included in the definition of hazardous liquid under Code of Federal Regulations, title 49, section 195.2, as amended.\n(d) Notwithstanding section 216G.01, subdivision 3, \"pipeline\" means:\n(1) pipe with a nominal diameter of six inches or more that is designed to transport hazardous liquids, but does not include pipe designed to transport a hazardous liquid by gravity, and pipe designed to transport or store a hazardous liquid within a refining, storage, or manufacturing facility; or\n(2) pipe designed to be operated at a pressure of more than 275 pounds per square inch and to carry gas.\nA person may not construct a pipeline without a pipeline routing permit issued by the Public Utilities Commission unless the pipeline is exempted from the commission's routing authority under this section or rules adopted under this section. A pipeline requiring a permit may only be constructed on a route designated by the commission.\n(a) The Public Utilities Commission shall adopt rules governing the routing of pipelines. The rules apply only to the route of pipelines and may not set safety standards for the construction of pipelines.\n(b) The rules must:\n(1) require that a person proposing construction of a pipeline submit to the commission one preferred route for the pipeline and evidence of consideration of alternatives;\n(2) provide for notice of proposed pipeline routes to local units of government and to owners and lessees of property along the routes being considered;\n(3) provide for public hearings on proposed pipeline routes, which may follow the commission's procedures for public hearings on proposed power line routes and electrical generating plant sites;\n(4) provide criteria that the commission will use in determining pipeline routes, which must include the existence of populated areas, consideration of local government land use laws including ordinances adopted under section 299J.05, and the impact of the proposed pipeline on the natural environment;\n(5) provide a procedure that the commission will follow in issuing pipeline routing permits and require the commission to issue the permits within nine months after the permit application is received by the commission, unless the commission extends this deadline for cause;\n(6) provide for the payment of fees by persons proposing to construct pipelines to cover the costs of the commission in implementing this section;\n(7) allow the commission to provide exemptions from all or part of the pipeline routing permit application process in emergencies or if the commission determines that the proposed pipeline will not have a significant impact on humans or the environment;\n(8) require exemption determinations to be made within 90 days after an application; and\n(9) require that a person who has constructed a pipeline, to the extent possible, restore the area affected by the pipeline to the natural conditions that existed immediately before construction of the pipeline, provided that this restoration is compatible with the safe operation, maintenance, and inspection of the pipeline.\n(c) The rules do not apply to temporary use of a route for purposes other than installation of a pipeline, to securing survey or geological data, to repair or replacement of an existing pipeline within the existing right-of-way, or to minor relocation of less than three-quarters of a mile of an existing pipeline. The rules do not apply to construction of new pipeline in a right-of-way in which pipeline has been constructed before July 1, 1988, or in a right-of-way that has been approved by the commission after July 1, 1988, except when the commission determines that there is a significant chance of an adverse effect on the environment or that there has been a significant change in land use or population density in or near the right-of-way since the first construction of pipeline in the right-of-way, or since the commission first approved the right-of-way.\nThe issuance of a pipeline routing permit under this section and subsequent purchase and use of the route locations is the only site approval required to be obtained by the person owning or constructing the pipeline. The pipeline routing permit supersedes and preempts all zoning, building, or land use rules, regulations, or ordinances promulgated by regional, county, local, and special purpose governments.",
	"repealed": false
}