{
	"id": "515A.2-111",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.2-111",
	"title": "515A.2-111 EXPANSION OF FLEXIBLE CONDOMINIUMS.",
	"text": "(a) To add additional real estate pursuant to an option reserved under section 515A.2-106(1), all persons having an interest in the additional real estate, excepting any holder of an easement or any holder of an interest to secure an obligation which interest was recorded or created subsequent to the recording of the declaration, shall prepare and execute and, after notice as provided in subsection (b), record an amendment to the declaration. The amendment to the declaration shall assign an identifying number to each unit formed in the additional real estate, and reallocate common element interests, votes in the association, and common expense liabilities according to section 515A.2-108. The amendment shall describe or delineate any limited common elements formed out of the additional real estate, showing or designating the unit to which each is allocated to the extent required by section 515A.2-109 (Limited Common Elements).\n(b) The declarant shall serve notice of an intention to add additional real estate as follows:\n(1) To the association in the same manner as service of summons in a civil action in district court at least 30 days prior to recording the amendment. The amendment shall be attached to the notice and shall not thereafter be changed so as to materially affect the rights of unit owners.\n(2) To the occupants of each unit by notice given in the manner provided in section 515A.1-115 not less than 20 days prior to recording the amendment addressed to \"Occupant Entitled to Legal Notice\" at each unit. Attached to the notice shall be a statement that the amendment has been served on the association.\n(3) Proof of service upon the association and the occupants shall be attached to the recorded amendment.\n(c) A lien upon the additional real estate that is not also upon the existing condominium is a lien only upon the units and their percentage of the common elements that are created from the additional real estate. Units within the condominium as it existed prior to expansion are transferred free of liens that are liens only upon the additional real estate, notwithstanding the fact that the percentage of common elements for the units is a percentage of the entire condominium, including the additional real estate.",
	"repealed": false
}