{
	"id": "116.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.155",
	"title": "116.155 REMEDIATION FUND.",
	"text": "The remediation fund is created as a special revenue fund in the state treasury to provide a reliable source of public money for response and corrective actions to address releases of hazardous substances, pollutants or contaminants, agricultural chemicals, and petroleum, and for environmental response actions at qualified landfill facilities for which the agency has assumed such responsibility, including perpetual care of such facilities. The specific purposes for which the general portion of the fund may be spent are provided in subdivision 2. In addition to the general portion of the fund, the fund contains four accounts described in subdivisions 4 to 5b.\n(a) Money in the general portion of the remediation fund is appropriated to the agency and the commissioners of agriculture and natural resources for the following purposes:\n(1) to take actions related to releases of hazardous substances, or pollutants or contaminants as provided in section 115B.20;\n(2) to take actions related to releases of hazardous substances, or pollutants or contaminants, at and from qualified landfill facilities as provided in section 115B.42, subdivision 2;\n(3) to provide technical and other assistance under sections 115B.17, subdivision 14, 115B.175 to 115B.179, and 115C.03, subdivision 9;\n(4) for corrective actions to address incidents involving agricultural chemicals, including related administrative, enforcement, and cost recovery actions pursuant to chapter 18D; and\n(5) together with any amount approved for transfer to the agency from the petroleum tank fund by the commissioner of management and budget, to take actions related to releases of petroleum as provided under section 115C.08.\n(b) The commissioner of management and budget shall allocate the amounts available in any biennium to the agency, and the commissioners of agriculture and natural resources for the purposes provided in this subdivision based upon work plans submitted by the agency and the commissioners of agriculture and natural resources, and may adjust those allocations upon submittal of revised work plans. Copies of the work plans shall be submitted to the chairs of the senate and house of representatives committees having jurisdiction over environment and environment finance.\nThe following revenues shall be deposited in the general portion of the remediation fund:\n(1) response costs related to releases of hazardous substances, or pollutants or contaminants, recovered under section 115B.17, subdivision 6; 115B.443; or 115B.444 or any other law;\n(2) money paid to the agency or the Agriculture Department by voluntary parties who have received technical or other assistance under sections 115B.17, subdivision 14, 115B.175 to 115B.179, and 115C.03, subdivision 9;\n(3) money received in the form of gifts, grants, reimbursement, or appropriation from any source for any of the purposes provided in subdivision 2, except federal grants; and\n(4) interest accrued on the fund.\nThe dry cleaner environmental response and reimbursement account is as described in sections 115B.47 to 115B.51.\nThe metropolitan landfill contingency action trust account is as described in section 473.845.\nThe water quality and sustainability account is as described in section 115B.52.\nThe natural resources damages account is as described in section 115B.172.\nThe closed landfill solar redevelopment and reuse account is established and managed as provided under section 115B.431.\nThe remediation fund shall also be supported by transfers as may be authorized by the legislature from time to time from the environmental fund.",
	"repealed": false
}