{
	"id": "47.207",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.207",
	"title": "47.207 CANCELLATION OF PRIVATE MORTGAGE INSURANCE.",
	"text": "For the purposes of this section, the following terms have the meanings given:\n(a) \"Current fair market value\" means the value of the mortgagor's property determined by an appraisal conducted within 90 days of a mortgagor's written request for cancellation of private mortgage insurance. The appraisal shall be conducted by a real estate appraiser, licensed or certified by a state or federal agency, who is reasonably acceptable to the servicer. The appraisal may be conducted at either the request of the lender, mortgagor, or servicer. The mortgagor is responsible for the cost of the appraisal.\n(b) \"Lender\" means a person who makes or holds a residential mortgage loan.\n(c) \"Private mortgage insurance\" means insurance paid for by the mortgagor, including any mortgage guaranty insurance, against the nonpayment of, or default on, a residential mortgage loan, other than mortgage insurance made available under the federal National Housing Act, United States Code, title 38, or title V of the federal Housing Act of 1949. \"Private mortgage insurance\" does not mean lender-paid mortgage insurance.\n(d) \"Residential mortgage loan\" means a loan secured by either: (1) a mortgage on residential real property; or (2) by certificates of stock or other evidence of ownership interest in and proprietary lease from corporations, partnerships, or other forms of business organizations formed for the purpose of cooperative ownership of residential real property.\n(e) \"Servicer\" means a person who, through any medium or mode of communication, engages in the collection or remittance for, or the right or obligation to collect or remit for, a lender, mortgagee, note owner, noteholder, or for a person's own account, of payments, interest, principal, and escrow items such as insurance and taxes for property subject to a residential mortgage loan.\nWith respect to an existing or future residential mortgage loan, a mortgagor shall have the right to elect, in writing, to cancel private mortgage insurance in connection with a residential mortgage loan if all of the following terms and conditions have been met:\n(1) the current unpaid principal balance of the mortgage is 80 percent or less of the current fair market value of the property;\n(2) the mortgagor has not:\n(i) been 60 days or longer past due on a mortgage payment during the 12-month period beginning 24 months before the date on which the servicer receives the mortgagor's written request for cancellation; or\n(ii) been 30 days or longer past due on a mortgage payment during the 12 months preceding the date on which the servicer receives the mortgagor's written request for cancellation;\n(3) the mortgage was made at least 24 months prior to the receipt of a request for cancellation;\n(4) the property securing the mortgage loan is owner-occupied; and\n(5) the mortgage has not been pooled with other mortgages in order to constitute, in whole or in part, collateral for bonds issued by the state of Minnesota or any political subdivision of the state of Minnesota or of any agency of any political subdivision of the state of Minnesota.\n(a) With respect to each existing or future residential mortgage loan, a servicer must provide an annual written notice to the mortgagor currently paying premiums for private mortgage insurance. The notice must be in 12-point type or greater and appear substantially as follows:\nNOTICE OF RIGHT TO CANCEL PRIVATE MORTGAGE INSURANCE\nIf you currently pay private mortgage insurance premiums, you may have the right under federal law or Minnesota law to cancel the insurance and stop paying premiums. This would reduce your total monthly payment.\nYou may have the right to cancel private mortgage insurance if the principal balance of your loan is 80 percent or less of the current market value of your home. Under Minnesota law, the value of your property can be determined by a professional appraisal. You need to pay for this appraisal, but in most cases you will be able to recover this cost in less than a year if your mortgage insurance is canceled.\nIf you wish to learn whether you are eligible to cancel this insurance, please contact us at (enter address and phone number of servicer).\n(b) The notice required by this subdivision must be on its own page, but a disclosure notice concerning private mortgage insurance required by federal law may be included on the same page as the disclosure notice required by this subdivision. The page containing the notice required by this subdivision may be included with other disclosures or notices required by federal law that are sent to the mortgagor.\n(c) If the mortgage has been pooled with other mortgages in order to constitute, in whole or in part, collateral for bonds issued by the state of Minnesota or any political subdivision of the state of Minnesota or of any agency of any political subdivision of the state of Minnesota and notice of right to cancel private mortgage insurance is required under federal law, no notice under this subdivision is required.\n(a) Within 30 days of receipt of a mortgagor's written request to cancel private mortgage insurance, a servicer shall:\n(1) provide a written notice to the insurer to cancel the private mortgage insurance and written notice to the mortgagor that a request for cancellation has been sent to the insurer if the servicer determines that the private mortgage insurance should be canceled;\n(2) provide a written response to the mortgagor identifying all additional information needed from the mortgagor if the servicer reasonably needs more information from the mortgagor to determine whether the mortgagor is eligible for cancellation of private mortgage insurance; or\n(3) provide a written notice to the mortgagor of the reasons for the servicer's refusal to cancel the private mortgage insurance if the servicer determines that the mortgagor does not meet the requirements for cancellation of private mortgage insurance.\n(b) If a lender, or any other person involved in the mortgage transaction, receives a written request for cancellation of private mortgage insurance, the lender or other person shall promptly forward the mortgagor's request for cancellation to the servicer, if the servicer is known to the lender or other person. If the servicer is not known to the lender or other person, the lender or other person shall advise the mortgagor to contact the company to which the mortgagor sends the monthly payment.\n(a) A lender requiring or offering private mortgage insurance shall make available to the borrower or other person paying the insurance premium the same premium payment plans as are available to the lender in paying the private mortgage insurance premium.\n(b) Any refund or rebate for unearned private mortgage insurance premiums shall be paid to the mortgagor or other person actually providing the funds for payment of the premium.\n(c) A lender or servicer shall not charge the mortgagor a fee or other consideration for cancellation of the private mortgage insurance or for any of the acts required by this section, except that the lender or servicer shall have the right to recover the cost of an appraisal if the mortgagor elects to have the lender or servicer perform or arrange for the appraisal.\nNothing in this section shall be deemed to be inconsistent with the federal Homeowner's Protection Act of 1998, codified at United States Code, title 12, sections 4901 to 4910, within the meaning of \"inconsistent\" as used in section 9 of that act, codified at United States Code, title 12, section 4908.",
	"repealed": false
}