{
	"id": "360.521",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.521",
	"title": "360.521 AIRCRAFT TAX LIMITATION AND ELECTION.",
	"text": "(a) None of the provisions of sections 360.531 to 360.67 apply to aircraft or airline companies used in air commerce which have a certificate of convenience and necessity issued by the United States Civil Aeronautics Board.\n(b) All aircraft of an airline company operating without a certificate of convenience and necessity issued by the United States Civil Aeronautics Board and with at least three regularly scheduled interstate flights per week shall be registered annually in the manner prescribed in sections 360.511 to 360.67 or if the airline company so elects, thereafter, or until an election otherwise, all of its air flight property shall be assessed annually by the commissioner of revenue in a manner prescribed by sections 270.071 to 270.079 unless prior to July 1 in the year of election the airline company has registered and paid a tax under sections 360.511 to 360.67.\n(c) If pursuant to paragraph (b) an airline company being taxed pursuant to sections 270.071 to 270.079 registers pursuant to sections 360.511 to 360.67 prior to July 1, then such airline company will be required to pay one-half of the registration tax which would have been due July 1 in the year of election for an airline company not already being taxed pursuant to sections 270.071 to 270.079, such one-half to be allocable to the last six months of the registration period.\n(d) If an airline company registered pursuant to sections 360.511 to 360.67 elects to be taxed in the manner prescribed by sections 270.071 to 270.079, then such airline company will be required to pay one-half of the registration tax which would have been due July 1 of the year of election if the airline company would not have elected to be taxed in the manner prescribed by sections 270.071 to 270.079, such one-half to be allocable to the first six months of the registration period.\n(e) Written notice of such election shall be given to the commissioner of transportation and the commissioner of revenue prior to July 1 in the year of election. If an airline company not already taxed under sections 270.071 to 270.079 fails to make an election, then such airline company shall register its aircraft and pay a tax under sections 360.511 to 360.67.",
	"repealed": false
}