{
	"id": "144.6985",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.6985",
	"title": "144.6985 COMMUNITY HEALTH NEEDS ASSESSMENT; COMMUNITY HEALTH IMPROVEMENT SERVICES; IMPLEMENTATION.",
	"text": "A nonprofit hospital that is exempt from taxation under section 501(c)(3) of the Internal Revenue Code must make available to the public and submit to the commissioner of health, by January 15, 2026, the most recent community health needs assessment submitted by the hospital to the Internal Revenue Service. Each time the hospital conducts a subsequent community health needs assessment, the hospital must, within 15 business days after submitting the subsequent community health needs assessment to the Internal Revenue Service, make the subsequent assessment available to the public and submit the subsequent assessment to the commissioner.\nA nonprofit hospital subject to subdivision 1 must make available to the public and submit to the commissioner of health a description of the community served by the hospital. The description must include a geographic description of the area where the hospital is located, a description of the general population served by the hospital, and demographic information about the community served by the hospital, such as leading causes of death, levels of chronic illness, and descriptions of the medically underserved, low-income, minority, or chronically ill populations in the community. A hospital is not required to separately make the information available to the public or separately submit the information to the commissioner if the information is included in the hospital's community health needs assessment made available and submitted under subdivision 1.\n(a) A nonprofit hospital subject to subdivision 1 must annually submit to the commissioner an addendum which details information about hospital activities identified as community health improvement services with a cost of $5,000 or more. The addendum must include the type of activity, the method through which the activity was delivered, how the activity relates to an identified community need in the community health needs assessment, the target population for the activity, strategies to reach the target population, identified outcome metrics, the cost to the hospital to provide the activity, the methodology used to calculate the hospital's costs, and the number of people served by the activity. If a community health improvement service is administered by an entity other than the hospital, the administering entity must be identified in the addendum. This paragraph does not apply to hospitals required to submit an addendum under paragraph (b).\n(b) A nonprofit hospital subject to subdivision 1 must annually submit to the commissioner an addendum which details information about the ten highest-cost activities of the hospital identified as community health improvement services if the nonprofit hospital:\n(1) is designated as a critical access hospital under section 144.1483, clause (9), and United States Code, title 42, section 1395i-4;\n(2) meets the definition of sole community hospital in section 62Q.19, subdivision 1, paragraph (a), clause (5); or\n(3) meets the definition of rural emergency hospital in United States Code, title 42, section 1395x(kkk)(2).\nThe addendum must include the type of activity, the method in which the activity was delivered, how the activity relates to an identified community need in the community health needs assessment, the target population for the activity, strategies to reach the target population, identified outcome metrics, the cost to the hospital to provide the activity, the methodology used to calculate the hospital's costs, and the number of people served by the activity. If a community health improvement service is administered by an entity other than the hospital, the administering entity must be identified in the addendum.\nA nonprofit hospital subject to subdivision 1 must make available to the public, within one year after completing each community health needs assessment, a community benefit implementation strategy. In developing the community benefit implementation strategy, the hospital must consult with community-based organizations, stakeholders, local public health organizations, and others as determined by the hospital. The implementation strategy must include how the hospital shall address the top three community health priorities identified in the community health needs assessment. Implementation strategies must be evidence-based, when available, and development and implementation of innovative programs and strategies may be supported by evaluation measures.\nA nonprofit hospital required to make information available to the public under this section may do so by posting the information on the hospital's website in a consolidated location and with clear labeling.\nThis section is effective January 1, 2026.",
	"repealed": false
}