{
	"id": "176.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.221",
	"title": "176.221 PAYMENT OF COMPENSATION AND TREATMENT CHARGES, COMMENCEMENT.",
	"text": "Within 14 days of notice to or knowledge by the employer of an injury compensable under this chapter the payment of temporary total compensation shall commence. Within 14 days of notice to or knowledge by an employer of a new period of temporary total disability which is caused by an old injury compensable under this chapter, the payment of temporary total compensation shall commence; provided that the employer or insurer may file for an extension with the commissioner within this 14-day period, in which case the compensation need not commence within the 14-day period but shall commence no later than 30 days from the date of the notice to or knowledge by the employer of the new period of disability. Commencement of payment by an employer or insurer does not waive any rights to any defense the employer has on any claim or incident either with respect to the compensability of the claim under this chapter or the amount of the compensation due. Where there are multiple employers, the first employer shall pay, unless it is shown that the injury has arisen out of employment with the second or subsequent employer. Liability for compensation under this chapter may be denied by the employer or insurer by giving the employee written notice of the denial of liability. If liability is denied for an injury which is required to be reported to the commissioner under section 176.231, subdivision 1, the denial of liability must be filed with the commissioner and served on the employee within 14 days after notice to or knowledge by the employer of an injury which is alleged to be compensable under this chapter. If the employer or insurer has commenced payment of compensation under this subdivision but determines within 60 days of notice to or knowledge by the employer of the injury that the disability is not a result of a personal injury, payment of compensation may be terminated upon the filing of a notice of denial of liability within 60 days of notice or knowledge. After the 60-day period, payment may be terminated only by the filing of a notice as provided under section 176.239. Upon the termination, payments made may be recovered by the employer if the commissioner or compensation judge finds that the employee's claim of work related disability was not made in good faith. A notice of denial of liability must state in detail the facts forming the basis for the denial and specific reasons explaining why the claimed injury or occupational disease was determined not to be within the scope and course of employment and shall include the name and telephone number of the person making this determination.\n[Repealed, 1983 c 290 s 129]\nIf the employer or insurer does not begin payment of compensation within the time limit prescribed under subdivision 1 or 8, the commissioner may assess a penalty, payable to the commissioner for deposit in the assigned risk safety account, which shall be a percentage of the amount of compensation to which the employee is entitled to receive up to the date compensation payment is made.\nThe amount of penalty shall be determined as follows:\nThe penalty under this section is in addition to any penalty otherwise provided by statute.\nIn lieu of any other penalty under this section, the commissioner may assess a penalty of up to $2,000 payable to the commissioner for deposit in the assigned risk safety account for each instance in which an employer or insurer does not pay benefits or file a notice of denial of liability within the time limits prescribed under this section.\n[Repealed, 1983 c 290 s 129]\n[Repealed, 1983 c 290 s 129]\nThe division or compensation judge shall assess the penalty payments provided for by subdivision 3 or 3a and any increase in benefit payments provided by section 176.225, subdivision 5, against the insurer. The insurer is liable for a penalty payment assessed against it even if the delay is attributable to the employer.\nAn insurer who has paid a penalty under this section may recover from the employer the portion of the penalty attributable to the acts of the employer which resulted in the delay. A penalty paid by an insurer under this section which is attributable to the fault of the employer shall be treated as a loss in an experience rated plan, retrospective rating plan, or dividend calculation where appropriate.\nThe penalties provided by this section apply in cases where payment for treatment under section 176.135, rehabilitation expenses under section 176.102, subdivisions 9 and 11, or permanent partial compensation are not made in a timely manner as required by law or by rule adopted by the commissioner.\nAny payment of compensation, charges for treatment under section 176.135, rehabilitation expenses under section 176.102, subdivision 9, or penalties assessed under this chapter not made when due shall bear interest from the due date to the date the payment is made at the rate set by section 549.09, subdivision 1.\nFor the purposes of this subdivision, permanent partial disability payment is due 14 days after receipt of the first medical report which contains a disability rating if such payment is otherwise due under this chapter, and charges for treatment under section 176.135 are due 30 calendar days after receiving the bill and necessary medical data.\nIf the claim of the employee or dependent for compensation is contested in a proceeding before a compensation judge or the commissioner, the decision of the judge or commissioner shall provide for the payment of unpaid interest on all compensation awarded, including interest accruing both before and after the filing of the decision.\n(a) Except as otherwise provided in paragraph (b), payment of compensation under this chapter shall be by immediately payable negotiable instrument, or if by any other method, arrangements shall be available to provide for the immediate negotiability of the payment instrument.\nAll payment of compensation shall be made within 14 days of the filing of an appropriate order by the division or a compensation judge, unless the order is appealed or if a different time period is provided by this chapter.\n(b) An employer or insurer responsible for payment of periodic monetary benefits under this chapter must send the payments by electronic funds transfer to a bank, savings association, or credit union, if requested by the employee or a dependent under section 176.111.\n(1) If the employer or insurer has already established an electronic funds transfer arrangement with a bank, savings association, or credit union for the employee's account, the employer or insurer must begin sending periodic monetary benefit payments by electronic funds transfer to the bank, savings association, or credit union within 30 days after the employer or insurer receives a request from the employee or dependent containing the information in paragraph (c).\n(2) If the employer or insurer does not already have an arrangement with the bank, savings association, or credit union for electronic funds transfer for the employee or dependent's account at the time of the request, the 30 days to begin sending periodic benefit payments by electronic funds transfer does not start to run until the arrangement has been established. The employer or insurer must make reasonable efforts to establish the electronic funds transfer arrangement within 14 days after receiving a request containing the information in paragraph (c).\n(3) Payment of benefits is deemed to have been made on the date the payment is sent by electronic funds transfer to the employee or dependent's account at the bank, savings association, or credit union.\n(c) The employee or dependent must provide the employer or insurer with the following information:\n(1) a signed and dated written request for electronic funds transfer of benefits;\n(2) the name and address of the bank, savings association, or credit union where the benefit payments are to be sent by electronic funds transfer;\n(3) the account number to which the payments should be credited; and\n(4) any other information or documentation required by the employer or insurer or the bank, savings association, or credit union necessary to implement electronic funds transfer.\n(d) The employer or insurer must retain a copy of the request for as long as the benefits are being paid by electronic funds transfer. The employer or insurer paying the benefits must provide a copy of the request to the department upon request.\n(e) Paragraph (b) does not apply if the employer or insurer reasonably determines that the periodic monetary benefit payments are likely to end before the electronic funds transfer can be arranged.\n(f) The commissioner may assess a monetary penalty of $500 against the employer or insurer for a violation of paragraph (b) or (d). Before issuing a penalty for a first violation of paragraph (b) or (d), the commissioner must provide written notice to the employer or insurer that a penalty may be issued if the violation is not corrected within 30 days. Penalties under this paragraph are payable to the commissioner for deposit in the assigned risk safety account.\nAn employer who pays full wages to an injured employee is not relieved of the obligation for reporting the injury and making a liability determination within the times specified in this chapter. If the full wage is paid the employer's insurer or self-insurer shall report the amount of this payment to the division and determine the portion which is temporary total compensation for purposes of administering this chapter and special compensation fund assessments. The employer shall also make appropriate adjustments to the employee's payroll records to assure that the employee's sick leave or the vacation time is not inappropriately charged against the employee, and to assure the proper income tax treatment for the payments.",
	"repealed": false
}