{
	"id": "239.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.761",
	"title": "239.761 PETROLEUM PRODUCT SPECIFICATIONS.",
	"text": "A person responsible for the product must meet the specifications in this section. The specifications apply to petroleum products processed, held, stored, imported, transferred, distributed, offered for distribution, offered for sale or use, or sold in Minnesota.\nThe petroleum product specifications in this section are intended to match the definitions and specifications in sections 41A.09 and 296A.01. Petroleum products named in this section are defined in section 296A.01.\n(a) Gasoline that is not blended with biofuel must not be contaminated with water or other impurities and must comply with ASTM specification D4814-11b. Gasoline that is not blended with biofuel must also comply with the volatility requirements in Code of Federal Regulations, title 40, part 1090.\n(b) After gasoline is sold, transferred, or otherwise removed from a refinery or terminal, a person responsible for the product:\n(1) may blend the gasoline with agriculturally derived ethanol as provided in subdivision 4;\n(2) shall not blend the gasoline with any oxygenate other than biofuel;\n(3) shall not blend the gasoline with other petroleum products that are not gasoline or biofuel;\n(4) shall not blend the gasoline with products commonly and commercially known as casinghead gasoline, absorption gasoline, condensation gasoline, drip gasoline, or natural gasoline; and\n(5) may blend the gasoline with a detergent additive, an antiknock additive, or an additive designed to replace tetra-ethyl lead, that is registered by the EPA.\n(a) Gasoline may be blended with agriculturally derived, denatured ethanol that complies with the requirements of subdivision 5.\n(b) A gasoline-ethanol blend must:\n(1) comply with the volatility requirements in Code of Federal Regulations, title 40, part 1090;\n(2) comply with ASTM specification D4814-11b, or the gasoline base stock from which a gasoline-ethanol blend was produced must comply with ASTM specification D4814-11b; and\n(3) not be blended with casinghead gasoline, absorption gasoline, condensation gasoline, drip gasoline, or natural gasoline after the gasoline-ethanol blend has been sold, transferred, or otherwise removed from a refinery or terminal.\nGasoline combined with ethanol for use in standard combustion engines may be blended with up to ten percent agriculturally derived, denatured ethanol, by volume, or any percentage specifically authorized in a waiver granted by the United States Environmental Protection Agency under section 211(f)(4) of the Clean Air Act, United States Code, title 42, section 7545, subsection (f), paragraph (4). The gasoline-ethanol blend must comply with the general provisions in subdivision 4.\n(a) Gasoline blended for use in an alternative fuel vehicle, as defined in section 296A.01, subdivision 5, may contain any percentage of agriculturally derived, denatured ethanol, by volume, not to exceed 85 percent. The gasoline-ethanol blend must comply with the general provisions in subdivision 4. The gasoline and ethanol may be blended by an ethanol blender or at the point of retail sale in an ethanol-blending fuel dispenser clearly labeled \"FLEX-FUEL VEHICLES ONLY.\" If blended by an ethanol blender, the percentage of ethanol in the resulting gasoline-ethanol blend must be clearly identified.\n(b) If a person responsible for the product utilizes an ethanol-blending fuel dispenser to dispense both gasoline blended with ethanol for use in alternative fuel vehicles and gasoline blended with ethanol for use in standard combustion engines, the person must ensure that the gasoline blended with ethanol for use in standard combustion engines is dispensed from a fuel-dispensing hose and nozzle or other conveyance dedicated solely to gasoline blended with ethanol for use in standard combustion engines and clearly labeled as such.\n(c) A person responsible for the product who complies with the provisions in paragraph (b) is not responsible for a self-service fueling action taken by that person's retail fuel customer.\nDenatured ethanol that is to be blended with gasoline must be agriculturally derived and must comply with ASTM specification D4806-11a. This includes the requirement that ethanol may be denatured only as specified in Code of Federal Regulations, title 27, parts 20 and 21.\n(a) A person responsible for the product shall comply with the following requirements:\n(1) after July 1, 2000, gasoline containing in excess of one-third of one percent, in total, of nonethanol oxygenates listed in paragraph (b) must not be sold or offered for sale at any time in this state; and\n(2) after July 1, 2005, gasoline containing any of the nonethanol oxygenates listed in paragraph (b) must not be sold or offered for sale in this state.\n(b) The oxygenates prohibited under paragraph (a) are:\n(1) methyl tertiary butyl ether, as defined in section 296A.01, subdivision 34;\n(2) ethyl tertiary butyl ether, as defined in section 296A.01, subdivision 18; or\n(3) tertiary amyl methyl ether.\n(c) Gasoline that is blended with a nonethanol oxygenate must comply with ASTM specification D4814-11b. Nonethanol oxygenates must not be blended into gasoline after the gasoline has been sold, transferred, or otherwise removed from a refinery or terminal.\nHeating fuel oil must comply with ASTM specification D396-12.\n(a) When diesel fuel oil is not blended with biodiesel, it must comply with ASTM specification D975-12a.\n(b) When diesel fuel oil is a blend of up to five volume percent biodiesel, the diesel component must comply with ASTM specification D975-12a and the biodiesel component must comply with ASTM specification D6751-11b.\nKerosene must comply with ASTM specification D3699-08.\nAviation gasoline must comply with ASTM specification D910-11.\nSustainable aviation fuel, as defined in section 41A.30, subdivision 1, paragraph (g), must comply with either:\n(1) ASTM International Standard Specification D7566; or\n(2) the Fischer-Tropsch provisions of ASTM International Standard Specification D1655, Annex A1.\nAviation turbine fuel and jet fuel must comply with ASTM specification D1655-12.\nFuel oil for use in nonaviation gas turbine engines must comply with ASTM specification D2880-03.\nA blend of ethanol and gasoline, containing not more than 85 percent ethanol, produced for use as a motor fuel in alternative fuel vehicles as defined in section 296A.01, subdivision 5, must comply with ASTM specification D5798-11.\nA blend of methanol and gasoline, containing at least 70 percent methanol and not more than 85 percent methanol, produced for use as a motor fuel in alternative fuel vehicles as defined in section 296A.01, subdivision 5, must comply with ASTM specification D5797-07.\n\"Biodiesel blend\" means a blend of diesel fuel and biodiesel fuel at a ratio designated by \"BXX\" where \"XX\" represents the volume percent of biodiesel fuel in the blend.\n\"Biodiesel fuel\" means a renewable, biodegradable, mono alkyl ester combustible liquid that is derived from agricultural plant oils or animal fats and that meets American Society for Testing and Materials (ASTM) specification D6751-11b for Biodiesel Fuel (B100) Blend Stock for Distillate Fuels.\nGrade 82 unleaded aviation gasoline must comply with ASTM specification D6227-12.\nThe minimum (R+M)/2 octane rating grades for petroleum products under subdivision 3, 4, 4a, 4b, or 6 sold to an end user shall be no less than 87.",
	"repealed": false
}