{
	"id": "524.5-310",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-310",
	"title": "524.5-310 FINDINGS; ORDER OF APPOINTMENT.",
	"text": "(a) The court may appoint a guardian, limited or unlimited in duration or power, for a respondent only if it finds by clear and convincing evidence that:\n(1) the respondent is an incapacitated person; and\n(2) the respondent's identified needs cannot be met by less restrictive means, including but not limited to use of appropriate technological assistance, supported decision making, community or residential services, or appointment of a health care agent under section 145C.01, subdivision 2. The court must make specific findings particular to the respondent why less restrictive alternatives do not work.\n(b) Alternatively, the court, with appropriate findings, may treat the petition as one for a protective order under section 524.5-401, enter any other appropriate order, or dismiss the proceeding.\n(c) The court shall grant to a guardian only those powers necessitated by the limitations and demonstrated needs of the person subject to guardianship and, whenever feasible, make appointive and other orders that will encourage the development of the maximum self-reliance and independence of the person subject to guardianship. Any power not specifically granted to the guardian, following a written finding by the court of a demonstrated need for that power, is retained by the person subject to guardianship.\n(d) The court may limit the duration of any guardianship. However, if the person subject to guardianship is under the age of 30 years old on the date the court files an order appointing a guardian, the guardianship must be of a limited duration determined by the court, not exceeding a period over 72 months.\n(e) Notwithstanding paragraph (d), a petition for guardianship for an indefinite period of time may be filed for any person who is 29 years or older and is currently subject to a guardianship of limited duration.\n(f) If the court grants the guardian any of the powers or duties under section 524.5-313, paragraph (c), clause (1), (2), or (4), the authority of a previously appointed health care agent to make health care decisions, as defined in section 145C.01, subdivision 5, is suspended until further order of the court or as otherwise provided by this section. The court may declare a health care directive unenforceable as provided in section 145C.09, subdivision 3. The court may declare that a health care directive has been revoked by the person subject to guardianship if the court finds, by clear and convincing evidence, that the person subject to guardianship has revoked the health care directive as provided in section 145C.09, subdivision 1.\n(g) A health care agent or other person legally appointed by the person subject to guardianship to control final disposition of the remains of the person subject to guardianship under section 145C.05, subdivision 2, clause (7), or 149A.80, or a health care agent authorized to make organ or tissue donations under section 525A.04 or 525A.09, may make health care decisions as defined in section 145C.01, subdivision 5, on behalf of the person subject to guardianship for the purpose of preparing the body of the person subject to guardianship for organ or tissue donation or final disposition of the remains of the person subject to guardianship, as applicable.\n(h) Within 14 days after an appointment, a guardian shall send or deliver to the person subject to guardianship, and counsel if represented at the hearing, a copy of the order of appointment accompanied by a notice which advises the person subject to guardianship of the right to appeal the guardianship appointment in the time and manner provided by the Rules of Appellate Procedure.\n(i) Each year, within 30 days after the anniversary date of an appointment, a guardian shall send or deliver to the person subject to guardianship and to interested persons of record with the court (1) a notice of the right to request termination or modification of the guardianship or to request an order that is in the best interests of the person subject to guardianship or for other appropriate relief, (2) notice of the status of the right to vote of the person subject to guardianship, and (3) a copy of the bill of rights for persons subject to guardianship as provided in section 524.5-120.",
	"repealed": false
}