{
	"id": "327.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.14",
	"title": "327.14 DEFINITIONS.",
	"text": "For the purposes of sections 327.10, 327.11, and 327.14 to 327.28, the terms defined in this section have the meanings given them.\n\"Manufactured home\" has the meaning specified in section 327.31, subdivision 6.\n\"Manufactured home park\" means any site, lot, field or tract of land upon which two or more occupied manufactured homes are located, either free of charge or for compensation, and includes any building, structure, tent, vehicle or enclosure used or intended for use as part of the equipment of the manufactured home park.\n\"Municipality\" means any city, town or township in this state, however organized.\n[Repealed, 2009 c 79 art 10 s 51]\n[Repealed, 2009 c 79 art 10 s 51]\n\"Recreational camping vehicle\" when used in sections 327.14 to 327.28 includes the following:\n(1) any vehicular, portable structure built on a chassis, designed to be used as a temporary dwelling for travel, recreational, and vacation uses;\n(2) any structure designed to be mounted on a truck chassis for use as a temporary dwelling for travel, recreation, and vacation;\n(3) any portable, temporary dwelling to be used for travel, recreation, and vacation, constructed as an integral part of a self-propelled vehicle; and\n(4) any folding structure, mounted on wheels and designed for travel, recreation, and vacation use.\n\"Recreational camping area\" means any area, whether privately or publicly owned, used on a daily, nightly, weekly, or longer basis for the accommodation of five or more tents or recreational camping vehicles free of charge or for compensation. \"Recreational camping area\" excludes:\n(1) children's camps;\n(2) industrial camps;\n(3) migrant labor camps, as defined in Minnesota Statutes and state commissioner of health rules;\n(4) United States Forest Service camps;\n(5) state forest service camps;\n(6) state wildlife management areas or state-owned public access areas which are restricted in use to picnicking and boat landing;\n(7) temporary holding areas for self-contained recreational camping vehicles created by and adjacent to motor sports facilities, if the chief law enforcement officer of an affected jurisdiction determines that it is in the interest of public safety to provide a temporary holding area; and\n(8) a privately owned area used for camping no more than once a year and for no longer than seven consecutive days by members of a private club where the members pay annual dues to belong to the club.\n\"Special event recreational camping area\" means a recreational camping area which operates no more than two times annually and for no more than 14 consecutive days.",
	"repealed": false
}