{
	"id": "583.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/583.26",
	"title": "583.26 MANDATORY MEDIATION PROCEEDINGS.",
	"text": "(a) A creditor desiring to start a proceeding to enforce a debt against agricultural property under chapter 580 or 581 or sections 336.9-601 to 336.9-628, to terminate a contract for deed to purchase agricultural property under section 559.21, or to garnish, levy on, execute on, seize, or attach agricultural property, must serve an applicable mediation notice under sections 336.9-601, 550.365, 559.209, and 582.039 on the debtor and the director. The creditor must also file with the director proof of the date the mediation notice was served on the debtor. The creditor may not begin the proceeding until the stay of the creditor's remedies is lifted under subdivision 5, or as allowed under sections 583.20 to 583.32.\n(b) For purposes of the Farmer-Lender Mediation Act, starting a proceeding to enforce a debt means initiating a proceeding under chapter 550, 580, or 581; sections 336.9-601 to 336.9-628; or section 559.21.\n(c) The director shall combine all mediation notices for the same debtor that are received prior to the initial mediation meeting into one mediation proceeding.\n(a) A debtor must file a mediation request form with the director by 14 days after receiving a mediation notice. The debtor must state all known creditors with debts secured for agricultural property and must authorize the director to obtain the debtor's credit report from one or more credit reporting agencies. The mediation request form must include an instruction that the debtor must state all known creditors with debts secured by agricultural property and unsecured creditors that are necessary for the farm operation of the debtor. It is the debtor's discretion as to which unsecured creditors are necessary for the farm operation but the mediation request form must notify the debtor that omission of a significant unsecured creditor could result in a bad-faith determination pursuant to section 583.27, subdivisions 1, paragraph (a), clause (2), and 2. The mediation request must state the date that the notice was served on the debtor. The director shall provide mediation request forms when requested.\n(b) Except as provided in section 583.24, subdivision 4, paragraph (a), clause (3), a debtor who fails to file a timely mediation request waives the right to mediation for that debt under the Farmer-Lender Mediation Act. The director shall notify the creditor who served the mediation notice stating that the creditor may proceed against the agricultural property because the debtor has failed to file a mediation request.\n(c) If a debtor has not received a mediation notice and is subject to a proceeding of a creditor enforcing a debt against agricultural property under chapter 580 or 581 or sections 336.9-601 to 336.9-628, terminating a contract for deed to purchase agricultural property under section 559.21, or garnishing, levying on, executing on, seizing, or attaching agricultural property, the debtor may file a mediation request with the director. The mediation request form must indicate that the debtor has not received a mediation notice.\n(a) Within three business days after receiving a mediation request, the director shall provide a financial analyst to meet with the debtor and assure that all information relative to the finances of the debtor is prepared prior to the initial mediation meeting. The financial analyst must review and, if necessary, prepare the debtor's financial records before the initial mediation meeting.\n(b) After receiving the mediation notice, the director shall provide the debtor with a list of farm advocates that may be available without charge to assist the debtor and the financial analyst.\nThe director shall schedule an orientation session to be held at least five days before the first mediation meeting. The debtor, the financial analyst, and a mediator shall participate in the orientation session. The mediator at the session need not be the one assigned to the mediation proceeding under subdivision 4. Creditors participating in the mediation may participate in the orientation session. At the orientation session, the financial analyst shall review the debtor's financial and inventory records to determine if they are adequate for the mediation and inform the debtor of any inadequacies, and the mediator shall inform the debtor of the requirements of the mediation process including but not limited to the requirement to participate in good faith by addressing, prior to the initial mediation meeting, any inadequacies identified by the financial analyst.\n(a) By ten days after receiving a mediation request, the director shall send: (1) a mediation proceeding notice to the debtor; (2) a mediation proceeding notice to all creditors listed by the debtor in the mediation request and any additional secured creditors identified by the director from the credit report obtained with the debtor's permission under subdivision 2; and (3) a claim form to all secured creditors stated by the debtor or identified by the director.\n(b) The mediation proceeding notice must state:\n(1) the name and address of the debtor;\n(2) that the debtor has requested mediation under the Farmer-Lender Mediation Act;\n(3) the time and place for the orientation session;\n(4) the time and place for the initial mediation meeting;\n(5) a list of the names of three mediators that may be assigned to the proceeding, along with background information on those mediators including biographical information, a summary of previous mediation experience, and the number of agreements signed by parties to previous mediation;\n(6) that the debtor and the initiating creditor may each request the director to exclude one mediator by notifying the director within three days after receiving the notice;\n(7) that in lieu of having a mediator assigned by the director, the debtor and any one or more of the creditors may agree to select and pay for a professional mediator that is approved by the director;\n(8) that the Farmer-Lender Mediation Act prohibits the creditor from beginning or continuing a proceeding to enforce the debt against agricultural property for 90 days after the debtor files a mediation request with the director unless otherwise allowed; and\n(9) that the creditor must provide the debtor by the initial mediation meeting with copies of notes and contracts for debts subject to the Farmer-Lender Mediation Act and provide a statement of interest rates on the debts, delinquent payments, unpaid principal and interest balances, the creditor's value of the collateral, and debt restructuring programs available by the creditor.\n(c) An initial mediation meeting must be held within 20 days of the notice.\n(d) The initiating creditor and the debtor may each request the director to exclude one mediator from the list by sending the director a notice to exclude the mediator within three days after receiving the mediation proceeding notice.\n(e) In lieu of the director assigning a mediator, the debtor and any one or more of the creditors may agree to select and pay for a professional mediator for the mediation proceeding. The director must approve the professional mediator before the professional mediator may be assigned to the mediation proceeding. The professional mediator may not be approved unless the professional mediator prepares and signs an affidavit:\n(1) disclosing any biases, relationships, or previous associations with the debtor or creditors subject to the mediation proceedings;\n(2) stating certifications, training, or qualifications as a professional mediator;\n(3) disclosing fees to be charged or a rate schedule of fees for the mediation proceeding; and\n(4) affirming to uphold the Farmer-Lender Mediation Act and faithfully discharge the duties of a mediator.\n(f) After receiving a mediation proceeding notice, a secured creditor must return a claim form if the debt is not subject to the Farmer-Lender Mediation Act and specify why the debt is not subject to sections 583.20 to 583.32.\n(a) Except as provided in paragraphs (b), (c), and (d), if a creditor receives a mediation proceeding notice under subdivision 4 the creditor and the creditor's successors in interest may not begin or continue proceedings to enforce a debt subject to the Farmer-Lender Mediation Act against agricultural property of the debtor under chapter 580 or 581 or sections 336.9-501 to 336.9-508, to terminate a contract for deed to purchase agricultural property under section 559.21, or to garnish, levy on, execute on, seize, or attach agricultural property until 90 days after the date the debtor files a mediation request with the director.\n(b) Except as provided in paragraph (c), if a creditor is an agency of the United States and receives a mediation proceeding notice under subdivision 4, the creditor and the creditor's successors in interest may not begin or continue proceedings to enforce a debt against agricultural property of the debtor under chapter 580 or 581 or sections 336.9-501 to 336.9-508, to terminate a contract for deed to purchase agricultural property under section 559.21, or to garnish, levy on, execute on, seize, or attach agricultural property until 90 days after the date the debtor files a mediation request with the director.\n(c) Notwithstanding paragraphs (a) and (b) or subdivision 1, a creditor receiving a mediation proceeding notice may begin proceedings to enforce a debt against agricultural property of the debtor:\n(1) at the time the creditor receives a mediator's affidavit of the debtor's lack of good faith under section 583.27; or\n(2) five days after the date the debtor and creditor sign an agreement allowing the creditor to proceed to enforce the debt against agricultural property if the debtor has not rescinded the agreement within the five days.\n(d) A creditor receiving a mediation proceeding notice must provide the debtor by the initial mediation meeting with copies of notes and contracts for debts subject to the Farmer-Lender Mediation Act and provide a statement of interest rates on the debts, delinquent payments, unpaid principal balance, a list of all collateral securing debts, a creditor's estimate of the value of the collateral, and debt restructuring programs available by the creditor.\n(e) The provisions of this subdivision are subject to section 583.27, relating to extension or reduction in the period before a creditor may begin to enforce a debt and court-supervised mediation.\n(a) A person is not eligible to be a mediator if the person has a conflict of interest that does not allow the person to be impartial. A conflict of interest includes being a current officer or board member or officer of the initiating creditor.\n(b) At the initial mediation meeting and subsequent meetings, the mediator shall:\n(1) listen to the debtor and the creditors desiring to be heard;\n(2) attempt to mediate between the debtor and the creditors;\n(3) advise the debtor and creditors of assistance programs available;\n(4) attempt to arrive at an agreement to fairly adjust, refinance, or pay the debts; and\n(5) advise, counsel, and assist the debtor and creditors in attempting to arrive at an agreement for the future conduct of financial relations among them.\n(a) A mediator is immune from civil liability for actions within the scope of the position as mediator. A mediator does not have a duty to advise a creditor or debtor about the law or to encourage or assist a debtor or creditor in reserving or establishing legal rights. This subdivision is an addition to and not a limitation of immunity otherwise accorded to a mediator under law.\n(b) A mediator cannot be examined about a communication or document, including work notes, made or used in the course of or because of mediation under this section and section 583.27. This paragraph does not apply to the parties in the dispute in an application to a court by a party to have a mediated settlement agreement set aside or reformed. A communication or document otherwise not privileged does not become privileged because it is used in the cause of mediation. This paragraph is not intended to limit the privilege accorded to communication during mediation by the common law.\nThe mediator may call mediation meetings during the mediation period, which is up to 60 days after the initial mediation meeting.\n(a) If an agreement is reached among the debtor and creditors the mediator shall witness and sign a written mediation agreement, have it signed by the debtor and creditors, and, if applicable, submit the agreement to the Minnesota Rural Finance Authority for approval of debt restructuring.\n(b) The debtor and creditors who are parties to the approved mediation agreement and creditors who have filed claim forms and have not objected to the mediation agreement:\n(1) are bound by the terms of the agreement;\n(2) may enforce the mediation agreement as a legal contract; and\n(3) may use the mediation agreement as a defense against an action contrary to the mediation agreement.\n(c) A debtor may agree to allow a creditor to proceed to enforce a debt against agricultural property before the enforcement is otherwise allowed under subdivision 5, but the debtor or creditor may rescind the agreement within five business days after the debtor and particular creditor both sign the agreement.\n(a) The mediator shall sign and serve to the parties and the director a termination statement by the end of the time period specified in subdivision 5.\n(b) The mediator shall prepare a termination statement that:\n(1) acknowledges that mediation has ended and specifies the date on which the mediation ended; and\n(2) describes or references agreements, if any, reached between a creditor and the debtor including any new line of credit, loan, or other debt issued by a creditor to the debtor as a result of the mediation; and agreements, if any, reached among creditors.\n(c) Mediation agreements may be included as part of the termination statement.",
	"repealed": false
}