{
	"id": "116G.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/116G.03",
	"title": "116G.03 DEFINITIONS.",
	"text": "As used in sections 116G.01 to 116G.14, the terms defined in this section have the meanings ascribed to them.\n\"Board\" means the Minnesota Environmental Quality Board.\n\"Local unit of government\" means any political subdivision of the state, including but not limited to counties, municipalities, townships, together with all agencies and boards thereof.\n\"Government development\" means any development financed in whole or in substantial part, directly or indirectly, by the United States, the state of Minnesota, or agency or political subdivision thereof.\n\"Regional development commission\" means any regional development commission created pursuant to sections 462.381 to 462.396 and the Metropolitan Council created by chapter 473.\nA \"development permit\" includes any building permit, zoning permit, water-use permit, discharge permit, permit for dredging, filling or altering any portion of a watercourse, plat approval, rezoning, certification, variance or other action having the effect of permitting any development as defined in sections 116G.01 to 116G.14.\n\"Development\" means the making of any material change in the use or appearance of any structure or land including but not limited to:\n(1) a reconstruction, alteration of the size, or material change in the external appearance of a structure on the land;\n(2) a change in the intensity of use of the land;\n(3) alteration of a shore or bank of a river, stream, lake or pond;\n(4) commencement of drilling (except to obtain soil samples), mining or excavation;\n(5) demolition of a structure;\n(6) clearing of land as an adjunct to construction;\n(7) deposit of refuse, solid or liquid waste, or fill on a parcel of land;\n(8) the dividing of land into three or more parcels.\n\"Land\" means the earth, water, and air, above, below or on the surface, and includes any improvements or structures customarily regarded as land.\n\"Parcel\" of land means any quantity of land capable of being described with such definiteness that its location and boundaries may be established, which is designated by its owner or developer as land to be used or developed as a unit, or which has been used or developed as a unit.\n\"Developer\" means any person, including a governmental agency, undertaking any development as defined in sections 116G.01 to 116G.14.\n\"Structure\" means anything constructed or installed or portable, the use of which requires a location on a parcel of land. It includes a movable structure while it is located on land which can be used for housing, business, commercial, agricultural, or office purposes either temporarily or permanently. Structure also includes fences, billboards, swimming pools, poles, pipelines, transmission lines, tracks, and advertising signs.",
	"repealed": false
}