{
	"id": "148F.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.09",
	"title": "148F.09 DENIAL, SUSPENSION, OR REVOCATION OF LICENSE.",
	"text": "The board may impose disciplinary action as described in subdivision 2 against an applicant or licensee whom the board, by a preponderance of the evidence, determines:\n(1) has violated a statute, rule, or order that the board issued or is empowered to enforce;\n(2) has engaged in fraudulent, deceptive, or dishonest conduct, whether or not the conduct relates to the practice of licensed alcohol and drug counseling that adversely affects the person's ability or fitness to practice alcohol and drug counseling;\n(3) has engaged in unprofessional conduct or any other conduct which has the potential for causing harm to the public, including any departure from or failure to conform to the minimum standards of acceptable and prevailing practice without actual injury having to be established;\n(4) has been convicted of or has pled guilty or nolo contendere to a felony or gross misdemeanor reasonably related to the provision of alcohol and drug counseling services, or has been shown to have engaged in acts or practices tending to show that the applicant or licensee is incompetent or has engaged in conduct reflecting adversely on the applicant's or licensee's ability or fitness to engage in the practice of alcohol and drug counseling;\n(5) has employed fraud or deception in obtaining or renewing a license, or in passing an examination;\n(6) has had any license, certificate, registration, privilege to take an examination, or other similar authority denied, revoked, suspended, canceled, limited, or not renewed for cause in any jurisdiction or has surrendered or voluntarily terminated a license or certificate during a board investigation of a complaint, as part of a disciplinary order, or while under a disciplinary order;\n(7) has failed to meet any requirement for the issuance or renewal of the person's license. The burden of proof is on the applicant or licensee to demonstrate the qualifications or satisfy the requirements for a license under this chapter;\n(8) has failed to cooperate with an investigation by the board;\n(9) has demonstrated an inability to practice alcohol and drug counseling with reasonable skill and safety as a result of illness, use of alcohol, drugs, chemicals, or any other materials, or as a result of any mental, physical, or psychological condition;\n(10) has engaged in conduct with a client that is sexual or may reasonably be interpreted by the client as sexual, or in any verbal behavior that is seductive or sexually demeaning to a client;\n(11) has been subject to a corrective action or similar, nondisciplinary action in another jurisdiction or by another regulatory authority;\n(12) has been adjudicated as mentally incompetent, mentally ill, or developmentally disabled or as a chemically dependent person, a person dangerous to the public, a sexually dangerous person, or a person who has a sexual psychopathic personality by a court of competent jurisdiction within this state or an equivalent adjudication from another state. Adjudication automatically suspends a license for the duration thereof unless the board orders otherwise;\n(13) fails to comply with a client's request for health records made under sections 144.291 to 144.298, or to furnish a client record or report required by law;\n(14) has engaged in abusive or fraudulent billing practices, including violations of the federal Medicare and Medicaid laws or state medical assistance laws; or\n(15) has engaged in fee splitting. This clause does not apply to the distribution of revenues from a partnership, group practice, nonprofit corporation, or professional corporation to its partners, shareholders, members, or employees if the revenues consist only of fees for services performed by the licensee or under a licensee's administrative authority. Fee splitting includes, but is not limited to:\n(i) dividing fees with another person or a professional corporation, unless the division is in proportion to the services provided and the responsibility assumed by each professional;\n(ii) referring a client to any health care provider as defined in sections 144.291 to 144.298 in which the referring licensee has a significant financial interest, unless the licensee has disclosed in advance to the client the licensee's own financial interest; or\n(iii) paying, offering to pay, receiving, or agreeing to receive a commission, rebate, or remuneration, directly or indirectly, primarily for the referral of clients.\nIf grounds for disciplinary action exist under subdivision 1, the board may take one or more of the following actions:\n(1) refuse to grant or renew a license;\n(2) revoke a license;\n(3) suspend a license;\n(4) impose limitations or conditions on a licensee's practice of alcohol and drug counseling, including, but not limited to, limiting the scope of practice to designated competencies, imposing retraining or rehabilitation requirements, requiring the licensee to practice under supervision, or conditioning continued practice on the demonstration of knowledge or skill by appropriate examination or other review of skill and competence;\n(5) censure or reprimand the licensee;\n(6) impose a civil penalty not exceeding $10,000 for each separate violation, the amount of the civil penalty to be fixed so as to deprive the applicant or licensee of any economic advantage gained by reason of the violation charged, to discourage similar violations or to reimburse the board for the cost of the investigation and proceeding, including, but not limited to, fees paid for services provided by the Office of Administrative Hearings, legal and investigative services provided by the Office of the Attorney General, court reporters, witnesses, reproduction of records, board members' per diem compensation, board staff time, and travel costs and expenses incurred by board staff and board members; or\n(7) any other action justified by the case.\nIn disciplinary actions alleging violations of subdivision 1, clause (4), (12), or (14), a copy of the judgment or proceedings under the seal of the court administrator or of the administrative agency that entered the judgment or proceeding is admissible into evidence without further authentication and constitutes prima facie evidence of its contents.\n(a) In addition to any other remedy provided by law, the board may issue an order to temporarily suspend the credentials of a licensee after conducting a preliminary inquiry to determine if the board reasonably believes that the licensee has violated a statute or rule that the board is empowered to enforce and whether continued practice by the licensee would create an imminent risk of harm to others.\n(b) The order may prohibit the licensee from engaging in the practice of alcohol and drug counseling in whole or in part and may condition the end of a suspension on the licensee's compliance with a statute, rule, or order that the board has issued or is empowered to enforce.\n(c) The order shall give notice of the right to a hearing according to this subdivision and shall state the reasons for the entry of the order.\n(d) Service of the order is effective when the order is served on the licensee personally or by certified mail, which is complete upon receipt, refusal, or return for nondelivery to the most recent address of the licensee provided to the board.\n(e) At the time the board issues a temporary suspension order, the board shall schedule a hearing to be held before its own members. The hearing shall begin no later than 60 days after issuance of the temporary suspension order or within 15 working days of the date of the board's receipt of a request for hearing by a licensee, on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. The hearing is not subject to chapter 14. Evidence presented by the board or the licensee shall be in affidavit form only. The licensee or counsel of record may appear for oral argument.\n(f) Within five working days of the hearing, the board shall issue its order and, if the suspension is continued, schedule a contested case hearing within 30 days of the issuance of the order. Notwithstanding chapter 14, the administrative law judge shall issue a report within 30 days after closing the contested case hearing record. The board shall issue a final order within 30 days of receipt of the administrative law judge's report.\n(a) The right to practice is automatically suspended when:\n(1) a guardian of an alcohol and drug counselor is appointed by order of a district court under sections 524.5-101 to 524.5-502; or\n(2) the counselor is committed by order of a district court under chapter 253B.\n(b) The right to practice remains suspended until the counselor is restored to capacity by a court and, upon petition by the counselor, the suspension is terminated by the board after a hearing or upon agreement between the board and the counselor.\n(a) If the board has probable cause to believe that an applicant or licensee is unable to practice alcohol and drug counseling with reasonable skill and safety due to a mental or physical illness or condition, the board may direct the individual to submit to a mental, physical, or chemical dependency examination or evaluation.\n(1) For the purposes of this section, every licensee and applicant is deemed to have consented to submit to a mental, physical, or chemical dependency examination or evaluation when directed in writing by the board and to have waived all objections to the admissibility of the examining professionals' testimony or examination reports on the grounds that the testimony or examination reports constitute a privileged communication.\n(2) Failure of a licensee or applicant to submit to an examination when directed by the board constitutes an admission of the allegations against the person, unless the failure was due to circumstances beyond the person's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence.\n(3) A licensee or applicant affected under this subdivision shall at reasonable intervals be given an opportunity to demonstrate that the licensee or applicant can resume the competent practice of licensed alcohol and drug counseling with reasonable skill and safety to the public.\n(4) In any proceeding under this subdivision, neither the record of proceedings nor the orders entered by the board shall be used against the licensee or applicant in any other proceeding.\n(b) In addition to ordering a physical or mental examination, the board may, notwithstanding section 13.384 or sections 144.291 to 144.298, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a licensee or applicant without the licensee's or applicant's consent if the board has probable cause to believe that subdivision 1, clause (9), applies to the licensee or applicant. The medical data may be requested from:\n(1) a provider, as defined in section 144.291, subdivision 2, paragraph (i);\n(2) an insurance company; or\n(3) a government agency, including the Department of Human Services.\n(c) A provider, insurance company, or government agency must comply with any written request of the board under this subdivision and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this subdivision, unless the information is false and the provider giving the information knew, or had reason to believe, the information was false.\n(d) Information obtained under this subdivision is private data on individuals as defined in section 13.02, subdivision 12.",
	"repealed": false
}