{
	"id": "515B.2-125",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-125",
	"title": "515B.2-125 ADDITION OF COMMON ELEMENTS.",
	"text": "(a) Unless the declaration provides otherwise, real estate owned by the association may be added to the common interest community, as common elements only, subject to the requirements of this section. Subject to any additional requirements contained in the declaration, the addition of the real estate shall be approved by:\n(1) unit owners entitled to cast at least 67 percent of the votes in the association;\n(2) declarant until the earlier of (i) five years after the recording of the declaration, or (ii) the time at which declarant no longer owns an unsold unit; and\n(3) in the case of a cooperative, all holders of mortgages or contracts for deed on the entire real estate constituting the cooperative.\n(b) The declaration may specify a smaller percentage for unit owner approval only if all of the units are restricted to nonresidential use. A part of the common elements shall not be designated as limited common elements unless approved unanimously in writing by the unit owners.\n(c) The approval by the unit owners shall be deemed to grant to the association a power of attorney coupled with an interest to acquire title to the real estate, if not previously acquired, and to add the real estate to the common interest community on behalf of the unit owners and the holders of all other interests in the units, including without limit the power to execute an amendment to the declaration and any other instruments relating to the acquisition.\n(d) Following the required approvals, the association shall record an amendment to the declaration complying with this chapter, that, at a minimum, (i) legally describes the real estate added, (ii) designates the real estate as part of the common elements, and (iii) subjects the real estate to the declaration.\n(e) In the case of a common interest community using a plat complying with section 515B.2-110, subsection (c), the association shall record an amended CIC plat reflecting the change in the common elements with the amendment to the declaration. The recording of the amendment to the declaration, and amended CIC plat if required, shall complete the addition of the real estate without further action by any person.",
	"repealed": false
}