{
	"id": "315.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.12",
	"title": "315.12 SALE OR ENCUMBRANCE OF REAL ESTATE.",
	"text": "A religious corporation organized under this chapter, by and through its trustees, may sell and convey, encumber, or otherwise dispose of real estate. To do so, the trustees must first be authorized by resolution of the society adopted by a two-thirds vote of the members present and voting at a meeting called for that purpose. Notice of the time, place, and object of the meeting must be given for at least four successive Sabbaths immediately before it on which the society statedly meets for public worship. When a religious society ceases to have stated meetings for public worship, or is unable to give notice of the time and place of the meeting, the corporation may make the sale, conveyance, or encumbrance by its trustees, upon being authorized by resolution adopted at a meeting of which at least 20 days' posted notice has been given. If the society has, for any reason, ceased to exist, for a period of one year, the corporation may sell and convey its property by its trustees upon giving at least 20 days' posted notice upon the premises of its intention to do so. Proof of nonexistence, notice, meeting, and the adoption of resolution may be made by the affidavit of a trustee or member of the society cognizant of them. The affidavit must be recorded with the county recorder where the certificate of incorporation was recorded, and the affidavit and record, or certified copies of it, are presumptive evidence of the facts they contain.\nNo person shall vote at a meeting called to authorize the trustees to sell, convey, encumber, or dispose of the corporation's real estate unless the person is a member of the religious body. No religious corporation shall sell, transfer, or otherwise dispose of its real estate except as provided by the denominational rules and certificates of association of the society as it appears of record in the office of the county recorder of the county. This section does not limit sections 500.01 to 500.20.",
	"repealed": false
}