{
	"id": "326.107",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.107",
	"title": "326.107 CONTINUING EDUCATION.",
	"text": "(a) Architects, professional engineers, land surveyors, landscape architects, geoscientists, and interior designers licensed or certified by this board must obtain the number of professional development hours described in paragraphs (b) to (d) during each two-year period of licensure or certification identified in section 326.105. This requirement must be satisfied during the two-year period prior to biennial renewal except for a carryover permitted from the previous renewal period, which must not exceed 50 percent of the biennial requirement of professional development hours.\n(b) Licensed professional engineers must earn a minimum of 24 professional development hours, of which two must be dedicated to professional ethics, per biennial renewal except for the carryover permitted. The ethics hours must have been earned during the biennium to which they are applied and shall not be used toward carryover.\n(c) Licensed architects, land surveyors, landscape architects, geoscientists, and certified interior designers must earn a minimum of 24 professional development hours, of which two must be dedicated to professional ethics, per biennial renewal except for the carryover permitted. The ethics hours must have been earned during the biennium to which they are applied and shall not be used toward carryover.\n(d) Dual license or certificate holders who have obtained a license or certificate for two professions must earn professional development hours required by the license or certificate requiring the greatest number of professional development hours and must obtain in each profession a minimum of one-third of the total professional development hours required. The remaining one-third requirement may be obtained in either profession at the sole discretion of the licensee or certificate holder.\nContinuing education must consist of learning experiences which enhance and expand the skills, knowledge, and abilities of practicing professionals to remain current and render competent professional services to the public. Practitioners may pursue technical, nontechnical, regulatory, ethical, and business practice needs for a well-rounded education provided the education directly benefits the health, safety, or welfare of the public. Continuing education activities which satisfy the professional development requirement include, but are not limited to, the following:\n(1) completing or auditing college-sponsored courses;\n(2) completing self-study college or non-college-sponsored courses, presented by correspondence, Internet, television, video, or audio, ending with examination or other verification processes;\n(3) participation in seminars, tutorials, televised or videotaped courses, or short courses;\n(4) attending self-sponsored and prepared in-house educational programs;\n(5) completing a study tour with a structured program resulting in a written or visual presentation by the licensee or certificate holder;\n(6) presenting or instructing qualifying courses or seminars. Professional development hours may be earned for preparation time for the initial presentation;\n(7) authoring published papers, articles, or books. Professional development hours earned may equal preparation time spent, may be claimed only following publication, and shall be given for authorship or presentation, but not for both;\n(8) participating in professional examination grading or writing. A maximum of five professional development hours per biennium may be applied from this source. The hours from this source must have been earned during the biennium to which they are applied and shall not be used toward carryover;\n(9) providing professional service to the public which draws upon the licensee's or certificate holder's professional expertise on boards, commissions, and committees such as planning commissions, building code advisory boards, urban renewal boards, or non-work-related volunteer service. A maximum of ten professional development hours per biennium may be applied from this source regardless of the number of boards, commissions, and committees the licensee or certificate holder serves. The hours from this source must have been earned during the biennium to which they are applied and shall not be used toward carryover; and\n(10) patents, after they are granted, for a credit of ten professional development hours. The patent must have been granted during the biennium to which the hours are applied and shall not be used toward carryover.\n(a) Continuing education courses and activities must meet the criteria in paragraphs (b) to (f).\n(b) There must be a clear purpose and objective for each activity which will maintain, improve, or expand skills and knowledge obtained prior to initial licensure or certification or develop new and relevant skills and knowledge.\n(c) The content of each presentation must be well organized and presented in a sequential manner.\n(d) There must be evidence of preplanning which must include the opportunity for input by the target group to be served.\n(e) The presentation must be made by persons who are well qualified by education or experience.\n(f) There must be a provision for documentation of the individual's participation in the activity, including information required for record keeping and reporting.\nThe following licensees or certificate holders are exempt from the continuing education requirements:\n(1) a new licensee or certificate holder for the individual's first biennial renewal; or\n(2) a licensee or certificate holder who has experienced during the biennial renewal a serious illness, injury, or other extenuating circumstances, or who has been called to active duty in the military services for a period of time exceeding 120 consecutive days, as reviewed and approved by the board, and where such activities restrict compliance with the continuing education requirements, as supported by documentation furnished to the board.\n[Repealed, 2014 c 236 s 13]\n[Repealed, 2003 c 85 s 5]\nThe licensee or certificate holder shall maintain a file in which records of courses and activities are kept, including dates, subjects, duration of programs, sponsoring organization, professional development hours earned, registration receipts where appropriate, and other pertinent documentation, for a period of four years after the end of the licensure period for which the hours apply. This information may be required to be produced by licensees or certificate holders. The board may require a licensee or certificate holder to produce this information in connection with verification of a renewal application, a random audit conducted by the board, or upon receipt of a complaint alleging noncompliance on the part of a licensee or certificate holder.\nIf the board rejects professional development hours reported by a licensee or certificate holder in an amount sufficient to reduce the number of nonrejected professional development hours below the required minimum number, the licensee or certificate holder must be notified of the board's rejection of the hours. The licensee or certificate holder has 180 days after notification to substantiate the validity of the rejected hours or to earn other qualifying hours to meet the minimum requirement. The board's rejection of any professional development hours submitted during this 180-day cure period does not extend or expand the cure period. If the board does not reinstate a sufficient number of the rejected professional development hours to meet the required minimum number of professional development hours, or the licensee or certificate holder does not complete or substantiate that the individual has completed other qualifying professional development hours to meet the required minimum number of professional development hours within the specified period of time, the individual's licensure or certification shall be suspended. Professional development hours earned within the 180-day cure period and applied to current renewal may not be applied to the requirements for the following biennial renewal.\n[Repealed, 2003 c 85 s 5]",
	"repealed": false
}