{
	"id": "325E.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.21",
	"title": "325E.21 DEALERS IN SCRAP METAL; RECORDS, REPORTS, AND REGISTRATION.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Commissioner\" means the commissioner of commerce.\n(c) \"Law enforcement agency\" or \"agency\" means a duly authorized municipal, county, state, or federal law enforcement agency.\n(d) \"Person\" means an individual, partnership, limited partnership, limited liability company, corporation, or other entity.\n(e) \"Scrap metal\" means:\n(1) wire and cable commonly and customarily used by communication and electric utilities; and\n(2) copper, aluminum, or any other metal purchased primarily for its reuse or recycling value as raw metal, including metal that is combined with other materials at the time of purchase, but does not include a scrap vehicle as defined in section 168A.1501, subdivision 1.\n(f) \"Scrap metal dealer\" or \"dealer\" means a person engaged in the business of buying or selling scrap metal, or both. The terms include a scrap metal processor, as described in section 168.27, subdivision 3a.\nThe terms do not include a person engaged exclusively in the business of buying or selling new or used motor vehicles, paper or wood products, rags or furniture, or secondhand machinery.\n(g) \"Seller\" means any seller, prospective seller, or agent of the seller.\n(h) \"Proof of identification\" means a driver's license, Minnesota identification card number, or other identification document issued for identification purposes by any state, federal, or foreign government if the document includes the person's photograph, full name, birth date, and signature.\n[Expired, 2013 c 126 s 9; 2014 c 190 s 3]\n(a) Every scrap metal dealer, including an agent, employee, or representative of the dealer, shall create a record written in English, using an electronic record program at the time of each purchase or acquisition of scrap metal or a motor vehicle. The record must include:\n(1) a complete and accurate account or description, including the weight if customarily purchased by weight, of the scrap metal or motor vehicle purchased or acquired;\n(2) the date, time, and place of the receipt of the scrap metal or motor vehicle purchased or acquired and a unique transaction identifier;\n(3) a photocopy or electronic scan of the seller's proof of identification including the identification number;\n(4) the amount paid and the number of the check or electronic transfer used to purchase or acquire the scrap metal or motor vehicle;\n(5) the license plate number and description of the vehicle used by the person when delivering the scrap metal or motor vehicle, including the vehicle make and model, and any identifying marks on the vehicle, such as a business name, decals, or markings, if applicable;\n(6) a statement signed by the seller, under penalty of perjury as provided in section 609.48, attesting that the scrap metal or motor vehicle is not stolen and is free of any liens or encumbrances and the seller has the right to sell it;\n(7) a copy of the receipt, which must include at least the following information: the name and address of the dealer, the date and time the scrap metal or motor vehicle was received by the dealer, an accurate description of the scrap metal or motor vehicle, and the amount paid for the scrap metal or motor vehicle;\n(8) the identity or identifier of the employee completing the transaction; and\n(9) if the seller is attempting to sell copper metal, a photocopy or electronic scan of the seller's:\n(i) current license to sell scrap metal copper issued by the commissioner under subdivision 2c; or\n(ii) the documentation used to support the seller being deemed to hold a license to sell scrap metal copper under subdivision 2c, paragraph (f), clauses (1) to (3).\n(b) The record, as well as the scrap metal or motor vehicle purchased or acquired, shall at all reasonable times be open to the inspection of any properly identified law enforcement officer.\n(c) Except for the purchase or acquisition of detached catalytic converters or motor vehicles, no record is required for property purchased or acquired from merchants, manufacturers, salvage pools, insurance companies, rental car companies, financial institutions, charities, dealers licensed under section 168.27, or wholesale dealers, having an established place of business, or of any goods purchased or acquired at open sale from any bankrupt stock, but a receipt as required under paragraph (a), clause (7), shall be obtained and kept by the person, which must be shown upon demand to any properly identified law enforcement officer.\n(d) The dealer must provide a copy of the receipt required under paragraph (a), clause (7), to the seller in every transaction.\n(e) The commissioner of public safety and law enforcement agencies in the jurisdiction where a dealer is located may conduct inspections and audits as necessary to ensure compliance, refer violations to the city or county attorney for criminal prosecution, and notify the registrar of motor vehicles.\n(f) Except as otherwise provided in this section, a scrap metal dealer or the dealer's agent, employee, or representative may not disclose personal information concerning a customer without the customer's consent unless the disclosure is required by law or made in response to a request from a law enforcement agency. A scrap metal dealer must implement reasonable safeguards to protect the security of the personal information and prevent unauthorized access to or disclosure of the information. For purposes of this paragraph, \"personal information\" is any individually identifiable information gathered in connection with a record under paragraph (a).\n[Repealed, 2015 c 65 art 3 s 38]\n[Repealed, 2015 c 65 art 3 s 38]\nRecords required to be maintained by subdivisions 1a, 1b, 11, 12, and 13 shall be retained by the scrap metal dealer for a period of three years.\nA scrap metal dealer, or the dealer's agent, employer, or representative, shall not purchase or receive a refillable metal beer keg from anyone except the manufacturer of the beer keg, the brewer of the beer that was sold or provided in the keg, or an authorized representative of the manufacturer or brewer.\n(a) The catalytic converter theft prevention pilot project is created to deter the theft of catalytic converters by marking them with vehicle identification numbers or other unique identifiers.\n(b) The commissioner shall establish a procedure to mark the catalytic converters of vehicles most likely to be targeted for theft with unique identification numbers using labels, engraving, theft deterrence paint, or other methods that permanently mark the catalytic converter without damaging its function.\n(c) The commissioner shall work with law enforcement agencies, insurance companies, and scrap metal dealers to identify vehicles that are most frequently targeted for catalytic converter theft and to establish the most effective methods for marking catalytic converters.\n(d) Materials purchased under this program may be distributed to dealers, as defined in section 168.002, subdivision 6, automobile repair shops and service centers, law enforcement agencies, and community organizations to arrange for the marking of the catalytic converters of vehicles most likely to be targeted for theft at no cost to the vehicle owners.\n(e) The commissioner may prioritize distribution of materials to areas experiencing the highest rates of catalytic converter theft.\n(f) The commissioner must make educational information resulting from the pilot program available to law enforcement agencies and scrap metal dealers and is encouraged to publicize the program to the general public.\n(g) The commissioner shall include a report on the pilot project in the report required under section 65B.84, subdivision 2. The report must describe the progress, results, and any findings of the pilot project including the total number of catalytic converters marked under the program, and, to the extent known, whether any catalytic converters marked under the pilot project were stolen and the outcome of any criminal investigation into the thefts.\n(a) Beginning January 1, 2025, a person is prohibited from engaging in the sale of scrap metal copper unless the person has a valid license issued by the commissioner under this subdivision.\n(b) On the first Friday of the months of April and October of each calendar year, from 8:00 a.m. to 5:00 p.m., a scrap metal dealer may purchase up to $25 of scrap metal copper from individuals who do not have an approved license to sell scrap metal copper under this subdivision. All other requirements of subdivision 1b apply and must be documented by the scrap metal dealer on the dates specified in this paragraph.\n(c) A seller of scrap metal copper may apply to the commissioner on a form prescribed by the commissioner. The application form must include, at a minimum:\n(1) the name, permanent address, telephone number, and date of birth of the applicant; and\n(2) an acknowledgment that the applicant obtained the copper by lawful means in the regular course of the applicant's business, trade, or authorized construction work.\n(d) Each application must be accompanied by a nonrefundable fee of $250.\n(e) Within 30 days of the date an application is received, the commissioner may require additional information or submissions from an applicant and may obtain any document or information that is reasonably necessary to verify the information contained in the application. Within 90 days after the date a completed application is received, the commissioner must review the application and issue a license if the applicant is deemed qualified under this section. The commissioner may issue a license subject to restrictions or limitations. If the commissioner determines the applicant is not qualified, the commissioner must notify the applicant and must specify the reason for the denial.\n(f) A person is deemed to hold a license to sell scrap metal copper if the person holds one of the following:\n(1) a license to perform work pursuant to chapter 326B or section 103I.501;\n(2) a document, certificate, or card of competency issued by a municipality to perform work in a given trade or craft in the building trades. The document, certificate, or card must state that the individual is authorized to sell scrap metal copper. This clause is effective January 1, 2025; or\n(3) a Section 608 Technician Certification issued by the United States Environmental Protection Agency.\n(g) A license issued under this subdivision is valid for one year. To renew a license, an applicant must submit a completed renewal application on a form prescribed by the commissioner and a renewal fee of $250. The commissioner may request that a renewal applicant submit additional information to clarify any new information presented in the renewal application. A renewal application submitted after the renewal deadline must be accompanied by a nonrefundable late fee of $500.\n(h) The commissioner may deny a license renewal under this subdivision if:\n(1) the commissioner determines that the applicant is in violation of or noncompliant with federal or state law; or\n(2) the applicant fails to timely submit a renewal application and the information required under this subdivision.\n(i) In lieu of denying a renewal application under paragraph (g), the commissioner may permit the applicant to submit to the commissioner a corrective action plan to cure or correct deficiencies.\n(j) The commissioner may suspend, revoke, or place on probation a license issued under this subdivision if:\n(1) the applicant engages in fraudulent activity that violates state or federal law;\n(2) the commissioner receives consumer complaints that justify an action under this subdivision to protect the safety and interests of consumers;\n(3) the applicant fails to pay an application license or renewal fee; or\n(4) the applicant fails to comply with a requirement established in this subdivision.\n(k) This subdivision does not apply to transfers by or to an auctioneer who is in compliance with chapter 330 and acting in the person's official role as an auctioneer to facilitate or conduct an auction of scrap metal.\n(l) The commissioner must enforce this subdivision under chapter 45.\nA scrap metal dealer or the dealer's agent, employee, or representative shall pay for all scrap metal purchases only by check or electronic transfer.\n(a) Every scrap metal dealer shall register annually with the commissioner of public safety.\n(b) The scrap metal dealer shall pay to the commissioner of public safety a $50 annual fee.\n(c) The commissioner of public safety may cancel or deny the registration of a scrap metal dealer convicted of a felony violation under subdivision 6.\n(d) The names and addresses of scrap metal dealers registered under this subdivision are public data on individuals, as defined in section 13.02, subdivision 15, and must be provided by the commissioner of public safety upon request.\nEach scrap metal dealer shall review the educational materials provided by the superintendent of the Bureau of Criminal Apprehension under section 299C.25 and ensure that all employees do so as well. A scrap metal dealer engaged in the purchase or acquisition of used catalytic converters shall ensure employees handling catalytic converter transactions are specifically trained and familiar with the additional requirements for catalytic converters.\n(a) A person who intentionally violates a provision of this section, except for subdivision 11, 12, or 13, is guilty of a misdemeanor.\n(b) A person who violates subdivision 11, 12, or 13 is guilty of a:\n(1) misdemeanor, if the person possesses, purchases, or acquires one catalytic converter;\n(2) gross misdemeanor, if the person possesses, purchases, or acquires two catalytic converters;\n(3) felony, and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both, if the person possesses, purchases, or acquires at least three but not more than ten catalytic converters;\n(4) felony, and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both, if the person possesses, purchases, or acquires more than ten but not more than 70 catalytic converters; and\n(5) felony, and may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $100,000, or both, if the person possesses, purchases, or acquires more than 70 catalytic converters.\nThe number of catalytic converters possessed, purchased, or acquired by a person within any six month period may be aggregated and the person charged accordingly. When two or more offenses are committed by the same person in two or more counties, the person may be prosecuted in any county in which one of the offenses was committed for all of the offenses aggregated under this paragraph.\nWhen the court imposes a criminal penalty pursuant to subdivision 6, and orders the offender to pay restitution to any identifiable victim, the amount of the out-of-pocket losses considered by the court must include the costs and expenses of replacing a catalytic converter and may include any other restitution costs allowed under section 611A.04.\nA scrap metal dealer may purchase aluminum cans without complying with this section.\n(a) Whenever a law enforcement official from any agency has probable cause to believe that property in the possession of a scrap metal dealer is stolen or is evidence of a crime and notifies the dealer not to sell the item, the scrap metal dealer shall not (1) process or sell the item, or (2) remove or allow its removal from the premises. This investigative hold must be confirmed in writing by the originating agency within 72 hours and will remain in effect for 30 days from the date of initial notification, or until the investigative hold is canceled or renewed, or until a law enforcement notification to confiscate or directive to release is issued, whichever comes first.\n(b) If an item is identified as stolen or evidence in a criminal case, a law enforcement official may:\n(1) physically confiscate and remove it from the scrap metal dealer, pursuant to a written notification;\n(2) place the item on hold or extend the hold under paragraph (a) and leave it in the licensed premise; or\n(3) direct its release to a registered owner or owner's agent.\nWhen an item is confiscated, the person doing so shall provide identification upon request of the scrap metal dealer, and shall provide the name and telephone number of the confiscating agency and investigator, and the case number related to the confiscation.\n(c) A dealer may request seized property be returned in accordance with section 626.04.\n(d) When an investigative hold or notification to confiscate is no longer necessary, the law enforcement official or designee shall so notify the licensee.\n(e) A scrap metal dealer may process or otherwise dispose of the scrap metal if:\n(1) a notification to confiscate is not issued during the investigative hold; or\n(2) a law enforcement official does not physically remove the motor vehicle from the premises within 15 calendar days from issuance of a notification to confiscate.\n(f) If a scrap metal dealer is required to hold the metal at the direction of law enforcement for purposes of investigation or prosecution or it is seized by law enforcement, the scrap metal dealer, and any other victim, shall be entitled to seek restitution against the person who delivered the metal to the scrap metal dealer in any criminal case that may arise from the investigation, including any out-of-pocket expenses for storage and lost profit.\n(a) Each scrap metal dealer shall install and maintain at each location video surveillance cameras, still digital cameras, or similar devices positioned to record or photograph a frontal view showing a readily identifiable image of the face of each seller of scrap metal who enters the location. The scrap metal dealer shall also photograph the seller's vehicle, including license plate, either by video camera or still digital camera, so that an accurate and complete description of it may be obtained from the recordings made by the cameras. Photographs and recordings must be clearly and accurately associated with their respective records.\n(b) The video camera or still digital camera must be kept in operating condition and must be shown upon request to a properly identified law enforcement officer for inspection. The camera must record and display the accurate date and time. The video camera must be turned on at all times when the location is open for business and at any other time when scrap metal is purchased.\n(c) Recordings and images required by paragraph (a) shall be retained by the scrap metal dealer for a minimum period of 60 days and shall at all reasonable times be open to the inspection of any properly identified law enforcement officer.\n(d) If the scrap metal dealer does not purchase some or any scrap metal at a specific business location, the dealer need not comply with this subdivision with respect to those purchases.\nThis section preempts and supersedes any local ordinance or rule concerning the same subject matter.\n(a) It is unlawful for a person to possess a used catalytic converter that is not attached to a motor vehicle except when:\n(1) the converter is marked with the date the converter was removed from the vehicle and the identification number of the vehicle from which the converter was removed or, as an alternative to the vehicle identification number, any numbers, bar codes, stickers, or other unique markings, whether resulting from the pilot project created under subdivision 2b or some other source; or\n(2) the converter has been EPA certified for reuse as a replacement part.\n(b) If an alternative number to the vehicle identification number is used, it must be under a numbering system that can be immediately linked to the vehicle identification number by law enforcement. The marking of the vehicle identification or alternative number may be made in any permanent manner, including but not limited to an engraving or use of permanent ink. The marking must clearly and legibly indicate the date removed and the vehicle identification number or the alternative number and the method by which law enforcement can link the converter to the vehicle identification number.\nIt is unlawful for a person who is not a registered scrap metal dealer to purchase or acquire a used catalytic converter that is not EPA certified for reuse as a replacement part except when the catalytic converter is attached to a motor vehicle. A used catalytic converter that is EPA certified for reuse as a replacement part may be sold to a person or business for reuse as a replacement part for a motor vehicle when the requirements of subdivision 11 are met.\n(a) It is unlawful for a scrap metal dealer to purchase or acquire a used catalytic converter not attached to a motor vehicle unless the converter is marked as required under subdivision 11 and the seller provides a copy of the vehicle's title or registration in order to demonstrate the seller's ownership interest in the property. A bona fide business engaged in vehicle dismantling, vehicle demolishing, scrap metal recycling, or automotive repair services may remove a converter as part of auto repair work or auto recycling without a copy of the vehicle's title or registration, if the business provides:\n(1) the identity of the seller's business and a written or electronic signature of the seller;\n(2) an itemized list of each detached catalytic converter being sold that includes the donor vehicle identification number or a unique alternative number that can be readily linked to the vehicle identification number by law enforcement; and\n(3) the date of the removal of each catalytic converter.\nThe registered scrap metal dealer purchasing or acquiring the catalytic converters must keep the transaction record, along with the identity and signature of the employee completing the transaction.\n(b) Notwithstanding paragraph (a), a scrap metal dealer may purchase or acquire a catalytic converter from a person possessing an old vehicle that is no longer registered and titled without a copy of the registration or title, if the person has an official law enforcement report stating that the agency has verified the person's ownership prior to the removal of the converter from the vehicle.\n(c) A scrap metal dealer who purchases or acquires a used catalytic converter not attached to a motor vehicle must record the information received under this subdivision and subdivision 11, including the vehicle identification number or alternative number and the method by which law enforcement can link the converter to the vehicle identification number; make the information available upon request to law enforcement; and, effective beginning August 1, 2024, enter the information into an electronic database available to a law enforcement agency as approved by the commissioner of public safety.\n(d) A scrap metal dealer is prohibited from processing, selling, or removing a catalytic converter from the dealer's premises for at least seven days after the catalytic converter purchase or acquisition by the scrap metal dealer.\n(e) Paragraphs (c) and (d) do not apply to a scrap metal dealer that purchases or acquires a catalytic converter directly from a different scrap metal dealer that has certified in writing that it has fully complied with paragraphs (c) and (d) with respect to the catalytic converter.\n(f) A payment for a catalytic converter must not be made until at least five days after sale to the scrap metal dealer. Payment must be sent by check to the seller's address or a bank account in the seller's name.\n(g) Notwithstanding paragraph (f), a scrap metal dealer may pay a bona fide business engaged in vehicle dismantling, vehicle demolishing, scrap metal recycling, or automotive repair services at any time for a direct sale of a catalytic converter by the bona fide business to the scrap metal dealer. Payment must be made by check payable to the seller or deposited electronically in a bank account in the seller's name.\nIt is not a violation of subdivisions 11, 12, and 13 for a scrap metal dealer to purchase or acquire catalytic converters from a law enforcement agency and marked as recovered contraband as provided in section 609.5316, subdivision 1, paragraph (b).\n(a) Scrap metal dealers must completely and accurately enter all the record information required by subdivision 1b for the purchase or acquisition of a motor vehicle into the electronic database approved by the commissioner of public safety described in subdivision 13, paragraph (c), by the close of business each day.\n(b) A scrap metal dealer must display a sign of sufficient size, in a conspicuous place in the premises, which informs all patrons that transactions are reported to law enforcement daily.\n(c) The commissioner of public safety must make the information on the electronic database available to a law enforcement agency, including federal law enforcement agencies and law enforcement agencies with jurisdiction outside of Minnesota.",
	"repealed": false
}