{
	"id": "97A.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.055",
	"title": "97A.055 GAME AND FISH FUND.",
	"text": "The game and fish fund is established as a fund in the state treasury.\nThe commissioner of management and budget shall credit to the game and fish fund all money received under the game and fish laws and all income from state lands acquired by purchase or gift for game or fish purposes, including receipts from:\n(1) licenses and permits issued;\n(2) fines and forfeited bail;\n(3) sales of contraband, wild animals, and other property under the control of the division, except as provided in section 97A.225, subdivision 8, clause (2);\n(4) fees from advanced education courses for hunters and trappers;\n(5) reimbursements of expenditures by the division;\n(6) contributions to the division; and\n(7) revenue credited to the game and fish fund under section 297A.94, paragraph (h), clause (1).\n(a) Federal aid reimbursements under the Federal Aid in Wildlife Restoration Act, United States Code, title 16, sections 669 to 669i, shall be deposited in the game and fish fund.\n(b) Federal aid reimbursements under the Federal Aid in Fish Restoration Act, United States Code, title 16, sections 777 to 777k, shall be deposited in the game and fish fund.\nMoney for the certified costs under section 89.0385 is transferred annually for reimbursement of certified costs on state lands acquired by purchase or gift for game and fish purposes.\nTo reduce yearly fluctuations of the game and fish fund balance and to provide improved long-range planning of the fund, the policy of the state is to make fee adjustments as part of the budget process. Agency responsibilities are:\n(1) The commissioner of natural resources must make specific requests for fee adjustments for all receipt items in the game and fish fund as a part of the fee report.\n(2) The commissioner of management and budget must review the fee report and make recommendations for each fee. The commissioner of management and budget must submit a six-year projection on revenues and expenditures to the legislature.\n(a) By December 15 each year, the commissioner shall submit to the legislative committees having jurisdiction over appropriations and the environment and natural resources reports on each of the following:\n(1) the amount of revenue from the following and purposes for which expenditures were made:\n(i) the small-game license surcharge under section 97A.475, subdivision 4;\n(ii) the Minnesota migratory-waterfowl stamp under section 97A.475, subdivision 5, clause (1);\n(iii) the trout-and-salmon stamp under section 97A.475, subdivision 10;\n(iv) the pheasant stamp under section 97A.475, subdivision 5, clause (2);\n(v) the wild-turkey management account under section 97A.075, subdivision 5;\n(vi) the deer license donations and surcharges under section 97A.475, subdivisions 3, paragraph (b), and 3a; and\n(vii) the walleye stamp under section 97A.475, subdivision 10a;\n(2) the amounts available under section 97A.075, subdivision 1, paragraphs (b) and (c), and the purposes for which these amounts were spent;\n(3) money credited to the game and fish fund under this section and purposes for which expenditures were made from the fund;\n(4) outcome goals for the expenditures from the game and fish fund; and\n(5) summary and comments of citizen oversight committee reviews under subdivision 4b.\n(b) The report must include the commissioner's recommendations, if any, for changes in the laws relating to the stamps and surcharge referenced in paragraph (a).\n[Repealed, 2001 c 161 s 58]\n(a) The commissioner shall appoint a committee of at least 15 affected persons to:\n(1) review the reports prepared under subdivision 4;\n(2) review annual outcomes achieved from game and fish fund expenditures; and\n(3) make recommendations to the legislature and the commissioner for desired outcomes related to:\n(i) protecting, restoring, and enhancing fish and wildlife habitat;\n(ii) fish and wildlife population management;\n(iii) fish and wildlife monitoring and research;\n(iv) communications and engagement; and\n(v) improvements in the management and use of money in the game and fish fund.\n(b) The chair of the Fish and Wildlife Advisory Committee is appointed by the commissioner.\n(c) By September 15 each year, the committee must submit a report to the commissioner and to the chairs and ranking minority members of the legislative committees with jurisdiction over natural resources finance and policy. Each even-numbered year, the report must focus on biennial budget outcomes achieved from game and fish fund expenditures. Each odd-numbered year, the report must focus on outcomes related to protecting habitat, fish and wildlife population management, monitoring and research, and communications and engagement.\n(d) Annually, the Fish and Wildlife Advisory Committee must hold a meeting for the public to review proposed priorities for the next reporting period. The meeting must be organized to allow virtual participation.\n(e) The committee authorized under this subdivision is not an advisory council or committee governed by section 15.059 and is not subject to section 15.059. Committee members appointed by the commissioner may request reimbursement for mileage expenses in the same manner and amount as authorized by the commissioner's plan adopted under section 43A.18, subdivision 2. Committee members must not receive daily compensation for committee activities. The Fish and Wildlife Advisory Committee expires June 30, 2033.\nThe commissioner may pay a pelting fee to a person who recovers, treats, preserves, or transports the pelt of a fur-bearing animal that is accidentally killed or is lawfully taken under section 97B.655. The commissioner may adopt rules setting pelting fees and governing their payment. The amounts necessary to pay the fees are appropriated from the game and fish fund to the commissioner.\nExcept as provided in section 97A.475, subdivision 4, revenue from the sale of game and fish licenses and permits, excluding revenue from hunting and fishing stamps, shall not be used to acquire land in fee or easement.",
	"repealed": false
}