{
	"id": "129D.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/129D.17",
	"title": "129D.17 ARTS AND CULTURAL HERITAGE FUND.",
	"text": "The arts and cultural heritage fund is established in the Minnesota Constitution, article XI, section 15. All money earned by the fund must be credited to the fund.\n(a) Funding from the arts and cultural heritage fund may be spent only for arts, arts education, and arts access, and to preserve Minnesota's history and cultural heritage. A project or program receiving funding from the arts and cultural heritage fund must include measurable outcomes, and a plan for measuring and evaluating the results. A project or program must be consistent with current scholarship, or best practices, when appropriate and must incorporate state-of-the-art technology when appropriate.\n(b) Funding from the arts and cultural heritage fund may be granted for an entire project or for part of a project so long as the recipient provides a description and cost for the entire project and can demonstrate that it has adequate resources to ensure that the entire project will be completed.\n(c) Money from the arts and cultural heritage fund shall be expended for benefits across all regions and residents of the state.\n(d) A state agency or other recipient of a direct appropriation from the arts and cultural heritage fund must compile and submit all information for funded projects or programs, including the proposed measurable outcomes and all other items required under section 3.303, subdivision 10, to the Legislative Coordinating Commission as soon as practicable or by January 15 of the applicable fiscal year, whichever comes first. The Legislative Coordinating Commission must post submitted information on the website required under section 3.303, subdivision 10, as soon as it becomes available.\n(e) Grants funded by the arts and cultural heritage fund must be implemented according to section 16B.98 and must account for all expenditures of funds. Priority for grant proposals must be given to proposals involving grants that will be competitively awarded.\n(f) All money from the arts and cultural heritage fund must be for projects located in Minnesota.\n(g) When practicable, a direct recipient of an appropriation from the arts and cultural heritage fund shall prominently display on the recipient's website home page the legacy logo required under Laws 2009, chapter 172, article 5, section 10, as amended by Laws 2010, chapter 361, article 3, section 5, accompanied by the phrase \"Click here for more information.\" When a person clicks on the legacy logo image, the website must direct the person to a web page that includes both the contact information that a person may use to obtain additional information, as well as a link to the Legislative Coordinating Commission website required under section 3.303, subdivision 10.\n(h) Future eligibility for money from the arts and cultural heritage fund is contingent upon a state agency or other recipient satisfying all applicable requirements in this section, as well as any additional requirements contained in applicable session law. If the Office of the Legislative Auditor, in the course of an audit or investigation, publicly reports that a recipient of money from the arts and cultural heritage fund has not complied with the laws, rules, or regulations in this section or other laws applicable to the recipient, the recipient must be listed in an annual report to the legislative committees with jurisdiction over the legacy funds. The list must be publicly available. The legislative auditor shall remove a recipient from the list upon determination that the recipient is in compliance. A recipient on the list is not eligible for future funding from the arts and cultural heritage fund until the recipient demonstrates compliance to the legislative auditor.\n(i) Any state agency or organization requesting a direct appropriation from the arts and cultural heritage fund must inform the house of representatives and senate committees having jurisdiction over the arts and cultural heritage fund, at the time the request for funding is made, whether the request is supplanting or is a substitution for any previous funding that was not from a legacy fund and was used for the same purpose.\nFor a project receiving an appropriation or appropriations from the arts and cultural heritage fund totaling $10,000,000 or more in a biennium, the attorney general must review and approve all contracts and real estate transactions and must exercise due diligence in the best interests of the state.\nAt least 47 percent of the total appropriations from the arts and cultural heritage fund in a fiscal biennium must be for grants and services awarded through the Minnesota State Arts Board, or regional arts councils subject to appropriation.\nIn any fiscal year, at least five percent of that year's projected tax receipts determined by the most recent forecast for the arts and cultural heritage fund must not be appropriated.\nEach fiscal agent who receives funding from the arts and cultural heritage fund in a biennial budget must submit a report by February 15 the next odd-numbered year to the chairs and ranking minority members of the legislative committees with jurisdiction over the legacy arts and cultural heritage fund. Each report must cover the two years prior to the report and include:\n(1) an accounting of funding that has been distributed;\n(2) an accounting of funding not yet expended;\n(3) summary information on programs supported by the funding;\n(4) an assessment of whether the funding celebrates cultural diversity or reaches diverse communities in Minnesota;\n(5) summary information on competitive grant programs, when offered; and\n(6) grant information for grants provided to individuals, entities, or organizations, including whether the programs or projects awarded funding have been completed.",
	"repealed": false
}