{
	"id": "144.0572",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0572",
	"title": "144.0572 CRIMINAL HISTORY BACKGROUND CHECKS ON APPLICANTS, LICENSEES, AND OTHER OCCUPATIONS REGULATED BY COMMISSIONER OF HEALTH.",
	"text": "(a) Beginning January 1, 2018, an applicant for initial licensure, temporary licensure, or relicensure after a lapse in licensure as an audiologist or speech-language pathologist, a speech-language pathology assistant, or an applicant for initial certification as a hearing instrument dispenser, must submit to a criminal history records check of state data completed by the Bureau of Criminal Apprehension (BCA) and a national criminal history records check, including a search of the records of the Federal Bureau of Investigation (FBI).\n(b) Beginning January 1, 2020, an applicant for a renewal license or certificate as an audiologist, speech-language pathologist, or hearing instrument dispenser who was licensed or obtained a certificate before January 1, 2018, must submit to a criminal history records check of state data completed by the BCA and a national criminal history records check, including a search of the records of the FBI.\n(c) An applicant must submit to a background study under chapter 245C.\n(d) The criminal history records check must be structured so that any new crimes that an applicant or licensee or certificate holder commits after the initial background check are flagged in the BCA's or FBI's database and reported back to the commissioner of human services.\n[See Note.]\n(a) The commissioner shall contract with the Department of Human Services to process the criminal history background check requirements through NETStudy 2.0, as defined in section 245C.02.\n(b) The Department of Human Services shall conduct the criminal history background checks according to section 144.057, except that:\n(1) all applicants must submit to a fingerprint-based criminal history records check of state data completed by the BCA and a national criminal history records check, including a search of the records of the FBI;\n(2) the Department of Human Services shall complete the check and the study and notify the commissioner of health if the applicant, licensee, or certificate holder has a criminal history as defined in section 245C.15; and\n(3) the Department of Human Services shall simultaneously conduct a background study on each applicant according to chapter 245C.\n(c) When making a determination whether to issue a license, deny a license, or issue a conditional license or other credential to practice an occupation regulated by the Department of Health, the commissioner or the commissioner's designee shall evaluate a criminal conviction, guilty plea, Alford plea, judicial determination, or preponderance of evidence to determine an applicant's risk of harm using the criteria in section 364.03.\n(d) Before taking disciplinary action against an applicant or a licensee based on a criminal conviction, judicial determination, admission in court, Alford plea, or preponderance of evidence, the commissioner of health shall provide the applicant or licensee an opportunity to complete or challenge the accuracy of the criminal history information. The applicant or licensee shall have 30 calendar days following notice from the commissioner of the intent to deny licensure or take disciplinary action to request an opportunity to correct or complete the record prior to the commissioner taking disciplinary action. The commissioner shall provide the applicant up to 180 days to challenge the accuracy or completeness of the report with the agency responsible for the record. This subdivision does not affect the right of the subject of the data to contest the accuracy or completeness under section 13.04, subdivision 4.\n(e) The checks and studies must be structured so that any new crimes that an applicant or licensee commits after the initial background check are flagged in the BCA's or FBI's database and reported back to the commissioner of human services.\n(a) Applicants, licensees, and individuals seeking a credential to practice one of the public health occupations listed in subdivision 1 must submit a complete criminal history records check consent form, a complete background study consent form, and a full set of fingerprints as required by the Department of Human Services in section 245C.05.\n(b) The applicant or license holder is responsible for paying to the Department of Human Services all fees associated with the preparation of the fingerprints, the criminal records check consent form, and the criminal background check.",
	"repealed": false
}