{
	"id": "142D.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.23",
	"title": "142D.23 CHILD CARE PROVIDER ACCESS TO TECHNOLOGY GRANTS.",
	"text": "The commissioner of children, youth, and families shall award money under this section to one or more eligible organizations to offer grants or other supports to eligible child care providers for technology intended to improve the providers' business practices.\n(a) To be eligible for a grant from the department under this section, an organization must be a public entity or private for-profit or nonprofit organization with:\n(1) the ability to develop technology products for child care business management; or\n(2) the ability to offer training, technical assistance, coaching, or other supports to help child care providers learn to use technology products for child care business management.\n(b) Grantees may award grants or offer supports under this section to the following types of child care providers:\n(1) family or group family child care homes licensed under Minnesota Rules, chapter 9502;\n(2) child care centers licensed under Minnesota Rules, chapter 9503; and\n(3) Tribally licensed child care programs.\nGrantees must use money received under this section, either directly or through grants to eligible child care providers, for one or more of the following purposes:\n(1) the purchase of computers or mobile devices for use in business management;\n(2) access to the Internet through the provision of necessary hardware such as routers or modems or by covering the costs of monthly fees for Internet access;\n(3) covering the costs of subscription to child care management software;\n(4) covering the costs of training in the use of technology for business management purposes; or\n(5) other services as determined by the commissioner.\nThe commissioner must develop a process to award grants under this section that includes application forms, timelines, reporting requirements, and standards for renewal.",
	"repealed": false
}