{
	"id": "142E.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.50",
	"title": "142E.50 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Applicant\" has the meaning given in section 142E.01, subdivision 2.\n\"Child care assistance program\" means any of the assistance programs under this chapter.\n\"Commissioner\" means the commissioner of children, youth, and families.\n\"Controlling individual\" has the meaning given in section 142B.01, subdivision 8.\n\"County\" means a local county child care assistance program staff or subcontracted staff, or a county investigator acting on behalf of the commissioner.\n\"Department\" means the Department of Children, Youth, and Families.\n\"Financial misconduct\" or \"misconduct\" means an entity's or individual's acts or omissions that result in fraud and abuse or error against the Department of Children, Youth, and Families. Financial misconduct includes acting as a recruiter offering conditional employment on behalf of a provider that has received funds from the child care assistance program.\n\"Identify\" means to furnish the full name, current or last known address, phone number, and email address of the individual or business entity.\n\"License holder\" has the meaning given in section 142B.01, subdivision 17.\n\"Mail\" means the use of any mail service with proof of delivery and receipt.\n\"Provider\" means either a provider as defined in section 142E.01, subdivision 22, or a legal unlicensed provider as defined in section 142E.01, subdivision 19.\n\"Recipient\" means a family receiving assistance as defined under section 142E.01, subdivision 14.\n\"Recruiter offering conditional employment\" means a child care provider, center owner, director, manager, license holder, or other controlling individual or agent who, for pecuniary gain, directly procures or solicits an applicant or a prospective employee and requires as a condition of employment that the applicant or prospective employee has one or more children who are eligible for or receive child care assistance.\n\"Terminate\" means revocation of participation in the child care assistance program.",
	"repealed": false
}