{
	"id": "97C.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.515",
	"title": "97C.515 IMPORTED MINNOWS.",
	"text": "A person may not bring live minnows into the state except as provided in this section.\n(a) A person may transport live minnows through the state with a permit from the commissioner. The permit must state the name and address of the person, the number and species of minnows, the point of entry into the state, the destination, and the route through the state. The permit is not valid for more than 12 hours after it is issued.\n(b) Minnows transported under this subdivision must be in a tagged container. The tag number must correspond with tag numbers listed on the minnow transportation permit.\n(c) The commissioner may require the person transporting minnow species found on the official list of viral hemorrhagic septicemia susceptible species published by the United States Department of Agriculture, Animal and Plant Health Inspection Services, to provide health certification for viral hemorrhagic septicemia. The certification must disclose any incidentally isolated replicating viruses, and must be dated within the 12 months preceding transport.\n[Repealed, 2008 c 307 s 21]\nLive minnows used for feeding fish at a licensed private fish hatchery or aquatic farm must be obtained within the state. Dead minnows may be imported for feeding hatchery or aquatic farm fish according to section 97C.341, paragraph (d).\n(a) The commissioner may issue a special permit, without a fee, to allow a person with a private fish hatchery license, which private fish hatchery has been designated as a containment facility under section 17.4982, subdivision 8, to import live minnows from other states for export. A containment facility for the purposes of this section applies to live minnows imported for later export and does not need to comply with section 17.4982, subdivision 8, clause (4). The permit shall include conditions necessary to avoid spreading aquatic invasive species and fish pathogens. Permits shall not be issued to containment facilities located within a 25-year floodplain.\n(b) An applicant for a permit under this subdivision shall submit to the commissioner sufficient information to identify potential threats to native plant and animal species and an evaluation of the feasibility of the proposal. The permit may include reasonable restrictions on importation, transportation, possession, containment, disease certification, and disposal of minnows to ensure that native species are protected. The permit may have a term of up to two years and may be modified, suspended, or revoked by the commissioner for cause, including violation of a condition of the permit.\n(c) The premises, property, vehicles, private aquatic life, and equipment that are part of a containment facility permitted under this subdivision are subject to reasonable and necessary inspections at reasonable times by a fish health specialist delegated by the commissioner. The owner, operator, or designee may be present when inspections are conducted. During the inspection, a representative sample of imported minnows may be collected for the purpose of fish pathogen or invasive species screening.\n(d) The commissioner may require the applicant to furnish evidence of financial responsibility at the time of application for a permit under this section, as prescribed by the commissioner.",
	"repealed": false
}