{
	"id": "48.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.15",
	"title": "48.15 SPECIAL POWERS.",
	"text": "In addition to the inherent and granted powers of corporations in general, any such bank shall have power to exercise, by its board of directors, or duly authorized officers and agents, subject to law, all such powers as shall be necessary to carry on the business of banking by discounting bills, notes, and other evidences of debt, by receiving deposits, by buying and selling gold and silver bullion, foreign coin, promissory notes, mortgages, and other evidences of debt legal for investment, and foreign and inland bills of exchange, by lending money on real and personal securities and receiving interest on any of the same in advance, by conducting savings promotion raffles in the manner and subject to the requirements set forth in section 609.761, subdivision 6, and by exercising all the usual and incidental powers and privileges belonging to the business; but it shall not transact any business, except such as is incidental and necessarily preliminary to its establishment, until authorized by the commissioner to commence business.\nThe commissioner of commerce may authorize banks, bank and trust companies, or trust companies organized under the laws of this state to engage in any banking or trust activity in which banks subject to the jurisdiction of the federal government may hereafter be authorized to engage by federal legislation, ruling, or regulation and those activities authorized in section 48.61, subdivision 7, paragraph (a), clause (3). The commissioner may not authorize state banks as defined by section 48.01, to engage in any activity prohibited by the laws of this state.\nThe commissioner may authorize a state bank to undertake any activities, exercise any powers, or make any investments that are authorized by chapter 50, as of August 1, 1995, for any state savings bank, or that become authorized by chapter 50, for state savings banks after August 1, 1995. The commissioner may not authorize state banks to engage in any banking activity prohibited by the laws of this state.\nNo such bank shall act as paying agent of any municipality or other public issuer of obligations, other than an issuer within whose corporate limits the principal office of the bank is situated, unless the bank is authorized to execute the powers conferred in section 48A.07.\n(a) A state bank may act as trustee or custodian:\n(1) of a self-employed retirement plan under the federal Self-Employed Individuals Tax Retirement Act of 1962, as amended;\n(2) of a medical savings account under the federal Health Insurance Portability and Accountability Act of 1996, as amended;\n(3) of a health savings account under the Medicare Prescription Drug, Improvement, and Modernization Act of 2003, as amended; and\n(4) of an individual retirement account under the federal Employee Retirement Income Security Act of 1974, as amended, if the bank's duties as trustee or custodian are essentially ministerial or custodial in nature and the funds are invested only (i) in the bank's own savings or time deposits, except that health savings accounts may also be invested in transaction accounts. Health savings accounts invested in transaction accounts shall not be subject to the restrictions in section 48.512, subdivision 3; or (ii) in any other assets at the direction of the customer if the bank does not exercise any investment discretion, invest the funds in collective investment funds administered by it, or provide any investment advice with respect to those account assets.\n(b) Affiliated discount brokers may be utilized by the bank acting as trustee or custodian for self-directed IRAs, if specifically authorized and directed in appropriate documents. The relationship between the affiliated broker and the bank must be fully disclosed. Brokerage commissions to be charged to the IRA by the affiliated broker should be accurately disclosed. Provisions should be made for disclosure of any changes in commission rates prior to their becoming effective. The affiliated broker may not provide investment advice to the customer.\n(c) All funds held in the fiduciary capacity may be commingled by the financial institution in the conduct of its business, but individual records shall be maintained by the fiduciary for each participant and shall show in detail all transactions engaged under authority of this subdivision.\n(d) The authority granted by this section is in addition to, and not limited by, section 47.75.",
	"repealed": false
}