{
	"id": "149A.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.71",
	"title": "149A.71 FUNERAL INDUSTRY PRACTICES; PRICE DISCLOSURES.",
	"text": "In selling or offering to sell funeral goods, funeral services, burial site goods, or burial site services to the public, it is an unfair or deceptive act or practice for a funeral provider to fail to furnish accurate price information disclosing the cost to the purchaser for each of the specific funeral goods, funeral services, burial site goods, or burial site services used in connection with the disposition of dead human bodies to persons inquiring about the purchase of funerals. Any funeral provider who complies with the preventive requirements in subdivision 2 is not engaged in the unfair or deceptive acts or practices defined in this section.\n(a) To prevent unfair or deceptive acts or practices, the requirements of this subdivision must be met. This subdivision applies to natural organic reduction and naturally reduced remains goods and services effective July 1, 2025.\n(b) Funeral providers must tell persons who ask by telephone about the funeral provider's offerings or prices any accurate information from the price lists described in paragraphs (c) to (e) and any other readily available information that reasonably answers the questions asked.\n(c) Funeral providers must make available for viewing to people who inquire in person about the offerings or prices of funeral goods or burial site goods, separate printed or typewritten price lists using a ten-point font or larger. Each funeral provider must have a separate price list for each of the following types of goods that are sold or offered for sale:\n(1) caskets;\n(2) alternative containers;\n(3) outer burial containers;\n(4) alkaline hydrolysis containers;\n(5) cremation containers;\n(6) hydrolyzed remains containers;\n(7) cremated remains containers;\n(8) markers;\n(9) headstones; and\n(10) naturally reduced remains containers.\n(d) Each separate price list must contain the name of the funeral provider's place of business, address, and telephone number and a caption describing the list as a price list for one of the types of funeral goods or burial site goods described in paragraph (c), clauses (1) to (10). The funeral provider must offer the list upon beginning discussion of, but in any event before showing, the specific funeral goods or burial site goods and must provide a photocopy of the price list, for retention, if so asked by the consumer. The list must contain, at least, the retail prices of all the specific funeral goods and burial site goods offered which do not require special ordering, enough information to identify each, and the effective date for the price list. However, funeral providers are not required to make a specific price list available if the funeral providers place the information required by this paragraph on the general price list described in paragraph (e).\n(e) Funeral providers must give a printed price list, for retention, to persons who inquire in person about the funeral goods, funeral services, burial site goods, or burial site services or prices offered by the funeral provider. The funeral provider must give the list upon beginning discussion of either the prices of or the overall type of funeral service or disposition or specific funeral goods, funeral services, burial site goods, or burial site services offered by the provider. This requirement applies whether the discussion takes place in the funeral establishment or elsewhere. However, when the deceased is removed for transportation to the funeral establishment, an in-person request for authorization to embalm does not, by itself, trigger the requirement to offer the general price list. If the provider, in making an in-person request for authorization to embalm, discloses that embalming is not required by law except in certain special cases, the provider is not required to offer the general price list. Any other discussion during that time about prices or the selection of funeral goods, funeral services, burial site goods, or burial site services triggers the requirement to give the consumer a general price list. The general price list must contain the following information:\n(1) the name, address, and telephone number of the funeral provider's place of business;\n(2) a caption describing the list as a \"general price list\";\n(3) the effective date for the price list;\n(4) the retail prices, in any order, expressed either as a flat fee or as the prices per hour, mile, or other unit of computation, and other information described as follows:\n(i) forwarding of remains to another funeral establishment, together with a list of the services provided for any quoted price;\n(ii) receiving remains from another funeral establishment, together with a list of the services provided for any quoted price;\n(iii) separate prices for each alkaline hydrolysis, natural organic reduction, or cremation offered by the funeral provider, with the price including an alternative container or alkaline hydrolysis facility or cremation container; any alkaline hydrolysis, natural organic reduction facility, or crematory charges; and a description of the services and container included in the price, where applicable, and the price of alkaline hydrolysis or cremation where the purchaser provides the container;\n(iv) separate prices for each immediate burial offered by the funeral provider, including a casket or alternative container, and a description of the services and container included in that price, and the price of immediate burial where the purchaser provides the casket or alternative container;\n(v) transfer of remains to the funeral establishment or other location;\n(vi) embalming;\n(vii) other preparation of the body;\n(viii) use of facilities, equipment, or staff for viewing;\n(ix) use of facilities, equipment, or staff for funeral ceremony;\n(x) use of facilities, equipment, or staff for memorial service;\n(xi) use of equipment or staff for graveside service;\n(xii) hearse or funeral coach;\n(xiii) limousine; and\n(xiv) separate prices for all cemetery-specific goods and services, including all goods and services associated with interment and burial site goods and services and excluding markers and headstones;\n(5) the price range for the caskets offered by the funeral provider, together with the statement \"A complete price list will be provided at the funeral establishment or casket sale location.\" or the prices of individual caskets, as disclosed in the manner described in paragraphs (c) and (d);\n(6) the price range for the alternative containers or shrouds offered by the funeral provider, together with the statement \"A complete price list will be provided at the funeral establishment or alternative container sale location.\" or the prices of individual alternative containers, as disclosed in the manner described in paragraphs (c) and (d);\n(7) the price range for the outer burial containers offered by the funeral provider, together with the statement \"A complete price list will be provided at the funeral establishment or outer burial container sale location.\" or the prices of individual outer burial containers, as disclosed in the manner described in paragraphs (c) and (d);\n(8) the price range for the alkaline hydrolysis container offered by the funeral provider, together with the statement \"A complete price list will be provided at the funeral establishment or alkaline hydrolysis container sale location.\" or the prices of individual alkaline hydrolysis containers, as disclosed in the manner described in paragraphs (c) and (d);\n(9) the price range for the hydrolyzed remains container offered by the funeral provider, together with the statement \"A complete price list will be provided at the funeral establishment or hydrolyzed remains container sale location.\" or the prices of individual hydrolyzed remains container, as disclosed in the manner described in paragraphs (c) and (d);\n(10) the price range for the cremation containers offered by the funeral provider, together with the statement \"A complete price list will be provided at the funeral establishment or cremation container sale location.\" or the prices of individual cremation containers, as disclosed in the manner described in paragraphs (c) and (d);\n(11) the price range for the cremated remains containers offered by the funeral provider, together with the statement, \"A complete price list will be provided at the funeral establishment or cremated remains container sale location,\" or the prices of individual cremation containers as disclosed in the manner described in paragraphs (c) and (d);\n(12) the price range for the naturally reduced remains containers offered by the funeral provider, together with the statement, \"A complete price list will be provided at the funeral establishment or naturally reduced remains container sale location,\" or the prices of individual naturally reduced remains containers as disclosed in the manner described in paragraphs (c) and (d);\n(13) the price for the basic services of funeral provider and staff, together with a list of the principal basic services provided for any quoted price and, if the charge cannot be declined by the purchaser, the statement \"This fee for our basic services will be added to the total cost of the funeral arrangements you select. (This fee is already included in our charges for alkaline hydrolysis, natural organic reduction, direct cremations, immediate burials, and forwarding or receiving remains.)\" If the charge cannot be declined by the purchaser, the quoted price shall include all charges for the recovery of unallocated funeral provider overhead, and funeral providers may include in the required disclosure the phrase \"and overhead\" after the word \"services.\" This services fee is the only funeral provider fee for services, facilities, or unallocated overhead permitted by this subdivision to be nondeclinable, unless otherwise required by law;\n(14) the price range for the markers and headstones offered by the funeral provider, together with the statement \"A complete price list will be provided at the funeral establishment or marker or headstone sale location.\" or the prices of individual markers and headstones, as disclosed in the manner described in paragraphs (c) and (d); and\n(15) any package priced funerals offered must be listed in addition to and following the information required in paragraph (e) and must clearly state the funeral goods and services being offered, the price being charged for those goods and services, and the discounted savings.\n(f) Funeral providers must give an itemized written statement, for retention, to each consumer who arranges an at-need funeral or other disposition of human remains at the conclusion of the discussion of the arrangements. The itemized written statement must be signed by the consumer selecting the goods and services as required in section 149A.80. If the statement is provided by a funeral establishment, the statement must be signed by the licensed funeral director or mortician planning the arrangements. If the statement is provided by any other funeral provider, the statement must be signed by an authorized agent of the funeral provider. The statement must list the funeral goods, funeral services, burial site goods, or burial site services selected by that consumer and the prices to be paid for each item, specifically itemized cash advance items (these prices must be given to the extent then known or reasonably ascertainable if the prices are not known or reasonably ascertainable, a good faith estimate shall be given and a written statement of the actual charges shall be provided before the final bill is paid), and the total cost of goods and services selected. At the conclusion of an at-need arrangement, the funeral provider is required to give the consumer a copy of the signed itemized written contract that must contain the information required in this paragraph.\n(g) Upon receiving actual notice of the death of an individual with whom a funeral provider has entered a preneed funeral agreement, the funeral provider must provide a copy of all preneed funeral agreement documents to the person who controls final disposition of the human remains or to the designee of the person controlling disposition. The person controlling final disposition shall be provided with these documents at the time of the person's first in-person contact with the funeral provider, if the first contact occurs in person at a funeral establishment, alkaline hydrolysis facility, crematory, natural organic reduction facility, or other place of business of the funeral provider. If the contact occurs by other means or at another location, the documents must be provided within 24 hours of the first contact.\nAny funeral provider who sells or offers to sell funeral goods or burial site goods to the public shall, at all times, display the retail price of all displayed funeral goods or burial site goods in a conspicuous place on the goods. \"Conspicuous place\" means a place where any consumer viewing the funeral goods or burial site goods would be able to see and read the price and reasonably understand that the price seen is the price of the funeral goods or burial site goods viewed. Displayed funeral goods or burial site goods are those goods that the funeral provider regularly maintains in inventory and makes available for viewing and purchase by the consumer.\nAny funeral provider who sells or offers to sell a casket, alternate container, alkaline hydrolysis container, hydrolyzed remains container, cremation container, cremated remains container, or, effective July 1, 2025, naturally reduced remains container to the public must maintain a record of each sale that includes the name of the purchaser, the purchaser's mailing address, the name of the decedent, the date of the decedent's death, and the place of death. These records shall be open to inspection by the regulatory agency. Any funeral provider selling a casket, alternate container, or cremation container to the public, and not having charge of the final disposition of the dead human body, shall provide a copy of the statutes and rules controlling the removal, preparation, transportation, arrangements for disposition, and final disposition of a dead human body. This subdivision does not apply to morticians, funeral directors, funeral establishments, crematories, or wholesale distributors of caskets, alternate containers, alkaline hydrolysis containers, or cremation containers.",
	"repealed": false
}