{
	"id": "252A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/252A.02",
	"title": "252A.02 DEFINITIONS.",
	"text": "For the purposes of sections 252A.01 to 252A.21, the terms defined in this section have the meanings given them.\n\"Person with a developmental disability\" refers to any person age 18 or older who:\n(1) has been diagnosed as having a developmental disability;\n(2) is impaired to the extent of lacking sufficient understanding or capacity to make personal decisions; and\n(3) is unable to meet personal needs for medical care, nutrition, clothing, shelter, or safety, even with appropriate technological and supported decision-making assistance.\n\"Commissioner\" means the commissioner of human services or the commissioner's designees.\n\"Guardianship service providers\" are individuals or agencies that meet the ethical conduct and best practice standards of the National Guardianship Association, meet the criminal background check requirements of chapter 245C, and do not provide any other services to the individuals for whom guardianship services are provided.\n\"Regional center\" means a state-operated facility for persons with mental illness, developmental disability, or substance use disorder that is under the direct administrative authority of the Direct Care and Treatment executive board.\n\"Licensed physician\" means a person licensed under the laws of Minnesota to practice medicine or a medical officer of the government of the United States while in Minnesota in performance of official duties.\n\"Near relative\" means a spouse, parent, adult sibling, or adult child.\n\"Public guardian\" means the commissioner of human services when exercising all the powers designated in section 252A.111.\nMS 2020 [Repealed, 2021 c 30 art 13 s 84]\n\"Person subject to public guardianship\" means a person with a developmental disability for whom the court has appointed a public guardian.\nMS 2020 [Repealed, 2021 c 30 art 13 s 84]\n\"Interested person\" means an interested responsible adult, including but not limited to:\n(1) the person subject to guardianship, the protected person, or the respondent;\n(2) a nominated guardian or conservator;\n(3) a legal representative;\n(4) a spouse; a parent, including a stepparent; adult children, including adult stepchildren of a living spouse; and siblings. If no such persons are living or can be located, the next of kin of the person subject to public guardianship or the respondent is an interested person;\n(5) a representative of a state ombudsman's office or a federal protection and advocacy program that has notified the commissioner or lead agency that it has a matter regarding the protected person subject to guardianship, person subject to conservatorship, or respondent; and\n(6) a health care agent or proxy appointed pursuant to a health care directive as defined in section 145C.01, subdivision 5a; a living will under chapter 145B; or other similar documentation executed in another state and enforceable under the laws of this state.\n(a) \"Comprehensive evaluation\" consists of:\n(1) a medical report on the health status and physical condition of the proposed person subject to public guardianship prepared under the direction of a licensed physician, advanced practice registered nurse, or physician assistant;\n(2) a report on the intellectual capacity and functional abilities of the proposed person subject to public guardianship that specifies the tests and other data used in reaching its conclusions and is prepared by a psychologist who is qualified in the diagnosis of developmental disability; and\n(3) a report from the case manager that includes:\n(i) the most current assessment of individual service needs as described in rules of the commissioner;\n(ii) the most current support plan under section 256B.092, subdivision 1b; and\n(iii) a description of contacts with and responses of near relatives of the proposed person subject to public guardianship notifying the near relatives that a nomination for public guardianship has been made and advising the near relatives that they may seek private guardianship.\n(b) Each report under paragraph (a), clause (3), shall contain recommendations as to the amount of assistance and supervision required by the proposed person subject to public guardianship to function as independently as possible in society. To be considered part of the comprehensive evaluation, the reports must be completed no more than one year before filing the petition under section 252A.05.\n\"Case manager\" means the person designated under section 256B.092.\n\"Local agency\" means the agency designated by the county board of commissioners, human services boards, local social services agencies in the several counties of the state, or multicounty local social services agencies where those have been established under law.\n\"Visitor\" means a person who is trained in law, health care, or social work and is an officer, employee, or special appointee of the court with no personal interest in the proceedings.\n\"Protected person\" means a person for whom a guardian or conservator has been appointed or other protective order has been sought. A protected person may be a minor.\n\"Respondent\" means an individual for whom the appointment of a guardian or conservator or other protective order is sought.\n\"Supported decision making\" means assistance to an individual with understanding the nature and consequences of personal and financial decisions from one or more persons of the individual's choosing to enable the individual to make the personal and financial decisions and, when consistent with the individual's wishes, to communicate the individual's decisions.",
	"repealed": false
}