{
	"id": "13.3215",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.3215",
	"title": "13.3215 UNIVERSITY OF MINNESOTA DATA.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given them.\n(b) \"Business data\" is data described in section 13.591, subdivision 1, and includes the funded amount of the University of Minnesota's commitment to the investment to date, if any; the market value of the investment by the University of Minnesota; and the age of the investment in years.\n(c) \"Financial, business, or proprietary data\" means data, as determined by the responsible authority for the University of Minnesota, that is of a financial, business, or proprietary nature, the release of which could cause competitive harm to the University of Minnesota, the legal entity in which the University of Minnesota has invested or has considered an investment, the managing entity of an investment, or a portfolio company in which the legal entity holds an interest.\n(d) \"Investment\" means the investments by the University of Minnesota in the following private capital:\n(1) venture capital and other private equity investment businesses through participation in limited partnerships, trusts, limited liability corporations, limited liability companies, limited liability partnerships, and corporations;\n(2) real estate ownership interests or loans secured by mortgages or deeds of trust or shares of real estate investment trusts through investment in limited partnerships; and\n(3) natural resource investments through limited partnerships, trusts, limited liability corporations, limited liability companies, limited liability partnerships, and corporations.\nClaims experience and all related information received from carriers and claims administrators participating in a University of Minnesota group health, dental, life, or disability insurance plan or the University of Minnesota workers' compensation program, and survey information collected from employees or students participating in these plans and programs, except when the university determines that release of the data will not be detrimental to the plan or program, are classified as nonpublic data under section 13.02, subdivision 9.\n(a) Financial, business, or proprietary data collected, created, received, or maintained by the University of Minnesota in connection with investments are nonpublic data.\n(b) The following data shall be public:\n(1) the name of the general partners and the legal entity in which the University of Minnesota has invested;\n(2) the amount of the university's initial commitment, and any subsequent commitments;\n(3) quarterly reports which outline the aggregate investment performance achieved and the market value, and the fees and expenses paid in aggregate to general partner investment managers in each of the following specific asset classes: venture capital, private equity, distressed debt, private real estate, and natural resources;\n(4) a description of all of the types of industry sectors the University of Minnesota is or has invested in, in each specific private equity asset class;\n(5) the portfolio performance of University of Minnesota investments overall, including the number of investments, the total amount of the University of Minnesota commitments, the total current market value, and the return on the total investment portfolio; and\n(6) the university's percentage ownership interest in a fund or investment entity in which the university is invested.",
	"repealed": false
}