{
	"id": "62D.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.041",
	"title": "62D.041 PROTECTION IN THE EVENT OF INSOLVENCY.",
	"text": "(a) For the purposes of this section, the term \"uncovered expenditures\" means the costs of health care services that are covered by a health maintenance organization for which an enrollee would also be liable in the event of the organization's insolvency, and that are not guaranteed, insured, or assumed by a person other than the health maintenance organization.\n(b) For purposes of this section, if a health maintenance organization offers supplemental benefits as described in section 62D.05, subdivision 6, \"uncovered expenditures\" excludes any expenditures attributable to the supplemental benefit.\nEach health maintenance organization shall deposit with any organization or trustee acceptable to the commissioner through which a custodial or controlled account is utilized, bankable funds in the amount required in this section. The commissioner may allow a health maintenance organization's deposit requirement to be funded by an organization approved by the commissioner.\n(a) Organizations that obtain a certificate of authority after April 25, 1988, shall deposit, before receiving a certificate of authority, $500,000. The health maintenance organization shall provide the commissioner with evidence of the deposit before receiving a certificate of authority.\n(b) By April 1 of the year following the organization's first 12 months of operation under a certificate of authority, an organization shall deposit an amount equal to the difference between the initial deposit and 33 percent of its uncovered expenditures in its first 12 months of operation.\n(c) By April 1 of subsequent years, an organization shall deposit an amount equal to the difference between the amount on deposit and 33 percent of its uncovered expenditures in the preceding calendar year.\nBy December 31, 1989, an organization that has received a certificate of authority on or before April 25, 1988, shall have on deposit an amount equal to the larger of:\n(1) 33 percent of its uncovered expenditures in the preceding calendar year; or\n(2) $500,000.\nBy April 1 of each subsequent year, an organization shall deposit an amount equal to the difference between the amount on deposit and 33 percent of its uncovered expenditures in the preceding calendar year.\n[Repealed, 1988 c 612 s 32]\nIn any year when the amount determined according to this section is zero or less than zero, the commissioner shall not require the organization to make any additional deposit.\n[Repealed, 1988 c 612 s 32]\nIf the amount previously deposited by the organization under this section exceeds the amount required under this section by more than $50,000 for a continuous 12-month period, the commissioner shall allow the organization to withdraw the portion of the deposit that exceeds by more than $50,000 the amount required to be on deposit for the organization, unless the commissioner determines that release of a portion of the deposit could be hazardous to enrollees, creditors, or the general public. An organization shall not apply for the withdrawal more than once in each calendar year.\nAn organization shall provide the commissioner with evidence of every deposit made on or before the date of the deposit.\nAll income from deposits shall belong to the depositing organizations and shall be paid to it as it becomes available.\n[Repealed, 1988 c 612 s 32]\nA health maintenance organization may satisfy one-half of its deposit requirement through use of a letter of credit issued by a bank authorized to do business in this state, provided that:\n(1) nothing more than a demand for payment is necessary for payment;\n(2) the letter of credit is irrevocable;\n(3) according to its terms, the letter of credit cannot expire without due notice from the issuer and the notice must occur at least 60 days before the expiration date and be in the form of a written notice to the commissioner;\n(4) the letter of credit is issued or confirmed by a bank which is a member of the Federal Reserve system;\n(5) the letter of credit is unconditional, is not contingent upon reimbursement to the bank or the bank's ability to perfect any lien or security interest, and does not contain references to any other agreements, documents, or entities;\n(6) the letter of credit designates the commissioner as beneficiary; and\n(7) the letter of credit may be drawn upon after insolvency of the health maintenance organization.\nA health maintenance organization offering supplemental benefits as described in section 62D.05, subdivision 6, must maintain an additional deposit in the first year such benefits are offered equal to $50,000. At the end of the second year such benefits are offered, the health maintenance organization must maintain an additional deposit equal to $150,000. At the end of the third year such benefits are offered and every year thereafter, the health maintenance organization must maintain an additional deposit of $250,000.",
	"repealed": false
}