{
	"id": "340A.410",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.410",
	"title": "340A.410 LICENSE RESTRICTIONS; GENERAL.",
	"text": "A county may not issue a retail license to sell any alcoholic beverage within an organized town unless the governing body of the town has consented to the issuance of the license.\n(a) No county may issue or renew a retail license to sell any alcoholic beverage until the county board has received a written recommendation from the sheriff and county attorney stating that to the best of their knowledge that the applicant is eligible to be licensed under section 340A.402. A copy of the statements must be given to the town board if a town's consent is required for issuance of the license under subdivision 3.\n(b) The county board shall consider the recommendations of the sheriff and county attorney, the character and reputation of the applicant, and the nature and location of the business prior to issuance of any license.\nIn the case of the death of a retail licensee to sell alcoholic beverages, the personal representative is authorized to continue operation of the business for not more than 90 days after the death of the licensee.\nA retail license to sell alcoholic beverages must be posted in a conspicuous place in the premises for which it is used.\nMS 1994 [Repealed, 1996 c 418 s 18]\n(a) A premises licensed for the retail sale of alcoholic beverages and a municipal liquor store must post and maintain in a conspicuous place within the licensed premises clearly visible to consumers: one sign 14-1/2 inches wide by 8 inches high as designed by the commissioners of health and public safety, which incorporates the following information:\n(1) the penalties of driving while under the influence of alcohol;\n(2) penalties for serving alcoholic beverages to a person who is obviously intoxicated or under 21 years of age; and\n(3) a warning statement regarding drinking alcohol while pregnant.\n(b) The commissioners of health and public safety shall design a sign that complies with this subdivision and shall make the sign available for reproduction. A retail licensee or municipal liquor store may not modify the sign design but may modify the color.\n(a) Except as otherwise provided in this subdivision, no retail establishment licensed to sell alcoholic beverages may keep, possess, or operate, or permit the keeping, possession, or operation on the licensed premises of dice or any gambling device as defined in section 349.30, or permit gambling therein.\n(b) Gambling equipment may be kept or operated and raffles conducted on licensed premises and adjoining rooms when the use of the gambling equipment is authorized by (1) chapter 349, (2) a tribal ordinance in conformity with the Indian Gaming Regulatory Act, Public Law 100-497, or (3) a tribal-state compact authorized under section 3.9221.\n(c) Lottery tickets may be purchased and sold within the licensed premises as authorized by the director of the lottery under chapter 349A.\n(d) Dice may be kept and used on licensed premises and adjoining rooms as authorized by section 609.761, subdivision 4.\nNo retail license to sell alcoholic beverages may be issued or renewed by a municipality or county to a club which discriminates against members or applicants for membership or guests of members on the basis of race.\nA licensing authority may issue a retail alcoholic beverage license only for a space that is compact and contiguous. A retail alcoholic beverage license is only effective for the licensed premises specified in the approved license application.\nEvery application for the issuance or renewal of intoxicating or 3.2 percent malt liquor licenses must include a copy of each summons received by the applicant under section 340A.802 during the preceding year.\nCoin-operated amusement devices may not be made available in establishments licensed solely for the off-sale of intoxicating liquor or municipal stores which sell only at off-sale. An establishment holding a combination on-sale and off-sale license or a municipal liquor store which sells at on-sale and off-sale which makes coin-operated devices available shall keep such devices to the greatest extent practicable in that area of the establishment where on-sales are made.\n(a) A municipality may not issue more than three four-day, four three-day, six two-day, or 12 one-day temporary licenses, in any combination not to exceed 12 days per year, under section 340A.404, subdivision 10, for the sale of alcoholic beverages to any one organization or registered political committee, or for any one location, within a 12-month period.\n(b) A municipality that issues separate temporary wine and liquor licenses may separately apply the limitations contained in paragraph (a) to the issuance of such licenses to any one organization or registered political committee, or for any one location.\n(c) In addition to the temporary licenses authorized in paragraph (a), a municipality may issue one seven-day temporary license per year to a county agricultural society established under section 38.01, for alcoholic beverage sales at a county fair.",
	"repealed": false
}