{
	"id": "469.183",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.183",
	"title": "469.183 BONDS FOR MUNICIPAL MARKET; FIRST CLASS CITIES.",
	"text": "The governing body of any city of the first class that owns, maintains, and operates its own municipal market may issue negotiable bonds in an amount in the aggregate not exceeding $200,000. These bonds shall be in the denominations and payable at the places and at the times, not exceeding 30 years from the date of issuance, as deemed best by the governing body of the city. The bonds shall be in serial form and bear interest at a rate not to exceed six percent per annum, payable semiannually, at the place designated therein. The governing body may negotiate and sell the bonds from time to time to the highest bidder or bidders, and upon the best terms that can be obtained, provided that no such bonds shall be sold for less than the par value thereof and accrued interest thereon.\nThe bonds authorized by subdivision 1, or any portion thereof, may be issued and sold by any such city notwithstanding any limitation contained in the charter of the city or in any law prescribing or fixing any limit upon the bonded indebtedness of the city. The governing body of a city issuing these bonds shall set aside annually from the revenues of the operation of projects for which the bond issue is authorized, a sufficient amount to pay the interest on the bonds and the principal of any such bonds maturing in any year. In the event that revenue is insufficient for this purpose, the governing body of the city shall include in the tax levy a sufficient amount for the payment of the interest as it accrues and for the accumulation of a sinking fund for the redemption of the bonds at their maturity.\nThe proceeds of any bonds issued or sold under the authority of this section shall be used for the purchase or condemnation of a site or sites for the expansion, improvement, and equipment of the municipal market, owned, maintained, and operated by the city; provided, that no bonds in excess of $200,000 shall be issued for those purposes.\nThe authority granted in this section is in addition to all existing power and authority of any city operating under a home rule charter adopted in pursuance of the Constitution of the state of Minnesota, article IV, section 36, article XI, section 4, or article XII, section 5.",
	"repealed": false
}