{
	"id": "197.791",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.791",
	"title": "197.791 MINNESOTA GI BILL PROGRAM.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of veterans affairs, unless otherwise specified.\n(c) \"Cost of attendance\" for undergraduate students has the meaning given in section 136A.121, subdivision 6, multiplied by a factor of 1.2. Cost of attendance for graduate students has the meaning given in section 136A.121, subdivision 6, multiplied by a factor of 1.2, using the tuition and fee maximum established by law for four-year programs. For purposes of calculating the cost of attendance for graduate students, full time is eight credits or more per term or the equivalent.\n(d) \"Child\" means a natural or adopted child of a person described in subdivision 4, paragraph (a), clause (1), item (i) or (ii).\n(e) \"Eligible institution\" means a postsecondary institution under section 136A.101, subdivision 4, or a graduate school licensed or registered with the state of Minnesota serving only graduate students.\n(f) \"Program\" means the Minnesota GI Bill program established in this section, unless otherwise specified.\n(g) \"Time of hostilities\" means any action by the armed forces of the United States that is recognized by the issuance of a presidential proclamation or a presidential executive order in which the armed forces expeditionary medal or other campaign service medals are awarded according to presidential executive order, and any additional period or place that the commissioner determines and designates, after consultation with the United States Department of Defense, to be a period or place where the United States is in a conflict that places persons at such a risk that service in a foreign country during that period or in that place should be considered to be included.\n(h) \"Veteran\" has the meaning given in section 197.447. Veteran also includes a service member who has received an honorable discharge after leaving each period of federal active duty service and has:\n(1) served 90 days or more of federal active duty in a foreign country during a time of hostilities in that country; or\n(2) been awarded any of the following medals:\n(i) Armed Forces Expeditionary Medal;\n(ii) Kosovo Campaign Medal;\n(iii) Afghanistan Campaign Medal;\n(iv) Iraq Campaign Medal;\n(v) Global War on Terrorism Expeditionary Medal; or\n(vi) any other campaign medal authorized for service after September 11, 2001; or\n(3) received a service-related medical discharge from any period of service in a foreign country during a time of hostilities in that country.\nA service member who has fulfilled the requirements for being a veteran under this paragraph but is still serving actively in the United States armed forces is also a veteran for the purposes of this section.\nThe Minnesota GI Bill program is established to provide postsecondary educational assistance, apprenticeship and on-the-job training benefits, and other professional and educational benefits to eligible Minnesota veterans and to the children and spouses of deceased and severely disabled Minnesota veterans.\nThe commissioner, in cooperation with eligible postsecondary educational institutions, shall administer the program for the purpose of providing postsecondary educational assistance to eligible persons in accordance with this section. Each public postsecondary educational institution in the state must participate in the program and each private postsecondary educational institution in the state is encouraged to participate in the program. Any participating private institution may suspend or terminate its participation in the program at the end of any semester or other academic term.\n(a) The commissioner shall establish policies and procedures including, but not limited to, procedures for student application record keeping, information sharing, payment of educational assistance benefits under subdivision 5, payment of apprenticeship or on-the-job training benefits under subdivision 5a, payment of other educational or professional benefits under subdivision 5b, and other procedures the commissioner considers appropriate and necessary for effective and efficient administration of the program established in this section.\n(b) The commissioner may delegate part or all of the administrative procedures for the program to responsible representatives of participating eligible institutions. The commissioner may execute an interagency agreement with the Minnesota Office of Higher Education for services the commissioner determines necessary to administer the program.\n(a) A person is eligible for educational assistance under subdivision 5 if:\n(1) the person is:\n(i) a veteran who is serving or has served honorably in any branch or unit of the United States armed forces at any time;\n(ii) a nonveteran who has served honorably for a total of five years or more cumulatively as a member of the Minnesota National Guard or any other active or reserve component of the United States armed forces, and any part of that service occurred on or after September 11, 2001;\n(iii) the surviving spouse or child of a person who has served in the military and who has died as a direct result of that military service, only if the surviving spouse or child is eligible to receive federal education benefits under United States Code, title 38, chapter 33, as amended, or United States Code, title 38, chapter 35, as amended; or\n(iv) the spouse or child of a person who has served in the military at any time and who has a total and permanent service-connected disability as rated by the United States Veterans Administration, only if the spouse or child is eligible to receive federal education benefits under United States Code, title 38, chapter 33, as amended, or United States Code, title 38, chapter 35, as amended; and\n(2) the person receiving the educational assistance is a Minnesota resident, as defined in section 136A.101, subdivision 8; and\n(3) the person receiving the educational assistance:\n(i) is an undergraduate or graduate student at an eligible institution;\n(ii) is maintaining satisfactory academic progress as defined by the institution for students participating in federal Title IV programs;\n(iii) is enrolled in an education program leading to a certificate, diploma, or degree at an eligible institution;\n(iv) has applied for educational assistance under this section prior to the end of the academic term for which the assistance is being requested;\n(v) is in compliance with child support payment requirements under section 136A.121, subdivision 2, clause (5); and\n(vi) has completed the Free Application for Federal Student Aid (FAFSA).\n(b) A person's eligibility terminates when the person becomes eligible for benefits under section 135A.52.\n(c) To determine eligibility, the commissioner may require official documentation, including the person's federal form DD-214 or other official military discharge papers; correspondence from the United States Veterans Administration; birth certificate; marriage certificate; proof of enrollment at an eligible institution; signed affidavits; proof of residency; proof of identity; or any other official documentation the commissioner considers necessary to determine eligibility.\n(d) The commissioner may deny eligibility or terminate benefits under this section to any person who has not provided sufficient documentation to determine eligibility for the program. An applicant may appeal the commissioner's eligibility determination or termination of benefits in writing to the commissioner at any time. The commissioner must rule on any application or appeal within 30 days of receipt of all documentation that the commissioner requires. The decision of the commissioner regarding an appeal is final. However, an applicant whose appeal of an eligibility determination has been rejected by the commissioner may submit an additional appeal of that determination in writing to the commissioner at any time that the applicant is able to provide substantively significant additional information regarding the applicant's eligibility for the program. An approval of an applicant's eligibility by the commissioner following an appeal by the applicant is not retroactively effective for more than one year or the semester of the person's original application, whichever is later.\n(e) Upon receiving an application with insufficient documentation to determine eligibility, the commissioner must notify the applicant within 30 days of receipt of the application that the application is being suspended pending receipt by the commissioner of sufficient documentation from the applicant to determine eligibility.\n(a) On approval by the commissioner of eligibility for the program, the applicant shall be awarded, on a funds-available basis, the educational assistance under the program for use at any time according to program rules at any eligible institution.\n(b) The amount of educational assistance in any semester or term for an eligible person must be determined by subtracting from the eligible person's cost of attendance the amount the person received or was eligible to receive in that semester or term from:\n(1) the federal Pell Grant;\n(2) the state grant program under section 136A.121; and\n(3) any federal military or veterans educational benefits including but not limited to the Montgomery GI Bill, GI Bill Kicker, the federal tuition assistance program, vocational rehabilitation benefits, and any other federal benefits associated with the person's status as a veteran, except veterans disability payments from the United States Department of Veterans Affairs.\n(c) The amount of educational assistance for any eligible person who is a student must not exceed the following:\n(1) $5,000 per state fiscal year; and\n(2) $15,000 in a lifetime.\nMS 2020 [Renumbered subdivision 6]\nMS 2020 [Renumbered subdivision 7]\nMS 2020 [Renumbered subdivision 8]\n(a) The commissioner, in consultation with the commissioners of employment and economic development and labor and industry, shall develop and implement an apprenticeship and on-the-job training program to administer a portion of the Minnesota GI Bill program to pay benefit amounts to eligible persons, as provided in this subdivision.\n(b) An \"eligible employer\" means an employer operating a qualifying apprenticeship or on-the-job training program that has been approved by the commissioner.\n(c) A person is eligible for apprenticeship and on-the-job training assistance under this subdivision if the person is:\n(1) a veteran who is serving or has served honorably in any branch or unit of the United States armed forces at any time;\n(2) a nonveteran who has served honorably for a total of five years or more cumulatively as a member of the Minnesota National Guard or any other active or reserve component of the United States armed forces, and any part of that service occurred on or after September 11, 2001;\n(3) the surviving spouse or child of a person who has served in the military and who has died as a direct result of that military service, only if the surviving spouse or child is eligible to receive federal education benefits under United States Code, title 38, chapter 33, as amended, or United States Code, title 38, chapter 35, as amended; or\n(4) the spouse or child of a person who has served in the military at any time and who has a total and permanent service-connected disability as rated by the United States Veterans Administration, only if the spouse or child is eligible to receive federal education benefits under United States Code, title 38, chapter 33, as amended, or United States Code, title 38, chapter 35, as amended.\n(d) The amount of assistance paid to or on behalf of an eligible individual under this subdivision must not exceed the following:\n(1) $3,000 per fiscal year for apprenticeship expenses;\n(2) $3,000 per fiscal year for on-the-job training;\n(3) $1,000 for a job placement credit payable to an eligible employer upon hiring and completion of six consecutive months' employment of a person receiving assistance under this subdivision; and\n(4) $1,000 for a job placement credit payable to an eligible employer after a person receiving assistance under this subdivision has been employed by the eligible employer for at least 12 consecutive months as a full-time employee.\n(e) No more than $5,000 in aggregate benefits under this subdivision may be paid to or on behalf of an individual in one fiscal year.\n(f) If an eligible person receives benefits under subdivision 5 or 5b, the eligible person's aggregate benefits under this subdivision and subdivisions 5 and 5b must not exceed $15,000 in the eligible person's lifetime.\n(g) Assistance for apprenticeship expenses and on-the-job training is available for qualifying programs, which must, at a minimum, meet the following criteria:\n(1) the training must be with an eligible employer;\n(2) the training must be documented and reported;\n(3) the training must reasonably be expected to lead to an entry-level position; and\n(4) the position must require at least six months of training to become fully trained.\n(a) The commissioner shall develop and implement a program to administer a portion of the Minnesota GI Bill program to pay additional benefit amounts to eligible persons as provided under this subdivision.\n(b) A person is eligible for additional benefits under this subdivision if the person is:\n(1) a veteran who is serving or has served honorably in any branch or unit of the United States armed forces at any time;\n(2) a nonveteran who has served honorably for a total of five years or more cumulatively as a member of the Minnesota National Guard or any other active or reserve component of the United States armed forces, and any part of that service occurred on or after September 11, 2001;\n(3) the surviving spouse or child of a person who has served in the military and who has died as a direct result of that military service, only if the surviving spouse or child is eligible to receive federal education benefits under United States Code, title 38, chapter 33, as amended, or United States Code, title 38, chapter 35, as amended; or\n(4) the spouse or child of a person who has served in the military at any time and who has a total and permanent service-connected disability as rated by the United States Veterans Administration, only if the spouse or child is eligible to receive federal education benefits under United States Code, title 38, chapter 33, as amended, or United States Code, title 38, chapter 35, as amended.\n(c) The amount of assistance paid to or on behalf of an eligible individual under this subdivision must not exceed the following amounts:\n(1) $3,000 per state fiscal year; and\n(2) $15,000 in a lifetime.\n(d) If an eligible person receives benefits under subdivision 5 or 5a, the eligible person's aggregate benefits under this subdivision and subdivisions 5 and 5a must not exceed $15,000 in the eligible person's lifetime.\n(e) A person eligible under this subdivision may use the benefit amounts for the following purposes:\n(1) licensing or certification tests, the successful completion of which demonstrates an individual's possession of the knowledge or skill required to enter into, maintain, or advance in employment in a predetermined and identified vocation or profession, provided that the tests and the licensing or credentialing organizations or entities that offer the tests are approved by the commissioner;\n(2) tests for admission to institutions of higher learning or graduate schools;\n(3) national tests providing an opportunity for course credit at institutions of higher learning;\n(4) a preparatory course for a test that is required or used for admission to an institution of higher education or a graduate program; and\n(5) any fee associated with the pursuit of a professional or educational objective specified in clauses (1) to (4).\nThe amount necessary to pay the benefit amounts in subdivisions 5, 5a, and 5b is appropriated from the general fund to the commissioner. During any fiscal year beginning on or after July 1, 2012, the amount paid under this subdivision must not exceed $6,000,000.",
	"repealed": false
}