{
	"id": "296A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.07",
	"title": "296A.07 GASOLINE TAX.",
	"text": "There is imposed an excise tax on gasoline, gasoline blended with ethanol, and agricultural alcohol gasoline used in producing and generating power for propelling motor vehicles used on the public highways of this state. The tax is imposed on the first licensed distributor who received the product in Minnesota. For purposes of this section, gasoline is defined in section 296A.01, subdivisions 8b, 10, 18, 20, 23, 24, 25, 32, and 34. The tax is payable at the time and in the form and manner prescribed by the commissioner. The tax is payable at the rates specified in subdivision 3, subject to the exceptions and reductions specified in section 296A.17.\nSubject to the provisions of section 296A.16, subdivision 2, there is imposed an excise tax, at the same rate per gallon as the gasoline excise tax, on all marine gasoline received, sold, stored, or withdrawn from storage in this state. This tax is payable at the times, in the manner, and by persons specified in this chapter.\n(a) Subject to paragraph (b), the gasoline excise tax is imposed at the following rates:\n(1) E85 is taxed at the rate of 17.75 cents per gallon;\n(2) M85 is taxed at the rate of 14.25 cents per gallon; and\n(3) all other gasoline is taxed at the rate of 25 cents per gallon.\n(b) Annually on August 1, the commissioner must determine the tax rate applicable to the sale of E85, M85, and all other gasoline subject to tax under this section for the upcoming 12-month period beginning on January 1. The adjusted rate must equal the current rate, multiplied by one plus the percentage increase, if any, in the Minnesota Highway Construction Cost Index for the reference year. The tax rate must be rounded to the nearest tenth of a cent. Each of the tax rates for E85, M85, and all other gasoline must not be lower than the respective rates specified in paragraph (a). Beginning with the calculation on August 1, 2025, the percentage change in each of the tax rates for E85, M85, and all other gasoline as a result of the requirements under this paragraph must not exceed three percent.\n(c) For purposes of this subdivision:\n(1) the Minnesota Highway Construction Cost Index is as determined by the commissioner of transportation; and\n(2) \"reference year\" means the 12-month period ending on June 30 two years prior to the year in which the calculation is made.\nThe provisions of subdivision 1 do not apply to gasoline or denatured ethanol purchased by:\n(1) a transit system or transit provider receiving financial assistance or reimbursement under section 174.24, 256B.0625, subdivision 17, or 473.384;\n(2) providers of transportation to recipients of medical assistance home and community-based services waivers enrolled in day programs, including adult day care, family adult day care, day treatment and habilitation, prevocational services, and structured day services;\n(3) an ambulance service licensed under chapter 144E;\n(4) providers of medical or dental services by a federally qualified health center, as defined under title 19 of the Social Security Act, as amended by Section 4161 of the Omnibus Budget Reconciliation Act of 1990, with a motor vehicle used exclusively as a mobile medical unit;\n(5) a licensed distributor to be delivered to a terminal for use in blending; or\n(6) a dealer of aviation gasoline, but only to the extent that the gasoline is intended to be dispensed directly into the fuel tank of an aircraft.",
	"repealed": false
}