{
	"id": "192.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/192.501",
	"title": "192.501 FINANCIAL INCENTIVES FOR NATIONAL GUARD MEMBERS.",
	"text": "[Repealed by amendment, 1996 c 390 s 32]\n(a) The adjutant general may establish within the limitations of this subdivision a program to provide enlistment bonuses to eligible prospects who become members of the Minnesota National Guard.\n(b) Eligibility for the bonus is limited to a candidate who:\n(1) has expertise, qualifications, or potential for military service deemed by the adjutant general as sufficiently important to the readiness of the National Guard or a unit of the National Guard to warrant the payment of a bonus in an amount to generally encourage the candidate's enlistment in the National Guard;\n(2) joins the National Guard as an enlisted member, as defined in section 190.05, subdivision 6; and\n(3) serves satisfactorily during the period of, and completes, the person's initial entry training, if applicable.\nThe adjutant general may, within the limitations of this paragraph and other applicable laws, determine additional eligibility criteria for the bonus, and must specify all of the criteria in regulations and publish changes as necessary.\n(c) The enlistment bonus payments must be made on a schedule that is determined and published in department regulations by the adjutant general.\n(d) If a member fails to complete a term of enlistment for which a bonus was paid, the adjutant general may seek to recoup a prorated amount of the bonus as determined by the adjutant general.\n(a) The adjutant general may establish a program to provide a reenlistment or commissioning bonus to eligible members of the Minnesota National Guard who extend their term of service in the National Guard within the limitations of this subdivision.\n(b) Eligibility for the bonus is limited to a member of the National Guard who:\n(1) is serving satisfactorily as determined by the adjutant general; and\n(2) has military training and expertise deemed by the adjutant general as sufficiently important to the readiness of the National Guard or a unit of the National Guard to warrant the payment of a bonus in an amount to generally encourage the member's reenlistment in the National Guard, or the member's acceptance of a commission as an officer in the National Guard.\nThe adjutant general may, within the limitations of this paragraph and other applicable laws, determine additional eligibility criteria for the bonus, and must specify all of the criteria in regulations and publish changes as necessary.\n(c) The bonus payments must be made on a schedule that is determined and published in department regulations by the adjutant general.\n(d) If a member fails to complete a term of reenlistment or an obligated term of commissioned service for which a bonus was paid, the adjutant general may seek to recoup a prorated amount of the bonus as determined by the adjutant general.\n(a) The adjutant general may establish a program to provide a recertification bonus to eligible members of the Minnesota National Guard who recertify as emergency medical technicians (EMTs) in the National Guard within the limitations of this subdivision. The bonus payments are intended to generally encourage a member's continuing certification as an EMT.\n(b) Eligibility for the recertification bonus is limited to a member of the National Guard who:\n(1) is serving satisfactorily as determined by the adjutant general; and\n(2) has successfully completed the training required for recertification and warrants the payment of a bonus.\n(c) The adjutant general may, within the limitations of this subdivision and other applicable laws, determine additional eligibility criteria for the bonus, and must specify all of the criteria in regulations and publish changes as necessary.\n(d) Payments under this subdivision must be made on a schedule that is determined and published in department regulations by the adjutant general.\n(a) The adjutant general must establish a program to provide a bonus to eligible members of the Minnesota National Guard who complete training that results in the award of a new military occupational specialty or Air Force specialty code in specialties that are identified by the adjutant general to be necessary for the enhanced readiness of the Minnesota National Guard.\n(b) Eligibility for the bonus is limited to a member of the National Guard who:\n(1) is serving satisfactorily as determined by the adjutant general;\n(2) has 16 or fewer years of services creditable for retirement; and\n(3) undergoes military training deemed by the adjutant general as sufficiently important to the readiness of the National Guard or a unit of the National Guard to warrant the payment of a bonus in an amount to generally encourage the member's participation in the training.\nThe adjutant general may, within the limitations of this paragraph and other applicable laws, determine additional eligibility criteria for the bonus, and must specify all of the criteria in regulations and publish changes as necessary.\n(c) The bonus payments must be made on a schedule that is determined and published in department regulations by the adjutant general.\n(d) If a member fails to complete a term of reenlistment or an obligated term of commissioned service for which a bonus was paid, the adjutant general may seek to recoup a prorated amount of the bonus as determined by the adjutant general.\n(a) The adjutant general may establish a program to provide a bonus for referrals leading to enlistment in or commissioning into the Minnesota National Guard.\n(b) The adjutant general may determine eligibility criteria for the bonus. The adjutant general must specify all criteria for the bonus in regulations and publish changes as necessary.\n(c) The referral bonus payments must be made on a schedule that is determined and published in department regulations by the adjutant general.\n(d) If the adjutant general determines that a referral bonus was paid to an individual who was ineligible, the adjutant general may seek to recoup the bonus.\n(e) If the adjutant general implements a referral bonus program, the adjutant general must:\n(1) notify the legislative committees with jurisdiction over the Minnesota National Guard;\n(2) develop internal controls for the referral bonus program aimed at preventing fraud, waste, and abuse of government resources, and publish these internal controls in regulation;\n(3) by January 16 each year, submit regulations developed under this subdivision to the legislative committees with jurisdiction over the Minnesota National Guard; and\n(4) maintain an accurate record of the recipients and benefits paid under this subdivision and summarize this information in the agency performance report, including information regarding the rank and unit locations of bonus recipients.\n(a) The adjutant general shall establish a program to provide tuition and textbook reimbursement grants to eligible members of the Minnesota National Guard within the limitations of this subdivision.\n(b) Eligibility is limited to a member of the National Guard who:\n(1) is serving satisfactorily as defined by the adjutant general;\n(2) is attending a postsecondary educational institution, as defined by section 136A.15, subdivision 6, including a vocational or technical school operated or regulated by this state or another state or province; and\n(3) provides proof of satisfactory completion of coursework, as defined by the adjutant general.\n(c) Notwithstanding paragraph (b), clause (1), for a person who:\n(1) has satisfactorily completed the person's service contract in the Minnesota National Guard or the portion of it involving selective reserve status, for which any part of that service was spent serving honorably in federal active service or federally funded state active service since September 11, 2001, the person's eligibility is extended for a period of two years, plus an amount of time equal to the duration of that person's active service, subject to the credit hours limit in paragraph (g); or\n(2) has served honorably in the Minnesota National Guard and has been separated or discharged from that organization due to a service-connected injury, disease, or disability, the eligibility period is extended for eight years beyond the date of separation, subject to the credit hours limit in paragraph (g).\n(d) If a member of the Minnesota National Guard is killed in the line of state active service or federally funded state active service, the member's surviving spouse, and any surviving dependent who has not yet reached 24 years of age, is eligible for a tuition and textbook reimbursement grant, with each eligible person independently subject to the credit hours limit in paragraph (g).\n(e) The adjutant general may, within the limitations of paragraphs (b) to (d) and other applicable laws, determine additional eligibility criteria for the grant, and must specify the criteria in department regulations and publish changes as necessary.\n(f) The amount of a tuition and textbook reimbursement grant must be specified on a schedule as determined and published in department regulations by the adjutant general, but, except as specifically provided for in paragraph (h), is limited to a maximum of an amount equal to the greater of:\n(1) up to 100 percent of the cost of tuition for lower division programs in the College of Liberal Arts at the Twin Cities campus of the University of Minnesota in the most recent academic year; or\n(2) up to 100 percent of the cost of tuition for the program in which the person is enrolled at that Minnesota public institution, or if that public institution is outside the state of Minnesota, for the cost of a comparable program at the University of Minnesota, except that in the case of a survivor as defined in paragraph (d), the amount of the tuition and textbook reimbursement grant for coursework satisfactorily completed by the person is limited to 100 percent of the cost of tuition for postsecondary courses at a Minnesota public educational institution.\n(g) Paragraphs (b) to (e) notwithstanding, a person is no longer eligible for a grant under this subdivision once the person has received grants under this subdivision for the equivalent of 208 quarter credits or 144 semester credits of coursework.\n(h) Awards made under this paragraph must not be counted against the limitation contained in this subdivision. In addition to other benefits authorized under this subdivision, the adjutant general may award to highly qualified persons who agree to join the Minnesota National Guard an amount not to exceed $1,000 for the purpose of reimbursement for postsecondary education expenses not covered by other awards received under this subdivision. These awards must be made on a competitive basis. The adjutant general shall determine the standards and procedure for awards under this paragraph. The maximum number of awards that may be issued under this paragraph in any calendar year is 25. No person may receive more than one award under this paragraph.\n(i) Tuition and textbook reimbursement grants received under this subdivision may not be considered by the Minnesota Office of Higher Education or by any other state board, commission, or entity in determining a person's eligibility for a scholarship or grant-in-aid under sections 136A.095 to 136A.1311.\n(j) If a member fails to complete a term of enlistment during which a tuition and textbook reimbursement grant was paid, the adjutant general may seek to recoup a prorated amount as determined by the adjutant general. However, this authority does not apply to a person whose separation from the Minnesota National Guard is due to a medical condition or financial hardship.\n(k) For purposes of this section, the terms \"active service,\" \"state active service,\" \"federally funded state active service,\" and \"federal active service\" have the meanings given in section 190.05, subdivisions 5 to 5c, respectively, except that for purposes of paragraph (c), clause (1), these terms exclude service performed exclusively for purposes of:\n(1) basic combat training, advanced individual training, annual training, and periodic inactive duty training;\n(2) special training periodically made available to reserve members;\n(3) service performed in accordance with section 190.08, subdivision 3; and\n(4) service performed as part of the active guard/reserve program pursuant to United States Code, title 32, section 502(f), or other applicable authority.\n(a) Notwithstanding the eligibility limitations of subdivision 2, paragraph (b), the spouse of a person eligible under subdivision 2, paragraph (b), is eligible to use up to 12 semester hours per year, or the equivalent amount of quarter credits, of that eligible person's unused tuition reimbursement benefit for each year of service in the Minnesota National Guard after the eighth year of such service.\n(b) Total benefits under this subdivision cannot exceed the total unused portion of the service member's benefit. A service member's and spouse's eligibility for tuition reimbursement under this subdivision is limited by the provisions of subdivision 2, paragraph (g).\nThe adjutant general must keep an accurate record of the recipients and benefits paid under this section, and must report this information in the agency performance report, including information regarding the rank, unit location, race, and gender.\nBy January 16 of each year, the adjutant general must provide copies of the regulations developed under this section to the chairs of the house of representatives and senate policy committees responsible for the National Guard.\nThe Department of Military Affairs shall make a specific effort to recruit and reenlist women and members of minority groups into the National Guard through the use of the financial incentives authorized by the programs in this section.",
	"repealed": false
}