{
	"id": "144.398",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.398",
	"title": "144.398 TOBACCO USE PREVENTION ACCOUNT; ESTABLISHMENT AND USES.",
	"text": "(a) As used in this section, the terms in this subdivision have the meanings given.\n(b) \"Electronic delivery device\" has the meaning given in section 609.685, subdivision 1, paragraph (c).\n(c) \"Nicotine delivery product\" has the meaning given in section 609.6855, subdivision 1, paragraph (c).\n(d) \"Tobacco\" has the meaning given in section 609.685, subdivision 1, paragraph (a).\n(e) \"Tobacco-related devices\" has the meaning given in section 609.685, subdivision 1, paragraph (b).\nA tobacco use prevention account is created in the special revenue fund. Pursuant to section 16A.151, subdivision 2, paragraph (h), the commissioner of management and budget shall deposit into the account any money received by the state resulting from a settlement agreement or an assurance of discontinuance entered into by the attorney general of the state, or a court order in litigation brought by the attorney general of the state on behalf of the state or a state agency related to alleged violations of consumer fraud laws in the marketing, sale, or distribution of electronic nicotine delivery systems in this state or other alleged illegal actions that contributed to the exacerbation of youth nicotine use.\n(a) Each fiscal year, the amount of money in the tobacco use prevention account is appropriated to the commissioner of health for:\n(1) tobacco and electronic delivery device use prevention and cessation projects consistent with the duties specified in section 144.392;\n(2) a public information program under section 144.393;\n(3) the development of health promotion and health education materials about tobacco and electronic delivery device use prevention and cessation;\n(4) tobacco and electronic delivery device use prevention activities under section 144.396; and\n(5) statewide tobacco cessation services under section 144.397.\n(b) In activities funded under this subdivision, the commissioner of health must:\n(1) prioritize preventing persons under the age of 21 from using commercial tobacco, electronic delivery devices, tobacco-related devices, and nicotine delivery products;\n(2) promote racial and health equity; and\n(3) use strategies that are evidence-based or based on promising practices.",
	"repealed": false
}