{
	"id": "31.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.08",
	"title": "31.08 ADDITIONAL POWERS AND AUTHORITY; FOOD IN TRANSIT.",
	"text": "The commissioner or any of the commissioner's assistants, inspectors, agents, or employees, in addition to the authority and powers otherwise conferred by law, is authorized and empowered to have and to take access to any and all trucks, aeroplanes, airships, vehicles, and railroad cars of every sort and nature transported or being within this state, all railroad stations, storage houses, warehouses, express offices, or other places wherein at any time there may be food transported or shipped into from without this state, whether or not such food has been manufactured, sold, or given away without the state; provided, that such food was manufactured, sold, or given away with the intent that it be delivered, had, or used within this state; and the commissioner shall have the same power and authority to open any package, car, or vessel containing food so transported or shipped into from without the state, which contains, or which the commissioner has reason to believe contains, any such food; to inspect the contents thereof and to take samples for analysis and examination, all after the same manner and with the same procedure as obtains by law in reference to similar goods manufactured, sold, transported, offered for sale, use, or transportation, or had in possession with intent to sell, use, or transport within this state. If it shall appear that any such food is adulterated, misbranded, insufficiently labeled, unwholesome, poisonous, or deleterious, the commissioner shall have the same rights and remedies and shall enforce the same in the same manner as in the case of food manufactured, sold, transported, offered for sale, use, or transportation, or had in possession with intent to sell, use, or transport within this state. On receiving notice from the commissioner or any authorized agent or employee of a desire to inspect the contents of any such package, can, or vessel, it shall be the duty of any common carrier, storage agent, warehouse operator, or their employees, or other person having the same in possession or under control, to withhold the same from delivery within this state for such period of time as may be reasonably necessary for the inspection, examination, and analysis thereof. It is further made the duty of all such persons to render to the commissioner and the commissioner's agents and employees all the assistance in their power when so required to effectuate the purposes of laws now or hereafter enacted relating to food. In case such inspection, examination, or analysis of any such food shall disclose it to be adulterated, misbranded, insufficiently labeled, unwholesome, poisonous, or deleterious, such persons shall, on demand, disclose to the commissioner the names and addresses of the consignor and consignee of the package, can, or vessel containing the same, and the commissioner, before proceeding further, shall notify such consignor and consignee, in writing, at their respective addresses, of the result of the inspection, examination, or analysis as so disclosed. Any common carrier, warehouse operator, storage agent, employee, or other person having such food in possession or under control, failing or refusing to comply with any of the provisions of this section shall be guilty of a misdemeanor.",
	"repealed": false
}