{
	"id": "121A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.46",
	"title": "121A.46 SUSPENSION PROCEDURES.",
	"text": "The school administration shall not suspend a pupil from school without an informal administrative conference with the pupil. The informal administrative conference shall take place before the suspension, except where it appears that the pupil will create an immediate and substantial danger to self or to surrounding persons or property, in which case the conference shall take place as soon as practicable following the suspension.\nAt the informal administrative conference, a school administrator shall notify the pupil of the grounds for the suspension, provide an explanation of the evidence the authorities have, and the pupil may present the pupil's version of the facts.\nA written notice containing the grounds for suspension, a brief statement of the facts, a description of the testimony, a readmission plan, and a copy of sections 121A.40 to 121A.56, shall be personally served upon the pupil at or before the time the suspension is to take effect, and upon the pupil's parent or guardian by mail within 48 hours of the conference. The district shall make reasonable efforts to notify the parents of the suspension by telephone as soon as possible following suspension. In the event a pupil is suspended without an informal administrative conference on the grounds that the pupil will create an immediate and substantial danger to surrounding persons or property, the written notice shall be served upon the pupil and the pupil's parent or guardian within 48 hours of the suspension. Service by mail is complete upon mailing.\n(a) Alternative education services must be provided to a pupil who is suspended for more than five consecutive school days.\n(b) Notwithstanding the provisions of subdivisions 1 and 3, the pupil may be suspended pending the school board's decision in the expulsion or exclusion hearing; provided that alternative educational services are implemented to the extent that suspension exceeds five consecutive school days.\nSchool administration must allow a suspended pupil the opportunity to complete all school work assigned during the period of the pupil's suspension and to receive full credit for satisfactorily completing the assignments. The school principal or other person having administrative control of the school building or program is encouraged to designate a district or school employee as a liaison to work with the pupil's teachers to allow the suspended pupil to (1) receive timely course materials and other information, and (2) complete daily and weekly assignments and receive teachers' feedback.",
	"repealed": false
}