{
	"id": "515A.2-101",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.2-101",
	"title": "515A.2-101 CREATION OF CONDOMINIUM.",
	"text": "(a) A condominium may be created pursuant to sections 515A.1-101 to 515A.4-117 only by recording a declaration executed, in the same manner as a deed, by all persons whose interests in the real estate will be conveyed to unit owners, except vendors under contracts for deed, and by every lessor of a lease the expiration or termination of which will terminate the condominium. The condominium shall not include real estate covered by a lease affecting less than all of the condominiums and the expiration or termination of which will reduce the size of the condominium. The declaration and bylaws shall be recorded in every county in which any portion of the condominium is located. Failure of any party to join in a declaration shall have no effect on the validity of a condominium provided that after the recording of the declaration the party acknowledges the condominium in a recorded instrument or the interest of the party is extinguished.\n(b) A declaration, or an amendment to a declaration adding units to a condominium, may not be recorded unless all structural components and mechanical systems serving more than one unit of all buildings containing or comprising any units thereby created are substantially completed consistent with the floor plans, as evidenced by a certificate executed by a registered professional engineer or architect and recorded or attached to the floor plans.\n(c) No possessory interest in a unit may be conveyed until the unit is substantially completed as evidenced by a recorded certificate of completion executed by a registered professional engineer or architect. For the purpose of this section \"substantially completed\" means entirely completed consistent with the floor plans. This subsection does not prevent the conveyance prior to substantial completion of all units owned by the declarant to a person who is a transferee of special declarant rights.\n(d) The declaration, any amendment or amendments thereof, and every instrument affecting a condominium or any unit shall be entitled to be recorded.\n(e) In addition to the records and indexes required to be maintained by the recording officer, the recording officer shall maintain an index or indexes whereby the record of each declaration contains a reference to the record of each conveyance of a unit affected by the declaration.\n(f) The recording officer shall upon request assign a number to a condominium to be formed.\n(g) The recording officer shall separate the floor plans from the declaration and the floor plans shall be kept by the recording officer in a separate file for each condominium indexed in the same manner as a conveyance entitled to record indicating the number of the condominium.",
	"repealed": false
}