{
	"id": "168.128",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.128",
	"title": "168.128 LIMOUSINE PLATES.",
	"text": "A unique vehicle registration category is established for limousines.\n(a) A person who operates a limousine for other than personal use shall register the motor vehicle as provided in this section. A person who operates a limousine for personal use may apply for limousine plates.\n(b) The commissioner shall issue limousine plates to the registered owner of a limousine who:\n(1) certifies that an insurance policy or policies under section 65B.135, in the minimum aggregate amount required under that section, is in effect for the entire period of the registration;\n(2) provides the commissioner with proof that the passenger automobile registration tax and a fee in the amount specified for special plates under section 168.12, subdivision 5, have been paid for each limousine receiving limousine plates; and\n(3) complies with this chapter and rules governing the registration of motor vehicles and licensing of drivers.\n(c) The limousine plates must be designed to specifically identify the vehicle as a limousine and must be clearly marked with the letters \"LM.\" Limousine plates may not be transferred upon sale of the limousine, but may be transferred to another limousine owned by the same person upon notifying the commissioner and paying a $5 transfer fee.\n(a) The application must include a certificate of insurance verifying that a valid commercial insurance policy or policies is in effect and giving the name of the insurance company and the number of the insurance policy. The policy or policies must provide in the aggregate stated limits of liability, exclusive of interest and costs, with respect to each motor vehicle for which coverage is granted, of:\n(1) not less than $1,500,000 because of bodily injury to one person in any one accident;\n(2) not less than the minimum aggregate amount required under section 65B.135 per accident; and\n(3) not less than $100,000 because of injury to or destruction of property.\n(b) The insurance company must notify the commissioner if the policy is canceled or if the policy no longer provides the coverage required by this subdivision.\n(c) The commissioner shall immediately notify the commissioner of transportation if the policy of a person required to have a permit under section 221.84 is canceled or no longer provides the coverage required by this subdivision.\nMS 2004 [Repealed by amendment, 1Sp2005 c 6 art 2 s 14]",
	"repealed": false
}