{
	"id": "349.173",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.173",
	"title": "349.173 CONDUCT OF RAFFLES.",
	"text": "(a) Raffle tickets or certificates of participation at a minimum must list the three most expensive prizes to be awarded and include the location, date, and time of the selection of the winning entries. If additional prizes will be awarded, a complete list of additional prizes must be publicly posted or visibly on display at the event and copies of the complete prize list made available upon request. Raffles conducted under the exemptions in section 349.166 may use tickets that contain only the sequential number of the raffle ticket and no other information if the organization makes a list of prizes, or visibly displays the prizes at the event, and a statement of other relevant information required by rule available to persons purchasing tickets and if tickets are only sold at the event and on the date when the tickets are drawn.\n(b) Raffles must be conducted in a manner that ensures:\n(1) all entries in the raffle have an equal chance of selection;\n(2) entry in the raffle is not conditioned upon any other purchase, except that a certificate of participation may be a button with a nominal value of less than $5, or as provided under paragraph (c) or (d);\n(3) the method of selection is conducted in a public forum;\n(4) the method of selection cannot be manipulated or based on the outcome of an event not under the control of the organization;\n(5) physical presence at the raffle is not a requirement to win; and\n(6) all sold and unsold tickets or certificates of participation are accounted for.\n(c) An organization that is permitted under chapters 97A to 97C and authorized by the Gambling Control Board to conduct raffles may conduct a raffle in conjunction with a wild game or fish taking event. The wild game or fish must be legally taken under chapters 97A to 97C, and rules adopted pursuant to those chapters. The organization may sell a combined ticket for a single price for the event and raffle, provided that the combined ticket states the amount of the price that applies to the wild game or fish event, and the amount that applies to the raffle. All other provisions of sections 349.11 to 349.23 apply to the raffle.\n(d) An organization that is permitted under this section and authorized by the Gambling Control Board to conduct raffles may, once each calendar year, conduct a raffle in conjunction with an organization membership event. The organization may sell a combined ticket for a single price for the membership event and raffle, provided that the combined ticket states the amount of the price that applies to the membership event, and the amount that applies to the raffle. All other provisions of sections 349.11 to 349.23 apply to the raffle.\n(e) Methods of selecting winning entries from a raffle other than prescribed in rule may be used with the prior written approval of the board.\n(f) For raffles conducted by a licensed organization, the entries may be selected by use of a random number generator if, at the time of sale, the number contained on the raffle ticket is captured by the electronic raffle selection system and electronically recorded as an entry in the raffle.\n(g) The board may by rule authorize but not require the use of electronic raffle selection systems.\n(h) The board may by rule adopt minimum technical standards for electronic raffle selection systems.",
	"repealed": false
}