{
	"id": "375.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.025",
	"title": "375.025 COMMISSIONER DISTRICTS.",
	"text": "The redistricting plan in use in a county shall be used until a new plan is adopted in accordance with this section. Each county shall be divided into as many districts numbered consecutively as it has members of the county board. Commissioner districts shall be bounded by town, municipal, ward, or precinct lines. Each district shall be composed of contiguous territory as regular and compact in form as practicable, depending upon the geography of the county involved and shall be as nearly equal in population as possible. No district shall vary in population more than ten percent from the average for all districts in the county, unless the result forces a voting precinct to be split. A majority of the least populous districts shall contain not less than a majority of the population of the county. A county may be redistricted by the county board after each federal census. When it appears after a federal census that the districts of the county are not in accord with the standards set forth in this subdivision, the county shall be redistricted by the county board within the times set in section 204B.135, subdivision 2. Before acting to redistrict, the county board, or a redistricting commission if one is appointed, shall publish three weeks' notice of its purpose, stating the time and place of the meeting where the matter will be considered, in the newspaper having the contract to publish the commissioners' proceedings for the county for the current year.\nAny qualified voter may apply to the district court of the county for a writ of mandamus (a) requiring the county to be redistricted if the county board has not redistricted the county within the time specified in subdivision 1, or (b) to revise the redistricting plan. Any application for revision of a redistricting plan filed with the county auditor that seeks to affect elections held in a year ending in two must be filed with the district court no later than one week before the first day to file for office in the year ending in \"2.\" The district court may direct the county board to show cause why it has not redistricted the county or why the redistricting plan prepared by it should not be revised. On hearing the matter it may allow the county board additional time in which to redistrict the county or to correct errors in the redistricting plan. If it appears to the court that the county board has not been sufficiently diligent in performing its redistricting duties, the court may appoint a redistricting commission to redistrict the county in accordance with the standards set forth in subdivision 1 and any other conditions the court shall deem advisable and appropriate. If a redistricting commission is appointed, the county board shall be without authority to redistrict the county.\nThe redistricting commission shall be composed of not less than five nor more than nine residents of the county. No officer or employee of county or local government except notaries public shall be eligible for membership. Members of the commission shall not be eligible for election to the county board until two years after the redistricting in which they participated becomes effective. Members shall serve without pay but may be reimbursed their necessary expenses in the conduct of the business of the commission. The county board shall provide for the necessary expenses of the commission.\nA redistricting plan whether prepared by the county board or the redistricting commission shall be filed in the office of the county auditor. A redistricting plan shall be effective on the 31st day after filing unless a later effective date is specified but no plan shall be effective for the next election of county commissioners unless the plan is filed with the county auditor not less than two weeks before the first date candidates may file for the office of county commissioner. One commissioner shall be elected in each district who, at the time of the election, is a resident of the district. A person elected may hold the office only while remaining a resident of the commissioner district or, after the last day to file for office during a year ending in \"2,\" while remaining a resident of the county. The county board or the redistricting commission shall determine the number of members of the county board who shall be elected for two-year terms and for four-year terms to provide staggered terms on the county board. Thereafter, all commissioners shall be elected for four years. When a county is redistricted, there shall be a new election of commissioners in all the districts at the next general election except that if the change made in the boundaries of a district is less than five percent of the average of all districts of the county, the commissioner in office at the time of the redistricting shall serve for the full period for which elected.",
	"repealed": false
}