{
	"id": "297I.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.06",
	"title": "297I.06 SURCHARGES ON FIRE SAFETY PREMIUMS.",
	"text": "(a) Except as otherwise provided in subdivision 2, each licensed insurer engaged in writing policies of homeowner's insurance authorized in section 60A.06, subdivision 1, clause (1)(c), or commercial fire policies or commercial nonliability policies shall collect a surcharge as provided in this paragraph. The surcharge is equal to 0.65 percent of the gross premiums and assessments, less return premiums, on direct business received by the company, or by its agents for it, for homeowner's insurance policies, commercial fire policies, and commercial nonliability insurance policies in this state.\n(b) The surcharge amount collected under paragraph (a) or subdivision 2, paragraph (b), may not be considered premium for any other purpose. The surcharge amount under paragraph (a) must be separately stated on either a billing or policy declaration or document containing similar information sent to an insured.\n(c) Amounts collected by the commissioner under this section must be deposited in the fire safety account established pursuant to subdivision 3.\n(a) This section does not apply to a township mutual fire insurance company in Minnesota organized under chapter 67A.\n(b) An insurer described in section 297I.05, subdivisions 3 and 4, authorized to transact business in Minnesota shall elect to remit to the Department of Revenue for deposit in the fire safety account either (1) the surcharge amount imposed under subdivision 1 on all premiums subject to that surcharge, or (2) a surcharge of one-half of one percent on the gross fire premiums and assessments, less return premiums, on all direct business received by the insurer or agents of the insurer in Minnesota, in cash or otherwise, during the year.\n(c) The election must be made by December 31 of each year for insurance policies written or renewed in the succeeding calendar year. An insurer who elects to remit the one-half of one percent surcharge on gross fire premiums and assessments must not charge the insured the surcharge imposed under subdivision 1.\n(d) For purposes of this subdivision, \"gross fire premiums and assessments\" includes premiums on policies covering fire risks only on automobiles, whether written or under floater form or otherwise.\nA special account, to be known as the fire safety account, is created in the state treasury. The account consists of the proceeds under subdivisions 1 and 2.",
	"repealed": false
}