{
	"id": "11A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.07",
	"title": "11A.07 EXECUTIVE DIRECTOR.",
	"text": "The state board shall select an executive director.\nThe director of the state board shall be well qualified by training to administer and invest the money available for investment and possess experience in the management of institutional investment portfolios. The director shall be in the unclassified state service and serve at the pleasure of the state board.\n[Repealed, 1983 c 305 s 28]\nThe director, at the direction of the state board, shall:\n(1) plan, direct, coordinate, and execute administrative and investment functions in conformity with the policies and directives of the state board and the requirements of this chapter and of chapter 356A;\n(2) prepare and submit biennial and annual budgets to the board and with the approval of the board submit the budgets to the Department of Management and Budget;\n(3) employ professional and clerical staff as necessary;\n(4) report to the state board on all operations under the director's control and supervision;\n(5) maintain accurate and complete records of securities transactions and official activities;\n(6) establish a policy, which is subject to state board approval, relating to the purchase and sale of securities on the basis of competitive offerings or bids;\n(7) cause securities acquired to be kept in the custody of the commissioner of management and budget or other depositories consistent with chapter 356A, as the state board deems appropriate;\n(8) prepare and file with the director of the Legislative Reference Library, by December 31 of each year, a report summarizing the activities of the state board, the council, and the director during the preceding fiscal year;\n(9) include on the state board's website its annual report and an executive summary of its quarterly reports;\n(10) require state officials from any department or agency to produce and provide access to any financial documents the state board deems necessary in the conduct of its investment activities;\n(11) receive and expend legislative appropriations; and\n(12) undertake any other activities necessary to implement the duties and powers set forth in this subdivision consistent with chapter 356A.\n(a) Employees of the state board who are in the unclassified service of the state are employed under the terms and conditions of the compensation plan approved under section 43A.18, subdivision 3b. The following state board employees are in the unclassified service of the state:\n(1) professional employees who, in the determination of the director, are primarily responsible for managing or administering the investment portfolio, including but not limited to investment diligence and analysis, investment risk mitigation, and implementing investment strategy; and\n(2) employees who hold positions designated as unclassified under section 43A.08, subdivision 1a.\n(b) Employees of the state board who are not in the unclassified service under paragraph (a) are in the classified service of the state.\nThe report required under subdivision 4, clause (8), must include an executive summary and must be prepared so as to provide the legislature and the people of the state with:\n(1) a clear, comprehensive summary of the portfolio composition, the transactions, the total annual rate of return, and the yield to the state treasury and to each of the funds with assets invested by the state board; and\n(2) the recipients of business placed or commissions allocated among the various commercial banks, investment bankers, money managers, and brokerage organizations and the amount of these commissions or other fees.\nThe annual expenses incurred by the State Board of Investment will be apportioned among the state general fund, the retirement funds administered by the Minnesota State Retirement System, Public Employees Retirement Association, and Teachers Retirement Association, and all other funds as follows:\n(1) on a biennial basis, the State Board of Investment, in accordance with biennial budget procedures established by the commissioner of management and budget, may request a direct appropriation that represents the portion of the State Board of Investment expenses necessary to provide investment services to the state general fund. This appropriation must be deposited in the State Board of Investment operating account;\n(2) the executive director shall apportion the actual expenses incurred by the State Board of Investment, less the charge to the state general fund, among the funds whose assets are invested by the State Board of Investment, with the exception of the state general fund, based on the weighted average assets under management during the fiscal year. The amounts necessary to pay these charges are apportioned from the investment earnings of each fund. Receipts must be credited to the State Board of Investment operating account;\n(3) the actual expenses apportioned and charged to the funds, with the exception of the state general fund and the retirement funds administered by the Minnesota State Retirement System, Public Employees Retirement Association, and Teachers Retirement Association, must be calculated, billed, and paid on a quarterly basis in accordance with procedures for interdepartmental payments established by the commissioner of management and budget; and\n(4) the annual estimated expenses to be incurred by the State Board of Investment that will be payable by the retirement funds administered by the Minnesota State Retirement System, Public Employees Retirement Association, and Teachers Retirement Association must be deposited in the State Board of Investment operating account on the first business day of each fiscal year. A reconciliation of the actual expenses compared to the estimated costs must occur at the end of each fiscal year with any surplus or deficit being credited or debited to each of the respective funds. The State Board of Investment must present a statement of accrued actual expenses to each fund at the end of each quarter during each fiscal year.",
	"repealed": false
}