{
	"id": "349.166",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.166",
	"title": "349.166 EXCLUSIONS; EXEMPTIONS.",
	"text": "(a) Bingo, with the exception of linked bingo games, may be conducted without a license and without complying with sections 349.168, subdivisions 1 and 2; 349.17, subdivisions 4 and 5; 349.18, subdivision 1; and 349.19, if it is conducted:\n(1) by an organization in connection with a county fair, the state fair, or a civic celebration and is not conducted for more than 12 consecutive days and is limited to no more than four separate applications for activities applied for and approved in a calendar year; or\n(2) by an organization that conducts bingo on four or fewer days in a calendar year.\nAn organization that holds a license to conduct lawful gambling under this chapter may not conduct bingo under this subdivision.\n(b) Bingo may be conducted within a nursing home or a senior citizen housing project or by a senior citizen organization if the prizes for a single bingo game do not exceed $10, total prizes awarded at a single bingo occasion do not exceed $200, only members of the organization or residents and their guests of the nursing home or housing project are allowed to play in a bingo game, no compensation is paid for any persons who conduct the bingo, and a manager is appointed to supervise the bingo. Bingo conducted under this paragraph is exempt from sections 349.11 to 349.23, and the board may not require an organization that conducts bingo under this paragraph, or the manager who supervises the bingo, to register or file a report with the board. The gross receipts from bingo conducted under the limitations of this subdivision are exempt from taxation under chapter 297A.\n(c) Raffles may be conducted by an organization without registering with the board if the value of all raffle prizes awarded by the organization in a calendar year does not exceed $1,500 or, if the organization is a 501(c)(3) organization, if the value of all raffle prizes awarded by the organization at one event in a calendar year does not exceed $5,000.\n(d) Except as provided in paragraph (b), the organization must maintain all required records of excluded gambling activity for 3-1/2 years.\n(a) Lawful gambling, with the exception of linked bingo games, may be conducted by an organization without a license and without complying with sections 349.168, subdivisions 1 and 2; 349.17, subdivision 4; 349.18, subdivision 1; and 349.19 if:\n(1) the organization conducts lawful gambling on five or fewer days in a calendar year;\n(2) the organization does not award more than $50,000 in prizes for lawful gambling in a calendar year;\n(3) the organization submits a board-prescribed application and pays a fee of $100 to the board for each gambling occasion, and receives an exempt permit number from the board. If the application is postmarked or received less than 30 days before the gambling occasion, the fee is $150 for that application. The application must include the date and location of the occasion, the types of lawful gambling to be conducted, and the prizes to be awarded;\n(4) the organization notifies the local government unit 30 days before the lawful gambling occasion, or 60 days for an occasion held in a city of the first class;\n(5) the organization purchases all gambling equipment and supplies from a licensed distributor; and\n(6) the organization reports to the board, on a single-page form prescribed by the board, within 30 days of each gambling occasion, the gross receipts, prizes, expenses, expenditures of net profits from the occasion, and the identification of the licensed distributor from whom all gambling equipment was purchased.\n(b) No more than one organization exempted or excluded from licensing requirements may conduct an individual raffle.\n(1) Exempted or excluded organizations may not combine the use of raffle tickets.\n(2) Raffle tickets must not be attached to or combined with other exempted or excluded organizations' raffle tickets and must be sold separately from other exempted or excluded organizations' raffle tickets.\n(c) If the organization fails to file a timely report as required by paragraph (a), clause (6), the board shall not issue any authorization, license, or permit to the organization to conduct lawful gambling on an exempt, excluded, or licensed basis until the report has been filed and the organization may be subject to penalty as determined by the board. The board may refuse to issue any authorization, license, or permit if a report or application is determined to be incomplete or knowingly contains false or inaccurate information.\n(d) Merchandise prizes must be valued at their fair market value.\n(e) Organizations that qualify to conduct exempt raffles under paragraph (a) are exempt from section 349.173, paragraph (b), clause (2), if the raffle tickets are sold only in combination with an organization's membership or a ticket for an organization's membership dinner and are not included with any other raffle conducted under the exempt permit.\n(f) Unused pull-tab and tipboard deals must be returned to the distributor within seven working days after the end of the lawful gambling occasion. The distributor must accept and pay a refund for all returns of unopened and undamaged deals returned under this paragraph.\n(g) The organization must maintain all required records of exempt gambling activity for 3-1/2 years.\nMS 2008 [Repealed, 2009 c 124 s 60]\nMS 1992 [Repealed, 1994 c 633 art 2 s 21]",
	"repealed": false
}