{
	"id": "241.026",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.026",
	"title": "241.026 CORRECTIONAL OFFICERS DISCIPLINE PROCEDURES.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Correctional officer\" and \"officer\" mean a person employed by the state, a state correctional facility, or a local correctional or detention facility in a security capacity.\n(c) \"Formal statement\" means the questioning of an officer in the course of obtaining a recorded, stenographic, or signed statement to be used as evidence in a disciplinary proceeding against the officer.\nThe procedures and provisions of this section apply to state and local correctional authorities.\nThe formal statement of an officer must be taken according to subdivision 4.\nThe formal statement must be taken at a facility of the employing or investigating agency or at a place agreed to by the investigating individual and the investigated officer.\nBefore an officer's formal statement is taken, the officer shall be advised in writing or on the record that admissions made in the course of the formal statement may be used as evidence of misconduct or as a basis for discipline.\nNo employer may require an officer to produce or disclose the officer's personal financial records except pursuant to a valid search warrant or subpoena.\nNo state or local correctional facility or governmental unit may publicly release photographs of an officer without the written permission of the officer, except that the facility or unit may display a photograph of an officer to a prospective witness as part of an agency or unit investigation.\nNo disciplinary letter or reprimand may be included in an officer's personnel record unless the officer has been given a copy of the letter or reprimand.\nNo officer may be discharged, disciplined, or threatened with discharge or discipline as retaliation for or solely by reason of the officer's exercise of the rights provided by this section.\nThe rights of officers provided by this section are in addition to and do not diminish the rights and privileges of officers that are provided under an applicable collective bargaining agreement or any other applicable law.",
	"repealed": false
}