{
	"id": "469.060",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.060",
	"title": "469.060 GENERAL OBLIGATION BONDS.",
	"text": "A port authority may issue bonds in the principal amount authorized by its city's council. The bonds may be issued in anticipation of income from any source. The bonds may be issued: (1) to secure funds needed by the authority to pay for acquired property or (2) for other purposes in sections 469.049, 469.050, and 469.058 to 469.068. The bonds must be in the amount and form and bear interest at the rate set by the city council. Except as otherwise provided in sections 469.048 to 469.068, the issuance of the bonds is governed by chapter 475. The port authority when issuing the bonds is a municipal corporation under chapter 475. Notwithstanding any contrary city charter provision or any general or special law, the bonds may be issued and sold without submission of the question to the electors of the city, provided that the ordinance of the governing body of the city authorizing issuance of the bonds by the port authority shall be subject to any provisions in the city charter pertaining to the procedure for referendum on ordinances enacted by the governing body.\nBonds issued by the port authority must not be included in the net debt of its city. Money received under this section must not be included in a per capita limit on taxing or spending in the port authority's city's charter. The authority is also exempt from the limit.\nThe port authority with the consent of its city's council shall set the date, denominations, place of payment, form, and details of the bonds. The bonds must mature serially. The first installment must be due in not more than three years and the last in not more than 30 years from the date of issuance.\nThe bonds must be signed by the president of the port authority, be attested by its secretary, and be countersigned by its treasurer. The interest coupons must be attached to the bonds. The coupons must be executed and authenticated by the printed, engrossed, or lithographed facsimile signature of the port authority's president and secretary. The bonds do not impose any personal liability on a member of the port authority.\nThe bonds must be secured by the pledge of the full faith, credit, and resources of the issuing port authority's city. The port authority may pledge the full faith, credit, and resources of the city only if the city specifically authorizes the authority to do so. The city council must first decide whether the issuance of the bonds by the authority is proper in each case and if so, the amount of bonds to issue. The city council shall give specific consent in an ordinance to the pledge of the city's full faith, credit, and resources. The port authority shall pay the principal amount of the bonds and the interest on it from taxes levied under this section to make the payment or from authority income from any source.\nA port authority that issues bonds under this section, shall, before issuing them, levy a tax for each year on the taxable property in the authority's city. The tax must be for at least five percent more than the amount required to pay the principal and interest on the bonds as the principal and interest mature. The tax must be levied annually until the principal and interest are paid in full. After the bonds have been delivered to the purchasers, the tax may not be repealed until the debt is paid. After the bonds are issued, the port authority need not take any more action to authorize extending, assessing, and collecting the tax. The authority's secretary shall immediately send a certified copy of the levy to the county auditor, together with full information on the bonds for which the tax is levied. The county auditor shall extend and assess the levied tax annually until the principal and interest are paid in full. The port authority shall transfer the surplus from the excess levy in this section to a sinking fund after the principal and interest for which the tax was levied and collected is paid. The port authority may direct its secretary to send a certificate to the county auditor before September 15 in a year. The certificate must state how much available income, including the amount in the sinking fund, the authority will use to pay principal or interest or both on each specified issue of the authority's bonds. The auditor shall then reduce the bond levy for that year by that amount. The port authority shall then set aside the certified amount and may not use it for any purpose except to pay the principal and interest on the bonds. The taxes in this section shall be collected and sent to the port authority by the county treasurer as provided in chapter 276. The taxes must be used only to pay the bonds when due.\nBonds legally issued under this chapter are authorized securities under section 50.14. A savings bank, trust company, or insurance company may invest in them. A public or municipal corporation may invest its sinking funds in them. The bonds may be pledged by a bank or trust company as security for the deposit of public money in place of a surety bond.\nThe authority's bonds are instrumentalities of a public governmental agency.",
	"repealed": false
}