{
	"id": "116C.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.34",
	"title": "116C.34 BUREAU OF BUSINESS LICENSES.",
	"text": "The Bureau of Business Licenses shall establish and maintain an information and referral system to assist the public in the understanding and compliance with the requirements of state and local governmental rules concerning the use of natural resources and protection of the environment. The system shall provide a telephone information service and disseminate printed materials. The bureau shall provide assistance to regional development commissions desiring to create a permit information center.\nThe bureau shall:\n(1) identify all existing state licenses, permit certifications, approvals, compliance schedules, or other programs which pertain to the use of natural resources and to protection of the environment;\n(2) standardize permit titles and assign designation codes to all such permits which would thereafter be imprinted on all permit forms;\n(3) develop permit profiles including applicable rules copies of all appropriate permit forms, statutory mandate and legislative history, names of individuals administering the program, permit processing procedures, documentation of the magnitude of the program and of geographic and seasonal distribution of the workload, and estimated application processing time;\n(4) identify the public information procedures currently associated with each permit program;\n(5) identify the data monitored or acquired through each permit and ascertain current users of that data;\n(6) recommend revisions to the list of natural resource management and development permits contained in Minnesota Statutes 1974, section 116D.04, subdivision 5; and\n(7) recommend legislative or administrative modifications of existing permit programs to increase their efficiency and utility.\nThe auditor of each county shall post in a conspicuous place in the auditor's office the telephone numbers of the Bureau of Business Licenses and the permit information center in the office of the applicable regional development commission and copies of any information published by the bureau or an information center pursuant to subdivision 1.",
	"repealed": false
}