{
	"id": "16A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.10",
	"title": "16A.10 BUDGET PREPARATION.",
	"text": "In each even-numbered calendar year the commissioner shall prepare budget forms and instructions for all agencies, including guidelines for reporting agency performance measures, subject to the approval of the governor. The commissioner shall request and receive advisory recommendations from the chairs of the senate Finance Committee and house of representatives Ways and Means Committee before adopting a format for the biennial budget document. By June 15, the commissioner shall send the proposed budget forms to the appropriations and finance committees. The committees have until July 15 to give the commissioner their advisory recommendations on possible improvements. To facilitate this consultation, the commissioner shall establish a working group consisting of executive branch staff and designees of the chairs of the senate Finance and house of representatives Ways and Means Committees. The commissioner must involve this group in all stages of development of budget forms and instructions. The budget format must show actual expenditures and receipts for the most recent fiscal year, estimated expenditures and receipts for the current fiscal year, and estimates for each fiscal year of the next biennium. Estimated expenditures must be classified by funds and character of expenditures and subclassified by programs and activities. Agency revenue estimates must have supporting documentation to show how the estimates were made and what factors were used. Receipts must be classified by funds, programs, and activities. Expenditure and revenue estimates must be based on the law in existence at the time the estimates are prepared.\nPerformance data shall be presented in the budget proposal to:\n(1) provide information so that the legislature can determine the extent to which state programs are successful;\n(2) encourage agencies to develop clear goals and objectives for their programs; and\n(3) strengthen accountability to Minnesotans by providing a record of state government's performance in providing effective and efficient services.\nAgencies shall present performance data that measures the performance of programs in meeting program goals and objectives. Measures reported may include indicators of outputs, efficiency, outcomes, and other measures relevant to understanding each program. Agencies shall present as much historical information as needed to understand major trends and shall set targets for future performance issues where feasible and appropriate. The information shall appropriately highlight agency performance issues that would assist legislative review and decision making.\nFor each change item in the budget proposal requesting new or increased funding, the budget document must present proposed performance measures that can be used to determine if the new or increased funding is accomplishing its goals. To the extent possible, each budget change item must identify relevant statewide goals and indicators related to the proposed initiative.\nBy October 15 of each even-numbered year, an agency must file the following with the commissioner:\n(1) budget estimates for the most recent and current fiscal years;\n(2) its upcoming biennial budget estimates;\n(3) a comprehensive and integrated statement of agency missions and outcome and performance measures; and\n(4) a concise explanation of any planned changes in the level of services or new activities.\nThe commissioner shall prepare and file the budget estimates for an agency failing to file them. By November 30, the commissioner shall send the final budget format, agency budget estimates for the next biennium, and copies of the filed material to the Ways and Means and Finance Committees, except that the commissioner shall not be required to transmit information that identifies executive branch budget decision items.\nImmediately after the election of a new governor, the commissioner shall report the budget estimates and make available to the governor-elect all department information, staff, and facilities relating to the budget.",
	"repealed": false
}