{
	"id": "121A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.15",
	"title": "121A.15 HEALTH STANDARDS; IMMUNIZATIONS; SCHOOL CHILDREN.",
	"text": "Except as provided in subdivisions 3, 4, and 10, no person over two months old may be allowed to enroll or remain enrolled in any elementary or secondary school or child care facility in this state until the person has submitted to the administrator or other person having general control and supervision of the school or child care facility, one of the following statements:\n(1) a statement from a physician or a public clinic which provides immunizations stating that the person has received immunization, consistent with medically acceptable standards, against measles after having attained the age of 12 months, rubella, diphtheria, tetanus, pertussis, polio, mumps, haemophilus influenzae type b, and hepatitis B; or\n(2) a statement from a physician or a public clinic which provides immunizations stating that the person has received immunizations, consistent with medically acceptable standards, against measles after having attained the age of 12 months, rubella, mumps, and haemophilus influenzae type b and that the person has commenced a schedule of immunizations for diphtheria, tetanus, pertussis, polio, and hepatitis B and which indicates the month and year of each immunization received.\nNo person who has commenced a treatment schedule of immunization pursuant to subdivision 1, clause (2), may remain enrolled in any child care facility, elementary, or secondary school in this state after 18 months of enrollment unless there is submitted to the administrator, or other person having general control and supervision of the school or child care facility, a statement from a physician or a public clinic which provides immunizations that the person has completed the primary schedule of immunizations for diphtheria, tetanus, pertussis, polio, and hepatitis B. The statement must include the month and year of each additional immunization received. For a child less than seven years of age, a primary schedule of immunizations shall consist of four doses of vaccine for diphtheria, tetanus, and pertussis and three doses of vaccine for poliomyelitis and hepatitis B. For a child seven years of age or older, a primary schedule of immunizations shall consist of three doses of vaccine for diphtheria, tetanus, polio, and hepatitis B.\n(a) If a person is at least seven years old and has not been immunized against pertussis, the person must not be required to be immunized against pertussis.\n(b) If a person is at least 18 years old and has not completed a series of immunizations against poliomyelitis, the person must not be required to be immunized against poliomyelitis.\n(c) If a statement, signed by a physician, is submitted to the administrator or other person having general control and supervision of the school or child care facility stating that an immunization is contraindicated for medical reasons or that laboratory confirmation of the presence of adequate immunity exists, the immunization specified in the statement need not be required.\n(d) If a notarized statement signed by the minor child's parent or guardian or by the emancipated person is submitted to the administrator or other person having general control and supervision of the school or child care facility stating that the person has not been immunized as prescribed in subdivision 1 because of the conscientiously held beliefs of the parent or guardian of the minor child or of the emancipated person, the immunizations specified in the statement shall not be required. This statement must also be forwarded to the commissioner of the Department of Health. This paragraph does not apply to a child enrolling or enrolled in a child care center or family child care program that adopts a policy under subdivision 3b.\n(e) If the person is under 15 months, the person is not required to be immunized against measles, rubella, or mumps.\n(f) If a person is at least five years old and has not been immunized against haemophilus influenzae type b, the person is not required to be immunized against haemophilus influenzae type b.\n(g) If a person who is not a Minnesota resident enrolls in a Minnesota school online learning course or program that delivers instruction to the person only by computer and does not provide any teacher or instructor contact time or require classroom attendance, the person is not subject to the immunization, statement, and other requirements of this section.\n(a) This paragraph applies to any written information about immunization requirements for enrollment in a school or child care facility that:\n(1) is provided to a person to be immunized or enrolling or enrolled in a school or child care facility, or to the person's parent or guardian if the person is under 18 years of age and not emancipated; and\n(2) is provided by the Department of Health; the Department of Education; the Department of Children, Youth, and Families; an immunization provider; or a school or child care facility.\nSuch written information must describe the exemptions from immunizations permitted under subdivision 3, paragraphs (c) and (d). The information on exemptions from immunizations provided according to this paragraph must be in a font size at least equal to the font size of the immunization requirements, in the same font style as the immunization requirements, and on the same page of the written document as the immunization requirements.\n(b) Before immunizing a person, an immunization provider must provide the person, or the person's parent or guardian if the person is under 18 years of age and not emancipated, with the following information in writing:\n(1) a list of the immunizations required for enrollment in a school or child care facility;\n(2) a description of the exemptions from immunizations permitted under subdivision 3, paragraphs (c) and (d);\n(3) a list of additional immunizations currently recommended by the commissioner; and\n(4) in accordance with federal law, a copy of the vaccine information sheet from the federal Department of Health and Human Services that lists possible adverse reactions to the immunization to be provided.\n(c) The commissioner will continue the educational campaign to providers and hospitals on vaccine safety including, but not limited to, information on the vaccine adverse events reporting system (VAERS), the federal vaccine information statements (VIS), and medical precautions and contraindications to immunizations.\n(d) The commissioner will encourage providers to provide the vaccine information statements at multiple visits and in anticipation of subsequent immunizations.\n(e) The commissioner will encourage providers to use existing screening for immunization precautions and contraindication materials and make proper use of the vaccine adverse events reporting system (VAERS).\n(f) In consultation with groups and people identified in subdivision 12, paragraph (a), clause (1), the commissioner will continue to develop and make available patient education materials on immunizations including, but not limited to, contraindications and precautions regarding vaccines.\n(g) The commissioner will encourage health care providers to use thimerosal-free vaccines when available.\nA child care center licensed under chapter 245A and Minnesota Rules, chapter 9503, and a family child care provider licensed under chapter 245A and Minnesota Rules, chapter 9502, may adopt a policy prohibiting a child over two months of age from enrolling or remaining enrolled in the child care center or family child care program if the child:\n(1) has not been immunized in accordance with subdivision 1 or 2 and in accordance with Minnesota Rules, chapter 4604; and\n(2) is not exempt from immunizations under subdivision 3, paragraph (a), (c), (e), or (f).\n(a) A person who is enrolling or enrolled in an elementary or secondary school or child care facility may substitute a statement from the emancipated person or a parent or guardian if the person is a minor child in lieu of the statement from a physician or public clinic which provides immunizations. If the statement is from a parent or guardian or emancipated person, the statement must indicate the month and year of each immunization given.\n(b) In order for the statement to be acceptable for a person who is enrolling in an elementary school and who is six years of age or younger, it must indicate that the following was given: no less than one dose of vaccine each for measles, mumps, and rubella given separately or in combination; no less than four doses of vaccine for poliomyelitis, unless the third dose was given after the fourth birthday, then three doses are minimum; no less than five doses of vaccine for diphtheria, tetanus, and pertussis, unless the fourth dose was given after the fourth birthday, then four doses are minimum; and no less than three doses of vaccine for hepatitis B.\n(c) In order for the statement to be consistent with subdivision 10 and acceptable for a person who is enrolling in an elementary or secondary school and is age seven through age 19, the statement must indicate that the person has received no less than one dose of vaccine each for measles, mumps, and rubella given separately or in combination, and no less than three doses of vaccine for poliomyelitis, diphtheria, tetanus, and hepatitis B.\n(d) In order for the statement to be acceptable for a person who is enrolling in a secondary school, and who was born after 1956 and is 20 years of age or older, the statement must indicate that the person has received no less than one dose of vaccine each for measles, mumps, and rubella given separately or in combination, and no less than one dose of vaccine for diphtheria and tetanus within the preceding ten years.\n(e) In order for the statement to be acceptable for a person who is enrolling in a child care facility and who is at least 15 months old but who has not reached five years of age, it must indicate that the following were given: no less than one dose of vaccine each for measles, mumps, and rubella given separately or in combination; no less than one dose of vaccine for haemophilus influenzae type b; no less than four doses of vaccine for diphtheria, tetanus, and pertussis; and no less than three doses of vaccine for poliomyelitis.\n(f) In order for the statement to be acceptable for a person who is enrolling in a child care facility and who is five or six years of age, it must indicate that the following was given: no less than one dose of vaccine each for measles, mumps, and rubella given separately or in combination; no less than four doses of vaccine for diphtheria, tetanus, and pertussis; and no less than three doses of vaccine for poliomyelitis.\n(g) In order for the statement to be acceptable for a person who is enrolling in a child care facility and who is seven years of age or older, the statement must indicate that the person has received no less than one dose of vaccine each for measles, mumps, and rubella given separately or in combination and consistent with subdivision 10, and no less than three doses of vaccine for poliomyelitis, diphtheria, and tetanus.\n(h) The commissioner of health, on finding that any of the above requirements are not necessary to protect the public's health, may suspend for one year that requirement.\nIf a person transfers from one elementary or secondary school to another, the school board of a public school district or the administrator of a nonpublic school may allow the person up to a maximum of 30 days to submit one or more of the statements as specified in subdivision 1 or 3, during which time the person may enroll in and attend the school. If a person enrolls in a child care facility in which at least 75 percent of children in the facility participate on a onetime only or occasional basis to a maximum of 45 hours per child, per month, or is placed in a facility by a crisis nursery, the person shall be exempt from all requirements of this section for up to five consecutive days, starting from the first day of attendance.\n[Repealed, 1Sp2001 c 9 art 1 s 62]\nEach school or child care facility shall maintain on file immunization records for all persons in attendance that contain the information required by subdivisions 1, 2, and 3. The school shall maintain the records for at least five years after the person attains the age of majority. The Department of Health and the community health board, as defined in section 145A.02, subdivision 5, in whose jurisdiction the school or child care facility is located, shall have access to the files maintained pursuant to this subdivision. When a person transfers to another elementary or secondary school or child care facility, the administrator or other person having general control and supervision of the school or child care facility shall assist the person's parent or guardian in the transfer of the immunization file to the person's new school or child care facility within 30 days of the transfer. Upon the request of a public or private postsecondary educational institution, as defined in section 135A.14, the administrator or other person having general control or supervision of a school shall assist in the transfer of a student's immunization file to the postsecondary institution.\nThe administrator or other person having general control and supervision of the elementary or secondary school shall file a report with the commissioner on all persons enrolled in the school. The superintendent of each district shall file a report with the commissioner for all persons within the district receiving instruction in a home school in compliance with sections 120A.22 and 120A.24. The parent of persons receiving instruction in a home school shall submit the statements as required by subdivisions 1, 2, 3, 4, and 12 to the superintendent of the district in which the person resides by October 1 of the first year of their homeschooling in Minnesota and the grade 7 year. The school report must be prepared on forms developed jointly by the commissioner of health and the commissioner of education and be distributed to the local districts by the commissioner of health. The school report must state the number of persons attending the school, the number of persons who have not been immunized according to subdivision 1 or 2, and the number of persons who received an exemption under subdivision 3, clause (c) or (d). The school report must be filed with the commissioner of education within 60 days of the commencement of each new school term. Upon request, a district must be given a 60-day extension for filing the school report. The commissioner of education shall forward the report, or a copy thereof, to the commissioner of health who shall provide summary reports to community health boards as defined in section 145A.02, subdivision 5. The administrator or other person having general control and supervision of the child care facility shall file a report with the commissioner of children, youth, and families on all persons enrolled in the child care facility. The child care facility report must be prepared on forms developed jointly by the commissioner of health and the commissioner of children, youth, and families and be distributed to child care facilities by the commissioner of health. The child care facility report must state the number of persons enrolled in the facility, the number of persons with no immunizations, the number of persons who received an exemption under subdivision 3, clause (c) or (d), and the number of persons with partial or full immunization histories. The child care facility report must be filed with the commissioner of children, youth, and families by November 1 of each year. The commissioner of children, youth, and families shall forward the report, or a copy thereof, to the commissioner of health who shall provide summary reports to community health boards as defined in section 145A.02, subdivision 5. The report required by this subdivision is not required of a family child care or group family child care facility, for prekindergarten children enrolled in any elementary or secondary school provided services according to sections 125A.03 and 125A.06, nor for child care facilities in which at least 75 percent of children in the facility participate on a onetime only or occasional basis to a maximum of 45 hours per child, per month.\nAs used in this section the following terms have the meanings given them.\n(a) \"Elementary or secondary school\" includes any public school as defined in section 120A.05, subdivisions 9, 11, 13, and 17, or nonpublic school, church, or religious organization, or home school in which a child is provided instruction in compliance with sections 120A.22 and 120A.24.\n(b) \"Person enrolled in any elementary or secondary school\" means a person born after 1956 and enrolled in grades kindergarten through 12, and a child with a disability receiving special instruction and services as required in sections 125A.03 to 125A.24 and 125A.65, excluding a child being provided services at the home or bedside of the child or in other states.\n(c) \"Child care facility\" includes those child care programs subject to licensure under chapter 142B, and Minnesota Rules, chapters 9502 and 9503.\n(d) \"Family child care\" means child care for no more than ten children at one time of which no more than six are under school age. The licensed capacity must include all children of any caregiver when the children are present in the residence.\n(e) \"Group family child care\" means child care for no more than 14 children at any one time. The total number of children includes all children of any caregiver when the children are present in the residence.\n(a) A statement required to be submitted under subdivisions 1, 2, and 4 to document evidence of immunization shall include month, day, and year for immunizations administered after January 1, 1990.\n(b) A person who has received at least three doses of tetanus and diphtheria toxoids, with the most recent dose given after age six and before age 11, is not required to have additional immunization against diphtheria and tetanus until ten years have elapsed from the person's most recent dose of tetanus and diphtheria toxoid.\n(c) The requirement for hepatitis B vaccination shall apply to persons enrolling in kindergarten beginning with the 2000-2001 school term.\n(d) The requirement for hepatitis B vaccination shall apply to persons enrolling in grade 7 beginning with the 2001-2002 school term.\nNothing in this section relieves the commissioner of children, youth, and families of the responsibility, under chapter 245A, to inspect and assure that statements required by this section are on file at child care programs subject to licensure.\n(a) The commissioner of health may adopt modifications to the immunization requirements of this section. A proposed modification made under this subdivision must be part of the current immunization recommendations of each of the following organizations: the United States Public Health Service's Advisory Committee on Immunization Practices, the American Academy of Family Physicians, and the American Academy of Pediatrics. In proposing a modification to the immunization schedule, the commissioner must:\n(1) consult with (i) the commissioner of education; the commissioner of children, youth, and families; the chancellor of the Minnesota State Colleges and Universities; and the president of the University of Minnesota; and (ii) the Minnesota Natural Health Coalition, Vaccine Awareness Minnesota, Biological Education for Autism Treatment (BEAT), the Minnesota Academy of Family Physicians, the American Academy of Pediatrics-Minnesota Chapter, and the Minnesota Nurses Association; and\n(2) consider the following criteria: the epidemiology of the disease, the morbidity and mortality rates for the disease, the safety and efficacy of the vaccine, the cost of a vaccination program, the cost of enforcing vaccination requirements, and a cost-benefit analysis of the vaccination.\n(b) Before a proposed modification may be adopted, the commissioner must notify the chairs of the house of representatives and senate committees with jurisdiction over health policy issues. If the chairs of the relevant standing committees determine a public hearing regarding the proposed modifications is in order, the hearing must be scheduled within 60 days of receiving notice from the commissioner. If a hearing is scheduled, the commissioner may not adopt any proposed modifications until after the hearing is held.\n(c) The commissioner shall comply with the requirements of chapter 14 regarding the adoption of any proposed modifications to the immunization schedule.\n(d) In addition to the publication requirements of chapter 14, the commissioner of health must inform all immunization providers of any adopted modifications to the immunization schedule in a timely manner.",
	"repealed": false
}