{
	"id": "17.117",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.117",
	"title": "17.117 AGRICULTURE BEST MANAGEMENT PRACTICES LOAN PROGRAM.",
	"text": "The purpose of the agriculture best management practices loan program is to provide low or no interest financing to farmers, agriculture supply businesses, rural landowners, and water-quality cooperatives for the implementation of agriculture and other best management practices that reduce environmental pollution.\nThe commissioner may develop administrative guidelines specifying criteria, standards, and procedures for making loans and establish, adopt rules for, and implement a program to make loans or otherwise provide funds to local units of government, federal authorities, lending institutions, and other appropriate organizations who will in turn provide loans to landowners and businesses for facilities, fixtures, equipment, or other best management practices that prevent or mitigate pollution or other adverse environmental impacts. The agriculture best management practices loan program must provide a consistent programmatic framework for the disbursement and administration of funds available to the commissioner designated to the program for protection of environmental quality or remediation or mitigation of adverse environmental impacts. The distribution of loans or funds through the program must comply with all limitations, provisions, or requirements of the respective funding sources. Unless otherwise limited by the funding source, the commissioner shall manage the program using perpetual revolving fund accounts.\nUp to $140,000,000 of the balance in the clean water revolving fund in section 446A.07, as determined by the Public Facilities Authority, is appropriated to the commissioner for the establishment of this program. In addition, the commissioner may receive appropriations from the legislature and grants or funds from other sources for implementation of the program.\n(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Agricultural and environmental revolving accounts\" means accounts in the agricultural fund, controlled by the commissioner, which hold funds available to the program.\n(c) \"Agriculture supply business\" means a person, partnership, joint venture, corporation, limited liability company, association, firm, public service company, or cooperative that provides materials, equipment, or services to farmers or agriculture-related enterprises.\n(d) \"Allocation\" means the funds awarded to an applicant for implementation of best management practices through a competitive or noncompetitive application process.\n(e) \"Applicant\" means a local unit of government eligible to participate in this program that requests an allocation of funds as provided in subdivision 6b.\n(f) \"Best management practices\" has the meaning given in sections 103F.711, subdivision 3, and 103H.151, subdivision 2. Best management practices also means other practices, techniques, and measures that have been demonstrated to the satisfaction of the commissioner: (1) to prevent or reduce adverse environmental impacts by using the most effective and practicable means of achieving environmental goals; or (2) to achieve drinking water quality standards under chapter 103H or under Code of Federal Regulations, title 40, parts 141 and 143, as amended.\n(g) \"Borrower\" means a farmer, an agriculture supply business, or a rural landowner applying for a low-interest loan.\n(h) \"Commissioner\" means the commissioner of agriculture, including when the commissioner is acting in the capacity of chair of the Rural Finance Authority, or the designee of the commissioner.\n(i) \"Committed project\" means an eligible project scheduled to be implemented at a future date that has been approved by the local government unit.\n(j) \"Comprehensive water management plan\" means a state-approved and locally adopted plan authorized under section 103B.231, 103B.255, 103B.311, 103C.331, 103D.401, or 103D.405.\n(k) \"Cost incurred\" means expenses for implementation of a project accrued because the borrower has agreed to purchase equipment or is obligated to pay for services or materials already provided as a result of implementing an approved eligible project.\n(l) \"Farmer\" means a person, partnership, joint venture, corporation, limited liability company, association, firm, public service company, or cooperative that regularly participates in physical labor or operations management of farming and files a Schedule F as part of filing United States Internal Revenue Service Form 1040 or indicates farming as the primary business activity under Schedule C, K, or S, or any other applicable report to the United States Internal Revenue Service.\n(m) \"Lender agreement\" means an agreement entered into between the commissioner and a local lender which contains terms and conditions of participation in the program.\n(n) \"Local government unit\" means a county, soil and water conservation district, or an organization formed for the joint exercise of powers under section 471.59 with the authority to participate in the program.\n(o) \"Local lender\" means a local government unit as defined in paragraph (n); a local unit of government with taxing or special assessment authority, such as a watershed district, a drainage authority, or a township; a state or federally chartered bank; a savings association; a state or federal credit union; Agribank and its affiliated organizations; or a nonprofit economic development organization or other financial lending institution approved by the commissioner.\n(p) \"Local revolving loan account\" means the account held by a local government unit and a local lender into which principal repayments from borrowers are deposited and new loans are issued in accordance with the requirements of the program and lender agreements.\n(q) \"Nonpoint source\" has the meaning given in section 103F.711, subdivision 6.\n(r) \"Program\" means the agriculture best management practices loan program in this section.\n(s) \"Project\" means one or more components or activities located within Minnesota that are required by the local government unit to be implemented for satisfactory completion of an eligible best management practice.\n(t) \"Rural landowner\" means the owner of record of Minnesota real estate located in an area determined by the local government unit to be rural after consideration of local land use patterns, zoning regulations, jurisdictional boundaries, local community definitions, historical uses, and other pertinent local factors.\n(u) \"Water-quality cooperative\" has the meaning given in section 115.58, paragraph (d), except as expressly limited in this section.\n(a) Use of funds under this section must be in compliance with the rules and regulations of the funding source or appropriation. Use of funds from the Public Facilities Authority must comply with the federal Water Pollution Control Act, section 446A.07, and eligible activities listed in the intended use plan authorized in section 446A.07, subdivision 4.\n(b) In the event of a conflict between this section and a law appropriating money for this program, the law appropriating money for this program governs.\n(a) There shall be established in the special revenue fund revolving accounts to receive appropriations, transfers of the balances from previous appropriations for the activities under this section, and money from other sources. All balances from previous appropriations for activities under this section and repayments of loans granted under this section, including principal and interest, must be deposited into the appropriate revolving account created in this subdivision or the account created in subdivision 13. Interest earned in an account accrues to that account.\n(b) The money in the revolving accounts and the account created in subdivision 13 is appropriated to the commissioner for the purposes of this section.\nThe commissioner may impose a nonrefundable application fee of $50 for each loan issued under the program. The fees must be credited to the agricultural best management practices administration account, which is hereby established in the special revenue fund. Interest earned in the account accrues to the account. Money in the account and interest earned in the accounts established in the agricultural fund under subdivision 5a are appropriated to the commissioner for administrative expenses of the program.\n(a) Only the following local government units may apply for funds under this program:\n(1) counties or their designees;\n(2) soil and water conservation districts; and\n(3) joint power organizations consisting of counties or their designees or soil and water conservation districts.\n(b) A county may submit an application for an allocation. A county or a group of counties may designate another local government unit to submit a local allocation request on their behalf. If a county does not submit an application, and does not designate another local government unit, a soil and water conservation district may submit an application for an allocation. If the local soil and water conservation district does not submit an application, then an eligible joint powers organization may submit an application for an allocation. In all instances, there may be only one application representing any geographic area. The applicant must coordinate and submit requests on behalf of other units of government within the geographic jurisdiction of the applicant.\n(c) The commissioner must prescribe forms and establish an application process for applicants to apply for an allocation of funds. The application must include but need not be limited to (1) the geographic area served; (2) the type and estimated cost of activities or projects for which they are seeking an allocation; and (3) prioritization or targeting of proposed activities or projects.\n(d) If an application is rejected, the applicant must be notified in writing as to the reasons for the rejection and given 30 days to submit a revised application. The revised application shall be reviewed according to the same procedure used to review the initial application. Failure of an applicant to be awarded funds does not constitute a rejection of the application.\n(a) The commissioner shall chair a subcommittee for purposes of reviewing and ranking applications and recommending to the commissioner allocation amounts. The subcommittee consists of representatives of the Departments of Agriculture, Natural Resources, and Health; the Pollution Control Agency; the Board of Water and Soil Resources; the Farm Service Agency and the Natural Resources Conservation Service of the United States Department of Agriculture; the Association of Minnesota Counties; the Minnesota Association of Soil and Water Conservation Districts; and other agencies or associations the commissioner determines are appropriate.\n(b) The subcommittee must use the criteria in clauses (1) to (9) as well as other criteria it determines appropriate in carrying out the review and ranking:\n(1) whether the proposed activities are identified in a comprehensive water management plan or other appropriate local planning documents as priorities;\n(2) the potential that the proposed activities have for improving or protecting environmental quality;\n(3) the extent that the proposed activities support areawide or multijurisdictional approaches to protecting environmental quality based on defined watershed or similar geographic areas;\n(4) whether the activities are needed for compliance with existing environmental laws or rules;\n(5) whether the proposed activities demonstrate participation, coordination, and cooperation between local units of government and other public agencies;\n(6) whether there is coordination with other public and private funding sources and programs;\n(7) whether the applicant has targeted specific best management practices to resolve specific environmental problems;\n(8) past performance of the applicant in completing projects identified in prior applications and allocation agreements; and\n(9) whether there are off-site public benefits.\n(a) The subcommittee created in subdivision 6a shall recommend to the commissioner the amount of allocation for each applicant. This allocation must include:\n(1) the amount of repayments received by the commissioner during the previous year from prior completed projects approved by the local government unit; and\n(2) the amount of funds previously designated to committed projects.\n(b) Within the limits of the funds available to the commissioner, the subcommittee may recommend an increased allocation award to the applicant based on:\n(1) the ranking of the local government unit application under subdivision 6a; and\n(2) the amount of unallocated or uncommitted funds in, or that will be received by, the agricultural and environmental revolving accounts within one year.\n(c) Notwithstanding paragraphs (a) and (b), the commissioner may reserve up to two percent of all funds appropriated to the agricultural and environmental revolving accounts to be allocated to applicants that disburse or commit all of their current allocations or to local lenders who wish to provide financial assistance.\nThe commissioner may add, for the purposes of calculating future allocations under paragraphs (a) and (b), the loan amount for projects financed from these reserved funds to the allocation for the respective local government units in which jurisdiction the project was completed.\n(a) Payments made from the commissioner to the local lender must be made in accordance with applicable state and federal laws and rules governing the payments and the lender agreement.\n(b) Payments from the commissioner to the local lender must be disbursed on a cost-incurred basis. The request must be made in accordance with requirements and procedures established by the commissioner. Payment requests must be reviewed and approved by the commissioner.\n(a) Eligible local government units with an allocation award may enter into an allocation agreement with the commissioner and participate in this program.\n(b) The allocation agreement must contain terms and conditions for participation in this program and providing of funds through this program, including, but not limited to: program requirements, reporting requirements, project eligibility and limitations, allowable expenses, limitations, rescission and cancellation provisions, and the responsibilities of the commissioner, local government unit, and local lender.\n(c) If the commissioner determines that a local government unit is not in compliance with the terms of the allocation agreement, the commissioner may rescind all or part of any allocation awarded through this program.\n(a) Continued availability of allocations granted to a local government unit is contingent upon the commissioner's approval of the local government unit's annual report. The commissioner shall review this annual report to ensure that the past and future uses of the funds are consistent with the comprehensive water management plan, other local planning documents, the requirements of the funding source, and compliance to program requirements. If the commissioner concludes the past or intended uses of the money are not consistent with these requirements, the commissioner shall rescind all or part of the allocation awarded to a local government unit.\n(b) The commissioner may rescind funds allocated to the local government unit that are not designated to committed projects or disbursed within one year from the date of the allocation agreement.\n(c) The commissioner may rescind uncommitted allocations.\n(a) A local government unit that enters into an allocation agreement with the commissioner:\n(1) is responsible for the local administration and implementation of the program in accordance with this section;\n(2) may submit applications for allocations to the commissioner;\n(3) shall identify, develop, determine eligibility, define and approve projects, designate maximum loan amounts for projects, and certify completion of projects implemented under this program. In areas where no local government unit has applied for funds under this program, the commissioner may appoint a local government unit to review and certify projects or the commissioner may assume the authority and responsibility of the local government unit;\n(4) shall certify as eligible only projects that are within its geographic jurisdiction or within the geographic area identified in its local comprehensive water management plans or other local planning documents;\n(5) may require withholding by the local lender of all or a portion of the loan to the borrower until satisfactory completion of all required components of a certified project;\n(6) shall report to the commissioner annually the past and intended uses of allocations awarded; and\n(7) may request additional funds in excess of their allocation when funds are available in the agricultural and environmental revolving accounts, as long as all other allocation awards to the local government unit have been used or committed.\n(b) If a local government unit withdraws from participation in this program, the local government unit, or the commissioner in accordance with the priorities established under subdivision 6a, may designate another local government unit that is eligible under subdivision 6 as the new local government unit responsible for local administration of this program. This designated local government unit may accept responsibility and administration of allocations awarded to the former responsible local government unit.\n(a) Any local lender entering into a lender agreement with the commissioner may participate in this program.\n(b) The lender agreement will contain terms and conditions for participation in this program and providing funds to the local lenders, including but not limited to, program requirements, loan and account management requirements, payments, repayments, term limits, allowable expenses, fee limitations, rescission and cancellation provisions, collateral and security requirements, reporting requirements, review and appeal procedure for cancellation of the loan agreement or disqualification as a local lender, and the responsibilities of the commissioner, local government unit, and local lender.\n(c) If the commissioner determines that a local lender is not in compliance with the terms of the lender agreement, the commissioner may take the following actions:\n(1) disqualifying the local lender as a participating lender in this program for a period of up to five years from the date that the commissioner determines noncompliance to the lender agreement; and\n(2) requiring immediate or accelerated repayment of all or part of all funds provided to the local lender.\n(d) Existing lender agreements, executed prior to July 1, 2001, may be amended by mutual consent of all signatory parties, to comply with this section, to establish a single allocation agreement that includes the amount of prior allocation awards and defines the terms and conditions required under subdivision 8, or to modify the amount of allocation awarded.\n(a) Local lenders may enter into lender agreements with the commissioner.\n(b) Local lenders may enter into loan agreements with borrowers to finance eligible projects under this section.\n(c) Local lenders with local revolving loan accounts created before July 1, 2001, may continue to retain and use those accounts in accordance with their lending agreements for the full term of those agreements.\n(d) Local lenders, including local government units designating themselves as the local lender, may enter into participation agreements with other lenders.\n(e) Local lenders may enter into contracts with other lenders for the limited purposes of loan review, processing and servicing, or to enter into loan agreements with borrowers to finance projects under this section. Other lenders entering into contracts with local lenders under this section must meet the definition of local lender in subdivision 4, must comply with all provisions of the lender agreement and this section, and must guarantee repayment of the loan funds to the local lender.\n(f) When required by the local government unit, a local lender must withhold all or a portion of the loan disbursement for a project until notified by the local government unit that the project has been satisfactorily completed.\n(g) The local lender is responsible for repaying all funds provided by the commissioner to the local lender.\n(h) The local lender is responsible for collecting repayments from borrowers. If a borrower defaults on a loan issued by the local lender, it is the responsibility of the local lender to obtain repayment from the borrower. Default on the part of borrowers shall have no effect on the local lender's responsibility to repay its obligations to the commissioner whether or not the local lender fully recovers defaulted amounts from borrowers.\n(i) The local lender shall provide sufficient collateral or protection to the commissioner for the funds provided to the local lender. The commissioner must approve the collateral or protection provided.\n(a) Local lenders may issue loans only for projects that are approved and certified by the local government unit as meeting priority needs identified in a comprehensive water management plan or other local planning documents, are in compliance with accepted practices, standards, specifications, or criteria, and are eligible for financing under Environmental Protection Agency or other applicable guidelines.\n(b) The local lender may use any additional criteria considered necessary to determine the eligibility of borrowers for loans.\n(c) Local lenders shall set the terms and conditions of loans to borrowers, except that no borrower shall, at any time, have loans from this program with a total outstanding loan balance of more than $200,000.\n(d) The maximum term length for projects in this paragraph is ten years.\n(e) Fees charged at the time of closing must:\n(1) be in compliance with normal and customary practices of the local lender;\n(2) be in accordance with published fee schedules issued by the local lender;\n(3) not be based on participation program; and\n(4) be consistent with fees charged other similar types of loans offered by the local lender.\n(f) The interest rate assessed to an outstanding loan balance by the local lender must not exceed three percent per year.\n(a) All projects that remediate or mitigate adverse environmental impacts are eligible if the project is eligible under an allocation agreement.\n(b) A manure management project is eligible if the project remediates or mitigates impacts from facilities with less than 1,000 animal units as defined in Minnesota Rules, chapter 7020, and otherwise meets the requirements of this section.\n(c) A drinking water project is eligible if the project:\n(1) remediates or mitigates the inadequate flow, adverse environmental impacts, or presence of contaminants in privately owned water supplies that are used for drinking water by people or livestock, privately owned water service lines, or privately owned plumbing and fixtures;\n(2) implements best management practices that are intended to achieve drinking water standards or adequate flow; and\n(3) otherwise meets the requirements of this section.\nThe following data on local government units, local lenders, or borrowers collected by the commissioner under this section are private for data on individuals as provided in section 13.02, subdivision 12, or nonpublic for data not on individuals as provided in section 13.02, subdivision 9: financial information, including, but not limited to, credit reports, financial statements, tax returns and net worth calculations received or prepared by the commissioner.\nThe Public Facilities Authority shall establish an account called the agriculture best management practices revolving account to provide loans and other forms of financial assistance authorized under section 446A.07. The account must be credited with repayments.\n[Repealed by amendment, 1Sp2001 c 2 s 25]\n(a) The commissioner shall prepare and submit a report to the house of representatives and senate committees with jurisdiction over the environment, natural resources, and agriculture by October 15 of each odd-numbered year.\n(b) The report shall include, but need not be limited to, matters such as loan allocations and uses, the extent to which the financial assistance is helping implement local water and other environmental planning priorities, the integration or coordination that has occurred with related programs, and other matters deemed pertinent to the implementation of the program.\n(a) The amount of loans and accruing interest made by a county, home rule charter city, statutory city, or town acting as a local lender under this section is a lien against the real property for which the improvement was made and must be assessed against the property or properties benefited unless the amount is prepaid. The lien is a special assessment under chapter 429 and repayments may be collected as a special assessment as provided for in section 429.101 or by charter. An amount loaned under the program and its accruing interest assessed against the property is a priority lien only against subsequent liens.\n(b) The county, home rule charter city, statutory city, or town may bill amounts due on the loan on the tax statement for the property. Enforcement of the lien created by this subdivision must, at the county's, home rule charter city's, statutory city's, or town's option, be in the manner set forth in chapter 580 or 581. When the amount due and all interest has been paid, the county, home rule charter city, statutory city, or town shall file a satisfaction of the lien created under this subdivision.\n(c) A county, home rule charter city, statutory city, or town may also secure amounts due on a loan under this section by taking a purchase money security interest in equipment in accordance with chapter 336, article 9, and may enforce the purchase money security interest in accordance with chapters 336, article 9, and 565.\nFor the purpose of obtaining a loan from the commissioner, a local government unit acting as a local lender may provide to the commissioner its general obligation note. All obligations incurred by a local government unit in obtaining a loan from the commissioner must be in accordance with chapter 475, except that so long as the obligations are issued to evidence a loan from the commissioner to the local government unit, an election is not required to authorize the obligations issued, and the amount of the obligations shall not be included in determining the net indebtedness of the local government unit under the provisions of any law or chapter limiting the indebtedness.",
	"repealed": false
}