{
	"id": "317A.453",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.453",
	"title": "317A.453 PROXIES.",
	"text": "If the articles or bylaws permit proxy voting, a member may cast or authorize the casting of a vote by (1) filing a nonelectronic written appointment of a proxy, signed by the member, with an officer of the corporation at or before the meeting at which the appointment is to be effective, or (2) telephonic transmission or authenticated electronic communication, whether or not accompanied by written instructions of the member, of an appointment of a proxy with the corporation or the corporation's duly authorized agent at or before the meeting at which the appointment is to be effective.\nAn appointment of a proxy is effective when received by the secretary or other officer or agent authorized to tabulate votes. An appointment is valid for 11 months unless a different period is expressly provided in the appointment form provided, however, that a proxy is not valid for more than three years from its date of execution.\nAn appointment of a proxy is revocable by the member. Appointment of a proxy is revoked by the person appointing the proxy by:\n(1) attending a meeting and voting in person; or\n(2) signing and delivering to the officer or agent authorized to tabulate proxy votes either a writing stating that the appointment of the proxy is revoked or a later appointment form.\nThe death or incapacity of the member appointing a proxy does not affect the right of the corporation to accept the proxy's authority unless notice of the death or incapacity is received by the secretary or other officer or agent authorized to tabulate votes before the proxy exercises authority under the appointment.\n(a) Subject to section 317A.455 and an express limitation on the proxy's authority appearing on the face of the appointment form, a corporation is entitled to accept the proxy's vote or other action as that of the member making the appointment.\n(b) The vote of a proxy is final, binding, and not subject to challenge, but the proxy is liable to the member for damages resulting from a failure to exercise the proxy or from an exercise of the proxy in violation of the authority granted in the appointment.\nUnless the appointment specifically provides otherwise, if two or more persons are appointed as proxies for a member:\n(1) any one of them may vote on each item of business in accordance with specific instructions contained in the appointment; or\n(2) if no specific instructions are contained in the appointment with respect to voting on a particular item of business, a majority of the proxies have the authority conferred by the instrument. If the proxies are equally divided, they share the vote equally.",
	"repealed": false
}