{
	"id": "80E.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/80E.03",
	"title": "80E.03 DEFINITIONS.",
	"text": "As used in sections 80E.01 to 80E.17, unless the context otherwise requires, the following terms have the meanings given them.\n\"Motor vehicle\" is as defined in section 168.002, subdivision 18, but does not include farm implements or machinery or special mobile equipment as defined in section 168.002, subdivision 31.\n\"New motor vehicle dealer\" or \"dealer\" means a person who in the ordinary course of business is engaged in the business of selling new motor vehicles to consumers or other end users and who holds a valid sales and service agreement, franchise, or contract, granted by a manufacturer, distributor, or wholesaler for the sale of its motor vehicles.\n\"Manufacturer\" means any person who manufactures or assembles new motor vehicles or any person, partnership, firm, association, joint venture, corporation, or trust which is controlled by the manufacturer.\n\"Distributor\" means any person who in whole or in part offers for sale, sells, or distributes any new motor vehicle to new motor vehicle dealers, or who maintains factory representatives or who controls any person who in whole or in part offers for sale, sells, or distributes any new motor vehicle to new motor vehicle dealers.\n\"Factory branch\" means a branch office maintained by a manufacturer for the purpose of selling, or offering for sale, motor vehicles to a distributor or new motor vehicle dealer, or for directing or supervising in whole or in part factory or distributor representatives.\n\"New motor vehicle\" means a motor vehicle which is in the possession of a manufacturer, distributor, or wholesaler, or has been sold only to the holders of a valid sales and service agreement, franchise, or contract, granted by the manufacturer, distributor, or wholesaler for the sale of the new motor vehicle and which is in fact new and on which the original title has not been issued from the franchised dealer.\n\"Franchise\" means the written agreement or contract between any new motor vehicle manufacturer and any new motor vehicle dealer which grants to the dealer the right to market motor vehicles and which purports to fix the legal rights and liabilities of the parties to the agreement or contract.\n\"Good faith\" means honesty in fact and the observation of reasonable commercial standards of fair dealing in the trade as is defined and interpreted in section 336.2-103, clause (1)(b).\n\"Designated family member\" means the spouse, child, grandchild, parent, brother, or sister of the owner of a new motor vehicle dealer who, in the case of the owner's death, is entitled to inherit the ownership interest in the new motor vehicle dealer under the terms of the owner's will or who, in the case of an incapacitated owner of a new motor vehicle dealer, has been appointed by a court as the legal representative of the new motor vehicle dealer's property.\n\"Line-make\" means motor vehicles that are offered for sale, lease, or distribution under a common name, trademark, service mark, or brand name of the manufacturer, distributor, or factory branch.\n\"Area of sales effectiveness\" means a geographic area designated in a franchise agreement or related document where a new motor vehicle dealer is responsible for effectively selling, servicing, and otherwise representing the products of the manufacturer, distributor, or factory branch.\n[Repealed, 1985 c 34 s 6]",
	"repealed": false
}