{
	"id": "299F.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.60",
	"title": "299F.60 PIPELINE VIOLATION; RULES, CIVIL PENALTIES.",
	"text": "Any person who violates any provision of sections 299F.56 to 299F.641, or any rule issued thereunder, is subject to a civil penalty to be imposed by the commissioner not to exceed the maximum penalties listed in Code of Federal Regulations, title 49, part 190, and any successor regulations and standards that may be amended or adopted.\nThe commissioner may negotiate a compromise settlement of a civil penalty. In determining the amount of such penalty, or the amount of the compromise settlement, the commissioner shall consider the appropriateness of such penalty to the size of the business of the person charged, the gravity of the violation, and the good faith of the person charged in attempting to achieve compliance, after notification of a violation. The contested case and judicial review provisions of chapter 14 shall apply to all orders of the commissioner imposing any penalty for violations of sections 299F.56 to 299F.641 or any rule promulgated thereunder. The amount of such penalty, when finally determined, may be deducted from any sums owing by the state of Minnesota to the person charged.\nNo person shall be subjected to civil penalties under both sections 299F.56 to 299F.641 and under the federal Natural Gas Pipeline Safety Act or the federal Hazardous Liquid Pipeline Safety Act, for conduct which may give rise to a violation of both acts.\nAll penalties collected under sections 299F.56 to 299F.641 shall be paid over to the commissioner of management and budget for deposit in the state treasury to the credit of the pipeline safety account.\nThe commissioner shall adopt rules establishing reasonable guidelines for imposing penalties. The rules must treat separately and distinguish between violations that relate to hazardous liquid pipelines, gas pipelines, and other pipelines; must provide for notice that a penalty is assessed; and may exempt activities from penalties unless the person has evidenced a course of action in disregard of this chapter.",
	"repealed": false
}