{
	"id": "146A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/146A.08",
	"title": "146A.08 PROHIBITED CONDUCT.",
	"text": "(a) The commissioner may impose disciplinary action as described in section 146A.09 against any unlicensed complementary and alternative health care practitioner. The following conduct is prohibited and is grounds for disciplinary action:\n(b) Conviction of a crime, including a finding or verdict of guilt, an admission of guilt, or a no-contest plea, in any court in Minnesota or any other jurisdiction in the United States, reasonably related to engaging in complementary and alternative health care practices. Conviction, as used in this subdivision, includes a conviction of an offense which, if committed in this state, would be deemed a felony, gross misdemeanor, or misdemeanor, without regard to its designation elsewhere, or a criminal proceeding where a finding or verdict of guilty is made or returned but the adjudication of guilt is either withheld or not entered.\n(c) Conviction of any crime against a person. For purposes of this chapter, a crime against a person means violations of the following: sections 609.185; 609.19; 609.195; 609.20; 609.205; 609.2112; 609.2113; 609.2114; 609.215; 609.221; 609.222; 609.223; 609.224; 609.2242; 609.23; 609.231; 609.2325; 609.233; 609.2335; 609.235; 609.24; 609.245; 609.247; 609.25; 609.255; 609.26, subdivision 1, clause (1) or (2); 609.265; 609.342; 609.343; 609.344; 609.345; 609.365; 609.498, subdivision 1 or 1b; 609.50, subdivision 1, clause (1); 609.561; 609.562; 609.595; and 609.72, subdivision 3; and Minnesota Statutes 2012, section 609.21.\n(d) Failure to comply with the self-reporting requirements of section 146A.03, subdivision 7.\n(e) Engaging in sexual contact with a complementary and alternative health care client, engaging in contact that may be reasonably interpreted by a client as sexual, engaging in any verbal behavior that is seductive or sexually demeaning to the client, or engaging in sexual exploitation of a client or former client.\n(f) Advertising that is false, fraudulent, deceptive, or misleading.\n(g) Conduct likely to deceive, defraud, or harm the public or demonstrating a willful or careless disregard for the health, welfare, or safety of a complementary and alternative health care client; or any other practice that may create danger to any client's life, health, or safety, in any of which cases, proof of actual injury need not be established.\n(h) Adjudication as mentally incompetent or as a person who is dangerous to self or adjudication pursuant to chapter 253B as chemically dependent, mentally ill, developmentally disabled, mentally ill and dangerous to the public, or as a sexual psychopathic personality or sexually dangerous person.\n(i) Inability to engage in complementary and alternative health care practices with reasonable safety to complementary and alternative health care clients.\n(j) The habitual overindulgence in the use of or the dependence on intoxicating liquors.\n(k) Improper or unauthorized personal or other use of any legend drugs as defined in chapter 151, any chemicals as defined in chapter 151, or any controlled substance as defined in chapter 152.\n(l) Revealing a communication from, or relating to, a complementary and alternative health care client except when otherwise required or permitted by law.\n(m) Failure to comply with a complementary and alternative health care client's request made under sections 144.291 to 144.298 or to furnish a complementary and alternative health care client record or report required by law.\n(n) Splitting fees or promising to pay a portion of a fee to any other professional other than for services rendered by the other professional to the complementary and alternative health care client.\n(o) Engaging in abusive or fraudulent billing practices, including violations of the federal Medicare and Medicaid laws or state medical assistance laws.\n(p) Failure to make reports as required by section 146A.03 or cooperate with an investigation of the office.\n(q) Obtaining money, property, or services from a complementary and alternative health care client, other than reasonable fees for services provided to the client, through the use of undue influence, harassment, duress, deception, or fraud.\n(r) Failure to provide a complementary and alternative health care client with a copy of the client bill of rights or violation of any provision of the client bill of rights.\n(s) Violating any order issued by the commissioner.\n(t) Failure to comply with any provision of sections 146A.01 to 146A.11 and the rules adopted under those sections.\n(u) Failure to comply with any additional disciplinary grounds established by the commissioner by rule.\n(v) Revocation, suspension, restriction, limitation, or other disciplinary action against any health care license, certificate, registration, or right to practice of the unlicensed complementary and alternative health care practitioner in this or another state or jurisdiction for offenses that would be subject to disciplinary action in this state or failure to report to the office that charges regarding the practitioner's license, certificate, registration, or right of practice have been brought in this or another state or jurisdiction.\n(w) Use of the title \"doctor,\" \"Dr.,\" or \"physician\" alone or in combination with any other words, letters, or insignia to describe the complementary and alternative health care practices the practitioner provides.\n(x) Failure to provide a complementary and alternative health care client with a recommendation that the client see a health care provider who is licensed or registered by a health-related licensing board or the commissioner of health, if there is a reasonable likelihood that the client needs to be seen by a licensed or registered health care provider.\nThe fact that a complementary and alternative health care practice may be a less customary approach to health care shall not constitute the basis of a disciplinary action per se.\nIn disciplinary actions alleging a violation of subdivision 1, paragraph (b), (c), (d), or (h), a copy of the judgment or proceeding under the seal of the court administrator or of the administrative agency that entered the same is admissible into evidence without further authentication and constitutes prima facie evidence of its contents.\n(a) If the commissioner has probable cause to believe that an unlicensed complementary and alternative health care practitioner has engaged in conduct prohibited by subdivision 1, paragraph (h), (i), (j), or (k), the commissioner may issue an order directing the practitioner to submit to a mental or physical examination or substance use disorder evaluation. For the purpose of this subdivision, every unlicensed complementary and alternative health care practitioner is deemed to have consented to submit to a mental or physical examination or substance use disorder evaluation when ordered to do so in writing by the commissioner and further to have waived all objections to the admissibility of the testimony or examination reports of the health care provider performing the examination or evaluation on the grounds that the same constitute a privileged communication. Failure of an unlicensed complementary and alternative health care practitioner to submit to an examination or evaluation when ordered, unless the failure was due to circumstances beyond the practitioner's control, constitutes an admission that the unlicensed complementary and alternative health care practitioner violated subdivision 1, paragraph (h), (i), (j), or (k), based on the factual specifications in the examination or evaluation order and may result in a default and final disciplinary order being entered after a contested case hearing. An unlicensed complementary and alternative health care practitioner affected under this paragraph shall at reasonable intervals be given an opportunity to demonstrate that the practitioner can resume the provision of complementary and alternative health care practices with reasonable safety to clients. In any proceeding under this paragraph, neither the record of proceedings nor the orders entered by the commissioner shall be used against an unlicensed complementary and alternative health care practitioner in any other proceeding.\n(b) In addition to ordering a physical or mental examination or substance use disorder evaluation, the commissioner may, notwithstanding section 13.384; 144.651; 595.02; or any other law limiting access to medical or other health data, obtain medical data and health records relating to an unlicensed complementary and alternative health care practitioner without the practitioner's consent if the commissioner has probable cause to believe that a practitioner has engaged in conduct prohibited by subdivision 1, paragraph (h), (i), (j), or (k). The medical data may be requested from a provider as defined in section 144.291, subdivision 2, paragraph (i), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the commissioner under this subdivision and is not liable in any action for damages for releasing the data requested by the commissioner if the data are released pursuant to a written request under this subdivision, unless the information is false and the person or organization giving the information knew or had reason to believe the information was false. Information obtained under this subdivision is private data under section 13.41.",
	"repealed": false
}