{
	"id": "308B.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.301",
	"title": "308B.301 POWERS.",
	"text": "(a) In addition to other powers, a cooperative as an agent or otherwise:\n(1) may perform every act necessary or proper to the conduct of the cooperative's business or the accomplishment of the purposes of the cooperative;\n(2) has other rights, powers, or privileges granted by the laws of this state to other cooperatives, except those that are inconsistent with the express provisions of this chapter; and\n(3) has the powers given in section 308A.201 and in this section.\n(b) This section does not give a cooperative the power or authority to exercise the powers of a credit union under chapter 52, a bank under chapter 48, or a savings association under chapter 51A.\nA cooperative may buy, sell, or deal in its own products; the products of its individual members, patrons, or nonmembers; the products of another cooperative association or of its members or patrons; or the products of another person or entity. A cooperative may negotiate the price at which its products may be sold.\nA cooperative may enter into or become a party to a contract or agreement for the cooperative or for the cooperative's individual members or patrons or between the cooperative and its members.\n(a) A cooperative may purchase and hold, lease, mortgage, encumber, sell, exchange, and convey as a legal entity real, personal, and intellectual property, including real estate, buildings, personal property, patents, and copyrights as the business of the cooperative may require, including the sale or other disposition of assets required by the business of the cooperative as determined by the board.\n(b) A cooperative may take, receive, and hold real and personal property, including the principal and interest of money or other funds and rights in a contract, in trust for any purpose not inconsistent with the purposes of the cooperative in its articles or bylaws and may exercise fiduciary powers in relation to taking, receiving, and holding the real and personal property.\nA cooperative may erect buildings or other structures or facilities on the cooperative's owned or leased property or on a right-of-way legally acquired by the cooperative.\nA cooperative may issue bonds, debentures, or other evidence of indebtedness and may borrow money, may secure any of its obligations by mortgage of or creation of a security interest in or other encumbrances or assignment of all or any of its property, franchises, or income, and may issue guarantees for any legal purpose. The cooperative may form special purpose business entities to secure assets of the cooperative.\nA cooperative may make advances to its members or patrons on products delivered by the members or patrons to the cooperative.\nA cooperative may accept donations or deposits of money or real personal property from other cooperatives or associations from which it is constituted.\nA cooperative may loan or borrow money to or from individual members, cooperatives, or associations from which it is constituted with security that it considers sufficient. A cooperative may invest and reinvest its funds.\nA cooperative may pay pensions, retirement allowances, and compensation for past services to and for the benefit of; and establish, maintain, continue, and carry out, wholly or partially at the expense of the cooperative, employee or incentive benefit plans, trust, and provisions to or for the benefit of any or all of its and its related organizations' officers, managers, directors, governors, employees, and agents; and in the case of a related organization that is a cooperative, members who provide services to the cooperative, and any of their families, dependents, and beneficiaries. It may indemnify and purchase and maintain insurance for and on behalf of a fiduciary of any of these employee benefit and incentive plans, trusts, and provisions.\nA cooperative may provide for its benefit life insurance and other insurance with respect to the services of any or all of its members, managers, directors, employees, and agents, or on the life of a member for the purpose of acquiring at the death of the member any or all membership interests in the cooperative owned by the member.\n(a) A cooperative may purchase, acquire, hold, or dispose of the ownership interests of another business entity or organize business entities whether organized under the laws of this state or another state or the United States and assume all rights, interests, privileges, responsibilities, and obligations arising out of the ownership interests, including a business entity organized:\n(1) as a federation of associations;\n(2) for the purpose of forming a district, state, or national marketing sales or service agency; or\n(3) for the purpose of acquiring marketing facilities at terminal or other markets in this state or other states.\n(b) A cooperative may purchase, own, and hold ownership interests, including stock and other equity interests, memberships, interests in nonstock capital, and evidences of indebtedness of any domestic business entity or foreign business entity.\nA cooperative may exercise any and all fiduciary powers in relations with members, cooperatives, associations, or business entities from which it is constituted.",
	"repealed": false
}