{
	"id": "169.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.305",
	"title": "169.305 CONTROLLED-ACCESS RULES AND PENALTIES.",
	"text": "(a) No person shall drive a vehicle onto or from any controlled-access highway except at such entrances and exits as are established by public authority.\n(b) When special crossovers between the main roadways of a controlled-access highway are provided for emergency vehicles or maintenance equipment and such crossovers are signed to prohibit \"U\" turns, it shall be unlawful for any vehicle, except an emergency vehicle, maintenance equipment, construction equipment including contractor's and state-owned equipment when operating within a marked construction zone, or a vehicle operated by a commercial vehicle inspector of the Department of Public Safety, to use such crossover. Vehicles owned and operated by elderly and needy persons under contract with the commissioner of transportation pursuant to section 160.282 for maintenance services on highway rest stop and tourist centers outside the seven-county metropolitan area as defined in section 473.121, may also use these crossovers while those persons are proceeding to or from work in the rest area or tourist center if authorized by the commissioner, and the vehicle carries on its roof a distinctive flag designed and issued by the commissioner. For the purposes of this clause \"emergency vehicle\" includes a tow truck or towing vehicle if it is on the way to the location of an accident or a disabled vehicle.\n(c) The commissioner of transportation may by order, and any public authority may by ordinance, with respect to any controlled-access highway under their jurisdictions prohibit or regulate the use of any such highway by pedestrians, bicycles, or other nonmotorized traffic, or by motorized bicycles, or by any class or kind of traffic which is found to be incompatible with the normal and safe flow of traffic.\n(d) The commissioner of transportation or the public authority adopting any such prohibitory rules shall erect and maintain official signs on the controlled-access highway on which such rules are applicable and when so erected no person shall disobey the restrictions stated on such signs.\nExcept for a driver of an authorized emergency vehicle in the course of performing duties, no driver of a vehicle shall back the same upon the roadway or shoulder of any controlled-access highway.\nAny person who violates the provisions of this section or any order or ordinance promulgated or enacted by the commissioner of transportation or a public authority pursuant thereto is guilty of a petty misdemeanor.",
	"repealed": false
}