{
	"id": "176.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.041",
	"title": "176.041 EXCLUDED EMPLOYMENTS; APPLICATION, EXCEPTIONS, ELECTION OF COVERAGE.",
	"text": "This chapter does not apply to any of the following:\n(1) a person employed by a common carrier by railroad engaged in interstate or foreign commerce and who is covered by the Federal Employers' Liability Act, United States Code, title 45, sections 51 to 60, or other comparable federal law;\n(2) a person employed by a family farm as defined by section 176.011, subdivision 11a;\n(3) the spouse, parent, and child, regardless of age, of a farmer-employer working for the farmer-employer;\n(4) a sole proprietor, or the spouse, parent, and child, regardless of age, of a sole proprietor;\n(5) a partner engaged in a farm operation or a partner engaged in a business and the spouse, parent, and child, regardless of age, of a partner in the farm operation or business;\n(6) an executive officer of a family farm corporation;\n(7) an executive officer of a closely held corporation having less than 22,880 hours of payroll in the preceding calendar year, if that executive officer owns at least 25 percent of the stock of the corporation;\n(8) a spouse, parent, or child, regardless of age, of an executive officer of a family farm corporation as defined in section 500.24, subdivision 2, and employed by that family farm corporation;\n(9) a spouse, parent, or child, regardless of age, of an executive officer of a closely held corporation who is referred to in clause (7);\n(10) another farmer or a member of the other farmer's family exchanging work with the farmer-employer or family farm corporation operator in the same community;\n(11) a person whose employment at the time of the injury is casual and not in the usual course of the trade, business, profession, or occupation of the employer;\n(12) persons who are independent contractors as defined by sections 176.043 and 181.723, and any rules adopted by the commissioner pursuant to section 176.83 except that these exclusions do not apply to an employee of an independent contractor;\n(13) an officer or a member of a veterans' organization whose employment relationship arises solely by virtue of attending meetings or conventions of the veterans' organization, unless the veterans' organization elects by resolution to provide coverage under this chapter for the officer or member;\n(14) a person employed as a household worker in, for, or about a private home or household who earns less than $1,000 in cash in a three-month period from a single private home or household provided that a household worker who has earned $1,000 or more from the household worker's present employer in a three-month period within the previous year is covered by this chapter regardless of whether or not the household worker has earned $1,000 in the present quarter;\n(15) persons employed by a closely held corporation who are related by blood or marriage, within the third degree of kindred according to the rules of civil law, to an officer of the corporation, who is referred to in clause (7), if the corporation files a written election with the commissioner to exclude such individuals. A written election is not required for a person who is otherwise excluded from this chapter by this section;\n(16) a nonprofit association which does not pay more than $1,000 in salary or wages in a year;\n(17) persons covered under the Domestic Volunteer Service Act of 1973, as amended, United States Code, title 42, sections 5011, et seq.;\n(18) a manager of a limited liability company having ten or fewer members and having less than 22,880 hours of payroll in the preceding calendar year, if that manager owns at least a 25 percent membership interest in the limited liability company;\n(19) a spouse, parent, or child, regardless of age, of a manager of a limited liability company described in clause (18);\n(20) persons employed by a limited liability company having ten or fewer members and having less than 22,880 hours of payroll in the preceding calendar year who are related by blood or marriage, within the third degree of kindred according to the rules of civil law, to a manager of a limited liability company described in clause (18), if the company files a written election with the commissioner to exclude these persons. A written election is not required for a person who is otherwise excluded from this chapter by this section; or\n(21) members of limited liability companies who satisfy the requirements of clause (12).\nThe persons, partnerships, limited liability companies, and corporations described in this subdivision may elect to provide the insurance coverage required by this chapter.\n(a) An owner or owners of a business or farm may elect coverage for themselves.\n(b) A partnership owning a business or farm may elect coverage for any partner.\n(c) A family farm corporation as defined in section 500.24, subdivision 2, clause (c), may elect coverage for any executive officer.\n(d) A closely held corporation which had less than 22,880 hours of payroll in the previous calendar year may elect coverage for any executive officer if that executive officer is also an owner of at least 25 percent of the stock of the corporation.\n(e) A limited liability company which had less than 22,880 hours of payroll in the previous calendar year may elect coverage for any manager if that manager is also an owner of at least 25 percent membership interest in the limited liability company.\n(f) A person, partnership, limited liability company, or corporation hiring an independent contractor, as defined by rules adopted by the commissioner, may elect to provide coverage for that independent contractor. A person, partnership, limited liability company, or corporation may charge the independent contractor a fee for providing the coverage only if the independent contractor (1) elects in writing to be covered, (2) is issued an endorsement setting forth the terms of the coverage, the name of the independent contractors, and the fee and how it is calculated.\n(g) The persons, partnerships, limited liability companies, and corporations described in this subdivision may also elect coverage for an employee who is a spouse, parent, or child, regardless of age, of an owner, partner, manager, or executive officer, who is eligible for coverage under this subdivision. Coverage may be elected for a spouse, parent, or child whether or not coverage is elected for the related owner, partner, manager, or executive director and whether or not the person, partnership, limited liability company, or corporation employs any other person to perform a service for hire. Any person for whom coverage is elected pursuant to this subdivision shall be included within the meaning of the term employee for the purposes of this chapter.\n(h) Notice of election of coverage or of termination of election under this subdivision shall be provided in writing to the insurer. Coverage or termination of coverage is effective the day following receipt of notice by the insurer or at a subsequent date if so indicated in the notice. The insurance policy shall be endorsed to indicate the names of those persons for whom coverage has been elected or terminated under this subdivision. An election of coverage under this subdivision shall continue in effect as long as a policy or renewal policy of the same insurer is in effect.\n(i) Nothing in this subdivision shall be construed to limit the responsibilities of owners, partnerships, limited liability companies, or corporations to provide coverage for their employees, if any, as required under this chapter.\nIf an employee who regularly performs the primary duties of employment within this state receives an injury while outside of this state in the employ of the same employer, the provisions of this chapter shall apply to such injury. If a resident of this state is transferred outside the territorial limits of the United States as an employee of a Minnesota employer, the resident shall be presumed to be temporarily employed outside of this state while so employed.\nIf an employee hired in this state by a Minnesota employer receives an injury while temporarily employed outside of this state, such injury shall be subject to the provisions of this chapter.\nIf an employee who regularly performs the primary duties of employment outside of this state or is hired to perform the primary duties of employment outside of this state receives an injury within this state in the employ of the same employer, such injury shall be covered within the provisions of this chapter if the employee chooses to forgo any workers' compensation claim resulting from the injury that the employee may have a right to pursue in some other state, provided that the special compensation fund is not liable for payment of benefits pursuant to section 176.183 if the employer is not insured against workers' compensation liability pursuant to this chapter and the employee is a nonresident of Minnesota on the date of the personal injury.\n[Repealed, 1974 c 486 s 6]\nExcept as specifically provided by subdivisions 2 and 3, injuries occurring outside of this state are not subject to this chapter.\nNotwithstanding the provisions of subdivision 4, workers' compensation benefits for an employee hired in North Dakota by a North Dakota employer, arising out of that employee's temporary work in Minnesota, shall not be payable under this chapter. North Dakota workers' compensation law provides the exclusive remedy available to the injured worker. For purposes of this subdivision, temporary work means work in Minnesota for a period of time not to exceed 15 consecutive calendar days or a maximum of 240 total hours worked by that employee in a calendar year.\nWhenever an employee is covered by subdivision 2, 3 or 4, the commissioner may enter into agreements with the appropriate agencies of other states for the purpose of resolving conflicts of jurisdiction or disputes concerning workers' compensation coverage. An agreement entered into pursuant to this subdivision may be appealed in the same manner and within the same time as if the appeal were from an order or decision of a compensation judge to the Workers' Compensation Court of Appeals or the district court.",
	"repealed": false
}