{
	"id": "178.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/178.035",
	"title": "178.035 REGISTRATION OF APPRENTICESHIP PROGRAMS.",
	"text": "To apply for the registration of an apprenticeship program, a sponsor shall submit a completed application to the division on a form provided by the commissioner, which shall include standards of apprenticeship that comply with the requirements of Code of Federal Regulations, title 29, part 29, section 29.5, and this chapter.\nThe division shall grant a provisional approval period of one year to an applicant demonstrating that the standards submitted meet the requirements of this chapter. The division may review each program granted provisional approval for quality and for conformity with the requirements of this section and section 178.036 at any time, but not less than biannually, during the provisional approval period. After review:\n(1) a program that conforms with the requirements of this chapter:\n(i) may be made permanent; or\n(ii) may continue to be provisionally approved through the first full training cycle; and\n(2) a program not in operation or not conforming with the requirements of this chapter during the provisional approval period shall be deregistered.\nThe division shall inform the applicant of the results of its review in writing at least 30 days prior to the expiration of the provisional approval period.\nThe division shall review all programs for quality and for conformity with the requirements of this chapter at the end of the first full training cycle. Subsequent review of a registered program must be conducted at least annually. Programs not in operation or not conforming to this chapter at the time of review may be recommended for deregistration.\nTo apply for modification of or change to a registered program, a sponsor shall submit a written request for modification to the division. The division shall approve or disapprove a modification request within 90 days from the date of receipt. If approved, the modification or change must be recorded and acknowledged within 90 days of its approval as an amendment to the registered program. If not approved, the division shall notify the sponsor in writing of the disapproval and the reasons for the disapproval. The division may provide technical assistance to a sponsor seeking to modify or change a registered program. The division may require program modification to ensure standards of apprenticeship that comply with the requirements of Code of Federal Regulations, title 29, part 29, section 29.5, and this chapter.\nWhen an application is submitted under subdivision 1 by an employer or employers' association, and where the standards, collective bargaining agreement, or other instrument provides for participation by a union in any manner in the operation of the substantive matters of the apprenticeship program, and the participation is exercised, a written acknowledgment of the union's agreement or a written statement specifying that the union has no objection to the registration is required. Where no union participation is evidenced and practiced, the employer or employers' association shall simultaneously furnish to the union, if any, which functions as the collective bargaining agent of the employees to be trained, a copy of its application for registration and the apprenticeship program. The commissioner shall provide a reasonable time of not less than 30 days nor more than 60 days for receipt of union comments, if any, before final action on the application for registration is taken. Union comments must be submitted to the division during the time period specified by the commissioner.\nUpon provisional approval of a program, the commissioner shall issue a certificate of registration to the sponsor. Within 45 days after the certificate is mailed or otherwise delivered to the sponsor, the sponsor must submit to the commissioner a copy of at least one executed apprenticeship agreement.\nIt must be the policy of the employer and sponsor that the recruitment, selection, employment, and training of apprentices during their apprenticeship must be without discrimination due to race, color, creed, religion, national origin, sex, gender identity, sexual orientation, marital status, familial status, disability, status with regard to public assistance, or age. The employer and sponsor must take affirmative action to provide equal opportunity in apprenticeship and must operate the apprenticeship program as required under Code of Federal Regulations, title 29, part 30, and under the Minnesota plan for equal opportunity in apprenticeship.",
	"repealed": false
}