{
	"id": "115A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.46",
	"title": "115A.46 REGIONAL AND LOCAL SOLID WASTE MANAGEMENT PLAN; REQUIREMENTS.",
	"text": "(a) Plans shall address the state policies and purposes expressed in section 115A.02 and may not be inconsistent with state law.\n(b) Plans for the location, establishment, operation, maintenance, and postclosure use of facilities and facility sites, for ordinances, and for licensing, permit, and enforcement activities shall be consistent with the rules adopted by the agency pursuant to chapter 116.\n(c) Plans shall address:\n(1) the resolution of conflicting, duplicative, or overlapping local management efforts;\n(2) the establishment of joint powers management programs or waste management districts where appropriate; and\n(3) other matters as the rules of the agency may require consistent with the purposes of sections 115A.42 to 115A.46.\n(d) Political subdivisions preparing plans under sections 115A.42 to 115A.46 shall consult with persons presently providing solid waste collection, processing, and disposal services.\n(e) Plans must be submitted to the commissioner for approval. When a county board is ready to have a final plan approved, the county board shall submit a resolution requesting review and approval by the commissioner. After receiving the resolution, the commissioner shall notify the county within 45 days whether the plan as submitted is complete and, if not complete, the specific items that need to be submitted to make the plan complete. Within 90 days after a complete plan has been submitted, the commissioner shall approve or disapprove the plan. If the plan is disapproved, reasons for the disapproval must be provided.\n(f) After initial approval, each plan must be updated and submitted for approval at least every ten years. The plan must be revised as necessary so that it is not inconsistent with state law.\n(g) Rules that regulate plan content under subdivision 2 must reflect demographic, geographic, regional, and solid waste system differences that exist among the counties.\n(a) The plans shall describe existing collection, processing, and disposal systems, including schedules of rates and charges, financing methods, environmental acceptability, and opportunities for improvements in the systems.\n(b) The plans shall include an estimate of the land disposal capacity in acre-feet which will be needed through the year 2000, on the basis of current and projected waste generation practices. In assessing the need for additional capacity for resource recovery or land disposal, the plans shall take into account the characteristics of waste stream components and shall give priority to waste reduction, separation, and recycling.\n(c) The plans shall require the most feasible and prudent reduction of the need for and practice of land disposal of mixed municipal solid waste.\n(d) The plans shall address at least waste reduction, separation, recycling, and other resource recovery options, and shall include specific and quantifiable objectives, immediately and over specified time periods, for reducing the land disposal of mixed municipal solid waste and for the implementation of feasible and prudent reduction, separation, recycling, and other resource recovery options. These objectives shall be consistent with statewide objectives as identified in statute. The plans shall describe methods for identifying the portions of the waste stream such as leaves, grass, clippings, tree and plant residue, and paper for application and mixing into the soil and use in agricultural practices. The plans shall describe specific functions to be performed and activities to be undertaken to achieve the abatement, reduction, separation, recycling, and other resource recovery objectives and shall describe the estimated cost, proposed manner of financing, and timing of the functions and activities. The plans shall describe proposed mechanisms for complying with the recycling requirements of section 115A.551, and the household hazardous waste management requirements of section 115A.96, subdivision 6.\n(e) The plans shall include a comparison of the costs of the activities to be undertaken, including capital and operating costs, and the effects of the activities on the cost to generators and on persons currently providing solid waste collection, processing, and disposal services. The plans shall include alternatives which could be used to achieve the abatement objectives if the proposed functions and activities are not established.\n(f) The plans shall designate how public education shall be accomplished. The plans shall, to the extent practicable and consistent with the achievement of other public policies and purposes, encourage ownership and operation of solid waste facilities by private industry. For solid waste facilities owned or operated by public agencies or supported primarily by public funds or obligations issued by a public agency, the plans shall include criteria and standards to protect comparable private and public facilities already existing in the area from displacement unless the displacement is required in order to achieve the waste management objectives identified in the plan.\n(g) The plans shall establish a siting procedure and development program to assure the orderly location, development, and financing of new or expanded solid waste facilities and services sufficient for a prospective ten-year period, including estimated costs and implementation schedules, proposed procedures for operation and maintenance, estimated annual costs and gross revenues, and proposals for the use of facilities after they are no longer needed or usable.\n(h) The plans shall describe existing and proposed county and municipal ordinances and license and permit requirements relating to solid waste management and shall describe existing and proposed regulation and enforcement procedures.\n[Repealed, 1984 c 644 s 82]\nA county or a solid waste management district established under sections 115A.62 to 115A.72 may not delegate to another governmental unit or other person any portion of its responsibility for solid waste management unless it establishes a funding mechanism to assure the ability of the entity to which it delegates responsibility to adequately carry out the responsibility delegated.\n(a) After a county plan has been submitted for approval under subdivision 1, a public entity, as defined in section 16C.073, subdivision 1, within the county may not enter into a binding agreement governing a solid waste management activity that is inconsistent with the county plan without the consent of the county.\n(b) After a county plan has been approved under subdivision 1, the plan governs all solid waste management in the county and a public entity, as defined in section 16C.073, subdivision 1, within the county may not develop or implement a solid waste management activity, other than an activity to reduce waste generation or reuse waste materials, that is inconsistent with the county plan that the county is actively implementing without the consent of the county.",
	"repealed": false
}