{
	"id": "127A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.21",
	"title": "127A.21 OFFICE OF THE INSPECTOR GENERAL.",
	"text": "The commissioner must establish within the department an Office of the Inspector General. The inspector general shall report directly to the commissioner. The Office of the Inspector General is charged with protecting the integrity of the department and the state by detecting and preventing fraud, waste, and abuse in department programs. The Office of the Inspector General must conduct independent and objective investigations to promote the integrity of the department's programs and operations. When fraud or other misuse of public funds is detected, the Office of the Inspector General must report it to the appropriate law enforcement entity and collaborate and cooperate with law enforcement to assist in the investigation and any subsequent civil and criminal prosecution.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Abuse\" means actions that may, directly or indirectly, result in unnecessary costs to department programs. Abuse may involve paying for items or services when there is no legal entitlement to that payment.\n(c) \"Department program\" means a program funded by the Department of Education that involves the transfer or disbursement of public funds or other resources to a program participant. \"Department program\" includes state and federal aids or grants received by a school district or charter school or other program participant.\n(d) \"Fraud\" means an intentional or deliberate act to deprive another of property or money or to acquire property or money by deception or other unfair means. Fraud includes intentionally submitting false information to the department for the purpose of obtaining a greater compensation or benefit than that to which the person is legally entitled. Fraud also includes failure to correct errors in the maintenance of records in a timely manner after a request by the department.\n(e) \"Investigation\" means an audit, investigation, proceeding, or inquiry by the Office of the Inspector General related to a program participant in a department program.\n(f) \"Program participant\" means any entity or person, including associated persons, that receives, disburses, or has custody of funds or other resources transferred or disbursed under a department program.\n(g) \"Waste\" means practices that, directly or indirectly, result in unnecessary costs to department programs, such as misusing resources.\n(h) For purposes of this section, neither \"fraud,\" \"waste,\" nor \"abuse\" includes decisions on instruction, curriculum, personnel, or other discretionary policy decisions made by a school district, charter school, cooperative unit as defined by section 123A.24, subdivision 2, or any library, library system, or library district defined in section 134.001.\n(a) The commissioner, or the commissioner's designee, must hire an inspector general to lead the Office of the Inspector General. The inspector general must hire a deputy inspector general and, at the discretion of the inspector general, sufficient assistant inspectors general to carry out the duties of the office. The inspector general, deputy inspector general, and any assistant inspectors general serve in the classified service.\n(b) In a form and manner determined by the inspector general, the Office of the Inspector General must develop a public platform for the public to report instances of potential fraud, waste, or abuse of public funds administered by the department. Nothing in this paragraph shall be construed to give a member of the public standing to sue based on allegations of fraud, waste, or abuse.\n(c) The inspector general shall establish procedures for conducting investigations. Procedures adopted under this subdivision are not subject to chapter 14, including section 14.386.\n(a) For the purpose of an investigation, the inspector general or a designee may administer oaths and affirmations, subpoena witnesses, compel attendance, take evidence, and issue subpoenas duces tecum to require the production of books, papers, correspondence, memoranda, agreements, financial records, or other documents or records relevant to the investigation.\n(b) A subpoena issued pursuant to this subdivision must state that the subpoena recipient may not disclose the fact that the subpoena was issued or the fact that the requested records have been given to the inspector general, or their staff, except:\n(1) in so far as the disclosure is necessary to find and disclose the records;\n(2) pursuant to court order; or\n(3) to legal counsel for the purposes of responding to the subpoena.\n(c) The fees for service of a subpoena must be paid in the same manner as prescribed by law for a service of process issued by a district court.\n(d) The subpoena issued under this subdivision shall be enforceable through the district court in the district where the subpoena is issued.\n(a) For purposes of an investigation, and regardless of the data's classification under chapter 13, the Office of the Inspector General shall have access to all relevant books, accounts, documents, data, and property related to department programs that are maintained by a program participant, charter school, or government entity as defined by section 13.02.\n(b) Notwithstanding paragraph (a), the Office of the Inspector General must issue a subpoena under subdivision 3 in order to access routing and account numbers to which Department of Education funds have been disbursed.\n(c) Records requested by the Office of the Inspector General under this subdivision shall be provided in a format, place, and time frame reasonably requested by the Office of the Inspector General.\n(d) The department may enter into specific agreements with other state agencies related to records requests by the Office of the Inspector General.\n(a) This subdivision does not authorize any sanction that reduces, pauses, or otherwise interrupts state or federal aid to a school district, charter school, cooperative unit as defined by section 123A.24, subdivision 2, or any library, library system, or library district defined in section 134.001.\n(b) The inspector general may recommend that the commissioner impose appropriate temporary sanctions, including withholding of payments under the department program, on a program participant pending an investigation by the Office of the Inspector General if:\n(1) during the course of an investigation, the Office of the Inspector General finds credible indicia of fraud, waste, or abuse by the program participant;\n(2) there has been a criminal, civil, or administrative adjudication of fraud, waste, or abuse against the program participant in Minnesota or in another state or jurisdiction;\n(3) the program participant was receiving funds under any contract or registered in any program administered by another Minnesota state agency, a government agency in another state, or a federal agency, and was excluded from that contract or program for reasons credibly indicating fraud, waste, or abuse by the program participant; or\n(4) the program participant has a pattern of noncompliance with an investigation.\n(c) If an investigation finds, by a preponderance of the evidence, fraud, waste, or abuse by a program participant, the inspector general may, after reviewing all facts and evidence and when acting judiciously on a case-by-case basis, recommend that the commissioner impose appropriate sanctions on the program participant.\n(d) Unless prohibited by law, the commissioner has the authority to implement recommendations by the inspector general, including imposing appropriate sanctions, temporarily or otherwise, on a program participant. Sanctions may include ending program participation, stopping disbursement of funds or resources, monetary recovery, and termination of department contracts with the participant for any current or future department program or contract. A sanction may be imposed for up to the longest period permitted by state or federal law. Sanctions authorized under this subdivision are in addition to other remedies and penalties available under law.\n(e) If the commissioner imposes sanctions on a program participant under this subdivision, the commissioner must notify the participant in writing within seven business days of imposing the sanction, unless requested in writing by a law enforcement agency to temporarily delay issuing the notice to prevent disruption of an ongoing law enforcement agency investigation. A notice of sanction must state:\n(1) the sanction being imposed;\n(2) the general allegations that form the basis for the sanction;\n(3) the duration of the sanction;\n(4) the department programs to which the sanction applies; and\n(5) how the program participant may appeal the sanction pursuant to paragraph (e).\n(f) A program participant sanctioned under this subdivision may, within 30 days after the date the notice of sanction was mailed to the participant, appeal the determination by requesting in writing that the commissioner initiate a contested case proceeding under chapter 14. The scope of any contested case hearing is limited to the sanction imposed under this subdivision. An appeal request must specify with particularity each disputed item, the reason for the dispute, and must include the name and contact information of the person or entity that may be contacted regarding the appeal.\n(g) The commissioner shall lift sanctions imposed under this subdivision if the Office of the Inspector General determines there is insufficient evidence of fraud, waste, or abuse by the program participant. The commissioner must notify the participant in writing within seven business days of lifting the sanction.\n(a) It is not a violation of rights conferred by chapter 13 or any other statute related to the confidentiality of government data for a government entity as defined in section 13.02 to provide data or information under this section.\n(b) The inspector general is subject to the Government Data Practices Act, chapter 13, and shall protect from unlawful disclosure data classified as not public. Data collected, created, received, or maintained by the inspector general relating to an audit, investigation, proceeding, or inquiry are subject to section 13.39.\n(a) An employee or other individual who discloses information to the Office of the Inspector General about fraud, waste, or abuse in department programs is protected under section 181.932, governing disclosure of information by employees.\n(b) No state employee may interfere with or obstruct an investigation authorized by this section.",
	"repealed": false
}