{
	"id": "430.102",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.102",
	"title": "430.102 PEDESTRIAN MALL ANNUAL COST, IMPROVEMENT ASSESSMENTS.",
	"text": "(a) When the plan is submitted and then annually on or before June 15, the city comptroller and city engineer shall, with the assistance of the advisory board, report to the city council: (1) an estimate of the cost of operating and maintaining and annual improvement costs to each pedestrian mall improvement district in the city for the city's next fiscal year to be incurred under the plan then in effect; and (2) an estimate of changes in the amounts of those costs that would result from any change in the plan recommended to or under consideration by the city council.\n(b) The estimate must be reasonably itemized and include a summary of the categories of cost properly chargeable as follows:\n(1) the amount to be charged against the general funds of the city, which the amount the city would pay from its general funds for street maintenance and operations on a street of similar size and location but not improved as a pedestrian mall;\n(2) the amount to be charged against benefited properties in the district in proportion to benefits, which is the total of costs of annual improvements to be made in the district during the ensuing year, not exceeding the total benefits to the assessable tracts and parcels of land in the district received from the annual improvements; and\n(3) the amount if any, to be specially taxed against properties in the district in proportion to the cash valuation of those properties, which is the net amount of estimated costs remaining after deducting the amount to be charged to the general funds of the city under clause (1), the amount to be specially assessed under clause (2), and rentals to be received for use of the mall by vendors.\nThe council shall receive and consider the estimate required in subdivision 1 and the items of cost after notice and hearing before it or its appropriate committee as it considers necessary or expedient, and shall approve the estimate, with necessary amendments. The amounts of each item of cost estimated are then appropriated to operate, maintain, and improve the pedestrian mall during the next fiscal year. The amount of the special tax to be charged under subdivision 1, clause (3), must not, however, exceed 0.12089 percent of estimated market value of taxable property in the district. The council shall make any necessary adjustment in costs of operating and maintaining the district to keep the amount of the tax within this limitation.\nWhen the council has acted on the estimate of costs, the city engineer, with the assistance of the city assessor, shall prepare an assessment roll. The roll must list separately the amounts to be specially assessed against benefited and assessable property in the district in proportion to the benefits, descriptions of the property, and the names of the owners of the property to the extent they are available to the engineer. The assessment roll must be filed in the office of the city clerk and be available there for inspection.\nThe city council shall meet to consider objections to the amounts of special assessments at least ten days after a notice of hearing has been mailed to the named owners of the tracts, parcels, and lots of property proposed to be assessed. The notice must give the time, place, and purpose of the meeting, but may refer to the assessment roll for further particulars. When the city council has approved the amounts of the special assessments in the assessment roll or has changed them, the city clerk shall certify a copy of the assessment roll, with any changes, to the county auditor to be extended on the tax lists of the county. The special assessments must be collected with and in the same manner as other taxes on property for the current year.\nWithin 20 days after the adoption of the assessment, an aggrieved person may appeal to the district court as provided in section 430.03 except that no commissioners will be appointed to consider the amount of benefits. If the court finds that the assessment is not arbitrary, unreasonable, or made under a demonstrable mistake of fact or erroneous theory of law, it shall confirm the proceedings. If the court finds that the assessment is valid but for the inclusion of one or more items of cost, it shall reduce the assessment by the amount erroneously included and confirm the assessment as reduced. Otherwise the court shall remand the matter to the city council for reconsideration and reassessment of the benefits after notice and hearing like those for the original assessments under this subdivision. Objections to the assessment are waived unless appealed under this paragraph.\nFor the purposes of this chapter, with respect to pedestrian malls, \"annual improvements\" means any reconstruction, replacement, or repair of trees and plantings, furniture, roadway fixtures, sidewalks, shelters, and other facilities of a pedestrian mall, snow removal, sweeping, furnishing overhead or underground heating for enjoyment of pedestrians, and any other local improvement benefiting properties within the district. For the purposes of this chapter, with respect to annual improvements to and operation and maintenance of pedestrian malls, \"costs\" means costs of annual improvements, fees of consultants employed by the city council to assist in the planning of annual improvements, premiums on public liability insurance insuring the city and users of the pedestrian mall and on property damage insurance for pedestrian mall facilities, reasonable and necessary costs to the city for the time of city officials, the advisory board, and employees spent in connection with annual improvements to and operating and maintaining a pedestrian mall and levying and collecting special assessments and special taxes for the mall, publication costs, and other costs incurred or to be incurred in connection with annual improvements to and operation and maintenance of pedestrian malls.\nMoney appropriated and collected for annual improvement costs and costs of operating and maintaining a pedestrian mall must be credited to a special account. The council may incur costs for annual improvements to or for operating and maintaining a pedestrian mall during any fiscal year, though not provided for in an approved estimate for that fiscal year, if the council considers it necessary to provide for annual improvements or operation or maintenance before the succeeding fiscal year. In that case, the costs incurred must be included in the next estimate of costs to be approved. Any balances to the credit of the account established for a pedestrian mall and remaining unspent at the end of a fiscal year must be charged against the proper category of the next estimate of costs to be approved.",
	"repealed": false
}