{
	"id": "410.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/410.12",
	"title": "410.12 AMENDMENTS.",
	"text": "The charter commission may propose amendments to such charter and shall do so upon the petition of voters equal in number to five percent of the total votes cast at the last previous state general election in the city. Proposed charter amendments must be submitted at least 17 weeks before the general election. Only registered voters are eligible to sign the petition. All petitions circulated with respect to a charter amendment shall be uniform in character and shall have attached thereto the text of the proposed amendment in full; except that in the case of a proposed amendment containing more than 1,000 words, a true and correct copy of the same may be filed with the city clerk, and the petition shall then contain a summary of not less than 50 nor more than 300 words setting forth in substance the nature of the proposed amendment. Such summary shall contain a statement of the objects and purposes of the amendment proposed and an outline of any proposed new scheme or frame work of government and shall be sufficient to inform the signers of the petition as to what change in government is sought to be accomplished by the amendment. The summary, together with a copy of the proposed amendment, shall first be submitted to the charter commission for its approval as to form and substance. The commission shall within ten days after such submission to it, return the same to the proposers of the amendment with such modifications in statement as it may deem necessary in order that the summary may fairly comply with the requirements above set forth.\nA home rule charter may be amended only by following one of the alternative methods of amendment provided in subdivisions 1 to 7.\nThe signatures to such petition need not all be appended to one paper, but to each separate petition there shall be attached an affidavit of the circulator thereof as provided by this section. A petition must contain each petitioner's signature in ink or indelible pencil and must indicate after the signature the place of residence by street and number, or other description sufficient to identify the place. There shall appear on each petition the names and addresses of five electors of the city, and on each paper the names and addresses of the same five electors, who, as a committee of the petitioners, shall be regarded as responsible for the circulation and filing of the petition. The affidavit attached to each petition shall be as follows:\n.............. ................. being duly sworn, deposes and says that the affiant, and the affiant only, personally circulated the foregoing paper, that all the signatures appended thereto were made in the affiant's presence, and that the affiant believes them to be the genuine signatures of the persons whose names they purport to be.\nSigned ............................\n(Signature of Circulator)\nSubscribed and sworn to before me\nthis ....... day of ...... .......\nNotary Public (or other officer)\nauthorized to administer oaths\nThe foregoing affidavit shall be strictly construed and any affiant convicted of swearing falsely as regards any particular thereof shall be punishable in accordance with existing law.\nAll petition papers for a proposed amendment shall be assembled and filed with the charter commission as one instrument. Within ten days after such petition is transmitted to the city council, the city clerk shall determine whether each paper of the petition is properly attested and whether the petition is signed by a sufficient number of voters. The city clerk shall declare any petition paper entirely invalid which is not attested by the circulator thereof as required in this section. Upon completing an examination of the petition, the city clerk shall certify the result of the examination to the council. If the city clerk shall certify that the petition is insufficient the city clerk shall set forth in a certificate the particulars in which it is defective and shall at once notify the committee of the petitioners of the findings. A petition may be amended at any time within ten days after the making of a certificate of insufficiency by the city clerk, by filing a supplementary petition upon additional papers signed and filed as provided in case of an original petition. The city clerk shall within five days after such amendment is filed, make examination of the amended petition, and if the certificate shall show the petition still to be insufficient, the city clerk shall file it in the city clerk's office and notify the committee of the petitioners of the findings and no further action shall be had on such insufficient petition. The finding of the insufficiency of a petition shall not prejudice the filing of a new petition for the same purpose.\nAmendments shall be submitted to the qualified voters at a general or special election and published as in the case of the original charter. The form of the ballot shall be fixed by the governing body. The statement of the question on the ballot shall be sufficient to identify the amendment clearly and to distinguish the question from every other question on the ballot at the same time. If 51 percent of the votes cast on any amendment are in favor of its adoption, copies of the amendment and certificates shall be filed, as in the case of the original charter and the amendment shall take effect in 30 days from the date of the election or at such other time as is fixed in the amendment.\nThe council of any city having a home rule charter may propose charter amendments to the voters by ordinance. Any ordinance proposing such an amendment shall be submitted to the charter commission. Within 60 days thereafter, the charter commission shall review the proposed amendment but before the expiration of such period the commission may extend the time for review for an additional 90 days by filing with the city clerk its resolution determining that an additional time for review is needed. After reviewing the proposed amendment, the charter commission shall approve or reject the proposed amendment or suggest a substitute amendment. The commission shall promptly notify the council of the action taken. On notification of the charter commission's action, the council may submit to the people, in the same manner as provided in subdivision 4, the amendment originally proposed by it or the substitute amendment proposed by the charter commission. The amendment shall become effective only when approved by the voters as provided in subdivision 4. If so approved it shall be filed in the same manner as other amendments. Nothing in this subdivision precludes the charter commission from proposing charter amendments in the manner provided by subdivision 1.\nThe council of a city of the fourth class having a home rule charter may propose charter amendments by ordinance without submission to the charter commission. Such ordinance, if enacted, shall be adopted by at least a four-fifths vote of all its members after a public hearing upon two weeks' published notice containing the text of the proposed amendment and shall be approved by the mayor and published as in the case of other ordinances. The council shall submit the proposed amendment to the people in the manner provided in subdivision 4, but not sooner than three months after the passage of the ordinance. The amendment becomes effective only when approved by the voters as provided in subdivision 4. If so approved, it shall be filed in the same manner as other amendments.\nUpon recommendation of the charter commission the city council may enact a charter amendment by ordinance. Within one month of receiving a recommendation to amend the charter by ordinance, the city must publish notice of a public hearing on the proposal and the notice must contain the text of the proposed amendment. The city council must hold the public hearing on the proposed charter amendment at least two weeks but not more than one month after the notice is published. Within one month of the public hearing, the city council must vote on the proposed charter amendment ordinance. The ordinance is enacted if it receives an affirmative vote of all members of the city council and is approved by the mayor and published as in the case of other ordinances. An ordinance amending a city charter shall not become effective until 90 days after passage and publication or at such later date as is fixed in the ordinance. Within 60 days after passage and publication of such an ordinance, a petition requesting a referendum on the ordinance may be filed with the city clerk. The petition must be signed by registered voters equal in number to at least five percent of the registered voters in the city or 2,000, whichever is less. If the requisite petition is filed within the prescribed period, the ordinance shall not become effective until it is approved by the voters as in the case of charter amendments submitted by the charter commission, the council, or by petition of the voters, except that the council may submit the ordinance at any general or special election held at least 60 days after submission of the petition, or it may reconsider its action in adopting the ordinance. As far as practicable the requirements of subdivisions 1 to 3 apply to petitions submitted under this section, to an ordinance amending a charter, and to the filing of such ordinance when approved by the voters.",
	"repealed": false
}