{
	"id": "176.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.101",
	"title": "176.101 COMPENSATION SCHEDULE.",
	"text": "(a) For injury producing temporary total disability, the compensation is 66-2/3 percent of the weekly wage at the time of injury.\n(b)(1) Commencing on October 1, 2024, and each October 1 thereafter, the maximum weekly compensation payable is 108 percent of the statewide average weekly wage for the period ending December 31 of the preceding year.\n(2) The Workers' Compensation Advisory Council may consider adjustment increases and make recommendations to the legislature.\n(c) The minimum weekly compensation payable is $130 per week or the injured employee's actual weekly wage, whichever is less. Beginning on October 1, 2021, and each October 1 thereafter, the minimum weekly compensation shall be 20 percent of the maximum weekly compensation payable or the employee's actual weekly wage, whichever is less.\n(d) Temporary total compensation shall be paid during the period of disability subject to the cessation and recommencement conditions in paragraphs (e) to (l).\n(e) Temporary total disability compensation shall cease when the employee returns to work. Except as otherwise provided in section 176.102, subdivision 11, temporary total disability compensation may only be recommenced following cessation under this paragraph, paragraph (h), or paragraph (j) prior to payment of 130 weeks of temporary total disability compensation and only as follows:\n(1) if temporary total disability compensation ceased because the employee returned to work, it may be recommenced if the employee is laid off or terminated for reasons other than misconduct if the layoff or termination occurs prior to 90 days after the employee has reached maximum medical improvement. Recommenced temporary total disability compensation under this clause ceases when any of the cessation events in paragraphs (e) to (l) occurs; or\n(2) if temporary total disability compensation ceased because the employee returned to work or ceased under paragraph (h) or (j), it may be recommenced if the employee is medically unable to continue at a job due to the injury. Where the employee is medically unable to continue working due to the injury, temporary total disability compensation may continue until any of the cessation events in paragraphs (e) to (l) occurs following recommencement. If an employee who has not yet received temporary total disability compensation becomes medically unable to continue working due to the injury after reaching maximum medical improvement, temporary total disability compensation shall commence and shall continue until any of the events in paragraphs (e) to (l) occurs following commencement. For purposes of commencement or recommencement under this clause only, a new period of maximum medical improvement under paragraph (j) begins when the employee becomes medically unable to continue working due to the injury. Temporary total disability compensation may not be recommenced under this clause and a new period of maximum medical improvement does not begin if the employee is not actively employed when the employee becomes medically unable to work. All periods of initial and recommenced temporary total disability compensation are included in the 130-week limitation specified in paragraph (k).\n(f) Temporary total disability compensation shall cease if the employee withdraws from the labor market. Temporary total disability compensation may be recommenced following cessation under this paragraph only if the employee reenters the labor market prior to 90 days after the employee reached maximum medical improvement and prior to payment of 130 weeks of temporary total disability compensation. Once recommenced, temporary total disability ceases when any of the cessation events in paragraphs (e) to (l) occurs.\n(g) Temporary total disability compensation shall cease if the total disability ends and the employee fails to diligently search for appropriate work within the employee's physical restrictions. Temporary total disability compensation may be recommenced following cessation under this paragraph only if the employee begins diligently searching for appropriate work within the employee's physical restrictions prior to 90 days after maximum medical improvement and prior to payment of 130 weeks of temporary total disability compensation. Once recommenced, temporary total disability compensation ceases when any of the cessation events in paragraphs (e) to (l) occurs.\n(h) Temporary total disability compensation shall cease if the employee has been released to work without any physical restrictions caused by the work injury.\n(i) Temporary total disability compensation shall cease if the employee refuses an offer of work that is consistent with a plan of rehabilitation filed with the commissioner which meets the requirements of section 176.102, subdivision 4, or, if no plan has been filed, the employee refuses an offer of gainful employment that the employee can do in the employee's physical condition. Once temporary total disability compensation has ceased under this paragraph, it may not be recommenced.\n(j) Temporary total disability compensation shall cease 90 days after the employee has reached maximum medical improvement, except as provided in section 176.102, subdivision 11, paragraph (b). For purposes of this subdivision, the 90-day period after maximum medical improvement commences on the earlier of: (1) the date that the employee receives a written medical report indicating that the employee has reached maximum medical improvement; or (2) the date that the employer or insurer serves the report on the employee and the employee's attorney, if any. Once temporary total disability compensation has ceased under this paragraph, it may not be recommenced except if the employee returns to work and is subsequently medically unable to continue working as provided in paragraph (e), clause (2).\n(k) Temporary total disability compensation shall cease entirely when 130 weeks of temporary total disability compensation have been paid, except as provided in section 176.102, subdivision 11, paragraph (b). Notwithstanding anything in this section to the contrary, initial and recommenced temporary total disability compensation combined shall not be paid for more than 130 weeks, regardless of the number of weeks that have elapsed since the injury, except that if the employee is in a retraining plan approved under section 176.102, subdivision 11, the 130-week limitation shall not apply during the retraining, but is subject to the limitation before the plan begins and after the plan ends.\n(l) Paragraphs (e) to (k) do not limit other grounds under law to suspend or discontinue temporary total disability compensation provided under this chapter.\n(m) Once an employee has been paid 52 weeks of temporary total compensation, the employer or insurer must notify the employee in writing of the 130-week limitation on payment of temporary total compensation. A copy of this notice must also be filed with the department.\n(a) In all cases of temporary partial disability the compensation shall be 66-2/3 percent of the difference between the weekly wage of the employee at the time of injury and the wage the employee is able to earn in the employee's partially disabled condition. This compensation shall be paid during the period of disability except as provided in this section, payment to be made at the intervals when the wage was payable, as nearly as may be, and subject to the maximum rate for temporary total compensation.\n(b) Temporary partial compensation may be paid only while the employee is employed, earning less than the employee's weekly wage at the time of the injury, and the reduced wage the employee is able to earn in the employee's partially disabled condition is due to the injury. Except as provided in section 176.102, subdivision 11, paragraphs (b) and (c), temporary partial compensation may not be paid for more than 275 weeks, or after 450 weeks after the date of injury, whichever occurs first.\n(c) Temporary partial compensation must be reduced to the extent that the wage the employee is able to earn in the employee's partially disabled condition plus the temporary partial disability payment otherwise payable under this subdivision exceeds 500 percent of the statewide average weekly wage.\n(a) Compensation for permanent partial disability is as provided in this subdivision. Permanent partial disability must be rated as a percentage of the whole body in accordance with rules adopted by the commissioner under section 176.105. During the 2026 regular legislative session, and every even-year legislative session thereafter, the Workers' Compensation Advisory Council must consider whether the permanent partial disability schedule in paragraph (b) represents adequate compensation for permanent impairment.\n(b) The percentage determined pursuant to the rules adopted under section 176.105 must be multiplied by the corresponding amount in the following table:\nAn employee may not receive compensation for more than a 100 percent disability of the whole body, even if the employee sustains disability to two or more body parts.\n(c) Permanent partial disability is payable upon cessation of temporary total disability under subdivision 1. If the employee requests payment in a lump sum, then the compensation must be paid within 30 days. This lump-sum payment may be discounted to the present value calculated up to a maximum five percent basis. If the employee does not choose to receive the compensation in a lump sum, then the compensation is payable in installments at the same intervals and in the same amount as the employee's temporary total disability rate on the date of injury. Permanent partial disability is not payable while temporary total compensation is being paid.\n[Repealed, 1983 c 290 s 173]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1995 c 231 art 1 s 36]\n[Repealed, 1987 c 332 s 117]\nFor permanent total disability, as defined in subdivision 5, the compensation shall be 66-2/3 percent of the daily wage at the time of the injury, subject to a maximum weekly compensation equal to the maximum weekly compensation for a temporary total disability and a minimum weekly compensation equal to 65 percent of the statewide average weekly wage. This compensation shall be paid during the permanent total disability of the injured employee but after a total of $25,000 of weekly compensation has been paid, the amount of the weekly compensation benefits being paid by the employer shall be reduced by the amount of any disability benefits being paid by any government disability benefit program if the disability benefits are occasioned by the same injury or injuries which give rise to payments under this subdivision. This reduction shall also apply to any old age and survivor insurance benefits. Payments shall be made at the intervals when the wage was payable, as nearly as may be. In case an employee who is permanently and totally disabled becomes an inmate of a public institution, no compensation shall be payable during the period of confinement in the institution, unless there is wholly dependent on the employee for support some person named in section 176.111, subdivision 1, 2 or 3, in which case the compensation provided for in section 176.111, during the period of confinement, shall be paid for the benefit of the dependent person during dependency. The dependency of this person shall be determined as though the employee were deceased. Permanent total disability shall cease at age 72, except that if an employee is injured after age 67, permanent total disability benefits shall cease after five years of those benefits have been paid.\n(a) If a personal injury results in a disability which is attributable in part to a preexisting disability that arises from a congenital condition or is the result of a traumatic injury or incident, whether or not compensable under this chapter, the compensation payable for the permanent partial disability pursuant to this section shall be reduced by the proportion of the disability which is attributable only to the preexisting disability. An apportionment of a permanent partial disability under this subdivision shall be made only if the preexisting disability is clearly evidenced in a medical report or record made prior to the current personal injury. Evidence of a copy of the medical report or record upon which apportionment is based shall be made available to the employee by the employer at the time compensation for the permanent partial disability is begun.\n(b) The compensable portion of the permanent partial disability under this section shall be paid at the rate at which the entire disability would be compensated but for the apportionment.\nFor purposes of subdivision 4, \"permanent total disability\" means only:\n(1) the total and permanent loss of the sight of both eyes, the loss of both arms at the shoulder, the loss of both legs so close to the hips that no effective artificial members can be used, complete and permanent paralysis, total and permanent loss of mental faculties; or\n(2) any other injury which totally and permanently incapacitates the employee from working at an occupation which brings the employee an income, provided that the employee must also meet the criteria of one of the following items:\n(i) the employee has at least a 17 percent permanent partial disability rating of the whole body;\n(ii) the employee has a permanent partial disability rating of the whole body of at least 15 percent and the employee is at least 50 years old at the time of injury; or\n(iii) the employee has a permanent partial disability rating of the whole body of at least 13 percent and the employee is at least 55 years old at the time of the injury, and has not completed grade 12 or obtained a commissioner of education-selected high school equivalency certification.\nFor purposes of this clause, \"totally and permanently incapacitated\" means that the employee's physical disability in combination with any one of item (i), (ii), or (iii) causes the employee to be unable to secure anything more than sporadic employment resulting in an insubstantial income. Other factors not specified in item (i), (ii), or (iii), including the employee's age, education, training and experience, may only be considered in determining whether an employee is totally and permanently incapacitated after the employee meets the threshold criteria of item (i), (ii), or (iii). The employee's age, level of physical disability, or education may not be considered to the extent the factor is inconsistent with the disability, age, and education factors specified in item (i), (ii), or (iii).\n(a) If any employee entitled to the benefits of this chapter is an apprentice of any age and sustains a personal injury arising out of and in the course of employment resulting in permanent total or a compensable permanent partial disability, for the purpose of computing the compensation to which the employee is entitled for the injury, the compensation rate for temporary total, temporary partial, or permanent total disability shall be the maximum rate for temporary total disability under subdivision 1.\n(b) If any employee entitled to the benefits of this chapter is a minor and sustains a personal injury arising out of and in the course of employment resulting in permanent total disability, for the purpose of computing the compensation to which the employee is entitled for the injury, the compensation rate for a permanent total disability shall be the maximum rate for temporary total disability under subdivision 1.\n[Repealed, Ex1979 c 3 s 70]\nTemporary total disability payments shall cease at retirement. \"Retirement\" means that a preponderance of the evidence supports a conclusion that an employee has retired. The subjective statement of an employee that the employee is not retired is not sufficient in itself to rebut objective evidence of retirement but may be considered along with other evidence.\nFor injuries occurring after January 1, 1984, an employee who receives Social Security old age and survivors insurance retirement benefits under the Social Security Act, Public Law 98-21, as amended, is presumed retired from the labor market. For injuries occurring after October 1, 2000, an employee who receives any other service-based government retirement pension is presumed retired from the labor market. The term \"service-based government retirement pension\" does not include disability-based government pensions. These presumptions are rebuttable by a preponderance of the evidence.",
	"repealed": false
}