{
	"id": "256B.0575",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0575",
	"title": "256B.0575 AVAILABILITY OF INCOME FOR INSTITUTIONALIZED PERSONS.",
	"text": "When an institutionalized person is determined eligible for medical assistance, the income that exceeds the deductions in paragraphs (a) and (b) must be applied to the cost of institutional care.\n(a) The following amounts must be deducted from the institutionalized person's income in the following order:\n(1) the personal needs allowance under section 256B.35 or, for a veteran who does not have a spouse or child, or a surviving spouse of a veteran having no child, the amount of an improved pension received from the veteran's administration, whichever amount is greater;\n(2) the personal allowance for disabled individuals under section 256B.36;\n(3) if the institutionalized person has a legally appointed guardian or conservator, five percent of the recipient's gross monthly income up to $100 as reimbursement for guardianship or conservatorship services;\n(4) a monthly income allowance determined under section 256B.058, subdivision 2, but only to the extent income of the institutionalized spouse is made available to the community spouse;\n(5) a monthly allowance for children under age 18 which, together with the net income of the children, would provide income equal to the medical assistance standard for families and children according to section 256B.056, subdivision 4, for a family size that includes only the minor children. This deduction applies only if the children do not live with the community spouse and only to the extent that the deduction is not included in the personal needs allowance under section 256B.35, subdivision 1, as child support garnished under a court order;\n(6) a monthly family allowance for other family members, equal to one-third of the difference between 122 percent of the federal poverty guidelines and the monthly income for that family member;\n(7) reparations payments made by the Federal Republic of Germany and reparations payments made by the Netherlands for victims of Nazi persecution between 1940 and 1945;\n(8) all other exclusions from income for institutionalized persons as mandated by federal law; and\n(9) amounts for reasonable expenses, as specified in subdivision 2, incurred for necessary medical or remedial care for the institutionalized person that are recognized under state law, not medical assistance covered expenses, and not subject to payment by a third party.\nFor purposes of clause (6), \"other family member\" means a person who resides with the community spouse and who is a minor or dependent child, dependent parent, or dependent sibling of either spouse. \"Dependent\" means a person who could be claimed as a dependent for federal income tax purposes under the Internal Revenue Code.\n(b) Income shall be allocated to an institutionalized person for a period of up to three calendar months, in an amount equal to the medical assistance standard for a family size of one if:\n(1) a physician, advanced practice registered nurse, or physician assistant certifies that the person is expected to reside in the long-term care facility for three calendar months or less;\n(2) if the person has expenses of maintaining a residence in the community; and\n(3) if one of the following circumstances apply:\n(i) the person was not living together with a spouse or a family member as defined in paragraph (a) when the person entered a long-term care facility; or\n(ii) the person and the person's spouse become institutionalized on the same date, in which case the allocation shall be applied to the income of one of the spouses.\nFor purposes of this paragraph, a person is determined to be residing in a licensed nursing home, regional treatment center, or medical institution if the person is expected to remain for a period of one full calendar month or more.\nFor the purposes of subdivision 1, paragraph (a), clause (9), reasonable expenses are limited to expenses that have not been previously used as a deduction from income and were not:\n(1) for long-term care expenses incurred during a period of ineligibility as defined in section 256B.0595, subdivision 2;\n(2) incurred more than three months before the month of application associated with the current period of eligibility;\n(3) for expenses incurred by a recipient that are duplicative of services that are covered under chapter 256B;\n(4) nursing facility expenses incurred without a timely assessment as required under section 256B.0911; or\n(5) for private room fees incurred by an assisted living resident, as defined in section 144G.08, subdivision 59.",
	"repealed": false
}