{
	"id": "270.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.80",
	"title": "270.80 DEFINITIONS.",
	"text": "The following words and phrases when used in sections 270.80 to 270.87, unless the context clearly indicates otherwise, have the meanings ascribed to them in this section.\n\"Railroad company\" means:\n(1) any company which as a common carrier operates a railroad or a line or lines of railway situated within or partly within Minnesota; or\n(2) any company owning or operating, other than as a common carrier, a railway principally used for transportation of taconite concentrates from the plant at which the taconite concentrates are produced in shipping form to a point of consumption or port for shipment beyond the state; or\n(3) any company that produces concentrates from taconite and transports that taconite in the course of the concentrating process and before the concentrating process is completed to a concentrating plant located within the state over a railroad that is not a common carrier and shall not use a common carrier or taconite railroad company as defined in clause (2) for the movement of the concentrate to a point of consumption or port for shipment beyond the state.\n\"Operating property\" means all property owned or used by a railroad company in the performance of railroad transportation services, including without limitation franchises, rights-of-way, bridges, trestles, shops, docks, wharves, buildings and structures.\n\"Nonoperating property\" means and includes all property other than property defined in subdivision 3. Nonoperating property shall include real property which is leased or rented or available for lease or rent to any person which is not a railroad company. Vacant land shall be presumed to be available for lease or rent if it has not been used as operating property for a period of one year preceding the valuation date. Nonoperating property also includes land which is not necessary and integral to the performance of railroad transportation services and which is not used on a regular and continual basis in the performance of these services. Nonoperating property also includes that portion of a general corporation office building and its proportionate share of land which is not used for railway operation or purpose.\n\"Commissioner\" means the commissioner of revenue.",
	"repealed": false
}