{
	"id": "326.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.33",
	"title": "326.33 BOARD OF PRIVATE DETECTIVE AND PROTECTIVE AGENT SERVICES.",
	"text": "There is hereby created a Board of Private Detective and Protective Agent Services, consisting of the superintendent of the Bureau of Criminal Apprehension or an assistant superintendent designated by the superintendent, and the following members appointed by the commissioner of public safety: a licensed protective agent, or qualified representative for a licensed protective agent partnership or corporation, a licensed private detective, or qualified representative for a licensed private detective partnership or corporation, and two public members. Filling of member vacancies shall be the responsibility of the commissioner of public safety. Membership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements shall be as provided in sections 214.07 to 214.09. The provision of staff, unless otherwise provided in sections 326.32 to 326.339; administrative services and office space; the review and processing of complaints; the setting of board fees, unless otherwise provided in sections 326.32 to 326.339; and other provisions relating to board operations shall be as provided in chapter 214.\nThe board shall meet at the times it considers necessary to conduct business ascribed to the board by the provisions of sections 326.32 to 326.339. The board shall designate one of its members to fill the position of board chair, and that person may remain in the capacity of chair for a term of one year. The board has the option of replacing a board member as chair.\n[Repealed, 1987 c 360 s 26]\n[Repealed, 1987 c 360 s 26]\n[Repealed, 1987 c 360 s 26]\nMembers of the Board of Private Detective and Protective Agent Services shall receive, in addition to necessary traveling and lodging expenses, a per diem payment as specified in section 214.09, subdivision 3, per day for each day actually engaged in board activities, provided, however, members of the board who are state employees will be governed by state rules regarding travel expense and per diem payments.",
	"repealed": false
}