{
	"id": "297A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.61",
	"title": "297A.61 DEFINITIONS.",
	"text": "The following words, terms, and phrases when used in this chapter have the meanings given them in this section, unless the context clearly indicates a different meaning.\n(a) \"Person\" includes any individual or group and any combination of individuals, groups, or individuals and groups acting as a unit.\n(b) Person includes a firm, partnership, joint venture, limited liability company, association, cooperative, social club, fraternal organization, municipal or private corporation whether or not organized for profit, estate, trust, business trust, receiver, trustee, syndicate, the United States, and a state and its political subdivisions.\n(c) Person includes, but is not limited to, directors and officers of corporations, governors and managers of a limited liability company, or members of partnerships who, either individually or jointly with others, have the control, supervision, or responsibility of filing returns and making payment of the amount of tax imposed by this chapter.\n(d) Person includes any agent or consignee of any individual or organization listed in this subdivision.\n(a) \"Sale\" and \"purchase\" include, but are not limited to, each of the transactions listed in this subdivision. In applying the provisions of this chapter, the terms \"tangible personal property\" and \"retail sale\" include the taxable services listed in paragraph (g), clause (6), items (i) to (vi) and (viii), and the provision of these taxable services, unless specifically provided otherwise. Services performed by an employee for an employer are not taxable. Services performed by a partnership or association for another partnership or association are not taxable if one of the entities owns or controls more than 80 percent of the voting power of the equity interest in the other entity. Services performed between members of an affiliated group of corporations are not taxable. For purposes of the preceding sentence, \"affiliated group of corporations\" means those entities that would be classified as members of an affiliated group as defined under United States Code, title 26, section 1504, disregarding the exclusions in section 1504(b).\n(b) Sale and purchase include:\n(1) any transfer of title or possession, or both, of tangible personal property, whether absolutely or conditionally, for a consideration in money or by exchange or barter; and\n(2) the leasing of or the granting of a license to use or consume, for a consideration in money or by exchange or barter, tangible personal property, other than a manufactured home used for residential purposes for a continuous period of 30 days or more.\n(c) Sale and purchase include the production, fabrication, printing, or processing of tangible personal property for a consideration for consumers who furnish either directly or indirectly the materials used in the production, fabrication, printing, or processing.\n(d) Sale and purchase include the preparing for a consideration of food. Notwithstanding section 297A.67, subdivision 2, taxable food includes, but is not limited to, the following:\n(1) prepared food sold by the retailer;\n(2) soft drinks;\n(3) candy; and\n(4) dietary supplements.\n(e) A sale and a purchase includes the furnishing for a consideration of electricity, gas, water, or steam for use or consumption within this state.\n(f) A sale and a purchase includes the transfer for a consideration of prewritten computer software whether delivered electronically, by load and leave, or otherwise.\n(g) A sale and a purchase includes the furnishing for a consideration of the following services:\n(1) the privilege of admission to places of amusement, recreational areas, or athletic events, and the making available of amusement devices, tanning facilities, reducing salons, steam baths, health clubs, and spas or athletic facilities;\n(2) lodging and related services by a hotel, rooming house, resort, campground, motel, or trailer camp, including furnishing the guest of the facility with access to telecommunication services, and the granting of any similar license to use real property in a specific facility, other than the renting or leasing of it for a continuous period of 30 days or more under an enforceable written agreement that may not be terminated without prior notice and including accommodations intermediary services provided in connection with other services provided under this clause;\n(3) nonresidential parking services, whether on a contractual, hourly, or other periodic basis, except for parking at a meter;\n(4) the granting of membership in a club, association, or other organization if:\n(i) the club, association, or other organization makes available for the use of its members sports and athletic facilities, without regard to whether a separate charge is assessed for use of the facilities; and\n(ii) use of the sports and athletic facility is not made available to the general public on the same basis as it is made available to members.\nGranting of membership means both onetime initiation fees and periodic membership dues. Sports and athletic facilities include golf courses; tennis, racquetball, handball, and squash courts; basketball and volleyball facilities; running tracks; exercise equipment; swimming pools; and other similar athletic or sports facilities;\n(5) delivery of aggregate materials by a third party, excluding delivery of aggregate material used in road construction; and delivery of concrete block by a third party if the delivery would be subject to the sales tax if provided by the seller of the concrete block. For purposes of this clause, \"road construction\" means construction of:\n(i) public roads;\n(ii) cartways; and\n(iii) private roads in townships located outside of the seven-county metropolitan area up to the point of the emergency response location sign; and\n(6) services as provided in this clause:\n(i) laundry and dry cleaning services including cleaning, pressing, repairing, altering, and storing clothes, linen services and supply, cleaning and blocking hats, and carpet, drapery, upholstery, and industrial cleaning. Laundry and dry cleaning services do not include services provided by coin operated facilities operated by the customer;\n(ii) motor vehicle washing, waxing, and cleaning services, including services provided by coin operated facilities operated by the customer, and rustproofing, undercoating, and towing of motor vehicles;\n(iii) building and residential cleaning, maintenance, and disinfecting services and pest control and exterminating services;\n(iv) detective, security, burglar, fire alarm, and armored car services; but not including services performed within the jurisdiction they serve by off-duty licensed peace officers as defined in section 626.84, subdivision 1, or services provided by a nonprofit organization or any organization at the direction of a county for monitoring and electronic surveillance of persons placed on in-home detention pursuant to court order or under the direction of the Minnesota Department of Corrections;\n(v) pet grooming services;\n(vi) lawn care, fertilizing, mowing, spraying and sprigging services; garden planting and maintenance; tree, bush, and shrub pruning, bracing, spraying, and surgery; indoor plant care; tree, bush, shrub, and stump removal, except when performed as part of a land clearing contract as defined in section 297A.68, subdivision 40; and tree trimming for public utility lines. Services performed under a construction contract for the installation of shrubbery, plants, sod, trees, bushes, and similar items are not taxable;\n(vii) massages, except when provided by a licensed health care facility or professional or upon written referral from a licensed health care facility or professional for treatment of illness, injury, or disease; and\n(viii) the furnishing of lodging, board, and care services for animals in kennels and other similar arrangements, but excluding veterinary and horse boarding services.\n(h) A sale and a purchase includes the furnishing for a consideration of tangible personal property or taxable services by the United States or any of its agencies or instrumentalities, or the state of Minnesota, its agencies, instrumentalities, or political subdivisions.\n(i) A sale and a purchase includes the furnishing for a consideration of telecommunications services, ancillary services associated with telecommunication services, and pay television services. Telecommunication services include, but are not limited to, the following services, as defined in section 297A.669: air-to-ground radiotelephone service, mobile telecommunication service, postpaid calling service, prepaid calling service, prepaid wireless calling service, and private communication services. The services in this paragraph are taxed to the extent allowed under federal law.\n(j) A sale and a purchase includes the furnishing for a consideration of installation if the installation charges would be subject to the sales tax if the installation were provided by the seller of the item being installed.\n(k) A sale and a purchase includes the rental of a vehicle by a motor vehicle dealer to a customer when (1) the vehicle is rented by the customer for a consideration, or (2) the motor vehicle dealer is reimbursed pursuant to a service contract as defined in section 59B.02, subdivision 11.\n(l) A sale and a purchase includes furnishing for a consideration of specified digital products or other digital products or granting the right for a consideration to use specified digital products or other digital products on a temporary or permanent basis and regardless of whether the purchaser is required to make continued payments for such right. Wherever the term \"tangible personal property\" is used in this chapter, other than in subdivisions 10 and 38, the provisions also apply to specified digital products, or other digital products, unless specifically provided otherwise or the context indicates otherwise.\n(m) The sale of the privilege of admission under section 297A.61, subdivision 3, paragraph (g), clause (1), to a place of amusement, recreational area, or athletic event includes all charges included in the privilege of admission's sales price, without deduction for amenities that may be provided, unless the amenities are separately stated and the purchaser of the privilege of admission is entitled to add or decline the amenities, and the amenities are not otherwise taxable.\n(n) A sale and purchase includes the transfer for consideration of a taxable cannabis product as defined in section 295.81, subdivision 1, paragraph (r).\n(a) A \"retail sale\" means:\n(1) any sale, lease, or rental of tangible personal property for any purpose, other than resale, sublease, or subrent of items by the purchaser in the normal course of business as defined in subdivision 21; and\n(2) any sale of a service enumerated in subdivision 3, for any purpose other than resale by the purchaser in the normal course of business as defined in subdivision 21.\n(b) A sale of property used by the owner only by leasing it to others or by holding it in an effort to lease it, and put to no use by the owner other than resale after the lease or effort to lease, is a sale of property for resale.\n(c) A sale of master computer software that is purchased and used to make copies for sale or lease is a sale of property for resale.\n(d) A sale of building materials, supplies, and equipment to owners, contractors, subcontractors, or builders for the erection of buildings or the alteration, repair, or improvement of real property is a retail sale in whatever quantity sold, whether the sale is for purposes of resale in the form of real property or otherwise.\n(e) A sale of carpeting, linoleum, or similar floor covering to a person who provides for installation of the floor covering is a retail sale and not a sale for resale since a sale of floor covering which includes installation is a contract for the improvement of real property.\n(f) A sale of shrubbery, plants, sod, trees, and similar items to a person who provides for installation of the items is a retail sale and not a sale for resale since a sale of shrubbery, plants, sod, trees, and similar items that includes installation is a contract for the improvement of real property.\n(g) A sale of tangible personal property that is awarded as prizes is a retail sale and is not considered a sale of property for resale.\n(h) A sale of tangible personal property utilized or employed in the furnishing or providing of services under subdivision 3, paragraph (g), clause (1), including, but not limited to, property given as promotional items, is a retail sale and is not considered a sale of property for resale.\n(i) A sale of tangible personal property used in conducting lawful gambling under chapter 349 or the State Lottery under chapter 349A, including, but not limited to, property given as promotional items, is a retail sale and is not considered a sale of property for resale.\n(j) a sale of machines, equipment, or devices that are used to furnish, provide, or dispense goods or services, including, but not limited to, coin-operated devices, is a retail sale and is not considered a sale of property for resale.\n(k) In the case of a lease, a retail sale occurs (1) when an obligation to make a lease payment becomes due under the terms of the agreement or the trade practices of the lessor or (2) in the case of a lease of a motor vehicle, as defined in section 297B.01, subdivision 11, but excluding vehicles with a manufacturer's gross vehicle weight rating greater than 10,000 pounds and rentals of vehicles for not more than 28 days, at the time the lease is executed.\n(l) In the case of a conditional sales contract, a retail sale occurs upon the transfer of title or possession of the tangible personal property.\n(m) A sale of a bundled transaction in which one or more of the products included in the bundle is a taxable product is a retail sale, except that if one of the products is a telecommunication service, ancillary service, Internet access, audio or video programming service, a suite license exempt under section 297A.67, subdivision 35, or a right to purchase season tickets to collegiate events exempt under section 297A.67, subdivision 38, and the seller has maintained books and records identifying through reasonable and verifiable standards the portions of the price that are attributable to the distinct and separately identifiable products, then the products are not considered part of a bundled transaction. For purposes of this paragraph:\n(1) the books and records maintained by the seller must be maintained in the regular course of business, and do not include books and records created and maintained by the seller primarily for tax purposes;\n(2) books and records maintained in the regular course of business include, but are not limited to, financial statements, general ledgers, invoicing and billing systems and reports, and reports for regulatory tariffs and other regulatory matters; and\n(3) books and records are maintained primarily for tax purposes when the books and records identify taxable and nontaxable portions of the price, but the seller maintains other books and records that identify different prices attributable to the distinct products included in the same bundled transaction.\n(n) A sale of motor vehicle repair paint and materials by a motor vehicle repair or body shop business is a retail sale and the sales tax is imposed on the gross receipts from the retail sale of the paint and materials. The motor vehicle repair or body shop that purchases motor vehicle repair paint and motor vehicle repair materials for resale must either:\n(1) separately state each item of paint and each item of materials, and the sales price of each, on the invoice to the purchaser; or\n(2) in order to calculate the sales price of the paint and materials, use a method which estimates the amount and monetary value of the paint and materials used in the repair of the motor vehicle by multiplying the number of labor hours by a rate of consideration for the paint and materials used in the repair of the motor vehicle following industry standard practices that fairly calculate the gross receipts from the retail sale of the motor vehicle repair paint and motor vehicle repair materials. An industry standard practice fairly calculates the gross receipts if the sales price of the paint and materials used or consumed in the repair of a motor vehicle equals or exceeds the purchase price paid by the motor vehicle repair or body shop business. Under this clause, the invoice must either separately state the \"paint and materials\" as a single taxable item, or separately state \"paint\" as a taxable item and \"materials\" as a taxable item. This clause does not apply to wholesale transactions at an auto auction facility.\n(o) A sale of specified digital products or other digital products to an end user with or without rights of permanent use and regardless of whether rights of use are conditioned upon payment by the purchaser is a retail sale. When a digital code has been purchased that relates to specified digital products or other digital products, the subsequent receipt of or access to the related specified digital products or other digital products is not a retail sale.\n(p) A payment made to a cooperative electric association or public utility as a contribution in aid of construction is a contract for improvement to real property and is not a retail sale.\n\"Storage\" includes keeping or retaining tangible personal property in Minnesota for any purpose except sale in the regular course of business.\n(a) \"Use\" includes the exercise of a right or power incident to the ownership of any interest in tangible personal property, or services, purchased from a retailer, other than the sale of that property in the regular course of business.\n(b) Use includes the consumption of printed materials in the creation of nontaxable advertising that is distributed, either directly or indirectly, within Minnesota.\n(a) \"Sales price\" means the measure subject to sales tax, and means the total amount of consideration, including cash, credit, personal property, and services, for which personal property or services are sold, leased, or rented, valued in money, whether received in money or otherwise, without any deduction for the following:\n(1) the seller's cost of the property sold;\n(2) the cost of materials used, labor or service cost, interest, losses, all costs of transportation to the seller, all taxes imposed on the seller, and any other expenses of the seller;\n(3) charges by the seller for any services necessary to complete the sale, other than delivery and installation charges;\n(4) delivery charges, except the percentage of the delivery charge allocated to delivery of tax exempt property, when the delivery charge is allocated by using either (i) a percentage based on the total sales price of the taxable property compared to the total sales price of all property in the shipment, or (ii) a percentage based on the total weight of the taxable property compared to the total weight of all property in the shipment; and\n(5) installation charges.\n(b) Sales price does not include:\n(1) discounts, including cash, terms, or coupons, that are not reimbursed by a third party and that are allowed by the seller and taken by a purchaser on a sale;\n(2) interest, financing, and carrying charges from credit extended on the sale of personal property or services, if the amount is separately stated on the invoice, bill of sale, or similar document given to the purchaser; and\n(3) any taxes legally imposed directly on the consumer that are separately stated on the invoice, bill of sale, or similar document given to the purchaser.\n(c) Sales price includes consideration received by the seller from third parties if:\n(1) the seller actually receives consideration from a party other than the purchaser and the consideration is directly related to a price reduction or discount on the sale;\n(2) the seller has an obligation to pass the price reduction or discount through to the purchaser;\n(3) the amount of the consideration attributable to the sale is fixed and determinable by the seller at the time of the sale of the item to the purchaser; and\n(4) one of the following criteria is met:\n(i) the purchaser presents a coupon, certificate, or other documentation to the seller to claim a price reduction or discount when the coupon, certificate, or documentation is authorized, distributed, or granted by a third party with the understanding that the third party will reimburse any seller to whom the coupon, certificate, or documentation is presented;\n(ii) the purchaser identifies himself or herself to the seller as a member of a group or organization entitled to a price reduction or discount. A \"preferred customer\" card that is available to any customer does not constitute membership in such a group; or\n(iii) the price reduction or discount is identified as a third-party price reduction or discount on the invoice received by the purchaser or on a coupon, certificate, or other documentation presented by the purchaser.\n\"Gross receipts\" means the total amount received, in money or by barter or exchange, for all sales at retail as measured by the sales price.\n\"Retailer\" and \"seller\" means any person making sales, leases, or rentals of personal property or services.\n(a) \"Tangible personal property\" means personal property that can be seen, weighed, measured, felt, or touched, or that is in any other manner perceptible to the senses. \"Tangible personal property\" includes, but is not limited to, electricity, water, gas, steam, and prewritten computer software.\n(b) Tangible personal property does not include:\n(1) property which is subject to an ad valorem property tax;\n(2) property described in section 272.02, subdivision 9, clauses (a) to (d);\n(3) property described in section 272.03, subdivision 2, clauses (3) and (5); and\n(4) specified digital products, or other digital products, transferred electronically.\n\"Commissioner\" means the commissioner of revenue of the state of Minnesota.\n(a) \"Farm machinery\" means new or used machinery, equipment, implements, accessories, and contrivances used directly and principally in agricultural production of tangible personal property intended to be sold ultimately at retail including, but not limited to:\n(1) machinery for the preparation, seeding, or cultivation of soil for growing agricultural crops;\n(2) barn cleaners, milking systems, grain dryers, feeding systems including stationary feed bunks, and similar installations, whether or not the equipment is installed by the seller and becomes part of the real property; and\n(3) irrigation equipment sold for exclusively agricultural use, including pumps, pipe fittings, valves, sprinklers, and other equipment necessary to the operation of an irrigation system when sold as part of an irrigation system, whether or not the equipment is installed by the seller and becomes part of the real property.\n(b) Farm machinery does not include:\n(1) repair or replacement parts;\n(2) tools, shop equipment, grain bins, fencing material, communication equipment, and other farm supplies;\n(3) motor vehicles taxed under chapter 297B;\n(4) snowmobiles or snow blowers;\n(5) lawn mowers except those used in the production of sod for sale, or garden-type tractors or garden tillers; or\n(6) machinery, equipment, implements, accessories, and contrivances used directly in the production of horses not raised for slaughter, fur-bearing animals, or research animals.\n(a) \"Aquaculture production equipment\" means new or used machinery, equipment, implements, accessories, and contrivances used directly and principally in aquaculture production.\n(b) Aquaculture production equipment includes augers and blowers, automatic feed systems, manual feeding equipment, shockers, gill nets, trap nets, seines, box traps, round nets and traps, net pens, dip nets, net washers, floating net supports, floating access walkways, net supports and walkways, growing tanks, holding tanks, troughs, raceways, transport tanks, egg taking equipment, egg hatcheries, egg incubators, egg baskets and troughs, egg graders, egg counting equipment, fish counting equipment, fish graders, fish pumps and loaders, fish elevators, air blowers, air compressors, oxygen generators, oxygen regulators, diffusers and injectors, air supply equipment, oxygenation columns, water coolers and heaters, heat exchangers, water filter systems, water purification systems, waste collection equipment, feed mills, portable scales, feed grinders, feed mixers, feed carts and trucks, power feed wagons, fertilizer spreaders, fertilizer tanks, forage collection equipment, land levelers, loaders, post hole diggers, disc, harrow, plow, and water diversion devices.\n(c) Aquaculture production equipment does not include repair or replacement parts for aquaculture production equipment.\n[Repealed, 2003 c 127 art 1 s 34]\n(a) \"Lease or rental\" means any transfer of possession or control of tangible personal property for a fixed or indeterminate term for consideration. A lease or rental may include future options to purchase or extend.\n(b) Lease or rental does not include:\n(1) a transfer of possession or control of property under a security agreement or deferred payment plan that requires the transfer of title upon completion of the required payments;\n(2) a transfer of possession or control of property under an agreement that requires the transfer of title upon completion of required payments and payment of an option price does not exceed the greater of $100 or one percent of the total required payments; or\n(3) providing tangible personal property along with an operator for a fixed or indeterminate period of time. A condition of this exclusion is that the operator is necessary for the equipment to perform as designed. For the purpose of this subdivision, an operator must do more than maintain, inspect, or set up the tangible personal property.\n(c) Lease or rental does include agreements covering motor vehicles and trailers where the amount of consideration may be increased or decreased by reference to the amount realized upon sale or disposition of the property as defined in United States Code, title 26, section 7701(h)(l).\n(d) This definition must be used for sales and use tax purposes regardless if a transaction is characterized as a lease or rental under generally accepted accounting principles, the Internal Revenue Code, chapter 336, or other provisions of federal, state, or local law.\n[Repealed, 2003 c 127 art 1 s 34]\n[Repealed, 1Sp2001 c 5 art 12 s 95]\n\"Computer\" means an electronic device that accepts information in digital or similar form and manipulates it for a result based on a sequence of instructions.\n\"Electronic\" means relating to technology having electrical, digital, magnetic, wireless, optical, electromagnetic, or similar capabilities.\n\"Computer software\" means a set of coded instructions designed to cause a computer or automatic data processing equipment to perform a task.\n\"Prewritten computer software\" means computer software, including prewritten upgrades, that is not designed and developed by the author or other creator to the specifications of a specific purchaser. The combining of two or more \"prewritten computer software\" programs or prewritten portions of the programs does not cause the combination to be other than \"prewritten computer software.\" \"Prewritten computer software\" includes software designed and developed by the author or other creator to the specifications of a specific purchaser when it is sold to a person other than the specific purchaser. If a person modifies or enhances computer software of which the person is not the author or creator, the person is deemed to be the author or creator only of such person's modifications or enhancements. \"Prewritten computer software\" or a prewritten portion of it that is modified or enhanced to any degree, if the modification or enhancement is designed and developed to the specifications of a specific purchaser, remains \"prewritten computer software\"; provided, however, that if there is a reasonable, separately stated charge or an invoice or other statement of the price given to the purchaser for such modification or enhancement, the modification or enhancement does not constitute \"prewritten computer software.\"\n\"Delivered electronically\" means delivered to the purchaser by means other than tangible storage media.\n\"Load and leave\" means delivered to the purchaser by use of a tangible storage media where the tangible storage media is not physically transferred to the purchaser.\n\"Person with a disability\" means an individual who has a permanent and total disability as defined in section 273.13, subdivision 22.\n\"For-hire carrier\" means a person engaged in transportation for hire of tangible personal property.\n[Repealed, 2008 c 154 art 12 s 41]\n\"Normal course of business\" means activities that demonstrate a commercial continuity or consistency of making sales or performing services for the purposes of attaining profit or producing income. Factors that indicate that a person is acting in the normal course of business include:\n(1) systematic solicitation of sales through advertising media;\n(2) entering into contracts to perform services or provide tangible personal property;\n(3) maintaining a place of business; or\n(4) use of exemption certificates to purchase items exempt from the sales tax.\nUnless specifically provided otherwise, \"Internal Revenue Code\" means the Internal Revenue Code as defined in section 289A.02, subdivision 7.\nUnless specifically provided otherwise, \"United States Code\" means the United States Code as amended through December 31, 2000.\n(a) \"Telecommunications services\" means the electronic transmission, conveyance, or routing of voice, data, audio, video, or any other information or signals to a point, or between or among points.\n(b) Telecommunications services include transmission, conveyance, or routing in which computer processing applications are used to act on the form, code, or protocol of the content for purposes of transmission, conveyance, or routing, without regard to whether the service is referred to as Voice over Internet Protocol services or is classified by the Federal Communications Commission as enhanced or value added.\n(c) Telecommunications services do not include:\n(1) data processing and information services that allow data to be generated, acquired, stored, processed, or retrieved and delivered by an electronic transmission to a purchaser when the purchaser's primary purpose for the underlying transaction is the processed data or information;\n(2) installation or maintenance of wiring or equipment on a customer's premises;\n(3) tangible personal property;\n(4) advertising, including, but not limited to, directory advertising;\n(5) billing and collection services provided to third parties;\n(6) Internet access service;\n(7) radio and television audio and video programming services, regardless of the medium, including the furnishing of transmission, conveyance, and routing of such services by the programming service provider. Radio and television audio and video programming services includes, but is not limited to, cable service as defined in United States Code, title 47, section 522(6), and audio and video programming services delivered by commercial mobile radio service providers, as defined in Code of Federal Regulations, title 47, section 20.3;\n(8) ancillary services; or\n(9) digital products delivered electronically, including, but not limited to, software, music, video, reading materials, or ring tones.\n\"Pay television service\" means the transmission of video, audio, or other programming service to purchasers, and the subscriber interaction, if any, required for the selection or use of the programming service, regardless of whether the programming is transmitted over facilities owned or operated by the cable service provider or over facilities owned or operated by one or more dealers of communications services. The term includes point-to-multipoint distribution direct to home satellite services by which programming is transmitted or broadcast by microwave or other equipment directly to the subscriber's premises, or any similar or comparable method of service. The term includes all programming services, including subscriptions, digital video recorders, pay-per-view, and music services.\n\"Private communication service\" means a telecommunication service that entitles the customer to exclusive or priority use of a communication channel or group of channels between or among termination points, regardless of the manner in which the channel or channels are connected, and includes switching capacity, extension lines, stations, and any other associated services that are provided in connection with the use of the channel or channels.\n[Repealed, 2013 c 143 art 8 s 53]\n\"Purchase price\" means the measure subject to the use tax and has the same meaning as \"sales price.\"\nUnless specifically provided otherwise, \"state\" means any state of the United States, the District of Columbia, and any territory of the United States, including American Samoa, Guam, Northern Mariana Islands, Puerto Rico, and the U.S. Virgin Islands.\n\"Delivery charges\" means charges by the seller of personal property or services for preparation and delivery to a location designated by the purchaser of personal property or services including, but not limited to, transportation, shipping, postage, handling, crating, and packing.\n\"Prepared food\" means food that meets either of the following conditions:\n(1) the food is sold with eating utensils provided by the seller, including plates, knives, forks, spoons, glasses, cups, napkins, or straws; or\n(2) the food is sold in a heated state or heated by the seller or two or more food ingredients are mixed or combined by the seller for sale as a single item, except for:\n(i) bakery items, including, but not limited to, bread, rolls, buns, biscuits, bagels, croissants, pastries, donuts, danish, cakes, tortes, pies, tarts, muffins, bars, cookies, tortillas;\n(ii) ready-to-eat meat and seafood in an unheated state sold by weight;\n(iii) eggs, fish, meat, poultry, and foods containing these raw animal foods requiring cooking by the consumer as recommended by the Food and Drug Administration in chapter 3, part 401.11 of its food code so as to prevent food borne illnesses; or\n(iv) food that is only sliced, repackaged, or pasteurized by the seller.\n\"Soft drinks\" means nonalcoholic beverages that contain natural or artificial sweeteners. Soft drinks do not include beverages that contain milk or milk products; soy, rice, or similar milk substitutes; or greater than 50 percent vegetable or fruit juice by volume.\n\"Candy\" means a preparation of sugar, honey, or other natural or artificial sweeteners in combination with chocolate, fruits, nuts, or other ingredients or flavorings in the form of bars, drops, or pieces. Candy does not include any preparation containing flour and must require no refrigeration.\n\"Taxable food sold through vending machines\" means taxable food under section 297A.61, subdivision 3, paragraph (d), dispensed from a machine or other device that accepts payment including honor payments.\n\"Direct mail\" means printed material delivered or distributed by United States mail or other delivery service to a mass audience or to addressees on a mailing list provided by the purchaser or at the direction of the purchaser when the cost of the items is not billed directly to the recipients. \"Direct mail\" includes tangible personal property supplied directly or indirectly by the purchaser to the direct mail seller for inclusion in the package containing the printed material. \"Direct mail\" does not include multiple items of printed material delivered to a single address.\n\"Agricultural production\" includes, but is not limited to, horticulture, silviculture, floriculture, maple syrup harvesting, and the raising of pets, livestock as defined in section 17A.03, subdivision 5, poultry, dairy and poultry products, bees and apiary products, the raising and harvesting of agricultural crops, sod, fur-bearing animals, research animals, and horses.\n(a) \"Logging equipment\" means new or used machinery, equipment, implements, accessories, and contrivances used directly and principally in the commercial cutting or removal or both of timber or other solid wood forest products intended to be sold ultimately at retail, including, but not limited to:\n(1) machinery used for bucking, bunching, debarking, delimbing, felling, forwarding, loading, piling, skidding, topping, and yarding operations performed on timber; and\n(2) chain saws.\n(b) Logging equipment does not include:\n(1) repair or replacement parts;\n(2) tools, shop equipment, communication equipment, and other logging supplies;\n(3) motor vehicles taxed under chapter 297B;\n(4) snowmobiles, snow blowers, or recreational all-terrain vehicles; or\n(5) machinery, equipment, implements, accessories, and contrivances used in the creation of other commercial wood products for sale to others, including, but not limited to, milling, planing, carving, wood chipping, or paper manufacturing.\n(a) \"Bundled transaction\" means the retail sale of two or more products when the products are otherwise distinct and identifiable, and the products are sold for one nonitemized price. As used in this subdivision, \"product\" includes tangible personal property, services, intangibles, and digital goods, including specified digital products or other digital products, but does not include real property or services to real property. A bundled transaction does not include the sale of any products in which the sales price varies, or is negotiable, based on the selection by the purchaser of the products included in the transaction.\n(b) For purposes of this subdivision, \"distinct and identifiable\" products does not include:\n(1) packaging and other materials, such as containers, boxes, sacks, bags, and bottles, wrapping, labels, tags, and instruction guides, that accompany the retail sale of the products and are incidental or immaterial to the retail sale. Examples of packaging that are incidental or immaterial include grocery sacks, shoe boxes, dry cleaning garment bags, and express delivery envelopes and boxes;\n(2) a promotional product provided free of charge with the required purchase of another product. A promotional product is provided free of charge if the sales price of another product, which is required to be purchased in order to receive the promotional product, does not vary depending on the inclusion of the promotional product; and\n(3) items included in the definition of sales price.\n(c) For purposes of this subdivision, the term \"one nonitemized price\" does not include a price that is separately identified by product on binding sales or other supporting sales-related documentation made available to the customer in paper or electronic form including but not limited to an invoice, bill of sale, receipt, contract, service agreement, lease agreement, periodic notice of rates and services, rate card, or price list.\n(d) A transaction that otherwise meets the definition of a bundled transaction is not a bundled transaction if it is:\n(1) the retail sale of tangible personal property and a service and the tangible personal property is essential to the use of the service, and is provided exclusively in connection with the service, and the true object of the transaction is the service;\n(2) the retail sale of services if one service is provided that is essential to the use or receipt of a second service and the first service is provided exclusively in connection with the second service and the true object of the transaction is the second service;\n(3) a transaction that includes taxable products and nontaxable products and the purchase price or sales price of the taxable products is de minimis; or\n(4) the retail sale of exempt tangible personal property and taxable tangible personal property if:\n(i) the transaction includes food and food ingredients, drugs, durable medical equipment, mobility enhancing equipment, over-the-counter drugs, prosthetic devices, or medical supplies; and\n(ii) the seller's purchase price or sales price of the taxable tangible personal property is 50 percent or less of the total purchase price or sales price of the bundled tangible personal property. Sellers must not use a combination of the purchase price and sales price of the tangible personal property when making the 50 percent determination for a transaction.\n(e) For purposes of this subdivision, \"purchase price\" means the measure subject to use tax on purchases made by the seller, and \"de minimis\" means that the seller's purchase price or sales price of the taxable products is ten percent or less of the total purchase price or sales price of the bundled products. Sellers shall use either the purchase price or the sales price of the products to determine if the taxable products are de minimis. Sellers must not use a combination of the purchase price and sales price of the products to determine if the taxable products are de minimis. Sellers shall use the full term of a service contract to determine if the taxable products are de minimis.\n\"Ancillary services\" means services that are associated with or incidental to the provision of telecommunications services, including, but not limited to, conference bridging service, detailed telecommunications billing, directory assistance, vertical service, and voice mail services.\n\"Conference bridging service\" means an ancillary service that links two or more participants of an audio or video conference call and may include the provision of a telephone number. Conference bridging service does not include the telecommunications services used to reach the conference bridge.\n\"Detailed telecommunications billing service\" means an ancillary service of separately stating information pertaining to individual calls on a customer's billing statement.\n\"Directory assistance\" means an ancillary service of providing telephone number information or address information, or both.\n\"Vertical service\" means an ancillary service that is offered in connection with one or more telecommunications services and which offers advanced calling features that allow customers to identify callers and to manage multiple calls and call connections, including conference bridging services.\n\"Voice mail service\" means an ancillary service that enables the customer to store, send, or receive recorded messages. Voice mail service does not include any vertical services that the customer may be required to have in order to utilize the voice mail service.\n\"Ring tone\" means a digitized sound file that is downloaded onto a device and that may be used to alert the customer with respect to a communication. A ring tone does not include ring back tones or other digital audio files that are not stored on the purchaser's communication device.\n\"Fur clothing\" means human wearing apparel that is required by the Federal Fur Products Labeling Act, United States Code, title 15, section 69, to be labeled as a fur product, and the value of the fur components in the product is more than three times the value of the next most valuable tangible component. For purposes of this subdivision, \"fur\" means any animal skin or part of an animal skin with hair, fleece, or fur fibers attached to it, either in its raw or processed state, but does not include animal skins that have been converted into leather or suede, or from which the hair, fleece, or fur fiber has been completely removed in processing the skins.\n\"Accommodations intermediary\" means any person or entity, other than an accommodations provider, that facilitates the sale of lodging as defined in subdivision 3, paragraph (g), clause (2), and that charges a room charge to a customer. The term \"facilitates the sale\" includes brokering, coordinating, or in any way arranging for the purchase of or the right to use accommodations by a customer.\n\"Accommodations provider\" means any person or entity that furnishes lodging as defined in subdivision 3, paragraph (g), clause (2), to the general public for compensation. The term \"furnishes\" includes the sale of use or possession, or the sale of the right to use or possess.\n\"Motor vehicle repair paint\" means a substance composed of solid matter suspended in a liquid medium and applied as a protective or decorative coating to the surface of a motor vehicle in order to restore the motor vehicle to its original condition, and includes primer, body paint, clear coat, and paint thinner used to paint motor vehicles, as defined in section 297B.01.\n\"Motor vehicle repair materials\" means items, other than motor vehicle repair paint or motor vehicle parts, that become a part of a repaired motor vehicle or are consumed in repairing the motor vehicle at retail, and include abrasives, battery water, body filler or putty, bolts and nuts, brake fluid, buffing pads, chamois, cleaning compounds, degreasing compounds, glaze, grease, grinding discs, hydraulic jack oil, lubricants, masking tape, oxygen and acetylene, polishes, rags, razor blades, sandpaper, sanding discs, scuff pads, sealer, solder, solvents, striping tape, tack cloth, thinner, waxes, and welding rods. Motor vehicle repair materials do not include items that are not used directly on the motor vehicle, such as floor dry that is used to clean the shop, or cleaning compounds and rags that are used to clean tools, equipment, or the shop and are not used to clean the motor vehicle.\n\"Digital audio works\" means works that result from a fixation of a series of musical, spoken, or other sounds, that are transferred electronically. Digital audio works includes such items as the following which may either be prerecorded or live: songs, music, readings of books or other written materials, speeches, ring tones, or other sound recordings. Digital audio works does not include audio greeting cards sent by electronic mail. Unless the context provides otherwise, in this chapter digital audio works includes the digital code, or a subscription to or access to a digital code, for receiving, accessing, or otherwise obtaining digital audio works.\n\"Digital audiovisual works\" means a series of related images which, when shown in succession, impart an impression of motion, together with accompanying sounds, if any, that are transferred electronically. Digital audiovisual works includes such items as motion pictures, movies, musical videos, news and entertainment, and live events. Digital audiovisual works does not include video greeting cards sent by electronic mail. Unless the context provides otherwise, in this chapter digital audiovisual works includes the digital code, or a subscription to or access to a digital code, for receiving, accessing, or otherwise obtaining digital audiovisual works.\n\"Digital books\" means any literary works, other than digital audiovisual works or digital audio works, expressed in words, numbers, or other verbal or numerical symbols or indicia so long as the product is generally recognized in the ordinary and usual sense as a \"book.\" It includes works of fiction and nonfiction and short stories. It does not include periodicals, magazines, newspapers, or other news or information products, chat rooms, or weblogs. Unless the context provides otherwise, in this chapter digital books includes the digital code, or a subscription to or access to a digital code, for receiving, accessing, or otherwise obtaining digital books.\n\"Digital code\" means a code which provides a purchaser with a right to obtain one or more specified digital products or other digital products. A digital code may be transferred electronically, such as through electronic mail, or it may be transferred on a tangible medium, such as on a plastic card, a piece of paper or invoice, or imprinted on another product. A digital code is not a code that represents a stored monetary value that is deducted from a total as it is used by the purchaser, and it is not a code that represents a redeemable card, gift card, or gift certificate that entitles the holder to select a digital product of an indicated cash value. The end user of a digital code is any purchaser except one who receives the contractual right to redistribute a digital product which is the subject of the transaction.\n\"Other digital products\" means the following items when transferred electronically:\n(1) greeting cards; and\n(2) online video or electronic games.\n\"Specified digital products\" means digital audio works, digital audiovisual works, and digital books that are transferred electronically to a customer.\n\"Transferred electronically\" means obtained by the purchaser by means other than tangible storage media. For purposes of this subdivision, it is not necessary that a copy of the product be physically transferred to the purchaser. A product will be considered to have been transferred electronically to a purchaser if the purchaser has access to the product.\n[Repealed, 2014 c 150 art 2 s 5]\n(a) \"Real property\" includes:\n(1) the land itself;\n(2) buildings and structures constructed or erected on the land and intended to be permanent; and\n(3) improvements and fixtures if incorporated into and intended to be of a permanent benefit to a building or structure given its present use, and that cannot be removed without causing substantial damage to the building or structure.\n(b) Real property does not include tools, implements, machinery, and equipment attached or installed into real property for use in the business or production activity conducted thereon, that qualify for exemption under section 297A.68, regardless of size, weight, or method of incorporation into the real property.\n(c) If the exclusion provided in paragraph (b) does not apply, then the definition in paragraph (a) must be used to determine whether tools, implements, machinery, or equipment are real property.",
	"repealed": false
}