{
	"id": "184.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/184.38",
	"title": "184.38 RULES GOVERNING AGENCIES.",
	"text": "In addition to the foregoing rules, the rules prescribed in this section shall govern each and every employment agent.\n[Repealed, 2015 c 54 art 5 s 16]\nNo fee shall be solicited or accepted as an application of registration fee by any employment agent for the purpose of being registered as an applicant for employment, nor shall any other money be solicited or accepted for any reason prior to the actual start date, other than fees earned through concurrent fee arrangements in which the fee charged is not contingent upon actual placement of an applicant.\nEvery employment agent shall give to every person from whom the payment of a service charge is received for services rendered or to be rendered, or assistance given or to be given, a receipt bearing the name and address of the employment agency, the amount of the payment, the date of the payment, and for what it is paid. Every receipt to an applicant by an employment agent shall be numbered and bound in duplicate form. Duplicate copy of each receipt shall be kept at least one year.\nEvery employment agent shall keep a record of all services rendered employers and employees. This record shall contain the name and address of the employer by whom the services were solicited, the name and address of the employee, kind of position offered by the employer, probable duration of the employment, rate of wage or salary to be paid the employee, amount of the employment agent's service charge, dates and amounts of payments, date and amount of refund if any, and for what, and a space for remarks under which shall be recorded anything of an individual nature to amplify the foregoing report and as information in the event of any question arising concerning the transaction. Every employment agent engaged in the placement of applicants shall also keep a record of kind of position accepted by the employee. In the event the department has reason to question the detailed report so submitted by the employment agent, the department shall have authority to demand of the employment agent the production of these records for examination by it, or its agent, at such place as the department may designate.\n(a) No employment agent shall send out any applicant for employment without having obtained a job order, and if no employment of the kind applied for existed at the place to which the applicant was directed, the employment agent shall refund to the applicant, within 48 hours of demand, any sums paid by the applicant for transportation in going to and returning from the place.\n(b) Nothing in this chapter shall be construed to prevent an employment agent from directing an applicant to an employer where the employer has previously requested interviews with applicants of certain types and qualifications, even though no actual vacancy existed in the employer's organization at the time the applicant was so directed; nor shall it prevent the employment agent from attempting to sell the services of an applicant to the employer even though no order has been placed with the employment agent; provided, that prior to scheduling an interview with an employer, when no opening currently exists with that employer, the applicant is clearly informed that no opening exists at that time.\nNo employment agent shall, individually, or by an agent or agents, solicit, persuade, or induce any employee to leave any employment in which the employment agent or agents of the employment agent have placed the employee, nor shall any agent, individually or through any agents, persuade or induce or solicit any employer to discharge any employee.\nNo employment agent shall knowingly cause to be printed or published a false or fraudulent notice or advertisement for help or for obtaining work or employment. For purposes of this subdivision the phrase \"false or fraudulent notice or advertisement\" shall include the following:\n(1) the advertisement of any job for which there is no bona fide oral or written job order and completed job order form in existence at the time the advertisement is placed;\n(2) the inclusion in any advertisement of any information concerning the identity, availability, features, or requirements of any advertised job when such information is not substantiated by, and included in, the supporting job order form;\n(3) the advertisement of any job opening of the type described in subdivision 6, paragraph (b);\n(4) the advertisement of any job without the inclusion in the advertisement of the \"job order number\" required in subdivision 18;\n(5) if an applicant appears at any agency in response to the advertisement of a particular job, the failure to attempt placement of the applicant in the advertised job; provided however, that the agency may refuse to attempt such placement if the reason(s) for the refusal are clearly and truthfully disclosed to the applicant either orally or in writing.\nNo employment agent shall place or assist in placing any person in unlawful employment.\nNo employment agent shall fail to state in any advertisement, proposal, or contract for employment, that there is a strike or lockout at the place of proposed employment, if the agent has knowledge that such condition exists.\nNo employment agency or its employee may split, divide, or share, directly or indirectly, any fee, charge, or compensation received from any employer or applicant with any employer, or person in any way connected with the employer's business. A violation of this subdivision shall be punished by a fine of not less than $100, and not more than $3,000, or on failure to pay the fine by imprisonment for a period not to exceed one year, or both, at the discretion of the court.\n\"Temporary position\" means a position lasting less than 90 days, and \"permanent position\" means a position lasting 90 days or more. A permanent position becomes temporary where the employee is discharged within 90 days for any reason other than misconduct. Intermittent employment on certain days each week or month shall be designated as temporary employment, and no fee shall be charged on earnings in such employment after 90 days from the first day of such employment, nor after an interruption in such employment of more than 30 days within such 90-day period. A position presumed to be permanent, but which is contingent upon satisfactory service, shall continue to be presumed permanent until the employee is discharged before 90 days.\nWhere a temporary position merges into a permanent position, or where an employee accepts a permanent position within 90 days after termination of a temporary position, such permanent position may be considered the result of the reference to the temporary position and the fee based on such permanent position, due credit being given for money paid for the temporary position.\nWhen a permanent position becomes a temporary position as defined in subdivision 12 the employment agent shall, within five calendar days, refund to the employee any amount paid by said employee in excess of a temporary position employment charge.\nThe schedule of fees for all positions must be filed with the department. No change in fees shall be effective until 30 days after filing with the department.\nAny note having as consideration the payment of an employment agency fee shall contain the following statement: \"NOTE FOR EMPLOYMENT AGENCY FEE.\" The defense of no or insufficient consideration shall be good as against a holder in due course of any such employment agency fee note.\n[Repealed, 2015 c 54 art 5 s 16]\nExcept for applicant information given in the course of normal agency operations, no employment agent shall voluntarily sell, give, or otherwise transfer any files, records, or other information relating to its employment agency applicants and employers to any person other than an employment agent. Every employment agent who ceases to engage in the business of or act as an employment agent shall notify the department of such fact within 30 days thereof, and shall advise the department as to the disposition of all files and other records relating to its employment agency business.\nEvery job order communicated to an agency shall be recorded by the agency on a job order form which form shall contain specific information as prescribed by the department. A job order form shall be filled out for each job order prior to any attempt to advertise the job opening or to place persons in said job. Such forms shall each be assigned a separate number and shall be maintained by the agency for a period of one year.\nNo person shall be required to pay a fee to an employment agency for a position, whether temporary or permanent, if the applicant withdraws acceptance of the position, provided that the applicant did not actually start the job.\nNo employment agent shall knowingly misrepresent to any employer the educational background, skills, or qualifications of any job candidate; or knowingly misrepresent to a job candidate the responsibilities, salary, or other features of any position of employment.",
	"repealed": false
}