{
	"id": "299D.085",
	"url": "https://www.revisor.mn.gov/statutes/cite/299D.085",
	"title": "299D.085 OVERDIMENSIONAL LOAD ESCORT DRIVER.",
	"text": "For purposes of this section, \"overdimensional load\" is a vehicle or combination of vehicles of a size or weight of vehicle or load exceeding the maximum specified in chapter 169, or otherwise not in conformity with the provisions of chapter 169.\nNo person may operate as an overdimensional load escort driver in this state without a certificate issued by the commissioner, or by a state with which the commissioner has entered into a reciprocal agreement. The commissioner shall assess a fee for each certificate applicant, calculated to cover the commissioner's cost of establishing and administering the program. No other certification is required to escort an overdimensional load.\nMS 2012 [Expired, 2012 c 287 art 3 s 53]\nTo obtain a certificate to operate as an overdimensional load escort driver, a person must be a minimum of 18 years of age, possess a valid operator's license for the type of vehicle being operated, successfully complete an escort driver certification course developed by the commissioner and offered by the commissioner or authorized agents, and meet all additional requirements, including vehicle and safety equipment standards specified by the commissioner.\nA vehicle or a combination of vehicles may tow a trailer during the movement of an overdimensional load if:\n(1) the party involved is a building mover licensed by the commissioner of transportation under section 221.81;\n(2) the building being moved is not a temporary structure;\n(3) the overdimensional load is a manufactured home, as defined under section 327.31; or\n(4) the overdimensional load is a modular home, as defined under section 297A.668, subdivision 8, paragraph (b).\nA person who violates, or aids or abets the violation of, any provision of this section is guilty of a petty misdemeanor.\nThe commissioner of public safety shall adopt rules to carry out the provisions of this section. Notwithstanding section 16A.1283, the rules must specify the fee to be assessed under subdivision 2.",
	"repealed": false
}