{
	"id": "51A.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.065",
	"title": "51A.065 MUTUAL AND CAPITAL STOCK CONVERSIONS.",
	"text": "Any mutual or capital stock association, or mutual or capital stock federal association, if substantial business benefit to the applicant will result, may apply to convert to one of the following other forms of organization: mutual association, capital stock association, mutual federal association, or capital stock federal association in accordance with the provisions of subdivisions 2 to 4 and one of the three plans of conversion set forth in subdivisions 5 to 7.\nAny applicant seeking to convert its corporate form pursuant to this section shall first obtain approval of a plan of conversion by resolution adopted by not less than a two-thirds majority vote of the total number of directors authorized.\nUpon approval of the plan of conversion by the board of directors, the plan and the resolution approving it shall be submitted to the commissioner. The commissioner may approve or disapprove the plan of conversion in its discretion, but shall not approve the plan unless a finding is made, after appropriate examination, that: substantial business benefit to the applicant will result; the plan of conversion is fair and equitable; the interests of the applicant, its members or stockholders, its savings account holders and the public are adequately protected; and the converting applicant has complied with the requirements of this section. If the commissioner approves the plan of conversion, the approval, which shall be in writing and sent to the home office of the converting applicant, may prescribe terms and conditions to be fulfilled either before or after the conversion to cause the applicant to conform with the requirements of Laws 1981, chapter 276. If the commissioner disapproves the plan of conversion, the objections shall be stated in writing and sent to the home office of the converting applicant, and the applicant afforded an opportunity to amend and resubmit the plan within a reasonable time as prescribed by the authority. In the event that the commissioner disapproves the plan after resubmission, written notice of the final disapproval shall be sent by certified mail to the applicant's home office.\nIf the commissioner approves a plan of conversion in accordance with subdivision 3, the plan must be submitted for adoption to the members or stockholders of the converting applicant by vote at a meeting called to consider the action. Except in the case of a conversion of an association to a federal association of like corporate form, or vice versa pursuant to subdivision 7 and in addition to any notice of annual or special meeting required by Laws 1981, chapter 276, and at least three weeks prior to the meeting, a copy of the plan, together with an accurate summary plan description explaining the operation of the plan and the rights, duties, obligations, liabilities, conditions, and requirements which may be imposed upon the members or stockholders and the converted applicant as a result of the adoption of the plan, must be mailed to each member or stockholder eligible to vote at the meeting. The plan of conversion may be approved by not less than a majority of the total number of votes eligible to be cast at the meeting. If the plan is approved, action must be taken to obtain a charter, articles of incorporation, articles of association or similar instrument, adopt bylaws, elect directors and officers and take other action prescribed or appropriate for the type of corporation into which the converting applicant will be converted. A certified report of the proceedings at the meeting must be filed promptly with the commissioner.\nIn any plan of conversion from mutual form of organization to capital stock form, the following requirements are mandatory:\n(a) Each savings account holder shall receive without payment a withdrawable account of the same general class in the converted institution equal in amount and equal in time tenure to that person's withdrawable account in the converting institution.\n(b) All voting capital stock issued by an association to accomplish the conversion shall be subscribed and fully paid for and shall not be eligible either directly or indirectly as security for a loan or other credit advance to facilitate its own purchase and each account holder shall receive without payment nontransferable rights for a period of at least 20 days to purchase a proportionate share of voting capital stock at a price equal to the initial stated value thereof. Thereafter, any stock remaining unsubscribed may be offered for sale to others, provided the offering shall be sold in a public offering through an underwriter or if directly by the converting association in a direct community marketing program as provided for in the plan for conversion approved by the commissioner or other responsible authority, except that no officer, director, employee, or spouse thereof shall be entitled to purchase any stock if the purchase would result in ownership of more than one percent of the total offering of capital stock, nor shall these persons in the aggregate be entitled to purchase any stock if the purchase would result in ownership of more than 15 percent thereof. Any stock purchased by an officer, director, or employee of the converting institution, or any of their spouses, in connection with a conversion hereunder shall not, for a period of two years following the date of issuance of the certificate of conversion, be subject to inter vivos sale, pledge, assignment, hypothecation, transfer, any agreement to sell or otherwise alienate in the future, or any other form of alienation.\n(c) The record date for determining savings account holders' rights to distribution under paragraph (b) shall be set by the converting institution's board of directors, but the date shall be not less than 90 days prior to the date of approval of the conversion plan by the directors.\n(d) The proportionate share of voting capital stock subscription rights of each savings account holder of record shall be a fraction, the numerator of which is the total savings account balance of the account holder and the denominator of which is the total savings liability of the converting institution as of the record date determined in accordance with paragraph (c). Fractional shares need not be issued but subscription rights representing less than the initial stated value per share shall be issued and may be combined to authorize the subscription of one or more shares of stock.\n(e) The plan shall demonstrate with particularity the substantial business benefit to the applicant that will result from the conversion.\n(f) The plan shall provide that the conversion will not result in any insurance of accounts being canceled by the insuring agency, and will not result in a taxable reorganization under federal law.\n(g) The plan shall provide for the election of directors on a staggered term basis.\n(h) The plan shall contain other provisions, requirements or information and be in a form acceptable to the commissioner or other appropriate supervisory authority to enable a determination that substantial business benefit to the applicant will result from the conversion; that the plan is fair and equitable; that the interests of the applicant, its members or shareholders, its savings account holders and the public are adequately protected; and that the converting applicant has complied with the requirements of this section.\nIn any plan of conversion from capital stock form of organization to mutual form, the following requirements are mandatory:\n(a) Each savings account holder shall receive without payment a withdrawable account of the same general class in the converted institution equal in amount and equal in time tenure to that person's withdrawable account in the converting capital stock institution.\n(b) The plan shall specify how and in what amount the return of capital to each class of stockholder in the form of an exchange of stock for savings accounts shall be effectuated.\n(c) The plan shall provide for allocation of voting rights to the holders of savings accounts and the manner of exercise thereof.\n(d) The requirements of subdivision 5, paragraphs (e), (f), (g) and (h).\nIn any conversion of a state association to a federally chartered association of like corporate form, or vice versa, the following requirements are mandatory:\n(a) Each savings account holder shall receive a withdrawable account of the same general class in the converted institution equal in amount and equal in time tenure to that person's withdrawable account in the converted institution.\n(b) Each savings account holder with voting rights or capital stockholder with voting rights, as the case may be, shall, to the extent permitted by law applicable to the converted institution, receive substantially identical voting rights in the converted institution.\n(c) The requirements of subdivision 5, paragraphs (e), (f), (g) and (h).\nIf the commissioner finds that a conversion proceeding has been completed in accordance with the requirements of this section, the commissioner shall issue to the applicant a certificate of conversion, attaching as a part of the certificate a copy of the charter, articles of incorporation, articles of association or similar instrument. The conversion shall not become effective until the issuance of the certificate as provided in this section.\nUpon the issuance to any applicant of a certificate of conversion as provided in subdivision 8, the corporate existence of the converting applicant shall not terminate, but the applicant shall be a continuation of the entity so converted and all property of the converted applicant, including its rights, titles, and interests in and to all property of whatever kind, whether real, personal, or mixed, things in action, and every right, privilege, interest, and asset of any conceivable value or benefit then existing, or pertaining to it, or which would inure to it, immediately, by operation of law and without any conveyance or transfer and without any further act or deed, shall vest in and remain the property of the converted applicant, and the same shall have, hold, and enjoy the same in its own right as fully and to the same extent as the same was possessed, held, and enjoyed by the converting applicant, and the converted applicant, upon issuance of the certificate of conversion, shall continue to have and succeed to all the rights, obligations and relations of the converting applicant. All pending actions and other judicial proceedings to which the converting applicant is a party shall not be abated or discontinued by reason of the conversion, but may be prosecuted to final judgment, order, or decree in the same manner as if the conversion had not been made, and the converted applicant may continue the actions in its new corporate name. Any judgment, order, or decree may be rendered for or against it which might have been rendered for or against the converting applicant theretofore involved in the proceedings.\nAny association aggrieved by any action or inaction of the commissioner under this section may appeal therefrom and the proceedings shall be conducted pursuant to the provisions of the Administrative Procedure Act relating to judicial review of agency decisions, sections 14.63 to 14.69, and the scope of judicial review in the proceedings shall be as provided therein.\nNothing in this section applies to the conversion of a federal association to another form of federally chartered institution.",
	"repealed": false
}