{
	"id": "187.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/187.08",
	"title": "187.08 SECURE CHOICE RETIREMENT PROGRAM BOARD OF DIRECTORS.",
	"text": "The policy-making function of the program is vested in a board of directors consisting of seven members as follows:\n(1) the executive director of the Minnesota State Retirement System or the executive director's designee;\n(2) the executive director of the State Board of Investment or the executive director's designee;\n(3) three members chosen by the Legislative Commission on Pensions and Retirement, one from each of the following experience categories:\n(i) executive or operations manager with substantial experience in record keeping 401(k) plans;\n(ii) executive or operations manager with substantial experience in individual retirement accounts; and\n(iii) executive or other professional with substantial experience in retirement plan investments;\n(4) a human resources or retirement benefits executive from a private company with substantial experience in administering the company's 401(k) plan, appointed by the governor; and\n(5) a small business owner, a small business executive, or a nonprofit executive appointed by the governor.\nMembers appointed by the governor must be appointed as provided in section 15.0597.\n(a) Board members serve for two-year terms, except for the executive directors of the Minnesota State Retirement System and the State Board of Investment, who serve indefinitely.\n(b) Board members' terms may be renewed, but no member may serve more than two consecutive terms.\n(a) A board member may resign at any time by giving written notice to the board.\n(b) A board member may be removed by the appointing authority and a majority vote of the board following notice and hearing before the board. For purposes of this subdivision, the chair may invite the appointing authority or a designee of the appointing authority to serve as a voting member of the board if necessary to constitute a quorum.\n(c) If a vacancy occurs, the Legislative Commission on Pensions and Retirement or the governor, as applicable, shall appoint a new member within 90 days.\nPublic members are compensated and expenses reimbursed as provided under section 15.0575, subdivision 3.\nThe board shall select a chair from among its members. The chair shall serve a two-year term. The board may select other officers as necessary to assist the board in performing the board's duties.\n(a) The board must appoint an executive director, determine the duties of the executive director, and set the compensation of the executive director. The board may appoint an interim executive director to serve as executive director during any period that the executive director position is vacant.\n(b) The board may hire staff as necessary to support the board and the executive director or interim executive director in performing their duties or the board may authorize the executive director or interim executive director to hire staff.\nIn addition to the duties set forth elsewhere in this chapter, the board has the following duties:\n(1) to establish secure processes for enrolling covered employees in the program and for transmitting employee contributions to accounts in the trust;\n(2) to prepare a budget and establish procedures for the payment of costs of administering and operating the program;\n(3) to lease or otherwise procure equipment necessary to administer the program;\n(4) to procure insurance in connection with the property of the program and the activities of the board, executive director, and other staff;\n(5) to determine the following:\n(i) any criteria for a covered employee other than employment with a covered employer under section 187.03, subdivision 5;\n(ii) contribution rates and an escalation schedule under section 187.05, subdivision 4;\n(iii) withdrawal and distribution options under section 187.05, subdivision 6; and\n(iv) the default investment fund under section 187.06, subdivision 5;\n(6) to keep annual administrative fees, costs, and expenses as low as possible:\n(i) except that any administrative fee assessed against the accounts of covered employees may not exceed a reasonable amount relative to the fees charged by auto-IRA or defined contribution programs of similar size in the state of Minnesota or another state; and\n(ii) the fee may be asset-based, flat fee, or a hybrid combination of asset-based and flat fee;\n(7) to determine the eligibility of an employer, employee, or other individual to participate in the program and review and decide claims for benefits and make factual determinations;\n(8) to prepare information regarding the program that is clear and concise for dissemination to all covered employees and includes the following:\n(i) the benefits and risks associated with participating in the program;\n(ii) procedures for enrolling in the program and opting out of the program, electing a different or zero percent employee contribution rate, making investment elections, applying for a distribution of employee accounts, and making a claim for benefits;\n(iii) the federal and state income tax consequences of participating in the program, which may consist of or include the disclosure statement required to be distributed by retirement plan trustees or custodians under the Internal Revenue Code and the Treasury Regulations thereunder;\n(iv) how to obtain additional information on the program; and\n(v) disclaimers of covered employer and state responsibility, including the following statements:\n(A) covered employees seeking financial, investment, or tax advice should contact their own advisors;\n(B) neither a covered employer nor the state of Minnesota are liable for decisions covered employees make regarding their account in the program;\n(C) neither a covered employer nor the state of Minnesota guarantees the accounts in the program or any particular investment rate of return; and\n(D) neither a covered employer nor the state of Minnesota monitors or has an obligation to monitor any covered employee's eligibility under the Internal Revenue Code to make contributions to an account in the program, or whether the covered employee's contributions to an account in the program exceed the maximum permissible contribution under the Internal Revenue Code;\n(9) to publish an annual financial report, prepared according to generally accepted accounting principles, on the operations of the program, which must include but not be limited to costs attributable to the use of outside consultants, independent contractors, and other persons who are not state employees and deliver the report to the chairs and ranking minority members of the legislative committees with jurisdiction over jobs and economic development and state government finance, the executive directors of the State Board of Investment and the Legislative Commission on Pensions and Retirement, and the Legislative Reference Library;\n(10) to publish an annual report regarding plan outcomes, progress toward savings goals established by the board, statistics on the number of participants, participating employers, and covered employees who have opted out of participation, plan expenses, estimated impact of the program on social safety net programs, and penalties and violations, and disciplinary actions for enforcement, and deliver the report to the chairs and ranking minority members of the legislative committees with jurisdiction over jobs and economic development and state government finance, the executive directors of the State Board of Investment and the Legislative Commission on Pensions and Retirement, and the Legislative Reference Library;\n(11) to file all reports required under the Internal Revenue Code or chapter 290;\n(12) to, at the board's discretion, seek and accept gifts, grants, and donations to be used for the program, unless such gifts, grants, or donations would result in a conflict of interest relating to the solicitation of service provider for program administration, and deposit such gifts, grants, or donations in the Secure Choice administrative fund;\n(13) to, at the board's discretion, seek and accept appropriations from the state or loans from the state or any agency of the state;\n(14) to assess the feasibility of partnering with another state or a governmental subdivision of another state to administer the program through shared administrative resources and, if determined beneficial, enter into contracts, agreements, memoranda of understanding, or other arrangements with any other state or an agency or a subdivision of any other state to administer, operate, or manage any part of the program, which may include combining resources, investments, or administrative functions;\n(15) to hire, retain, and terminate third-party service providers as the board deems necessary or desirable for the program, including but not limited to the trustees, consultants, investment managers or advisors, custodians, insurance companies, recordkeepers, administrators, consultants, actuaries, legal counsel, auditors, and other professionals, provided that each service provider is authorized to do business in the state;\n(16) to interpret the program's governing documents and this chapter and make all other decisions necessary to administer the program;\n(17) to conduct comprehensive employer and worker education and outreach regarding the program that reflect the cultures and languages of the state's diverse workforce population, which may, in the board's discretion, include collaboration with state and local government agencies, community-based and nonprofit organizations, foundations, vendors, and other entities deemed appropriate to develop and secure ongoing resources; and\n(18) to prepare notices for delivery to covered employees regarding the escalation schedule and to each covered employee before the covered employee is subject to an automatic contribution increase.\nThe board of directors is authorized to adopt rules as necessary to implement this chapter.\nNo member of the board may participate in deliberations or vote on any matter before the board that will or is likely to result in direct, measurable economic gain to the member or the member's family. Members of the board shall file with the Campaign Finance and Public Disclosure Board an economic interest statement in a manner as prescribed by section 10A.09, subdivisions 5 and 6.",
	"repealed": false
}