{
	"id": "10A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.02",
	"title": "10A.02 CAMPAIGN FINANCE AND PUBLIC DISCLOSURE BOARD.",
	"text": "The Campaign Finance and Public Disclosure Board is composed of six members. The governor must appoint the members with the advice and consent of three-fifths of both the senate and the house of representatives acting separately. If either house fails to confirm the appointment of a board member within 45 legislative days after appointment or by adjournment sine die, whichever occurs first, the appointment terminates on the day following the 45th legislative day or on adjournment sine die, whichever occurs first. If either house votes not to confirm an appointment, the appointment terminates on the day following the vote not to confirm. Two members must be former members of the legislature who support different political parties; two members must be persons who have not been public officials, held any political party office other than precinct delegate, or been elected to public office for which party designation is required by statute in the three years preceding the date of their appointment; and the other two members must support different political parties. No more than three of the members of the board may support the same political party. No member of the board may currently serve as a lobbyist.\nAn appointment to fill a vacancy is made only for the unexpired term of a member who is being replaced and the appointee must meet the same stated qualifications as the member being replaced. The membership terms, compensation, and removal of members on the board are as provided in section 15.0575, except that the extension of terms and the filling of vacancies are subject to the advice and consent of the legislature in the same manner as provided in subdivision 1.\nThe concurring vote of four members of the board is required to decide any matter before the board.\nThe board must elect from among its members a chair and a vice-chair. Meetings of the board are at the call of the chair or at the call of any four members of the board acting together.\nThe board must appoint an executive director. The executive director is in the unclassified service. The executive director is not an ex officio member of the board. The executive director serves as secretary of the board and must keep a record of all proceedings and actions by the board. The board may also employ and prescribe the duties of other permanent or temporary employees in the unclassified service as may be necessary to administer this chapter, subject to appropriation. The executive director and all other employees serve at the pleasure of the board. Expenses of the board must be approved by the chair or another member as the rules of the board may provide and the expenses must then be paid in the same manner as other state expenses are paid.\n[Repealed, 1976 c 134 s 79]\nAll members and employees of the board are subject to any provisions of law regulating political activity by state employees. In addition, no member or employee of the board may be a candidate for, or holder of, (1) a national, state, congressional district, legislative district, county, or precinct office in a political party, or (2) an elected public office for which party designation is required by statute.\n(a) The board must report at the close of each fiscal year to the legislature, the governor, and the public concerning the action it has taken, the names, salaries, and duties of all individuals in its employ, and the money it has disbursed. The board must include and identify in its report any other reports it has made during the fiscal year. It may indicate apparent abuses and offer legislative recommendations.\n(b) The board must prescribe forms for statements and reports required to be filed under this chapter and make the forms available to individuals required to file them.\n(c) The board must make available to the individuals required to file the reports and statements a manual setting forth the recommended uniform methods of bookkeeping and reporting.\n(d) The board must develop a filing, coding, and cross-indexing system consistent with the purposes of this chapter.\n(e) The board must make the reports and statements filed with it available for public inspection and copying by the end of the second day following the day on which they were received. An individual may copy a report or statement by hand or by duplicating machine and the board must provide duplicating services at cost for this purpose.\n(f) Notwithstanding section 138.163, the board must preserve reports and statements for a period of five years from the date of receipt.\n(g) The board must compile and maintain a current list and summary of all statements or parts of statements pertaining to each candidate.\n(h) The board may prepare and publish reports it considers appropriate.\n(i) The board shall only vote on a matter before the board at a meeting if:\n(1) the matter was placed on an agenda distributed to all members of the board at least seven days before the meeting; and\n(2) background or other relevant information to the matter was distributed to all members of the board by the executive director or other staff at least seven days before the meeting.\nBy majority consent of all members of the board, the board may vote on a matter at a meeting that does not satisfy the requirements of this paragraph.\n[Renumbered 10A.022, subdivision 1]\n(a) [Renumbered 10A.022, subd 2]\n(b) [Renumbered 10A.022, subd 2]\n(c) [Renumbered subd 13, para (b)]\n(a) [Renumbered 10A.022, subd 3]\n(b) [Renumbered 10A.022, subd 8]\n(c) [Renumbered 10A.022, subd 4]\n(d) [Renumbered 10A.022, subd 5, para (a)]\n(e) [Renumbered 10A.022, subd 7]\n[Renumbered 10A.022, subd 5, para (b)]\nThe board may develop and maintain systems to enable treasurers to enter and store electronic records online for the purpose of complying with this chapter. Data entered into such systems by treasurers or their authorized agents is not government data under chapter 13 and may not be accessed or used by the board for any purpose without the treasurer's written consent. Data from such systems that has been submitted to the board as a filed report is government data under chapter 13.\n(a) The board may issue and publish advisory opinions on the requirements of this chapter and of those sections listed in section 10A.022, subdivision 3, based upon real or hypothetical situations. An application for an advisory opinion may be made only by a person who is subject to this chapter and who wishes to use the opinion to guide the person's own conduct. The board must issue written opinions on all such questions submitted to it within 30 days after receipt of written application, unless a majority of the board agrees to extend the time limit.\n(b) A written advisory opinion issued by the board is binding on the board in a subsequent board proceeding concerning the person making or covered by the request and is a defense in a judicial proceeding that involves the subject matter of the opinion and is brought against the person making or covered by the request unless:\n(1) the board has amended or revoked the opinion before the initiation of the board or judicial proceeding, has notified the person making or covered by the request of its action, and has allowed at least 30 days for the person to do anything that might be necessary to comply with the amended or revoked opinion;\n(2) the request has omitted or misstated material facts; or\n(3) the person making or covered by the request has not acted in good faith in reliance on the opinion.\n(c) A request for an opinion and the opinion itself are nonpublic data. The board, however, may publish an opinion or a summary of an opinion, but may not include in the publication the name of the requester, the name of a person covered by a request from an agency or political subdivision, or any other information that might identify the requester, unless the person consents to the inclusion.\nIf the board intends to apply principles of law or policy announced in an advisory opinion issued under subdivision 12 more broadly than to the individual or association to whom the opinion was issued, the board must adopt these principles or policies as rules under chapter 14.\n(a) Chapter 14 applies to the board. The board may adopt rules to carry out the purposes of this chapter.\n(b) In addition to the notice required under chapter 14, the board shall notify the chairs and ranking minority members of the committees or subcommittees in the senate and house of representatives with primary jurisdiction over elections within seven calendar days of taking the following actions:\n(1) publication of a notice of intent to adopt rules or a notice of hearing;\n(2) publication of proposed rules in the State Register;\n(3) issuance of a statement of need and reasonableness; or\n(4) adoption of final rules.\nNotwithstanding section 8.15, the board must not be assessed the cost of legal services rendered to it by the attorney general's office.\n(a) Upon written request, certified pursuant to section 10A.025, subdivision 2, the board must waive that portion of a late filing fee or a civil penalty imposed for the late filing of a report or statement under this chapter for which the requester demonstrates good cause for the late filing or submission.\n(b) The board must deposit all fees and civil penalties collected under this chapter into the general fund in the state treasury.",
	"repealed": false
}