{
	"id": "259.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.11",
	"title": "259.11 ORDER; FILING COPIES.",
	"text": "(a) Upon meeting the requirements of section 259.10, the court shall grant the application unless: (1) it finds that there is an intent to defraud or mislead; (2) section 259.13 prohibits granting the name change; or (3) in the case of the change of a minor child's name, the court finds that such name change is not in the best interests of the child. The court shall set forth in the order the name and age of the applicant's spouse and each child of the applicant, if any, and shall state a description of the lands, if any, in which the applicant and the spouse and children, if any, claim to have an interest. The court administrator shall file such order, and record the same in the judgment book. If lands be described therein, a certified copy of the order shall be filed for record, by the applicant, with the county recorder of each county wherein any of the same are situated. Before doing so the court administrator shall present the same to the county auditor who shall enter the change of name in the auditor's official records and note upon the instrument, over an official signature, the words \"change of name recorded.\" Any such order shall not be filed, nor any certified copy thereof be issued, until the applicant shall have paid to the county recorder and court administrator the fee required by law. No application shall be denied on the basis of the marital status of the applicant.\n(b) When a person applies for a name change, the court shall determine whether the person has a criminal history in this or any other state. The court may conduct a search of national records through the Federal Bureau of Investigation by submitting a set of fingerprints and the appropriate fee to the Bureau of Criminal Apprehension. If it is determined that the person has a criminal history in this or any other state, the court shall, within ten days after the name change application is granted, report the name change to the Bureau of Criminal Apprehension. The person whose name is changed shall also report the change to the Bureau of Criminal Apprehension within ten days. The court granting the name change application must explain this reporting duty in its order. Any person required to report the person's name change to the Bureau of Criminal Apprehension who fails to report the name change as required under this paragraph is guilty of a gross misdemeanor.\n(c) Paragraph (b) does not apply to:\n(1) a request for a name change as part of an application for a marriage license under section 517.08;\n(2) a request for a name change in conjunction with a marriage dissolution under section 518.27; or\n(3) a request for a name change filed under section 259.14.",
	"repealed": false
}