{
	"id": "168.123",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.123",
	"title": "168.123 VETERANS; SPECIAL PLATES.",
	"text": "(a) On payment of a fee in the amount specified for special plates under section 168.12, subdivision 5, for each set of two plates, or for a single plate in the case of a motorcycle plate, payment of the registration tax required by law, and compliance with other applicable laws relating to vehicle registration and licensing, as applicable, the commissioner shall issue:\n(1) special veteran's plates to an applicant who served in the active military service in a branch of the armed forces of the United States or of a nation or society allied with the United States in conducting a foreign war, was discharged under honorable conditions, and is a registered owner of a passenger automobile, recreational motor vehicle, or one-ton pickup truck, but which is not a commercial motor vehicle as defined in section 169.011, subdivision 16; or\n(2) a veteran's special motorcycle plate as described in subdivision 2, paragraph (a), (e), (f), (h), (i), (j), or (m), or another special plate designed by the commissioner to an applicant who is a registered owner of a motorcycle and meets the criteria listed in this paragraph and in subdivision 2, paragraph (a), (e), (f), (h), (i), (j), or (m). Plates issued under this clause must be the same size as regular motorcycle plates. Special motorcycle license plates issued under this clause are not subject to section 168.1293.\n(b) The additional fee is payable for each set of veteran's plates, is payable only when the plates are issued, and is not payable in a year in which stickers are issued instead of plates.\n(c) The veteran must have a certified copy of the veteran's discharge papers, indicating character of discharge, at the time of application. If an applicant served in the active military service in a branch of the armed forces of a nation or society allied with the United States in conducting a foreign war and is unable to obtain a record of that service and discharge status, the commissioner of veterans affairs may certify the applicant as qualified for the veterans' plates provided under this section.\nThe commissioner of veterans affairs shall design the emblem for the veterans' special plates, subject to the approval of the commissioner, that satisfy the following requirements:\n(a) For a Vietnam veteran who served after July 1, 1961, and before July 1, 1978, in the active military service in a branch of the armed forces of the United States or a nation or society allied with the United States the special plates must bear the inscription \"VIETNAM VET.\"\n(b) For a veteran stationed on the island of Oahu, Hawaii, or offshore, during the attack on Pearl Harbor on December 7, 1941, the special plates must bear the inscription \"PEARL HARBOR SURVIVOR.\"\n(c) For a veteran who served during World War II, the plates must bear the inscription \"WORLD WAR VET.\"\n(d) For a veteran who served during the Korean Conflict, the special plates must bear the inscription \"KOREAN VET.\"\n(e) For a combat wounded veteran who is a recipient of the Purple Heart medal, the plates must bear the inscription \"COMBAT WOUNDED VET\" and have a facsimile or an emblem of the official Purple Heart medal.\nA member of the United States armed forces who is serving actively in the military and who is a recipient of the Purple Heart medal is also eligible for this license plate. The commissioner of public safety shall ensure that information regarding the required proof of eligibility for any applicant under this paragraph who has not yet been issued military discharge papers is distributed to the public officials responsible for administering this section.\n(f) For a Persian Gulf War veteran, the plates must bear the inscription \"GULF WAR VET.\" For the purposes of this section, \"Persian Gulf War veteran\" means a person who served on active duty after August 1, 1990, in a branch of the armed forces of the United States or a nation or society allied with the United States or the United Nations during Operation Desert Shield, Operation Desert Storm, or other military operation in the Persian Gulf area combat zone as designated in United States Presidential Executive Order No. 12744, dated January 21, 1991.\n(g) For a veteran who served in the Laos War after July 1, 1961, and before July 1, 1978, the special plates must bear the inscription \"LAOS WAR VET.\"\n(h) For a veteran who is the recipient of:\n(1) the Iraq Campaign Medal, the special plates must be inscribed with a facsimile of that medal and must bear the inscription \"IRAQ WAR VET\" directly below the special plate number;\n(2) the Afghanistan Campaign Medal, the special plates must be inscribed with a facsimile of that medal and must bear the inscription \"AFGHAN WAR VET\" directly below the special plate number;\n(3) the Global War on Terrorism Expeditionary Medal, the special plates must be inscribed with a facsimile of that medal and must bear the inscription \"GWOT VETERAN\" directly below the special plate number; or\n(4) the Armed Forces Expeditionary Medal, the special plates must bear an appropriate inscription that includes a facsimile of that medal.\n(i) For a veteran who is the recipient of the Global War on Terrorism Service Medal, the special plates must be inscribed with a facsimile of that medal and must bear the inscription \"GWOT VETERAN\" directly below the special plate number. In addition, any member of the National Guard or other military reserves who has been ordered to federally funded state active service under United States Code, title 32, as defined in section 190.05, subdivision 5b, and who is the recipient of the Global War on Terrorism Service Medal, is eligible for the license plate described in this paragraph, irrespective of whether that person qualifies as a veteran under section 197.447.\n(j) For a veteran who is the recipient of the Korean Defense Service Medal, the special plates must be inscribed with a facsimile of that medal and must bear the inscription \"KOREAN DEFENSE SERVICE\" directly below the special plate number.\n(k) For a veteran who is a recipient of the Bronze Star medal, the plates must bear the inscription \"BRONZE STAR VET\" and have a facsimile or an emblem of the official Bronze Star medal.\n(l) For a veteran who is a recipient of the Silver Star medal, the plates must bear the inscription \"SILVER STAR VET\" and have a facsimile or an emblem of the official Silver Star medal.\n(m) For a woman veteran, the plates must bear the inscription \"WOMAN VETERAN\" and have a facsimile or an emblem as designated by the commissioners of veterans affairs and public safety.\nMS 2006 [Repealed, 2008 c 350 art 1 s 97]\nMS 2004 [Repealed by amendment, 1Sp2005 c 6 art 2 s 8]\n(a) On payment of a fee of $5, plates issued under subdivision 1, paragraph (a), clause (1), may be transferred to another passenger automobile or recreational motor vehicle, or one-ton truck described in subdivision 1, paragraph (a), clause (1), registered to the individual to whom the plates were issued.\n(b) On payment of a fee of $5, a plate issued under subdivision 1, paragraph (a), clause (2), may be transferred to another motorcycle registered to the individual to whom the plate was issued.\nMS 2004 [Repealed by amendment, 1Sp2005 c 6 art 2 s 8]\nThe commissioner may adopt rules under the Administrative Procedure Act to govern the issuance and use of the special plates authorized by this section.",
	"repealed": false
}