{
	"id": "164.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/164.35",
	"title": "164.35 ALTERNATIVE RECORDING FOR TOWN ROAD.",
	"text": "\"Recorded town road map\" means the official map of maintained and minimum-maintenance town roads.\nA town board may adopt a recorded town road map under this section to record its town road easements.\nThe recorded town road map must:\n(1) show maintained and minimum-maintenance town roads at the time the map is adopted;\n(2) be prepared at a scale of at least four inches equals one mile;\n(3) include a legend to differentiate between maintained and minimum-maintained roads;\n(4) include section numbers;\n(5) include a north point arrow;\n(6) include the name of the town, county, and state;\n(7) include a blank and a description under the blank for the date of public hearing and date of adoption; and\n(8) include blanks for signatures and dates of signatures for the chair and clerk of the town board.\n(a) The town board shall pass a resolution of its intent to hold a public hearing to consider recording roads by adopting an official map.\n(b) The town board must prepare an official map as provided in subdivision 3, and set a time, place, and date for a public hearing on adopting a recorded town road map to record roads.\n(c) The hearing notice must state that the roads to be recorded will be as four-rod roads with the official and permanent alignment being 33 feet on either side of the existing centerline, except that (1) town-line roads may be recorded for only the 33 feet located within the town holding that public hearing, and (2) a road previously recorded as less or greater than a 66-foot right-of-way may be recorded at its actual width and the width must be duly recorded on the map. The hearing notice must be published once a week for two successive weeks in a qualified newspaper of general circulation that serves the town, the last publication to be made at least ten days before the date of the public hearing. At least 30 days before the hearing, the hearing notice must be sent by mail to the property owners directly affected in the town at the addresses listed on tax assessment notices. The hearing notice may be sent with the tax assessment but all additional costs incurred may be billed to the town.\n(d) After the public hearing is held, the town board may amend and adopt the recorded town road map. The recorded town road map must be adopted by resolution and the map must be dated and signed by the chair and clerk of the town board and must be recorded with the county recorder within 90 days after the map is adopted.\n(e) The map of recorded town roads that is recorded with the county recorder must comply with the standards of the county recorder where the town is located.\n(f) A recorded town road map that was prepared by using aerial photographs to establish road centerlines and that has been duly recorded with the county recorder, is an adequate description for purposes of recording road easements and the map is the legally constituted description and prevails when a deed for a parcel abutting a road contains no reference to a road easement. Nothing prevents the town board from accepting a more definitive metes and bounds or survey description of a road easement for a road of record in its jurisdiction providing the description of the easement is referenced to equal distance on both sides of the existing road centerline.\n(g) To the extent this section requires recording or dedicating a town road to a width greater than that of its previous, actual public use, section 164.07 governs any award or procedures relating to damages sustained, if any, by the affected property owner.\nA person may appeal a decision to record a road being recorded under this section to the district court within 60 days after the date the town board adopts the recorded town road map.\nThis section does not affect the legal status or town obligations of roads and cartways not shown on the recorded town road map, except that unrecorded roads must meet minimum town road standards as defined in section 165.04, subdivision 3, for roads approaching bridges and culverts or provisions must be made to meet those standards before the town is required to accept the road as part of its recorded road system.",
	"repealed": false
}