{
	"id": "325E.67",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.67",
	"title": "325E.67 POST-LOSS ASSIGNMENT OF BENEFITS.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Residential contractor\" means a residential roofer, as defined in section 326B.802, subdivision 14; a residential building contractor, as defined in section 326B.802, subdivision 11; or a residential remodeler, as defined in section 326B.802, subdivision 12.\n(c) \"Residential real estate\" means a new or existing building, including appurtenant structures, constructed for habitation by at least one family but no more than four families.\nA post-loss assignment of rights or benefits to a residential contractor under a property and casualty insurance policy insuring residential real estate must comply with the following:\n(1) the assignment must only authorize a residential contractor to be named as a copayee for the payment of benefits under a property and casualty insurance policy covering residential real estate;\n(2) the assignment must include all of the following:\n(i) an itemized description of the work to be performed;\n(ii) an itemized description of materials, labor, and fees for the work to be performed; and\n(iii) a total itemized amount to be paid for the work to be performed;\n(3) the assignment must include a statement that the residential contractor has made no assurances that the claimed loss is fully covered by an insurance contract and must include the following notice in capitalized 14-point type:\n\"YOU ARE AGREEING TO ASSIGN CERTAIN RIGHTS YOU HAVE UNDER YOUR INSURANCE POLICY. THE ITEMIZED DESCRIPTION OF THE WORK PERFORMED, AS SET FORTH IN THIS ASSIGNMENT FORM, HAS NOT BEEN AGREED TO BY THE INSURER. PLEASE READ AND UNDERSTAND THIS DOCUMENT BEFORE SIGNING. THE INSURER MAY ONLY PAY FOR THE REASONABLE COST TO REPAIR OR REPLACE DAMAGED PROPERTY CAUSED BY A COVERED PERIL, SUBJECT TO THE TERMS OF THE POLICY.\";\n(4) the named insured has the right to cancel the assignment within ten business days after receipt of the scope of work by the insurance company. The cancellation must be made in writing or a comparable digital format. Within ten business days of the date of the written cancellation, the residential contractor must tender to the named insured, the landowner, or the possessor of the real estate any payments, partial payments, or deposits that have been made by that person;\n(5) the assignment must include the following notice in capitalized 14-point type, located in the immediate proximity of the space reserved in the assignment for the signature of the named insured:\n\"YOU MAY CANCEL THIS ASSIGNMENT WITHOUT PENALTY WITHIN TEN (10) BUSINESS DAYS FROM THE LATER OF THE DATE THE ASSIGNMENT IS EXECUTED OR THE DATE ON WHICH YOU RECEIVE A COPY OF THE EXECUTED ASSIGNMENT. YOU MUST CANCEL THE ASSIGNMENT IN WRITING AND THE CANCELLATION MUST BE DELIVERED TO [insert the name and address of residential contractor as provided by the residential contractor]. IF MAILED, THE CANCELLATION MUST BE POSTMARKED ON OR BEFORE THE TEN (10) BUSINESS DAY DEADLINE. IF YOU CANCEL THIS ASSIGNMENT, THE RESIDENTIAL CONTRACTOR HAS UP TO TEN (10) BUSINESS DAYS TO RETURN ANY PAYMENTS OR DEPOSITS YOU HAVE MADE.\";\n(6) the assignment must not impair the interests of a mortgagee or other parties with any legal interests listed on the declarations page of the property and casualty insurance policy that is the subject of the assignment; and\n(7) the assignment must not prevent or inhibit an insurer from communicating with the named insured or mortgagee listed on the declarations page of the property and casualty insurance policy that is the subject of the assignment.\nA residential contractor receiving the assignment described in subdivision 2 must:\n(1) deliver a copy of the assignment to the insurer of the residential real estate within five business days of the date the assignment is executed;\n(2) cooperate with the insurer of the residential real estate in an investigation into the claim by providing documents and records requested by the insurer and complying with the post-loss duties under the insurance policy; and\n(3) comply with section 325E.66.\nA post-loss assignment of benefits entered into with a residential contractor that violates any provision of the federal Insured Homeowner's Protection Act of 1998, Public Law 105-216, as amended, is void.",
	"repealed": false
}