{
	"id": "469.202",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.202",
	"title": "469.202 DESIGNATION OF TARGETED COMMUNITIES.",
	"text": "A city may by resolution designate a targeted community within its borders after adopting detailed findings that the designated communities meet the eligibility requirements in subdivision 2 or 3.\nAn area within a city is eligible for designation as a targeted community if the area meets three of the following four criteria:\n(a) The area had an unemployment rate that was twice the unemployment rate for the Minneapolis and Saint Paul standard metropolitan statistical area as determined by the most recent federal decennial census.\n(b) The median household income in the area was no more than 80 percent of the median household income for the Minneapolis and Saint Paul standard metropolitan statistical area as determined by the most recent federal decennial census.\n(c) The area is characterized by residential dwelling units in need of substantial rehabilitation. An area qualifies under this paragraph if 25 percent or more of the residential dwelling units are in substandard condition as determined by the city, or if 70 percent or more of the residential dwelling units in the area were built before 1960 as determined by the most recent federal decennial census.\n(d) The area is characterized by having a disproportionate number of vacant residential buildings and mortgage foreclosures. An area qualifies under this paragraph if it has either:\n(1) a foreclosure rate of at least 1.5 percent in 2008; or\n(2) a foreclosure rate in 2008 in the city or in a zip code area of the city that is at least 50 percent higher than the average foreclosure rate in the metropolitan area, as defined in section 473.121, subdivision 2. For purposes of this paragraph, \"foreclosure rate\" means the number of foreclosures, as indicated by sheriff sales records, divided by the number of households in the city in 2007.\n(a) A city may add to the area designated as a targeted community under subdivision 2 additional area extending up to four contiguous city blocks in all directions from the designated targeted community. For the purpose of this subdivision, \"city block\" has the meaning determined by the city.\n(b) The city may enlarge the targeted community to include portions of a census tract that is contiguous to a targeted community, provided that the city council first determines the additional area satisfies three of the four criteria in subdivision 2.",
	"repealed": false
}