{
	"id": "346.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/346.39",
	"title": "346.39 DOGS AND CATS.",
	"text": "Dogs and cats must be provided with food of sufficient quantity and quality to allow for normal growth or the maintenance of body weight. Feed standards shall be those recommended by the National Research Council.\nDogs and cats must be provided with clean, potable water in sufficient quantity to satisfy the animal's needs or supplied by free choice. Snow or ice is not an adequate water source.\nWhen dogs or cats are transported in crates or containers, the crates or containers must be constructed of nonabrasive wire or a smooth, durable material suitable for the animals. Crates and containers must be clean, adequately ventilated, contain sufficient space to allow the animals to turn around, and provide maximum safety and protection to the animals. Exercise for 20 to 30 minutes and water must be provided at least once every eight hours. Food must be provided at least once every 24 hours or more often, if necessary, to maintain the health and condition of the animals.\nA confinement area must provide sufficient space to allow each animal to turn about freely and to easily stand, sit, and lie in a normal position. Each confined animal must be provided a minimum square footage of floor space as measured from the tip of its nose to the base of its tail, plus 25 percent, expressed in square feet. The formula for computing minimum square footage is: (length of animal plus 25 percent) times (length of animal plus 25 percent), divided by 144. A shaded area must be provided sufficient to protect the animal from the direct rays of the sun at all times during the months of May to October.\nAll dogs and cats must be provided the opportunity for periodic exercise, either through free choice or through a forced work program, unless exercise is restricted by a licensed veterinarian.\nAnimals housed together must be kept in compatible groups. Animals must not be bred so often as to endanger their health.\nConfinement areas must be maintained at a temperature suitable for the animal involved.\nAn indoor confinement area must be ventilated. Drafts, odors, and moisture condensation must be minimized. Auxiliary ventilation, such as exhaust fans, vents, and air conditioning, must be used when the ambient temperature rises to a level that may endanger the health of the animal.\nAn indoor confinement area must have at least eight hours of illumination sufficient to permit routine inspection and cleaning.\nWhere applicable, the interior surfaces of confinement and exercise areas, including crates or containers, must be constructed and maintained so that they are substantially impervious to moisture and may be readily cleaned. They must protect the animal from injury and be kept in good repair.\nWhere applicable, a suitable method must be used to rapidly eliminate excess fluids from confinement areas.\nFood and water receptacles must be accessible to each animal and located so as to minimize contamination by excreta. Feeding and water receptacles must be kept clean. Disposable food receptacles must be discarded when soiled. Measures must be taken to protect animals from being contaminated with water, wastes, and harmful chemicals. Wastes must be disposed of properly. Where applicable, flushing methods and a disinfectant must be used periodically. Bedding, if used, must be kept clean and dry. Outdoor enclosures must be kept clean and base material replaced as necessary.",
	"repealed": false
}