{
	"id": "148.7806",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.7806",
	"title": "148.7806 ATHLETIC TRAINING.",
	"text": "Athletic training by a licensed athletic trainer under section 148.7808 includes the activities described in paragraphs (a) to (e).\n(a) An athletic trainer shall:\n(1) prevent, recognize, and evaluate athletic injuries;\n(2) give emergency care and first aid;\n(3) manage and treat athletic injuries; and\n(4) rehabilitate and physically recondition athletic injuries.\nThe athletic trainer may use modalities such as cold, heat, light, sound, electricity, exercise, and mechanical devices for treatment and rehabilitation of athletic injuries to athletes in the primary employment site.\n(b) The primary physician shall establish evaluation and treatment protocols to be used by the athletic trainer. The primary physician shall record the protocols on a form prescribed by the board. The protocol form must be updated yearly at the athletic trainer's license renewal time and kept on file by the athletic trainer.\n(c) At the primary employment site, except in a corporate setting, an athletic trainer may evaluate and treat an athlete for an athletic injury not previously diagnosed for not more than 30 days, or a period of time as designated by the primary physician on the protocol form, from the date of the initial evaluation and treatment. Preventative care after resolution of the injury is not considered treatment. This paragraph does not apply to a person who is referred for treatment by a person licensed in this state to practice medicine as defined in section 147.081, to practice chiropractic as defined in section 148.01, to practice podiatry as defined in section 153.01, or to practice dentistry as defined in section 150A.05 and whose license is in good standing.\n(d) An athletic trainer may:\n(1) organize and administer an athletic training program including, but not limited to, educating and counseling athletes;\n(2) monitor the signs, symptoms, general behavior, and general physical response of an athlete to treatment and rehabilitation including, but not limited to, whether the signs, symptoms, reactions, behavior, or general response show abnormal characteristics; and\n(3) make suggestions to the primary physician or other treating provider for a modification in the treatment and rehabilitation of an injured athlete based on the indicators in clause (2).\n(e) In a clinical, corporate, and physical therapy setting, when the service provided is, or is represented as being, physical therapy, an athletic trainer may work only under the direct supervision of a physical therapist as defined in section 148.65.",
	"repealed": false
}