{
	"id": "10A.273",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.273",
	"title": "10A.273 CONTRIBUTIONS AND SOLICITATIONS DURING LEGISLATIVE SESSION.",
	"text": "(a) A candidate for the legislature or for constitutional office, the candidate's principal campaign committee, or a political committee or party unit established by all or a part of the party organization within a house of the legislature, must not solicit or accept a contribution from a registered lobbyist, political committee, political fund, or an association not registered with the board during a regular session of the legislature.\n(b) A registered lobbyist, political committee, political fund, or an association not registered with the board must not make a contribution to a candidate for the legislature or for constitutional office, the candidate's principal campaign committee, or a political committee or party unit established by all or a part of the party organization within a house of the legislature during a regular session of the legislature.\n(c) Regardless of when made, a contribution made by a lobbyist, political committee, or political fund in order to attend an event that occurs during a regular session of the legislature and that is held by the principal campaign committee of a candidate for the legislature or constitutional office, or by a political party organization within a body of the legislature, is a violation of this section.\n(d) Regardless of when made, a contribution from a lobbyist, political committee, or political fund for membership or access to a facility operated during the regular session of the legislature by the principal campaign committee of a candidate for the legislature or constitutional office, or by a political party organization within a body of the legislature, is a violation of this section.\nA political party unit must not solicit or receive at an event hosted by a candidate for the legislature or by a candidate for constitutional office a contribution from a lobbyist, political committee, political fund, or party unit during a regular session of the legislature.\nFor purposes of this section, a \"regular session\" starts at 12:00 a.m., on the first day of each annual session and ends at 11:59 p.m. on the last day of each annual session. For purposes of this section, regular session does not include a special session or the interim between the two annual sessions of a biennium.\nA candidate, political committee, party unit, political fund, an association not registered with the board, or a registered lobbyist that violates this section is subject to a civil penalty imposed by the board of up to $1,000. If the board makes a public finding that there is probable cause to believe a violation of this section has occurred, the board may bring an action, or transmit the finding to a county attorney who must bring an action, in the District Court of Ramsey County, to collect a civil penalty as imposed by the board. Penalties paid under this section must be deposited in the general fund in the state treasury.\nThis section does not apply in a legislative special election during the period beginning when the person becomes a candidate in the special election and ending on the day of the special election.",
	"repealed": false
}