{
	"id": "41C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/41C.07",
	"title": "41C.07 BONDS.",
	"text": "The authority may issue its negotiable bonds in principal amounts which, in the opinion of the authority, are necessary to provide sufficient funds for achievement of its corporate purposes, the payment of interest on its bonds, the establishment of reserves to secure its bonds, and all other expenditures of the authority incident to and necessary or convenient to carry out its purposes and powers. The bonds are investment securities and negotiable instruments within the meaning of and for all purposes of the Uniform Commercial Code.\nBonds are payable solely and only out of the money, assets, or revenues of the authority and as provided in the agreement with bondholders pledging any particular money, assets, or revenues. Bonds are not an obligation of this state or any political subdivision of this state other than the authority within the meaning of any constitutional or statutory debt limitations, but are special obligations of the authority payable solely and only from the sources provided in this chapter, and the authority shall not pledge the credit or taxing power of this state or any political subdivision of this state other than the authority or make its debts payable out of any money except that of the authority.\nBonds must be authorized by a resolution of the authority. However, a resolution authorizing the issuance of bonds may delegate to an officer of the authority the power to negotiate and fix the details of an issue of bonds by an appropriate certificate of the authorized officer.\nBonds must:\n(1) state the date and series of the issue, be consecutively numbered and state on their face that they are payable both as to principal and interest solely out of the assets of the authority and do not constitute an indebtedness of this state or any political subdivision of this state other than the authority within the meaning of any constitutional or statutory debt limit; and\n(2) be either registered, registered as to principal only, issued in denominations as the authority prescribes, fully negotiable instruments under the laws of this state, signed on behalf of the authority with the manual or facsimile signature of the chair or vice-chair, attested by the manual or facsimile signature of the secretary, have impressed or imprinted on them the seal of the authority or a facsimile of it, be payable as to interest at rates and at times as the authority determines, be payable as to principal at times over a period not to exceed 50 years from the date of issuance, at places and with reserved rights of prior redemption as the authority prescribes, be sold at prices, at public or private sale, and in a manner as the authority prescribes, and the authority may pay all expenses, premiums, and commissions that it considers necessary or advantageous in connection with the issuance and sale, and be issued under and subject to the terms, conditions, and covenants providing for the payment of the principal, redemption premiums, if any, interest and other terms, conditions, covenants, and protective provisions safeguarding payment, not inconsistent with this chapter, as are found to be necessary by the authority for the most advantageous sale.\nThe authority may issue its bonds for the purpose of refunding any bonds of the authority then outstanding, including the payment of any redemption premiums and any interest accrued or to accrue to the date of redemption of the outstanding bonds. Until the proceeds of bonds issued for the purpose of refunding outstanding bonds are applied to the purchase or retirement of outstanding bonds or the redemption of outstanding bonds, the proceeds may be placed in escrow and be invested and reinvested in accordance with the provisions of this chapter. The interest, income, and profits earned or realized on an investment may also be applied to the payment of the outstanding bonds to be refunded by purchase, retirement, or redemption. After the terms of the escrow have been fully satisfied and carried out, any balance of proceeds and interest earned or realized on the investments may be returned to the authority for use by it in any lawful manner. All refunding bonds shall be issued and secured and are subject to the provisions of this chapter in the same manner and to the same extent as other bonds.\nThe authority may issue negotiable bond anticipation notes and may renew them from time to time, but the maximum maturity of the notes, including renewals, must not exceed ten years from the date of issue of the original notes. Notes are payable from any available money of the authority not otherwise pledged or from the proceeds of the sale of bonds in anticipation of which the notes were issued. Notes may be issued for any corporate purpose of the authority. Notes must be issued in the same manner as bonds and notes and the resolution authorizing them may contain any provisions, conditions, or limitations, not inconsistent with the provisions of this subdivision, which the bonds or a bond resolution of the authority may contain. Notes may be sold at public or private sale. In case of default on its notes or violation of any obligations of the authority to the noteholders, the noteholders have all the remedies provided in this chapter for bondholders. Notes are as fully negotiable as bonds of the authority.\nA copy of each pledge agreement by or to the authority, including without limitation each bond resolution, indenture of trust or similar agreement, or any revisions or supplements to it must be filed with the secretary of state and no further filing or other action under article 9 of the Uniform Commercial Code or any other law of the state is required to perfect the security interest in the collateral or any additions to it or substitutions for it and the lien and trust so created are binding from and after the time made against all parties having claims of any kind in tort, contract, or otherwise against the pledgor.\nMembers of the authority and any person executing its bonds are not liable personally on the bonds or subject to personal liability or accountability by reason of the issuance of the authority's bonds.\nThe authority shall publish a notice of intention to issue bonds in a newspaper published and of general circulation in the state. The notice shall include a statement of the maximum amount of bonds proposed to be issued and, in general, what net revenues will be pledged to pay the bonds and interest on them. An action may not be brought questioning the legality of the bonds or the power of the authority to issue the bonds or the legality of any proceedings in connection with the authorization or issuance of the bonds after 60 days from the date of publication of the notice.",
	"repealed": false
}