{
	"id": "240.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.09",
	"title": "240.09 COUNTY FAIR LICENSES.",
	"text": "The commission may issue class D licenses to county agricultural societies or associations incorporated under chapter 38 or nonprofit corporations organized under chapter 317A in existence and operating fairs on April 21, 1951, to conduct and manage, on their own fairgrounds, horse racing on which pari-mutuel betting is conducted. An application for a class D license must be on a form the commission prescribes and must be accompanied by a certified copy of a resolution of the county board of the county where racing is to be conducted stating that it has reviewed the license application and does not object to it. An application for a class D license must be accompanied by detailed plans and specifications of the track, buildings, fences, and other improvements.\nA person who participates in the management or conduct of horse racing or pari-mutuel betting for a county fair holding a class D license who is in an occupation listed in section 240.08, subdivision 1, or the rules of the commission must have a class C license from the commission except for active members, as defined in section 349.12, of nonprofit organizations who act without compensation as concession workers.\nBefore granting an initial class D license, the commission must hold at least one public hearing in the county where the license is to be issued, and if the racetrack to be licensed is within a city, it must also request comments on the application from the city council.\nBefore granting a class D license the director shall conduct, or request the Division of Alcohol and Gambling Enforcement to conduct, a comprehensive background and financial investigation of the applicant and the sources of financing. The director may charge an applicant an investigation fee to cover the cost of the investigation, and shall from this fee reimburse the Division of Alcohol and Gambling Enforcement for its share of the cost of the investigation. The director has access to all criminal history data compiled by the Division of Alcohol and Gambling Enforcement on class A licensees and applicants.\nIf after considering the information received at the hearing or hearings and considering the comments requested under subdivision 3, the commission determines that the license will not adversely affect the public health, welfare, and safety and that the racing to be licensed will be conducted in accordance with all applicable laws and rules, it may issue a class D license to the applicant. The license is for a period of one year.\nOn making the same determination as in subdivision 4, the commission may renew a class D license without a hearing unless it determines a hearing is necessary.\nRevocation and suspension of class D licenses, and refusals to renew class D licenses, are as provided in section 240.06, subdivision 7. A license suspension or revocation or a refusal to renew a class D license is a contested case under sections 14.57 to 14.69 of the Administrative Procedure Act and is in addition to criminal penalties imposed for a violation of law or rule.",
	"repealed": false
}