{
	"id": "144.226",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.226",
	"title": "144.226 FEES.",
	"text": "(a) The fees for the following services shall be the following or an amount prescribed by rule of the commissioner:\n(b) The fee for the administrative review and processing of a request for a certified vital record or a certification that the vital record cannot be found is $9. The fee is payable at the time of application and is nonrefundable.\n(c) The fee for processing a request for the replacement of a birth record for all events, except when filing a recognition of parentage pursuant to section 257.73, subdivision 1, is $40. The fee is payable at the time of application and is nonrefundable.\n(d) The fee for administrative review and processing of a request for the filing of a delayed registration of birth, stillbirth, or death is $40. The fee is payable at the time of application and is nonrefundable.\n(e) The fee for administrative review and processing of a request for the amendment of any vital record is $40. The fee is payable at the time of application and is nonrefundable.\n(f) The fee for administrative review and processing of a request for the verification of information from vital records is $9 when the applicant furnishes the specific information to locate the vital record. When the applicant does not furnish specific information, the fee is $20 per hour for staff time expended. Specific information includes the correct date of the event and the correct name of the subject of the record. Fees charged shall approximate the costs incurred in searching and copying the vital records. The fee is payable at the time of application and is nonrefundable.\n(g) The fee for administrative review and processing of a request for the issuance of a copy of any document on file pertaining to a vital record or statement that a related document cannot be found is $9. The fee is payable at the time of application and is nonrefundable.\nFees collected under this section by the state registrar shall be deposited in the state treasury and credited to the state government special revenue fund.\n(a) In addition to any fee prescribed under subdivision 1, there shall be a nonrefundable surcharge of $3 for each certified birth or stillbirth record and for a certification that the vital record cannot be found. The state registrar or local issuance office shall forward this amount to the commissioner of management and budget each month following the collection of the surcharge for deposit into the account for the children's trust fund for the prevention of child abuse established under section 142A.412. This surcharge shall not be charged under those circumstances in which no fee for a certified birth or stillbirth record is permitted under subdivision 1, paragraph (b). Upon certification by the commissioner of management and budget that the assets in that fund exceed $20,000,000, this surcharge shall be discontinued.\n(b) In addition to any fee prescribed under subdivision 1, there shall be a nonrefundable surcharge of $10 for each certified birth record. The state registrar or local issuance office shall forward this amount to the commissioner of management and budget each month following the collection of the surcharge for deposit in the general fund.\nIn addition to any fee prescribed under subdivision 1, there is a nonrefundable surcharge of $4 for each certified and noncertified birth, stillbirth, or death record, and for a certification that the record cannot be found. The local issuance office or state registrar shall forward this amount to the commissioner of management and budget each month following the collection of the surcharge to be deposited into the state government special revenue fund.\nA fee for the electronic verification or electronic certification of a vital event, when the information being verified or certified is obtained from a certified birth or death record, shall be established through contractual or interagency agreements.\nNotwithstanding subdivision 1, alternative payment methods may be approved and implemented by the state registrar or a local issuance office.\nThe state registrar may charge and permit agents to charge a convenience fee and a transaction fee for electronic transactions and transactions by telephone or Internet, as well as the fees established under subdivisions 1 to 4. The convenience fee may not exceed three percent of the cost of the charges for payment. The state registrar may permit agents to charge and retain a transaction fee as payment agreed upon under contract. When an electronic convenience fee or transaction fee is charged, the agent charging the fee is required to post information on their web page informing individuals of the fee. The information must be near the point of payment, clearly visible, include the amount of the fee, and state: \"This contracted agent is allowed by state law to charge a convenience fee and transaction fee for this electronic transaction.\"\nA subject of a birth record who is a homeless youth shall not be charged any of the fees specified in this section for a certified birth record or statement of no vital record found under section 144.2255.",
	"repealed": false
}