{
	"id": "90.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.01",
	"title": "90.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is indicated, the following terms, for the purposes of this chapter shall have the meanings ascribed to them.\n\"Affiliate\" means a person who:\n(1) controls, is controlled by, or is under common control with any other person, including, without limitation, a partner, business entity with common ownership, or principal of any business entity or a subsidiary, parent company, or holding company of any person; or\n(2) bids as a representative for another person.\n\"Department\" means the Department of Natural Resources of the state of Minnesota.\n\"Commissioner\" means the commissioner of natural resources or agents thereof.\n\"Scaler\" means a qualified bonded person designated by the commissioner to measure timber and cut forest products.\n\"State appraiser\" means an employee of the department designated by the commissioner to appraise state lands, which includes, but is not limited to, timber and other forest resource products, for volume, quality, and value.\n\"Timber\" means trees, shrubs, or woody plants that will produce forest products of value whether standing or down, and including but not limited to logs, sawlogs, posts, poles, bolts, pulpwood, cordwood, fuelwood, woody biomass, lumber, and woody decorative material.\n\"Permit\" means the written authorization of the commissioner to cut timber on state lands.\n\"Permit holder\" means the person or affiliate of the person who is the signatory of a permit to cut timber on state lands.\n[Repealed, 2005 c 141 s 14]\n\"Forestry administrative area\" means the smallest geographic subdivision of the state designated by the commissioner for the purposes of supervising forestry employees and directing practices and programs.\n\"Effective permit\" means a permit for which the commissioner has on file full or partial security as required by section 90.161 or 90.162 or, in the case of permits issued according to section 90.191 or 90.195, the commissioner has received a down payment equal to the full appraised value.\n\"Responsible bidder\" means a person or affiliate of a person who is financially responsible; demonstrates the judgment, skill, ability, capacity, and integrity requisite and necessary to perform according to the terms of a permit issued under this chapter; and is not currently debarred by a government entity for any cause.\n\"Special forest products\" means woody and herbaceous plants, plant parts, seeds, fungus, soil, gravel, and forest substrate for consumption, decoration, or medicine or for any other specialty use.",
	"repealed": false
}