{
	"id": "245.4875",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4875",
	"title": "245.4875 LOCAL SERVICE DELIVERY SYSTEM.",
	"text": "The county board in each county is responsible for using all available resources to develop and coordinate a system of locally available and affordable children's mental health services. The county board may provide some or all of the children's mental health services and activities specified in subdivision 2 directly through a county agency or under contracts with other individuals or agencies. A county or counties may enter into an agreement with a regional treatment center under section 246.57 to enable the county or counties to provide the treatment services in subdivision 2. Services provided through an agreement between a county and a regional treatment center must meet the same requirements as services from other service providers.\nThe children's mental health service system developed by each county board must include the following services:\n(1) education and prevention services according to section 245.4877;\n(2) mental health identification and intervention services according to section 245.4878;\n(3) emergency services according to section 245.4879;\n(4) outpatient services according to section 245.488;\n(5) family community support services according to section 245.4881;\n(6) day treatment services according to section 245.4884, subdivision 2;\n(7) residential treatment services according to section 245.4882;\n(8) acute care hospital inpatient treatment services according to section 245.4883;\n(9) screening according to section 245.4885;\n(10) case management according to section 245.4881;\n(11) therapeutic support of foster care according to section 245.4884, subdivision 4;\n(12) professional home-based family treatment according to section 245.4884, subdivision 4; and\n(13) mental health crisis services according to section 245.488, subdivision 3.\n[Repealed, 2014 c 262 art 3 s 18]\nTo efficiently provide the children's mental health services required by sections 245.487 to 245.4889, counties are encouraged to join with one or more county boards to establish a multicounty local children's mental health authority under the Joint Powers Act, section 471.59, the Human Services Act, sections 402.01 to 402.10, community mental health center provisions, section 245.62, or enter into multicounty mental health agreements. Participating county boards shall establish acceptable ways of apportioning the cost of the services.\n(a) By October 1, 1989, the county board, individually or in conjunction with other county boards, shall establish a local children's mental health advisory council or children's mental health subcommittee of the existing local mental health advisory council or shall include persons on its existing mental health advisory council who are representatives of children's mental health interests. The following individuals must serve on the local children's mental health advisory council, the children's mental health subcommittee of an existing local mental health advisory council, or be included on an existing mental health advisory council: (1) at least one person who was in a mental health program as a child or adolescent; (2) at least one parent of a child or adolescent with severe emotional disturbance; (3) one children's mental health professional; (4) representatives of minority populations of significant size residing in the county; (5) a representative of the children's mental health local coordinating council; and (6) one family community support services program representative.\n(b) The local children's mental health advisory council or children's mental health subcommittee of an existing advisory council shall seek input from parents, former consumers, providers, and others about the needs of children with emotional disturbance in the local area and services needed by families of these children, and shall meet monthly, unless otherwise determined by the council or subcommittee, but not less than quarterly, to review, evaluate, and make recommendations regarding the local children's mental health system. Annually, the local children's mental health advisory council or children's mental health subcommittee of the existing local mental health advisory council shall:\n(1) arrange for input from the local system of care providers regarding coordination of care between the services;\n(2) identify for the county board the individuals, providers, agencies, and associations as specified in section 245.4877, clause (2); and\n(3) provide to the county board a report of unmet mental health needs of children residing in the county.\n(c) The county board shall consider the advice of its local children's mental health advisory council or children's mental health subcommittee of the existing local mental health advisory council in carrying out its authorities and responsibilities.\n[Repealed, 2014 c 262 art 3 s 18]\n[Repealed, 2014 c 262 art 3 s 18]\nThe county board may continue to provide mental health services as defined in sections 245.487 to 245.4889 to persons over 18 years of age, but under 21 years of age, if the person was receiving case management or family community support services prior to age 18, and if one of the following conditions is met:\n(1) the person is receiving special education services through the local school district;\n(2) it is in the best interest of the person to continue services defined in sections 245.487 to 245.4889; or\n(3) the person is requesting services and the services are medically necessary.",
	"repealed": false
}