{
	"id": "245C.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.30",
	"title": "245C.30 VARIANCE FOR A DISQUALIFIED INDIVIDUAL.",
	"text": "(a) Except for any disqualification under section 245C.15, subdivision 1, when the commissioner has not set aside a background study subject's disqualification, and there are conditions under which the disqualified individual may provide direct contact services or have access to people receiving services that minimize the risk of harm to people receiving services, the commissioner may grant a time-limited variance to a license holder or license-exempt child care center certification holder.\n(b) The variance shall state the reason for the disqualification, the services that may be provided by the disqualified individual, and the conditions with which the license holder, license-exempt child care center certification holder, or applicant must comply for the variance to remain in effect.\n(c) Except for programs licensed to provide family child care, foster care for children in the provider's own home, or foster care or day care services for adults in the provider's own home, the variance must be requested by the license holder or license-exempt child care center certification holder.\nMS 2022 [Repealed, 2023 c 70 art 7 s 47]\nFor an individual seeking a child foster care license who is a relative of the child, the commissioner shall consider the importance of maintaining the child's relationship with relatives as an additional significant factor in determining whether the individual should be granted a variance.\n(a) The commissioner may not grant a variance for a disqualified individual unless the applicant, license-exempt child care center certification holder, or license holder requests the variance and the disqualified individual provides written consent for the commissioner to disclose to the applicant, license-exempt child care center certification holder, or license holder the reason for the disqualification.\n(b) This subdivision does not apply to programs licensed to provide family child care for children, foster care for children in the provider's own home, or foster care or day care services for adults in the provider's own home.\nWhen a license holder or license-exempt child care center certification holder permits a disqualified individual to provide any services for which the subject is disqualified without complying with the conditions of the variance, the commissioner may terminate the variance effective immediately and subject the license holder to a licensing action under sections 245A.06 and 245A.07 or a license-exempt child care center certification holder to an action under sections 142C.06 and 142C.07.\nThe commissioner may terminate a variance for a disqualified individual at any time for cause.\nThe commissioner's decision to grant or deny a variance is final and not subject to appeal under the provisions of chapter 14.",
	"repealed": false
}