{
	"id": "317A.113",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.113",
	"title": "317A.113 PRIVATE FOUNDATIONS; PROVISIONS CONSIDERED CONTAINED IN ARTICLES.",
	"text": "The articles of incorporation of a corporation that is a private foundation as defined in section 509(a) of the Internal Revenue Code of 1986 and an instrument governing the use, retention, or disposition by the corporation of its income or property must contain the provisions contained in this section. If the articles and instrument do not contain these provisions, they are considered to have incorporated the language in clauses (1) to (5) with the same effect as though the language was set forth verbatim. Except as provided in subdivision 2, these provisions govern the corporation as to the use, retention, and disposition of its income and property regardless of provisions of the articles or instrument or other law of this state to the contrary:\n(1) the corporation shall distribute for each of its taxable years amounts at least sufficient to avoid liability for the tax imposed by section 4942(a) of the Internal Revenue Code of 1986;\n(2) the corporation may not engage in an act of \"self-dealing\" as defined in section 4941(d) of the Internal Revenue Code of 1986 that would give rise to liability for the tax imposed by section 4941(a) of the Internal Revenue Code of 1986;\n(3) the corporation may not retain \"excess business holdings\" as defined in section 4943(c) of the Internal Revenue Code of 1986 that would give rise to liability for the tax imposed by section 4943(a) of the Internal Revenue Code of 1986;\n(4) the corporation may not make investments that would jeopardize the carrying out of the exempt purposes of the corporation, within the meaning of section 4944 of the Internal Revenue Code of 1986, so as to give rise to liability for the tax imposed by section 4944(a) of the Internal Revenue Code of 1986; and\n(5) the corporation may not make a \"taxable expenditure\" as defined in section 4945(d) of the Internal Revenue Code of 1986 that would give rise to liability for the tax imposed by section 4945(a) of the Internal Revenue Code of 1986.\nSubdivision 1 does not apply to a corporation if a court of competent jurisdiction determines that the application would be contrary to the terms of an instrument described in subdivision 1 and that the instrument may not properly be changed to conform to subdivision 1.\nA reference in subdivision 1 to a particular section of the Internal Revenue Code of 1986 includes the corresponding provision of a future United States Internal Revenue law.\nThis section applies to all corporations that could be governed by this chapter, notwithstanding sections 317A.021 and 317A.051.\nThis section does not impair the rights and powers of the attorney general or the courts of this state with respect to a corporation.",
	"repealed": false
}