{
	"id": "206.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/206.58",
	"title": "206.58 AUTHORIZATION FOR USE.",
	"text": "(a) The governing body of a municipality, at a regular meeting or at a special meeting called for the purpose, may provide for the use of an electronic voting system in one or more precincts and at all elections in the precincts, subject to approval by the county auditor. Once a municipality has adopted the use of an electronic voting system in one or more precincts, the municipality must continue to use an electronic voting system for state elections in those precincts. The governing body must disseminate information to the public about the use of a new voting system at least 60 days prior to the election and must provide for instruction of voters with a demonstration voting system in a public place for the six weeks immediately prior to the first election at which the new voting system will be used.\n(b) A municipality must not adopt or use a system unless it has been approved by the secretary of state pursuant to section 206.57.\nThe governing body of a municipality may provide for the experimental use of an electronic voting system in one or more precincts without formal adoption of the system. Use of the system at an election is as valid for all purposes as if the system had been permanently adopted.\nIf the governing body of a municipality decides to use an electronic voting system, it shall, at a regular or special meeting held not less than 30 days before the election, prescribe suitable rules and instructions consistent with sections 206.55 to 206.90 for using the system and shall submit the rules and instructions to the secretary of state for approval. When approved, a printed copy of the rules and instructions must be posted prominently in the polling place and must remain open to inspection by the voters throughout election day.\n(a) The governing body of a county may provide for the use of an electronic voting system in one or more precincts of the county at all elections. Once a county has adopted the use of an electronic voting system in one or more precincts, the county must continue to use an electronic voting system for state elections in those precincts. The governing body of the municipality must give approval before an electronic voting system may be adopted or used in the municipality under the authority of this section.\n(b) A county must not adopt or use a system unless it has been approved by the secretary of state pursuant to section 206.57.\nIf a municipality adopts the use of an electronic voting system, the municipal clerk shall certify to the secretary of state within 30 days from the date of adoption that an electronic voting system will be used in the municipality and the date when use will commence.",
	"repealed": false
}