{
	"id": "570.026",
	"url": "https://www.revisor.mn.gov/statutes/cite/570.026",
	"title": "570.026 ATTACHMENT AFTER NOTICE AND HEARING.",
	"text": "A claimant seeking to obtain an order of attachment in other than extraordinary circumstances shall proceed by motion. The motion shall be accompanied by an affidavit setting forth in detail:\n(1) the basis and amount of the claim in the civil action; and\n(2) the facts which constitute one or more of the grounds for attachment as specified in section 570.02.\nThe claimant's motion to obtain an order of attachment together with the claimant's affidavit and notice of hearing shall be served in the manner prescribed for service of a summons in a civil action in district court unless that service is impracticable or would be ineffective and the court prescribes an alternative method of service calculated to provide actual notice to the respondent. If the respondent has already appeared in the action, the motion shall be served in the manner prescribed for service of pleadings subsequent to the summons. The date of hearing shall be fixed in accordance with rule 6 of the Minnesota Rules of Civil Procedure, unless a different date is fixed by order of the court.\nThe notice of hearing served upon the respondent shall be signed by the claimant or the attorney for the claimant and shall provide, at a minimum, the following information in substantially the following language:\nNOTICE OF HEARING\nTO: (the respondent)\nA hearing will be held (insert place) on (insert date) at (insert time) to determine whether the sheriff shall seize nonexempt property belonging to you to secure a judgment that may be entered against you.\nYou may attend the court hearing alone or with an attorney. After you have presented your side of the matter, the court will decide what should be done with your property until the lawsuit which has been commenced against you is finally decided.\nIf the court directs the sheriff to seize and secure the property while the lawsuit is pending, you may still keep the property until the lawsuit is decided if you file a bond in an amount set by the court.\nIF YOU DO NOT ATTEND THIS HEARING, THE COURT MAY ORDER YOUR NONEXEMPT PROPERTY TO BE SEIZED.\nEXEMPTION NOTICE\nSome of your property is exempt and cannot be attached. The following is a list of some of the more common exemptions. It is not complete and is subject to section 550.37, and other state and federal laws. If you have questions about an exemption you should obtain competent legal advice.\n1. A homestead or the proceeds from the sale of a homestead.\n2. Household furniture, appliances, phonographs, radios, and televisions up to a total current value of $4,500 at the time of attachment.\n3. A manufactured (mobile) home used as your home.\n4. One motor vehicle currently worth less than $2,000 after deducting any security interests.\n5. Farm machinery used by someone principally engaged in farming, or tools, machines, or office furniture used in your business or trade. This exemption is limited to $5,000.\n6. Relief based on need. This includes Minnesota Family Investment Program (MFIP), Emergency Assistance (EA), Work First Program, Supplemental Security Income, Minnesota Supplemental Assistance, and General Assistance.\n7. Social Security benefits.\n8. Unemployment Benefits, workers' compensation, or veterans' benefits.\n9. An accident disability or retirement pension or annuity.\n10. Life insurance proceeds or the earnings of your minor child and any child support paid to you.\n11. Money from a claim for damage or destruction of exempt property (such as household goods, farm tools, business equipment, a manufactured (mobile) home, or a car).\nAn order for attachment may be issued only if the claimant has demonstrated the probability of success on the merits, and the claimant has demonstrated facts that show the existence of at least one of the grounds stated in section 570.02. However, even if those standards are met, the order may not be issued if:\n(1) the circumstances do not constitute a risk to collectibility of any judgment that may be entered; or\n(2)(i) respondent has raised a defense to the merits of the claimant's claim or has raised a counterclaim in an amount equal to or greater than the claim and the defense or counterclaim is not frivolous; and\n(ii) the interests of the respondent cannot be adequately protected by a bond filed by the claimant pursuant to section 570.041 if property is attached; and\n(iii) the harm suffered by the respondent as a result of seizure would be greater than the harm which would be suffered by the claimant if property is not attached.\nIf the claimant makes the showing prescribed by subdivision 3 but the court nevertheless determines that an order of attachment should not be issued for the reasons set forth in subdivision 3, clause (2), the court shall enter a further order protecting the rights of the claimant to the extent possible. The order may require that the respondent post a bond in an amount set by the court, that the respondent make the property available for inspection from time to time, that the respondent be restrained from certain activities, including, but not limited to, selling, disposing, or otherwise encumbering property, or any other provision the court may deem appropriate.\nAn order requiring seizure of property may be stayed up to three days to allow the respondent time to post a bond.",
	"repealed": false
}