{
	"id": "16D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/16D.02",
	"title": "16D.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Commissioner\" means the commissioner of revenue.\n\"Debt\" means an amount owed to the state directly, or through a state agency, on account of a fee, duty, lease, direct loan, loan insured or guaranteed by the state, rent, service, sale of real or personal property, overpayment, fine, assessment, penalty, restitution, damages, interest, tax, bail bond, forfeiture, reimbursement, liability owed, an assignment to the state including assignments under section 518A.81, the Social Security Act, or other state or federal law, recovery of costs incurred by the state, or any other source of indebtedness to the state. Debt also includes amounts owed to individuals as a result of civil, criminal, or administrative action brought by the state or a state agency pursuant to its statutory authority or for which the state or state agency acts in a fiduciary capacity in providing collection services in accordance with the regulations adopted under the Social Security Act at Code of Federal Regulations, title 45, section 302.33. When the commissioner provides collection services to a referring agency, debt also includes an amount owed to the courts, local government units, Minnesota state colleges and universities governed by the Board of Trustees of the Minnesota State Colleges and Universities, or University of Minnesota.\n\"Debtor\" means an individual, corporation, partnership, an unincorporated association, a limited liability company, a trust, an estate, or any other public or private entity, including a state, local, or federal government, or an Indian tribe, that is liable for a debt or against whom there is a claim for a debt.\n[Repealed, 2014 c 308 art 9 s 94]\n\"Referring agency\" means a state agency, local government unit, Minnesota state colleges and universities governed by the Board of Trustees of the Minnesota State Colleges and Universities, University of Minnesota, or a court, that has entered into an agreement with the commissioner to refer debts to the commissioner for collection.\n\"State agency\" means a state office, officer, board, commission, bureau, division, department, authority, agency, public corporation, or other unit of state government.\n[Repealed, 2014 c 308 art 9 s 94]",
	"repealed": false
}