{
	"id": "580.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.07",
	"title": "580.07 POSTPONEMENT.",
	"text": "(a) The sale may be postponed, from time to time, by the party conducting the foreclosure. The party requesting the postponement must, at the party's expense:\n(1) publish, only once, a notice of the postponement and the rescheduled date of the sale, if known, as soon as practicable, in the newspaper in which the notice under section 580.03 was published; and\n(2) send by first class mail to the occupant, postmarked within three business days of the postponed sale, notice:\n(i) of the postponement; and\n(ii) if known, of the rescheduled date of the sale and the date on or before which the mortgagor must vacate the property if the sheriff's sale is not further postponed, the mortgage is not reinstated under section 580.30, the property is not redeemed under section 580.23, or the redemption period is not reduced under section 582.032. The notice must state that the time to vacate the property is 11:59 p.m. on the specified date.\n(b) If the rescheduled date of the sale is not known at the time of the initial publication and notice to the occupant of postponement, the foreclosing party must, at its expense if and when a new date of sale is scheduled:\n(1) publish, only once, notice of the rescheduled date of the sale, as soon as practicable, in the newspaper in which the notice under section 580.03 and the notice of postponement under paragraph (a) was published; and\n(2) send by first class mail to the occupant, postmarked within ten days of the rescheduled sale, notice:\n(i) of the date of the rescheduled sale; and\n(ii) of the date on or before which the mortgagor must vacate the property if the mortgage is not reinstated under section 580.30 or the property redeemed under section 580.23. The notice must state that the time to vacate the property is 11:59 p.m. on the specified date.\n(a) If all or a part of the property to be sold is classified as homestead under section 273.124 and contains one to four dwelling units, the mortgagor or owner may, in the manner provided in this subdivision, postpone the sale to the first date that is not a Saturday, Sunday, or legal holiday and is:\n(1) five months after the originally scheduled date of sale if the original redemption period was six months under section 580.23, subdivision 1; or\n(2) 11 months after the originally scheduled date of sale if the original redemption period was 12 months under section 580.23, subdivision 2. To postpone a foreclosure sale pursuant to this subdivision, at any time after the first publication of the notice of mortgage foreclosure sale under section 580.03 but at least 15 days prior to the scheduled sale date specified in that notice, the mortgagor shall: (1) execute a sworn affidavit in the form set forth in subdivision 3, (2) record the affidavit in the office of each county recorder and registrar of titles where the mortgage was recorded, and (3) file with the sheriff conducting the sale and deliver to the attorney foreclosing the mortgage a copy of the recorded affidavit, showing the date and office in which the affidavit was recorded. Recording of the affidavit and postponement of the foreclosure sale pursuant to this subdivision shall automatically reduce the mortgagor's redemption period under section 580.23 to five weeks. The postponement of a foreclosure sale pursuant to this subdivision does not require any change in the contents of the notice of sale, service of the notice of sale if the occupant was served with the notice of sale prior to postponement under this subdivision, or publication of the notice of sale if publication was commenced prior to postponement under this subdivision, notwithstanding the service and publication time periods specified in section 580.03, but the sheriff's certificate of sale shall indicate the actual date of the foreclosure sale and the actual length of the mortgagor's redemption period. No notice of postponement need be published. An affidavit complying with subdivision 3 shall be prima facie evidence of the facts stated therein, and shall be entitled to be recorded. The right to postpone a foreclosure sale pursuant to this subdivision may be exercised only once, regardless whether the mortgagor reinstates the mortgage prior to the postponed mortgage foreclosure sale.\n(b) If the automatic stay under United States Code, title 11, section 362, applies to the mortgage foreclosure after a mortgagor or owner requests postponement of the sheriff's sale under this section, then when the automatic stay is no longer applicable, the mortgagor's or owner's election to shorten the redemption period to five weeks under this section remains applicable to the mortgage foreclosure.\n(c) Except for the circumstances set forth in paragraph (b), this section does not reduce the mortgagor's redemption period under section 580.23 for any subsequent foreclosure of the mortgage.\nThe affidavit referred to in subdivision 2 shall be in substantially the following form and shall contain all of the following information.\n...................................................................................... (whether one or more, \"Owner\"), being first duly sworn on oath, states as follows:\n1. (He is) (She is) (They are) the owner(s) or mortgagor(s) of the real property (the \"Property\") situated in ................... (Name of) County, Minnesota, legally described in the attached published Notice of Mortgage Foreclosure Sale (the \"Notice\"), and make this affidavit for the purpose of postponing the foreclosure sale of the Property pursuant to Minnesota Statutes, section 580.07, subdivision 2, for five months from the date scheduled in the attached Notice if the original redemption period is six months, or for 11 months if the original redemption period is 12 months.\n2. The Property is classified as homestead under Minnesota Statutes, section 273.124, is occupied by Owner as a homestead, and is improved with not more than four dwelling units.\n3. Owner has elected to shorten Owner's redemption period from any foreclosure sale of the Property to five weeks in exchange for the postponement of the foreclosure sale for five months if the original redemption period was six months, or for 11 months if the original redemption period was 12 months.\n..................................................................................... (signature(s) of owner)\nSigned and sworn to (or affirmed) before me on .................. (date) by ................................. (name(s) of person(s) making statement).\n..................................................................................... (signature of notary public)\nNotary Public",
	"repealed": false
}