{
	"id": "256B.0917",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0917",
	"title": "256B.0917 ELDERCARE DEVELOPMENT PARTNERSHIPS.",
	"text": "[Repealed, 2013 c 108 art 2 s 45]\nMS 2022 [Repealed, 2023 c 61 art 2 s 43]\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Eldercare development partnership\" means a team of representatives of county social service and public health agencies, the area agency on aging, local nursing home providers, local home care providers, and other appropriate home and community-based providers in the area agency's planning and service area.\n(c) \"Long-term services and supports\" means any service available under the elderly waiver program or alternative care grant programs, nursing facility services, transportation services, caregiver support and respite care services, and other home and community-based services identified as necessary either to maintain lifestyle choices for older adults or to support them to remain in their own home.\n(d) \"Older adult\" refers to an individual who is 65 years of age or older.\nThe commissioner of human services shall select and contract with eldercare development partnerships sufficient to provide statewide availability of service development and technical assistance using a request for proposals process. Eldercare development partnerships shall:\n(1) develop a local long-term services and supports strategy consistent with state goals and objectives;\n(2) identify and use existing local skills, knowledge, and relationships, and build on these assets;\n(3) coordinate planning for funds to provide services to older adults, including funds received under title III of the Older Americans Act, title XX of the Social Security Act, and the Local Public Health Act;\n(4) target service development and technical assistance where nursing facility closures have occurred or are occurring or in areas where service needs have been identified through activities under section 144A.351;\n(5) provide sufficient staff for development and technical support in its designated area; and\n(6) designate a single public or nonprofit member of the eldercare development partnerships to apply grant funding and manage the project.\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\nMS 2022 [Repealed, 2023 c 61 art 2 s 43]\n[Repealed, 2013 c 108 art 2 s 45]\nMS 2022 [Repealed, 2023 c 61 art 2 s 43]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\nMS 2022 [Repealed, 2023 c 61 art 2 s 43]\n[Repealed, 2013 c 108 art 7 s 64]",
	"repealed": false
}