{
	"id": "97B.066",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.066",
	"title": "97B.066 CHEMICAL TESTING.",
	"text": "(a) A person who takes wild animals with a bow or firearm in this state or on a boundary water of this state is required, subject to the provisions of this section, to take or submit to a test of the person's blood, breath, or urine for the purpose of determining the presence and amount of alcohol or a controlled substance. The test shall be administered at the direction of an officer authorized to make arrests under section 97B.065, subdivision 2.\n(b) Taking or submitting to a test of the person's breath is mandatory when requested by an officer who has probable cause to believe the person was hunting in violation of section 97B.065, subdivision 1, paragraph (a) or (c), and one of the following conditions exists:\n(1) the person has been lawfully placed under arrest for violating section 97B.065, subdivision 1, paragraph (a) or (c);\n(2) the person has been involved while hunting in an accident resulting in property damage, personal injury, or death;\n(3) the person has refused to take the preliminary screening test provided for in section 97B.065, subdivision 3; or\n(4) the screening test was administered and indicated an alcohol concentration of 0.08 or more.\n(c) Taking or submitting to a test of the person's blood or urine is mandatory when requested by a peace officer under the conditions described in paragraph (b) if the officer is acting pursuant to a search warrant under sections 626.04 to 626.18.\nNotwithstanding any contrary provision in this section, a blood or urine test may be conducted only pursuant to a search warrant under sections 626.04 to 626.18, or a judicially recognized exception to the search warrant requirement. When, under the provisions of this section, a search warrant is required for a blood or urine test, that requirement is met if a judicially recognized exception to the search warrant is applicable.\n(a) If a person refuses to take a test required under subdivision 1, none must be given, but the officer authorized to make arrests under section 97B.065, subdivision 2, shall report the refusal to the commissioner of natural resources and to the authority having responsibility for prosecution of misdemeanor offenses for the jurisdiction in which the incident occurred that gave rise to the test demand and refusal.\n(b) On certification by the officer that probable cause existed to believe the person had been hunting while under the influence of alcohol or a controlled substance, that in the case of a blood or urine test the officer was acting pursuant to a search warrant, and that the person refused to submit to testing, the commissioner shall impose a civil penalty of $500 and shall prohibit the person from hunting for one year.\n(c) On behalf of the commissioner, an officer requiring a test or directing the administration of a test shall serve on a person who refused to permit a test immediate notice of intention to prohibit the person from hunting, and to impose the civil penalty set forth in this subdivision. If the officer fails to serve a notice of intent to suspend hunting privileges, the commissioner may notify the person by certified mail to the address on the license of the person. The notice must advise the person of the right to obtain administrative and judicial review as provided in this section. The prohibition imposed by the commissioner takes effect ten days after receipt of the notice. The civil penalty is imposed 30 days after receipt of the notice or upon return of the certified mail to the commissioner, and must be paid within 30 days of imposition.\n(d) A person who hunts during the period the person is prohibited from hunting as provided under paragraphs (b) and (c) is guilty of a misdemeanor.\nAt the time a test is requested, the person must be informed that:\n(1) Minnesota law requires a person to take a test to determine if the person is under the influence of alcohol or a controlled substance;\n(2) if the person refuses to take the test, the person is subject to a civil penalty of $500 and is prohibited for a one-year period from hunting, as provided under subdivision 2; and\n(3) that, in the case of a breath test, the person has the right to consult with an attorney, but that this right is limited to the extent it cannot unreasonably delay administration of the test or the person will be deemed to have refused the test.\n(a) A peace officer who directs a test pursuant to this section may direct a breath test.\n(b) A peace officer, acting pursuant to a search warrant, may direct a blood or urine test as provided in the warrant. If the warrant authorizes either a blood or urine test, the officer may direct whether the test is of blood or urine. If the person to whom the test is directed objects to the test, the officer shall offer the person an alternative test of either blood or urine.\n(c) If there is probable cause to believe there is impairment by a controlled substance that is not subject to testing by a breath test, a blood or urine test may be required pursuant to a search warrant even after a breath test has been administered.\n(d) Action under this section may be taken against a person who refuses to take a blood test only if an alternative test was offered and action may be taken against a person who refuses to take a urine test only if an alternative test was offered.\nChemical tests administered under this section are governed by section 169A.51.\n[Repealed, 1Sp1997 c 2 s 69]\n(a) At any time during the period of prohibition or revocation imposed under this section, the person may request in writing a review of the order imposing sanctions under this section. If the person makes a request for administrative review within 30 days following receipt of a notice and order imposing sanctions, the request shall stay imposition of the civil penalty. Upon receiving the request for review, the commissioner or the commissioner's designee shall review the order, the evidence upon which the order was based, and other material information brought to the attention of the commissioner and determine whether sufficient cause exists to sustain the order.\n(b) Within 15 days after receiving the request, the commissioner shall issue a written report ordering that the prohibition, revocation, or civil penalty be either sustained or rescinded. The review provided in this subdivision is not subject to the contested case provisions of the Administrative Procedure Act under chapter 14. The availability of administrative review does not have an effect upon the availability of judicial review under this section.\n(a) Within 60 days following receipt of a notice and order imposing sanctions under this section, a person may petition the court for review. The petition must be filed with the district court administrator in the county where the incident occurred giving rise to the test demand and refusal, together with proof of service of a copy on the commissioner and the prosecuting authority for misdemeanor offenses for the jurisdiction in which the incident occurred. A responsive pleading is not required of the commissioner of natural resources, and court fees may not be charged for the appearance of the representative of the commissioner in the matter.\n(b) The petition must be captioned in the name of the person making the petition as petitioner and the commissioner as respondent. The petition must state specifically the grounds upon which the petitioner seeks rescission of the order imposing sanctions.\n(c) The filing of the petition does not stay the revocation or prohibition against hunting. However, the filing of a petition stays imposition of the civil penalty. The judicial review shall be conducted according to the Rules of Civil Procedure.\n(a) A hearing under this section must be before a district court judge in the county where the incident occurred which gave rise to the test demand and refusal. The hearing must be to the court and may be conducted at the same time as hearings upon pretrial motions in the criminal prosecution under section 97B.065. The hearing must be recorded. The commissioner must be represented by the prosecuting authority for misdemeanor offenses for the jurisdiction in which the incident occurred which gave rise to the test demand and refusal.\n(b) The hearing must be held at the earliest practicable date and in any event no later than 60 days following the filing of the petition for review. The reviewing court may order a temporary stay of the balance of the prohibition or revocation if the hearing has not been conducted within 60 days after filing of the petition, upon the application of the petitioner and upon terms the court deems proper.\n(c) The scope of the hearing must be limited to the issues of:\n(1) whether the officer had probable cause to believe that the person violated section 97B.065;\n(2) whether one of the conditions in subdivision 1 existed;\n(3) if the test involved blood or urine, whether a licensed peace officer applied for a search warrant in accordance with the requirements set forth in sections 626.04 to 626.18, and, if so, whether a neutral magistrate reviewed the application for the search warrant and determined there was probable cause to believe that the person violated section 97B.065, and whether the warrant and the process by which it was obtained was valid;\n(4) whether the person was informed as prescribed in subdivision 3; and\n(5) whether the person refused to submit to testing.\n(d) It is an affirmative defense for the petitioner to prove that, at the time of the refusal, the petitioner's refusal to permit the test was based upon reasonable grounds.\n(e) The court shall order that the prohibition or revocation be either sustained or rescinded and shall either sustain or rescind the civil penalty. The court shall forward a copy of the order to the commissioner.\nThe civil penalty imposed under subdivision 2 must be paid to the political subdivision that represents the commissioner on the petition for judicial review or, in the event that a petition is not filed, to the political subdivision that would have represented the commissioner had a petition been filed. If a person does not pay the civil penalty, the prohibition against hunting is automatically extended until the political subdivision reports to the commissioner in writing that the penalty has been paid.\n(a) If a person does not pay the civil penalty imposed under subdivision 2 within 30 days of the date it was imposed, the prosecuting authority representing the commissioner may petition the district court in the county where the incident occurred to file the order imposing the civil penalty as an order of the court.\n(b) Once entered, the order may be enforced in the same manner as a final judgment of the court. In addition to the penalty, attorney fees, costs, and interest may be assessed against any person who fails to pay the civil penalty.",
	"repealed": false
}