{
	"id": "148.5191",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.5191",
	"title": "148.5191 LICENSURE RENEWAL.",
	"text": "To renew licensure, an applicant for license renewal as a speech-language pathologist or audiologist must:\n(1) biennially complete a renewal application on a form provided by the commissioner and submit the biennial renewal fee;\n(2) meet the continuing education requirements of section 148.5193 and submit evidence of attending continuing education courses, as required in section 148.5193, subdivision 6; and\n(3) submit additional information if requested by the commissioner to clarify information presented in the renewal application. The information must be submitted within 30 days after the commissioner's request.\n[See Note.]\nTo renew licensure, an applicant for license renewal as a speech-language pathology assistant must:\n(1) biennially complete a renewal application on a form provided by the commissioner and submit the biennial renewal fee;\n(2) meet the continuing education requirements of section 148.5193, subdivision 1a, and submit evidence of attending continuing education courses, as required in section 148.5193, subdivision 1a; and\n(3) submit additional information if requested by the commissioner to clarify information presented in the renewal application. The information must be submitted within 30 days after the commissioner's request.\n[See Note.]\nAn application submitted after the renewal deadline date must be accompanied by a late fee as provided in section 148.5194, subdivision 4.\nLicensure renewal is on a biennial basis. At least 60 days before the licensure expiration date, the commissioner shall send out a renewal notice to the licensee's last known address. The notice shall include a renewal application and notice of fees required for renewal. If the licensee does not receive the renewal notice, the licensee is still required to meet the deadline for renewal to qualify for continuous licensure status.\nEach license, including a temporary license provided under section 148.5161, must state an expiration date. An application for licensure renewal must be received by the Department of Health or postmarked at least 30 days before the expiration date. If the postmark is illegible, the application shall be considered timely if received at least 21 days before the expiration date.\nWhen the commissioner establishes the renewal schedule for an applicant, licensee, or temporary licensee, if the period before the expiration date is less than two years, the fee shall be prorated.",
	"repealed": false
}