{
	"id": "253B.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.20",
	"title": "253B.20 DISCHARGE; ADMINISTRATIVE PROCEDURE.",
	"text": "When a committed person is discharged, provisionally discharged, or transferred to another treatment facility, state-operated treatment program, or community-based treatment program, or when the patient dies, is absent without authorization, or is returned, the treatment facility, state-operated treatment program, or community-based treatment program having custody of the patient shall notify the committing court, the county attorney, and the patient's attorney.\n(a) The state-operated treatment program shall make necessary arrangements at the expense of the state to insure that no patient is discharged or provisionally discharged without suitable clothing. The head of the state-operated treatment program shall, if necessary, provide the patient with a sufficient sum of money to secure transportation home, or to another destination of the patient's choice, if the destination is located within a reasonable distance of the state-operated treatment program.\n(b) The commissioner shall establish procedures by rule to help the patient receive all public assistance benefits provided by state or federal law to which the patient is entitled by residence and circumstances. The rule shall be uniformly applied in all counties. All counties shall provide temporary relief whenever necessary to meet the intent of this subdivision.\n(c) The commissioner and the executive board may adopt joint rules necessary to accomplish the requirements under paragraph (b).\nThe head of the treatment facility, state-operated treatment program, or community-based treatment program, upon the provisional discharge of any committed person, shall notify the designated agency before the patient leaves the facility or program. Whenever possible the notice shall be given at least one week before the patient is to leave the facility or program.\nPrior to the date of discharge or provisional discharge of any committed person, the designated agency of the county of financial responsibility, in cooperation with the head of the treatment facility, state-operated treatment program, or community-based treatment program, and the patient's mental health professional, if notified pursuant to subdivision 6, shall establish a continuing plan of aftercare services for the patient including a plan for medical and psychiatric treatment, nursing care, vocational assistance, and other assistance the patient needs. The designated agency shall provide case management services, supervise and assist the patient in finding employment, suitable shelter, and adequate medical and psychiatric treatment, and aid in the patient's readjustment to the community.\nIn establishing the plan for aftercare services the designated agency shall consult with persons or agencies, including any public health nurse as defined in section 145A.02, subdivision 18, and vocational rehabilitation personnel, to insure adequate planning and periodic review for aftercare services.\nThe head of the treatment facility, state-operated treatment program, or community-based treatment program shall notify the mental health professional of any committed person at the time of the patient's discharge or provisional discharge, unless the patient objects to the notice.\nMS 2018 [Repealed, 1Sp2020 c 2 art 6 s 124]",
	"repealed": false
}