{
	"id": "134A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/134A.10",
	"title": "134A.10 LIBRARY FEES COLLECTED IN ALL OTHER COUNTIES.",
	"text": "In counties other than Hennepin and Ramsey, the court administrator shall collect in each civil suit, action or proceeding filed in the district, county or county municipal and conciliation courts of the county, in the manner in which other fees are collected, a law library fee from:\n(a) The plaintiff, petitioner or other person instituting the suit, action or proceeding, at the time of the filing of the first paper; and\n(b) Each defendant, respondent, intervenor or other party who appears, either separately or jointly, to be collected at the time of the filing of the first paper by the defendant, respondent, intervenor or other party, or at the time when the party's appearance is entered in the case.\nThe judge of the district court or the registrar of probate or the court administrator shall collect a law library fee from the petitioner instituting proceedings for supervised and unsupervised guardianship, conservatorship, descent, formal and informal probate, trusts and summary assignments at the time of the filing of the petition. The disbursement shall be an item of administration of the estate, entitling the petitioner to reimbursement out of the estate.\n(a) The judge of district court may, upon the recommendation of the board of trustees and by standing order, include in the costs or disbursements assessed against a defendant convicted in the district court of the violation of any statute or municipal ordinance, in all petty misdemeanor cases and criminal prosecutions in which, upon conviction, the defendant may be subject to the payment of the costs or disbursements in addition to a fine or other penalty a county law library fee. When a defendant is convicted of more than one offense in a case, the county law library fee shall be imposed only once in that case. The item of costs or disbursements may not be assessed for any offense committed prior to the establishment of the county law library.\n(b) Beginning August 1, 2025, the law library fee does not apply to citations issued pursuant to sections 169.06, subdivision 10, and 169.14, subdivision 13.\nThe law library board of trustees shall, with the approval of the board of commissioners, set the amount of the law library fee for civil and criminal matters, including petty misdemeanor cases, in the district and conciliation courts of the county. The fee shall be set on July 1 each year and remain in effect until changed. All law library fees shall be published in the State Register.",
	"repealed": false
}