{
	"id": "254A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/254A.03",
	"title": "254A.03 STATE AUTHORITY ON ALCOHOL AND DRUG ABUSE.",
	"text": "There is hereby created an Alcohol and Other Drug Abuse Section in the Department of Human Services. This section shall be headed by a director. The commissioner may place the director's position in the unclassified service if the position meets the criteria established in section 43A.08, subdivision 1a. The section shall:\n(1) conduct and foster basic research relating to the cause, prevention and methods of diagnosis, treatment and recovery of persons with substance misuse and substance use disorder;\n(2) coordinate and review all activities and programs of all the various state departments as they relate to problems associated with substance misuse and substance use disorder;\n(3) develop, demonstrate, and disseminate new methods and techniques for prevention, early intervention, treatment and recovery support for substance misuse and substance use disorder;\n(4) gather facts and information about substance misuse and substance use disorder, and about the efficiency and effectiveness of prevention, treatment, and recovery support services from all comprehensive programs, including programs approved or licensed by the commissioner of human services or the commissioner of health or accredited by the Joint Commission on Accreditation of Hospitals. The state authority is authorized to require information from comprehensive programs which is reasonable and necessary to fulfill these duties. When required information has been previously furnished to a state or local governmental agency, the state authority shall collect the information from the governmental agency. The state authority shall disseminate facts and summary information about problems associated with substance misuse and substance use disorder to public and private agencies, local governments, local and regional planning agencies, and the courts for guidance to and assistance in prevention, treatment and recovery support;\n(5) inform and educate the general public on substance misuse and substance use disorder;\n(6) serve as the state authority concerning substance misuse and substance use disorder by monitoring the conduct of diagnosis and referral services, research and comprehensive programs. The state authority shall submit a biennial report to the governor containing a description of public services delivery and recommendations concerning increase of coordination and quality of services, and decrease of service duplication and cost;\n(7) establish a state plan which shall set forth goals and priorities for a comprehensive continuum of care for substance misuse and substance use disorder for Minnesota. All state agencies operating substance misuse or substance use disorder programs or administering state or federal funds for such programs shall annually set their program goals and priorities in accordance with the state plan. Each state agency shall annually submit its plans and budgets to the state authority for review. The state authority shall certify whether proposed services comply with the comprehensive state plan and advise each state agency of review findings;\n(8) make contracts with and grants to public and private agencies and organizations, both profit and nonprofit, and individuals, using federal funds, and state funds as authorized to pay for costs of state administration, including evaluation, statewide programs and services, research and demonstration projects, and American Indian programs;\n(9) receive and administer money available for substance misuse and substance use disorder programs under the alcohol, drug abuse, and mental health services block grant, United States Code, title 42, sections 300X to 300X-9;\n(10) solicit and accept any gift of money or property for purposes of Laws 1973, chapter 572, and any grant of money, services, or property from the federal government, the state, any political subdivision thereof, or any private source;\n(11) with respect to substance misuse and substance use disorder programs serving the American Indian community, establish guidelines for the employment of personnel with considerable practical experience in substance misuse and substance use disorder, and understanding of social and cultural problems related to substance misuse and substance use disorder, in the American Indian community.\nThere is hereby created a section of American Indian programs, within the Alcohol and Drug Abuse Section of the Department of Human Services, to be headed by a special assistant for American Indian programs on substance misuse and substance use disorder and two assistants to that position. The section shall be staffed with all personnel necessary to fully administer programming for substance misuse and substance use disorder services for American Indians in the state. The special assistant position shall be filled by a person with considerable practical experience in and understanding of substance misuse and substance use disorder in the American Indian community, who shall be responsible to the director of the Alcohol and Drug Abuse Section created in subdivision 1 and shall be in the unclassified service. The special assistant shall meet and consult with the American Indian Advisory Council as described in section 254A.035 and serve as a liaison to the Minnesota Indian Affairs Council and tribes to report on the status of substance misuse and substance use disorder among American Indians in the state of Minnesota. The special assistant with the approval of the director shall:\n(1) administer funds appropriated for American Indian groups, organizations and reservations within the state for American Indian substance misuse and substance use disorder programs;\n(2) establish policies and procedures for such American Indian programs with the assistance of the American Indian Advisory Board; and\n(3) hire and supervise staff to assist in the administration of the American Indian program section within the Alcohol and Drug Abuse Section of the Department of Human Services.\n(a) An eligible vendor of comprehensive assessments under section 254B.05 may determine the appropriate level of substance use disorder treatment for a recipient of public assistance. The process for determining an individual's financial eligibility for the behavioral health fund or determining an individual's enrollment in or eligibility for a publicly subsidized health plan is not affected by the individual's choice to access a comprehensive assessment for placement.\n(b) The commissioner shall develop and implement a utilization review process for publicly funded treatment placements to monitor and review the clinical appropriateness and timeliness of all publicly funded placements in treatment.\n(c) If a screen result is positive for alcohol or substance misuse, a brief screening for alcohol or substance use disorder that is provided to a recipient of public assistance within a primary care clinic, hospital, or other medical setting or school setting establishes medical necessity and approval for an initial set of substance use disorder services identified in section 254B.05, subdivision 5. The initial set of services approved for a recipient whose screen result is positive may include any combination of up to four hours of individual or group substance use disorder treatment, two hours of substance use disorder treatment coordination, or two hours of substance use disorder peer support services provided by a qualified individual according to chapter 245G. A recipient must obtain an assessment pursuant to paragraph (a) to be approved for additional treatment services. A comprehensive assessment pursuant to section 245G.05 is not required to receive the initial set of services allowed under this subdivision. A positive screen result establishes eligibility for the initial set of services allowed under this subdivision.\n(d) An individual may choose to obtain a comprehensive assessment as provided in section 245G.05. Individuals obtaining a comprehensive assessment may access any enrolled provider that is licensed to provide the level of service authorized pursuant to section 254A.19, subdivision 3. If the individual is enrolled in a prepaid health plan, the individual must comply with any provider network requirements or limitations.",
	"repealed": false
}