{
	"id": "260B.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.245",
	"title": "260B.245 EFFECT OF JUVENILE COURT PROCEEDINGS.",
	"text": "(a) No adjudication upon the status of any child in the jurisdiction of the juvenile court shall operate to impose any of the civil disabilities imposed by conviction, nor shall any child be deemed a criminal by reason of this adjudication, nor shall this adjudication be deemed a conviction of crime, except as otherwise provided in this section or section 260B.255. An extended jurisdiction juvenile conviction shall be treated in the same manner as an adult felony criminal conviction for purposes of the Sentencing Guidelines. The disposition of the child or any evidence given by the child in the juvenile court shall not be admissible as evidence against the child in any case or proceeding in any other court, except that an adjudication may later be used to determine a proper sentence, nor shall the disposition or evidence disqualify the child in any future civil service examination, appointment, or application.\n(b) A person who was adjudicated delinquent for, or convicted as an extended jurisdiction juvenile of, a crime of violence as defined in section 624.712, subdivision 5, is not entitled to ship, transport, possess, or receive a firearm for the remainder of the person's lifetime. A person who has received a relief of disability under United States Code, title 18, section 925, or whose ability to possess firearms has been restored under section 609.165, subdivision 1d, is not subject to the restrictions of this subdivision.\nNothing contained in this section shall be construed to relate to subsequent proceedings in juvenile court, nor shall preclude the juvenile court, under circumstances other than those specifically prohibited in subdivision 1, from disclosing information to qualified persons if the court considers such disclosure to be in the best interests of the child or of the administration of justice.",
	"repealed": false
}