{
	"id": "290.067",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.067",
	"title": "290.067 DEPENDENT CARE CREDIT.",
	"text": "(a) A taxpayer may take as a credit against the tax due from the taxpayer and a spouse, if any, under this chapter an amount equal to the dependent care credit for which the taxpayer is eligible pursuant to the provisions of section 21 of the Internal Revenue Code except that in determining whether the child qualified as a dependent, income received as a Minnesota family investment program grant or allowance to or on behalf of the child must not be taken into account in determining whether the child received more than half of the child's support from the taxpayer.\n(b) If a child who has not attained the age of six years at the close of the taxable year is cared for at a licensed family day care home operated by the child's parent, the taxpayer is deemed to have paid employment-related expenses. If the child is 16 months old or younger at the close of the taxable year, the amount of expenses deemed to have been paid equals the maximum limit for one qualifying individual under section 21(c) and (d) of the Internal Revenue Code. If the child is older than 16 months of age but has not attained the age of six years at the close of the taxable year, the amount of expenses deemed to have been paid equals the amount the licensee would charge for the care of a child of the same age for the same number of hours of care.\n(c) If a taxpayer:\n(1) has a child who has not attained the age of one year at the close of the taxable year; and\n(2) does not participate in a dependent care assistance program as defined in section 129 of the Internal Revenue Code, in lieu of the actual employment related expenses paid for that child under paragraph (a) or the deemed amount under paragraph (b), the lesser of (i) the earned income of the taxpayer or (ii) the amount of the maximum limit for one qualifying individual under section 21(c) and (d) of the Internal Revenue Code will be deemed to be the employment related expense paid for that child. The earned income limitation of section 21(d) of the Internal Revenue Code shall not apply to this deemed amount. These deemed amounts apply regardless of whether any employment-related expenses have been paid.\n(d) If the taxpayer is not required and does not file a federal individual income tax return for the tax year, no credit is allowed for any amount paid to any person unless:\n(1) the name, address, and taxpayer identification number of the person are included on the return claiming the credit; or\n(2) if the person is an organization described in section 501(c)(3) of the Internal Revenue Code and exempt from tax under section 501(a) of the Internal Revenue Code, the name and address of the person are included on the return claiming the credit.\nIn the case of a failure to provide the information required under the preceding sentence, the preceding sentence does not apply if it is shown that the taxpayer exercised due diligence in attempting to provide the information required.\n(e) In the case of a nonresident or part-year resident, the credit determined under section 21 of the Internal Revenue Code must be allocated based on the ratio by which the earned income of the claimant and the claimant's spouse from Minnesota sources bears to the total earned income of the claimant and the claimant's spouse.\n(f) For residents of Minnesota, the subtractions for military pay under section 290.0132, subdivisions 11 and 12, are not considered \"earned income not subject to tax under this chapter.\"\n(g) For residents of Minnesota, the exclusion of combat pay under section 112 of the Internal Revenue Code is not considered \"earned income not subject to tax under this chapter.\"\n(h) For taxpayers with federal adjusted gross income in excess of $52,230, the credit is equal to the lesser of the credit otherwise calculated under this subdivision, or the amount equal to $600 minus five percent of federal adjusted gross income in excess of $52,230 for taxpayers with one qualifying individual, or $1,200 minus five percent of federal adjusted gross income in excess of $52,230 for taxpayers with two or more qualifying individuals, but in no case is the credit less than zero.\n[Repealed, 1Sp2017 c 1 art 1 s 44]\nMS 2016 [Repealed, 2018 c 182 art 1 s 109]\nThe commissioner shall annually adjust the dollar amount of the income threshold at which the maximum credit begins to be reduced under subdivision 1 as provided in section 270C.22. The statutory year is taxable year 2019.\nIf the amount of credit which a claimant would be eligible to receive pursuant to this subdivision exceeds the claimant's tax liability under this chapter, the excess amount of the credit shall be refunded to the claimant by the commissioner of revenue. The amount needed to pay the refunds required by this section is appropriated to the commissioner from the general fund.\nThe right to file a claim under this section shall be personal to the claimant and shall not survive death, but such right may be exercised on behalf of a claimant by the claimant's legal guardian or attorney-in-fact. When a claimant dies after having filed a timely claim the amount thereof shall be disbursed to another member of the household as determined by the commissioner of revenue. If the claimant was the only member of a household, the claim may be paid to the claimant's personal representative, but if neither is appointed and qualified within two years of the filing of the claim, the amount of the claim shall escheat to the state.\n[Repealed, 1990 c 480 art 1 s 45]\n[Repealed, 1994 c 587 art 1 s 25]",
	"repealed": false
}