{
	"id": "148.263",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.263",
	"title": "148.263 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of any conduct constituting grounds for discipline under sections 148.171 to 148.285 may report the alleged violation to the board.\nThe chief nursing executive or chief administrative officer of any hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state shall report to the board any action taken by the institution or organization or any of its administrators or committees to revoke, suspend, limit, or condition a nurse's privilege to practice in the institution, or as part of the organization, any denial of privileges, any dismissal from employment, or any other disciplinary action. The institution or organization shall also report the resignation of any nurse before the conclusion of any disciplinary proceeding, or before commencement of formal charges, but after the nurse had knowledge that formal charges were contemplated or in preparation. The reporting described by this subdivision is required only if the action pertains to grounds for disciplinary action under section 148.261.\nA person licensed by a health-related licensing board as defined in section 214.01, subdivision 2, shall report to the board personal knowledge of any conduct the person reasonably believes constitutes grounds for disciplinary action under sections 148.171 to 148.285 by any nurse including conduct indicating that the nurse may be incompetent, may have engaged in unprofessional or unethical conduct, or may be mentally or physically unable to engage safely in the practice of professional, advanced practice registered, or practical nursing.\nFour times each year, by the first day of February, May, August, and November, each insurer authorized to sell insurance described in section 60A.06, subdivision 1, clause (13), and providing professional liability insurance to registered nurses, advanced practice registered nurses, or licensed practical nurses shall submit to the board a report concerning any nurse against whom a malpractice award has been made or who has been a party to a settlement. The report must contain at least the following information:\n(1) the total number of settlements or awards;\n(2) the date settlement or award was made;\n(3) the allegations contained in the claim or complaint leading to the settlement or award;\n(4) the dollar amount of each malpractice settlement or award and whether that amount was paid as a result of a settlement or of an award; and\n(5) the name and address of the practice of the nurse against whom an award was made or with whom a settlement was made.\nAn insurer shall also report to the board any information it possesses that tends to substantiate a charge that a nurse may have engaged in conduct violating sections 148.171 to 148.285.\nThe court administrator of district court or another court of competent jurisdiction shall report to the board any judgment or other determination of the court that adjudges or includes a finding that a nurse is a person who is mentally ill, mentally incompetent, chemically dependent, dangerous to the public, guilty of a felony or gross misdemeanor, guilty of a violation of federal or state narcotics laws or controlled substances act, guilty of operating a motor vehicle while under the influence of alcohol or a controlled substance, or guilty of an abuse or fraud under Medicare or Medicaid, appoints a guardian of the nurse under sections 524.5-101 to 524.5-502, or commits a nurse under chapter 253B.\nReports required by subdivisions 2 to 5 must be submitted no later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that the reports be submitted on the forms provided, and may adopt rules necessary to assure prompt and accurate reporting. The board shall review all reports, including those submitted after the deadline.\nOn or after August 1, 2012, any person, institution, insurer, or organization that fails to report as required under subdivisions 2 to 5 shall be subject to civil penalties for failing to report as required by law.",
	"repealed": false
}