{
	"id": "48A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.19",
	"title": "48A.19 OUT-OF-STATE TRUST INSTITUTION REPRESENTATIVE TRUST OFFICES.",
	"text": "(a) Subject to the requirements contained in this section, an out-of-state trust institution may establish and maintain representative trust offices anywhere in this state.\n(b) An out-of-state trust institution may establish or acquire and maintain a representative trust office in this state. An out-of-state trust institution not maintaining a trust office in this state and desiring to establish or acquire and maintain a representative trust office shall:\n(1) file a notice on a form prescribed by the commissioner stating the name of the out-of-state trust institution and the location of the proposed office and satisfactory evidence that it is a trust institution;\n(2) furnish a copy of the resolution adopted by the board authorizing the representative trust office; and\n(3) pay the filing fee, if any, prescribed by the commissioner.\n(c) The out-of-state trust institution may begin business at the representative trust office on the 31st day after the date the commissioner receives the notice, unless the commissioner specifies an earlier or later date.\nThe 30-day period of review may be extended by the commissioner on a determination that the written notice raises issues that require additional information or additional time for analysis. If the period of review is extended, the out-of-state trust institution may establish the representative trust office only on prior written approval by the commissioner.\nThe commissioner may deny approval of the representative trust office if the commissioner finds that the out-of-state trust institution lacks sufficient financial resources to undertake the proposed expansion without adversely affecting its safety or soundness or that the proposed office would be contrary to the public interests. In acting on the notice, the commissioner shall consider the views of the appropriate bank supervisory agencies.",
	"repealed": false
}