{
	"id": "10.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/10.65",
	"title": "10.65 GOVERNMENT-TO-GOVERNMENT RELATIONSHIP WITH TRIBAL GOVERNMENTS.",
	"text": "(a) The state of Minnesota is home to 11 federally recognized Indian Tribes with elected Tribal government officials. The state of Minnesota acknowledges and supports the unique status of the Minnesota Tribes and their absolute right to existence, self-governance, and self-determination.\n(b) The United States and the state of Minnesota have a unique relationship with federally recognized Indian Tribes, formed by the Constitution of the United States, treaties, statutes, case law, and agreements.\n(c) The state of Minnesota and the Minnesota Tribal governments significantly benefit from working together, learning from one another, and partnering where possible.\n(d) Timely and meaningful consultation between the state of Minnesota and Minnesota Tribal governments will facilitate better understanding and informed decision-making by allowing for communication on matters of mutual interest and help to establish mutually respectful and beneficial relationships between the state and Minnesota Tribal governments.\nAs used in this section, the following terms have the meanings given:\n(1) \"agency\" means the Department of Administration; Department of Agriculture; Department of Children, Youth, and Families; Department of Commerce; Department of Corrections; Department of Education; Department of Employment and Economic Development; Department of Health; Office of Higher Education; Housing Finance Agency; Department of Human Rights; Department of Human Services; Department of Information Technology Services; Department of Iron Range Resources and Rehabilitation; Department of Labor and Industry; Minnesota Management and Budget; Bureau of Mediation Services; Department of Military Affairs; Metropolitan Council; Department of Natural Resources; Pollution Control Agency; Department of Public Safety; Department of Revenue; Department of Transportation; Department of Veterans Affairs; Direct Care and Treatment; Gambling Control Board; Racing Commission; the Minnesota Lottery; the Animal Health Board; the Public Utilities Commission; and the Board of Water and Soil Resources;\n(2) \"consultation\" means the direct and interactive involvement of the Minnesota Tribal governments in the development of policy on matters that have Tribal implications. Consultation is the proactive, affirmative process of identifying and seeking input from appropriate Tribal governments and considering their interest as a necessary and integral part of the decision-making process. This definition adds to statutorily mandated notification procedures. During a consultation, the burden is on the agency to show that it has made a good faith effort to elicit feedback. Consultation is a formal engagement between agency officials and the governing body or bodies of an individual Minnesota Tribal government that the agency or an individual Tribal government may initiate. Formal meetings or communication between top agency officials and the governing body of a Minnesota Tribal government is a necessary element of consultation;\n(3) \"matters that have Tribal implications\" means rules, legislative proposals, policy statements, or other actions that have substantial direct effects on one or more Minnesota Tribal governments, or on the distribution of power and responsibilities between the state and Minnesota Tribal governments;\n(4) \"Minnesota Tribal governments\" means the federally recognized Indian Tribes located in Minnesota including: Bois Forte Band; Fond Du Lac Band; Grand Portage Band; Leech Lake Band; Mille Lacs Band; White Earth Band; Red Lake Nation; Lower Sioux Indian Community; Prairie Island Indian Community; Shakopee Mdewakanton Sioux Community; and Upper Sioux Community; and\n(5) \"timely and meaningful\" means done or occurring at a favorable or useful time that allows the result of consultation to be included in the agency's decision-making process for a matter that has Tribal implications.\n(a) An agency must recognize the unique legal relationship between the state of Minnesota and the Minnesota Tribal governments, respect the fundamental principles that establish and maintain this relationship, and accord Tribal governments the same respect accorded to other governments.\n(b) An agency must, in consultation with Minnesota Tribal governments, implement Tribal consultation policies to comply with this section and guide the agency's work with Minnesota Tribal governments, and must submit these policies to the governor and lieutenant governor. Tribal consultation policies should address the communication protocols for each Minnesota Tribal government, which should be developed in coordination with representatives of each Minnesota Tribal government. An agency must update the Tribal consultation policies as often as required in order to facilitate timely and meaningful consultation, but no less than biannually.\n(c) Consultation under this section is a duty of an agency to consult with the governing body or bodies of each individual Minnesota Tribal government. Coordination with groups or entities that have representation on some or all of the governing bodies of the Minnesota Tribal governments, such as the Minnesota Indian Affairs Council or the Minnesota Chippewa Tribe, is encouraged but does not satisfy an agency's duty to consult with individual Minnesota Tribal governments on matters that have Tribal implications. If a matter has implications for one Minnesota Tribal government, but not others, the agency's duty is to only consult those Minnesota Tribal governments affected.\n(d) An agency must consult with each Minnesota Tribal government at least annually, and as often as is required to address matters that have Tribal implications.\n(e) An agency must consult with Minnesota Tribal governments on legislative and fiscal matters that affect one or all Minnesota Tribal governments or their members to identify priority issues in order to allow agencies to proactively engage Minnesota Tribal governments in the agency's development of legislative and fiscal proposals in time for submission into the governor's recommended budget and legislative proposals each year.\n(f) An agency must develop and maintain ongoing consultation with the Minnesota Tribal governments related to matters that have Tribal implications. Agencies must consider the input gathered from Tribal consultation into their decision-making processes, with the goal of achieving mutually beneficial solutions.\n(g) An agency and a Minnesota Tribal government may agree that a formal consultation is not necessary for a given year on a given matter that has Tribal implications, and the agency must keep a written record of this decision.\n(h) The prospective duty to consult does not apply to action on a matter that has Tribal implications if immediate action is required to address a present and immediate threat to the health, safety, or welfare of Minnesota citizens. For these actions, every effort should be made to communicate, and formal consultation should occur as soon as possible. The duty to consult also does not apply to criminal proceedings or other investigations or legal proceedings that prohibit an agency from disclosure.\n(i) An agency must designate a Tribal liaison to assume responsibility for implementation of the Tribal consultation policy and to serve as the principal point of contact for Minnesota Tribal governments. The Tribal liaison must be able to directly and regularly meet and communicate with the agency's commissioner and deputy and assistant commissioners in order to appropriately conduct government-to-government consultation and cooperation.\n(j) The state has instituted Tribal-state government relations training, which is the foundation and basis of all other Tribal government relations training sources. All agencies must direct certain staff to complete available training to foster a collaborative relationship between the state of Minnesota and Minnesota Tribal governments, and to facilitate timely and meaningful consultation. In addition to all commissioners, deputy commissioners, and assistant commissioners, at a minimum all agency employees whose work is likely to include matters that have Tribal implications must attend Tribal-state relations training. Tribal liaisons must actively support and participate in the Tribal-state relations training.\n(k) Any agency or board that is not listed in the definition of agency in subdivision 2 is encouraged to and may engage in consultation and communication with the Minnesota Tribal governments for all matters that have Tribal implications.\nNothing in this section requires the state or an agency to violate or ignore any laws, rules, directives, or other legal requirements or obligations imposed by state or federal law or set forth in agreements or compact between one or more Minnesota Tribal governments or any other Tribal government and the state or its agencies. This section is not intended to, and does not, create any right to administrative or judicial review, or any other right, benefit, or responsibility, substantive or procedural, enforceable against the state of Minnesota, its agencies or instrumentalities, its officers or employees, or its subdivisions or any other persons. Nothing in this section prohibits or limits any agency from asserting any rights or pursuing any administrative or judicial action under state or federal law to effectuate the interests of the state of Minnesota or any of its agencies. Nothing in this section is intended to alter or reduce the state's duties to individual Minnesota citizens including those of Native American descent.",
	"repealed": false
}