{
	"id": "245F.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.07",
	"title": "245F.07 STABILIZATION PLANNING.",
	"text": "Within 12 hours of admission, a license holder must develop an individualized stabilization plan for each patient accepted for stabilization services. The plan must be based on the patient's initial health assessment and continually updated based on new information gathered about the patient's condition from the comprehensive assessment, medical evaluation and consultation, and ongoing monitoring and observations of the patient. The patient must have an opportunity to have direct involvement in the development of the plan. The stabilization plan must:\n(1) identify medical needs and goals to be achieved while the patient is receiving services;\n(2) specify stabilization services to address the identified medical needs and goals, including amount and frequency of services;\n(3) specify the participation of others in the stabilization planning process and specific services where appropriate; and\n(4) document the patient's participation in developing the content of the stabilization plan and any updates.\nProgress notes must be entered in the patient's file at least daily and immediately following any significant event, including any change that impacts the medical, behavioral, or legal status of the patient. Progress notes must:\n(1) include documentation of the patient's involvement in the stabilization services, including the type and amount of each stabilization service;\n(2) include the monitoring and observations of the patient's medical needs;\n(3) include documentation of referrals made to other services or agencies;\n(4) specify the participation of others; and\n(5) be legible, signed, and dated by the staff person completing the documentation.\nBefore a patient leaves the facility, the license holder must conduct discharge planning for the patient, document discharge planning in the patient's record, and provide the patient with a copy of the discharge plan. The discharge plan must include:\n(1) referrals made to other services or agencies at the time of transition;\n(2) the patient's plan for follow-up, aftercare, or other poststabilization services;\n(3) documentation of the patient's participation in the development of the transition plan;\n(4) any service that will continue after discharge under the direction of the license holder; and\n(5) a stabilization summary and final evaluation of the patient's progress toward treatment objectives.",
	"repealed": false
}