{
	"id": "116X.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/116X.03",
	"title": "116X.03 ENVIRONMENT AND NATURAL RESOURCES TRUST FUND COMMUNITY GRANT PROGRAM.",
	"text": "(a) Beginning July 1, 2025, each fiscal year 1.5 percent of the market value of the environment and natural resources trust fund on June 30 one year before the start of the biennium is available for appropriation to the commissioner of natural resources to provide grants under this section for the benefit of current residents and future generations. The commissioner must award grants under this section for purposes authorized under the Minnesota Constitution, article XI, section 14, and expand the number and diversity of recipients who benefit from the environment and natural resources trust fund, especially in communities that have been adversely affected by pollution and environmental degradation.\n(b) A grant may be awarded under this section only for:\n(1) helping adversely impacted communities respond to environmental degradation and related health concerns;\n(2) education and awareness related to stewardship of air, land, water, forests, fish, wildlife, and other natural resources; or\n(3) preserving or enhancing air, land, water, and other natural resources that otherwise may be substantially impaired or destroyed in any area of the state.\n(c) A grant awarded under this section must provide measurable results and may not be awarded to a for-profit business.\n(d) Money appropriated from the trust fund under this subdivision must supplement the traditional sources of funding for environment and natural resources activities and may not be used as a substitute.\n(e) Any appropriated funds under this subdivision that are not encumbered before the appropriation expires must be credited to the principal of the trust fund.\n(f) The commissioner may not award a grant under this section to the Department of Natural Resources.\nNotwithstanding section 116P.011, the requirements of sections 116P.15 to 116P.21 apply to grants awarded under this section, except that where those sections require a grantee to obtain approval of the Legislative-Citizen Commission on Minnesota Resources for a proposed action a grantee must instead obtain the approval of the commissioner of natural resources.\nUp to five percent of the money appropriated to the commissioner for grants under this section may be used by the commissioner for administration, outreach, grant monitoring, and advisory council operational support.\nThe commissioner must require a recipient of a grant under this section to return all money awarded to the recipient if the recipient does not use the money in accordance with the applicable agreement.\nBy February 1 each year, the commissioner must submit a report to the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over environment and natural resources on the administration of this section during the previous fiscal year, including administrative expenses and the grants awarded.",
	"repealed": false
}