{
	"id": "260C.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.201",
	"title": "260C.201 DISPOSITIONS; CHILDREN IN NEED OF PROTECTION OR SERVICES OR NEGLECTED AND IN FOSTER CARE.",
	"text": "(a) If the court finds that the child is in need of protection or services or neglected and in foster care, the court shall enter an order making any of the following dispositions of the case:\n(1) place the child under the protective supervision of the responsible social services agency or child-placing agency in the home of a parent of the child under conditions prescribed by the court directed to the correction of the child's need for protection or services:\n(i) the court may order the child into the home of a parent who does not otherwise have legal custody of the child, however, an order under this section does not confer legal custody on that parent;\n(ii) if the court orders the child into the home of a father who is not adjudicated, the father must cooperate with paternity establishment proceedings regarding the child in the appropriate jurisdiction as one of the conditions prescribed by the court for the child to continue in the father's home; and\n(iii) the court may order the child into the home of a noncustodial parent with conditions and may also order both the noncustodial and the custodial parent to comply with the requirements of a case plan under subdivision 2; or\n(2) transfer legal custody to one of the following:\n(i) a child-placing agency; or\n(ii) the responsible social services agency. In making a foster care placement of a child whose custody has been transferred under this subdivision, the agency shall make an individualized determination of how the placement is in the child's best interests using the placement consideration order for relatives and the best interest factors in section 260C.212, subdivision 2, and may include a child colocated with a parent in a licensed residential family-based substance use disorder treatment program under section 260C.190; or\n(3) order a trial home visit without modifying the transfer of legal custody to the responsible social services agency under clause (2). Trial home visit means the child is returned to the care of the parent or guardian from whom the child was removed for a period not to exceed six months. During the period of the trial home visit, the responsible social services agency:\n(i) shall continue to have legal custody of the child, which means that the agency may see the child in the parent's home, at school, in a child care facility, or other setting as the agency deems necessary and appropriate;\n(ii) shall continue to have the ability to access information under section 260C.208;\n(iii) shall continue to provide appropriate services to both the parent and the child during the period of the trial home visit;\n(iv) without previous court order or authorization, may terminate the trial home visit in order to protect the child's health, safety, or welfare and may remove the child to foster care;\n(v) shall advise the court and parties within three days of the termination of the trial home visit when a visit is terminated by the responsible social services agency without a court order; and\n(vi) shall prepare a report for the court when the trial home visit is terminated whether by the agency or court order that describes the child's circumstances during the trial home visit and recommends appropriate orders, if any, for the court to enter to provide for the child's safety and stability. In the event a trial home visit is terminated by the agency by removing the child to foster care without prior court order or authorization, the court shall conduct a hearing within ten days of receiving notice of the termination of the trial home visit by the agency and shall order disposition under this subdivision or commence permanency proceedings under sections 260C.503 to 260C.515. The time period for the hearing may be extended by the court for good cause shown and if it is in the best interests of the child as long as the total time the child spends in foster care without a permanency hearing does not exceed 12 months;\n(4) if the child has been adjudicated as a child in need of protection or services because the child is in need of special services or care to treat or ameliorate a physical or mental disability or emotional disturbance as defined in section 245.4871, subdivision 15, the court may order the child's parent, guardian, or custodian to provide it. The court may order the child's health plan company to provide mental health services to the child. Section 62Q.535 applies to an order for mental health services directed to the child's health plan company. If the health plan, parent, guardian, or custodian fails or is unable to provide this treatment or care, the court may order it provided. Absent specific written findings by the court that the child's disability is the result of abuse or neglect by the child's parent or guardian, the court shall not transfer legal custody of the child for the purpose of obtaining special treatment or care solely because the parent is unable to provide the treatment or care. If the court's order for mental health treatment is based on a diagnosis made by a treatment professional, the court may order that the diagnosing professional not provide the treatment to the child if it finds that such an order is in the child's best interests; or\n(5) if the court believes that the child has sufficient maturity and judgment and that it is in the best interests of the child, the court may order a child 16 years old or older to be allowed to live independently, either alone or with others as approved by the court under supervision the court considers appropriate, if the county board, after consultation with the court, has specifically authorized this dispositional alternative for a child.\n(b) If the child was adjudicated in need of protection or services because the child is a runaway or habitual truant, the court may order any of the following dispositions in addition to or as alternatives to the dispositions authorized under paragraph (a):\n(1) counsel the child or the child's parents, guardian, or custodian;\n(2) place the child under the supervision of a probation officer or other suitable person in the child's own home under conditions prescribed by the court, including reasonable rules for the child's conduct and the conduct of the parents, guardian, or custodian, designed for the physical, mental, and moral well-being and behavior of the child;\n(3) subject to the court's supervision, transfer legal custody of the child to one of the following:\n(i) a reputable person of good moral character. No person may receive custody of two or more unrelated children unless licensed to operate a residential program under sections 245A.01 to 245A.16; or\n(ii) a county probation officer for placement in a group foster home established under the direction of the juvenile court and licensed pursuant to section 241.021;\n(4) require the child to pay a fine of up to $100. The court shall order payment of the fine in a manner that will not impose undue financial hardship upon the child;\n(5) require the child to participate in a community service project;\n(6) order the child to undergo a chemical dependency evaluation and, if warranted by the evaluation, order participation by the child in a drug awareness program or an inpatient or outpatient chemical dependency treatment program;\n(7) if the court believes that it is in the best interests of the child or of public safety that the child's driver's license or instruction permit be canceled, the court may order the commissioner of public safety to cancel the child's license or permit for any period up to the child's 18th birthday. If the child does not have a driver's license or permit, the court may order a denial of driving privileges for any period up to the child's 18th birthday. The court shall forward an order issued under this clause to the commissioner, who shall cancel the license or permit or deny driving privileges without a hearing for the period specified by the court. At any time before the expiration of the period of cancellation or denial, the court may, for good cause, order the commissioner of public safety to allow the child to apply for a license or permit, and the commissioner shall so authorize;\n(8) order that the child's parent or legal guardian deliver the child to school at the beginning of each school day for a period of time specified by the court; or\n(9) require the child to perform any other activities or participate in any other treatment programs deemed appropriate by the court.\nTo the extent practicable, the court shall enter a disposition order the same day it makes a finding that a child is in need of protection or services or neglected and in foster care, but in no event more than 15 days after the finding unless the court finds that the best interests of the child will be served by granting a delay. If the child was under eight years of age at the time the petition was filed, the disposition order must be entered within ten days of the finding and the court may not grant a delay unless good cause is shown and the court finds the best interests of the child will be served by the delay.\n(c) If a child who is 14 years of age or older is adjudicated in need of protection or services because the child is a habitual truant and truancy procedures involving the child were previously dealt with by a school attendance review board or county attorney mediation program under section 260A.06 or 260A.07, the court shall order a cancellation or denial of driving privileges under paragraph (b), clause (7), for any period up to the child's 18th birthday.\n(d) In the case of a child adjudicated in need of protection or services because the child has committed domestic abuse and been ordered excluded from the child's parent's home, the court shall dismiss jurisdiction if the court, at any time, finds the parent is able or willing to provide an alternative safe living arrangement for the child as defined in paragraph (f).\n(e) When a parent has complied with a case plan ordered under subdivision 6 and the child is in the care of the parent, the court may order the responsible social services agency to monitor the parent's continued ability to maintain the child safely in the home under such terms and conditions as the court determines appropriate under the circumstances.\n(f) For the purposes of this subdivision, \"alternative safe living arrangement\" means a living arrangement for a child proposed by a petitioning parent or guardian if a court excludes the minor from the parent's or guardian's home that is separate from the victim of domestic abuse and safe for the child respondent. A living arrangement proposed by a petitioning parent or guardian is presumed to be an alternative safe living arrangement absent information to the contrary presented to the court. In evaluating any proposed living arrangement, the court shall consider whether the arrangement provides the child with necessary food, clothing, shelter, and education in a safe environment. Any proposed living arrangement that would place the child in the care of an adult who has been physically or sexually violent is presumed unsafe.\n(a) Any order for a disposition authorized under this section shall contain written findings of fact to support the disposition and case plan ordered and shall also set forth in writing the following information:\n(1) why the best interests and safety of the child are served by the disposition and case plan ordered;\n(2) what alternative dispositions or services under the case plan were considered by the court and why such dispositions or services were not appropriate in the instant case;\n(3) when legal custody of the child is transferred, the appropriateness of the particular placement made or to be made by the placing agency using the relative and sibling placement considerations and best interest factors in section 260C.212, subdivision 2, or the appropriateness of a child colocated with a parent in a licensed residential family-based substance use disorder treatment program under section 260C.190;\n(4) whether reasonable efforts to finalize the permanent plan for the child consistent with section 260.012 were made including reasonable efforts:\n(i) to prevent the child's placement and to reunify the child with the parent or guardian from whom the child was removed at the earliest time consistent with the child's safety. The court's findings must include a brief description of what preventive and reunification efforts were made and why further efforts could not have prevented or eliminated the necessity of removal or that reasonable efforts were not required under section 260.012 or 260C.178, subdivision 1;\n(ii) to identify and locate any noncustodial or nonresident parent of the child and to assess such parent's ability to provide day-to-day care of the child, and, where appropriate, provide services necessary to enable the noncustodial or nonresident parent to safely provide day-to-day care of the child as required under section 260C.219, unless such services are not required under section 260.012 or 260C.178, subdivision 1. The court's findings must include a description of the agency's efforts to:\n(A) identify and locate the child's noncustodial or nonresident parent;\n(B) assess the noncustodial or nonresident parent's ability to provide day-to-day care of the child; and\n(C) if appropriate, provide services necessary to enable the noncustodial or nonresident parent to safely provide the child's day-to-day care, including efforts to engage the noncustodial or nonresident parent in assuming care and responsibility of the child;\n(iii) to make the diligent search for relatives and provide the notices required under section 260C.221; a finding made pursuant to a hearing under section 260C.202 that the agency has made diligent efforts to conduct a relative search and has appropriately engaged relatives who responded to the notice under section 260C.221 and other relatives, who came to the attention of the agency after notice under section 260C.221 was sent, in placement and case planning decisions fulfills the requirement of this item;\n(iv) to identify and make a foster care placement of the child, considering the order in section 260C.212, subdivision 2, paragraph (a), in the home of an unlicensed relative, according to the requirements of section 142B.06, a licensed relative, or other licensed foster care provider, who will commit to being the permanent legal parent or custodian for the child in the event reunification cannot occur, but who will actively support the reunification plan for the child. If the court finds that the agency has not appropriately considered relatives for placement of the child, the court shall order the agency to comply with section 260C.212, subdivision 2, paragraph (a). The court may order the agency to continue considering relatives for placement of the child regardless of the child's current placement setting; and\n(v) to place siblings together in the same home or to ensure visitation is occurring when siblings are separated in foster care placement and visitation is in the siblings' best interests under section 260C.212, subdivision 2, paragraph (d); and\n(5) if the child has been adjudicated as a child in need of protection or services because the child is in need of special services or care to treat or ameliorate a mental disability or emotional disturbance as defined in section 245.4871, subdivision 15, the written findings shall also set forth:\n(i) whether the child has mental health needs that must be addressed by the case plan;\n(ii) what consideration was given to the diagnostic and functional assessments performed by the child's mental health professional and to health and mental health care professionals' treatment recommendations;\n(iii) what consideration was given to the requests or preferences of the child's parent or guardian with regard to the child's interventions, services, or treatment; and\n(iv) what consideration was given to the cultural appropriateness of the child's treatment or services.\n(b) If the court finds that the social services agency's preventive or reunification efforts have not been reasonable but that further preventive or reunification efforts could not permit the child to safely remain at home, the court may nevertheless authorize or continue the removal of the child.\n(c) If the child has been identified by the responsible social services agency as the subject of concurrent permanency planning, the court shall review the reasonable efforts of the agency to develop a permanency plan for the child that includes a primary plan that is for reunification with the child's parent or guardian and a secondary plan that is for an alternative, legally permanent home for the child in the event reunification cannot be achieved in a timely manner.\n(a) If the court finds that the child is a victim of domestic child abuse, as defined in section 260C.007, subdivision 13, it may order any of the following dispositions of the case in addition to or as alternatives to the dispositions authorized under subdivision 1:\n(1) restrain any party from committing acts of domestic child abuse;\n(2) exclude the abusing party from the dwelling which the family or household members share or from the residence of the child;\n(3) on the same basis as is provided in chapter 518, establish temporary visitation with regard to minor children of the adult family or household members;\n(4) on the same basis as is provided in chapter 518 or 518A, establish temporary support or maintenance for a period of 30 days for minor children or a spouse;\n(5) provide counseling or other social services for the family or household members; or\n(6) order the abusing party to participate in treatment or counseling services.\nAny relief granted by the order for protection shall be for a fixed period not to exceed one year.\n(b) No order excluding the abusing party from the dwelling may be issued unless the court finds that:\n(1) the order is in the best interests of the child or children remaining in the dwelling;\n(2) a remaining adult family or household member is able to care adequately for the child or children in the absence of the excluded party; and\n(3) the local welfare agency has developed a plan to provide appropriate social services to the remaining family or household members.\n(c) Upon a finding that the remaining parent is able to care adequately for the child and enforce an order excluding the abusing party from the home and that the provision of supportive services by the responsible social services agency is no longer necessary, the responsible social services agency may be dismissed as a party to the proceedings. Orders entered regarding the abusing party remain in full force and effect and may be renewed by the remaining parent as necessary for the continued protection of the child for specified periods of time, not to exceed one year.\n(d) An order granting relief that was issued after a hearing of which the abusing party received actual notice and at which the abusing party had the opportunity to participate, shall prohibit the abusing party from possessing firearms for the length the order is in effect if the order (1) restrains the abusing party from harassing, stalking, or threatening the child or restrains the abusing party from engaging in other conduct that would place the child in reasonable fear of bodily injury, and (2) includes a finding that the abusing party represents a credible threat to the physical safety of the child or prohibits the abusing party from using, attempting to use, or threatening to use physical force against the child. The order shall inform the abusing party of that party's prohibited status. Except as provided in paragraph (f), the court shall order the abusing party to transfer any firearms that the person possesses, within three business days, to a federally licensed firearms dealer, a law enforcement agency, or a third party who may lawfully receive them. The transfer may be permanent or temporary. A temporary firearm transfer only entitles the receiving party to possess the firearm. A temporary transfer does not transfer ownership or title. An abusing party may not transfer firearms to a third party who resides with the abusing party. If an abusing party makes a temporary transfer, a federally licensed firearms dealer or law enforcement agency may charge the abusing party a reasonable fee to store the person's firearms and may establish policies for disposal of abandoned firearms, provided such policies require that the person be notified via certified mail prior to disposal of abandoned firearms. For temporary firearms transfers under this paragraph, a law enforcement agency, federally licensed firearms dealer, or third party shall exercise due care to preserve the quality and function of the transferred firearms and shall return the transferred firearms to the person upon request after the expiration of the prohibiting time period, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The return of temporarily transferred firearms to an abusing party shall comply with state and federal law. If an abusing party permanently transfers the abusing party's firearms to a law enforcement agency, the agency is not required to compensate the abusing party and may charge the abusing party a reasonable processing fee. A law enforcement agency is not required to accept an abusing party's firearm under this paragraph.\n(e) An abusing party who is ordered to transfer firearms under paragraph (d) must file proof of transfer as provided for in this paragraph. If the transfer is made to a third party, the third party must sign an affidavit under oath before a notary public either acknowledging that the abusing party permanently transferred the abusing party's firearms to the third party or agreeing to temporarily store the abusing party's firearms until such time as the abusing party is legally permitted to possess firearms. The affidavit shall indicate the serial number, make, and model of all firearms transferred by the abusing party to the third party. The third party shall acknowledge in the affidavit that the third party may be held criminally and civilly responsible under section 624.7144 if the abusing party gains access to a transferred firearm while the firearm is in the custody of the third party. If the transfer is to a law enforcement agency or federally licensed firearms dealer, the law enforcement agency or federally licensed firearms dealer shall provide proof of transfer to the abusing party. The proof of transfer must specify whether the firearms were permanently or temporarily transferred and include the name of the abusing party, date of transfer, and the serial number, make, and model of all transferred firearms. The abusing party shall provide the court with a signed and notarized affidavit or proof of transfer as described in this section within two business days of the firearms transfer. The court shall seal affidavits and proofs of transfer filed pursuant to this paragraph.\n(f) When a court issues an order containing a firearms restriction provided for in paragraph (d), the court shall determine by a preponderance of evidence if an abusing party poses an imminent risk of causing another person substantial bodily harm. Upon a finding of imminent risk, the court shall order that the local law enforcement agency take immediate possession of all firearms in the abusing party's possession. The local law enforcement agency shall exercise due care to preserve the quality and function of the abusing party's firearms and shall return the firearms to the person upon request after the expiration of the prohibiting time period, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The local law enforcement agency shall, upon written notice from the abusing party, transfer the firearms to a federally licensed firearms dealer or a third party who may lawfully receive them. Before a local law enforcement agency transfers a firearm under this paragraph, the agency shall require the third party or federally licensed firearms dealer receiving the firearm to submit an affidavit or proof of transfer that complies with the requirements for affidavits or proofs of transfer established in paragraph (e). The agency shall file all affidavits or proofs of transfer received with the court within two business days of the transfer. The court shall seal all affidavits or proofs of transfer filed pursuant to this paragraph. A federally licensed firearms dealer or third party who accepts a firearm transfer pursuant to this paragraph shall comply with paragraphs (d) and (e) as if accepting transfer from the abusing party. If the law enforcement agency does not receive written notice from the abusing party within three business days, the agency may charge a reasonable fee to store the abusing party's firearms. A law enforcement agency may establish policies for disposal of abandoned firearms, provided such policies require that the abusing party be notified via certified mail prior to disposal of abandoned firearms.\nIf the court issues an order for protection pursuant to section 260C.201, subdivision 3, excluding an abusing party from the dwelling who is the parent of a minor family or household member, it shall transfer the case file to the court which has jurisdiction over proceedings under chapter 518 or 518A for the purpose of establishing support or maintenance for minor children or a spouse, as provided in chapter 518 or 518A, during the effective period of the order for protection. The court to which the case file is transferred shall schedule and hold a hearing on the establishment of support or maintenance within 30 days of the issuance of the order for protection. After an order for support or maintenance has been granted or denied, the case file shall be returned to the juvenile court, and the order for support or maintenance, if any, shall be incorporated into the order for protection.\nIf the court orders the child into foster care, the court shall review and either modify or approve the agency's plan for supervised or unsupervised visitation that contributes to the objectives of the court-ordered case plan and the maintenance of the familial relationship, and that meets the requirements of section 260C.212, subdivision 1, paragraph (c), clause (5). No parent may be denied visitation unless the court finds at the disposition hearing that the visitation would endanger the child's physical or emotional well-being, is not in the child's best interests, or is not required under section 260C.178, subdivision 3, paragraph (c) or (d). The court shall review and either modify or approve the agency plan for visitation for any relatives as defined in section 260C.007, subdivision 26b or 27, and with siblings of the child, if visitation is consistent with the best interests of the child.\n(a) For each disposition ordered where the child is placed away from a parent or guardian, the court shall order the responsible social services agency to prepare a written out-of-home placement plan according to the requirements of section 260C.212, subdivision 1. When a foster child is colocated with a parent in a licensed residential family-based substance use disorder treatment program under section 260C.190, the case plan must specify the recommendation for the colocation before the child is colocated with the parent.\n(b) In cases where the child is not placed out of the home or is ordered into the home of a noncustodial parent, the responsible social services agency shall prepare a plan for delivery of social services to the child and custodial parent under section 260E.26, or any other case plan required to meet the needs of the child. The plan shall be designed to safely maintain the child in the home or to reunite the child with the custodial parent.\n(c) The court may approve the case plan as presented or modify it after hearing from the parties. Once the plan is approved, the court shall order all parties to comply with it. A copy of the approved case plan shall be attached to the court's order and incorporated into it by reference.\n(d) A party has a right to request a court review of the reasonableness of the case plan upon a showing of a substantial change of circumstances.\nSubject to sections 260C.202 and 260C.503 to 260C.521, all orders under this section shall be for a specified length of time set by the court not to exceed one year. However, before the order has expired and upon its own motion or that of any interested party, the court shall, after notice to the parties and a hearing, renew the order for another year or make some other disposition of the case, until the individual is no longer a minor. Any responsible social services agency receiving legal custody of a child shall report to the court at such periods as the court may direct and as required under juvenile court rules.\nAny person who provides services to a child under a disposition order, or who is subject to the conditions of a disposition order, shall be served with a copy of the order in the manner provided in the rules for juvenile courts.\nWhen the court transfers legal custody of a child to any licensed child-placing agency or the responsible social services agency, it shall transmit with the order transferring legal custody a copy of its findings and a summary of its information concerning the child.\nMS 2010 [Renumbered 260C.202]\n[Repealed, 2012 c 216 art 6 s 14]\nMS 2010 [Renumbered 260C.204]\nIf it is in the best interests of the child to do so and if the allegations contained in the petition have been admitted, or when a hearing has been held as provided in section 260C.163 and the allegations contained in the petition have been duly proven, before the entry of a finding of need for protection or services or a finding that a child is neglected and in foster care, the court may continue the case for a period not to exceed 90 days on any one order. Following the 90-day continuance:\n(1) if both the parent and child have complied with the terms of the continuance, the case must be dismissed without an adjudication that the child is in need of protection or services or that the child is neglected and in foster care; or\n(2) if either the parent or child has not complied with the terms of the continuance, the court shall adjudicate the child in need of protection or services or neglected and in foster care.",
	"repealed": false
}