{
	"id": "174.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.285",
	"title": "174.285 MINNESOTA COUNCIL ON TRANSPORTATION ACCESS.",
	"text": "A Minnesota Council on Transportation Access is established to study, evaluate, oversee, and make recommendations to improve the coordination, availability, accessibility, efficiency, cost-effectiveness, and safety of transportation services provided to the transit public. \"Transit public\" means those persons who utilize public transit and those who, because of mental or physical disability, income status, or age are unable to transport themselves and are dependent upon others for transportation services.\nIn order to accomplish the purposes in subdivision 1, the council, following consultation with the legislative committees or divisions with jurisdiction over transportation policy and budget, or with appropriate legislative transportation subcommittees, shall adopt a biennial work plan that must incorporate the following activities:\n(1) compile information on existing transportation alternatives for the transit public, and serve as a clearinghouse for information on services, funding sources, innovations, and coordination efforts;\n(2) identify best practices and strategies that have been successful in Minnesota and in other states for coordination of local, regional, state, and federal funding and services;\n(3) recommend statewide objectives for providing public transportation services for the transit public;\n(4) identify barriers prohibiting coordination and accessibility of public transportation services and aggressively pursue the elimination of those barriers;\n(5) recommend policies and procedures for coordinating local, regional, state, and federal funding and services for the transit public;\n(6) identify stakeholders in providing services for the transit public, and seek input from them concerning barriers and appropriate strategies;\n(7) recommend guidelines for developing transportation coordination plans throughout the state;\n(8) encourage all state agencies participating in the council to purchase trips within the coordinated system;\n(9) facilitate the creation and operation of transportation brokerages to match riders to the appropriate service, promote shared dispatching, compile and disseminate information on transportation options, and promote regional communication;\n(10) encourage volunteer driver programs and recommend legislation to address liability and insurance issues;\n(11) recommend minimum performance standards for delivery of services;\n(12) identify methods to eliminate fraud and abuse in special transportation services;\n(13) develop a standard method for addressing liability insurance requirements for transportation services purchased, provided, or coordinated;\n(14) design and develop a contracting template for providing coordinated transportation services;\n(15) recommend an interagency uniform contracting and billing and accounting system for providing coordinated transportation services;\n(16) encourage the design and development of training programs for coordinated transportation services;\n(17) encourage the use of public school transportation vehicles for the transit public;\n(18) develop an allocation methodology that equitably distributes transportation funds to compensate units of government and all entities that provide coordinated transportation services;\n(19) identify policies and necessary legislation to facilitate vehicle sharing; and\n(20) advocate aggressively for eliminating barriers to coordination, implementing coordination strategies, enacting necessary legislation, and appropriating resources to achieve the council's objectives.\nThe council shall coordinate its meeting schedule and activities pursuant to its work plan, to the extent practicable, with legislative committees and divisions with jurisdiction over transportation budget and policy, or with appropriate subcommittees. The chair of the council shall act as a liaison with the chairs and ranking minority members of the legislative transportation committees, divisions, and appropriate subcommittees in carrying out these duties.\n(a) The council is composed of the following 13 members:\n(1) one representative from the Office of the Governor;\n(2) one representative from the Council on Disability;\n(3) one representative from the Minnesota Public Transit Association;\n(4) the commissioner of transportation or a designee;\n(5) the commissioner of human services or a designee;\n(6) the commissioner of health or a designee;\n(7) the chair of the Metropolitan Council or a designee;\n(8) the commissioner of education or a designee;\n(9) the commissioner of veterans affairs or a designee;\n(10) one representative from the Board on Aging;\n(11) the commissioner of employment and economic development or a designee;\n(12) the commissioner of commerce or a designee; and\n(13) the commissioner of management and budget or a designee.\n(b) All appointments required by paragraph (a) must be completed by August 1, 2010.\n(c) The commissioner of transportation or a designee shall convene the first meeting of the council within two weeks after the members have been appointed to the council. The members shall elect a chair from their membership at the first meeting.\n(d) The Department of Transportation and the Department of Human Services shall provide necessary staff support for the council.\nBy January 15 of each year, the council shall report its findings, recommendations, and activities to the governor's office and to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation, health, and human services, and to the legislature as provided under section 3.195.\nMembers of the council shall receive reimbursement of expenses from the commissioner of transportation as provided in section 15.059, subdivision 3.\nMS 2022 [Repealed, 2023 c 25 s 190]\n[Repealed, 2013 c 117 art 3 s 41]",
	"repealed": false
}