{
	"id": "270C.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.35",
	"title": "270C.35 ADMINISTRATIVE REVIEW.",
	"text": "A taxpayer may obtain reconsideration by the commissioner of an order assessing tax, a denial of a request for abatement of penalty or interest imposed by a law administered by the commissioner, or a denial of a claim for refund by filing an administrative appeal under subdivision 4. A taxpayer cannot obtain reconsideration under this section if the action taken by the commissioner is the outcome of an administrative appeal.\nA taxpayer who wishes to seek administrative review must follow the procedures in subdivision 4.\nFor purposes of this section, \"notice date\" means the notice date designated by the commissioner on the order adjusting the tax or order denying a request for abatement, or, in the case of a denied refund, the notice date designated by the commissioner on the notice of denial.\nWithin 60 days after the notice date, the taxpayer must file a written appeal with the commissioner. The appeal need not be in any particular form but must contain the following information:\n(1) name and address of the taxpayer;\n(2) if a corporation, the state of incorporation of the taxpayer, and the principal place of business of the corporation;\n(3) the Minnesota identification number or Social Security number of the taxpayer;\n(4) the type of tax involved;\n(5) the date;\n(6) the tax years or periods involved and the amount of tax involved for each year or period;\n(7) the findings in the notice that the taxpayer disputes;\n(8) a summary statement that the taxpayer relies on for each exception; and\n(9) the taxpayer's signature or signature of the taxpayer's duly authorized agent.\nWhen requested in writing and within the time allowed for filing an administrative appeal, the commissioner may extend the time for filing an appeal for a period not more than 30 days from the expiration of the 60 days from the notice date.\nOn the basis of applicable law and available information, the commissioner shall determine the validity, if any, in whole or part of the appeal and notify the taxpayer of the decision. This notice must be in writing and contain the basis for the determination.\nWhen it appears to be in the best interests of the state, the commissioner may settle any taxes, penalties, or interest that the commissioner has under consideration by virtue of an appeal filed under this section. An agreement must be in writing and signed by the commissioner and the taxpayer, or the taxpayer's representative authorized by the taxpayer to enter into an agreement. The agreement shall be final and conclusive and, except upon a showing of fraud or malfeasance, or misrepresentation of a material fact, the case shall not be reopened as to the matters agreed upon.\nFollowing the determination of an appeal and notwithstanding any period of limitations for making assessments or other determinations to the contrary, the commissioner must issue an order reflecting that disposition. If the statute of limitations for making assessments or other determinations would have expired before the issuance of this order, except for this section, the order is limited to issues or matters contained in the appealed determination. The order is appealable to the Minnesota Tax Court under section 271.06.\nIf the commissioner does not make a determination within six months of the filing of an administrative appeal, the taxpayer may elect to appeal to Tax Court.\nThis section is not subject to chapter 14.\nIf a taxpayer files an administrative appeal for an order of the commissioner and also files an appeal to the Tax Court for that same order of the commissioner, the administrative appeal is dismissed and the commissioner is no longer required to make a determination of appeal under subdivision 6.",
	"repealed": false
}