{
	"id": "103B.571",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.571",
	"title": "103B.571 ANNUAL MEETING OF DISTRICT.",
	"text": "A district must have an annual meeting. The first annual meeting shall be scheduled during the month of July or August and be held annually in that period unless changed by vote of the previous annual meeting.\nThe annual meeting shall be preceded by two weeks' published notice and written notice mailed at least ten days in advance of the meeting to the county board or joint county authority, town boards and statutory and home rule charter cities wholly or partially within the district, the Pollution Control Agency, commissioner of natural resources, and if there is a proposed project by the district having a cost in excess of $5,000, all property owners within the assessment area.\n(a) At the annual meeting the district property owners present shall:\n(1) elect one or more directors to fill any midterm vacancies in the board of directors;\n(2) approve a budget for the fiscal year;\n(3) approve or disapprove proposed projects by the district having a cost to the district in excess of $5,000; and\n(4) take up and consider other business that comes before them.\n(b) At the annual meeting all district property owners, including absent members as provided in the order establishing the district, shall elect one or more directors for board positions with expiring terms.\nEach year the board of directors shall prepare and file a report of the financial conditions of the district, the status of all projects in the district, the business transacted by the district, other matters affecting the interests of the district, and a discussion of the directors' intentions for the succeeding years. Copies of the report shall be transmitted to the county board or joint county authority, town boards and city councils of statutory and home rule charter cities wholly or partially within the district, the commissioner of natural resources, and the Pollution Control Agency by four months after the annual meeting.",
	"repealed": false
}