{
	"id": "524.3-403",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.3-403",
	"title": "524.3-403 FORMAL TESTACY PROCEEDING; NOTICE OF HEARING ON PETITION.",
	"text": "(a) Upon commencement of a formal testacy proceeding, the court shall fix a time and place of hearing. Notice, in the form prescribed by court rule, shall be given in the manner prescribed by section 524.1-401 by the petitioner to the persons herein enumerated and to any additional person who has filed a demand for notice under section 524.3-204. The petitioner, having reason to believe that the will has been lost or destroyed, shall include a statement to that effect in the notice.\nNotice shall be given to the following persons: the surviving spouse, children, and other heirs of the decedent, the devisees and personal representatives named in any will that is being or has been probated, or offered for informal or formal probate in the county, or that is known by the petitioner to have been probated, or offered for informal or formal probate elsewhere, and any personal representative of the decedent whose appointment has not been terminated. Notice of the hearing, in the form prescribed by court rule, shall also be given under the direction of the court administrator by publication once a week for two consecutive weeks in a legal newspaper in the county where the hearing is to be held, the last publication of which is to be at least ten days before the time set for hearing.\nIf the decedent was born in a foreign country or has heirs or devisees in a foreign country, notice of a formal testacy proceeding shall be given to the consul of that country, if the consul resides in this state and has filed a copy of the appointment with the secretary of state. Any notice received by the secretary of state shall be forwarded to the appropriate consul.\n(b) If it appears by the petition or otherwise that the fact of the death of the alleged decedent may be in doubt, the court shall direct the petitioner to proceed in the manner provided in chapter 576.",
	"repealed": false
}