{
	"id": "136A.173",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.173",
	"title": "136A.173 NEGOTIABILITY; BOND ANTICIPATION NOTES; PAYMENT; CONDITIONS.",
	"text": "The office may from time to time issue revenue bonds for purposes of sections 136A.15 to 136A.178 and all such revenue bonds, notes, bond anticipation notes, or other obligations of the office issued pursuant to sections 136A.15 to 136A.178 shall be and are hereby declared to be negotiable for all purposes notwithstanding their payment from a limited source and without regard to any other law or laws. In anticipation of the sale of such revenue bonds, the office may issue negotiable bond anticipation notes and may renew the same from time to time, but the maximum maturity of any such note, including renewals thereof, shall not exceed five years from the date of issue of the original note. Such notes shall be paid from any revenues of the office available therefor and not otherwise pledged, or from the proceeds of sale of the revenue bonds of the office in anticipation of which they were issued. The notes shall be issued in the same manner as the revenue bonds. Such notes and the resolution or resolutions authorizing the same may contain any provisions, conditions, or limitations which a bond resolution or the office may contain.\nThe revenue bonds and notes of every issue shall be payable solely out of revenues of the office, subject only to any agreements with the holders of particular revenue bonds or notes pledging any particular revenues. Notwithstanding that revenue bonds and notes may be payable from a special fund, they shall be and be deemed to be, for all purposes, negotiable instruments, subject only to the provisions of the revenue bonds.\nThe revenue bonds may be issued as serial bonds or as term bonds, or the office, in its discretion, may issue bonds of both types. The revenue bonds shall be authorized by resolution of the commissioner of the office and shall bear such date or dates, mature at such time or times, not exceeding 50 years from their respective dates, bear interest at such rate or rates, payable at such time or times, be in denominations, be in such form, either coupon or registered, carry such registration privileges, be executed in such manner, be payable in lawful money of the United States of America at such place or places, and be subject to such terms of redemption, as such resolution or resolutions may provide. The revenue bonds or notes may be sold at public or private sale for such price or prices as the office shall determine. Pending preparation of the definitive bonds, the office may issue interim receipts or certificates which shall be exchanged for such definite bonds.\nAny resolution or resolutions authorizing any revenue bonds or any issue of revenue bonds may contain provisions which shall be part of the contract with the holders of the revenue bonds to be authorized as to:\n(a) The setting aside of reserves or sinking funds, and the regulation and disposition thereof;\n(b) Limitations on the purpose to which the proceeds of sale of any issue of revenue bonds then or thereafter to be issued may be applied and pledging such proceeds to secure the payment of the revenue bonds or any issue of the revenue bonds;\n(c) Limitations on the issuance of additional bonds, the terms upon which additional bonds may be issued and secured and the refunding of outstanding bonds;\n(d) The procedure, if any, by which the terms of any contract with bondholders may be amended or abrogated, the amount of bonds the holders of which must consent thereto, and the manner in which such consent may be given;\n(e) Defining the acts or omissions to act which shall constitute a default in the duties of the office to holders of its obligations and providing the rights and remedies of such holders in the event of a default.\nNeither the members of the office nor any person executing the revenue bonds or notes shall be liable personally on the revenue bonds or notes or be subject to any personal liability or accountability by reason of the issuance thereof.\nThe office shall have power out of any funds available therefor to purchase its bonds or notes. The office may hold, pledge, cancel or resell such bonds, subject to and in accordance with agreements with bondholders.",
	"repealed": false
}