{
	"id": "240.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.07",
	"title": "240.07 RACING LICENSES.",
	"text": "The commission may issue one or more class B licenses for the sponsorship and management of horse racing at licensed racetracks. An application for a class B license must be on a form the commission prescribes, and must be accompanied by a bond in the principal amount of $500,000 payable to the state of Minnesota conditioned on the licensee's payment of all fees, taxes, and other money due and payable under Laws 1983, chapter 214, including horse owner's purses and payouts on winning pari-mutuel tickets.\nThe application must contain:\n(1) the name and address of the applicant and, if it is a corporation or association, the names of all officers, directors, and shareholders, including those of any of its holding companies;\n(2) if required by the commission, the names of any person or persons holding, directly, indirectly, or beneficially, an interest of any kind in the applicant or any of its holding companies, whether the interest is financial, administrative, policy making, or supervisory;\n(3) a statement of the assets and liabilities of the applicant;\n(4) an affidavit of the type described in section 240.06, subdivision 1, clause (4);\n(5) an irrevocable consent statement, to be signed by the applicant, which states that suits and actions relating to the subject matter of the application or acts or omissions arising from it may be commenced against the applicant in any court of competent jurisdiction in this state by the service on the secretary of state of any summons, process, or pleadings authorized by the laws of this state. If any summons, process, or pleadings is served upon the secretary of state, it must be by duplicate copies. One copy must be retained in the Office of the Secretary of State and the other copy must be forwarded immediately by certified mail to the address of the applicant, as shown by the records of the commission; and\n(6) an affirmative action plan establishing goals and timetables consistent with the Minnesota Human Rights Act, chapter 363A, and in conformity with the goals established by the commission by rule.\nBefore granting an initial class B license the commission shall hold at least one public hearing on the license. Comprehensive investigations must be conducted and their costs paid in the manner prescribed by section 240.06, subdivision 3. The commission has access to all criminal history data compiled by the Division of Alcohol and Gambling Enforcement on class B licensees and applicants.\n(a) If after considering the information received from the hearing and investigations, the commission determines that the applicant will conduct horse racing in accordance with all applicable laws and rules, will not adversely affect the public health, welfare, and safety, that the license will not create a competitive situation that will adversely affect racing and the public interest and that the applicant is fit to sponsor and manage racing, the commission may issue a class B license.\n(b) If the commission determines that the licensee will operate a card club in accordance with all applicable law and rules and the applicant's approved plan of operation under section 240.30, subdivision 6, that the operation of a card club by the licensee will not adversely affect the public health, welfare, and safety, and that the licensee is fit to operate a card club, the commission may include with the class B license an authorization to conduct a card club at the licensee's class A racetrack as provided in section 240.30. The commission may give an interim authorization for the operation of a card club that is effective until the expiration of the licensee's class B license and may charge for the interim authorization a proportionate amount of the additional class B license fee under section 240.10.\n(c) The license is for a period of one year.\nOn making the same determination as in subdivision 3, the commission may renew a class B license without a hearing unless it determines a hearing to be necessary.\nIf a change in the officers, directors, or other persons with a direct or indirect financial or management interest in the licensee, or a change of ownership of more than five percent of the licensee's shares is made after the initial application or license issuance, the applicant or licensee must notify the commission of the changes within five days of their occurrence and provide the affidavit required in subdivision 1.\nSuspension, revocation, and refusal to renew a class B license is as provided in section 240.06, subdivision 7. A license suspension or revocation or a refusal to renew a class B license, is a contested case under section 14.57 to 14.69 of the Administrative Procedure Act, and is in addition to criminal penalties imposed for a violation of law or rule.\nA person may simultaneously hold one class A and one class B license.",
	"repealed": false
}