{
	"id": "41B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.03",
	"title": "41B.03 BORROWER ELIGIBILITY CRITERIA.",
	"text": "To be eligible for a program in sections 41B.01 to 41B.23:\n(1) a borrower must be a resident of Minnesota or a domestic family farm corporation or family farm partnership, as defined in section 500.24, subdivision 2; and\n(2) the borrower or one of the borrowers must be the principal operator of the farm or, for a prospective homestead redemption borrower, must have at one time been the principal operator of a farm.\nIn addition to the eligibility requirements of subdivision 1, a prospective borrower for a restructured loan must:\n(1) have received at least 50 percent of average annual gross income from farming for the past three years or, for homesteaded property, received at least 40 percent of average gross income from farming in the past three years, and farming must be the principal occupation of the borrower;\n(2) have projected annual expenses, including operating expenses, family living, and interest expenses after the restructuring, that do not exceed 95 percent of the borrower's projected annual income considering prior production history and projected prices for farm production, except that the authority may reduce the 95 percent requirement if it finds that other significant factors in the loan application support the making of the loan;\n(3) demonstrate substantial difficulty in meeting projected annual expenses without restructuring the loan; and\n(4) have a total net worth, including assets and liabilities of the borrower's spouse and dependents, of less than $1,700,000 in 2017 and an amount in subsequent years which is adjusted for inflation by multiplying that amount by the cumulative inflation rate as determined by the United States All-Items Consumer Price Index.\n(a) In addition to the requirements under subdivision 1, a prospective borrower for a beginning farm loan in which the authority holds an interest, must:\n(1) have sufficient education, training, or experience in the type of farming for which the loan is desired;\n(2) have a total net worth, including assets and liabilities of the borrower's spouse and dependents, of less than $800,000 in 2017 and an amount in subsequent years which is adjusted for inflation by multiplying that amount by the cumulative inflation rate as determined by the United States All-Items Consumer Price Index;\n(3) demonstrate a need for the loan;\n(4) demonstrate an ability to repay the loan;\n(5) certify that the agricultural land to be purchased will be used by the borrower for agricultural purposes;\n(6) certify that farming will be the principal occupation of the borrower;\n(7) agree to participate in a farm management program approved by the commissioner of agriculture for at least the first three years of the loan, if an approved program is available within 45 miles from the borrower's residence. The authority may waive this requirement for any of the programs administered by the authority if the participant requests a waiver and has a four-year degree in an agricultural program or related field, reasonable agricultural job-related experience, or certification as an adult farm management instructor; and\n(8) agree to file an approved soil and water conservation plan with the Natural Resources Conservation Service office in the county where the land is located.\n(b) If a borrower fails to participate under paragraph (a), clause (7), the borrower is subject to penalty as determined by the authority.\n[Repealed, 1989 c 273 s 8]\nIn addition to the requirements under subdivision 1, a prospective borrower under the seller-sponsored loan program must either meet the conditions of subdivision 3 if the person is a beginning farmer, or other conditions the authority prescribes if the person is reentering farming through the seller-sponsored loan program.\nThe authority may impose a reasonable nonrefundable application fee for each application submitted for a beginning farmer loan or a seller-sponsored loan. The application fee is initially $50. The authority may review the fee annually and make adjustments as necessary. The fee must be deposited in the state treasury and credited to the Rural Finance Authority administrative account established in subdivision 7.\nThere is established in the agricultural fund a Rural Finance Authority administrative account. Money in the account, including interest, is appropriated to the commissioner of agriculture for the administrative expenses of the loan programs administered by the Rural Finance Authority.",
	"repealed": false
}