{
	"id": "477A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.23",
	"title": "477A.23 SOIL AND WATER CONSERVATION DISTRICT AID.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"nonpublic lands\" means \"real property\" as defined by section 272.03 that is not owned by the federal government, the state, or a local government unit;\n(2) \"population\" means the population estimated as of June 1 in an aid calculation year by the most recent federal census;\n(3) \"transformed population\" means the cube root of population; and\n(4) \"soil and water conservation district\" means a district under chapter 103C that is implementing the duties under that chapter as determined by the Board of Water and Soil Resources as of the date the board provides the certification to the commissioner of revenue required by subdivision 3. For purposes of this section, soil and water conservation district includes a county exercising the duties and authorities of a soil and water conservation district under section 383A.606 or 383B.761.\nThe Board of Water and Soil Resources must calculate the amount of aid to be distributed to the certified soil and water conservation districts from the appropriation in subdivision 6 as follows:\n(1) 80 percent of the appropriation must be distributed equally among the districts;\n(2) 10 percent of the appropriation must be distributed proportionally among the districts according to the amount of nonpublic land located in a district as compared to the amount of nonpublic land in all districts; and\n(3) ten percent of the appropriation must be distributed proportionally among the districts according to the transformed population of the district as compared to the total transformed population of all districts.\nOn or before June 1 each year, the Board of Water and Soil Resources must certify to the commissioner of revenue the soil and water conservation districts that will receive a payment under this section and the amount of each payment.\n(a) Notwithstanding section 103C.401, subdivision 2, a soil and water conservation district that receives a distribution under this section must use the proceeds to implement chapter 103C and other duties and services prescribed by statute.\n(b) The board of each soil and water conservation district must establish, by resolution, annual guidelines for using payments received under this section. Current year guidelines and guidelines from the year immediately prior must be posted on the district website.\n(c) A soil and water conservation district that receives a payment under this section may appropriate any portion of the payment to a governmental unit with which the district has a cooperative agreement under section 103C.231. Any payment received under this section and appropriated by the district must be used as required by this section.\nThe commissioner of revenue must distribute soil and water conservation district aid in the same manner and at the same times as aid payments provided under section 477A.015.\nFor aids payable in 2023 and 2024, $15,000,000 is appropriated in each year from the general fund to the commissioner of revenue to make the payments required under this section. For aids payable in 2025 and thereafter, $12,000,000 is annually appropriated from the general fund to the commissioner of revenue to make the payments required under this section.\nIf, due to a clerical error, the amount certified by the Board of Water and Soil Resources to the commissioner of revenue is less than the amount to which the district is entitled under this section, the Board of Water and Soil Resources shall recertify the correct amount to the commissioner of revenue and communicate the error and the corrected amount to the affected soil and water conservation district as soon as practical after the error is discovered.",
	"repealed": false
}