{
	"id": "473.823",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.823",
	"title": "473.823 RULES AND PERMITS.",
	"text": "MS 1978 [Repealed, 1980 c 564 art 13 s 2]\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\n(a) The agency shall request applicants for solid waste facility permits to submit all information deemed relevant by the commissioner for review, including without limitation information relating to the geographic areas and population served, the need, the effect on existing facilities and services, the effectiveness of proposed buffer areas to ensure, at a minimum, protection of surrounding land uses from adverse or incompatible impacts due to landfill operation and related activities, the anticipated public cost and benefit, the anticipated rates and charges, the manner of financing, the effect on metropolitan plans and development programs, the supply of waste, anticipated markets for any product, and alternative means of disposal or energy production.\n(b) A permit may not be issued for the operation of a solid waste facility in the metropolitan area which is not in accordance with the metropolitan policy plan. The commissioner shall determine whether a permit is in accordance with the policy plan. In making this determination, the commissioner shall consider the areawide need and benefit of the applicant facility and the effectiveness of proposed buffer areas to adequately protect surrounding land uses in accordance with the policy plan, and may consider, without limitation, the effect of the applicant facility on existing and planned solid waste facilities.\n(c) If the commissioner determines that a permit is in accordance with the policy plan, the commissioner shall approve the permit. If the commissioner determines that a permit is not in accordance with the policy plan, the commissioner shall disapprove the permit. Approval of permits may be subject to conditions the commissioner determines are necessary to satisfy criteria and standards in the policy plan, including conditions respecting the type, character, and quantities of waste to be processed at a solid waste facility used primarily for resource recovery and the geographic territory from which a resource recovery facility or transfer station serving such a facility may draw its waste.\n(d) A permit may not be issued in the metropolitan area for a solid waste facility used primarily for resource recovery or a transfer station serving the facility, if the facility or station is owned or operated by a public agency or if the acquisition or betterment of the facility or station is secured by public funds or obligations issued by a public agency, unless the commissioner finds and determines that adequate markets exist for the products recovered and that establishment of the facility is consistent with the criteria and standards in the metropolitan and county plans respecting the protection of existing resource recovery facilities and transfer stations serving such facilities.\nMS 1978 [Repealed, 1980 c 564 art 13 s 2]\n(a) A metropolitan county may establish a waste processing facility within the county without complying with local ordinances, if the action is approved by the commissioner in accordance with the review process established by this subdivision. A county requesting review shall show that:\n(1) the required permits for the proposed facility have been or will be issued by the agency;\n(2) the facility is consistent with the metropolitan policy plan and the approved county plan; and\n(3) a local government unit has refused to approve the establishment or operation of the facility, has failed to deny or approve establishment or operation of the facility within the time period required in section 115A.31, or has approved the application or request with conditions that are unreasonable or impossible for the county to meet.\n(b) The commissioner shall commence the review within 90 days of the submission of a request determined by the commissioner to satisfy the requirements for review under this subdivision. Upon commencing the review the commissioner shall establish a scope and procedure, including criteria, for the review and final decision on the proposed facility. The procedure shall require the commissioner to make a final decision on the proposed facility within 120 days following the commencement of review. For facilities other than waste incineration and mixed municipal solid waste composting facilities, the commissioner shall commence the review within 45 days of submission of the request and shall make a final decision within 75 days following commencement of review.\n(c) The commissioner shall conduct at least one public hearing in the city or town within which the proposed facility would be located. Notice of the hearing shall be published in a newspaper or newspapers of general circulation in the area for two successive weeks ending at least 15 days before the date of the hearing. The notice shall describe the proposed facility, its location, the proposed permits, and the scope, procedure, and criteria for review. The notice shall identify a location or locations within the local government unit and county where the permit applications and the scope, procedure, and criteria for review are available for review and where copies may be obtained.\n(d) In the review and final decision on the proposed facility, the commissioner shall consider at least the following matters:\n(1) the risk and effect of the proposed facility on local residents, units of government, and the local public health, safety, and welfare, and the degree to which the risk or effect may be alleviated;\n(2) the consistency of the proposed facility with, and its effect on, existing and planned local land use and development; local laws, ordinances, and permits; and local public facilities and services;\n(3) the adverse effects of the facility on agriculture and natural resources and opportunities to mitigate or eliminate such adverse effects by additional stipulations, conditions, and requirements respecting the design and operation of the proposed facility at the proposed site;\n(4) the need for the proposed facility and the availability of alternative sites;\n(5) the consistency of the proposed facility with the county plan adopted pursuant to section 473.803 and the policy plan adopted pursuant to section 473.149; and\n(6) transportation facilities and distance to points of waste generation.\n(e) The commissioner may either approve or disapprove the proposed facility at the proposed site. The approval shall embody all terms, conditions, and requirements of the permitting state agencies, provided that the commissioner may require more stringent permit terms, conditions, and requirements respecting the design, construction, operation, inspection, monitoring, and maintenance of the proposed facility at the proposed site.\nNo new mixed municipal solid waste disposal facility or capacity shall be permitted in the metropolitan area without a certificate of need issued by the commissioner indicating a determination that the additional disposal capacity planned for the facility is needed in the metropolitan area. The commissioner shall amend the policy plan, adopted pursuant to section 473.149, to include standards and procedures for certifying need that conform to the certification standards stated in this subdivision. The standards and procedures shall be based on the metropolitan disposal abatement plan adopted pursuant to section 473.149, subdivision 2d, the solid waste disposal facilities development schedule adopted under section 473.149, subdivision 2e, and the provisions of any plans of counties that have been approved under section 473.803, subdivision 2, and that are consistent with the abatement plan and development schedule. The commissioner shall certify need only to the extent that there are no feasible and prudent alternatives to the disposal facility, including waste reduction, source separation and resource recovery which would minimize adverse impact upon natural resources. Alternatives that are speculative or conjectural shall not be deemed to be feasible and prudent. Economic considerations alone shall not justify the certification of need or the rejection of alternatives.",
	"repealed": false
}