{
	"id": "216C.391",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.391",
	"title": "216C.391 MINNESOTA STATE COMPETITIVENESS FUND.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Competitive funds\" means federal funds awarded to selected applicants based on the grantor's evaluation of the strength of an application measured against all other applications.\n(c) \"Disadvantaged community\" has the meaning given by the federal agency disbursing federal funds.\n(d) \"Eligible entity\" means an entity located in Minnesota that is eligible to receive federal funds, tax credits, loans, or an entity that has at least one Minnesota-based partner, as determined by the grantor of the federal funds, tax credits, or loans.\n(e) \"Federal funds\" means federal formula or competitive funds available for award to applicants for energy projects under the Infrastructure Investment and Jobs Act, Public Law 117-58, or the Inflation Reduction Act of 2022, Public Law 117-169.\n(f) \"Formula funds\" means federal funds awarded to all eligible applicants on a noncompetitive basis.\n(g) \"Loans\" means federal loans from loan funds authorized or funded in the Inflation Reduction Act of 2022, Public Law 117-169.\n(h) \"Match\" means the amount of state money a successful grantee in Minnesota is required to contribute to a project as a condition of receiving federal funds.\n(i) \"Political subdivision\" has the meaning given in section 331A.01, subdivision 3.\n(j) \"Project\" means the activities proposed to be undertaken by an eligible entity awarded federal funds and are located in Minnesota or will directly benefit Minnesotans.\n(k) \"Tax credits\" means federal tax credits authorized in the Inflation Reduction Act of 2022, Public Law 117-169.\n(l) \"Tribal government\" has the meaning given in section 116J.64, subdivision 4.\n(a) A state competitiveness fund account is created in the special revenue fund of the state treasury. The commissioner must credit to the account appropriations and transfers to the account. Earnings, such as interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund but remains available until June 30, 2034. The commissioner is the fiscal agent and must manage the account.\n(b) Money in the account is appropriated to the commissioner and must be used to:\n(1) pay all or any portion of the state match required as a condition of receiving federal funds, or to otherwise reduce the cost for projects that are awarded federal funds, as described under subdivision 3, paragraph (a);\n(2) award grants under subdivision 4 to obtain grant development assistance for eligible entities;\n(3) award grants that reduce the cost for projects that are awarded federal loans within disadvantaged communities;\n(4) award grants that are additive to federal tax credits received by an eligible entity to further reduce the cost of the technologies and activities eligible for such federal tax credits in disadvantaged communities; and\n(5) pay the reasonable costs incurred by the department to assist eligible entities to successfully compete for available federal funds and utilize available federal tax credits or loans.\n(a) Grants may be awarded under this section to eligible entities in accordance with the following order of priorities:\n(1) federal formula funds directed to the state that require a match;\n(2) federal funds directed to a political subdivision or a Tribal government that require a match;\n(3) federal funds directed to an institution of higher education, a consumer-owned utility, a business, or a nonprofit organization that require a match;\n(4) federal funds directed to investor-owned utilities that require a match;\n(5) federal funds directed to an eligible entity not included in clauses (1) to (4) that require a match; and\n(6) all other grant opportunities directed to eligible entities that do not require a match but for which the commissioner determines that a grant made under this section is likely to enhance the likelihood of an applicant receiving federal funds, or to increase the potential amount of federal funds received.\n(b) By November 15, 2023, the commissioner must develop and publicly post, and report to the chairs and ranking minority members of the legislative committees with jurisdiction over energy finance, the federal energy grant funds that are eligible for state matching funds under this section.\nGrants may be awarded under this section to entities with expertise and experience in grant development to assist eligible entities to prepare grant applications for federal funds. Eligible grantees under this subdivision include regional development commissions established in section 462.387, the West Central Initiative Foundation, Minnesota Municipal Utilities Association, Minnesota Rural Electric Association, consumer-owned utilities, Tribal governments, and any entity the commissioner determines will enhance the competitiveness of grant applications by disadvantaged communities and from eligible entities located in areas not served by a regional development commission.\n(a) For grants that meet the criteria in subdivision 3, paragraph (a), clauses (1) to (3), the maximum grant award for each entity is 100 percent of the required match.\n(b) For grants that meet the criteria in subdivision 3, paragraph (a), clauses (4) and (5), the maximum grant award is 50 percent of the required match, except that if the commissioner determines that at least 40 percent of the direct benefits resulting from a project awarded federal funds would be realized by residents of a disadvantaged community, the commissioner may award up to 100 percent of the required match.\n(c) For projects that meet the criteria in subdivision 3, paragraph (a), clause (6), the commissioner may award a grant up to ten percent of the amount of federal funds requested by the applicant, except that if the commissioner determines that at least 40 percent of the direct benefits resulting from a project awarded federal funds would be realized by residents of a disadvantaged community, the commissioner may award up to 20 percent of the amount of federal funds requested.\n(d) Except for the commissioner, when matching federal funds are directed to the state, no single entity may receive, as an award or subaward, grants under this subdivision totaling more than $15,000,000.\n(e) The maximum grant award for each entity under subdivision 4 is $300,000.\n(a) An eligible entity seeking a grant award under subdivision 3 or an entity seeking a grant award under subdivision 4 must submit an application to the commissioner on a form prescribed by the commissioner. The commissioner is responsible for receiving and reviewing grant applications and awarding grants under this section, and shall develop administrative procedures governing the application, evaluation, and award process. The commissioner may not make a grant award under this section unless the commissioner has determined, and has notified the applicant in writing, that the application is complete. In awarding grants under this section, the commissioner shall endeavor to make awards to applicants from all regions of the state.\n(b) The department must provide technical assistance to applicants. Applicants may also receive grant development assistance at no cost from entities awarded grants for that purpose under subdivision 4.\n(c) Within ten business days of determining a grant award amount to an applicant, the commissioner must:\n(1) reserve that amount for that specific grant in the state competitiveness fund account; and\n(2) notify the Legislative Advisory Commission in writing of the reserved amount, the name of the applicant, the purpose of the project, and the unreserved balance of funds remaining in the account.\n(d) Reserved funds are committed to the grant and use specified in the notice provided under paragraph (c) and are unavailable for reservation or appropriation for other applications unless and until the commissioner receives written notice from the applicant that the application for federal funds has been withdrawn or from the federal grantor that the application for which funds from the account were reserved has been denied federal funds.\n(e) Reserved funds may only be expended upon presentation of written notice from the federal grantor to the commissioner stating that the applicant will receive federal funds for the project described in the application. If the amount of federal funds awarded to an applicant differs from the amount requested in the application, the commissioner may adjust the award made under this section accordingly.\n(f) Reserved funds must be made for projects that demonstrate they will help meet the state's clean energy and energy-related climate goals through renewable energy development, energy conservation, efficiency, or energy-related greenhouse gas reduction benefits.\n(g) The commissioner must notify the chairs and ranking minority members of the legislative committees with jurisdiction over energy finance when the unreserved balance of the competitiveness fund account reaches the following amounts: 50 percent, unreserved; 25 percent, unreserved; 15 percent, unreserved; and five percent. The notification must be within ten days after each level of unreserved balance is reached.\nBeginning February 15, 2024, and each February 15 thereafter until February 15, 2035, the commissioner must submit a written report to the chairs and ranking minority members of the legislative committees with jurisdiction over energy finance on the activities taken and expenditures made under this section. The report must, at a minimum, include the following information for the most recent calendar year:\n(1) the number of applications for grants filed with the commissioner and the total amount of grant funds requested;\n(2) each grant awarded;\n(3) the number of additional personnel hired for the purposes of this section;\n(4) expenditures on activities conducted under this section, reported separately for these areas:\n(i) the provision of technical assistance;\n(ii) grants made under subdivision 4 to entities to assist applicants with grant development;\n(iii) application review and evaluation, including applicants that were denied federal or state grant awards and the reason for the denial;\n(iv) information technology activities; and\n(v) other expenditures;\n(5) the unreserved balance remaining in the state competitiveness fund account;\n(6) a copy of a financial audit of the department's expenditures under this section conducted by an independent auditor;\n(7) recommendations for legislation to enhance the ability of eligible entities to successfully compete for federal funds;\n(8) additional available funding opportunities to obtain energy-related funding from federal agencies; and\n(9) federal grant program changes that would affect the federal funds available to the state and eligible applicants, including changes that would affect the required match for receiving federal funds.",
	"repealed": false
}