{
	"id": "60A.052",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.052",
	"title": "60A.052 CERTIFICATES OF AUTHORITY; ENFORCEMENT ACTIONS.",
	"text": "The commissioner may by order take any or all of the following actions: (a) deny, suspend, or revoke a certificate of authority; (b) censure the insurance company; (c) impose a civil penalty as provided for in section 45.027, subdivision 6; or (d) under a written agreement with the insurance company based upon the company's financial condition, impose conditions or restrictions on the insurance company's authority to transact business in Minnesota. In order to take this action the commissioner must find that the order is in the public interest, and the insurance company:\n(1) has a board of directors or principal management that is incompetent, untrustworthy, or so lacking in insurance company managerial experience as to make its operation hazardous to policyholders, its stockholders, or to the insurance buying public;\n(2) is controlled directly or indirectly through ownership, management, reinsurance transactions, or other business relations by any person or persons whose business operations are or have been marked by manipulation of any assets, reinsurance, or accounts as to create a hazard to the company's policyholders, stockholders, or the insurance buying public;\n(3) is in an unsound or unsafe condition;\n(4) has the actual liabilities that exceed the actual funds of the company;\n(5) has filed an application for a license which is incomplete in any material respect or contains any statement which, in light of the circumstances under which it was made, contained any misrepresentation or was false, misleading, or fraudulent;\n(6) has pled guilty, with or without explicitly admitting guilt, pled nolo contendere, or been convicted of a felony, gross misdemeanor, or misdemeanor involving moral turpitude, or similar conduct;\n(7) is permanently or temporarily enjoined by any court of competent jurisdiction from engaging in or continuing any conduct or practice involving any aspect of the insurance business;\n(8) has violated or failed to comply with any order of the insurance regulator of any other state or jurisdiction;\n(9) has had a certificate of authority denied, suspended, or revoked, has been censured or reprimanded, has been the subject of any other discipline imposed by, or has paid or has been required to pay a monetary penalty or fine to, another state;\n(10) agents, officers, or directors refuse to submit to examination or perform any related legal obligation; or\n(11) has violated or failed to comply with, any of the provisions of the insurance laws including chapter 45 or chapters 60A to 72A or any rule or order under those chapters.\nIf the commissioner determines that one of the conditions listed in subdivision 1 exists, the commissioner may issue an order requiring the insurance company to show cause why any or all of the following should not occur: (1) revocation or suspension of any or all certificates of authority granted to the foreign or domestic insurance company or its agent; (2) censuring of the insurance company; (3) cancellation of all or some of the company's insurance contracts then in force in this state; (4) the imposition of a civil penalty; or (5) under a written agreement with the insurance company based upon the company's financial condition, imposition of conditions or restrictions on the insurance company's authority to transact business in Minnesota. The order shall be calculated to give reasonable notice of the time and place for hearing thereon, and shall state the reasons for the entry of the order. All hearings shall be conducted in accordance with chapter 14. The insurer may waive its right to the hearing. If the insurer is under the supervision or control of the insurance department of the insurer's state of domicile, that insurance department, acting on behalf of the insurer, may waive the insurer's right to the hearing. After the hearing, the commissioner shall enter an order disposing of the matter as the facts require. If the insurance company fails to appear at a hearing after having been duly notified of it, the company shall be considered in default, and the proceeding may be determined against the company upon consideration of the order to show cause, the allegations of which may be considered to be true.\nWhenever it appears to the commissioner that an application for a certificate of authority should be denied pursuant to subdivision 1, the commissioner shall promptly give a written notice to the applicant of the denial. The notice must state the grounds for the denial and give reasonable notice of the rights of the applicant to request a hearing. A hearing must be held not later than 30 days after the request for hearing is received by the commissioner unless the applicant and the Department of Commerce agree that the hearing may be held at a later date. If no hearing is requested within 30 days of service of the notice, the denial will become final. All hearings shall be conducted in accordance with chapter 14. After the hearing, the commissioner shall enter an order disposing of the matter as the facts require. If the applicant fails to appear at a hearing after having been duly notified of it, the applicant shall be considered in default, and the proceeding may be determined against the applicant upon consideration of the notice denying the application, the allegations of which may be considered to be true.\nIf a certificate of authority lapses, is surrendered, withdrawn, terminated, or otherwise becomes ineffective, the commissioner may institute a proceeding under this subdivision within two years after the certificate of authority was last effective and enter a revocation or suspension order as of the last date on which the certificate of authority was in effect, or impose a civil penalty as provided for in section 45.027, subdivision 6.\nNo insurer shall withdraw from this state until its direct liability to its policyholders and obligees under all its insurance contracts then in force in this state have been assumed by another licensed insurer according to section 60A.09, subdivision 4a.",
	"repealed": false
}