{
	"id": "412.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.021",
	"title": "412.021 OFFICERS.",
	"text": "Upon the filing of the certificate with the secretary of state, if the vote is in favor of incorporation, the judges of election appointed by the chief administrative law judge of the state Office of Administrative Hearings or the county board as the case may be, shall fix a day at least 15 and not more than 30 days thereafter and a place for the holding of an election for officers. The judges shall also fix the time, not less than three hours, during which the polls shall remain open at the election and shall post a notice setting forth the time and place of such election in three public places in the city for at least ten days preceding the election.\nThere shall be elected at the election a mayor for a term expiring the first business day of January of the next odd-numbered year and four or six council members, for terms so arranged that half expire the first business day of January of the next odd-numbered year and half the first business day of January of the second odd-numbered year. No candidate for council member shall run for a particular term but the number of years in the term of each successful candidate shall be determined by the relative standing among the candidates for office, the longest terms going to the half of the elected candidates who received the highest number of votes. If the election occurs in the last four months of the even-numbered year, no election shall be held in the city on the annual city election day that year, and the next following year shall be disregarded in fixing the expiration of terms of officers chosen under this subdivision at the initial election.\nMS 1967 [Repealed, 1969 c 1146 s 20]\nMS 1967 [Repealed, 1969 c 1146 s 20]\nAfter the qualification of its members, the council may by ordinance fix the salaries of the mayor and council members. Notwithstanding the provisions of section 415.11, subdivision 2, the ordinance shall not become effective for at least ten days after publication in the official newspaper; and if, before the end of that time a petition asking for an election on the ordinance signed by voters equal to ten percent of the number of voters at the incorporation election is filed with the clerk, the ordinance shall not become effective until it is approved by a majority of the votes cast on the question at a regular or special election.",
	"repealed": false
}