{
	"id": "142E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.04",
	"title": "142E.04 BASIC SLIDING FEE PROGRAM.",
	"text": "By October 1 of each year, the commissioner shall notify all counties of their final child care fund program allocation.\nEach county that receives funds under this section must keep a written record and report to the commissioner the number of eligible families who have applied for a child care subsidy or have requested child care assistance. Counties shall perform a preliminary determination of eligibility when a family requests child care assistance. At a minimum, a county must make a preliminary determination of eligibility based on family size, income, and authorized activity. A family seeking child care assistance must provide the required information to the county. A family that appears to be eligible must be put on a waiting list if funds are not immediately available. The waiting list must identify students in need of child care. Counties must review and update their waiting list at least every six months.\nFamilies that meet the eligibility requirements under sections 142E.10 and 142E.12, except MFIP participants and transition year families, are eligible for child care assistance under the basic sliding fee program. Families enrolled in the basic sliding fee program shall be continued until they are no longer eligible. Child care assistance provided through the child care fund is considered assistance to the parent.\n[See Note.]\n(a) In the event that inadequate funding necessitates the use of waiting lists, priority for child care assistance under the basic sliding fee assistance program shall be determined according to this subdivision.\n(b) First priority must be given to eligible non-MFIP families who do not have a high school diploma or commissioner of education-selected high school equivalency certification or who need remedial and basic skill courses in order to pursue employment or to pursue education leading to employment and who need child care assistance to participate in the education program. This includes student parents as defined under section 142E.01, subdivision 26. Within this priority, the following subpriorities must be used:\n(1) child care needs of minor parents;\n(2) child care needs of parents under 21 years of age; and\n(3) child care needs of other parents within the priority group described in this paragraph.\n(c) Second priority must be given to families in which at least one parent is a veteran, as defined under section 197.447.\n(d) Third priority must be given to eligible families who do not meet the specifications of paragraph (b), (c), (e), or (f).\n(e) Fourth priority must be given to families who are eligible for portable basic sliding fee assistance through the portability pool under subdivision 10.\n(f) Fifth priority must be given to eligible families receiving services under section 142E.01, subdivision 27, if the parents have completed their MFIP transition year.\n(g) Families under paragraph (f) must be added to the basic sliding fee waiting list on the date they complete their transition year under section 142E.01, subdivision 28.\n[See Note.]\n(a) After each quarter, the commissioner shall review the use of basic sliding fee program allocations by county. The commissioner may reallocate unexpended or unencumbered money among those counties who have expended their full allocation or may allow a county to expend up to ten percent of its allocation in the subsequent allocation period.\n(b) Any unexpended state and federal appropriations from the first year of the biennium may be carried forward to the second year of the biennium.\nThe allocation component of basic sliding fee state and federal funds shall be allocated on a calendar year basis. Funds shall be allocated first in amounts equal to each county's guaranteed floor according to subdivision 9, with any remaining available funds allocated according to the following formula:\n(a) One-fourth of the funds shall be allocated in proportion to each county's total expenditures for the basic sliding fee child care program reported during the most recent fiscal year completed at the time of the notice of allocation.\n(b) Up to one-fourth of the funds shall be allocated in proportion to the number of families participating in the transition year child care program as reported during and averaged over the most recent six months completed at the time of the notice of allocation. Funds in excess of the amount necessary to serve all families in this category shall be allocated according to paragraph (e).\n(c) Up to one-half of the funds shall be allocated in proportion to the average of each county's most recent 12 months of reported waiting list as defined in subdivision 2 and the reinstatement list of those families whose assistance was terminated with the approval of the commissioner under Minnesota Rules, part 3400.0183, subpart 1. Funds in excess of the amount necessary to serve all families in this category shall be allocated according to paragraph (e).\n(d) The amount necessary to serve all families in paragraphs (b) and (c) shall be calculated based on the basic sliding fee average cost of care per family in the county with the highest cost in the most recently completed calendar year.\n(e) Funds in excess of the amount necessary to serve all families in paragraphs (b) and (c) shall be allocated in proportion to each county's total expenditures for the basic sliding fee child care program reported during the most recent fiscal year completed at the time of the notice of allocation.\nWhen funding increases are implemented within a calendar year, every county must receive an allocation at least equal to its original allocation for the same time period. The remainder of the allocation must be recalculated to reflect the funding increase, according to formulas identified in subdivision 7.\nWhen funding decreases are implemented within a calendar year, county allocations must be reduced in an amount proportionate to the reduction in the total allocation for the same time period. This applies when a funding decrease necessitates the revision of an existing calendar year allocation.\n(a) Each county's guaranteed floor shall equal 90 percent of the allocation received in the preceding calendar year.\n(b) When the amount of funds available for allocation is less than the amount available in the previous year, each county's previous year allocation shall be reduced in proportion to the reduction in the statewide funding, for the purpose of establishing the guaranteed floor.\n(a) The commissioner shall establish a pool of up to five percent of the annual appropriation for the basic sliding fee program to provide continuous child care assistance for eligible families who move between Minnesota counties. At the end of each allocation period, any unspent funds in the portability pool must be used for assistance under the basic sliding fee program. If expenditures from the portability pool exceed the amount of money available, the reallocation pool must be reduced to cover these shortages.\n(b) A family that has moved from a county in which it was receiving basic sliding fee assistance to a county with a waiting list for the basic sliding fee program must:\n(1) meet the income and eligibility guidelines for the basic sliding fee program; and\n(2) notify the family's previous county of residence of the family's move to a new county of residence.\n(c) The receiving county must:\n(1) accept administrative responsibility for applicants for portable basic sliding fee assistance at the end of the two months of assistance under the Unitary Residency Act;\n(2) continue portability pool basic sliding fee assistance until the family is able to receive assistance under the county's regular basic sliding program; and\n(3) notify the commissioner through the quarterly reporting process of any family that meets the criteria of the portable basic sliding fee assistance pool.\nTwo or more methods of applying for the basic sliding fee program must be available to applicants in each county. To meet the requirements of this subdivision, a county may provide alternative methods of applying for assistance, including, but not limited to, a mail application, or application sites that are located outside of government offices.",
	"repealed": false
}