{
	"id": "201.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.221",
	"title": "201.221 RULES.",
	"text": "To implement the provisions of this chapter, the secretary of state shall adopt rules consistent with federal and state election laws.\nThe secretary of state shall assist local election officers by devising uniform forms and procedures. The secretary of state shall provide uniform rules for maintaining voter registration records on the statewide registration system. The secretary of state shall supervise the development and use of the statewide registration system to insure that it conforms to applicable federal and state laws and rules.\nThe secretary of state shall prescribe the form of paper polling place rosters that include the voter's name, address, date of birth, school district number, and space for the voter's signature. An electronic roster and the voter signature certificate together must include the same information as a paper polling place roster. The secretary of state may prescribe additional election-related information to be placed on the polling place rosters on an experimental basis for one state primary and general election cycle; the same information may not be placed on the polling place roster for a second state primary and general election cycle unless specified in this subdivision. The polling place roster must be used to indicate whether the voter has voted in a given election. The secretary of state shall prescribe procedures for transporting the polling place rosters to the election judges for use on election day. The secretary of state shall prescribe the form for a county or municipality to request the date of birth from currently registered voters. The county or municipality shall not request the date of birth from currently registered voters by any communication other than the prescribed form and the form must clearly indicate that a currently registered voter does not lose registration status by failing to provide the date of birth. In accordance with section 204B.40, the county auditor shall retain the prescribed polling place rosters used on the date of election for 22 months following the election.\nThe county auditor of each county may adopt rules that delegate to the secretary of state or municipal officials in that county the duties assigned to county auditors by this chapter. Delegation of duties to the secretary of state requires the approval of the secretary of state. Delegation to a municipal official requires the approval of the governing body of the municipality. Delegation by the county auditor of the duty to accept registrations does not relieve the county auditor of the duty to accept registrations. Each delegation agreement must include a plan to allocate the costs of the duties to be delegated.",
	"repealed": false
}