{
	"id": "428B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/428B.02",
	"title": "428B.02 ESTABLISHMENT OF TOURISM IMPROVEMENT DISTRICT.",
	"text": "(a) Upon a petition by impacted business owners, a governing body of a municipality may adopt an ordinance establishing a tourism improvement district after holding a public hearing on the district. The ordinance must include:\n(1) a map that identifies the tourism improvement district boundaries in sufficient detail to allow a business owner to determine whether a business is located within the tourism improvement district boundaries;\n(2) the name of the tourism improvement association designated to administer the tourism improvement district and implement the approved activities and improvements;\n(3) a list of the proposed activities and improvements in the tourism improvement district;\n(4) the time and manner of collecting the service charge and any interest and penalties for nonpayment;\n(5) a definition describing the type or class of businesses to be included in the tourism improvement district and subject to the service charge;\n(6) the rate, method, and basis of the service charge with intent, and penalties on delinquent payments for the district, including the portion dedicated to covering expenses listed in subdivision 4, paragraph (b); and\n(7) the number of years the service charge will be in effect.\n(b) If the boundaries of a proposed tourism improvement district overlap with the boundaries of an existing special service district, the tourism improvement district ordinance may list measures to avoid any impediments on the ability of the special service district to continue to provide its services to benefit its property owners.\nA municipality must provide notice of the hearing by publication in at least two issues of the official newspaper of the municipality. The two publications must be two weeks apart and the municipality must hold the hearing at least three days after the last publication. Not less than ten days before the hearing, the municipality must mail, or deliver by electronic means, notice to the business owner of each business subject to the proposed service charge by the tourism improvement district. The notice must include:\n(1) a map showing the boundaries of the proposed district;\n(2) the time and place of the hearing;\n(3) a statement that all interested persons will be given an opportunity to be heard at the hearing regarding the proposed service charge; and\n(4) a brief description of the proposed activities, improvements, and service charge.\nA business must provide ownership information to the municipality. A municipality has no obligation to obtain other information regarding the ownership of businesses, and its determination of ownership shall be final for the purposes of this chapter. If this chapter requires the signature of a business owner, the signature of the authorized representative of a business owner is sufficient.\n(a) A municipality may impose a service charge on a business pursuant to this chapter for the purpose of providing activities and improvements that will provide benefits to a business that is located within the tourism improvement district and subject to the tourism improvement district service charge. Each business paying a service charge within a district must benefit directly or indirectly from improvements provided by a tourism improvement association, provided, however, the business need not benefit equally. Service charges must be based on a percent of gross business revenue, a fixed dollar amount per transaction, or any other reasonable method based upon benefit and approved by the municipality.\n(b) Service charges may be used to cover the costs of collections, as well as other administrative costs associated with operating, forming, or maintaining the district.\nAt the hearing regarding the adoption of the ordinance establishing a tourism improvement district, business owners and persons affected by the proposed district may testify on issues relevant to the proposed district. The hearing may be adjourned from time to time. The ordinance establishing the district may be adopted at any time within six months after the date of the conclusion of the hearing by a vote of the majority of the governing body of the municipality.\nWithin 45 days after the adoption of the ordinance establishing a tourism improvement district, a person aggrieved, who is not precluded by failure to object before or at the hearing, may appeal to the district court by serving a notice on the clerk of the municipality or governing body. The validity of the tourism improvement district and the service charge imposed under this chapter shall not be contested in an action or proceeding unless the action or proceeding is commenced within 45 days after the adoption of the ordinance establishing a tourism improvement district. The petitioner must file notice with the court administrator of the district court within ten days after its service. The clerk of the municipality must provide the petitioner with a certified copy of the findings and determination of the governing body. The court may affirm the action objected to or, if the petitioner's objections have merit, modify or cancel it. If the petitioner does not prevail on the appeal, the costs incurred shall be charged to the petitioner by the court and judgment entered for them. All objections shall be deemed waived unless presented on appeal.\nWithin 30 days of adoption of the ordinance, the governing body must send a copy of the ordinance to the commissioner of revenue.",
	"repealed": false
}