{
	"id": "16C.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.26",
	"title": "16C.26 COMPETITIVE BIDS OR PROPOSALS.",
	"text": "Except as otherwise provided by section 16C.10 and this section, all contracts for building and construction or repairs must be based on competitive bids or proposals. \"Competitive proposals\" specifically refers to the method of procurement described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nStandard requirement price contracts for building and construction must be established by competitive bids as provided in subdivision 1. The standard requirement price contracts may contain escalation clauses and may provide for a negotiated price increase or decrease based upon a demonstrable industrywide or regional increase or decrease in the vendor's costs or for the addition of similar products or replacement items not significant to the total value of existing contracts. The term of these contracts may not exceed five years including all extensions.\nIf the amount of an expenditure is estimated to exceed $25,000, bids or proposals must be solicited by public notice in a manner designated by the commissioner. To the extent practical, this must include posting on a state website. For expenditures over $50,000, when a solicitation is issued, the commissioner shall solicit sealed responses by posting notices at least seven days before the due date and time. All bids over $50,000 must be sealed when they are received and must be opened in public or electronically at the hour stated in the notice. All proposals responsive to a request for proposals according to section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c), shall be submitted and evaluated in the manner described in the request for proposals, regardless of the dollar amount. All original bids and proposals and all documents pertaining to the award of a contract must be retained and made a part of a permanent file or record and remain open to public inspection.\nAn informal bid may be used for building, construction, and repair contracts that are estimated at less than $50,000. Informal bids must be authenticated by the bidder in a manner specified by the commissioner. Alternatively, a request for proposals may be issued according to section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c), for such contracts.\nContracts must be based on the standard specifications prescribed and enforced by the commissioner under this chapter, unless otherwise expressly provided or as authorized under section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c). Each vendor or contractor must furnish security approved by the commissioner to ensure the making of the contract being bid for.\nMS 2012 [Renumbered 16C.06, subd 11]",
	"repealed": false
}