{
	"id": "219.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.46",
	"title": "219.46 UNLAWFUL STRUCTURE; CLEARANCE.",
	"text": "(a) On and after April 16, 1913, it is unlawful for a common carrier or any other person, on a standard gauge road on its line or a standard gauge sidetrack, for use in any traffic mentioned in section 219.45:\n(1) to erect or reconstruct and maintain an adjoining warehouse, coal chute, stock pen, pole, mail crane, standpipe, hog drencher, or any permanent or fixed structure or obstruction within eight feet of the centerline of the track or sidetrack;\n(2) in excavating, to allow an adjoining embankment of earth or natural rock to remain within eight feet of the centerline of the track or sidetrack; or\n(3) to erect or reconstruct overhead wires, bridges, viaducts or other obstructions passing over or above its tracks at a height less than 21 feet, measured from the top of the track rail.\n(b) If after May 1, 1943, overhead structures or platforms or structures designed only to be used in the loading or unloading of cars are rebuilt or remodeled, then these overhead structures must be built with an overhead clearance of not less than 22 feet from the top of the rail. These structures or platforms must be built with a side clearance of not less than 8-1/2 feet from the centerline of the track unless by order the commissioner may provide otherwise.\n(c) Sections 219.45 to 219.53 do not apply to yards and terminals of: (1) depot companies, or (2) railway companies used only for passenger service. If personal injury is sustained by an employee of a depot company or railway company used only for passenger service, by reason of noncompliance with sections 219.45 to 219.53, that employee, or in case of the employee's death, the personal representative, has the rights, privileges, and immunities enumerated in section 219.53.\n(d) On and after May 1, 1943, it is unlawful for a common carrier or any other person, on a standard gauge road on its line or a standard gauge sidetrack or spur, for use in any traffic mentioned in section 219.45:\n(1) to erect or construct and maintain an adjoining warehouse, coal chute, stock pen, pole, mail crane, standpipe, hog drencher, or any permanent or fixed structure or obstruction within 8-1/2 feet of the centerline of the track;\n(2) in excavating, to allow an adjoining embankment of earth or natural rock to remain within 8-1/2 feet of the centerline of the track or sidetrack; or\n(3) to erect or construct overhead wires, bridges, viaducts, or other obstructions passing over or above its tracks at a height less than 22 feet, measured from the top of the track rail.\n(a) On and after May 1, 1943, it is unlawful for a common carrier to construct track used for moving cars engaged in the movement of traffic if the centerline of the track is within 14 feet from the centerline of any other parallel track which it adjoins.\n(b) In addition, no ladder tracks may be closer to an adjacent ladder track than 19 feet measured from the centerline of each track, nor closer to any other parallel track than 17 feet measured from the centerline of each track.\n(c) The distance between tracks may be diminished or closed up a necessary distance for track intersections, gauntlet tracks, turnouts, or switch points.\nA common carrier or any other person may maintain an overhead structure or structure alongside of a track referred to in this section and section 219.45 if the structure was not erected in violation of law.\n(a) A common carrier or any other person may:\n(1) maintain or reconstruct presently existing tracks constructed after April 16, 1913, in accordance with the then-existing clearance law;\n(2) maintain or reconstruct tracks which, if constructed before April 16, 1913, were constructed with clearances as provided in Laws 1913, chapter 307; or\n(3) maintain or reconstruct tracks built in accordance with Laws 1913, chapter 448.\n(b) As to tracks that were constructed with a clearance less than 13 feet between centerlines before April 16, 1913, the maintenance of a clearance of less than 13 feet between centerlines in railroad switching yards may create a hazard. The commissioner may require adequate and safe clearances as rapidly as possible in the yards on petition by an affected party, after hearing, and where a greater clearance can be reasonably provided.\nIt is not unlawful to extend existing yard tracks or other tracks at the clearance which now exists between them if the tracks were constructed either before or after April 16, 1913, with clearances as provided in Laws 1913, chapter 307.\nIt is not unlawful to construct or maintain additional tracks at less than the required clearance on or under existing bridges which were constructed after April 16, 1913, with clearances as provided in Laws 1913, chapter 307.\nThe commissioner of transportation after a hearing may authorize, in the construction and reconstruction of bridges and tunnels, by general order (1) a clearance less than 8-1/2 feet from the centerline of the track at a height not to exceed six feet above the top of the rail, and (2) a clearance less than 8-1/2 feet from the centerline of the track at a point not less than 14-1/2 feet above the top of the rail.",
	"repealed": false
}