{
	"id": "394.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.30",
	"title": "394.30 COUNTY BOARD'S PLANNING COMMISSION.",
	"text": "Any board of county commissioners may by ordinance appoint a planning commission composed of not less than five nor more than 11 members appointed by the chair of the board. At least two members shall be residents of the portion of the county outside the corporate limits of municipalities. The manner of appointment and terms of office of the members shall be as provided in the ordinance. No more than one voting member of the commission shall be an officer or employee of the county. No voting member of the commission shall have received, during the two years prior to appointment, any substantial portion of income from business operations involving the development of land within the county for urban and urban related purposes. In the ordinance establishing the planning commission the board may designate any county officer or employee as an ex officio member of such commission. The term of office and removal of any member for nonperformance of duty or misconduct in office as well as filling vacancies on the board shall be as provided in the ordinance creating the commission.\nMS 1971 [Repealed, 1974 c 571 s 51]\nThe members of the commission, other than members of the board of county commissioners, may be compensated in an amount determined by the county board. All commission members, including county commissioners, may be paid their necessary expenses in attending meetings of the commission and in the conduct of the business of the commission. Nothing in this subdivision shall be construed to prohibit the payment of a per diem to county commissioners pursuant to section 375.055, subdivision 1.\nThe planning commission shall elect a chair and secretary from among its members and cooperate with the planning director and other employees of the county in preparing and recommending to the board for adoption a comprehensive plan and recommendations for plan execution in the form of official controls and other measures, and amendments thereto. In all instances in which the planning commission is not the final authority, as authorized in subdivision 5, the commission shall review all applications for conditional use permits and plans for subdivisions of land and report thereon to the board.\nThe board may by ordinance assign additional duties and responsibilities to the planning commission including but not restricted to the conduct of public hearings, the authority to order the issuance of some or all categories of conditional use permits, the authority to approve some or all categories of subdivisions of land, and the authority to approve some or all categories of planned unit developments. The planning commission may be required by the board to review any comprehensive plans and official controls and any plans for public land acquisition and development sent to the county for that purpose by any local unit of government or any state or federal agency and shall report thereon in writing to the board.",
	"repealed": false
}