{
	"id": "260D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/260D.07",
	"title": "260D.07 REQUIRED PERMANENCY REVIEW HEARING.",
	"text": "(a) When the court has found that the voluntary arrangement is in the child's best interests and that the agency and parent are appropriately planning for the child pursuant to the report submitted under section 260D.06, and the child continues in voluntary foster care as defined in section 260D.02, subdivision 10, for 13 months from the date of the voluntary foster care agreement, or has been in placement for 15 of the last 22 months, the agency must:\n(1) terminate the voluntary foster care agreement and return the child home; or\n(2) determine whether there are compelling reasons to continue the voluntary foster care arrangement and, if the agency determines there are compelling reasons, seek judicial approval of its determination; or\n(3) file a petition for the termination of parental rights.\n(b) When the agency is asking for the court's approval of its determination that there are compelling reasons to continue the child in the voluntary foster care arrangement, the agency shall file a \"Petition for Permanency Review Regarding a Child in Voluntary Foster Care for Treatment\" and ask the court to proceed under this section.\n(c) The \"Petition for Permanency Review Regarding a Child in Voluntary Foster Care for Treatment\" shall be drafted or approved by the county attorney and be under oath. The petition shall include:\n(1) the date of the voluntary placement agreement;\n(2) whether the petition is due to the child's developmental disability or emotional disturbance;\n(3) the plan for the ongoing care of the child and the parent's participation in the plan;\n(4) a description of the parent's visitation and contact with the child;\n(5) the date of the court finding that the foster care placement was in the best interests of the child, if required under section 260D.06, or the date the agency filed the motion under section 260D.09, paragraph (b);\n(6) the agency's reasonable efforts to finalize the permanent plan for the child, including returning the child to the care of the child's family;\n(7) a citation to this chapter as the basis for the petition; and\n(8) evidence as specified in section 260C.712 when a child is placed in a qualified residential treatment program as defined in section 260C.007, subdivision 26d.\n(d) An updated copy of the out-of-home placement plan required under section 260C.212, subdivision 1, shall be filed with the petition.\n(e) The court shall set the date for the permanency review hearing no later than 14 months after the child has been in placement or within 30 days of the petition filing date when the child has been in placement 15 of the last 22 months. The court shall serve the petition together with a notice of hearing by United States mail on the parent, the child age 12 or older, the child's guardian ad litem, if one has been appointed, the agency, the county attorney, and counsel for any party.\n(f) The court shall conduct the permanency review hearing on the petition no later than 14 months after the date of the voluntary placement agreement, within 30 days of the filing of the petition when the child has been in placement 15 of the last 22 months, or within 15 days of a motion to terminate jurisdiction and to dismiss an order for foster care under chapter 260C, as provided in section 260D.09, paragraph (b).\n(g) At the permanency review hearing, the court shall:\n(1) inquire of the parent if the parent has reviewed the \"Petition for Permanency Review Regarding a Child in Voluntary Foster Care for Treatment,\" whether the petition is accurate, and whether the parent agrees to the continued voluntary foster care arrangement as being in the child's best interests;\n(2) inquire of the parent if the parent is satisfied with the agency's reasonable efforts to finalize the permanent plan for the child, including whether there are services available and accessible to the parent that might allow the child to safely be with the child's family;\n(3) inquire of the parent if the parent consents to the court entering an order that:\n(i) approves the responsible agency's reasonable efforts to finalize the permanent plan for the child, which includes ongoing future planning for the safety, health, and best interests of the child; and\n(ii) approves the responsible agency's determination that there are compelling reasons why the continued voluntary foster care arrangement is in the child's best interests; and\n(4) inquire of the child's guardian ad litem and any other party whether the guardian or the party agrees that:\n(i) the court should approve the responsible agency's reasonable efforts to finalize the permanent plan for the child, which includes ongoing and future planning for the safety, health, and best interests of the child; and\n(ii) the court should approve of the responsible agency's determination that there are compelling reasons why the continued voluntary foster care arrangement is in the child's best interests.\n(h) At a permanency review hearing under this section, the court may take the following actions based on the contents of the sworn petition and the consent of the parent:\n(1) approve the agency's compelling reasons that the voluntary foster care arrangement is in the best interests of the child; and\n(2) find that the agency has made reasonable efforts to finalize the permanent plan for the child.\n(i) A child, age 12 or older, may object to the agency's request that the court approve its compelling reasons for the continued voluntary arrangement and may be heard on the reasons for the objection. Notwithstanding the child's objection, the court may approve the agency's compelling reasons and the voluntary arrangement.\n(j) If the court does not approve the voluntary arrangement after hearing from the child or the child's guardian ad litem, the court shall dismiss the petition. In this case, either:\n(1) the child must be returned to the care of the parent; or\n(2) the agency must file a petition under section 260C.141, asking for appropriate relief under sections 260C.301 or 260C.503 to 260C.521.\n(k) When the court approves the agency's compelling reasons for the child to continue in voluntary foster care for treatment, and finds that the agency has made reasonable efforts to finalize a permanent plan for the child, the court shall approve the continued voluntary foster care arrangement, and continue the matter under the court's jurisdiction for the purposes of reviewing the child's placement every 12 months while the child is in foster care.\n(l) A finding that the court approves the continued voluntary placement means the agency has continued legal authority to place the child while a voluntary placement agreement remains in effect. The parent or the agency may terminate a voluntary agreement as provided in section 260D.10. Termination of a voluntary foster care placement of an Indian child is governed by section 260.765, subdivision 4.",
	"repealed": false
}