{
	"id": "604A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.01",
	"title": "604A.01 GOOD SAMARITAN LAW.",
	"text": "A person at the scene of an emergency who knows that another person is exposed to or has suffered grave physical harm shall, to the extent that the person can do so without danger or peril to self or others, give reasonable assistance to the exposed person. Reasonable assistance may include obtaining or attempting to obtain aid from law enforcement or medical personnel. A person who violates this subdivision is guilty of a petty misdemeanor.\n(a) A person who, without compensation or the expectation of compensation, renders emergency care, advice, or assistance at the scene of an emergency or during transit to a location where professional medical care can be rendered, is not liable for any civil damages as a result of acts or omissions by that person in rendering the emergency care, advice, or assistance, unless the person acts in a willful and wanton or reckless manner in providing the care, advice, or assistance. This subdivision does not apply to a person rendering emergency care, advice, or assistance during the course of regular employment, and receiving compensation or expecting to receive compensation for rendering the care, advice, or assistance.\n(b) For the purposes of this section, the scene of an emergency is an area outside the confines of a hospital or other institution that has hospital facilities, or an office of a person licensed to practice one or more of the healing arts under chapter 147, 147A, 148, 150A, or 153. The scene of an emergency includes areas threatened by or exposed to spillage, seepage, fire, explosion, or other release of hazardous materials, and includes ski areas and trails.\n(c) For the purposes of this section, \"person\" includes a public or private nonprofit volunteer firefighter, volunteer police officer, volunteer ambulance attendant, volunteer first provider of emergency medical services, volunteer ski patroller, and any partnership, corporation, association, or other entity.\n(d) For the purposes of this section, \"compensation\" does not include payments, reimbursement for expenses, or pension benefits paid to members of volunteer organizations.\n(e) For purposes of this section, \"emergency care\" includes providing emergency medical care by using or providing an automatic external defibrillator, unless the person on whom the device is to be used objects; or unless the person is rendering this care during the course of regular employment, the person is receiving or expects to receive compensation for rendering this care, and the usual and regular duties of the person include the provision of emergency medical care. \"Automatic external defibrillator\" means a medical device heart monitor and defibrillator that:\n(1) has received approval of its premarket notification, filed pursuant to United States Code, title 21, section 360(k), from the United States Food and Drug Administration;\n(2) is capable of recognizing the presence or absence of ventricular fibrillation or rapid ventricular tachycardia, and is capable of determining, without intervention by an operator, whether defibrillation should be performed; and\n(3) upon determining that defibrillation should be performed, automatically charges and requests delivery of an electrical impulse to an individual's heart.",
	"repealed": false
}