{
	"id": "253D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.02",
	"title": "253D.02 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Administrative restriction\" means any measure utilized by the executive board to maintain safety and security, protect possible evidence, and prevent the continuation of suspected criminal acts. Administrative restriction does not mean protective isolation as defined by Minnesota Rules, part 9515.3090, subpart 4. Administrative restriction may include increased monitoring, program limitations, loss of privileges, restricted access to and use of possessions, and separation of a committed person from the normal living environment, as determined by the executive board or the designee of the executive board. Administrative restriction applies only to committed persons in a secure treatment facility who:\n(1) are suspected of committing a crime or charged with a crime;\n(2) are the subject of a criminal investigation;\n(3) are awaiting sentencing following a conviction of a crime; or\n(4) are awaiting transfer to a correctional facility.\n\"Commissioner\" means the commissioner of corrections or the commissioner's designee.\n\"Committed person\" means an individual committed under this chapter, or under this chapter and under section 253B.18. It includes individuals described in section 246B.01, subdivision 1a, and any person committed as a sexually dangerous person, a person with a psychopathic personality, or a person with a sexual psychopathic personality under any previous statute including chapter 253B or Minnesota Statutes 1992, section 526.10.\n\"Committing court\" means the district court where a petition for commitment was decided.\n\"Court examiner\" has the meaning given in section 253B.02, subdivision 4d.\n\"Executive director\" has the meaning given in section 246B.01, subdivision 2c.\n\"Executive board\" has the meaning given under section 246C.015.\n(a) \"Harmful sexual conduct\" means sexual conduct that creates a substantial likelihood of serious physical or emotional harm to another.\n(b) There is a rebuttable presumption that conduct described in the following provisions creates a substantial likelihood that a victim will suffer serious physical or emotional harm: section 609.342 (criminal sexual conduct in the first degree), 609.343 (criminal sexual conduct in the second degree), 609.344 (criminal sexual conduct in the third degree), 609.345 (criminal sexual conduct in the fourth degree), or 609.3458 (sexual extortion).\n(c) If the conduct was motivated by the person's sexual impulses or was part of a pattern of behavior that had criminal sexual conduct as a goal, the presumption in paragraph (b) also applies to conduct described in section 609.185 (murder in the first degree), 609.19 (murder in the second degree), 609.195 (murder in the third degree), 609.20 (manslaughter in the first degree), 609.205 (manslaughter in the second degree), 609.221 (assault in the first degree), 609.222 (assault in the second degree), 609.223 (assault in the third degree), 609.24 (simple robbery), 609.245 (aggravated robbery), 609.247 (carjacking), 609.25 (kidnapping), 609.255 (false imprisonment), 609.365 (incest), 609.498 (tampering with a witness), 609.561 (arson in the first degree), 609.582, subdivision 1 (burglary in the first degree), 609.713 (terroristic threats), or 609.749, subdivision 3 or 5 (harassment or stalking).\n\"Interested person\" has the meaning given in section 253B.02, subdivision 10.\n\"Peace officer\" has the meaning given in section 253B.02, subdivision 16.\n\"Respondent\" means an individual who is the subject of a petition for commitment as a sexually dangerous person or a person with a sexual psychopathic personality.\n\"Safety\" means protection of persons or property from potential danger, risk, injury, harm, or damage.\n\"Secure treatment facility\" means the Minnesota Sex Offender Program facility in Moose Lake and any portion of the Minnesota Sex Offender Program operated by the Minnesota Sex Offender Program at the Minnesota Security Hospital, but does not include services or programs administered by the Minnesota Sex Offender Program outside a secure environment.\n\"Security\" means the measures necessary to achieve the management and accountability of patients of the facility, staff, and visitors, as well as property of the facility.\n\"Sexual psychopathic personality\" means the existence in any person of such conditions of emotional instability, or impulsiveness of behavior, or lack of customary standards of good judgment, or failure to appreciate the consequences of personal acts, or a combination of any of these conditions, which render the person irresponsible for personal conduct with respect to sexual matters, if the person has evidenced, by a habitual course of misconduct in sexual matters, an utter lack of power to control the person's sexual impulses and, as a result, is dangerous to other persons.\n(a) A \"sexually dangerous person\" means a person who:\n(1) has engaged in a course of harmful sexual conduct as defined in subdivision 8;\n(2) has manifested a sexual, personality, or other mental disorder or dysfunction; and\n(3) as a result, is likely to engage in acts of harmful sexual conduct.\n(b) For purposes of this provision, it is not necessary to prove that the person has an inability to control the person's sexual impulses.\n\"Other treatment program\" means a service or program administered by the Minnesota Sex Offender Program outside a secure environment.",
	"repealed": false
}