{
	"id": "114D.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/114D.50",
	"title": "114D.50 CLEAN WATER FUND.",
	"text": "The clean water fund is established in the Minnesota Constitution, article XI, section 15. All money earned by the fund must be credited to the fund.\nThe sustainable drinking water account is established as an account in the clean water fund.\n(a) The clean water fund may be spent only to protect, enhance, and restore water quality in lakes, rivers, and streams, to protect groundwater from degradation, and to protect drinking water sources by:\n(1) providing grants, loans, and technical assistance to public agencies and others testing waters, identifying impaired waters, developing total maximum daily loads, implementing restoration plans for impaired waters, and evaluating the effectiveness of restoration;\n(2) supporting measures to prevent surface waters from becoming impaired and to improve the quality of waters that are listed as impaired, but do not have an approved total maximum daily load addressing the impairment;\n(3) providing grants and loans for wastewater and stormwater treatment projects through the Public Facilities Authority;\n(4) supporting measures to prevent the degradation of groundwater in accordance with the groundwater degradation prevention goal under section 103H.001; and\n(5) providing funds to state agencies to carry out their responsibilities, including enhanced compliance and enforcement.\n(b) Funds from the clean water fund must supplement traditional sources of funding for these purposes and may not be used as a substitute.\n(a) Beginning July 1, 2014, and every other year thereafter, the Board of Water and Soil Resources shall prepare and post on its website a priority funding plan to prioritize potential nonpoint restoration and protection actions based on available WRAPSs, TMDLs, and local water plans. The plan must take into account the following factors: water quality outcomes, cost-effectiveness, landowner financial need, and leverage of nonstate funding sources. The plan shall include an estimated range of costs for the prioritized actions.\n(b) Consistent with the priorities listed in section 114D.20, state agencies allocating money from the clean water fund for nonpoint restoration and protection strategies shall target the money according to the priorities identified on the nonpoint priority funding plan. The allocation of money from the clean water fund to projects eligible for financial assistance under section 116.182 is not governed by the nonpoint priority funding plan.\n(a) A project receiving funding from the clean water fund must meet or exceed the constitutional requirements to protect, enhance, and restore water quality in lakes, rivers, and streams and to protect groundwater and drinking water from degradation. Priority may be given to projects that meet more than one of these requirements. A project receiving funding from the clean water fund shall include measurable outcomes, as defined in section 3.303, subdivision 10; a plan for measuring and evaluating the results; and an assessment of whether the funding celebrates cultural diversity or reaches diverse communities in Minnesota, including reaching low- and moderate-income households. A project must be consistent with current science and incorporate state-of-the-art technology.\n(b) Money from the clean water fund shall be expended to balance the benefits across all regions and residents of the state.\n(c) A state agency or other recipient of a direct appropriation from the clean water fund must compile and submit all information for proposed and funded projects or programs, including the proposed measurable outcomes and all other items required under section 3.303, subdivision 10, to the Legislative Coordinating Commission as soon as practicable or by January 15 of the applicable fiscal year, whichever comes first. The Legislative Coordinating Commission must post submitted information on the website required under section 3.303, subdivision 10, as soon as it becomes available. Information classified as not public under section 13D.05, subdivision 3, paragraph (d), is not required to be placed on the website.\n(d) Grants funded by the clean water fund must be implemented according to section 16B.98 and must account for all expenditures. Proposals must specify a process for any regranting envisioned. Priority for grant proposals must be given to proposals involving grants that will be competitively awarded.\n(e) Money from the clean water fund may only be spent on projects that benefit Minnesota waters.\n(f) When practicable, a direct recipient of an appropriation from the clean water fund shall prominently display on the recipient's website home page the legacy logo required under Laws 2009, chapter 172, article 5, section 10, as amended by Laws 2010, chapter 361, article 3, section 5, accompanied by the phrase \"Click here for more information.\" When a person clicks on the legacy logo image, the website must direct the person to a web page that includes both the contact information that a person may use to obtain additional information, as well as a link to the Legislative Coordinating Commission website required under section 3.303, subdivision 10.\n(g) Future eligibility for money from the clean water fund is contingent upon a state agency or other recipient satisfying all applicable requirements in this section, as well as any additional requirements contained in applicable session law. If the Office of the Legislative Auditor, in the course of an audit or investigation, publicly reports that a recipient of money from the clean water fund has not complied with the laws, rules, or regulations in this section or other laws applicable to the recipient, the recipient must be listed in an annual report to the legislative committees with jurisdiction over the legacy funds. The list must be publicly available. The legislative auditor shall remove a recipient from the list upon determination that the recipient is in compliance. A recipient on the list is not eligible for future funding from the clean water fund until the recipient demonstrates compliance to the legislative auditor.\n(h) Money from the clean water fund may be used to leverage federal funds through execution of formal project partnership agreements with federal agencies consistent with respective federal agency partnership agreement requirements.\n(i) Any state agency or organization requesting a direct appropriation from the clean water fund must inform the Clean Water Council and the house of representatives and senate committees having jurisdiction over the clean water fund, at the time the request for funding is made, whether the request is supplanting or is a substitution for any previous funding that was not from a legacy fund and was used for the same purpose.\n[Repealed, 1Sp2015 c 4 art 4 s 150]\nData collected by the projects funded with money from the clean water fund that have value for planning and management of natural resources, emergency preparedness, and infrastructure investments must conform to the enterprise information architecture developed by the Department of Information Technology Services. Spatial data must conform to geographic information system guidelines and standards outlined in that architecture and adopted by the Minnesota Geographic Data Clearinghouse at the Minnesota Geospatial Information Office. A description of these data that adheres to the Department of Information Technology Services geographic metadata standards must be submitted to the Minnesota Geospatial Information Office to be made available online through the clearinghouse and the data must be accessible and free to the public unless made private under chapter 13. To the extent practicable, summary data and results of projects funded with money from the clean water fund should be readily accessible on the Internet and identified as a clean water fund project.\n(a) The Board of Water and Soil Resources may convene a technical evaluation panel comprised of five members, including one technical representative from the Board of Water and Soil Resources, one technical representative from the Department of Natural Resources, one technical expert from the University of Minnesota or the Minnesota State Colleges and Universities, and two representatives with expertise related to the project being evaluated. The board may add a technical representative from a unit of federal or local government.\n(b) The members of the technical evaluation panel may not be associated with the restoration, may vary depending upon the projects being reviewed, and shall avoid any potential conflicts of interest.\n(c) Each year, the board may assign a coordinator to identify a sample of habitat restoration projects completed with clean water funding. The coordinator shall secure the restoration plans for the projects specified and direct the technical evaluation panel to evaluate the restorations relative to the law, current science, and the stated goals and standards in the restoration plan and, when applicable, to the Board of Water and Soil Resources' Native Vegetation Establishment and Enhancement Guidelines.\n(d) The coordinator shall summarize the findings of the panel and provide a report to the chairs of the respective house of representatives and senate policy and finance committees with jurisdiction over natural resources and spending from the clean water fund. The report shall determine if the restorations are meeting planned goals, any problems with the implementation of restorations, and, if necessary, recommendations on improving restorations. The report shall be focused on improving future restorations.\n(e) Up to one-tenth of one percent of forecasted receipts from the clean water fund may be used for restoration evaluations under this section.\nIn any fiscal year, at least five percent of that year's projected tax receipts determined by the most recent forecast for the clean water fund must not be appropriated.",
	"repealed": false
}