{
	"id": "572A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/572A.02",
	"title": "572A.02 ARBITRATION.",
	"text": "If a dispute remains unresolved after the close of mediation, the dispute shall be submitted to binding arbitration within 60 days of issuance of the mediation report pursuant to the terms of this section and the Uniform Arbitration Act, sections 572B.01 to 572B.31, except the period may be extended for an additional 15 days as provided in this section. In the event of a conflict between the provisions of the Uniform Arbitration Act and this section, this section controls.\n(a) The parties shall each appoint one qualified arbitrator within 30 days of issuance of the mediation report. If a party does not appoint an arbitrator within 30 days, the Bureau of Mediation Services shall appoint a qualified arbitrator from the list of neutrals under sections 572A.01, subdivision 2, and 572A.015, subdivision 2, or someone else for the party. The parties shall notify the bureau prior to the close of the 30-day appointment period of the name and address of their respective appointed arbitrator. Each party is responsible for the fees and expenses for the arbitrator it selects.\n(b) After appointment of the two arbitrators to the arbitration panel by the parties, or by the bureau should one or both of the parties fail to act, the two appointed arbitrators shall appoint a third arbitrator who must be learned in the law, within 15 days of the close of the initial 30-day arbitrator appointment period. If the arbitrators cannot agree on the selection of the third arbitrator within 15 days, the arbitrators shall jointly submit a request to the district court of the county in which the disputed area is located in accordance with the selection procedures established in section 572B.11. Within 15 days of receipt of an application by the district court, the district court shall select a neutral arbitrator and notify the parties and the Bureau of Mediation Services of the name and address of the selected arbitrator. The fees and expenses of the third arbitrator shall be shared equally by the parties. The third appointed arbitrator shall act as chair of the arbitration panel and shall conduct the proceedings. If the district court selects the third arbitrator, the date required for first hearing the matter may be extended an additional 15 days.\nExcept as otherwise provided, within 60 days, the matter must be brought on for hearing in accordance with section 572B.15. The Bureau of Mediation Services shall provide for the proceedings to occur in the county in which the majority of the affected property is located.\nThe arbitration panel shall have authority to contract with regional, state, county, or local planning commissions or to hire expert consultants to provide specialized information and assistance. Any member of the panel conducting or participating in any hearing shall have the power to administer oaths and affirmations, to issue subpoenas, and to compel the attendance and testimony of witnesses and the production of papers, books, and documents. Any costs related to this subdivision shall be shared equally by the parties.\nIn disputes brought under this section, the arbitration panel shall consider the following factors in making a decision:\n(1) present population and number of households, past population, and projected population growth of the subject area and adjacent units of local government;\n(2) quantity of land within the subject area and adjacent units of local government; and natural terrain including recognizable physical features, general topography, major watersheds, soil conditions, and such natural features as rivers, lakes, and major bluffs;\n(3) degree of contiguity of the boundaries between the municipality and the subject area;\n(4) present pattern of physical development, planning, and intended land uses in the subject area and the municipality including residential, industrial, commercial, agricultural, and institutional land uses and the impact of the proposed action on those land uses;\n(5) the present transportation network and potential transportation issues, including proposed highway development;\n(6) land use controls and planning presently being utilized in the municipality and the subject area, including comprehensive plans for development in the area and plans and policies of the Metropolitan Council, and whether there are inconsistencies between proposed development and existing land use controls and the reasons therefore;\n(7) existing levels of governmental services being provided in the municipality and the subject area, including water and sewer service, fire rating and protection, law enforcement, street improvements and maintenance, administrative services, and recreational facilities and the impact of the proposed action on the delivery of said services;\n(8) existing or potential environmental problems and whether the proposed action is likely to improve or resolve these problems;\n(9) plans and programs by the municipality for providing needed governmental services to the subject area;\n(10) an analysis of the fiscal impact on the municipality, the subject area, and adjacent units of local government, including net tax capacity and the present bonded indebtedness, and the local tax rates of the county, school district, and township;\n(11) relationship and effect of the proposed action on affected and adjacent school districts and communities;\n(12) adequacy of town government to deliver services to the subject area;\n(13) analysis of whether necessary governmental services can best be provided through the proposed action or another type of boundary adjustment; and\n(14) if only a part of a township is annexed, the ability of the remainder of the township to continue or the feasibility of it being incorporated separately or being annexed to another municipality.\nAny party to the proceeding may present evidence and testimony on any of the above factors at the hearing on the matter.\nThe arbitrators, after a hearing on the matter, shall make a decision regarding the dispute within 60 days and transmit an order to the parties in comprehensive planning disputes or to the chief administrative law judge in chapter 414 disputes. Unless appealed by an aggrieved party within 30 days of receipt of the arbitration panel's order by the office, the office shall execute an order in accordance with the arbitration panel's order and shall cause copies of the same to be mailed to all parties entitled to mailed notice, the secretary of state, the Department of Revenue, the state demographer, individual property owners if initiated in that manner, the affected county auditor, and any other party of record. The affected county auditor shall record the order against the affected property.",
	"repealed": false
}