{
	"id": "147E.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/147E.05",
	"title": "147E.05 SCOPE OF PRACTICE.",
	"text": "(a) The practice of naturopathic medicine includes, but is not limited to, the following services:\n(1) ordering, administering, prescribing, or dispensing for preventive and therapeutic purposes: food, extracts of food, nutraceuticals, vitamins, minerals, amino acids, enzymes, botanicals and their extracts, botanical medicines, herbal remedies, homeopathic medicines, dietary supplements and nonprescription drugs as defined by the Federal Food, Drug, and Cosmetic Act, glandulars, protomorphogens, lifestyle counseling, hypnotherapy, biofeedback, dietary therapy, electrotherapy, galvanic therapy, oxygen, therapeutic devices, barrier devices for contraception, and minor office procedures, including obtaining specimens to assess and treat disease;\n(2) performing or ordering physical examinations and physiological function tests;\n(3) ordering clinical laboratory tests and performing waived tests as defined by the United States Food and Drug Administration Clinical Laboratory Improvement Amendments of 1988 (CLIA);\n(4) referring a patient for diagnostic imaging including x-ray, CT scan, MRI, ultrasound, mammogram, and bone densitometry to an appropriately licensed health care professional to conduct the test and interpret the results;\n(5) prescribing nonprescription medications and therapeutic devices or ordering noninvasive diagnostic procedures commonly used by physicians in general practice; and\n(6) prescribing or performing naturopathic physical medicine.\n(b) A registered naturopathic doctor may admit patients to a hospital if the naturopathic doctor meets the hospital's governing body requirements regarding credentialing and privileging process.\n(a) The practice of naturopathic medicine does not include:\n(1) administering therapeutic ionizing radiation or radioactive substances;\n(2) administering general or spinal anesthesia;\n(3) prescribing, dispensing, or administering legend drugs or controlled substances including chemotherapeutic substances; or\n(4) performing or inducing abortions.\n(b) A naturopathic doctor registered under this chapter shall not perform surgical procedures using a laser device or perform surgical procedures beyond superficial tissue.\n(c) A naturopathic doctor shall not practice or claim to practice as a medical doctor, surgeon, osteopathic physician, dentist, podiatrist, optometrist, psychologist, advanced practice professional nurse, physician assistant, chiropractor, physical therapist, acupuncturist, dietician, nutritionist, or any other health care professional, unless the naturopathic physician also holds the appropriate license or registration for the health care practice profession.",
	"repealed": false
}