{
	"id": "254B.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.151",
	"title": "254B.151 SUBSTANCE USE DISORDER COMMUNITY OF PRACTICE.",
	"text": "The commissioner of human services, in consultation with substance use disorder subject matter experts, shall establish a substance use disorder community of practice. The purposes of the community of practice are to improve treatment outcomes for individuals with substance use disorders and reduce disparities by using evidence-based and best practices through peer-to-peer and person-to-provider sharing.\n(a) The community of practice must include the following participants:\n(1) researchers or members of the academic community who are substance use disorder subject matter experts, who do not have financial relationships with treatment providers;\n(2) substance use disorder treatment providers;\n(3) representatives from recovery community organizations;\n(4) a representative from the Department of Human Services;\n(5) a representative from the Department of Health;\n(6) a representative from the Department of Corrections;\n(7) representatives from county social services agencies;\n(8) representatives from tribal nations or tribal social services providers;\n(9) representatives from managed care organizations; and\n(10) a representative from Direct Care and Treatment.\n(b) The community of practice must include individuals who have used substance use disorder treatment services and must highlight the voices and experiences of individuals who are Black, indigenous, people of color, and people from other communities that are disproportionately impacted by substance use disorders.\n(c) The community of practice must meet regularly and must hold its first meeting before January 1, 2022.\n(d) Compensation and reimbursement for expenses for participants in paragraph (b) are governed by section 15.059, subdivision 3.\n(a) The community of practice must:\n(1) identify gaps in substance use disorder treatment services;\n(2) enhance collective knowledge of issues related to substance use disorder;\n(3) understand evidence-based practices, best practices, and promising approaches to address substance use disorder;\n(4) use knowledge gathered through the community of practice to develop strategic plans to improve outcomes for individuals who participate in substance use disorder treatment and related services in Minnesota;\n(5) increase knowledge about the challenges and opportunities learned by implementing strategies; and\n(6) develop capacity for community advocacy.\n(b) The commissioner, in collaboration with subject matter experts and other participants, may issue reports and recommendations to the legislative chairs and ranking minority members of committees with jurisdiction over health and human services policy and finance and local and regional governments.",
	"repealed": false
}