{
	"id": "473.556",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.556",
	"title": "473.556 POWERS OF COMMISSION.",
	"text": "The commission shall have all powers necessary or convenient to discharge the duties imposed by law, including but not limited to those specified in this section.\nThe commission may sue and be sued, and shall be a public body within the meaning of chapter 562.\nThe commission may acquire by lease, purchase, gift, or devise all necessary right, title, and interest in and to real or personal property deemed necessary to the purposes contemplated by sections 473.551 to 473.599 within the limits of the metropolitan area.\nAny real or personal property acquired, owned, leased, controlled, used, or occupied by the commission for any of the purposes of sections 473.551 to 473.599 is declared to be acquired, owned, leased, controlled, used and occupied for public, governmental, and municipal purposes, and shall be exempt from ad valorem taxation by the state or any political subdivision of the state, provided that such properties shall be subject to special assessments levied by a political subdivision for a local improvement in amounts proportionate to and not exceeding the special benefit received by the properties from the improvement. No possible use of any such properties in any manner different from their use under sections 473.551 to 473.599 at the time shall be considered in determining the special benefit received by the properties. All assessments shall be subject to final confirmation by the council, whose determination of the benefits shall be conclusive upon the political subdivision levying the assessment. Notwithstanding the provisions of section 272.01, subdivision 2, or 273.19, real or personal property leased by the commission to another person for uses related to the purposes of sections 473.551 to 473.599, including the operation of the metrodome, met center, and, if acquired by the commission, the basketball and hockey arena shall be exempt from taxation regardless of the length of the lease. The provisions of this subdivision, insofar as they require exemption or special treatment, shall not apply to any real property comprising the met center which is leased by the commission for residential, business, or commercial development or other purposes different from those contemplated in sections 473.551 to 473.599.\nThe commission may equip, improve, operate, manage, maintain, and control the Metrodome, Met Center, basketball and hockey arena and sports facilities constructed, remodeled, or acquired under the provisions of sections 473.551 to 473.599.\n(a) The commission may sell, lease, or otherwise dispose of any real or personal property acquired by it which is no longer required for accomplishment of its purposes. The property shall be sold in accordance with the procedures provided by section 469.065, insofar as practical and consistent with sections 473.551 to 473.599.\n(b) The proceeds from the sale of any real property at the metropolitan sports area shall be paid to the council and used for debt service or retirement.\nThe commission may contract for materials, supplies, and equipment in accordance with section 471.345, except that the commission may employ persons, firms, or corporations to perform one or more or all of the functions of architect, engineer, construction manager, or contractor for both design and construction, with respect to all or any part of a project to build or remodel sports facilities. Contractors shall be selected through the process of public bidding, provided that it shall be permissible for the commission to narrow the listing of eligible bidders to those which the commission determines to possess sufficient expertise to perform the intended functions. Any construction manager or contractor shall certify, before the contracts are finally signed, a construction price and completion date to the commission and shall post a bond in an amount at least equal to 100 percent of the certified price, to cover any costs which may be incurred over and above the certified price, including but not limited to costs incurred by the commission or loss of revenues resulting from incomplete construction on the completion date. The commission shall secure surety bonds as required in section 574.26, securing payment of just claims in connection with all public work undertaken by it. Persons entitled to the protection of the bonds may enforce them as provided in sections 574.28 to 574.32, and shall not be entitled to a lien on any property of the commission under the provisions of sections 514.01 to 514.16.\nThe commission may employ persons and contract for services necessary to carry out its functions. The commission may employ on such terms as it deems advisable persons or firms for the purpose of providing traffic officers to direct traffic on property under the control of the commission and on the city streets in the general area of the property controlled by the commission. The traffic officers shall not be peace officers and shall not have authority to make arrests for violations of traffic rules.\nThe commission may accept gifts of money, property, or services, may apply for and accept grants or loans of money or other property from the United States, the state, any subdivision of the state, or any person for any of its purposes, may enter into any agreement required in connection therewith, and may hold, use, and dispose of such money, property, or services in accordance with the terms of the gift, grant, loan or agreement relating thereto. Except for the acquisition, clearance, relocation, and legal costs referred to in section 473.581, subdivision 3, clauses (d) and (e), the commission shall not accept gifts, grants, or loans valued in excess of $2,000,000 without the prior approval of the council. In evaluating proposed gifts, grants, loans, and agreements required in connection therewith, the council shall examine the possible short-range and long-range impact on commission revenues and commission operating expenditures.\nThe commission may conduct research studies and programs, collect and analyze data, prepare reports, maps, charts, and tables, and conduct all necessary hearings and investigations in connection with its functions.\nThe commission and the Board of Regents of the University of Minnesota may enter into agreements and do all other acts necessary to further the functions prescribed in sections 473.551 to 473.599.\nThe commission may lease, license, or enter into agreements and may fix, alter, charge, and collect rentals, fees, and charges to all persons for the use, occupation, and availability of part or all of any premises, property, or facilities under its ownership, operation, or control for purposes that will provide athletic, educational, cultural, commercial or other entertainment, instruction, or activity for the citizens of the metropolitan area. Any such use agreement may provide that the other contracting party shall have exclusive use of the premises at the times agreed upon.\nThe commission may require any employee to obtain and file with it an individual bond or fidelity insurance policy. It may procure insurance in the amounts it deems necessary against liability of the commission or its officers and employees for personal injury or death and property damage or destruction, with the force and effect stated in chapter 466, and against risks of damage to or destruction of any of its facilities, equipment, or other property.\nIn exercising its powers to contract for the purchase of services, materials, supplies, and equipment, pursuant to subdivisions 5, 7, 8 and 10, the commission shall designate and set aside each fiscal year for awarding to small businesses approximately ten percent of the value of anticipated contracts and subcontracts of that kind for that year, in the manner required of the commissioner of administration for state procurement contracts pursuant to sections 16C.16 to 16C.19. The commission shall follow the rules promulgated by the commissioner of administration pursuant to section 16C.19, and shall submit reports of the kinds required of the commissioners of administration and economic development by section 16C.18.\nMS 1980 [Repealed, 1981 c 356 s 377]\n(a) The commission and the Minnesota Amateur Sports Commission created pursuant to chapter 240A may enter into long-term leases, use or other agreements for the conduct of amateur sports activities at the basketball and hockey arena, and the net revenues from the activities may be pledged for basketball and hockey arena debt service. The commission, with the advice of the Minnesota Amateur Sports Commission, shall establish standards to provide reasonable assurances to other public bodies owning or operating an entertainment or sports complex or indoor sports arena in the metropolitan area that the agreements between the commission and the Minnesota Amateur Sports Commission with respect to the basketball and hockey arena shall not remove the conduct of amateur sports activities currently and traditionally held at such facilities.\n(b) Any long-term lease, use, or other agreement entered into by the Minnesota Amateur Sports Commission with the commission under paragraph (a) must also:\n(1) provide for a release of the Minnesota Amateur Sports Commission from its commitment under the agreement if the legislature repeals or amends a standing appropriation or otherwise does not appropriate sufficient money to fund the lease or agreement to the Minnesota Amateur Sports Commission; and\n(2) provide for a release of the Minnesota Amateur Sports Commission from its commitment under the agreement and permit it to agree to a per event use fee when the bonds issued for the metrodome under section 473.581 have been retired.\n(c) No long-term lease, use, or other agreement entered into by the Minnesota Amateur Sports Commission under paragraph (a) may commit the amateur sports commission to paying more than $750,000 per year.\n(d) Any long-term lease, use, or other agreement entered into under paragraph (a) shall provide that the Minnesota Amateur Sports Commission shall be entitled to use of the basketball and hockey arena for 50 event days per year. In addition, any long-term lease, use, or other agreement entered into under paragraph (a) shall permit the Minnesota Amateur Sports Commission to allow another person or organization to use one or more of its days.\nThe commission may, by itself or together with the Minneapolis Community Development Agency and any other person, as to real or personal property comprising or appurtenant or ancillary to the basketball and hockey arena and the health club, act as a declarant and establish a condominium or leasehold condominium under chapter 515A or a common interest community or leasehold common interest community under chapter 515B, and may grant, establish, create, or join in other or related easements, agreements and similar benefits and burdens that the commission may deem necessary or appropriate, and exercise any and all rights and privileges and assume obligations under them as a declarant, unit owner or otherwise, insofar as practical and consistent with sections 473.551 to 473.599. The commission may be a member of an association and the chair, any commissioners and any officers and employees of the commission may serve on the board of an association under chapter 515A or 515B.",
	"repealed": false
}