{
	"id": "299N.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/299N.02",
	"title": "299N.02 BOARD OF FIREFIGHTER TRAINING AND EDUCATION.",
	"text": "Notwithstanding any provision of chapter 15 to the contrary, the Board of Firefighter Training and Education consists of the following members:\n(1) five members representing the Minnesota State Fire Department Association, four of whom must be volunteer firefighters and one of whom may be a full-time firefighter, appointed by the governor;\n(2) two members representing the Minnesota State Fire Chiefs Association, one of whom must be a volunteer fire chief, appointed by the governor;\n(3) two members representing the Minnesota Professional Fire Fighters, appointed by the governor;\n(4) two members representing Minnesota home rule charter and statutory cities, appointed by the governor;\n(5) two members representing Minnesota towns, appointed by the governor;\n(6) the commissioner of public safety or the commissioner's designee; and\n(7) one public member not affiliated or associated with any member or interest represented in clauses (1) to (6), appointed by the governor.\nThe Minnesota State Fire Department Association shall recommend five persons to be the members described in clause (1), the Minnesota State Fire Chiefs Association shall recommend two persons to be the members described in clause (2), the Minnesota Professional Fire Fighters shall recommend two persons to be the members described in clause (3), the League of Minnesota Cities shall recommend two persons to be the members described in clause (4), and the Minnesota Association of Townships shall recommend two persons to be the members described in clause (5). In making the appointments the governor shall try to achieve representation from all geographic areas of the state.\nMembers of the board shall serve for terms of four years and biennially elect a chair from among the members. Terms and filling of vacancies are subject to section 15.0575, subdivisions 2, 4, and 5. Members serve without compensation.\n(a) The board shall:\n(1) review fire service training needs and make recommendations on training to Minnesota fire service organizations;\n(2) establish standards for educational programs for the fire service and develop procedures for continuing oversight of the programs;\n(3) establish qualifications for fire service training instructors in programs established under clause (2);\n(4) maintain a list of instructors that have met the qualifications established under clause (3), subject to application procedures and requirements established by the board; and\n(5) license full-time firefighters and volunteer firefighters under this chapter.\n(b) The board may:\n(1) hire or contract for technical or professional services according to section 15.061;\n(2) pay expenses necessary to carry out its duties;\n(3) apply for, receive, and accept grants, gifts, devises, and endowments that any entity may make to the board for the purposes of this chapter and may use any money given to it consistent with the terms and conditions under which the money was received and for the purposes stated;\n(4) accept funding from the fire safety account and allocate funding to Minnesota fire departments in the form of reimbursements that are consistent with the board's recommendations and the Department of Public Safety firefighter training;\n(5) set guidelines regarding how the allocated reimbursement funds must be disbursed;\n(6) set and make available to the fire service standards governing the use of funds reimbursed under this section;\n(7) make recommendations to the legislature to improve the quality of firefighter training;\n(8) collect and provide data, subject to section 13.03;\n(9) conduct studies and surveys and make reports; and\n(10) conduct other activities necessary to carry out its duties.",
	"repealed": false
}