{
	"id": "134.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.45",
	"title": "134.45 LIBRARY CONSTRUCTION GRANTS.",
	"text": "Public library jurisdictions may apply to the commissioner of education for grants for improvements and accessibility to their library facilities. For the purposes of this section, \"public library jurisdictions\" means regional public library systems, regional library districts, cities, and counties operating libraries under chapter 134.\nThe commissioner of education, in consultation with the state Council on Disability, may approve or disapprove applications under this section. The grant money must be used to remove architectural barriers from a building or site, to renovate or expand an existing building for use as a library, or to construct a new library building.\nThe commissioner of education shall prepare application forms and establish application dates.\nA public library jurisdiction applying for a grant under this section must match the grant with local funds.\nA public library jurisdiction may apply for a grant in an amount up to $450,000 or 50 percent of the approved costs of removing architectural barriers from a building or site, whichever is less. Grants may be made only for projects in existing buildings used as a library, or to prepare another existing building for use as a library. Renovation of an existing building may include an addition to the building if the additional space is necessary to provide accessibility or if relocating public spaces to the ground level provides improved overall accessibility. Grants must not be used to pay part of the cost of meeting accessibility requirements in a new building.\nA public library jurisdiction is not eligible for a grant under this section unless it has adopted a policy to prohibit library users from using the library's Internet access to view, print, or distribute material that is obscene within the meaning of section 617.241.\nA public library jurisdiction may apply for a grant in an amount up to $1,000,000 or 50 percent, whichever is less, of the approved costs of renovating or expanding an existing library building, or to construct a new library building. Renovation may include remediation of conditions hazardous to health or safety.\nThe commissioner, in consultation with the state Council on Disability, shall examine and consider all applications for grants. If a public library jurisdiction is found not qualified, the commissioner shall promptly notify it. The commissioner shall prioritize grants on the following bases: the degree of collaboration with other public or private agencies, the public library jurisdiction's tax burden, the long-term feasibility of the project, the suitability of the project, and the need for the project. If the total amount of the applications exceeds the amount that is or can be made available, the commissioner shall award grants according to the commissioner's judgment and discretion and based upon a ranking of the projects according to the factors listed in this subdivision. The commissioner shall promptly certify to each public library jurisdiction the amount, if any, of the grant awarded to it.\nA public library jurisdiction that receives a grant must provide the commissioner with the project budget and any other information the commissioner requests.\nIf the commissioner of education and the local or regional governmental entity that owns a public library that has been improved with state bond proceeds under this section determines that the library is no longer usable or needed for the purposes for which the grant of state bond funds was made, the owner of the public library may sell the property in the manner authorized by law for the sale of other property owned by that jurisdiction for its fair market value. The sale must be approved by the commissioner of management and budget. Notwithstanding section 16A.695, subdivision 3, clause (2), the net proceeds must be applied as follows: first, to pay the state the amount of state bond proceeds used to acquire or better the property; and second, any remaining amount must be paid to the local or regional governmental owner of the property sold. When the sale is complete and the sale proceeds have been applied as provided in this subdivision, section 16A.695 no longer applies to the property and the property is no longer state bond financed property.",
	"repealed": false
}