{
	"id": "240.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.15",
	"title": "240.15 PAYMENTS TO STATE.",
	"text": "(a) There is imposed a tax at the rate of six percent of the amount in excess of $12,000,000 annually withheld from all pari-mutuel pools by a class B or class D licensee, including breakage and amounts withheld under section 240.13, subdivision 4. For the purpose of this subdivision, \"annually\" is the period from July 1 to June 30 of the next year.\nIn addition to the above tax, a class B or class D licensee must designate and pay to the commission a tax of one percent of the handle for live races conducted at a class A facility, for deposit in the Minnesota breeders fund.\nThe taxes imposed by this clause must be paid from the amounts permitted to be withheld by a licensee under section 240.13, subdivision 4.\n(b) The commission may impose an admissions tax of not more than ten cents on each paid admission at a licensed racetrack on a racing day if:\n(1) the tax is requested by a local unit of government within whose borders the track is located;\n(2) a public hearing is held on the request; and\n(3) the commission finds that the local unit of government requesting the tax is in need of its revenue to meet extraordinary expenses caused by the racetrack.\nThe licensee must remit the tax to the commission or its representative within seven days after the end of the month in which it was collected. The payments must be accompanied by a detailed statement of the remittance on a form the commission prescribes. The commission may by rule provide for the direct deposit of required payments in the commission's account in a financial institution within the state and for determining the time of applicability of different tax rates under subdivision 1.\nThe tax imposed by subdivision 1 is in lieu of any tax or license fee, other than taxes on real property, imposed by a political subdivision and in lieu of any other sales or excise tax imposed by the state on pari-mutuel pools or pari-mutuel ticket sales.\nWithin 100 days of the end of each calendar year a licensee subject to the tax imposed by subdivision 1 must file with the commission a certified financial report disclosing receipts from all sources during the racing meeting and expenses and disbursements. The financial report must be prepared by an independent certified public accountant in accordance with generally accepted auditing standards.\n(a) Notwithstanding any provision to the contrary in chapter 345, unredeemed pari-mutuel tickets shall not be considered unclaimed funds and shall be handled in accordance with the provisions of this subdivision.\n(b) Any person claiming to be entitled to the proceeds of any unredeemed ticket may within one year after the conclusion of each race meet file with the licensee a verified claim for such proceeds on such form as the licensee prescribes along with the pari-mutuel ticket. Unless the claimant satisfactorily establishes the right to the proceeds, the claim shall be rejected. If the claim is allowed, the licensee shall pay the proceeds without interest to the claimant.\nThe commission shall distribute all money received under this section, and, except as provided otherwise by section 240.131, all money received from license fees, regulatory fees, and fines it collects, according to this subdivision. All money designated for deposit in the Minnesota breeders fund must be paid into that fund for distribution under section 240.18 except that all money generated by simulcasts must be distributed as provided in section 240.18, subdivisions 2, paragraph (d), clauses (1), (2), and (3); and 3. Revenue from an admissions tax imposed under subdivision 1 must be paid to the local unit of government at whose request it was imposed, at times and in a manner the commission determines. Taxes received under this section must be paid to the commissioner of management and budget for deposit in the general fund. All revenues from licenses and other fees imposed by the commission must be deposited in the state treasury and credited to a racing and card playing regulation account in the special revenue fund. Receipts in this account are available for the operations of the commission up to the amount authorized in biennial appropriations from the legislature. If a fiscal biennium ends without the enactment of an appropriation to the commission for the following biennium, receipts in this account are annually appropriated to the commission for the operations of the commission up to the amount authorized in the second year of the most recently enacted biennial appropriation, until a biennial appropriation is enacted.",
	"repealed": false
}