{
	"id": "116A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.12",
	"title": "116A.12 SECOND HEARING.",
	"text": "Promptly after the filing of the viewers' report and the engineer's survey the auditor, or the court administrator with the approval of the judge, shall fix a time and place for hearing on the petition and the engineer's and viewers' reports. The hearing shall not be less than 25 nor more than 50 days from the date of the notice thereof. The auditor shall notify the members of the county board of the time and place of the meeting as provided by law.\n(a) The notice shall state the pendency of the petition, that the engineer's and viewers' reports have been filed, the time and place set for the hearing, and, if an assessment roll has been prepared in accordance with section 116A.09, that hearing will also be held on the special assessments proposed therein. The notice shall contain a brief description of the proposed system in general terms, the area proposed to be assessed, and the lands and properties damaged thereby as shown by the engineer's and viewers' reports. It shall be sufficient if the lands affected are listed in narrative form by governmental sections or otherwise.\n(b) In judicial proceedings, separate notices may be prepared, published, posted and mailed in each county affected, showing only that portion of the water or sewer system or combination thereof and the descriptions of the properties affected in the county.\n[Repealed, Ex1971 c 20 s 11]\nThe auditor or court administrator shall cause notice of the time and place of the hearing to be given to all persons interested by publication, posting and mailing. The publication shall be made no less than three weeks before the date of the hearing. A printed copy of the notice of hearing made for each county shall be posted within one week after the beginning of publication at the front door of the court house in each county. Within one week after the beginning of publication, the auditor or court administrator shall give notice by mail of the time and place of the hearing to all persons, corporations, and public bodies affected by the proposed system as shown by the engineer's and viewers' reports. The notice mailed to the owner of each parcel damaged by the improvement shall describe the parcel and state the amount of the damages as ascertained by the viewers. The notice mailed to the owner of each parcel appearing on the assessment roll, if filed for hearing at this time, shall describe the parcel and state the amount of the cost potentially assessable thereto as set forth in the assessment roll. Ownership of the respective parcels shall be established as provided in section 116A.17, subdivision 1.\nIf notice is not given or is defective, the auditor or court administrator shall require the same to again be fully given.\n[Repealed, Ex1971 c 20 s 11]\nUpon due publication, posting and mailing of the notice provided in this section, the board or court shall have jurisdiction of all lands and properties described in the engineer's and viewers' reports, and of all persons and corporations, municipal or otherwise, named therein, and all persons or corporations having any interest in any mortgage, lien or encumbrance against any of the lands or properties referred to in such reports.\nAt the time and place specified in the notice, or at any adjournment thereof, the board or court shall consider the petition for the water or sewer system, together with all matters pertaining to the engineer's and viewers' reports, and consider all oral or written testimony presented by interested parties. The board or court shall have authority to amend the engineer's and viewers' reports as it deems necessary or proper. If the board or court shall find that the engineer's and viewers' reports have been made and all other proceedings in the matter had in accordance with law, that the estimated benefits are greater than the total estimated cost, including damages, that the benefits and damages have been duly determined, that the proposed water or sewer system will be of public utility and benefit, and will promote the public health, and that the proposed system is practicable, then the board or county shall by order containing such findings establish the water or sewer improvement and adopt and confirm the viewers' report as made or amended.\nIf an assessment roll has been made and filed, the board or court may take action with respect thereto at the hearing or at any adjournment thereof in the manner provided in section 116A.17; provided that the board or court may permit prepayment of any assessment in full, without interest, within any stated period from the date of confirmation of the assessments, and may provide that the first installment shall be payable in the year following the expiration of such period. The board or court may in its order confirm the special assessments in the full amounts required to pay the total estimated cost of the system, as set forth in the assessment roll, or may confirm them at any fraction not less than 25 percent thereof. If special assessments are confirmed in any amount less than the total cost of the system as finally ascertained, the board or court may at any subsequent time make supplemental assessments as provided in section 116A.18, to the full amount required to pay the total cost of the system including the principal of and interest on all bonds issued to finance the system.\nNo order shall be entered confirming special assessments for any system under the provisions of this section or section 116A.17 unless it is determined that the amount of the special assessments confirmed in the order, and to be extended upon the tax rolls in each year of the term of any bonds issued to finance the system, together with interest payable on such assessments, the taxes, if any, and the net revenues to be received in excess of the cost of operation of the system during the same period, will be sufficient to pay all of such bonds and interest thereon when due. The board or court may make this determination in the order establishing the system or by subsequent order, based upon the engineer's report and such other investigation as it may deem necessary, whether or not special assessments are finally confirmed at the time of the entry of such order.\nThe board or court, after ordering the establishment of any water or sewer or combined system, shall retain jurisdiction thereof for the purpose of the levy of special assessments therefor, unless confirmed by the order establishing the system, the levy of supplemental assessments, reassessments, and reapportionment assessments when required, the approval of all contracts for construction, extension, and improvement of the system, and the enlargement of the area assessable for the original system and any extensions or improvements, when determined to be necessary or expedient and in the public interest. Proceedings for enlargement of the assessable area shall be taken in the same manner as provided for establishment of the system in sections 116A.01 to 116A.12, except that the owner of any property may petition for the inclusion of such property in the area and for connection to the system, and the board or court may grant such petition with or without further hearing as it may deem expedient. No hearing shall be required on any improvement or extension, but proceedings for contracting and levying special assessments for any improvement or extension shall be taken in accordance with the provisions of sections 116A.13 to 116A.19.\nWhen damages are awarded and duly confirmed with respect to any property, the board or court may order the same paid and provide for the filing with the county recorder of the county in which the property is located a copy of the viewers' report and the order confirming the damages. Thereafter the board or court or commission may enter upon the property for the purpose of constructing or maintaining the water or sewer or combined system as contemplated in the viewers' report without first securing for that purpose a separate easement by purchase, condemnation under chapter 117, or otherwise. In case of appeal, the damages shall not be paid until the final determination thereof. If there is doubt as to who is entitled to the damages, the board or court may pay the same to the court administrator of the district court in the county in which the property is located, and the damages shall be disbursed by the court administrator, upon order of the district court, to the persons thereunto entitled.",
	"repealed": false
}