{
	"id": "169.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.225",
	"title": "169.225 MOTORIZED FOOT SCOOTER.",
	"text": "Every person operating a motorized foot scooter shall have all rights and duties applicable to the operator of a bicycle, except in respect to those provisions relating expressly to motorized foot scooters and in respect to those provisions of law that by their nature cannot reasonably be applied to motorized foot scooters.\nNo person may operate a motorized foot scooter upon a sidewalk, except when necessary to enter or leave adjacent property. No person may operate a motorized foot scooter that is carrying any person other than the operator.\nNo person under the age of 12 years may operate a motorized foot scooter.\nNo person under the age of 18 years may operate a motorized foot scooter without wearing properly fitted and fastened protective headgear that complies with standards established by the commissioner of public safety.\nA motorized foot scooter must be equipped with a headlight and a taillight that comply with standards established by the commissioner of public safety if the vehicle is operated under conditions when vehicle lights are required by law.\n(a) A person operating a motorized foot scooter on a roadway shall ride as close as practicable to the right-hand curb or edge of the roadway, except in the following situations:\n(1) when overtaking and passing another vehicle proceeding in the same direction;\n(2) when preparing for a left turn, in which case the operator shall stop and dismount at the right-hand curb or right edge of the roadway, and shall complete the turn by crossing the roadway on foot, subject to restrictions placed by law on pedestrians; or\n(3) when reasonably necessary to avoid impediments or conditions that make it unsafe to continue along the right-hand curb or edge, including, but not limited to, fixed or moving objects, vehicles, bicycles, pedestrians, animals, surface hazards, or narrow lanes.\n(b) A person may operate a motorized foot scooter on a bicycle path, bicycle lane, bicycle trail, or bikeway that is not reserved for the exclusive use of nonmotorized traffic, unless the local authority or governing body having jurisdiction over that path, lane, trail, or bikeway prohibits operation by law.",
	"repealed": false
}