{
	"id": "304A.202",
	"url": "https://www.revisor.mn.gov/statutes/cite/304A.202",
	"title": "304A.202 RIGHT OF ACTION.",
	"text": "(a) No person other than a shareholder may assert a claim under this chapter or chapter 302A against a public benefit corporation, its directors, or its officers on account of the public benefit corporation's director's or officer's failure to pursue or create general public benefit or a specific public benefit.\n(b) A public benefit corporation is not liable for monetary damages under this chapter for any failure of the public benefit corporation to pursue or create general public benefit or a specific public benefit.\nIn addition to the grounds for relief stated in section 302A.751, subdivision 1, paragraph (b), a court may grant relief under this chapter when:\n(1) directors or those in control of a public benefit corporation have breached the duties stated in section 304A.201 to a substantial extent and in a sustained manner; or\n(2) the public benefit corporation has for an unreasonably long period of time failed to pursue:\n(i) in the case of a general benefit corporation:\n(A) general public benefit; or\n(B) any specific public benefit purpose stated in its articles; and\n(ii) in the case of a specific benefit corporation, any specific public benefit purpose stated in its articles.\n(a) In an action under this chapter, in addition to granting any other equitable relief the court deems just and reasonable in the circumstances, the court may:\n(1) order the public benefit corporation to terminate its status as a public benefit corporation pursuant to section 304A.103, subdivision 1;\n(2) remove one or more directors from the public benefit corporation's board of directors and determine whether the vacancy will be filled:\n(i) as provided in section 302A.225; or\n(ii) by court appointment, with the appointee to serve only until a qualified successor is elected by the shareholders at the next regular or special meeting of the shareholders;\n(3) appoint a receiver of the public benefit corporation to:\n(i) wind up and liquidate the activities and business of the public benefit corporation; or\n(ii) carry on the business and activities of the public benefit corporation in a manner consistent with this chapter.\n(b) Paragraph (a) does not imply any limitations on the relief available in a proceeding brought under section 302A.751 without reference to this chapter.",
	"repealed": false
}