{
	"id": "327C.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.11",
	"title": "327C.11 EVICTION PROCEEDINGS.",
	"text": "The right of redemption, as expressed in section 504B.291 and the common law, is available to a resident from whom a park owner seeks to recover possession for nonpayment of rent, but no resident may exercise that right more than twice in any 12-month period; provided, that a resident may exercise the right of redemption more than twice in any 12-month period by paying the park owner's actual reasonable attorney's fees as part of each additional exercise of that right during the 12-month period.\nA park owner who gives a resident a notice as provided in section 327C.09, subdivision 3, 4, 6, or 8, or 327C.095, does not waive the notice by afterwards accepting rent. Acceptance of rent for a period after the expiration of a final notice to quit waives that notice unless the parties agree in writing after service of the notice that the notice continues in effect.\nThe issuance of a writ of recovery, other than a conditional writ, shall be stayed for a reasonable period not to exceed seven days to allow the resident to arrange to remove the resident's home from the lot.\nWhere the interests of justice require the court may issue a conditional writ of recovery, which orders the resident and all those in the resident's household to stop residing in the park within a reasonable period not to exceed seven days, but which allows the resident's home to remain on the lot for 60 days for the purpose of an in park sale, as provided in section 327C.07. The writ shall also direct the park owner to notify any party holding a security interest in the resident's home and known to the park owner, of the provisions of the writ. If the court issues a conditional writ, the resident may keep the home on the lot for 60 days for an in park sale if:\n(1) neither the resident nor members of the resident's household reside in the park;\n(2) the resident complies with all rules relating to home and lot maintenance; and\n(3) the resident pays on time all rent and utility charges owed to the park owner. If the resident fails to meet any of these conditions, the park owner may, on three days' written notice to the resident, move the court for an order making the writ of recovery unconditional. Sixty-one days after the issuance of a conditional writ, the writ shall become absolute without further court action.",
	"repealed": false
}