{
	"id": "142A.609",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.609",
	"title": "142A.609 BENEFITS AND PAYMENTS.",
	"text": "(a) There are three benefits under Northstar Care for Children: medical assistance, basic payment, and supplemental difficulty of care payment.\n(b) A child is eligible for medical assistance under subdivision 2.\n(c) A child is eligible for the basic payment under subdivision 3, except for a child assigned level A under section 142A.607, subdivision 1, because the child is determined to be an at-risk child receiving adoption assistance.\n(d) A child, including a foster child age 18 to 21, is eligible for an additional supplemental difficulty of care payment under subdivision 4, as determined by the assessment under section 142A.607.\n(e) An eligible child entering Northstar kinship assistance or adoption assistance under the age of six receives a basic payment and supplemental difficulty of care payment as specified in subdivision 5.\n(f) A child transitioning in from a pre-Northstar Care for Children program under section 142A.612, subdivision 7, shall receive basic and difficulty of care supplemental payments according to those provisions.\nEligibility for medical assistance under this chapter must be determined according to section 256B.055.\nFrom July 1, 2017, to June 30, 2018, the basic monthly rate must be according to the following schedule:\nFrom January 1, 2015, to June 30, 2016, the supplemental difficulty of care monthly rate is determined by the following schedule:\nA child assigned level A is not eligible for either the basic or supplemental difficulty of care payment, while a child assigned level B is not eligible for the supplemental difficulty of care payment but is eligible for the basic monthly rate under subdivision 3.\nA child who entered the Northstar kinship assistance or adoption assistance components of Northstar Care for Children while under the age of six shall receive 50 percent of the amount the child would otherwise be entitled to under subdivisions 3 and 4. The commissioner may also use the 50 percent rate for a child who was transitioned into those components through declaration of the commissioner under section 256N.28, subdivision 7.\n(a) A child who enters foster care due to immediate custody by a police officer or court order, consistent with section 260C.175, subdivisions 1 and 2, or equivalent provision under tribal code, shall receive the emergency foster care rate for up to 30 days. The emergency foster care rate cannot be extended beyond 30 days of the child's placement.\n(b) For this payment rate to be applied, at least one of three conditions must apply:\n(1) the child's initial placement must be in foster care in Minnesota;\n(2) the child's previous placement was more than two years ago; or\n(3) the child's previous placement was for fewer than 30 days and an assessment under section 142A.607 was not completed by an agency under section 142A.607.\n(c) The emergency foster care rate consists of the appropriate basic monthly rate under subdivision 3 plus a difficulty of care supplemental monthly rate of level D under subdivision 4.\n(d) The emergency foster care rate ends under any of three conditions:\n(1) when an assessment under section 142A.607 is completed;\n(2) when the placement ends; or\n(3) after 30 days have elapsed.\n(e) The financially responsible agency, in consultation with the legally responsible agency, if different, may replace the emergency foster care rate at any time by completing an initial assessment on which a revised difficulty of care supplemental monthly rate would be based. Consistent with section 142A.607, subdivision 11, the caregiver may request a reassessment in writing for an initial assessment to replace the emergency foster care rate. This written request would initiate an initial assessment under section 142A.607, subdivision 6. If the revised difficulty of care supplemental level based on the initial assessment is higher than level D, then the revised higher rate shall apply retroactively to the beginning of the placement. If the revised level is lower, the lower rate shall apply on the date the initial assessment was completed.\n(f) If a child remains in foster care placement for more than 30 days, the emergency foster care rate ends after the 30th day of placement and an assessment under this section must be completed.\n(a) The commissioner shall establish prorated daily rates to the nearest cent for the monthly rates under subdivisions 3 to 6. Daily rates must be routinely used when a partial month is involved for foster care, Northstar kinship assistance, or adoption assistance.\n(b) A full month payment is permitted if a foster child is temporarily absent from the foster home if the brief absence does not exceed 14 days and the child's placement continues with the same caregiver.\nBy April 1, 2016, for fiscal year 2017, and by each succeeding April 1 for the subsequent fiscal year, the commissioner shall review and revise the rates under subdivisions 3 to 6 based on the United States Department of Agriculture, Estimates of the Cost of Raising a Child, published by the United States Department of Agriculture, Agricultural Resources Service, Publication 1411. The revision shall be the average percentage by which costs increase for the age ranges represented in the United States Department of Agriculture, Estimates of the Cost of Raising a Child, except that in no instance must the increase be more than three percent per annum. The monthly rates must be revised to the nearest dollar and the daily rates to the nearest cent.\n(a) Except for a child assigned level A under section 142A.607, subdivision 1, paragraph (d), clause (1), a child who is eligible for an adoption assistance agreement may have reimbursement of home and vehicle modifications necessary to accommodate the child's special needs upon which eligibility for adoption assistance was based and included as part of the negotiation of the agreement under section 142A.608, subdivision 3. Reimbursement of home and vehicle modifications must not be available for a child who is assessed at level A under subdivision 1, unless and until the potential disability manifests itself and the agreement is renegotiated to include reimbursement.\n(b) Application for and reimbursement of modifications must be completed according to a process specified by the commissioner. The type and cost of each modification must be preapproved by the commissioner. The type of home and vehicle modifications must be limited to those specified by the commissioner.\n(c) Reimbursement for home modifications as outlined in this subdivision is limited to once every five years per child. Reimbursement for vehicle modifications as outlined in this subdivision is limited to once every five years per family.\n(a) A monthly Northstar kinship assistance or adoption assistance payment must be considered as income and resources attributable to the child. Northstar kinship assistance and adoption assistance are exempt from garnishment, except as permissible under the laws of the state where the child resides.\n(b) When a child is placed into foster care, any income and resources attributable to the child are treated as provided in sections 252.27 and 260C.331, or 260B.331, as applicable to the child being placed.\n(c) Supplemental Security Income (SSI), retirement survivor's disability insurance (RSDI), veteran's benefits, railroad retirement benefits, and black lung benefits are considered income and resources attributable to the child.\n(a) If a child placed in foster care receives benefits through Supplemental Security Income (SSI) at the time of foster care placement or subsequent to placement in foster care, the financially responsible agency may apply to be the payee for the child for the duration of the child's placement in foster care. If a child continues to be eligible for SSI after finalization of the adoption or transfer of permanent legal and physical custody and is determined to be eligible for a payment under Northstar Care for Children, a permanent caregiver may choose to receive payment from both programs simultaneously. The permanent caregiver is responsible to report the amount of the payment to the Social Security Administration and the SSI payment will be reduced as required by the Social Security Administration.\n(b) If a financially responsible agency applies to be the payee for a child who receives benefits through SSI, or receives the benefits under this subdivision on behalf of a child, the financially responsible agency must provide written notice by certified mail, return receipt requested to:\n(1) the child, if the child is 13 years of age or older;\n(2) the child's parent, guardian, or custodian or if there is no legal parent or custodian the child's relative selected by the agency;\n(3) the guardian ad litem;\n(4) the legally responsible agency; and\n(5) the counsel appointed for the child pursuant to section 260C.163, subdivision 3.\n(c) If a financially responsible agency receives benefits under this subdivision on behalf of a child 13 years of age or older, the legally responsible agency and the guardian ad litem must disclose this information to the child in person in a manner that best helps the child understand the information. This paragraph does not apply in circumstances where the child is living outside of Minnesota.\n(d) If a financially responsible agency receives the benefits under this subdivision on behalf of a child, it cannot use those funds for any other purpose than the care of that child. The financially responsible agency must not commingle any benefits received under this subdivision and must not put the benefits received on behalf of a child under this subdivision into a general fund.\n(e) If a financially responsible agency receives any benefits under this subdivision, it must keep a record of:\n(1) the total dollar amount it received on behalf of all children it receives benefits for;\n(2) the total number of children it applied to be a payee for; and\n(3) the total number of children it received benefits for.\n(f) By July 1, 2025, and each July 1 thereafter, each financially responsible agency must submit a report to the commissioner of children, youth, and families that includes the information required under paragraph (e). By September 1 of each year, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over child protection that compiles the information provided to the commissioner by each financially responsible agency under paragraph (e); subdivision 12, paragraph (e); and section 260C.331, subdivision 7, paragraph (d). This paragraph expires January 31, 2034.\n(a) If a child placed in foster care receives Retirement, Survivors, and Disability Insurance; veteran's benefits; railroad retirement benefits; or black lung benefits at the time of foster care placement or subsequent to placement in foster care, the financially responsible agency may apply to be the payee for the child for the duration of the child's placement in foster care. If it is anticipated that a child will be eligible to receive Retirement, Survivors, and Disability Insurance; veteran's benefits; railroad retirement benefits; or black lung benefits after finalization of the adoption or assignment of permanent legal and physical custody, the permanent caregiver shall apply to be the payee of those benefits on the child's behalf.\n(b) If the financially responsible agency applies to be the payee for a child who receives Retirement, Survivors, and Disability Insurance; veteran's benefits; railroad retirement benefits; or black lung benefits, or receives the benefits under this subdivision on behalf of a child, the financially responsible agency must provide written notice by certified mail, return receipt requested to:\n(1) the child, if the child is 13 years of age or older;\n(2) the child's parent, guardian, or custodian or if there is no legal parent or custodian the child's relative selected by the agency;\n(3) the guardian ad litem;\n(4) the legally responsible agency; and\n(5) the counsel appointed for the child pursuant to section 260C.163, subdivision 3.\n(c) If a financially responsible agency receives benefits under this subdivision on behalf of a child 13 years of age or older, the legally responsible agency and the guardian ad litem must disclose this information to the child in person in a manner that best helps the child understand the information. This paragraph does not apply in circumstances where the child is living outside of Minnesota.\n(d) If a financially responsible agency receives the benefits under this subdivision on behalf of a child, it cannot use those funds for any other purpose than the care of that child. The financially responsible agency must not commingle any benefits received under this subdivision and must not put the benefits received on behalf of a child under this subdivision into a general fund.\n(e) If a financially responsible agency receives any benefits under this subdivision, it must keep a record of:\n(1) the total dollar amount it received on behalf of all children it receives benefits for;\n(2) the total number of children it applied to be a payee for; and\n(3) the total number of children it received benefits for.\n(f) By July 1, 2025, and each July 1 thereafter, each financially responsible agency must submit a report to the commissioner of children, youth, and families that includes the information required under paragraph (e).\n(a) If a child placed in foster care receives child support, the child support payment may be redirected to the financially responsible agency for the duration of the child's placement in foster care. In cases where the child qualifies for Northstar Care for Children by meeting the adoption assistance eligibility criteria or the Northstar kinship assistance eligibility criteria, any court-ordered child support must not be considered income attributable to the child and must have no impact on the monthly payment.\n(b) Consistent with section 142G.17, a child eligible for Northstar Care for Children whose caregiver receives a payment on the child's behalf is excluded from a Minnesota family investment program assistance unit.\n(a) Payments to caregivers or youth under Northstar Care for Children must be made monthly. Consistent with section 142A.607, subdivision 13, the financially responsible agency must send the caregiver or youth the required written notice within 15 days of a completed assessment or reassessment.\n(b) Unless paragraph (c), (d), or (e) applies, the financially responsible agency shall pay foster parents directly for eligible children in foster care.\n(c) When the legally responsible agency is different than the financially responsible agency, the legally responsible agency may make the payments to the caregiver or youth, provided payments are made on a timely basis. The financially responsible agency must pay the legally responsible agency on a timely basis. Caregivers must have access to the financially and legally responsible agencies' records of the transaction, consistent with the retention schedule for the payments.\n(d) For eligible children in foster care, the financially responsible agency may pay the foster parent's payment for a licensed child-placing agency instead of paying the foster parents directly. The licensed child-placing agency must timely pay the foster parents and maintain records of the transaction. Caregivers must have access to the financially responsible agency's records of the transaction and the child-placing agency's records of the transaction, consistent with the retention schedule for the payments.\n(e) If a foster youth aged 18 to 21 years old is placed in an unlicensed supervised independent living setting, payments must be made directly to the youth or to a vendor if the legally responsible agency determines it to be in the youth's best interests. If the legally responsible agency has reason to believe that the youth is being financially exploited or at risk of being financially exploited in the approved unlicensed supervised independent living setting, the legally responsible agency shall advise the financially responsible agency to make the payments to a vendor.\nPayments received under this section must not be considered as income for child care assistance under chapter 142E or any other financial benefit. Consistent with section 142G.17, a child or youth receiving a maintenance payment under Northstar Care for Children is excluded from any Minnesota family investment program assistance unit.\nA child in foster care may qualify for home and community-based waivered services, consistent with section 256B.092 for developmental disabilities, or section 256B.49 for community alternative care, community access for disability inclusion, or traumatic brain injury waivers. A waiver service must not be substituted for the foster care program. When the child is simultaneously eligible for waivered services and for benefits under Northstar Care for Children, the financially responsible agency must assess and provide basic and supplemental difficulty of care rates as determined by the assessment according to section 142A.607. If it is determined that additional services are needed to meet the child's needs in the home that are not or cannot be met by the foster care program, the need would be referred to the local waivered service program.\nThe commissioner has the authority to collect any amount of foster care payment, adoption assistance, or Northstar kinship assistance paid to a caregiver or youth in excess of the payment due. Payments covered by this subdivision include basic maintenance needs payments, supplemental difficulty of care payments, and reimbursement of home and vehicle modifications under subdivision 9. Prior to any collection, the commissioner or the commissioner's designee shall notify the caregiver or youth in writing, including:\n(1) the amount of the overpayment and an explanation of the cause of overpayment;\n(2) clarification of the corrected amount;\n(3) a statement of the legal authority for the decision;\n(4) information about how the caregiver can correct the overpayment;\n(5) if repayment is required, when the payment is due and a person to contact to review a repayment plan;\n(6) a statement that the caregiver or youth has a right to a fair hearing review by the department; and\n(7) the procedure for seeking a fair hearing review by the department.\nFor adoption assistance and Northstar kinship assistance cases, the payment must only be made to the adoptive parent or relative custodian specified on the agreement. If there is more than one adoptive parent or relative custodian, both parties will be listed as the payee unless otherwise specified in writing according to policies outlined by the commissioner. In the event of divorce or separation of the caregivers, a change of payee must be made in writing according to policies outlined by the commissioner. If both caregivers are in agreement as to the change, it may be made according to a process outlined by the commissioner. If there is not agreement as to the change, a court order indicating the party who is to receive the payment is needed before a change can be processed. If the change of payee is disputed, the commissioner may withhold the payment until agreement is reached. A noncustodial caregiver may request notice in writing of review, modification, or termination of the adoption assistance or Northstar kinship assistance agreement. In the event of the death of a payee, a change of payee consistent with sections 142A.605 and 142A.606 may be made in writing according to policies outlined by the commissioner.\n(a) A caregiver who has an adoption assistance agreement or Northstar kinship assistance agreement in place shall keep the agency administering the program informed of changes in status or circumstances which would make the child ineligible for the payments or eligible for payments in a different amount.\n(b) For the duration of the agreement, the caregiver agrees to notify the agency administering the program in writing within 30 days of any of the following:\n(1) a change in the child's or caregiver's legal name;\n(2) a change in the family's address;\n(3) a change in the child's legal custody status;\n(4) the child's completion of high school, if this occurs after the child attains age 18;\n(5) the end of the caregiver's legal responsibility to support the child based on termination of parental rights of the caregiver, transfer of guardianship to another person, or transfer of permanent legal and physical custody to another person;\n(6) the end of the caregiver's financial support of the child;\n(7) the death of the child;\n(8) the death of the caregiver;\n(9) the child enlists in the military;\n(10) the child gets married;\n(11) the child becomes an emancipated minor through legal action;\n(12) the caregiver separates or divorces; and\n(13) the child is residing outside the caregiver's home for a period of more than 30 consecutive days.\nThe caregiver or youth must be investigated for fraud if the caregiver or youth reports information the caregiver or youth knows is untrue, the caregiver or youth fails to notify the commissioner of changes that may affect eligibility, or the agency administering the program receives relevant information that the caregiver or youth did not report.\nThe agency that issues the maintenance payment shall provide the child's caregiver or the youth with written notice of termination of payment. Termination notices must be sent at least 15 days before the final payment or, in the case of an unplanned termination, the notice is sent within three days of the end of the payment. The written notice must minimally include the following:\n(1) the date payment will end;\n(2) the reason payments will end and the event that is the basis to terminate payment;\n(3) a statement that the caregiver or youth has a right to a fair hearing review by the department consistent with section 256.045, subdivision 3;\n(4) the procedure to request a fair hearing; and\n(5) the name, telephone number, and email address of a contact person at the agency.",
	"repealed": false
}