{
	"id": "14.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.38",
	"title": "14.38 EFFECT OF ADOPTION OF RULES.",
	"text": "Every rule, regardless of whether it might be known as a substantive, procedural, or interpretive rule, which is filed in the Office of the Secretary of State as provided in sections 14.05 to 14.28 shall have the force and effect of law five working days after its notice of adoption is published in the State Register unless a different date is required by statute or a later date is specified in the rule. The secretary of state shall keep a permanent record of rules filed with that office open to public inspection.\nEvery existing rule, regardless of whether it might be known as a substantive, procedural, or interpretive rule, has the force and effect of law retroactive to the date on which the rule became effective if:\n(1) the rule was adopted in compliance with the provisions of the Administrative Procedure Act in effect at the time the rule was adopted;\n(2) the rule was approved by the attorney general or Office of Administrative Hearings before becoming effective; and\n(3) the adopting agency had statutory authority to adopt the rule.\nSubdivisions 1 and 2 do not apply to any rule specifically held not to have the force and effect of law by the state supreme court before May 8, 1981.\nEach rule hereafter amended, suspended, or repealed is amended, suspended, or repealed five working days after the appropriate notice is published in the State Register unless a later date is required by law or specified in the rule.\n[Repealed, 1997 c 187 art 5 s 36]\n[Repealed, 1997 c 187 art 5 s 36]\n[Repealed, 1997 c 187 art 5 s 36]\n[Repealed, 1997 c 187 art 5 s 36]\n[Repealed, 1997 c 187 art 5 s 36]\nRules excluded from the Administrative Procedure Act in Minnesota Statutes 1978, section 15.0411, subdivision 2, but included in the rulemaking provisions of the act in Minnesota Statutes 1980, section 15.0411, subdivision 2, have the force and effect of law and shall be published by the revisor of statutes pursuant to section 14.47, to the extent the rules are still in effect, if the rules were:\n(1) adopted by an agency; and,\n(2) filed with the secretary of state before April 25, 1980.\nRules excluded from the Administrative Procedure Act in Minnesota Statutes 1978, section 15.0411, subdivision 2, but included in the rulemaking provisions of the act in Minnesota Statutes 1980, section 15.0411, subdivision 2, shall have the force and effect of law and be published by the revisor of statutes pursuant to section 14.47, to the extent the rules are still in effect, if:\n(1) the rules were adopted by an agency;\n(2) the rules were not filed with the secretary of state before April 25, 1980; and,\n(3) a copy of the rules which were effective on April 25, 1980, but unfiled with the secretary of state are filed with both the secretary of state and the revisor of statutes before September 1, 1981.",
	"repealed": false
}