{
	"id": "62A.673",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.673",
	"title": "62A.673 COVERAGE OF SERVICES PROVIDED THROUGH TELEHEALTH.",
	"text": "This section may be cited as the \"Minnesota Telehealth Act.\"\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Distant site\" means a site at which a health care provider is located while providing health care services or consultations by means of telehealth.\n(c) \"Health care provider\" means a health care professional who is licensed or registered by the state to perform health care services within the provider's scope of practice and in accordance with state law. A health care provider includes a mental health professional under section 245I.04, subdivision 2; a mental health practitioner under section 245I.04, subdivision 4; a clinical trainee under section 245I.04, subdivision 6; a treatment coordinator under section 245G.11, subdivision 7; an alcohol and drug counselor under section 245G.11, subdivision 5; and a recovery peer under section 245G.11, subdivision 8.\n(d) \"Health carrier\" has the meaning given in section 62A.011, subdivision 2.\n(e) \"Health plan\" has the meaning given in section 62A.011, subdivision 3. Health plan includes dental plans as defined in section 62Q.76, subdivision 3, but does not include dental plans that provide indemnity-based benefits, regardless of expenses incurred, and are designed to pay benefits directly to the policy holder.\n(f) \"Originating site\" means a site at which a patient is located at the time health care services are provided to the patient by means of telehealth. For purposes of store-and-forward technology, the originating site also means the location at which a health care provider transfers or transmits information to the distant site.\n(g) \"Store-and-forward technology\" means the asynchronous electronic transfer or transmission of a patient's medical information or data from an originating site to a distant site for the purposes of diagnostic and therapeutic assistance in the care of a patient.\n(h) \"Telehealth\" means the delivery of health care services or consultations through the use of real time two-way interactive audio and visual communications to provide or support health care delivery and facilitate the assessment, diagnosis, consultation, treatment, education, and care management of a patient's health care. Telehealth includes the application of secure video conferencing, store-and-forward technology, and synchronous interactions between a patient located at an originating site and a health care provider located at a distant site. Until July 1, 2025, telehealth also includes audio-only communication between a health care provider and a patient in accordance with subdivision 6, paragraph (b). Telehealth does not include communication between health care providers that consists solely of a telephone conversation, email, or facsimile transmission. Telehealth does not include communication between a health care provider and a patient that consists solely of an email or facsimile transmission. Telehealth does not include telemonitoring services as defined in paragraph (i).\n(i) \"Telemonitoring services\" means the remote monitoring of clinical data related to the enrollee's vital signs or biometric data by a monitoring device or equipment that transmits the data electronically to a health care provider for analysis. Telemonitoring is intended to collect an enrollee's health-related data for the purpose of assisting a health care provider in assessing and monitoring the enrollee's medical condition or status.\n[See Note.]\n(a) A health plan sold, issued, or renewed by a health carrier in Minnesota must (1) cover benefits delivered through telehealth in the same manner as any other benefits covered under the health plan, and (2) comply with this section.\n(b) Coverage for services delivered through telehealth must not be limited on the basis of geography, location, or distance for travel subject to the health care provider network available to the enrollee through the enrollee's health plan.\n(c) A health carrier must not create a separate provider network to deliver services through telehealth that does not include network providers who provide in-person care to patients for the same service or require an enrollee to use a specific provider within the network to receive services through telehealth.\n(d) A health carrier may require a deductible, co-payment, or coinsurance payment for a health care service provided through telehealth, provided that the deductible, co-payment, or coinsurance payment is not in addition to, and does not exceed, the deductible, co-payment, or coinsurance applicable for the same service provided through in-person contact.\n(e) Nothing in this section:\n(1) requires a health carrier to provide coverage for services that are not medically necessary or are not covered under the enrollee's health plan; or\n(2) prohibits a health carrier from:\n(i) establishing criteria that a health care provider must meet to demonstrate the safety or efficacy of delivering a particular service through telehealth for which the health carrier does not already reimburse other health care providers for delivering the service through telehealth;\n(ii) establishing reasonable medical management techniques, provided the criteria or techniques are not unduly burdensome or unreasonable for the particular service; or\n(iii) requiring documentation or billing practices designed to protect the health carrier or patient from fraudulent claims, provided the practices are not unduly burdensome or unreasonable for the particular service.\n(f) Nothing in this section requires the use of telehealth when a health care provider determines that the delivery of a health care service through telehealth is not appropriate or when an enrollee chooses not to receive a health care service through telehealth.\n(a) A health carrier must not restrict or deny coverage of a health care service that is covered under a health plan solely:\n(1) because the health care service provided by the health care provider through telehealth is not provided through in-person contact; or\n(2) based on the communication technology or application used to deliver the health care service through telehealth, provided the technology or application complies with this section and is appropriate for the particular service.\n(b) Prior authorization may be required for health care services delivered through telehealth only if prior authorization is required before the delivery of the same service through in-person contact.\n(c) A health carrier may require a utilization review for services delivered through telehealth, provided the utilization review is conducted in the same manner and uses the same clinical review criteria as a utilization review for the same services delivered through in-person contact.\n(d) A health carrier or health care provider shall not require an enrollee to pay a fee to download a specific communication technology or application.\n(a) A health carrier must reimburse the health care provider for services delivered through telehealth on the same basis and at the same rate as the health carrier would apply to those services if the services had been delivered by the health care provider through in-person contact.\n(b) A health carrier must not deny or limit reimbursement based solely on a health care provider delivering the service or consultation through telehealth instead of through in-person contact.\n(c) A health carrier must not deny or limit reimbursement based solely on the technology and equipment used by the health care provider to deliver the health care service or consultation through telehealth, provided the technology and equipment used by the provider meets the requirements of this section and is appropriate for the particular service.\n(d) Nothing in this subdivision prohibits a health carrier and health care provider from entering into a contract that includes a value-based reimbursement arrangement for the delivery of covered services that may include services delivered through telehealth, and such an arrangement shall not be considered a violation of this subdivision.\n(a) A health carrier must not require a health care provider to use specific telecommunications technology and equipment as a condition of coverage under this section, provided the health care provider uses telecommunications technology and equipment that complies with current industry interoperable standards and complies with standards required under the federal Health Insurance Portability and Accountability Act of 1996, Public Law 104-191, and regulations promulgated under that Act, unless authorized under this section.\n(b) A health carrier must provide coverage for health care services delivered through telehealth by means of the use of audio-only communication if the communication is a scheduled appointment and the standard of care for that particular service can be met through the use of audio-only communication. Substance use disorder treatment services and mental health care services delivered through telehealth by means of audio-only communication may be covered without a scheduled appointment if the communication was initiated by the enrollee while in an emergency or crisis situation and a scheduled appointment was not possible due to the need of an immediate response. This paragraph expires July 1, 2023.\nA health carrier must provide coverage for telemonitoring services if:\n(1) the telemonitoring service is medically appropriate based on the enrollee's medical condition or status;\n(2) the enrollee is cognitively and physically capable of operating the monitoring device or equipment, or the enrollee has a caregiver who is willing and able to assist with the monitoring device or equipment; and\n(3) the enrollee resides in a setting that is suitable for telemonitoring and not in a setting that has health care staff on site.\nThis section does not apply to coverage provided to state public health care program enrollees under chapter 256B or 256L.",
	"repealed": false
}