{
	"id": "83.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/83.28",
	"title": "83.28 SALES CONTRACT; RESCISSION.",
	"text": "Every contract for sale relating to subdivided land shall (1) state clearly the legal description of the lot, unit, parcel, or interest disposed of; (2) contain the disclosure substantially similar to that required by the federal Truth in Lending Act, and the rules promulgated thereunder; and (3) be in recordable form.\nAny contract or agreement for the sale of a lot, parcel, unit, or interest in a subdivision not exempt under section 83.26, is voidable at the discretion of the purchaser, for a period of three years from the date of the contract or agreement, notwithstanding the delivery of a deed to the purchaser, if the subdivision was not registered under sections 83.20 to 83.42, 83.43 and 83.44 at the time of the sale, or if a current public offering statement was not given to the purchaser in accordance with section 83.24, unless subsequently thereto the subdivision is registered under this chapter and in connection therewith, the purchaser has received a written offer to repurchase the lot, parcel, unit, or interest for cash payable on closing of the repurchase, together with interest thereon from the date of purchase at the legal rate or at the rate charged on any lien paid by the purchaser, whichever is higher, less the amount of any income received from the lot, parcel, unit, or interest, and the purchaser has failed to accept the offer in writing within 30 days of its receipt. No offer of repurchase shall be effective unless a duplicate copy thereof has been filed with the commissioner at least 20 days prior to its delivery to the offeree and the commissioner has not objected to the offer within that time. The offer of repurchase shall be in the form and contain the information the commissioner by rule or order prescribes. If the purchaser no longer owns the lot, parcel, unit, or interest, the purchaser shall be entitled to maintain an action at law, and the damages shall be the consideration paid for the lot, parcel, unit, or interest together with interest thereon as specified above from the date of acquisition to the date of disposition, plus costs and reasonable attorney's fees, less the value received for the lot, parcel, unit, or interest at the date of disposition.\nA purchaser has an unconditional right to rescind any contract, agreement, or other evidence of indebtedness, or revoke any offer, at any time prior to or within five days after the date the purchaser actually receives a legible copy of the binding contract, agreement, or other evidence of indebtedness or offer and the public offering statement as provided in section 83.24. Predating of a document does not affect the time in which the right to rescind may be exercised. The burden of proving that the document was not predated is upon the subdivider or lender.\nEach contract, agreement, or other evidence of indebtedness shall be prominently labeled and captioned that it is a document taken in connection with a sale or other disposition of lands under sections 83.20 to 83.42, 83.43 and 83.44.\nThe first contract, agreement, or other evidence of indebtedness shall prominently contain upon its face the following notice in bold type, which shall be at least 4 point type larger than the body of the document, stating, in one of the following forms:\n(a) Registration by notification: \"Notice to Purchaser\" -- \"You are entitled to rescind this agreement for any reason within five days from the date you actually received a legible copy of this document signed by all parties. The rescission must be in writing and mailed to the subdivider or subdivider's agent or the lender at the address stated in this document. Upon rescission you will receive a refund of all money paid within 30 days after the subdivider receives notice of your rescission.\"; or\n(b) Registration by qualification: \"Notice to Purchaser\" -- \"You are entitled to rescind this agreement for any reason within five days from the date you actually received a legible copy of this document signed by all parties and a public offering statement. The rescission must be in writing and mailed to the subdivider or subdivider's agent or the lender at the address stated in this document. Upon rescission you will receive a refund of all money paid within 30 days after the subdivider receives notice of your rescission.\"\nThe contract, agreement, or other evidence of indebtedness shall contain sufficient space upon its face in immediate proximity to the above notice for the signature of each purchaser obligated under such instrument, acknowledging that such purchaser has read the notice.\nRescission occurs when the purchaser gives written notice of rescission to the subdivider or subdivider's agent or the lender at the address stated in the contract, agreement, or other evidence of indebtedness. Notice of rescission, if given by mail is effective when it is deposited in a mailbox properly addressed and postage prepaid. A notice of rescission given by the purchaser need not take a particular form and is sufficient if it indicates by any form of written expression the intention of the purchaser not to be bound by the contract, agreement, or other evidence of indebtedness.\nNo act of a purchaser shall be effective to waive the right to rescind as provided in this section.",
	"repealed": false
}