{
	"id": "122A.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.73",
	"title": "122A.73 GRANTS FOR GROW YOUR OWN PROGRAMS.",
	"text": "The commissioner of education must award grants for Grow Your Own programs established under this section in order to develop a teaching workforce that more closely reflects the state's increasingly diverse student population and ensure all students have equitable access to effective and diverse teachers.\n(a) A school district, charter school, Tribal contract school, or cooperative unit under section 123A.24, subdivision 2, may apply for a grant for a teacher preparation program that meets the requirements of paragraph (c) to establish a Grow Your Own pathway for adults to obtain their first professional teaching license. The grant recipient must use at least 80 percent of grant funds to provide tuition scholarships or stipends to enable grant recipient employees or community members affiliated with a grant recipient, who are of color or American Indian and who seek a teaching license, to participate in the teacher preparation program. Grant funds may also be used to pay for teacher licensure exams and licensure fees.\n(b) A district using grant funds under this subdivision to provide financial support to teacher candidates may require a commitment as determined by the district to teach in the school district, charter school, Tribal contract school, or cooperative unit for a reasonable amount of time that does not exceed five years.\n(c) A grantee must partner with:\n(1) a Professional Educator Licensing and Standards Board-approved teacher preparation program;\n(2) a Council for the Accreditation of Educator Preparation-accredited teacher preparation program from a private, not for profit, institution of higher education; or\n(3) an institution that has an articulated transfer pathway with a board-approved teacher preparation program.\n(a) A school district, charter school, Tribal contract school, or cooperative unit may apply for grants under this section to offer other innovative programs that encourage secondary school students, especially students of color and American Indian students, to pursue teaching. To be eligible for a grant under this subdivision, an applicant must ensure that the aggregate percentage of secondary school students of color and American Indian students participating in the program is equal to or greater than the aggregate percentage of students of color and American Indian students in the school district, charter school, Tribal contract school, or cooperative unit.\n(b) A grant recipient must use grant funds awarded under this subdivision for:\n(1) supporting future teacher clubs or service-learning opportunities that provide middle and high school students with experiential learning that supports the success of younger students or peers and increases students' interest in pursuing a teaching career;\n(2) developing and offering postsecondary enrollment options for \"Introduction to Teaching\" or \"Introduction to Education\" courses consistent with section 124D.09, subdivision 10, that meet degree requirements for teacher licensure;\n(3) providing direct support, including wrap-around services, for students who are of color or American Indian to enroll and be successful in postsecondary enrollment options courses under section 124D.09 that would meet degree requirements for teacher licensure; or\n(4) offering scholarships to graduating high school students who are of color or American Indian to enroll in board-approved undergraduate teacher preparation programs at a college or university in Minnesota or in an institution that has an articulated transfer pathway with a board-approved teacher preparation program.\n(c) The maximum grant award under this subdivision is $500,000. The commissioner may consider the number of participants a grant recipient intends to support when determining a grant amount.\n(a) An applicant must apply for a grant under this section in the form and manner specified by the commissioner. The commissioner must give priority to applicants with the highest total number or percentage of students who are of color or American Indian. To the extent that there are sufficient applications, the commissioner must, to the extent practicable, award an equal number of grants between applicants in greater Minnesota and those in the Twin Cities metropolitan area.\n(b) Grant applications for new and existing programs must be received by the commissioner no later than January 15 of the year prior to the school year in which the grant will be used. The commissioner must review all applications and notify grant recipients by March 15 or as soon as practicable of the anticipated amount awarded. If the commissioner determines that sufficient funding is unavailable for the grants, the commissioner must notify grant applicants by June 30 or as soon as practicable that there are insufficient funds.\n(a) An account is established in the special revenue fund known as the \"Grow Your Own program account.\"\n(b) Funds appropriated for the Grow Your Own program under this section must be transferred to the Grow Your Own program account in the special revenue fund.\n(c) Money in the account is annually appropriated to the commissioner for the Grow Your Own program under this section. Any returned funds are available to be regranted. Grant recipients may apply to use grant money over a period of up to 60 months.\n(d) Up to $175,000 annually is appropriated to the commissioner for costs associated with administering and monitoring the program under this section.\nGrant recipients must annually report to the commissioner in the form and manner determined by the commissioner on their activities under this section, including the number of participants, the percentage of participants who are of color or American Indian, and an assessment of program effectiveness, including participant feedback, areas for improvement, the percentage of participants continuing to pursue teacher licensure, and where applicable, the number of participants hired in the school or district as teachers after completing preparation programs. The commissioner must publish a report for the public that summarizes the activities and outcomes of grant recipients and what was done to promote sharing of effective practices among grant recipients and potential grant applicants.",
	"repealed": false
}