{
	"id": "144G.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.57",
	"title": "144G.57 PLANNED CLOSURES.",
	"text": "In the event that an assisted living facility elects to voluntarily close the facility, the facility must notify the commissioner, the Office of Ombudsman for Long-Term Care, and the Office of Ombudsman for Mental Health and Developmental Disabilities in writing by submitting a proposed closure plan.\nThe facility's proposed closure plan must include:\n(1) the procedures and actions the facility will implement to notify residents of the closure, including a copy of the written notice to be given to residents, designated representatives, legal representatives, and family and other resident contacts;\n(2) the procedures and actions the facility will implement to ensure all residents receive appropriate termination planning in accordance with section 144G.55, and final accountings and returns under section 144G.42, subdivision 5;\n(3) assessments of the needs and preferences of individual residents; and\n(4) procedures and actions the facility will implement to maintain compliance with this chapter until all residents have relocated.\n(a) The plan shall be subject to the commissioner's approval and subdivision 6. The facility shall take no action to close the residence prior to the commissioner's approval of the plan. The commissioner shall approve or otherwise respond to the plan as soon as practicable.\n(b) The commissioner may require the facility to work with a transitional team comprised of department staff, staff of the Office of Ombudsman for Long-Term Care, the Office of Ombudsman for Mental Health and Developmental Disabilities, and other professionals the commissioner deems necessary to assist in the proper relocation of residents.\nPrior to termination, the facility must follow the termination planning requirements under section 144G.55, and final accounting and return requirements under section 144G.42, subdivision 5, for residents. The facility must implement the plan approved by the commissioner and ensure that arrangements for relocation and continued care that meet each resident's social, emotional, and health needs are effectuated prior to closure.\nAfter the commissioner has approved the relocation plan and at least 60 calendar days before closing, except as provided under subdivision 6, the facility must notify residents, designated representatives, and legal representatives of the closure, the proposed date of closure, the contact information of the Ombudsman for Long-Term Care and the Ombudsman for Mental Health and Developmental Disabilities, and that the facility will follow the termination planning requirements under section 144G.55, and final accounting and return requirements under section 144G.42, subdivision 5. For residents who receive home and community-based waiver services under chapter 256S and section 256B.49, the facility must also provide this information to the resident's case manager.\n(a) In the event the facility must close because the commissioner deems the facility can no longer remain open, the facility must meet all requirements in subdivisions 1 to 5, except for any requirements the commissioner finds would endanger the health and safety of residents. In the event the commissioner determines a closure must occur with less than 60 calendar days' notice, the facility shall provide notice to residents as soon as practicable or as directed by the commissioner.\n(b) Upon request from the commissioner, the facility must provide the commissioner with any documentation related to the appropriateness of its relocation plan, or to any assertion that the facility lacks the funds to comply with subdivisions 1 to 5, or that remaining open would otherwise endanger the health and safety of residents pursuant to paragraph (a).\nNothing in this section affects the rights and remedies available under chapter 504B.\n(a) The commissioner may impose a fine for failure to follow the requirements of this section.\n(b) The fine for failure to comply with this section is $1,000.\n(c) Fines and penalties collected under this section shall be deposited in a dedicated special revenue account. On an annual basis, the balance in the special revenue account shall be appropriated to the commissioner to implement the recommendations of the advisory council established in section 144A.4799.",
	"repealed": false
}