{
	"id": "16B.312",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.312",
	"title": "16B.312 CONSTRUCTION MATERIALS; ENVIRONMENTAL ANALYSIS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Carbon steel\" means steel in which the main alloying element is carbon and whose properties are chiefly dependent on the percentage of carbon present.\n(c) \"Commissioner\" means the commissioner of administration.\n(d) \"Electric arc furnace\" means a furnace that produces molten alloy metal and heats the charge materials with electric arcs from carbon electrodes.\n(e) \"Eligible material\" means:\n(1) carbon steel rebar;\n(2) structural steel;\n(3) concrete; or\n(4) asphalt paving mixtures.\n(f) \"Eligible project\" means:\n(1) new construction of a state building larger than 50,000 gross square feet of occupied or conditioned space;\n(2) renovation of more than 50,000 gross square feet of occupied or conditioned space in a state building whose renovation cost exceeds 50 percent of the building's assessed value; or\n(3) new construction or reconstruction of two or more lane-miles of a trunk highway.\n(g) \"Environmental product declaration\" means a supply chain specific type III environmental product declaration that:\n(1) contains a material production life cycle assessment of the environmental impacts of manufacturing a specific product by a specific firm, including the impacts of extracting and producing the raw materials and components that compose the product;\n(2) is verified by a third party; and\n(3) meets the ISO 14025 standard developed and maintained by the International Organization for Standardization (ISO).\n(h) \"Global warming potential\" has the meaning given in section 216H.10, subdivision 6.\n(i) \"Greenhouse gas\" has the meaning given to \"statewide greenhouse gas emissions\" in section 216H.01, subdivision 2.\n(j) \"Integrated steel production\" means the production of iron and subsequently steel primarily from iron ore or iron ore pellets.\n(k) \"Material production life cycle\" means an analysis that includes the environmental impacts of all stages of a specific product's production, from mining and processing the product's raw materials to the process of manufacturing the product.\n(l) \"Rebar\" means a steel reinforcing bar or rod encased in concrete.\n(m) \"Secondary steel production\" means the production of steel from primarily ferrous scrap and other metallic inputs that are melted and refined in an electric arc furnace.\n(n) \"State building\" means a building owned by the state of Minnesota or a Minnesota state agency.\n(o) \"Structural steel\" means steel that is used in structural applications in accordance with industry standard definitions.\n(p) \"Supply chain specific\" means an environmental product declaration that includes specific data for the production processes of the materials and components composing a product that contribute at least 80 percent of the product's material production life cycle global warming potential, as defined in ISO standard 21930.\n(a) The commissioner shall, after reviewing the recommendations from the Environmental Standards Procurement Task Force made under subdivision 5, paragraph (c), establish and publish a maximum acceptable global warming potential for each eligible material used in an eligible project, in accordance with the following schedule:\n(1) for concrete used in buildings, no later than January 15, 2026; and\n(2) for carbon steel rebar and structural steel and, after conferring with the commissioner of transportation, for asphalt paving mixtures and concrete pavement, no later than January 15, 2028.\n(b) The commissioner shall, after considering nationally or internationally recognized databases of environmental product declarations for an eligible material, establish the maximum acceptable global warming potential for the eligible material.\n(c) The commissioner may set different maximum global warming potentials for different specific products and subproduct categories that are examples of the same eligible material based on distinctions between eligible material production and manufacturing processes, such as integrated versus secondary steel production.\n(d) The commissioner must establish maximum global warming potentials that are consistent with criteria in an environmental product declaration.\n(e) Not later than three years after establishing the maximum global warming potential for an eligible material under paragraph (a), and not longer than every three years thereafter, the commissioner, after conferring with the commissioner of transportation with respect to asphalt paving mixtures and concrete pavement, shall review the maximum acceptable global warming potential for each eligible material and for specific eligible material products. The commissioner may adjust any of the values downward to reflect industry improvements if, based on the process described in paragraph (b), the commissioner determines the industry average has declined.\nThe Department of Administration and the Department of Transportation shall, after reviewing the recommendations of the Environmental Standards Procurement Task Force made under subdivision 5, paragraph (c), establish processes for incorporating the maximum allowable global warming potential of eligible materials into bidding processes by the effective dates listed in subdivision 2. The Department of Administration and Department of Transportation must also incorporate into the bidding process a preference for materials mined, made, or assembled in Minnesota.\n(a) No later than July 1, 2024, the Department of Administration must establish a pilot program that seeks to obtain from vendors an estimate of the material production life cycle greenhouse gas emissions of products selected by the departments from among those procured. The pilot program must encourage, but may not require, a vendor to submit the following data for each selected product that represents at least 90 percent of the total cost of the materials or components composing the selected product:\n(1) the quantity of the product purchased by the department;\n(2) a current environmental product declaration for the product;\n(3) the name and location of the product's manufacturer;\n(4) a copy of the vendor's Supplier Code of Conduct, if any;\n(5) the names and locations of the product's actual production facilities; and\n(6) an assessment of employee working conditions at the product's production facilities.\n(b) The Department of Administration must construct or provide access to a publicly accessible database, which shall be posted on the department's website and contain the data reported to the department under this subdivision.\n(a) No later than October 1, 2023, the commissioners of administration and transportation must establish an Environmental Standards Procurement Task Force to examine issues surrounding the implementation of a program requiring vendors of certain construction materials purchased by the state to:\n(1) submit environmental product declarations that assess the material production life cycle environmental impacts of the materials to state officials as part of the procurement process; and\n(2) meet standards established by the commissioner of administration that limit greenhouse gas emissions impacts of the materials.\n(b) The task force must examine, at a minimum, the following:\n(1) which construction materials should be subject to the program requirements and which construction materials should be considered to be added, including lumber, mass timber, aluminum, glass, and insulation;\n(2) what factors should be considered in establishing greenhouse gas emissions standards, including distinctions between eligible material production and manufacturing processes, such as integrated versus secondary steel production;\n(3) a schedule for the development of standards for specific materials and for incorporating the standards into the purchasing process, including distinctions between eligible material production and manufacturing processes;\n(4) the development and use of financial incentives to reward vendors for developing products whose greenhouse gas emissions are below the standards;\n(5) the provision of grants to defer a vendor's cost to obtain environmental product declarations;\n(6) how to ensure that lowering environmental product declaration values does not negatively impact the durability or longevity of construction materials or built structures;\n(7) how to create and manage a database for environmental product declaration data that is consistent with data governance procedures of the state and is compatible for data sharing with other states and federal agencies;\n(8) how to account for differences among geographical regions with respect to the availability of covered materials, fuel, and other necessary resources, and the quantity of covered materials that the department uses or plans to use;\n(9) coordinating with the federal Buy Clean Task Force established under Executive Order 14057 and representatives of the United States Departments of Commerce, Energy, Housing and Urban Development, and Transportation; Environmental Protection Agency; General Services Administration; White House Office of Management and Budget; and the White House Domestic Climate Policy Council;\n(10) how the issues in clauses (1) to (9) are addressed by existing programs in other states and countries; and\n(11) any other issues the task force deems relevant.\n(c) The task force shall make recommendations to the commissioners of administration and transportation regarding:\n(1) how to implement requirements that maximum global warming impacts for eligible materials be integrated into the bidding process for eligible projects;\n(2) incentive structures that can be included in bidding processes to encourage the use of materials whose global warming potential is below the maximum established under subdivision 2;\n(3) how a successful bidder for a contract notifies the commissioner of the specific environmental product declaration for a material used on a project;\n(4) a process for waiving the requirements to procure materials below the maximum global warming potential resulting from product supply problems, geographic impracticability, or financial hardship;\n(5) a system for awarding grants to manufacturers of eligible materials located in Minnesota to offset the cost of obtaining environmental product declarations or otherwise collect environmental product declaration data from manufacturers based in Minnesota;\n(6) whether to use an industry average or a different method to set the maximum allowable global warming potential, or whether that average could be used for some materials but not others; and\n(7) any other items the task force deems necessary in order to implement this section.\n(d) Members of the task force must include but are not limited to representatives of:\n(1) the Departments of Administration and Transportation;\n(2) the Center for Sustainable Building Research at the University of Minnesota;\n(3) the Aggregate and Ready Mix Association of Minnesota;\n(4) the Concrete Paving Association of Minnesota;\n(5) the Minnesota Asphalt Pavement Association;\n(6) the Minnesota Board of Engineering;\n(7) the Minnesota iron mining industry;\n(8) building and transportation construction firms;\n(9) the American Institute of Steel Construction;\n(10) the Institute of Scrap Metal Recycling Industries;\n(11) suppliers of eligible materials;\n(12) organized labor in the construction trades;\n(13) organized labor in the manufacturing or industrial sectors;\n(14) environmental advocacy organizations; and\n(15) environmental justice organizations.\n(e) The Department of Administration must provide meeting space and serve as staff to the task force.\n(f) The commissioner of administration or the commissioner's designee shall serve as chair of the task force. The task force must meet at least four times annually and may convene additional meetings at the call of the chair.\n(g) The commissioner of administration shall summarize the findings and recommendations of the task force in a report submitted to the chairs and ranking minority members of the senate and house of representatives committees with primary jurisdiction over state government, transportation, and energy no later than December 1, 2025, and annually thereafter for as long as the task force continues its operations.\n(h) The task force is subject to section 15.059, subdivision 6.\n(i) Meetings of the task force are subject to chapter 13D.\n(j) The task force expires on January 1, 2029.\nA grant program is established in the Department of Administration to award grants to assist manufacturers to obtain environmental product declarations or otherwise collect environmental product declaration data from manufacturers in Minnesota. The commissioner of administration shall develop procedures to process and evaluate grant applications, and to make grant awards. Grant applicants must submit an application to the commissioner on a form prescribed by the commissioner. The commissioner shall act as fiscal agent for the grant program and is responsible for receiving and reviewing grant applications and awarding grants under this subdivision.",
	"repealed": false
}