{
	"id": "203B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.04",
	"title": "203B.04 APPLICATION FOR BALLOTS.",
	"text": "(a) Except as otherwise allowed by subdivision 2 or by section 203B.11, subdivision 4, an application for absentee ballots for any election may be submitted at any time not less than one day before the day of that election. The county auditor shall prepare absentee ballot application forms in the format provided by the secretary of state and shall furnish them to any person on request. By January 1 of each even-numbered year, the secretary of state shall make the forms to be used available to auditors through electronic means. An application submitted pursuant to this subdivision shall be in writing. An application may be submitted in person, by electronic facsimile device, by electronic mail, or by mail to:\n(1) the county auditor of the county where the applicant maintains residence; or\n(2) the municipal clerk of the municipality, or school district if applicable, where the applicant maintains residence.\n(b) An absentee ballot application may alternatively be submitted electronically through a secure website that shall be maintained by the secretary of state for this purpose. Notwithstanding paragraph (d), the secretary of state must require applicants using the website to submit the applicant's email address and verifiable Minnesota driver's license number, Minnesota state identification card number, or the last four digits of the applicant's Social Security number. This paragraph does not apply to a town election held in March.\n(c) An application submitted electronically under this paragraph may only be transmitted to the county auditor for processing if the secretary of state has verified the application information matches the information in a government database associated with the applicant's driver's license number, state identification card number, or Social Security number. The secretary of state must review all unverifiable applications for evidence of suspicious activity and must forward any such application to an appropriate law enforcement agency for investigation.\n(d) An application shall be approved if it is timely received, signed and dated by the applicant, contains the applicant's name and residence and mailing addresses, date of birth, and at least one of the following:\n(1) the applicant's Minnesota driver's license number;\n(2) Minnesota state identification card number;\n(3) the last four digits of the applicant's Social Security number; or\n(4) a statement that the applicant does not have any of these numbers.\n(e) To be approved, the application must contain an oath that the information contained on the form is accurate, that the applicant is applying on the applicant's own behalf, and that the applicant is signing the form under penalty of perjury.\n(f) An applicant's full date of birth, Minnesota driver's license or state identification number, and the last four digits of the applicant's Social Security number must not be made available for public inspection. An application may be submitted to the county auditor or municipal clerk by an electronic facsimile device. An application mailed or returned in person to the county auditor or municipal clerk on behalf of a voter by a person other than the voter must be deposited in the mail or returned in person to the county auditor or municipal clerk within ten days after it has been dated by the voter and no later than six days before the election.\n(g) An application under this subdivision may contain an application under subdivision 5 to automatically receive an absentee ballot.\n[See Note.]\nAn eligible voter who on the day before an election becomes a resident or patient in a health care facility or hospital located in the municipality in which the eligible voter maintains residence may apply for absentee ballots on election day if the voter:\n(1) requests an application form by telephone from the municipal clerk not later than 5:00 p.m. on the day before election day; or\n(2) submits an absentee ballot application to the election judges engaged in delivering absentee ballots pursuant to section 203B.11.\nThe election judges designated to deliver absentee ballots pursuant to section 203B.11 shall deliver a blank application form for absentee ballots to any individual who requests one in order to apply for absentee ballots pursuant to subdivision 2.\nAn eligible voter who is not registered to vote but who is otherwise eligible to vote by absentee ballot may register by including a completed voter registration application with the absentee ballot. The individual shall present proof of residence as required by section 201.061, subdivision 3, to the individual who witnesses the marking of the absentee ballots. A military voter, as defined in section 203B.01, may register in this manner if voting pursuant to sections 203B.04 to 203B.15, or may register pursuant to sections 203B.16 to 203B.27.\n(a) An eligible voter may apply to a county auditor or municipal clerk to automatically receive an absentee ballot before each election, other than an election by mail conducted under section 204B.45, and to have the status as a permanent absentee voter indicated on the voter's registration record. An eligible voter listed as an ongoing absentee voter as of July 31, 2013, pursuant to laws in effect on that date, shall be treated as if the voter applied for status as a permanent absentee voter pursuant to this subdivision.\n(b) A voter who applies under paragraph (a) must automatically be provided an absentee ballot for each eligible election. A voter's permanent absentee status ends and automatic ballot delivery must be terminated on:\n(1) the voter's written request;\n(2) the voter's death;\n(3) return of an absentee ballot as undeliverable; or\n(4) a change in the voter's status to \"challenged\" or \"inactive\" in the statewide voter registration system.\n(c) The secretary of state shall adopt rules governing procedures under this subdivision.\n(d) This subdivision does not apply to a voter residing in a jurisdiction that conducts elections entirely by mail under section 204B.45.\n[Repealed, 2013 c 131 art 1 s 9]\n(a) The secretary of state shall maintain a log of each Internet Protocol address used to submit an absentee ballot application electronically under this section, and must monitor the log, volume of website use, and other appropriate indicators for suspicious activity. Evidence of suspicious activity that cannot be resolved by the secretary of state must be forwarded to an appropriate law enforcement agency for investigation.\n(b) The electronic absentee ballot application system must be secure. The website shall maintain the confidentiality of all users and preserve the integrity of the data submitted. The secretary of state shall employ security measures to ensure the accuracy and integrity of absentee ballot applications submitted electronically pursuant to this section. All data sent and received through the website must be encrypted.\n(c) The secretary of state must provide ongoing testing and monitoring to ensure continued security. The secretary of state must work with the chief information officer as defined in section 16E.01, subdivision 1, or another security expert to annually assess the security of the system. The security assessment must include a certification signed by the secretary of state that states that adequate security measures are in place. The certification must also be signed by the chief information officer or another security expert affirming that the assessment is accurate. The secretary of state must submit the security assessment to the legislative auditor and to the chairs and ranking minority members of the committees in the senate and house of representatives with primary jurisdiction over elections by January 1 of each year, except that the first annual security assessment must be submitted by September 30, 2014, and no report is required for January 1, 2015.\n(d) In developing the electronic absentee ballot application system, the secretary of state must consult with the chief information officer or the chief's designee to ensure the site is secure.",
	"repealed": false
}