{
	"id": "181.9448",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.9448",
	"title": "181.9448 EFFECT ON OTHER LAW OR POLICY.",
	"text": "(a) Nothing in sections 181.9445 to 181.9448 shall be construed to discourage employers from adopting or retaining earned sick and safe time policies that meet or exceed, and do not otherwise conflict with, the minimum standards and requirements provided in sections 181.9445 to 181.9448. All paid time off and other paid leave made available to an employee by an employer in excess of the minimum amount required in section 181.9446 for absences from work due to personal illness or injury, but not including short-term or long-term disability or other salary continuation benefits, must meet or exceed the minimum standards and requirements provided in sections 181.9445 to 181.9448, except for section 181.9446. For paid leave accrued prior to January 1, 2024, for absences from work due to personal illness or injury, an employer may require an employee who uses such leave to follow the written notice and documentation requirements in the employer's applicable policy or applicable collective bargaining agreement as of December 31, 2023, in lieu of the requirements of section 181.9447, subdivisions 2 and 3, provided that an employer does not require an employee to use leave accrued on or after January 1, 2024, before using leave accrued prior to that date.\n(b) Nothing in sections 181.9445 to 181.9448 shall be construed to limit the right of parties to a collective bargaining agreement to bargain and agree with respect to earned sick and safe time policies or to diminish the obligation of an employer to comply with any contract, collective bargaining agreement, or any employment benefit program or plan that meets or exceeds, and does not otherwise conflict with, the minimum standards and requirements provided in this section.\n(c) Nothing in sections 181.9445 to 181.9448 shall be construed to preempt, limit, or otherwise affect the applicability of any other law, regulation, requirement, policy, or standard that provides for a greater amount, accrual, or use by employees of paid sick and safe time or that extends other protections to employees.\n(d) Nothing in sections 181.9445 to 181.9448 shall be construed or applied so as to create any power or duty in conflict with federal law.\n(e) Employers who provide earned sick and safe time to their employees under a paid time off policy or other paid leave policy that may be used for the same purposes and under the same conditions as earned sick and safe time, and that meets or exceeds, and does not otherwise conflict with, the minimum standards and requirements provided in sections 181.9445 to 181.9448 are not required to provide additional earned sick and safe time.\n(f) The provisions of sections 181.9445 to 181.9448 may be waived by a collective bargaining agreement with a bona fide building and construction trades labor organization that has established itself as the collective bargaining representative for the affected building and construction industry employees, provided that for such waiver to be valid, it shall explicitly reference sections 181.9445 to 181.9448 and clearly and unambiguously waive application of those sections to such employees.\n(g) The requirements of section 181.9447, subdivision 3, may be waived for paid leave made available to an employee by an employer for absences from work in excess of the minimum amount required in section 181.9446 through a collective bargaining agreement with a labor organization that has established itself as the collective bargaining representative for the employees, provided that for such waiver to be valid, it shall explicitly reference section 181.9447, subdivision 3, and clearly and unambiguously waive application of that subdivision to such employees.\n(h) An individual provider, as defined in section 256B.0711, subdivision 1, paragraph (d), who provides services through a consumer support grant under section 256.476, consumer-directed community supports under section 256B.4911, or community first services and supports under section 256B.85, to a family member who is a participant, as defined in section 256B.0711, subdivision 1, paragraph (e), may individually waive the provisions of sections 181.9445 to 181.9448 for the remainder of the participant's service plan year, provided that the funds are returned to the participant's budget. Once an individual provider has waived the provisions of sections 181.9445 to 181.9448, they may not accrue earned sick and safe time until the start of the participant's next service plan year.\n(i) Sections 181.9445 to 181.9448 do not prohibit an employer from establishing a policy whereby employees may donate unused accrued sick and safe time to another employee.\n(j) Sections 181.9445 to 181.9448 do not prohibit an employer from advancing sick and safe time to an employee before accrual by the employee.\nSections 181.9445 to 181.9448 do not require financial or other reimbursement to an employee from an employer upon the employee's termination, resignation, retirement, or other separation from employment for accrued earned sick and safe time that has not been used. If an employee is transferred to a separate division, entity, or location, but remains employed by the same employer, the employee is entitled to all earned sick and safe time accrued at the prior division, entity, or location and is entitled to use all earned sick and safe time as provided in sections 181.9445 to 181.9448. When there is a separation from employment and the employee is rehired within 180 days of separation by the same employer, previously accrued earned sick and safe time that had not been used or otherwise disbursed to the benefit of the employee upon separation must be reinstated. An employee is entitled to use accrued earned sick and safe time and accrue additional earned sick and safe time at the commencement of reemployment.\n(a) When a different employer succeeds or takes the place of an existing employer, all employees of the original employer who remain employed by the successor employer are entitled to all earned sick and safe time accrued but not used when employed by the original employer, and are entitled to use all earned sick and safe time previously accrued but not used.\n(b) If employees are terminated by the original employer and hired within 30 days by the successor employer following the employer succession, those employees are entitled to all earned sick and safe time accrued but not used when employed by the original employer, and are entitled to use all earned sick and safe time previously accrued but not used.",
	"repealed": false
}