{
	"id": "16C.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.285",
	"title": "16C.285 RESPONSIBLE CONTRACTOR REQUIREMENT DEFINED.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Construction contract\" means a contract or subcontract of any tier for work on a project.\n(c) \"Contractor\" means a prime contractor or subcontractor or motor carrier, and does not include a design professional or a material supplier. A \"design professional\" is a business or natural person retained to perform services on the project for which licensure is required by section 326.02. A \"material supplier\" is a business or natural person that supplies materials, equipment, or supplies to a subcontractor or contractor on a project, including performing delivery or unloading services in connection with the supply of materials, equipment, or supplies; provided, however, that a material supplier does not include a natural person or business that delivers mineral aggregate such as sand, gravel, or stone that is incorporated into the work under the contract by depositing the material substantially in place, directly or through spreaders, from the transporting vehicle.\n(d) \"Contracting authority\" means a state agency, the Minnesota State Colleges and Universities, the University of Minnesota, the Metropolitan Council, the Metropolitan Airports Commission, or a municipality that enters into a construction contract or authorizes or directs entering into a construction contract.\n(e) \"Motor carrier\" means a business or natural person providing for-hire transportation of materials, equipment, or supplies for a project.\n(f) \"Municipality\" means a county, town, home rule charter or statutory city, school district, housing and redevelopment authority, port authority, economic development authority, sports facilities authority, joint powers board or organization created under section 471.59 or other statute, special district, instrumentality, drainage authority, watershed district, destination medical center corporation, or other municipal corporation or political subdivision of the state authorized by law to enter into contracts.\n(g) \"Prime contractor\" means a vendor that submits a bid or proposal or otherwise responds to a solicitation document of a contracting authority for work on a project or is awarded a construction contract by a contracting authority for work on a project. A prime contractor includes a construction manager for purposes of this section.\n(h) \"Principal\" means an owner holding at least a 25 percent ownership interest in a business.\n(i) \"Project\" means building, erection, construction, alteration, remodeling, demolition, or repair of buildings, real property, highways, roads, bridges, or other construction work performed pursuant to a construction contract.\n(j) \"Related entity\" means:\n(1) a firm, partnership, corporation, joint venture, or other legal entity substantially under the control of a contractor or vendor;\n(2) a predecessor corporation or other legal entity having one or more of the same principals as the contractor or vendor;\n(3) a subsidiary of a contractor or vendor;\n(4) one or more principals of a contractor or vendor; and\n(5) a person, firm, partnership, corporation, joint venture, or other legal entity that substantially controls a contractor or vendor.\n(k) \"Solicitation document\" means an invitation to bid, bid specifications, request for proposals, request for qualifications, or other solicitation of contractors for purposes of a construction contract.\n(l) \"Subcontractor\" means a vendor that seeks to enter into a subcontract or enters into a subcontract for work on a project.\n(m) \"Vendor\" means a business, including a construction contractor or a natural person, and includes both if the natural person is engaged in a business.\n(a) A contractor must meet the minimum criteria in subdivision 3 to be eligible to be awarded a construction contract as the lowest responsible bidder or the vendor or contractor offering the best value as provided in section 16C.28, 103D.811, 103E.505, 116A.13, 123B.52, 160.17, 160.262, 161.32, 161.3206, 161.3209, 161.38, 162.17, 365.37, 374.13, 375.21, 383C.094, 412.311, 429.041, 458D.21, 469.015, 469.068, 469.101, 471.345, 473.4057, 473.523, 473.652, 473.756, 473J.11, or any of their successor provisions.\n(b) This section applies to publicly owned or financed projects where the contracting authority's construction contract with the prime contractor is estimated to exceed $50,000 and is awarded pursuant to a lowest responsible bidder selection method or a best value selection method as provided in paragraph (a). The amount of any tax increment financing must be excluded in determining whether a construction contract exceeds $50,000. A subcontractor or motor carrier must meet the minimum criteria in subdivision 3 to be eligible to be awarded a subcontract on a project regardless of the value of the subcontract.\n(c) If only one prime contractor responds to a solicitation document, a contracting authority may award a construction contract to the responding prime contractor even if the minimum criteria in subdivision 3 are not met.\n\"Responsible contractor\" means a contractor that conforms to the responsibility requirements in the solicitation document for its portion of the work on the project and verifies that it meets the following minimum criteria:\n(1) the contractor:\n(i) is in compliance with workers' compensation and unemployment insurance requirements;\n(ii) is in compliance with Department of Revenue and Department of Employment and Economic Development registration requirements if it has employees;\n(iii) has a valid federal tax identification number or a valid Social Security number if an individual; and\n(iv) has filed a certificate of authority to transact business in Minnesota with the secretary of state if a foreign corporation or cooperative;\n(2) the contractor or related entity is in compliance with and, during the three-year period before submitting the verification, has not violated section 177.24, 177.25, 177.41 to 177.44, 181.03, 181.101, 181.13, 181.14, or 181.722, and has not violated United States Code, title 29, sections 201 to 219, or United States Code, title 40, sections 3141 to 3148. For purposes of this clause, a violation occurs when a contractor or related entity:\n(i) repeatedly fails to pay statutorily required wages or penalties on one or more separate projects for a total underpayment of $25,000 or more within the three-year period, provided that a failure to pay is \"repeated\" only if it involves two or more separate and distinct occurrences of underpayment during the three-year period;\n(ii) has been issued an order to comply by the commissioner of labor and industry that has become final;\n(iii) has been issued at least two determination letters within the three-year period by the Department of Transportation finding an underpayment by the contractor or related entity to its own employees;\n(iv) has been found by the commissioner of labor and industry to have repeatedly or willfully violated any of the sections referenced in this clause pursuant to section 177.27;\n(v) has been issued a ruling or findings of underpayment by the administrator of the Wage and Hour Division of the United States Department of Labor that have become final or have been upheld by an administrative law judge or the Administrative Review Board;\n(vi) has been found liable for underpayment of wages or penalties or misrepresenting a construction worker as an independent contractor in an action brought in a court having jurisdiction; or\n(vii) has been convicted of a violation of section 609.52, subdivision 2, clause (19).\nProvided that, if the contractor or related entity contests a determination of underpayment by the Department of Transportation in a contested case proceeding, a violation does not occur until the contested case proceeding has concluded with a determination that the contractor or related entity underpaid wages or penalties;\n(3) the contractor or related entity is in compliance with and, during the three-year period before submitting the verification, has not violated section 181.723 or chapter 326B. For purposes of this clause, a violation occurs when a contractor or related entity has been issued a final administrative or licensing order;\n(4) the contractor or related entity has not, more than twice during the three-year period before submitting the verification, had a certificate of compliance under section 363A.36 revoked or suspended based on the provisions of section 363A.36, with the revocation or suspension becoming final because it was upheld by the Office of Administrative Hearings or was not appealed to the office;\n(5) the contractor or related entity has not received a final determination assessing a monetary sanction from the Department of Administration or Transportation for failure to meet targeted group business, disadvantaged business enterprise, or veteran-owned business goals, due to a lack of good faith effort, more than once during the three-year period before submitting the verification;\n(6) the contractor or related entity is not currently suspended or debarred by the federal government or the state of Minnesota or any of its departments, commissions, agencies, or political subdivisions that have authority to debar a contractor; and\n(7) all subcontractors and motor carriers that the contractor intends to use to perform project work have verified to the contractor through a signed statement under oath by an owner or officer that they meet the minimum criteria listed in clauses (1) to (6).\nAny violations, suspensions, revocations, or sanctions, as defined in clauses (2) to (5), occurring prior to July 1, 2014, shall not be considered in determining whether a contractor or related entity meets the minimum criteria.\nA contractor responding to a solicitation document of a contracting authority shall submit to the contracting authority a signed statement under oath by an owner or officer verifying compliance with each of the minimum criteria in subdivision 3, with the exception of clause (7), at the time that it responds to the solicitation document. A contracting authority may accept a signed statement under oath as sufficient to demonstrate that a contractor is a responsible contractor and shall not be held liable for awarding a contract in reasonable reliance on that statement. A prime contractor, subcontractor, or motor carrier that fails to verify compliance with any one of the required minimum criteria or makes a false statement under oath in a verification of compliance shall be ineligible to be awarded a construction contract on the project for which the verification was submitted. A false statement under oath verifying compliance with any of the minimum criteria may result in termination of a construction contract that has already been awarded to a prime contractor or subcontractor or motor carrier that submits a false statement. A contracting authority shall not be liable for declining to award a contract or terminating a contract based on a reasonable determination that the contractor failed to verify compliance with the minimum criteria or falsely stated that it meets the minimum criteria. A verification of compliance need not be notarized. An electronic verification of compliance made and submitted as part of an electronic bid shall be an acceptable verification of compliance under this section, provided that it contains an electronic signature as defined in section 325L.02, paragraph (h).\nA prime contractor or subcontractor shall include in its verification of compliance under subdivision 4 a list of all of its first-tier subcontractors that it intends to retain for work on the project. Prior to execution of a construction contract, and as a condition precedent to the execution of a construction contract, the apparent successful prime contractor shall submit to the contracting authority a supplemental verification under oath confirming compliance with subdivision 3, clause (7). Each contractor or subcontractor shall obtain from all subcontractors with which it will have a direct contractual relationship a signed statement under oath by an owner or officer verifying that they meet all of the minimum criteria in subdivision 3 prior to execution of a construction contract with each subcontractor. If a prime contractor or any subcontractor retains additional subcontractors on the project after submitting its verification of compliance, the prime contractor or subcontractor shall obtain verifications of compliance from each additional subcontractor with which it has a direct contractual relationship and shall submit a supplemental verification confirming compliance with subdivision 3, clause (7), within 14 days of retaining the additional subcontractors. A prime contractor shall submit to the contracting authority upon request copies of the signed verifications of compliance from all subcontractors of any tier pursuant to subdivision 3, clause (7). A prime contractor and subcontractors shall not be responsible for the false statements of any subcontractor with which they do not have a direct contractual relationship. A prime contractor and subcontractors shall be responsible for false statements by their first-tier subcontractors with which they have a direct contractual relationship only if they accept the verification of compliance with actual knowledge that it contains a false statement.\nA prime contractor or subcontractor shall obtain annually from all motor carriers with which it will have a direct contractual relationship a signed statement under oath by an owner or officer verifying that they meet all of the minimum criteria in subdivision 3 prior to execution of a construction contract with each motor carrier. A prime contractor or subcontractor shall require each such motor carrier to provide it with immediate written notification in the event that the motor carrier no longer meets one or more of the minimum criteria in subdivision 3 after submitting its annual verification. A motor carrier shall be ineligible to perform work on a project covered by this section if it does not meet all the minimum criteria in subdivision 3. Upon request, a prime contractor or subcontractor shall submit to the contracting authority the signed verifications of compliance from all motor carriers providing for-hire transportation of materials, equipment, or supplies for a project.\nNothing in this section shall restrict the discretion of a contracting authority to establish additional factors for defining contractor responsibility. This subdivision is not an independent grant of authority to a contracting authority to establish additional minimum criteria pursuant to subdivision 3.\nThe definition of responsible contractor, as defined in subdivision 3, or a statement that the term responsible contractor as used in the solicitation document means a contractor as defined in subdivision 3, shall be included in the solicitation document for all projects covered by this section. The solicitation document for any project shall state that any prime contractor or subcontractor or motor carrier that does not meet the minimum criteria in subdivision 3 or fails to verify that it meets those criteria is not a responsible contractor and is not eligible to be awarded a construction contract for the project or to perform work on the project. The solicitation document shall provide that a false statement under oath verifying compliance with any of the minimum criteria shall render the prime contractor or subcontractor or motor carrier that makes the false statement ineligible to be awarded a construction contract on the project and may result in termination of a contract awarded to a prime contractor or subcontractor or motor carrier that submits a false statement. The solicitation document shall state that a prime contractor shall submit to the contracting authority upon request copies of the signed verifications of compliance from all subcontractors of any tier and motor carriers, pursuant to subdivision 3, clause (7).\nThis section is effective January 1, 2015, and shall apply to all construction contracts entered into based on solicitation documents issued on or after that date.",
	"repealed": false
}