{
	"id": "3.8853",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.8853",
	"title": "3.8853 LEGISLATIVE BUDGET OFFICE.",
	"text": "The Legislative Budget Office is established to provide the house of representatives and senate with nonpartisan, accurate, and timely information on the fiscal impact of proposed legislation, without regard to political factors.\n(a) The Legislative Budget Office Oversight Commission must appoint a director and establish the director's duties. The director may hire staff necessary to do the work of the office. The director serves in the unclassified service for a term of six years and may not be removed during a term except for cause after a public hearing.\n(b) The director and staff hired under this section must provide professional and technical assistance to the Tax Expenditure Review Commission under section 3.8855.\nThe director of the Legislative Budget Office must adopt uniform standards and procedures governing the timely preparation of fiscal notes as required by this section and section 3.98. The standards and procedures are not effective until they are approved by the Legislative Budget Office Oversight Commission. Upon approval, the standards and procedures must be published in the State Register and on the office's website.\nUpon request of the director of the Legislative Budget Office, the head or chief administrative officer of each department or agency of state government, including the supreme court, must promptly supply data that are used to prepare a fiscal note, including data that are not public data under section 13.64 or other applicable law, unless there are federal laws or regulations that prohibit the provision of the not public data for this purpose. Not public data supplied under this subdivision may only be used by the Legislative Budget Office to review a department or agency's work in preparing a fiscal note and may not be used or disseminated for any other purpose, including use by or dissemination to a legislator or to any officer, department, agency, or committee within the legislative branch. Violation of this subdivision by the director or other staff of the Legislative Budget Office is cause for removal, suspension without pay, or immediate dismissal at the direction of the oversight commission.\nThe director of the Legislative Budget Office must deliver a completed fiscal note to the legislative committee chair who made the request, and to the chief author of the legislation to which it relates. Within 24 hours of completion of a fiscal note, the director of the Legislative Budget Office must post a completed fiscal note on the office's public website. This subdivision does not apply to an unofficial fiscal note that is not public data under section 13.64, subdivision 3.",
	"repealed": false
}