{
	"id": "219.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.57",
	"title": "219.57 PREVENTION OF FIRE.",
	"text": "A company operating a railroad shall use upon each locomotive engine a good and efficient spark arrester, which the master mechanic shall have examined each time before leaving the roundhouse. The master mechanic and the employee making the examination are responsible for the good condition of the spark arrester. However, the company is not relieved from its responsibility under this section.\nA company shall keep its right-of-way clear of combustible materials, except ties and other materials necessary for the maintenance and operation of the road, from April 15 to December 1, annually.\nNo company shall permit its employees to leave a deposit of fire, live coals, or ashes in the immediate vicinity of woodland or land liable to be overrun by fire. An engineer, conductor, or train crew member discovering fire adjacent to the track shall report it promptly at the first telegraph or telephone station reached.\nIn dry seasons a railroad company shall instruct its employees in the prevention and extinguishment of fires and have warning placards furnished by the director of the Division of Lands and Forestry of the Department of Natural Resources conspicuously posted at every station in the vicinity of forest and grass lands. When a fire occurs near the line of its road, the railroad company shall concentrate help and adopt measures available for its extinguishment.\nIn dry seasons the railroad company shall employ at least one patroller for each mile of its road through lands liable to be overrun by fire to discover and extinguish fires occurring near the line of the road, by which is meant a distance within which fire could usually be set by sparks from a passing locomotive.\nA railroad company violating this section is guilty of a misdemeanor and may be assessed costs of prosecution for each offense.\nA railroad employee violating this section is guilty of a misdemeanor and may be assessed costs of prosecution.",
	"repealed": false
}