{
	"id": "515A.1-103",
	"url": "https://www.revisor.mn.gov/statutes/cite/515A.1-103",
	"title": "515A.1-103 DEFINITIONS.",
	"text": "In the declaration and bylaws, unless specifically provided otherwise or the context otherwise requires, and in sections 515A.1-101 to 515A.4-117:\n(1) \"Additional real estate\" means real estate that may be added to a flexible condominium.\n(2) \"Affiliate of a declarant\" means any person who controls, is controlled by, or is under common control with a declarant. A person \"controls\" a declarant if the person (i) is a general partner, officer, director, or employer of the declarant or (ii) directly or indirectly or acting in concert with one or more other persons, or through one or more subsidiaries, owns, controls, holds with power to vote, or holds proxies representing, more than 20 percent of the voting interest in the declarant, or (iii) controls in any manner the election of a majority of the directors of the declarant, or (iv) has contributed more than 20 percent of the capital of the declarant. A person \"is controlled by\" a declarant if the declarant (i) is a general partner, officer, director, or employer of the person or (ii) directly or indirectly or acting in concert with one or more other persons, or through one or more subsidiaries, owns, controls, holds with power to vote, or holds proxies representing, more than 20 percent of the voting interest in the person, or (iii) controls in any manner the election of a majority of the directors of the person, or (iv) has contributed more than 20 percent of the capital of the person. Control does not exist if the powers described in this paragraph are held solely as security for an obligation and are not exercised.\n(3) \"Association\" or \"unit owners' association\" means the unit owners' association organized under section 515A.3-101.\n(4) \"Common element\" means all portions of a condominium other than the units.\n(5) \"Common expenses\" means expenditures made or liabilities incurred by or on behalf of the association, together with any allocations to reserves.\n(6) \"Common expense liability\" means the liability for common expenses allocated to each unit pursuant to section 515A.2-108.\n(7) \"Condominium\" means real estate, portions of which are designated for separate ownership and the remainder of which is designated for common ownership solely by the owners of those portions. Real estate is not a condominium unless the undivided interests in the common elements are vested in the unit owners.\n(8) \"Conversion condominium\" means a condominium in which a building was at any time before the recording of the declaration wholly or partially occupied by persons other than purchasers and persons who occupied with the consent of the purchasers.\n(9) \"Declarant\" means:\n(a) if the condominium has been created, (1) any person who has executed a declaration or an amendment to a declaration to add additional real estate, other than persons holding interests in the real estate solely as security for an obligation, persons whose interests in the real estate will not be conveyed to unit owners, or, in the case of a leasehold condominium, a lessor who possesses no special declarant rights and who is not an affiliate of a declarant who possesses special declarant rights, or (2) any person who succeeds under section 515A.3-104 to any special declarant rights; or\n(b) any person who has offered prior to creation of a condominium to dispose of the person's interest in a unit to be created and not previously disposed of.\n(10) \"Dispose\" or \"disposition\" means a voluntary transfer of any legal or equitable interest in a unit, other than as security for an obligation.\n(11) \"Flexible condominium\" means a condominium to which additional real estate may be added.\n(12) \"Leasehold condominium\" means a condominium in which all of the real estate is subject to a lease, the expiration or termination of which will terminate the condominium.\n(13) \"Limited common element\" means a portion of the common elements allocated by the declaration or by operation of section 515A.2-102(2) or (4) for the exclusive use of one or more but fewer than all of the units.\n(14) \"Person\" means a natural person, corporation, partnership, trust, or other entity, or any combination thereof.\n(15) \"Purchaser\" means any person, other than a declarant, who prior to creation of the condominium enters into a purchase agreement with a declarant or who by means of a voluntary transfer after creation of the condominium holds a legal or equitable interest in a unit, other than (i) a leasehold interest (including renewal options) of less than three years, or (ii) as security for an obligation.\n(16) \"Real estate\" means any leasehold for three years or more or other estate or interest in, over, or under land, including structures, fixtures, and other improvements and interests which by custom, usage, or law pass with a conveyance of land though not described in the contract of sale or instrument of conveyance. \"Real estate\" includes parcels with or without upper or lower boundaries.\n(17) \"Security for an obligation\" means the vendor's interest in a contract for deed, mortgagee's interest in a mortgage, purchaser's interest under a sheriff's certificate of sale during the period of redemption, or the holder's interest in a lien.\n(18) \"Special declarant rights\" means rights reserved for the benefit of a declarant to complete improvements indicated on the condominium plat (section 515A.2-110); to add additional real estate to a flexible condominium (section 515A.2-111); to subdivide or convert a unit (section 515A.2-115); to maintain sales offices, management offices, signs advertising the condominium, and models (section 515A.2-117); to use easements through the common elements for the purpose of making improvements within the condominium or any additional real estate (section 515A.2-118); or to appoint or remove any board member during any period of declarant control (section 515A.3-103(a)).\n(19) \"Unit\" means a portion of the condominium, whether or not contained solely or partially within a building, designated for separate ownership, the boundaries of which are described pursuant to section 515A.2-110.\n(20) \"Unit owner\" means a declarant who owns a unit, a person to whom ownership of a unit has been conveyed or transferred, or in a leasehold condominium a lessee of a unit whose lease expires simultaneously with any lease the expiration or termination of which will remove the unit from the condominium, but does not include a holder of an interest as security for an obligation.",
	"repealed": false
}