{
	"id": "475.755",
	"url": "https://www.revisor.mn.gov/statutes/cite/475.755",
	"title": "475.755 EMERGENCY DEBT CERTIFICATES.",
	"text": "(a) If at any time during a fiscal year the receipts of a local government are reasonably expected to be reduced below the amount provided in the local government's budget when the final property tax levy to be collected during the fiscal year was certified and the receipts are insufficient to meet the expenses incurred or to be incurred during the fiscal year, the governing body of the local government may authorize and sell certificates of indebtedness to mature within two years or less from the end of the fiscal year in which the certificates are issued. The maximum principal amount of the certificates that it may issue in a fiscal year is limited to the expected reduction in receipts plus the cost of issuance. The certificates may be issued in the manner and on the terms the governing body determines by resolution.\n(b) The governing body of the local government shall levy taxes for the payment of principal and interest on the certificates in accordance with section 475.61.\n(c) The certificates are not to be included in the net debt of the issuing local government.\n(d) To the extent that a local government issues certificates under this section to fund an unallotment or other reduction in its state aid, the local government must not use the special levy authority for aid reductions under section 275.70, subdivision 5, clause (22), or a similar or successor provision, but must instead use the special levy authority for the repayment of indebtedness under section 275.70, subdivision 5, clause (2), in order to levy under section 475.61 to fund repayment of the certificates with a levy that is not subject to levy limits.\n(e) For purposes of this section, the following terms have the meanings given:\n(1) \"Local government\" means a statutory or home rule charter city, a town, or a county.\n(2) \"Receipts\" includes the following amounts scheduled to be received by the local government for the fiscal year from:\n(i) taxes;\n(ii) aid payments previously certified by the state to be paid to the local government;\n(iii) state reimbursement payments for property tax credits; and\n(iv) any other source.",
	"repealed": false
}