{
	"id": "321.1101",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.1101",
	"title": "321.1101 DEFINITIONS.",
	"text": "In this article:\n(1) \"Constituent limited partnership\" means a constituent organization that is a limited partnership.\n(2) \"Constituent organization\" means an organization that is party to a merger.\n(3) \"Converted organization\" means the organization into which a converting organization converts pursuant to sections 321.1102 through 321.1105.\n(4) \"Converting limited partnership\" means a converting organization that is a limited partnership.\n(5) \"Converting organization\" means an organization that converts into another organization pursuant to section 321.1102.\n(6) \"General partner\" means a general partner of a limited partnership.\n(7) \"Governing statute\" of an organization means the statute that governs the organization's internal affairs.\n(8) \"Organization\" means a general partnership, including a limited liability partnership; limited partnership, including a limited liability limited partnership; limited liability company; business trust; corporation; or any other person having a governing statute. The term includes domestic and foreign organizations whether or not organized for profit.\n(9) \"Organizational documents\" means:\n(A) for a domestic or foreign general partnership, its partnership agreement;\n(B) for a limited partnership or foreign limited partnership, its certificate of limited partnership and partnership agreement;\n(C) for a domestic or foreign limited liability company, its articles of organization and operating agreement, or comparable records as provided in its governing statute;\n(D) for a business trust, its agreement of trust and declaration of trust;\n(E) for a domestic or foreign corporation for profit, its articles of incorporation, bylaws, and other agreements among its shareholders which are authorized by its governing statute, or comparable records as provided in its governing statute; and\n(F) for any other organization, the basic records that create the organization and determine its internal governance and the relations among the persons that own it, have an interest in it, or are members of it.\n(10) \"Personal liability\" means personal liability for a debt, liability, or other obligation of an organization which is imposed on a person that co-owns, has an interest in, or is a member of the organization:\n(A) by the organization's governing statute solely by reason of the person co-owning, having an interest in, or being a member of the organization; or\n(B) by the organization's organizational documents under a provision of the organization's governing statute authorizing those documents to make one or more specified persons liable for all or specified debts, liabilities, and other obligations of the organization solely by reason of the person or persons co-owning, having an interest in, or being a member of the organization.\n(11) \"Surviving organization\" means an organization into which one or more other organizations are merged. A surviving organization may preexist the merger or be created by the merger.",
	"repealed": false
}