{
	"id": "611.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.59",
	"title": "611.59 COMPETENCY ATTAINMENT PROGRAMS.",
	"text": "The board must provide or contract for enough competency attainment services to meet the needs of adult defendants in each judicial district who are found incompetent to proceed and do not have access to competency attainment services as a part of any other programming in which they are ordered to participate. The board, in consultation with the Certification Advisory Committee, shall develop procedures to certify that the standards in this section are met, including procedures for regular recertification of competency attainment programs. The board shall maintain a list of programs it has certified on the board's website and shall update the list of competency attainment programs at least once every year.\nExcept for jail-based programs, a competency attainment provider must:\n(1) be able to provide the appropriate mental health or substance use disorder treatment ordered by the court, including but not limited to treatment in inpatient, residential, and home-based settings;\n(2) ensure that competency attainment education certified by the board is provided to defendants and that regular assessments of defendants' progress in attaining competency are documented;\n(3) designate a head of the program knowledgeable in the processes and requirements of the competency to stand trial procedures; and\n(4) develop staff procedures or designate a person responsible to ensure timely communication with the court system.\nJail-based competency attainment programs must be housed in correctional facilities licensed by the Department of Corrections under section 241.021 and must:\n(1) have a designated program director who meets minimum qualification standards set by the board, including understanding the requirements of competency to stand trial procedures;\n(2) provide minimum mental health services including:\n(i) having multidisciplinary staff sufficient to monitor defendants and provide timely assessments, treatment, and referrals as needed, including at least one medical professional licensed to prescribe psychiatric medication;\n(ii) prescribing, dispensing, and administering any medication deemed clinically appropriate by qualified medical professionals; and\n(iii) having policies and procedures for the administration of involuntary medication;\n(3) ensure that competency attainment education certified by the board is provided to defendants and regular assessments of defendants' progress in attaining competency to stand trial are documented;\n(4) develop staff procedures or designate a person responsible to ensure timely communication with the court system; and\n(5) designate a space in the correctional facility for the program.\n(a) The board shall collect the following data:\n(1) the total number of competency examinations ordered in each judicial district separated by county;\n(2) the age, race, and number of unique defendants and for whom at least one competency examination was ordered in each judicial district separated by county;\n(3) the age, race, and number of unique defendants found incompetent at least once in each judicial district separated by county; and\n(4) all available data on the level of charge and adjudication of cases with a defendant found incompetent and whether a forensic navigator was assigned to the case.\n(b) By February 15 of each year, the board must report to the legislative committees and divisions with jurisdiction over human services, public safety, and the judiciary on the data collected under this subdivision and may include recommendations for statutory or funding changes related to competency attainment.",
	"repealed": false
}