{
	"id": "368.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/368.47",
	"title": "368.47 TOWNS MAY BE DISSOLVED.",
	"text": "(1) When the voters residing within a town have failed to elect any town officials for more than ten years continuously;\n(2) when a town has failed for a period of ten years to exercise any of the powers and functions of a town;\n(3) when the estimated market value of a town drops to less than $165,000;\n(4) when the tax delinquency of a town, exclusive of taxes that are delinquent or unpaid because they are contested in proceedings for the enforcement of taxes, amounts to 12 percent of its market value; or\n(5) when the state or federal government has acquired title to 50 percent of the real estate of a town,\nwhich facts, or any of them, may be found and determined by the resolution of the county board of the county in which the town is located, according to the official records in the office of the county auditor, the county board by resolution may declare the town, naming it, dissolved and no longer entitled to exercise any of the powers or functions of a town.\nIn Cass, Itasca, and St. Louis Counties, before the dissolution is effective the voters of the town shall express their approval or disapproval. The town clerk shall, upon a petition signed by a majority of the registered voters of the town, filed with the clerk at least 60 days before a regular or special town election, give notice at the same time and in the same manner of the election that the question of dissolution of the town will be submitted for determination at the election. At the election the question shall be voted upon by a separate ballot. The form of the question under this chapter shall be substantially in the following form: \"Shall the town of ... be dissolved?\" The ballot shall be deposited in a separate ballot box and the result of the voting canvassed, certified, and returned in the same manner and at the same time as other facts and returns of the election. If a majority of the votes cast at the election are for dissolution, the town shall be dissolved. If a majority of the votes cast at the election are against dissolution, the town shall not be dissolved.\nWhen a town is dissolved under sections 368.47 to 368.49 the county shall acquire title to any telephone company or other business conducted by the town. The business shall be operated by the board of county commissioners until it can be sold. The subscribers or patrons of the business shall have the first opportunity of purchase. If the town has any outstanding indebtedness chargeable to the business, the county auditor shall levy a tax against the property situated in the dissolved town to pay the indebtedness as it becomes due.",
	"repealed": false
}