{
	"id": "342.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.24",
	"title": "342.24 CANNABIS BUSINESSES; GENERAL OPERATIONAL REQUIREMENTS AND PROHIBITIONS.",
	"text": "(a) A cannabis business may not employ an individual under 21 years of age and may not contract with an individual under 21 years of age if the individual's scope of work involves the handling of cannabis plants, cannabis flower, artificially derived cannabinoids, or cannabinoid products.\n(b) A cannabis business may not permit an individual under 21 years of age to enter the business premises other than entry by a person enrolled in the registry program.\n(c) A cannabis business may not sell or give cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products to an individual under 21 years of age unless the individual is enrolled in the registry program and the cannabis business holds a medical cannabis retail endorsement.\n(a) A cannabis business may not permit an individual who is not an employee to consume cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products within its licensed premises unless the business is licensed to permit on-site consumption.\n(b) Except as otherwise provided in this subdivision, a cannabis business may not permit an employee to consume cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products within its licensed premises or while the employee is otherwise engaged in activities within the course and scope of employment.\n(c) A cannabis business may permit an employee to use medical cannabis flower and medical cannabinoid products if that individual is a patient enrolled in the registry program.\n(d) For quality control, employees of a licensed cannabis business may sample cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products. Employees may not interact directly with customers for at least three hours after sampling a product. Employees may not consume more than three samples in a single 24-hour period. All samples must be recorded in the statewide monitoring system.\n(a) Except as otherwise provided in this subdivision, a cannabis business may not permit any individual to enter a restricted area unless the cannabis business records the individual's name, time of entry, time of exit, and authorization to enter the restricted area through the use of an electronic or manual entry log and the individual:\n(1) is a cannabis worker employed by or contracted with the cannabis business;\n(2) is an employee of the office or another enforcement agency;\n(3) is a contractor of the cannabis business, including but not limited to an electrician, a plumber, an engineer, or an alarm technician, whose scope of work will not involve the handling of cannabis flower, cannabis products, or hemp-derived consumer products and, if the individual is working in an area with immediate access to cannabis flower, cannabis products, or hemp-derived consumer products, the individual is supervised at all times by a cannabis worker employed by or contracted with the cannabis business; or\n(4) has explicit authorization from the office to enter a restricted area and, if the individual is in an area with immediate access to cannabis flower, cannabis products, or hemp-derived consumer products, the individual is supervised at all times by a cannabis worker employed by or contracted with the cannabis business.\n(b) A cannabis business shall ensure that all areas of entry to restricted areas within its licensed premises are conspicuously marked and cannot be entered without recording the individual's name, time of entry, time of exit, and authorization to enter the restricted area.\nA cannabis business must maintain a ventilation and filtration system sufficient to meet the requirements for odor control established by the office.\n(a) A cannabis business must use the statewide monitoring system for integrated cannabis tracking, inventory, and verification to track all cannabis plants, cannabis flower, cannabis products, and hemp-derived consumer products the cannabis business has in its possession to the point of disposal, transfer, or sale.\n(b) For the purposes of this subdivision, a cannabis business possesses the cannabis plants and cannabis flower that the business cultivates from seed or immature plant, if applicable, or receives from another cannabis business, and possesses the cannabis products and hemp-derived consumer products that the business manufactures or receives from another cannabis business.\n(c) Sale and transfer of cannabis plants, cannabis flower, cannabis products, and hemp-derived consumer products must be recorded in the statewide monitoring system within the time established by rule.\nA cannabis business must maintain and follow a security plan to deter and prevent the theft or diversion of cannabis plants, cannabis flower, cannabis products, or hemp-derived consumer products; unauthorized entry into the cannabis business; and the theft of currency.\nA cannabis business is prohibited from:\n(1) accepting or soliciting any form of remuneration from a health care practitioner who certifies qualifying medical conditions for patients; or\n(2) offering any form of remuneration to a health care practitioner who certifies qualifying medical conditions for patients.\nThe requirements under this section do not apply to hemp businesses.\nA cannabis business may not directly or indirectly make an agreement with a cannabis retailer that binds the cannabis retailer to purchase the products of one cannabis cultivator or cannabis manufacturer to the exclusion of the products of other cannabis cultivators or cannabis manufacturers. A cannabis retailer who is a party to a violation of this section or who receives the benefits of a violation is equally guilty of a violation.",
	"repealed": false
}