{
	"id": "518.156",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.156",
	"title": "518.156 COMMENCEMENT OF CUSTODY PROCEEDING.",
	"text": "In a court of this state which has jurisdiction to decide child custody matters, a child custody proceeding is commenced by one or both parents:\n(1) by filing a petition or a joint petition for dissolution or a petition or a joint petition for legal separation in the county where either spouse resides pursuant to section 518.09;\n(2) where paternity has been recognized under section 257.75, by filing a petition, or if the parties agree on all issues related to custody, parenting time, and child support, by filing a joint petition, agreement, and proposed order establishing custody, parenting time, and child support, in the county where the child is permanently a resident or where the child is found or where an earlier order for custody of the child has been entered; or\n(3) where a decree of dissolution or legal separation has been entered or paternity has been adjudicated under section 257.66, by filing a motion seeking custody or parenting time with the child in the county where the child is permanently resident or where the child is found or where an earlier order for custody of the child has been entered.\nWritten notice of a child custody or parenting time or visitation proceeding shall be given to the child's parent, guardian, and custodian, who may appear and be heard and may file a responsive pleading. The court may, upon a showing of good cause, permit the intervention of other interested parties.\nNo summons shall be required if a joint petition is filed and no summons is needed where a decree of dissolution or legal separation has been entered or paternity has been adjudicated under section 257.66.\n(a) In a proceeding where child support will be addressed, the petition, joint petition, or motion under subdivision 1 must be accompanied by a separate document that contains the Social Security number of each party and child. The Social Security number document must be maintained in a portion of the court file or records that are not accessible to the general public.\n(b) In a proceeding where child support will be addressed, the petition, joint petition, or motion under subdivision 1 must be accompanied by separate documentation providing evidence of income for each party in accordance with section 518A.28. The income information shall be maintained in a portion of the court file or records that are not accessible to the general public.\n(a) Where paternity has been recognized under section 257.75, no other alleged or presumed father exists, and the parties agree to all issues regarding custody, parenting time, and child support, the parties may proceed using a joint petition, agreement, and proposed order. A copy of the properly executed recognition of parentage form that was filed with the state registrar of vital records shall be attached to the joint petition. Chapter 518A applies to a proposed child support order in a joint petition. Parties filing a joint petition may incorporate a parenting plan subject to the requirements of section 518.1705.\n(b) The joint petition shall state and allege:\n(1) the name and address of each petitioner and any prior or other name used by each petitioner;\n(2) that a petitioner has or both of the petitioners have:\n(i) resided in this state for not less than 180 days immediately preceding the commencement of the proceeding;\n(ii) been a member of the armed services and stationed in this state for not less than 180 days immediately preceding the commencement of the proceeding; or\n(iii) been a domiciliary of this state for not less than 180 days immediately preceding the commencement of the proceeding;\n(3) the name at the time of the joint petition and any prior or other name, age, and date of birth of each living minor or dependent child of the parties for whom paternity has been recognized under section 257.75;\n(4) that the parties properly executed a recognition of parentage under section 257.75, which was properly filed with the state registrar of vital records, and no other alleged or presumed father exists;\n(5) whether or not a separate proceeding for custody, parenting time, or child support is pending in a court in this state or elsewhere or whether a separate order for custody, parenting time, or child support exists and, if section 518A.44 applies, the public authority is in agreement with the child support petition;\n(6) any temporary or permanent child support, child custody, parenting time, attorney fees, costs, and disbursements applied for without setting forth the amounts;\n(7) whether an order for protection under chapter 518B or a similar law of another state that governs the parties or a party and a minor child of the parties is in effect and, if so, the district court or similar jurisdiction in which it was entered;\n(8) the employer of each party and income from all sources for each party and whether either of the parties or child receives public assistance as defined in section 518A.81 or Supplemental Security Income;\n(9) whether the child has medical and dental health insurance coverage, the cost of the insurance, and which party pays for the insurance;\n(10) whether there are child care expenses for the child, the cost of the expenses, and which party pays the expenses;\n(11) whether either party pays child support for a nonjoint child in accordance with a court order and the amount of the support;\n(12) whether either party is legally responsible for a nonjoint child as provided in section 518A.33;\n(13) whether either party pays or receives spousal maintenance to or from another party, and the amount of the spousal maintenance; and\n(14) whether Social Security or veterans' benefit payments are received on behalf of the child, the amount of the benefit, and which parent receives the benefit on behalf of the child.\nThe joint petition shall be verified by each party, and the petition's allegations established by competent evidence.\n(c) The agreement must reflect an agreement on all issues of custody, parenting time, and child support, including the reasons for any deviation from the child support guidelines, and be signed by each petitioner and the public authority if section 518A.44 applies. The agreement must include a waiver to the statutory right to counsel on the issue of parentage if it applies and, if either of the parties is not represented by counsel, a waiver to the rights to genetic testing or a jury trial to determine parentage, if applicable. After issuance of the order, the issue of parentage may only be reopened by the parties in accordance with section 518.145, subdivision 2.\nIf the joint petition, agreement, and proposed order meet the requirements of this section, filing, review, and approval by the court is determined by the provisions of section 518.13, subdivision 5.",
	"repealed": false
}