{
	"id": "84.946",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.946",
	"title": "84.946 NATURAL RESOURCES ASSET PRESERVATION AND REPLACEMENT (NRAPR).",
	"text": "The legislature recognizes that the Department of Natural Resources owns and operates capital assets that in number, size, and programmatic use differ significantly from the capital assets owned and operated by other state departments and agencies. However, the legislature recognizes the need for standards to aid in categorizing and funding capital projects. The purpose of this section is to provide standards for those natural resource projects that are intended to preserve and replace existing facilities.\n(a) An appropriation for asset preservation may be used only for a capital expenditure on a capital asset previously owned by the state, within the meaning of generally accepted accounting principles as applied to public expenditures. The commissioner of natural resources will consult with the commissioner of management and budget to the extent necessary to ensure this and will furnish the commissioner of management and budget a list of projects to be financed from the account in order of their priority. The legislature assumes that many projects for preservation and replacement of portions of existing capital assets will constitute betterments and capital improvements within the meaning of the constitution and capital expenditures under generally accepted accounting principles, and will be financed more efficiently and economically under this section than by direct appropriations for specific projects.\n(b) An appropriation for asset preservation must not be used to acquire land or to acquire or construct buildings or other facilities.\n(c) Capital budget expenditures for natural resource asset preservation and replacement projects must be for one or more of the following types of capital projects that support the existing programmatic mission of the department: code compliance including health and safety, Americans with Disabilities Act requirements, hazardous material abatement, access improvement, or air quality improvement; building energy efficiency improvements using current best practices; building or infrastructure repairs necessary to preserve the interior and exterior of existing buildings; projects to remove life safety hazards such as building code violations or structural defects; or renovation of other existing improvements to land, including but not limited to trails and bridges.\n(d) Up to ten percent of an appropriation awarded under this section may be used for design costs for projects eligible to be funded from this account in anticipation of future funding from the account.\n[Repealed, 2012 c 272 s 98]\nThe commissioner of natural resources must establish priorities for natural resource asset preservation and replacement projects. By March 1 each year, the commissioner must submit to the commissioner of management and budget a list of the projects that have been paid for with money from a natural resource asset preservation and replacement appropriation during the preceding calendar year.",
	"repealed": false
}