{
	"id": "315.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/315.36",
	"title": "315.36 MEETINGS; NOTICE; ORGANIZATION; POWERS.",
	"text": "After each society has adopted the resolution, notice must be given stating the time and place of the meeting of the united congregation of the societies. The notice must be posted where each society statedly meets for worship at least 15 days before the meeting. The minister or another officer of the organization shall give public notice of the meeting at the usual Sabbath service at least one week before the meeting. The notice for the meeting must be signed by the clerk of the board of trustees, vestry, or chapter of each church, or by a person authorized by the board to sign it. At the meeting of the united congregation, held according to the notice, a name must be adopted for the new corporation. The meeting shall, by a majority vote, determine the form of organization of the new corporation and fix the qualifications for trustees or vestry members and the number, which must be at least three and not more than 12. A new board of trustees, vestry and wardens or chapter and wardens must be elected by a majority of the members present.\nThe board of trustees, vestry or chapter not including wardens must be divided into three classes. One class must be elected and hold office until the next annual meeting of the congregation, one class until its second annual meeting, and one class until its third annual meeting. After that, the terms of office of the trustees or vestry members must be three years and until their successors are elected and have qualified. If a vacancy occurs in the board of trustees, vestry, or chapter, at the next meeting of the congregation, board of trustees, chapter or vestry a successor must be elected to fill the unexpired term.\nAfter the meeting the chair and secretary shall make a certificate as prescribed by section 315.01, 315.17, or 315.20, as the case may be. The certificate, proof by affidavit of proper notice of the meeting, and the affidavits provided for in section 315.35 must be recorded with the county recorder of the county where the place of worship of the consolidated society is located. When it is filed, the societies become merged into a new corporation under the name specified in the certificate. The new corporation has the rights, powers, and privileges, and is liable for the obligations of the corporations consolidated. The property of the original corporation vests in the new corporation. If a will or other instrument takes effect after the consolidation and names any of the original corporations as a legatee, devisee, or beneficiary of a trust, the new corporation shall take under the instrument and is entitled to the money, property, and benefits that the original corporation would have received under the instrument, unless the instrument expressly provides otherwise.",
	"repealed": false
}