{
	"id": "147.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.092",
	"title": "147.092 PROBABLE CAUSE HEARING; SEXUAL MISCONDUCT.",
	"text": "(a) In any contested case in which a violation of section 147.091, subdivision 1, paragraph (t), is charged all parties shall be afforded an opportunity for a probable cause hearing before an administrative law judge. The motion for a hearing must be made to the Office of Administrative Hearings within 20 days of the filing date of the contested case and served upon the board upon filing. Any hearing shall be held within 30 days of the motion. The administrative law judge shall issue a decision within 20 days of completion of the probable cause hearing. If there is no request for a hearing, the portion of the notice of and order for hearing relating to allegations of sexual misconduct automatically becomes public.\n(b) The scope of the probable cause hearing is confined to a review of the facts upon which the complaint review committee of the board based its determination that there was a reasonable belief that section 147.091, subdivision 1, paragraph (t), was violated. The administrative law judge shall determine whether there is a sufficient showing of probable cause to believe the licensee committed the violations listed in the notice of and order for hearing, and shall receive evidence offered in support or opposition. Each party may cross-examine any witnesses produced by the other. A finding of probable cause shall be based upon the entire record including reliable hearsay in whole or in part and requires only a preponderance of the evidence. The burden of proof rests with the board.\n(c) Upon a showing of probable cause, that portion of the notice of and order for hearing filed by the board that pertains to the allegations of sexual misconduct, including the factual allegations that support the charge, become public data. In addition, the notice of and order for hearing may be amended. A finding of no probable cause by the administrative law judge is grounds for dismissal without prejudice. Nothing in this section shall prevent the board from reopening the investigation or filing charges based on the same subject matter at a later date.",
	"repealed": false
}