{
	"id": "383A.554",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.554",
	"title": "383A.554 POWERS AND DUTIES.",
	"text": "Before December 31, 1989, the Charter Commission shall deliver to the board of county commissioners either (1) its report determining that the present form of county government is adequate for the county and that a charter is not necessary or desirable, or (2) a draft of a proposed charter. The report must be signed by a majority of the members of the charter commission. The proposed charter may provide for any form of government consistent with the Constitution of the state of Minnesota. It may provide for the establishment and administration of all departments of a county government and for the regulation of all local county functions. It may abolish or consolidate any department or agency. The charter commission is required to hold at least one public hearing in each of the county commissioner districts.\nIt shall provide for present functions to be assumed by new elective or appointive officers as shall be provided for in the charter and may provide for other powers consistent with other law. It shall provide methods of procedure in respect to the operation of the government created and the duties of all officers. It shall provide for a home rule charter commission consistent with article XII, section 5, of the Constitution of the state of Minnesota and may provide for alternative methods for amending or abandoning the charter consistent with the constitution. The county may be authorized to acquire by gift, devise, purchase, or condemnation or sell or lease any property needed for the full discharge of its duties and powers. All special and general laws authorizing the county to incur indebtedness or issue bonds shall be subject to the charter, provided that the charter provisions are not in conflict with general laws relating to public indebtedness. The county shall continue to have all the powers granted by law.\nPersonnel matters relating to Ramsey County employees shall continue to be governed by sections 383A.281 to 383A.301 and sections 197.455 to 197.48. A charter proposed for adoption under sections 383A.551 to 383A.556 shall not apply to personnel matters.",
	"repealed": false
}