{
	"id": "136A.1251",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1251",
	"title": "136A.1251 STUDENT-PARENT SUPPORT INITIATIVE.",
	"text": "(a) To address the needs and support the educational goals of expectant and parenting college students across Minnesota, the commissioner shall award grants and provide support services to institutions and partnering entities that assist expectant parents and parents or legal guardians of young children. Grants shall be awarded to postsecondary institutions, professional organizations, community-based organizations, or other applicants deemed appropriate by the commissioner. Grants must be used to offer services to support the academic goals, health, and well-being of student parents. Services and costs eligible for grant funding include but are not limited to:\n(1) program development costs;\n(2) costs related to the start-up of on-campus child care;\n(3) evaluation and data collection; and\n(4) direct assistance to student parents including:\n(i) scholarships;\n(ii) basic needs support; and\n(iii) expenses related to child care.\n(b) Postsecondary institutions may act as the fiscal agents in partnership with a local nongovernmental agency, child care center, or other organization that serves student parents.\nThe commissioner shall develop a grant application process. The commissioner shall support projects in a manner that attempts to ensure eligible students throughout the state have access to program services.\nEach postsecondary institution shall allow students to identify whether the student is a parent, a legal guardian, acting as a parent, or an expectant parent on an annual basis on a form used to collect demographic data from students. The postsecondary institution shall provide the information to the commissioner annually on a date and in a manner prescribed by the commissioner.\nThe commissioner, in partnership with the Department of Health, shall provide health-related supports. Activities for health-related supports include:\n(1) ensuring programs, services, and materials are medically accurate, age appropriate, culturally and linguistically appropriate, and inclusive of all populations;\n(2) working with community health care providers and other service support organizations that serve the target population for this program; and\n(3) providing technical assistance and training for institutional parent support center staff on how to conduct screenings and referrals for the health concerns of student parents, including alcohol misuse, substance use disorders, depression, anxiety, intimate partner violence, tobacco and nicotine, and other health concerns.\nBy August 1 of each odd-numbered year, the commissioner shall submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education finance regarding the grant recipients and their activities. The report shall include information about the students served, the organizations providing services, program activities, program goals, and outcomes.",
	"repealed": false
}