{
	"id": "490.124",
	"url": "https://www.revisor.mn.gov/statutes/cite/490.124",
	"title": "490.124 MATURITY OF BENEFITS; RETIREMENT AND SURVIVORS' ANNUITIES.",
	"text": "(a) Except as qualified hereinafter from and after the mandatory retirement date, the normal retirement date, the early retirement date, or one year from the disability retirement date, as the case may be, a retiring judge is eligible to receive a retirement annuity from the judges' retirement fund.\n(b) For a tier I program judge, the retirement annuity is an amount equal to:\n(1) 2.7 percent multiplied by the judge's final average compensation with that result then multiplied by the number of years and fractions of years of allowable service rendered before July 1, 1980; plus\n(2) 3.2 percent multiplied by the judge's final average compensation with that result then multiplied by the number of years and fractions of years of allowable service rendered after June 30, 1980.\n(c) For a tier II program judge who was first appointed or elected as a judge before July 1, 2013, the retirement annuity is an amount equal to:\n(1) 3.2 percent multiplied by the judge's final average compensation with that result then multiplied by the number of years and fractions of years of allowable service rendered before January 1, 2014; plus\n(2) 2.5 percent multiplied by the judge's final average compensation with that result then multiplied by the number of years and fractions of years of allowable service rendered after December 31, 2013.\n(d) For a tier II program judge who was first appointed or elected as a judge after June 30, 2013, the retirement annuity is an amount equal to 2.5 percent multiplied by the judge's final average compensation with that result then multiplied by the number of years and fractions of years of allowable service.\n(e) For a judge in the tier I program, service that exceeds the service credit limit in section 490.121, subdivision 22, must be excluded in calculating the retirement annuity, but the compensation earned by the judge during this period of judicial service must be used in determining a judge's final average compensation and calculating the retirement annuity.\n(a) Unless section 356.30 applies, a judge is not eligible for an annuity at the normal retirement date or the early retirement date if the judge has less than five years of allowable service.\n(b) A judge who retires on or, as permitted under this chapter, after the judge's mandatory retirement date, is entitled to a proportionate annuity based upon the allowable service of the judge at the date of retirement.\nThe retirement annuity under subdivision 1 of any judge who elects to retire at an early retirement date must be reduced by one-half of one percent per month from the retirement date to the normal retirement date.\n(a) When the governor determines that a judge is disabled under section 490.121, subdivision 13, notice of the governor's determination must be sent to the judge, to the chief justice of the supreme court, to the state court administrator, and to the executive director of the Minnesota State Retirement System.\n(b) From and after disability retirement date, a disabled judge is entitled to continuation of the judge's full salary payable by the judge's employer, as if the judge's office were not vacated by retirement, for a period of up to one full year, but in no event beyond the judge's mandatory retirement date. During this year, the judge is entitled to earn additional service credit in the judges' retirement plan. The salary payable to a disabled judge is subject to retirement deductions and must be included in computing final average compensation of the judge.\n(c) At the conclusion of the year of continued salary following a disability or upon the judge's mandatory retirement date, whichever is earlier, the disabled judge is entitled to a disability retirement annuity computed as provided in subdivision 1. If the computed retirement annuity is a smaller amount, the judge is entitled to receive a minimum annuity of 25 percent of the judge's final average compensation.\n(a) A benefit to which a judge is entitled under this section may be deferred until the early or normal retirement date or later, notwithstanding the termination of the judge's service prior thereto.\n(b) The retirement annuity of, or the survivor benefit payable on behalf of, a former judge, who terminated service before July 1, 1997, which is not first payable until after June 30, 1997, must be increased on an actuarial equivalent basis to reflect the change in the investment return actuarial assumption under section 356.215, subdivision 8, from five percent to six percent under a calculation procedure and tables adopted by the board of directors of the Minnesota State Retirement System and approved by the actuary retained under section 356.214.\n[Repealed, 2006 c 271 art 11 s 49]\n[Repealed, 1977 c 432 s 49]\n(a) Except as provided in paragraph (b), a judge who retires after December 31, 1973, is entitled to a retirement pension, retirement compensation or other retirement payment under statutes applicable solely to judges under this section only.\n(b) A judge who was in office before January 1, 1974, who retires at or after normal retirement age may then elect to receive during the judge's lifetime a normal retirement annuity computed on the basis of retirement compensation provided for such judge under statutes in effect on December 31, 1973, in lieu of the amount of normal retirement annuity otherwise computed under this chapter.\n(a) Upon the death of a judge before retirement, or upon the death of a person who has qualified for an annuity under this section but who ceases to be a judge before retirement and who has not received a refund of contributions under subdivision 12, a surviving spouse is entitled to, or, if there be no surviving spouse, dependent children, are entitled to receive an annuity, payable monthly, equal in total to 60 percent of the normal retirement annuity which would have been payable to the judge or former judge had the date of death been the normal retirement date.\n(b) The annuity payable to a surviving spouse or to dependent children is an amount of not less than 25 percent of the judge's or the former judge's final average compensation.\n(c) The surviving spouse of a deceased judge may elect to receive, in lieu of the annuity under paragraphs (a) and (b), an annuity equal to the 100 percent joint and survivor annuity which the judge or former judge could have qualified for on the date of death.\nMS 2022 [Repealed, 2023 c 47 art 1 s 4]\n(a) No survivor or death benefits may be paid in connection with the death of a judge who retires after December 31, 1973, except as otherwise provided in this chapter.\n(b) Except as provided in subdivision 10, a judge may elect to receive, instead of the normal retirement annuity, an optional retirement annuity in the form of either (1) an annuity payable for a period certain and for life after that period, (2) a joint and survivor annuity without reinstatement if the designated beneficiary predeceases the retired judge, or (3) a joint and survivor annuity with reinstatement if the designated beneficiary predeceases the retired judge.\n(c) An optional retirement annuity must be actuarially equivalent to a single-life annuity with no term certain and must be established by the board of directors of the Minnesota State Retirement System. In establishing these optional retirement annuity forms, the board shall obtain the written recommendation of the actuary retained under section 356.214. The recommendations must be retained as a part of the permanent records of the board.\n(a) A person who ceases to be a judge is entitled to a refund in an amount that is equal to all of the member's employee contributions to the judges' retirement fund plus interest computed under section 352.22, subdivision 2.\n(b) A refund of contributions under paragraph (a) terminates all service credits and all rights and benefits of the judge and the judge's survivors under this chapter.\n(c) A person who becomes a judge again after taking a refund under paragraph (a) may reinstate the previously terminated allowable service credit, rights, and benefits by repaying the total amount of the previously received refund. The refund repayment must include interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, compounded annually, from the date on which the refund was received until the date on which the refund is repaid. Repayment must be made as provided in section 352.23, paragraph (d).\nIf a judge who has not received other benefits under this chapter dies and there are no survivor benefits payable under this chapter, a refund plus interest as provided in subdivision 12 is payable to the last designated beneficiary named on a form filed with the director before the death of the judge, or, if no designation is on file, to the estate of the deceased judge.\nA retirement annuity under subdivision 1, 3, or 5, a disability benefit under subdivision 4, and a survivor's annuity under subdivision 9 or 11 are eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}