{
	"id": "275.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.28",
	"title": "275.28 TAX LISTS.",
	"text": "The county auditor shall make out the tax lists according to the prescribed form, and to correspond with the assessment districts. The rate percent necessary to raise the required amount of the various taxes shall be calculated on the net tax capacity of property as determined by the state Board of Equalization, but, in calculating such rates, no rate shall be used resulting in a fraction other than a decimal fraction, or less than a gross local tax rate of .01 percent or a net local tax rate of .01 percent; and, in extending any tax, whenever it amounts to the fractional part of a cent, it shall be made one cent. The tax lists shall also be made out to correspond with the assessment books in reference to ownership and description of property, with columns for the valuation and for the various items of tax included in the total amount of all taxes set down opposite each description. The auditor shall enter both the state tax determined under sections 275.02 and 275.025, and the local tax determined under section 275.08, on the tax lists. The total ad valorem property tax for each description of property before credits is the sum of the amounts of the various local taxes that apply to the parcel plus the amount of any applicable state tax. Opposite each description which has been sold for taxes, and which is subject to redemption, but not redeemed, shall be placed the words \"sold for taxes.\" The amount of all special taxes shall be entered in the proper columns, but the general taxes may be shown by entering the rate percent of each tax at the head of the proper columns, without extending the same, in which case a schedule of the rates percent of such taxes shall be made on the first page of each tax list. If the auditor fails to enter on any such list before its delivery to the treasurer any tax levied, the tax may be subsequently entered. The tax lists shall be deemed completed, and all taxes extended thereon, as of January 1 annually.\nThe auditor shall make in each assessment book or list a certificate in the following form:\nI, A.B., auditor of ............ County, and the state of Minnesota, do hereby certify that the following is a correct list of the taxes levied on the real and personal property in the (town or district, as the case may be) of ............ for the year ....... (being the same year the property was assessed and the tax levied), to become payable in the year ....... .\nWitness my hand and official seal this ...... day of ............, ....... .\n.........................\nCounty Auditor.\nTaxes on real and personal property shall be related to and designated on the property tax statement by the year in which they become payable but the liens shall relate back to the assessment date preceding except as otherwise provided. For cash basis taxpayers, taxes on real and personal property shall relate to the year in which they become payable. For accrual basis taxpayers, taxes on real and personal property shall relate to the year in which the lien arose.\nIn any county in this state in which the county auditor has elected to come under the provisions of section 273.03, subdivision 2, the auditor shall cause to be prepared a record to be known as \"Real estate assessment and tax list for the year ...............\" In addition to the information provided for in subdivision 1, to be shown in tax lists, there shall also be included the amount of market value of land, building, and machinery, if any, and the total market value assessed against each parcel of real estate contained in such lists.\nIn such counties the auditor shall make in each list a certificate in the following form:\n\"I, ..............., auditor of ............... County and the state of Minnesota, do hereby certify that the following is a correct list of the taxes levied on the real property, based on the total market value indicated therein, in the (town or district, as the case may be) of .................. for the year ....... .\nWitness my hand and official seal this ................... day of ............... .......\n.........................\nCounty Auditor.\"",
	"repealed": false
}