{
	"id": "160.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.08",
	"title": "160.08 CONTROLLED ACCESS.",
	"text": "The road authorities of the state, counties or cities acting either alone, or in cooperation with each other, or with any federal agency, or with any other state or subdivision of another state having authority to participate in the construction or maintenance of highways are authorized to plan for the designation, establishment, location, relocation, improvement, and maintenance of controlled-access highways for public use whenever the road authorities determine that traffic conditions, present or future, will justify such highways.\nMS 1967 [Repealed, 1969 c 312 s 8]\nSuch road authorities are authorized to so design any controlled-access highway, and to so regulate, restrict, or prohibit access as to best serve the traffic for which the highway is intended. Such road authorities are authorized to divide and separate any controlled-access highway into separate roadways by the construction of raised curbings, central dividing sections, or other physical separations, or by designating the separate roadways by signs, markers, stripes, or other devices. No person shall have any rights of ingress or egress to, from, or across controlled-access highways to or from abutting lands, except at the designated points or roadways thereof where access is permitted by such road authorities upon such terms and conditions as such road authorities specify.\nProperty rights, including rights of access, air, view, and light, may be acquired by said road authorities with respect to both private and public property by purchase, gift, or condemnation.\nSuch road authorities may locate, establish, and construct controlled-access highways, or may designate and establish an existing street or highway as a controlled-access highway. Such road authorities are authorized to provide for the elimination of grade intersections of controlled-access highways with other existing streets or highways of any kind or nature whatsoever. The elimination may be accomplished by the construction of grade separations, or the construction of an outer lane as part of the controlled-access highway, or by closing off streets or highways at the right-of-way boundary of the controlled-access highway. When an outer lane is constructed, the abutting owners shall have access to the outer lane unless the petition and notice in condemnation, or the highway deed in cases of purchase, clearly specifies that the right of access to the outer lane has been acquired. After the establishment of any controlled-access highway no other street or highway or private entry shall be opened into or connected with any controlled-access highway without the consent and prior approval of the road authority having jurisdiction over the controlled-access highway. The consent and approval shall be given only if the public interest shall be served thereby. In the case of any elimination of existing access, air, view, light, or other compensable property rights, the owner shall be compensated for the loss by purchase or condemnation.\nNone of the provisions contained herein shall be construed to limit, restrict, or nullify any rights or easements of access heretofore acquired by the state or any of its political subdivisions.\nNo commercial establishment, including but not limited to automotive service stations, for serving motor vehicle users shall be constructed or located within the right-of-way of, or on publicly owned or publicly leased land acquired or used for or in connection with, a controlled-access highway; except that (1) structures may be built within safety rest and travel information center areas; (2) space within state-owned buildings in those areas may be leased for the purpose of providing information to travelers through advertising as provided in section 160.276; (3) advertising signs may be erected within the right-of-way of interstate or controlled-access trunk highways by franchise agreements under section 160.80; (4) vending machines may be placed in rest areas, travel information centers, or weigh stations constructed or located within trunk highway rights-of-way; and (5) acknowledgment signs may be erected under sections 160.272 and 160.2735.",
	"repealed": false
}