{
	"id": "290.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.07",
	"title": "290.07 NET INCOME; COMPUTATION, ACCOUNTING PERIOD.",
	"text": "Net income and taxable net income shall be computed upon the basis of the taxpayer's annual accounting period. If a taxpayer has no annual accounting period, or has one other than a fiscal year, the net income and taxable net income shall be computed on the basis of the calendar year. Taxpayers shall employ the same accounting period on which they report, or would be required to report, their net income under the Internal Revenue Code. The commissioner shall provide by rule for the determination of the accounting period for taxpayers who file a combined report under section 290.17, subdivision 4, when members of the group use different accounting periods for federal income tax purposes.\nExcept as specifically provided to the contrary by this chapter, net income and taxable net income shall be computed in accordance with the method of accounting regularly employed in keeping the taxpayer's books. If no such accounting system has been regularly employed, or if that employed does not clearly or fairly reflect income or the income taxable under this chapter, the computation shall be made in accordance with such method as in the opinion of the commissioner does clearly and fairly reflect income and the income taxable under this chapter.\n[Repealed, 1988 c 719 art 3 s 11]\nIf (a) an item was included in gross income for a prior taxable year (or years) because it appeared that the taxpayer had an unrestricted right to such item, and (b) a deduction is allowable for the taxable year because it was established after the close of such prior taxable year (or years) that the taxpayer did not have an unrestricted right to such item or to a portion of such item, and (c) the amount of such deduction exceeds $3,000, then the tax imposed by this chapter for the taxable year shall be the lesser of the following: (d) the tax for the taxable year computed with such deduction; or (e) an amount equal to (1) the tax for the taxable year computed without such deduction, minus (2) the decrease in tax under this chapter for the prior taxable year (or years) which would result solely from the exclusion of such item (or portion thereof) from gross income for such prior taxable year (or years).\nIf the decrease in tax ascertained under part (e)(2) of the preceding paragraph exceeds the tax imposed by this chapter for the taxable year (computed without the deduction) such excess shall be considered to be a payment of tax on the last day prescribed by law for the payment of tax for the taxable year, and shall be refunded or credited in the same manner as if it were an overpayment for such taxable year. The preceding paragraph does not apply to any deduction allowable with respect to an item which was included in gross income by reason of the sale or other disposition of stock in trade of the taxpayer (or other property of a kind which would properly have been included in the inventory of the taxpayer if on hand at the close of the prior taxable year) or property held by the taxpayer primarily for sale to customers in the ordinary course of the taxpayer's trade or business. This paragraph shall not apply if the deduction arises out of refunds or repayments made by a regulated public utility (as defined in section 7701(a)(33) of the Internal Revenue Code without regard to the limitation contained in the last two sentences thereof) if such refunds or repayments are required to be made by the government, political subdivision, agency, or instrumentality referred to in such section.\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1983 c 15 s 33]\n[Repealed, 1988 c 719 art 3 s 11]\nThe deductions and credits provided for in this chapter shall be taken for a taxable year in which \"paid or accrued\" or \"paid and incurred,\" dependent upon the method of accounting upon the basis of which the net income is computed, unless in order to clearly reflect the income the deductions or credits should be taken as of a different period.\nThe provisions of sections 461 to 468A of the Internal Revenue Code shall determine the taxable year for which a deduction or credit may be taken.",
	"repealed": false
}