{
	"id": "514.964",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.964",
	"title": "514.964 AGRICULTURAL LIEN ON CROPS.",
	"text": "A person leasing real property for agricultural production has a lien for unpaid rent on the crops produced on the real property in the crop year that is the subject of the lease. A landlord's lien becomes effective when the crops become growing crops.\n(a) A person providing combining, picking, harvesting, hauling, baling, drying, or storing services in the ordinary course of business has a lien upon the crops combined, picked, harvested, hauled, baled, dried, or stored, as the case may be, for the reasonable amount and kind of service provided.\n(b) A harvester's lien becomes effective upon the services being provided the obligor by the harvester.\n(c) A person asserting a harvester's lien may not assert a crop production input lien for the same goods or services provided the obligor.\n(a) A supplier furnishing crop production inputs in the ordinary course of business has an agricultural lien for the unpaid retail cost of the crop production inputs. The lien attaches to:\n(1) the existing crops upon the land where a furnished agricultural chemical was applied, or if crops are not planted, to the next production crop within 16 months following the last date on which the agricultural chemical was applied;\n(2) the crops produced from furnished seed; or\n(3) the crops produced, harvested, or processed using a furnished petroleum product.\nIf the crops are grown on leased land and the lease provides for payment in crops, the lien does not attach to the lessor's portion of the crops. A crop production input lien becomes effective when the crop production inputs are furnished by the supplier to the purchaser.\n(b) A supplier shall notify a lender of a crop production input lien by providing a lien-notification statement to the lender in an envelope marked \"IMPORTANT - LEGAL NOTICE.\" Delivery of the notice must be made by certified mail or another verifiable method.\n(c) The lien-notification statement must disclose the following:\n(1) the name and address of the lender that is to receive notification;\n(2) the name and address of the supplier claiming the lien;\n(3) a description and the date or anticipated date or dates of the transaction and the retail cost or anticipated costs of the crop production input;\n(4) the name and address of the person to whom the crop production input was furnished; and\n(5) the name and address of the owner.\n(d) Within ten calendar days after receiving a lien-notification statement, the lender must respond to the supplier with either:\n(1) a letter of commitment for part or all of the retail cost or anticipated costs of the crop production input as set forth in the lien-notification statement; or\n(2) a written refusal to issue a letter of commitment.\nA copy of the lender's response must be provided to the person for whom the financing was requested.\n(e) If a lender responds with a letter of commitment for part or all of the amount in the lien-notification statement, the supplier may not obtain a lien for the amount stated in the letter of commitment. If a lender responds with a refusal to provide a letter of commitment, the rights of the lender and the supplier are not affected.\n(f) If a lender does not respond under paragraph (d) to the supplier within ten calendar days after receiving the lien-notification statement, a perfected crop production input lien corresponding to the lien-notification statement has priority over any security interest of the lender in the same crops or their proceeds for the lesser of:\n(1) the amount stated in the lien-notification statement; or\n(2) the unpaid retail cost of the crop production input identified in the lien-notification statement.\nA landlord's lien, harvester's lien, or crop production input lien attaches to the crops serviced, produced, or harvested by the agricultural lienholder, and the products and proceeds thereof to the extent of the price or value of the goods or services provided.\n(a) A landlord's lien, harvester's lien, or crop production input lien under this section is perfected if a financing statement is filed pursuant to sections 336.9-501 to 336.9-530 and within the time periods set forth in paragraphs (b) to (d).\n(b) A landlord's lien must be perfected on or before 30 days after the crops become growing crops.\n(c) A harvester's lien must be perfected on or before 15 days after the last date that harvesting services are provided the obligor.\n(d) A crop production input lien must be perfected by six months after the last date that crop production inputs are furnished the obligor.\nExcept as otherwise provided in this section, an agricultural lien is subject to the provisions of the Uniform Commercial Code - Secured Transactions, sections 336.9-101 to 336.9-709.\n(a) A perfected landlord's lien under this section has priority over all competing security interests and all agricultural liens in crops and the products or proceeds thereof.\n(b) Except as provided in paragraph (c), a perfected harvester's lien under this section has priority over all competing security interests and all agricultural liens except a perfected landlord's lien in crops and the products or proceeds thereof, and except for a perfected crop production input lien for the reasonable cost of the seed in crops and products and the proceeds thereof.\n(c) If more than one harvester's lien is perfected under this section, the conflicting perfected harvester's liens rank equally in proportion to the value of the service provided.\n(d) Except as provided in paragraph (e), a perfected crop production lien under this section has priority against all competing agricultural liens except a perfected landlord's lien and a perfected harvester's lien in the crops and products or proceeds thereof.\n(e) If more than one crop production input lien is perfected under this section, conflicting perfected crop production input liens have priority in order of the effectiveness of the liens.\n(f) Except as provided in paragraph (g), a perfected crop production input lien under this section has priority against all competing security interest as provided in subdivision 3 in crops and the products and proceeds thereof.\n(g) A perfected crop production input lien has priority over a competing security interest in the crops and proceeds and products thereof if the crop production input lien is effective before the secured party has given value to the debtor.\nDefault occurs when an obligor fails to perform any obligation, whether written or oral, owed to the agricultural lienholder.\nThe holder of an agricultural lien under this section may enforce the lien in the manner provided in sections 336.9-601 to 336.9-628.",
	"repealed": false
}