{
	"id": "144A.611",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.611",
	"title": "144A.611 REIMBURSABLE EXPENSES FOR NURSING ASSISTANT TRAINING AND COMPETENCY EVALUATIONS.",
	"text": "The actual costs of tuition and textbooks and reasonable expenses for the competency evaluation or the nursing assistant training program and competency evaluation approved under section 144A.61, which are paid to nursing assistants or adult training programs or their fiscal agents pursuant to subdivisions 2 and 4, are a reimbursable expense for nursing homes and certified boarding care homes under section 256R.37.\n(a) A nursing assistant who has completed an approved competency evaluation or an approved training program and competency evaluation shall be reimbursed by the nursing home or certified boarding care home for actual costs of tuition and textbooks and reasonable expenses for the competency evaluation or the training program and competency evaluation 90 days after the date of employment, or upon completion of the approved training program, whichever is later.\n(b) A nursing home or certified boarding care home shall reimburse a nursing assistant for the expenses specified in paragraph (a) only if the nursing assistant actually incurred those expenses. If training or testing costs were paid by an entity receiving state or federal funding for those expenses and if the nursing assistant did not reimburse the entity for those expenses, the nursing home or boarding care home shall directly reimburse the entity that paid for the training and testing costs on behalf of the nursing assistant.\nThe commissioner of human services shall promulgate any rules necessary to implement the provisions of this section. The rules shall include, but not be limited to:\n(1) provisions designed to prevent reimbursement by the commissioner under this section and section 144A.61 to a nursing home, certified boarding care home, or nursing assistant for the assistant's simultaneous training in more than one approved program;\n(2) provisions designed to prevent reimbursement by the commissioner under this section and section 144A.61 to more than one nursing home or certified boarding care home for the training of any individual nursing assistant; and\n(3) provisions permitting the reimbursement by the commissioner to nursing homes, certified boarding care homes, and nursing assistants for the retraining of a nursing assistant after an absence from the labor market of not less than 24 months.\n(a) Nursing facilities and certified boarding care homes shall provide reimbursement for costs related to additional adult basic education training intended to ensure successful completion of an approved nursing assistant training program, to:\n(1) an adult basic education training program, as defined in section 124D.52 and approved by the commissioner of education, that provided training to an individual hired as a certified nursing assistant by the nursing facility or boarding care home; or\n(2) a fiscal agent identified by an adult basic education training program specified in clause (1).\n(b) For purposes of this subdivision, adult basic education training components must include the following, if needed: training in mathematics, vocabulary, literacy skills, workplace skills, resume writing, and job interview skills. Reimbursement provided under this subdivision shall not exceed 30 percent of the total cost of the nursing assistant training and testing for an individual, including tuition, textbook costs, and the cost of the competency evaluation.\n(c) An adult basic education training program is prohibited from billing nursing facilities or certified boarding care homes for costs under this subdivision until the program student has been employed by the nursing facility as a certified nursing assistant for at least 90 days.",
	"repealed": false
}