{
	"id": "325G.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.42",
	"title": "325G.42 CREDIT CARD DISCLOSURES.",
	"text": "A credit card application distributed in this state must disclose the following terms of the credit card plan, if applicable:\n(1) Any periodic rate or rates that may be applied to the account, expressed as an annual percentage rate or rates. If the account is subject to a variable rate, the creditor may disclose the rate as of a specific date and indicate that the rate may vary, or may identify the index and any amount or percentage added to, or subtracted from, that index and used to determine the rate. For purposes of this section, the amount or percentage must be referred to as the \"spread.\" If charges incurred by use of the credit card are due and payable upon receipt of a periodic statement of charges, then that fact must be disclosed.\n(2) Any membership, participation, or similar fee that may be imposed as a condition of the issuance or renewal of a credit card, expressed as an annual amount.\n(3) Any minimum, fixed, transaction, activity, or similar charge.\n(4) Any other fees that may be charged to the account, including late payment fees and charges for exceeding credit limits.\n(5) The date or occasion upon which the finance charge, if any, begins to accrue on a transaction.\nThe disclosures required under this section shall be written in plain language, as defined in section 325G.31; shall be in boldface type of a minimum size of ten points; shall be clear and conspicuous; and shall be prominently set apart from the remaining portions of the credit card application or other written material, by the use of margins, enclosures, underlining, contrasting colors, or similar methods.\nA creditor need not present the disclosures required by subdivision 1 in any specific form other than as provided in subdivision 2. However, the disclosures are conclusively presumed to satisfy the requirements of subdivision 1 if the disclosures satisfy the requirements of subdivision 2 and are presented in a chart, substantially similar to the following description:\n(1) The chart shall consist of contiguous boxes, and each required disclosure shall appear exclusively within one of the boxes.\n(2) The first box shall contain the wording \"ANNUAL PERCENTAGE RATE\" if the creditor charges a fixed rate, or \"VARIABLE RATE INDEX AND SPREAD,\" if appropriate, underneath which the creditor's rate will appear. If full payment is due upon receipt of a periodic statement of charges, then the first box shall state \"Full payment due upon receipt of billing statement.\"\n(3) The second box shall contain the wording \"OTHER FEES\" and shall disclose all other fees, including late payment penalties and any charges for exceeding the credit limit.\n(4) The third box shall contain the wording \"ANNUAL FEE,\" underneath which the appropriate information shall be disclosed.\n(5) The fourth box shall contain the wording \"TRANSACTION FEE,\" underneath which the appropriate information shall be disclosed.\n(6) The fifth box shall contain the wording \"FREE PERIOD\" or \"GRACE PERIOD,\" underneath which the appropriate information shall be disclosed. For example, \"30 days,\" or \"yes, if full payment is received by next billing date,\" or \"yes, if full new balance is paid by due date.\"\nNothing in this section prohibits a creditor from disclosing additional terms, conditions, or information, whether or not relating to the disclosures required under this section, in conjunction with the disclosures required by this section.\nThis section does not apply to any advertisement, catalogue, or other written document or material which does not contain a credit card application.",
	"repealed": false
}