{
	"id": "5.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/5.23",
	"title": "5.23 REMOVAL OF DOCUMENTS FROM PUBLIC RECORD.",
	"text": "If a person files an instrument authorized to be filed with the secretary of state with a payment order or item that is rejected or dishonored, the secretary of state is authorized to refuse the filing of further instruments submitted by that person or on behalf of the business entity or notary on whose behalf the prior instrument was filed or relating to the same assumed name or trademark filing. The secretary may also pursue collection of the rejected or dishonored payment order or item and recover the face amount of the payment order or item, any service fee, and any additional collection costs incurred to collect the amount. If the payment order or item is honored, or the delinquent amount is paid, the secretary of state must resume filing instruments submitted by that person or on behalf of that business entity or notary or relating to the same assumed name or trademark filing as of the date the payment order or item is honored and an instrument is presented for filing. The secretary may impose restrictions on the manner of payment that will be accepted for any future filings. This subdivision does not apply to financing statements filed under chapter 336 or to an effective financing statement or lien notice filed under chapter 336A.\nIf a party enters into a continuing agreement with the secretary of state for the receipt of information or products containing information and payment for services or products is made by a payment order or item that is rejected or dishonored, the secretary shall immediately terminate the agreement. The secretary may also pursue collection of the rejected or dishonored payment order or item and recover the face amount of the payment order or item and any additional costs incurred to collect the amount. If the payment order or item is honored, the agreement may be reinstated and the secretary may impose restrictions on the manner of payment that will be accepted during the course of the agreement.\nIf a customer who has subscribed with the secretary of state for direct computer access to the secretary's databases makes payment for information received with a payment order or item that is rejected or dishonored, the secretary shall immediately terminate the customer's access to the databases. The secretary may also pursue collection of the rejected or dishonored payment order or item and recover the face amount of the payment order or item and any additional costs incurred to collect the amount. If the payment order or item is honored, access may be restored and the secretary may impose restrictions on the methods of payment that will be acceptable.\nThe secretary of state must collect the face amount of the rejected or dishonored payment order or item, any service fee, and all costs of collection in every possible instance. Collection must occur whether or not the customer continues to receive the information products or access to the database. Uncollectible payment orders and items must be processed according to applicable Minnesota law.",
	"repealed": false
}