{
	"id": "174.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.82",
	"title": "174.82 COMMUTER RAIL; COMMISSIONER'S DUTIES; CONTRACTS.",
	"text": "The planning, development, construction, operation, and maintenance of commuter rail track, facilities, and services are governmental functions, serve a public purpose, and are a matter of public necessity. The commissioner shall be responsible for all aspects of planning, developing, constructing, operating, and maintaining commuter rail, including system planning, advanced corridor planning, preliminary engineering, final design, construction, negotiating with railroads, and developing financial and operating plans. The commissioner may enter into a memorandum of understanding or agreement with a public or private entity, including a regional railroad authority, a joint powers board, and a railroad, to carry out these activities. The commissioner, or public entity contracting with the commissioner, may contract with a railroad that is a Class I railroad under federal law for the joint or shared use of the railroad's right-of-way or the construction, operation, or maintenance of rail track, facilities, or services for commuter rail purposes. Notwithstanding section 3.732, subdivision 1, clause (2), or section 466.01, subdivision 6, sections 466.04 and 466.06 govern the liability of the Class I railroad and its employees arising from the joint or shared use of the railroad right-of-way or the provision of commuter rail construction, operation, or maintenance services pursuant to the contract. Notwithstanding any law to the contrary, a contract with the Class I railroad for any commuter rail service, or joint or shared use of the railroad's right-of-way, may also provide for the allocation of financial responsibility, indemnification, and the procurement of insurance for the parties for all types of claims or damages. A contract entered into under this section does not affect rights of employees under the federal Employers' Liability Act, United States Code, title 45, section 51 et seq., or the federal Railway Labor Act, United States Code, title 45, section 151 et seq.",
	"repealed": false
}