{
	"id": "169.791",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.791",
	"title": "169.791 CRIMINAL PENALTY FOR FAILURE TO PRODUCE PROOF OF INSURANCE.",
	"text": "(a) For purposes of this section and sections 169.792 to 169.798, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of public safety.\n(c) \"District court administrator\" or \"court administrator\" means the district court administrator or a deputy district court administrator of the district court that has jurisdiction of a violation of this section.\n(d) \"Insurance identification card\" means a card, including in an electronic format as provided in section 65B.482, subdivision 1, issued by an obligor to an insured stating that security as required by section 65B.48 has been provided for the insured's vehicle.\n(e) \"Law enforcement agency\" means the law enforcement agency that employed the peace officer who demanded proof of insurance under this section or section 169.792.\n(f) \"Peace officer\" or \"officer\" means an employee of a political subdivision or state law enforcement agency, including the Minnesota State Patrol, who is licensed by the Minnesota Board of Peace Officer Standards and Training and is authorized to make arrests for violations of traffic laws.\n(g) \"Proof of insurance\" means an insurance identification card, written statement, or insurance policy as defined by section 65B.14, subdivision 2.\n(h) \"Vehicle\" means a motor vehicle as defined in section 65B.43, subdivision 2, or a motorcycle as defined in section 65B.43, subdivision 13.\n(i) \"Written statement\" means a written statement by a licensed insurance agent stating the name and address of the insured, the vehicle identification number of the insured's vehicle, that a plan of reparation security as required by section 65B.48 has been provided for the insured's vehicle, and the dates of the coverage.\n(j) The definitions in section 65B.43 apply to sections 169.792 to 169.798.\n(a) Every driver shall have in possession at all times when operating a vehicle and shall produce on demand of a peace officer proof of insurance in force at the time of the demand covering the vehicle being operated. If the driver does not produce the required proof of insurance upon the demand of a peace officer, the driver is guilty of a misdemeanor. A person is guilty of a gross misdemeanor who violates this section within ten years of the first of two prior convictions under this section, section 169.797, or a statute or ordinance in conformity with one of those sections. The same prosecuting authority who is responsible for prosecuting misdemeanor violations of this section is responsible for prosecuting gross misdemeanor violations of this section. A driver who is not the owner of the vehicle may not be convicted under this section unless the driver knew or had reason to know that the owner did not have proof of insurance required by this section, provided that the driver provides the officer with the name and address of the owner at the time of the demand or complies with subdivision 3.\n(b) The use of an electronic device to display proof of insurance does not constitute consent for a peace officer to access other contents of the electronic device.\n(c) If a person uses an electronic device to display proof of insurance, a peace officer is immune from liability for any damage to the device, unless the peace officer does not exercise due care in handling the device.\nA driver who is the owner of the vehicle may, no later than the date and time specified in the citation for the driver's first court appearance, produce proof of insurance stating that security had been provided for the vehicle that was being operated at the time of the demand to the court administrator. The required proof of insurance may be sent by mail by the driver as long as it is received no later than the date and time specified in the citation for the driver's first court appearance. If a citation is issued, no person shall be convicted of violating this section if the court administrator receives the required proof of insurance no later than the date and time specified in the citation for the driver's first court appearance. If the charge is made other than by citation, no person shall be convicted of violating this section if the person presents the required proof of insurance at the person's first court appearance after the charge is made.\nIf the driver is not the owner of the vehicle, the driver shall, no later than the date and time specified in the citation for the driver's first court appearance, provide the district court administrator with proof of insurance or the name and address of the owner. Upon receipt of the name and address of the owner, the district court administrator shall communicate the information to the law enforcement agency.\nIf the driver is not the owner of the vehicle, the officer may send or provide a notice to the owner of the vehicle requiring the owner to produce proof of insurance for the vehicle that was being operated at the time of the demand. Notice by mail is presumed to be received five days after mailing and shall be sent to the owner's current address or the address listed on the owner's driver's license. Within ten days after receipt of the notice, the owner shall produce the required proof of insurance to the place stated in the notice received by the owner. The required proof of insurance may be sent by mail by the owner as long as it is received within ten days. Any owner who fails to produce proof of insurance within ten days of an officer's request under this subdivision is guilty of a misdemeanor. The peace officer may mail the citation to the owner's current address or address stated on the owner's driver's license. It is an affirmative defense to a charge against the owner that the driver used the owner's vehicle without consent, if insurance would not have been required in the absence of the unauthorized use by the driver. It is not a defense that a person failed to notify the Department of Public Safety of a change of name or address as required under section 171.11. The citation may be sent after the ten-day period.\nBuses or other commercial vehicles operated by the Metropolitan Council, commercial vehicles required to file proof of insurance pursuant to chapter 221, and school buses as defined in section 171.01, subdivision 46, are exempt from this section.\nThe court may impose consecutive sentences for offenses arising out of a single course of conduct as permitted in section 609.035, subdivision 2.\nIn addition to any sentence of imprisonment that the court may impose, the court shall impose a fine of not less than $200 nor more than the maximum fine applicable to misdemeanors upon conviction under this section. The court may allow community service in lieu of any fine imposed if the defendant is indigent. In addition to criminal penalties, a person convicted under this section is subject to revocation of a driver's license or permit to drive under section 169.792, subdivision 7, and to revocation of motor vehicle registration under section 169.792, subdivision 12.\nAny person who knowingly provides false information to an officer or district court administrator under this section is guilty of a misdemeanor.",
	"repealed": false
}