{
	"id": "144.4809",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4809",
	"title": "144.4809 PRELIMINARY HEARING.",
	"text": "A party may petition the court for an order for enforcement of or relief from a health order or judicial order.\nThe petitioning party shall serve on the commissioner and file in the probate division of the district court of the county in which the carrier or respondent resides a petition and notice of preliminary hearing. The court shall hold a preliminary hearing no later than 15 days from the date of the filing and service of the petition for a preliminary hearing. If a carrier detained under section 144.4807 or 144.4808 files a petition for a preliminary hearing, the hearing must be held no later than five days from the date of the filing and service of the petition, excluding Saturdays, Sundays, and legal holidays.\nIf the commissioner petitions the court to enforce the health order, the notice of the preliminary hearing must contain the following information:\n(1) the date, time, and place of the hearing;\n(2) the right of the carrier to be represented by court-appointed counsel during any proceeding under sections 144.4801 to 144.4813;\n(3) the right of the carrier or respondent to the assistance of an interpreter in any proceeding under sections 144.4801 to 144.4813;\n(4) the right of the carrier or respondent to appear at the hearing;\n(5) the right of the carrier or respondent to present and cross-examine witnesses;\n(6) a statement of any disputed facts, or a statement of the nature of any other disputed matter; and\n(7) the name and address of any witness that the petitioning party intends to call to testify at the hearing, and a brief summary of the witness' testimony.\nIf the carrier or respondent petitions the court for relief from the health order or court order, the notice of preliminary hearing must contain the information in subdivision 3, clauses (1), (6), and (7).\n(a) At least five days before the date of the preliminary hearing, excluding Saturdays, Sundays, and legal holidays, the nonpetitioning party shall respond to the petition for hearing by filing and serving on the petitioning party:\n(1) a statement of any disputed facts, or a statement of the nature of any other disputed matter; and\n(2) the name and address of any witness that the nonpetitioning party intends to call to testify at the hearing, and a brief summary of the witness' testimony.\nIf the carrier seeks release from an emergency hold ordered under section 144.4807, subdivision 7, or under section 144.4808, subdivision 2, the commissioner shall file and serve on the carrier's counsel the items in clauses (1) and (2) at least 48 hours prior to the preliminary hearing, excluding Saturdays, Sundays, and legal holidays.\n(b) At the hearing, the parties shall identify the efforts they made to resolve the matter prior to the preliminary hearing.\nIf the carrier is infectious, the treatment facility in which the carrier is sought to be detained or to which the carrier is sought to be removed shall make reasonable accommodations to provide a room where the hearing may be held that minimizes the risk of exposing persons attending the hearing to tuberculosis. If a room is not available at the treatment facility, the court may designate another location for the hearing.\nThe commissioner must prove by a preponderance of the evidence that the carrier is an endangerment to the public health.\nThe court shall admit all reliable relevant evidence. Medical and epidemiological data must be admitted if it conforms with section 145.31, chapter 600, Minnesota Rules of Evidence, rule 803(6), or other statutes or rules that permit reliable evidence to be admitted in civil cases. The court may rely on medical and epidemiological data, including hearsay, if it finds that physicians and other licensed health professionals rely on the data in the regular course of providing health care and treatment.\nIt is a sufficient basis for the court to order continued confinement of the carrier or other preventive measures requested by the commissioner if reliable testimony is provided solely by the carrier's attending physician or nurse, a public health physician or nurse, other licensed health professional, or disease prevention officer.\nIf the carrier or respondent fails to appear at the hearing without prior court approval, the hearing may proceed without the carrier or respondent and the court may make its determination on the basis of all reliable evidence submitted at the hearing.",
	"repealed": false
}