{
	"id": "360.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.065",
	"title": "360.065 AIRPORT ZONING; ADOPTION AND APPROVAL OF PROPOSED REGULATIONS.",
	"text": "(a) No airport zoning regulations shall be adopted, amended, or changed under sections 360.011 to 360.076, except by action of the governing body of the municipality, county, or joint airport zoning board under section 360.0655 or 360.0656, or the boards provided for in section 360.063, subdivisions 3 and 7, or by the commissioner as provided in section 360.063, subdivisions 6 and 8.\n(b) A public hearing must be held on the airport zoning regulations proposed by a municipality, county, or joint airport zoning board before they are submitted to the commissioner for approval. If any changes that alter the regulations placed on a parcel of land are made to the proposed airport zoning regulations after the initial public hearing, the municipality, county, or joint airport zoning board must hold a second public hearing before final adoption of the regulation. The commissioner may require a second hearing as determined necessary.\n(c) Notice of a hearing must be published by the municipality, county, or joint airport zoning board at least three times during the period between 15 days and five days before the hearing in an official newspaper and in a second newspaper designated by that authority which has a wide general circulation in the area affected by the proposed regulations and posted on the municipality's, county's, or joint airport zoning board's website. If there is not a second newspaper of wide general circulation in the area that the municipality, county, or joint airport zoning board can designate for the notice, the municipality, county, or joint airport zoning board is only required to publish the notice once in the official newspaper of the jurisdiction. The notice shall not be published in the legal notice section of a newspaper. The notice must specify the time, location, and purpose of the hearing, and must identify any additional location and time the proposed regulations will be available for public inspection. A copy of the published notice must be added to the record of the proceedings.\n(d) Notice of a hearing must be given by mail at least ten days before each hearing to persons and landowners where the location or size of a building, or the density of population, will be regulated. Mailed notice must also be provided at least ten days before each hearing to persons or municipalities that have previously requested such notice from the municipality, county, or joint airport zoning board. The notice must specify the time, location, and purpose of the hearing, and must identify any additional location and time the proposed regulations will be made available for public inspection. Mailed notice must also identify the property affected by the regulations. For the purpose of providing mailed notice, the municipality, county, or joint airport zoning board may use any appropriate records to determine the names and addresses of owners. A copy of the notice and a list of the owners and addresses to which the notice was sent must be added to the records of the proceedings. Failure to provide mailed notice to individual property owners or a defect in the notice does not invalidate the proceedings if a bona fide attempt to comply with this subdivision was made.\nMS 2018 [Repealed, 1Sp2019 c 3 art 3 s 140]\nMS 2006 [Repealed, 2007 c 64 s 3]",
	"repealed": false
}