{
	"id": "245D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.11",
	"title": "245D.11 POLICIES AND PROCEDURES; INTENSIVE SUPPORT SERVICES.",
	"text": "A license holder providing intensive support services as identified in section 245D.03, subdivision 1, paragraph (c), must establish, enforce, and maintain policies and procedures as required in this section.\nThe license holder must establish policies and procedures that promote health and welfare by ensuring:\n(1) use of universal precautions and sanitary practices in compliance with section 245D.06, subdivision 2, clause (5);\n(2) if the license holder operates a residential program, health service coordination and care according to the requirements in section 245D.05, subdivision 1;\n(3) safe medication assistance and administration according to the requirements in sections 245D.05, subdivisions 1a, 2, and 5, and 245D.051, that are established in consultation with a registered nurse, advanced practice registered nurse, physician assistant, or medical doctor and require completion of medication administration training according to the requirements in section 245D.09, subdivision 4a, paragraph (d). Medication assistance and administration includes, but is not limited to:\n(i) providing medication-related services for a person;\n(ii) medication setup;\n(iii) medication administration;\n(iv) medication storage and security;\n(v) medication documentation and charting;\n(vi) verification and monitoring of effectiveness of systems to ensure safe medication handling and administration;\n(vii) coordination of medication refills;\n(viii) handling changes to prescriptions and implementation of those changes;\n(ix) communicating with the pharmacy; and\n(x) coordination and communication with prescriber;\n(4) safe transportation, when the license holder is responsible for transportation of persons, with provisions for handling emergency situations according to the requirements in section 245D.06, subdivision 2, clauses (2) to (4);\n(5) a plan for ensuring the safety of persons served by the program in emergencies as defined in section 245D.02, subdivision 8, and procedures for staff to report emergencies to the license holder. A license holder with a community residential setting or a day service facility license must ensure the policy and procedures comply with the requirements in section 245D.22, subdivision 4;\n(6) a plan for responding to all incidents as defined in section 245D.02, subdivision 11; and reporting all incidents required to be reported according to section 245D.06, subdivision 1. The plan must:\n(i) provide the contact information of a source of emergency medical care and transportation; and\n(ii) require staff to first call 911 when the staff believes a medical emergency may be life threatening, or to call the mental health crisis intervention team or similar mental health response team or service when such a team is available and appropriate when the person is experiencing a mental health crisis; and\n(7) a procedure for the review of incidents and emergencies to identify trends or patterns, and corrective action if needed. The license holder must establish and maintain a record-keeping system for the incident and emergency reports. Each incident and emergency report file must contain a written summary of the incident. The license holder must conduct a review of incident reports for identification of incident patterns, and implementation of corrective action as necessary to reduce occurrences. Each incident report must include:\n(i) the name of the person or persons involved in the incident. It is not necessary to identify all persons affected by or involved in an emergency unless the emergency resulted in an incident;\n(ii) the date, time, and location of the incident or emergency;\n(iii) a description of the incident or emergency;\n(iv) a description of the response to the incident or emergency and whether a person's support plan addendum or program policies and procedures were implemented as applicable;\n(v) the name of the staff person or persons who responded to the incident or emergency; and\n(vi) the determination of whether corrective action is necessary based on the results of the review.\nThe license holder must establish policies and procedures that promote service recipient rights by ensuring data privacy according to the requirements in:\n(1) the Minnesota Government Data Practices Act, section 13.46, and all other applicable Minnesota laws and rules in handling all data related to the services provided; and\n(2) the Health Insurance Portability and Accountability Act of 1996 (HIPAA), to the extent that the license holder performs a function or activity involving the use of protected health information as defined under Code of Federal Regulations, title 45, section 164.501, including, but not limited to, providing health care services; health care claims processing or administration; data analysis, processing, or administration; utilization review; quality assurance; billing; benefit management; practice management; repricing; or as otherwise provided by Code of Federal Regulations, title 45, section 160.103. The license holder must comply with the Health Insurance Portability and Accountability Act of 1996 and its implementing regulations, Code of Federal Regulations, title 45, parts 160 to 164, and all applicable requirements.\nThe license holder must establish policies and procedures that promote continuity of care by ensuring that admission or service initiation criteria:\n(1) is consistent with the service-related rights identified in section 245D.04, subdivisions 2, clauses (4) to (7), and 3, clause (8);\n(2) identifies the criteria to be applied in determining whether the license holder can develop services to meet the needs specified in the person's support plan;\n(3) requires a license holder providing services in a health care facility to comply with the requirements in section 243.166, subdivision 4b, to provide notification to residents when a registered predatory offender is admitted into the program or to a potential admission when the facility was already serving a registered predatory offender. For purposes of this clause, \"health care facility\" means a facility licensed by the commissioner as a residential facility under chapter 245A to provide adult foster care or residential services to persons with disabilities;\n(4) requires that when a person or the person's legal representative requests services from the license holder, a refusal to admit the person must be based on an evaluation of the person's assessed needs and the license holder's lack of capacity to meet the needs of the person. The license holder must not refuse to admit a person based solely on the type of residential services the person is receiving, or solely on the person's severity of disability, orthopedic or neurological handicaps, sight or hearing impairments, lack of communication skills, physical disabilities, toilet habits, behavioral disorders, or past failure to make progress. Documentation of the basis for refusal must be provided to the person or the person's legal representative and case manager upon request; and\n(5) requires the person or the person's legal representative and license holder to sign and date the residency agreement when the license holder provides foster care or supported living services under section 245D.03, subdivision 1, paragraph (c), clause (3), item (i) or (ii), to a person living in community residential settings defined in section 245D.02, subdivision 4a; an adult foster home defined in Minnesota Rules, part 9555.5105, subpart 5; or a foster family home defined in Minnesota Rules, part 9560.0521, subpart 12. The residency agreement must include service termination requirements specified in section 245D.10, subdivision 3a, paragraphs (b) to (f). The residency agreement must be reviewed annually, dated, and signed by the person or the person's legal representative and license holder.",
	"repealed": false
}