{
	"id": "525.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/525.95",
	"title": "525.95 FIDUCIARY POWERS, SUSPENSION DURING WAR SERVICE.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"War service\" includes the following, during a period when the United States is engaged in war or other major military engagement with a foreign nation:\n(1) active membership in the military forces of the United States or any of its allies;\n(2) acceptance for membership in the military forces of the United States or any of its allies and awaiting induction into that service;\n(3) participation in work abroad in connection with a governmental agency of the United States or any of its allies, with the Red Cross, or with a similar service;\n(4) internment by an enemy or absence from the United States and inability to return; and\n(5) service arising out of or in connection with the war or other major military engagement, which in the opinion of the court prevents the fiduciary from giving the proper attention to duties.\n(b) \"Fiduciary\" refers to a trustee of a testamentary trust or of an express trust, a guardian of a person or conservator of a person's estate, an executor of a will, an administrator of the estate of the decedent, a custodian under the Minnesota Uniform Transfers to Minors Act, or an advisor or consultant in a testamentary or express trust.\nA fiduciary who contemplates entering war service, a fiduciary who is engaged in war service, a cofiduciary, or an interested person may petition the proper court having jurisdiction in matters of that nature for the suspension of the powers and duties of the fiduciary during the period of war service and until the further order of the court, and may petition for the reinstatement of the fiduciary upon the fiduciary's return.\nNotice of the hearing on a petition under subdivision 2 must be given to persons and in the manner the court directs.\nAfter a hearing on a petition under subdivision 2 or in the case of an executor, administrator, or guardian on the court's own motion, the court may:\n(1) order the suspension of the powers and duties of the fiduciary who is in war service for the period of the war service and until the further order of the court;\n(2) appoint a successor fiduciary to serve for the period of suspension of the powers and duties of the fiduciary and until the further order of the court, if upon suspension of powers and duties, there is no fiduciary to exercise the powers and duties of the fiduciary who is in war service, or if in the opinion of the court the appointment of a cofiduciary is advisable;\n(3) decree that the ownership and title to the trust property vests in the successor fiduciary or cofiduciary, as the case may be, and that the duties, powers, and discretions, or those of the powers and discretions that are not personal to the fiduciary, may be exercised by the cofiduciary or successor fiduciary;\n(4) make other orders the court considers advisable with respect to the trust estate or its administration, and authorize a reasonable compensation to the successor fiduciary; or\n(5) reserve jurisdiction for the entry of further orders and for the reinstatement of the fiduciary.\nUpon petition, the court shall order the reinstatement of the fiduciary when the fiduciary's war service has terminated if it appears that the trust is not fully executed or administration of the estate is not completed.\nThe fiduciary has no responsibility for the acts and doings of the cofiduciary or successor fiduciary during the period of the suspension of the fiduciary's powers and duties, but is not relieved of responsibility for the fiduciary's own acts or doings in the administration of the trust fund or estate. A successor fiduciary appointed under this section is not responsible for the acts of the predecessor fiduciary.",
	"repealed": false
}