{
	"id": "256B.0918",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0918",
	"title": "256B.0918 EMPLOYEE SCHOLARSHIP COSTS.",
	"text": "Beginning on or after October 1, 2005, within the limits of appropriations specifically available for this purpose, the commissioner shall provide funding to qualified provider applicants for employee scholarships for education in nursing and other health care fields. Employee scholarships must be for a course of study that is expected to lead to career advancement with the provider or in the field of long-term care, including home care or care of persons with disabilities, or nursing. Providers that secure this funding must use it to award scholarships to employees who work an average of at least 20 hours per week for the provider. Executive management staff without direct care duties, registered nurses, and therapists are not eligible to receive scholarships under this section.\nThe commissioner shall publish a request for proposals in the State Register by August 15, 2005, specifying provider eligibility requirements, provider selection criteria, program specifics, funding mechanism, and methods of evaluation. The commissioner may publish additional requests for proposals in subsequent years. Providers who provide services funded through the following programs are eligible to apply to participate in the scholarship program: home and community-based waivered services for persons with developmental disabilities under section 256B.501; home and community-based waivered services for the elderly under chapter 256S; waivered services under community access for disability inclusion under section 256B.49; community alternative care waivered services under section 256B.49; brain injury waivered services under section 256B.49; nursing services and home health services under section 256B.0625, subdivision 6a; personal care services and nursing supervision of personal care services under section 256B.0625, subdivision 19a; home care nursing services under section 256B.0625, subdivision 7; day training and habilitation services for adults with developmental disabilities under sections 252.41 to 252.46; and intermediate care facilities for persons with developmental disabilities under section 256B.5012.\nTo be considered for scholarship funding, the provider shall submit a completed application within the time frame specified by the commissioner. In awarding funding, the commissioner shall consider the following:\n(1) the size of the provider as measured in annual billing to the medical assistance program. To be eligible, a provider must receive at least $300,000 annually in medical assistance payments;\n(2) the percentage of employees meeting the scholarship program recipient requirements;\n(3) staff retention rates for paraprofessionals; and\n(4) other criteria determined by the commissioner.\nWithin the limits of appropriations specifically available for this purpose, for the rate period beginning on or after October 1, 2005, to September 30, 2007, the commissioner shall provide to each provider listed in subdivision 2 and awarded funds under subdivision 3 a medical assistance rate increase to fund scholarships up to three-tenths percent of the medical assistance reimbursement rate. The commissioner shall require providers to repay any portion of funds awarded under subdivision 3 that is not used to fund scholarships. If applications exceed available funding, funding shall be targeted to providers that employ a higher percentage of paraprofessional staff or have lower rates of turnover of paraprofessional staff. During the subsequent years of the program, the rate adjustment may be recalculated, at the discretion of the commissioner. In making a recalculation the commissioner may consider the provider's success at granting scholarships based on the amount spent during the previous year and the availability of appropriations to continue the program.\nParticipating providers shall report to the commissioner on a schedule determined by the commissioner and on a form supplied by the commissioner for a scholarship rate for rate periods beginning October 1, 2007. The report shall include the amount spent during the reporting period on eligible scholarships, and, for each scholarship recipient, the name of the recipient, the amount awarded, the educational institution attended, the nature of the educational program, the expected or actual program completion date, and a determination of the amount spent as a percentage of the provider's reimbursement. The commissioner shall require providers to repay all of the funds awarded under subdivision 3 if the report required in this subdivision is not filled according to the schedule determined by the commissioner.\nThe commissioner shall report to the legislature annually, beginning March 15, 2007, on the use of these funds.",
	"repealed": false
}