{
	"id": "136G.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/136G.11",
	"title": "136G.11 MATCHING GRANTS.",
	"text": "[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\n[Repealed, 1Sp2011 c 5 art 2 s 15]\nThe state retains ownership of all matching grants and earnings on matching grants until a qualified distribution is made to a beneficiary, an account owner, an eligible educational institution, or any other third party as requested by an account owner.\n(a) The plan administrator will attempt to locate the account owner or the beneficiary of an inactive account with a matching grant to determine the disposition of the account. No fee will be charged for this service. The matching grants and matching grant earnings in the account must be returned to the office, unless the account owner applies for a deferment or the beneficiary begins attending an eligible educational institution within one year of the date of notification.\n(b) The account owner may apply to the plan administrator for a deferment of inactive account time limits. Upon application, the plan administrator shall grant a onetime deferment of two years. In addition, the plan administrator shall grant a deferment for the beneficiary's initial enlistment for active duty in the armed forces of the United States, or for the period of active military duty required as part of the beneficiary's obligation as a member in a reserve military unit of the armed forces of the United States.\n(a) Matching grants are forfeited if:\n(1) the account owner transfers the total account balance of an account to another account or to another qualified tuition program;\n(2) any of the exceptions under section 530(d)(4)(B)(i) to (iv) of the Internal Revenue Code apply to the beneficiary, and the exceptions cover 100 percent of the beneficiary's qualified higher education expenses, unless the account owner requests the matching grant funds be used to make a qualified education loan repayment as defined in section 529(c)(9) of the Internal Revenue Code;\n(3) the account owner changes the beneficiary of the account; or\n(4) the account owner closes the account with a taxable distribution.\n(b) Matching grants must be proportionally forfeited if:\n(1) the account owner transfers a portion of an account to another account or to another qualified tuition program; or\n(2) the account owner takes a partial taxable distribution.\n(c) If the account owner makes a misrepresentation in a participation agreement or an application for a matching grant that results in a matching grant, the matching grant associated with the misrepresentation is forfeited. The office and the board must instruct the plan administrator as to the amount to be forfeited from the matching grant account. The office and the board must withdraw the matching grant or the proportion of the matching grant that is related to the misrepresentation.",
	"repealed": false
}