{
	"id": "142G.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.02",
	"title": "142G.02 DEFINITIONS.",
	"text": "The terms used in this chapter have the following meanings unless otherwise provided for by text.\n\"Absent parent\" means a minor child's parent who does not live in the same home as the child.\n\"Agency\" has the meaning given in section 256P.01, subdivision 2.\n\"Agency error\" means an error that results in an overpayment or underpayment to an assistance unit and is not caused by an applicant's or participant's failure to provide adequate, correct, or timely information about income, property, household composition, or other circumstances.\n\"Appeal\" means a written statement from an applicant or participant who requests a hearing under section 142G.21.\n\"Applicant\" means a person who has submitted to a county agency an application and whose application has not been acted upon, denied, or voluntarily withdrawn.\n\"Application\" means the submission by or on behalf of a family to a county agency of a completed, signed, and dated form, prescribed by the commissioner, that indicates the desire to receive assistance.\n\"Assistance unit\" or \"MFIP assistance unit\" means a group of mandatory or optional people receiving or applying for MFIP benefits together.\n\"Authorized representative\" means a person who is authorized, in writing, by an applicant or participant to act on the applicant's or participant's behalf in matters involving the application for assistance or participation in MFIP.\n\"Basic needs\" means the minimum personal requirements of subsistence and is restricted to food, clothing, shelter, utilities, and other items for which the loss, or lack of basic needs, is determined by the county agency to pose a direct, immediate threat to the physical health or safety of the applicant or participant.\n\"Budget month\" means the calendar month which the county agency uses to determine the income or circumstances of an assistance unit to calculate the amount of the assistance payment in the payment month.\n[See Note.]\n\"Caregiver\" means a minor child's birth or adoptive parent or parents and stepparent who live in the home with the minor child. For purposes of determining eligibility for this program, caregiver also means any of the following individuals, if adults, who live with and provide care and support to a minor child when the minor child's birth or adoptive parent or parents or stepparents do not reside in the same home: legal custodian or guardian, grandfather, grandmother, brother, sister, half brother, half sister, stepbrother, stepsister, uncle, aunt, first cousin or first cousin once removed, nephew, niece, person of preceding generation as denoted by prefixes of \"great,\" \"great-great,\" or \"great-great-great,\" or a spouse of any person named in the above groups even after the marriage ends by death or divorce.\n\"Child only case\" means a case that would be part of the child only TANF program under section 142G.01, subdivision 8.\n\"Client error\" means an error that results in an overpayment or underpayment and is due to an applicant's or participant's failure to provide adequate, correct, or timely information concerning income, property, household composition, or other circumstances.\n\"Commissioner\" means the commissioner of children, youth, and families or the commissioner's designated representative.\n\"Commissioner of education-selected high school equivalency\" means the high school equivalency certification issued by the commissioner of education as an equivalent to a secondary school diploma under section 124D.549.\n\"Corrective payment\" means an assistance payment that is made to correct an underpayment.\n\"Countable income\" means earned and unearned income that is described in section 256P.06, subdivision 3, or disregarded under section 142G.16, subdivision 1, or section 256P.03.\n\"Counted earnings\" means the earned income that remains after applicable disregards under section 142G.16, subdivision 2, have been subtracted from gross earned income.\n\"County agency\" means the agency designated by the county board to implement financial assistance for current programs and for MFIP and the agency responsible for enforcement of child support collection, and a county or multicounty agency that is authorized under sections 393.01, subdivision 7, and 393.07, subdivision 2, to administer MFIP.\n\"County board\" means a board of commissioners, a local services agency as defined in chapter 393, a board established under the Joint Powers Act, section 471.59, or a human services board under chapter 402.\n\"County of financial responsibility\" means the county that has financial responsibility for providing public assistance as specified in chapter 256G.\n\"County of residence\" means the county where the caregiver has established a home.\n\"Date of application\" has the meaning given in section 256P.01, subdivision 2b.\n\"Deem\" means to treat all or part of the income of an individual who is not in the assistance unit, but who is financially responsible for members of the assistance unit, as if it were income available to the assistance unit.\n\"Department\" means the Minnesota Department of Children, Youth, and Families.\n\"Disqualified\" means being ineligible to receive MFIP due to noncooperation with program requirements. Except for persons whose disqualification is based on fraud, a disqualified person can take action to correct the reason for ineligibility.\n\"Diversionary work program\" or \"DWP\" has the meaning given in section 142G.90.\n[See Note.]\n\"Documentation\" means a written statement or record that substantiates or validates an assertion made by a person or an action taken by a person, agency, or entity.\n\"Earned income\" has the meaning given in section 256P.01, subdivision 3.\n\"Earned income tax credit\" means the payment which can be obtained by a qualified person from an employer or from the Internal Revenue Service as provided by section 290.0671 and United States Code, title 26, subtitle A, chapter 1, subchapter A, part 4, subpart C, section 32.\n\"Encumbrance\" means a legal claim against real or personal property that is payable upon the sale of that property.\n\"Employable\" means a person is capable of performing existing positions in the local labor market, regardless of the current availability of openings for those positions.\n\"Equity value\" means the amount of equity in real or personal property owned by a person and is determined by subtracting any outstanding encumbrances from the fair market value.\n\"Excluded time\" has the meaning given in section 256G.02.\n\"Expedited issuance of the SNAP benefit portion\" means the issuance of the SNAP benefit portion to eligible assistance units on the day of application as provided in section 393.07, subdivision 10a.\n\"Fair hearing\" or \"hearing\" means the evidentiary hearing conducted by the department human services judge to resolve disputes as specified in section 142G.45, or if not applicable, section 142A.20.\n\"Fair market value\" means the price that an item of a particular make, model, size, material, or condition would sell for on the open market in the particular geographic area.\n\"Family\" includes:\n(1) the following individuals who live together: a minor child or a group of minor children related to each other as siblings, half siblings, stepsiblings, or adoptive siblings, together with their natural, adoptive parents, stepparents, or caregiver as defined in subdivision 12; and\n(2) a pregnant woman with no other children.\n(a) \"Family violence\" means the following, if committed against a family or household member by a family or household member:\n(1) physical harm, bodily injury, or assault;\n(2) the infliction of fear of physical harm, bodily injury, or assault; or\n(3) terroristic threats, within the meaning of section 609.713, subdivision 1; criminal sexual conduct, within the meaning of section 609.342, 609.343, 609.344, 609.345, or 609.3451; or interference with an emergency call within the meaning of section 609.78, subdivision 2.\n(b) For the purposes of family violence, \"family or household member\" means:\n(1) spouses and former spouses;\n(2) parents and children;\n(3) persons related by blood;\n(4) persons who are residing together or who have resided together in the past;\n(5) persons who have a child in common regardless of whether they have been married or have lived together at any time;\n(6) a man and woman if the woman is pregnant and the man is alleged to be the father, regardless of whether they have been married or have lived together at anytime; and\n(7) persons involved in a current or past significant romantic or sexual relationship.\n\"Family violence waiver\" means a waiver of the 60-month time limit for victims of family violence who meet the criteria in section 142G.53 and are complying with an employment plan in section 142G.56, subdivision 3.\n\"Family wage level\" means 110 percent of the transitional standard as specified in section 142G.17, subdivision 7.\n\"Federal Insurance Contribution Act\" or \"FICA\" means the federal law under United States Code, title 26, subtitle C, chapter 21, subchapter A, sections 3101 to 3126, that requires withholding or direct payment from earned income.\n\"Financial case record\" means an assistance unit's financial eligibility file.\n\"Full-time student\" means a person who is enrolled in a graded or ungraded primary, intermediate, secondary, commissioner of education-selected high school equivalency preparatory, trade, technical, vocational, or postsecondary school, and who meets the school's standard for full-time attendance.\n\"Gross earned income\" means earned income from employment before mandatory and voluntary payroll deductions. Gross earned income includes salaries, wages, tips, gratuities, commissions, incentive payments from work or training programs, payments made by an employer for regularly accrued vacation or sick leave, and profits from other activity earned by an individual's effort or labor. Gross earned income includes uniform and meal allowances if federal income tax is deducted from the allowance. Gross earned income includes flexible work benefits received from an employer if the employee has the option of receiving the benefit or benefits in cash. For self-employment, gross earned income is the nonexcluded income minus expenses for the business.\n\"Gross income\" is the sum of gross earned income and unearned income.\n\"Half-time student\" means a person who is enrolled in a graded or ungraded primary, intermediate, secondary, commissioner of education-selected high school equivalency preparatory, trade, technical, vocational, or postsecondary school, and who meets the school's standard of half-time attendance.\n\"Home\" means the primary place of residence used by a person as the base for day-to-day living and does not include locations used as mail drops.\n\"Homestead\" means the home that is owned by, and is the usual residence of, the assistance unit together with the surrounding property which is not separated from the home by intervening property owned by others. Public rights-of-way, such as roads which run through the surrounding property and separate it from the home, do not affect the exemption of the property. Homestead includes an asset that is not real property that the assistance unit uses as a home, such as a vehicle.\n\"Household\" means a group of persons who live together.\n\"Income\" means cash or in-kind benefit, whether earned or unearned, received by or available to an applicant or participant that is not property under section 256P.02.\n\"Initial eligibility\" means the determination of eligibility for an MFIP applicant.\n\"In-kind income\" means income, benefits, or payments which are provided in a form other than money or liquid assets, including the forms of goods, produce, services, privileges, or payments made on behalf of an applicant or participant by a third party.\n\"Inquiry\" means a communication to a county agency through mail, telephone, or in person, by which a person or authorized representative requests information about public assistance. The county agency shall also treat as an inquiry any communication in which a person requesting assistance offers information about the person's family circumstances that indicates that eligibility for public assistance may exist.\n\"Learning disabled,\" for purposes of an extension to the 60-month time limit under section 142G.42, subdivision 4, clause (3), means the person has a disorder in one or more of the psychological processes involved in perceiving, understanding, or using concepts through verbal language or nonverbal means. Learning disabled does not include learning problems that are primarily the result of visual, hearing, or motor disabilities; developmental disability; emotional disturbance; or due to environmental, cultural, or economic disadvantage.\n\"Legal custodian\" means any person who is under a legal obligation to provide care for a minor and who is in fact providing care for a minor. For an Indian child, \"custodian\" means any Indian person who has legal custody of an Indian child under tribal law or custom, under state law, or to whom temporary physical care, custody, and control has been transferred by the parent of the child, as provided in section 260.755, subdivision 10.\n\"Legally available\" means a person's right under the law to secure, possess, dispose of, or control income or property.\n\"Low-income home energy assistance program\" or \"LIHEAP\" means the program authorized under United States Code, title 42, chapter 94, subchapter II, sections 8621 to 8629, and administered by the Minnesota Department of Commerce.\n\"Medical assistance\" means the program established under chapter 256B and Title XIX of the Social Security Act.\n\"MFIP household report form\" means a form prescribed by the commissioner that a participant uses to report information to a county agency about changes in income and other circumstances.\n\"Migrant worker\" means a person who travels away from home on a regular basis, usually with a group of other laborers, to seek employment in an agriculturally related activity.\n\"Minnesota family investment program\" or \"MFIP\" means the assistance program authorized in this chapter.\n\"Minnesota supplemental aid\" or \"MSA\" means the program established under sections 256D.33 to 256D.54.\n\"Minor caregiver\" means a person who:\n(1) is under the age of 18;\n(2) has never been married or otherwise legally emancipated; and\n(3) is either the natural parent of a minor child living in the same household or is eligible for assistance paid to a pregnant woman.\n\"Minor child\" means a child who is living in the same home of a parent or other caregiver, is not the parent of a child in the home, and is either less than 18 years of age or is under the age of 19 years and is a full-time student in a secondary school or pursuing a full-time secondary level course of vocational or technical training designed to fit students for gainful employment.\n[See Note.]\n\"Monthly income test\" means the test used to determine ongoing eligibility and the assistance payment amount according to section 142G.16.\n\"Noncustodial parent\" means a minor child's parent who does not live in the same home as the child.\n\"Overpayment\" means the portion of an assistance payment issued by the county agency that is greater than the amount for which the assistance unit is eligible.\n\"Parent\" means a child's biological or adoptive parent who is legally obligated to support that child.\n[See Note.]\n(a) \"Participant\" includes any of the following:\n(1) a person who is currently receiving cash assistance or the food portion available through MFIP;\n(2) a person who withdraws a cash or food assistance payment by electronic transfer or receives and cashes an MFIP assistance check or food coupons and is subsequently determined to be ineligible for assistance for that period of time is a participant, regardless whether that assistance is repaid;\n(3) the caregiver relative and the minor child whose needs are included in the assistance payment;\n(4) a person in an assistance unit who does not receive a cash and food assistance payment because the case has been suspended from MFIP; and\n(5) a person who receives cash payments under family stabilization services under section 142G.75.\n(b) \"Participant\" does not include a person who fails to withdraw or access electronically any portion of the person's cash and food assistance payment by the end of the payment month, who makes a written request for closure before the first of a payment month and repays cash and food assistance electronically issued for that payment month within that payment month, or who returns any uncashed assistance check and food coupons and withdraws from the program.\n\"Participation requirements of TANF\" means activities and hourly requirements allowed under title IV-A of the federal Social Security Act.\n\"Payee\" means a person to whom an assistance payment is made payable.\n\"Payment month\" means the calendar month for which the assistance payment is paid.\n\"Person trained in domestic violence\" means an individual who works for an organization that is designated by the Minnesota Center for Crime Victims Services as providing services to victims of domestic violence, or a county staff person who has received similar specialized training, and includes any other person or organization designated by a qualifying organization under this section.\n\"Personal property\" means an item of value that is not real property, including the value of a contract for deed held by a seller, assets held in trust on behalf of members of an assistance unit, value of a prepaid burial, savings account, value of stocks and bonds, and value of retirement accounts.\n\"Probable fraud\" means the level of evidence that, if proven as fact, would establish that assistance has been wrongfully obtained.\n[See Note.]\n\"Prospective budgeting\" has the meaning given in section 256P.01, subdivision 9.\n\"Protective payee\" means a person other than the caregiver of an assistance unit who receives the monthly assistance payment on behalf of an assistance unit and is responsible to provide for the basic needs of the assistance unit to the extent of that payment.\n\"Qualified noncitizen\" means a person:\n(1) who was lawfully admitted for permanent residence according to United States Code, title 8;\n(2) who was admitted to the United States as a refugee according to United States Code, title 8; section 1157;\n(3) whose deportation is being withheld according to United States Code, title 8, sections 1231(b)(3), 1253(h), and 1641(b)(5);\n(4) who was paroled for a period of at least one year according to United States Code, title 8, section 1182(d)(5);\n(5) who was granted conditional entry according to United States Code, title 8, section 1153(a)(7);\n(6) who is a Cuban or Haitian entrant as defined in section 501(e) of the Refugee Education Assistance Act of 1980, United States Code, title 8, section 1641(b)(7);\n(7) who was granted asylum according to United States Code, title 8, section 1158;\n(8) who is a battered noncitizen according to United States Code, title 8, section 1641(c); or\n(9) who is a parent or child of a battered noncitizen according to United States Code, title 8, section 1641(c).\n\"Qualified professional\" means an individual as defined in section 256P.01, subdivision 6a.\n\"Real property\" means land and all buildings, structures, and improvements, or other fixtures on the land, belonging or appertaining to the land, and all mines, minerals, fossils, and trees on or under the land.\n\"Reasonable compensation\" means the value received in exchange for property transferred to another owner that is consistent with fair market value and equals or exceeds the seller's equity in the property, reduced by costs incurred in the sale.\n\"Recertification\" means the periodic review of eligibility factors to determine an assistance unit's continued eligibility.\n\"Recoupment\" means the action of the county agency to reduce a family's monthly assistance payment to recover overpayments caused by client or agency error and overpayments received while an appeal is pending.\n\"Recovery\" means actions taken by a county agency to reclaim the value of overpayments through voluntary repayment, recoupment from the assistance payment, court action, revenue recapture, or federal tax refund offset program (FTROP).\n[See Note.]\n\"Recurring income\" means a form of income which is:\n(1) received periodically, and may be received irregularly when receipt can be anticipated even though the date of receipt cannot be predicted; and\n(2) from the same source or of the same type that is received and budgeted in a prospective month.\n[See Note.]\n\"Retrospective budgeting\" means a method of determining the amount of the assistance payment in which the payment month is the second month after the budget month.\n\"Sanction\" means the reduction of a family's assistance payment by a specified percentage of the MFIP standard of need because: a nonexempt participant fails to comply with the requirements of sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71; a parental caregiver fails without good cause to cooperate with the child support enforcement requirements; or a participant fails to comply with other requirements of this chapter.\n\"Severe forms of trafficking in persons\" means: (1) sex trafficking in which a commercial sex act is induced by force, fraud, or coercion, or in which the person induced to perform the act has not attained 18 years of age; or (2) the recruitment, harboring, transportation, provision, or obtaining of a person for labor or services through the use of force, fraud, or coercion for the purposes of subjection to involuntary servitude, peonage, debt bondage, or slavery.\n\"Shelter costs\" means rent, manufactured home lot rental costs, or monthly principal, interest, insurance premiums, and property taxes due for mortgages or contracts for deed.\n[See Note.]\n\"Significant change\" means a decline in gross income of the amount of the disregard as defined in section 256P.03 or more from the income used to determine the grant for the current month.\n\"Supplemental Security Income\" or \"SSI\" means the program authorized under title XVI of the Social Security Act.\n\"SSI recipient\" means a person who receives at least $1 in SSI benefits, or who is not receiving an SSI benefit due to recoupment or a one-month suspension by the Social Security Administration due to excess income.\n\"Transitional standard\" means the basic standard for a family without earned income and is a combination of the cash portion and food portion as specified in section 142G.17, subdivision 5.\n\"Unearned income\" has the meaning given in section 256P.01, subdivision 8.\n\"Unemployment benefits\" means the insurance benefit paid to an unemployed worker under sections 268.03 to 268.23.\n\"Unrelated member\" means an individual in the household who does not meet the definition of an eligible caregiver.\n\"Vendor\" means a provider of goods or services.\n\"Vendor payment\" means a payment authorized by a county agency to a vendor.\n\"Verification\" means the process a county agency uses to establish the accuracy or completeness of information from an applicant, participant, third party, or other source as that information relates to program eligibility or an assistance payment.",
	"repealed": false
}