{
	"id": "43A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.21",
	"title": "43A.21 TRAINING PROGRAMS.",
	"text": "The commissioner, in coordination with the statewide ADA and disability employment director and chief inclusion officer, shall develop and interpret policy and administer and, to the extent possible, conduct programs in training and development for employees to, at a minimum:\n(1) promote individual, group and agency efficiency and effectiveness;\n(2) build employee capacity to deliver accessible and inclusive services to the public, including people with disabilities; and\n(3) support an inclusive work environment for employees with disabilities and employees of other protected classes.\n(a) The commissioner is responsible for developing and coordinating consistent training policy which shall be binding on all state agencies in the executive branch. The policies shall include conditions under which employees may receive or be assigned to training; internships and work-training programs; minimum and maximum training standards for employee participation and agency reporting requirements. At a minimum, state employees must receive annual training on statutes or policies related to:\n(1) Title II of the Americans with Disabilities Act;\n(2) the state's affirmative action policy;\n(3) equal opportunity employment; and\n(4) digital accessibility standards.\n(b) Career development training is a permissive subject of collective bargaining. Each appointing authority in the executive branch, including the Minnesota State Retirement System and the Teachers Retirement Association, is primarily responsible for planning, budgeting, conducting and evaluating training programs.\n(a) The commissioner or the commissioner's designee shall design and implement management training and development programs for the state service. The programs shall include but not be limited to mandatory training and development requirements for managers and supervisors. No person shall acquire permanent status in a management or supervisory position in the classified service until training and development requirements have been met.\n(b) All managers and supervisors must receive training on inclusive work environments, disability awareness, cultural competence, and other equity and diversity areas.\n(c) Agencies shall conduct an annual Americans with Disabilities Act self-assessment to ensure training programs meet the standards for universal design in learning.\nFor purposes of training and development, the commissioner is authorized to apply for and accept funds from any source including reimbursement charges from agencies for reasonable program costs. Funds received shall be deposited in the special revenue fund of the state treasury and shall be appropriated annually to the department for the purposes for which they are received.\n[Repealed, 1994 c 429 s 5]\nThe commissioner must ensure that all training content and platforms meet the accessibility standards under section 16E.03, subdivisions 2, clause (3), and 9. Reasonable accommodations must be implemented in a timely and appropriate manner to ensure that all state employees can participate in state-offered trainings. All state employees, including ADA coordinators and human resources staff, must have the training and resources to implement an accessible and inclusive workplace.",
	"repealed": false
}