{
	"id": "18C.531",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.531",
	"title": "18C.531 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 18C.531 to 18C.575.\n\"Agricultural liming materials\" means materials whose calcium or magnesium compounds, or both, account for an ENP of 20 percent or more and includes, but is not limited to, burnt lime, hydrated lime, industrial by-product, limestone, and marl.\n\"Brand\" means the term designating trademark, product name, or other specific designation under which individual agricultural liming material is offered for sale.\n\"Bulk\" means in nonpackaged form.\n\"Burnt lime\" means a material made from limestone that consists essentially of calcium oxide or a combination of calcium oxide with magnesium oxide.\n\"Calcium carbonate equivalent\" or \"CCE\" means the acid neutralizing capacity of an agricultural liming material expressed as a weight percentage of pure calcium carbonate. CCE is often referred to as the \"chemical purity\" of an agricultural liming material.\n[Repealed, 1996 c 310 s 1]\n\"Distributor\" means a person who imports, consigns, produces, or offers for sale, sells, barters, or otherwise supplies agricultural liming material in this state.\n\"ENP\" means effective neutralizing power and is an expression of the neutralizing value of liming material based on the calcium carbonate equivalent and fineness which is expressed as a dry weight percentage.\n\"Fineness\" means the percentage by weight of material that will pass sieves of specified sizes.\n\"Guaranteed analysis\" means the plant food claim in addition to claims for ENP or the ability to neutralize soil acidity.\n[Repealed, 1996 c 310 s 1]\n\"Hydrated lime\" means a material made from burnt lime that consists of calcium hydroxide or a combination of calcium hydroxide with either magnesium oxide, magnesium hydroxide, or both.\n\"Industrial by-product\" means an industrial waste or by-product or the by-product of a municipal water treatment process containing calcium or magnesium or both in a form that may neutralize soil acidity.\n\"Label\" means the display of all written, printed, or graphic matter on the immediate container or the statement accompanying a bulk shipment of agricultural liming material.\n\"Labeling\" means written, printed, or graphic matter on or accompanying agricultural liming material and advertisements, brochures, posters, and television, radio, or other announcements used in promoting their sale.\n\"Limestone\" means a material consisting of calcium carbonate or a combination of calcium carbonate with magnesium carbonate capable of neutralizing soil acidity.\n\"Marl\" means a granular or loosely consolidated earthy material composed largely of sea shell fragments and calcium carbonate.\n\"Official sample\" means a sample of agricultural liming material taken by the commissioner according to methods prescribed in section 18C.561.\n[Repealed, 1996 c 310 s 1]\n[Repealed, 1996 c 310 s 1]\n\"Plant food\" means one of the following plant nutrients or an additional plant nutrient that might be generally recognized as beneficial for plant growth: nitrogen, phosphorus, potassium, calcium, magnesium, sulfur, boron, chlorine, cobalt, copper, iron, manganese, molybdenum, sodium, and zinc.\n\"Producer\" means a person who operates a source of production or who blends an agricultural liming material to form a stockpile.\n\"Sell\" means:\n(1) selling or transferring ownership;\n(2) offering and exposing for sale, exchange, distribution, and transportation in and into this state;\n(3) possession with intent to sell, exchange, distribute, or transport in and into this state;\n(4) storing, carrying, and handling in aid of traffic, whether done in person or through an agent, employee, or others; or\n(5) receiving, accepting, and holding a consignment for sale.\n\"Source of production\" means a plant or facility where agricultural liming materials are produced or stockpiled.\n\"Stockpile\" means a supply of agricultural liming material stored for future use.\n[Repealed, 1996 c 330 s 23]\n[Repealed, 1996 c 310 s 1]\n\"Weight\" means the weight of material as offered for sale.",
	"repealed": false
}