{
	"id": "103B.3355",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.3355",
	"title": "103B.3355 WETLAND FUNCTIONS FOR DETERMINING PUBLIC VALUES.",
	"text": "(a) The public values of wetlands must be determined based upon the functions of wetlands for:\n(1) water quality, including filtering of pollutants to surface and groundwater, utilization of nutrients that would otherwise pollute public waters, trapping of sediments, shoreline protection, and utilization of the wetland as a recharge area for groundwater;\n(2) floodwater and stormwater retention, including the potential for flooding in the watershed, the value of property subject to flooding, and the reduction in potential flooding by the wetland;\n(3) public recreation and education, including hunting and fishing areas, wildlife viewing areas, and nature areas;\n(4) commercial uses, including wild rice and cranberry growing and harvesting and aquaculture;\n(5) fish, wildlife, native plant habitats;\n(6) low-flow augmentation;\n(7) carbon sequestration; and\n(8) other public uses.\n(b) The Board of Water and Soil Resources, in consultation with the commissioners of natural resources and agriculture and local government units, shall adopt rules establishing:\n(1) scientific methodologies for determining the functions of wetlands; and\n(2) criteria for determining the resulting public values of wetlands.\n(c) The methodologies and criteria established under this section or other methodologies and criteria that include the functions in paragraph (a) and are approved by the board, in consultation with the commissioners of natural resources and agriculture and local government units, must be used to determine the functions and resulting public values of wetlands in the state. The functions listed in paragraph (a) are not listed in order of priority.\n(d) Public value criteria established or approved by the board under this section do not apply in areas subject to local comprehensive wetland protection and management plans established under section 103G.2243.\n(e) The Board of Water and Soil Resources, in consultation with the commissioners of natural resources and agriculture and local government units, must identify areas of the state where preservation, enhancement, restoration, and establishment of wetlands would have high public value. The board, in consultation with the commissioners, must identify high priority areas for wetland replacement using available information relating to the factors listed in paragraph (a), the historic loss and abundance of wetlands, current applicable state and local government water management and natural resource plans, and studies using a watershed approach to identify current and future watershed needs. The board shall notify local units of government with water planning authority of these high priority areas. Designation of high priority areas is exempt from the rulemaking requirements of chapter 14, and section 14.386 does not apply. Designation of high priority areas is not effective until 30 days after publication in the State Register.\n(f) Local units of government, as part of a state-approved comprehensive local water management plan as defined in section 103B.3363, subdivision 3, a state-approved comprehensive watershed management plan as defined in section 103B.3363, subdivision 3a, or a state-approved local comprehensive wetland protection and management plan under section 103G.2243, may identify priority areas for wetland replacement and provide them for consideration under paragraph (e).",
	"repealed": false
}