{
	"id": "611.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.21",
	"title": "611.21 SERVICES OTHER THAN COUNSEL.",
	"text": "(a) Counsel appointed by the court for an indigent defendant, or representing a defendant who, at the outset of the prosecution, has an annual income not greater than 125 percent of the poverty line established under United States Code, title 42, section 9902(2), may file an ex parte application requesting investigative, expert, interpreter, or other services necessary to an adequate defense in the case. Upon finding, after appropriate inquiry in an ex parte proceeding, that the services are necessary and that the defendant is financially unable to obtain them, the court shall authorize counsel to obtain the services on behalf of the defendant. The court may establish a limit on the amount which may be expended or promised for such services. The court may, in the interests of justice, and upon a finding that timely procurement of necessary services could not await prior authorization, ratify such services after they have been obtained, but such ratification shall be given only in unusual situations. The court shall determine reasonable compensation for the services and direct payment by the county in which the prosecution originated, to the organization or person who rendered them, upon the filing of a claim for compensation supported by an affidavit specifying the time expended, services rendered, and expenses incurred on behalf of the defendant, and the compensation received in the same case or for the same services from any other source.\n(b) The compensation to be paid to a person for such service rendered to a defendant under this section, or to be paid to an organization for such services rendered by an employee, may not exceed $1,000, exclusive of reimbursement for expenses reasonably incurred, unless payment in excess of that limit is certified by the court as necessary to provide fair compensation for services of an unusual character or duration and the amount of the excess payment is approved by the chief judge of the district. The chief judge of the judicial district may delegate approval authority to an active district judge.\n(c) If the court denies authorizing counsel to obtain services on behalf of the defendant, the court shall make written findings of fact and conclusions of law that state the basis for determining that counsel may not obtain services on behalf of the defendant. When the court issues an order denying counsel the authority to obtain services, the defendant may appeal immediately from that order to the court of appeals and may request an expedited hearing.",
	"repealed": false
}