{
	"id": "571.932",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.932",
	"title": "571.932 PREJUDGMENT GARNISHMENT AFTER NOTICE AND HEARING.",
	"text": "A creditor seeking to obtain an order of garnishment in other than extraordinary circumstances shall proceed by motion. The motion must be accompanied by an affidavit setting forth in detail:\n(1) the basis and amount of the claim in the civil action; and\n(2) the facts that constitute one or more of the grounds for garnishment as specified in section 571.93, subdivision 1.\nThe creditor's motion to obtain an order of garnishment together with the creditor's affidavit and notice of hearing must be served in the manner prescribed for service of a summons in a civil action in district court unless that service is impracticable or would be ineffective and the court prescribes an alternative method of service calculated to provide actual notice to the debtor. If the debtor has already appeared in the action, the motion must be served in the manner prescribed for service of pleadings subsequent to the summons. The date of the hearing must be fixed in accordance with rule 6 of the Minnesota Rules of Civil Procedure for the District Courts, unless a different date is fixed by order of the court.\nThe notice of hearing served upon the debtor shall be signed by the creditor or the attorney for the creditor and shall provide, at a minimum, the following information in substantially the following language:\nNOTICE OF HEARING\nTO: (the debtor)\nA hearing will be held (insert place) on (insert date) at (insert time) to determine whether nonexempt property belonging to you will be garnished to secure a judgment that may be entered against you.\nYou may attend the court hearing alone or with an attorney. After you have presented your side of the matter, the court will decide whether your property should be garnished until the lawsuit which has been commenced against you is finally decided.\nIf the court directs the issuance of a garnishment summons while the lawsuit is pending, you may still keep the property until the lawsuit is decided if you file a bond in an amount set by the court.\nIF YOU DO NOT ATTEND THIS HEARING, THE COURT MAY ORDER YOUR NONEXEMPT PROPERTY TO BE GARNISHED.\nEXEMPTION NOTICE\nSome of your property may be exempt and cannot be garnished. The following is a list of some of the more common exemptions. It is not complete and is subject to section 550.37, and other state and federal laws. The dollar amounts contained in this list are subject to the provisions of section 550.37, subdivision 4a, at the time of the garnishment. If you have questions about an exemption, you should obtain competent legal advice.\n(1) A homestead or the proceeds from the sale of a homestead.\n(2) Household furniture, appliances, phonographs, radios, and televisions up to a total current value of $5,850.\n(3) A manufactured (mobile) home used as your home.\n(4) One motor vehicle currently worth less than $2,600 after deducting any security interests.\n(5) Farm machinery used by an individual principally engaged in farming, or tools, machines, or office furniture used in your business or trade. This exemption is limited to $13,000.\n(6) Relief based on need. This includes the Minnesota Family Investment Program (MFIP), Emergency Assistance (EA), Work First Program, Medical Assistance (MA), General Assistance (GA), Emergency General Assistance (EGA), Minnesota Supplemental Aid (MSA), MSA Emergency Assistance (MSA-EA), Supplemental Security Income (SSI), and Energy Assistance.\n(7) Social Security benefits.\n(8) Unemployment benefits, workers' compensation, or veterans' benefits.\n(9) An accident, disability or retirement pension or annuity.\n(10) Life insurance proceeds.\n(11) The earnings of your minor child.\n(12) Money from a claim for damage or destruction of exempt property (such as household goods, farm tools, business equipment, a manufactured (mobile) home, or a car).\nAn order for prejudgment garnishment may be issued only if the creditor has demonstrated the probability of success on the merits, and the creditor has stated facts that show the existence of at least one of the grounds stated in section 571.93, subdivision 1. However, even if those standards are met, the order may not be issued if:\n(1) the circumstances do not constitute a risk to collectibility of any judgment that may be entered; or\n(2)(i) the debtor has raised a defense to the merits of the creditor's claim or has raised a counterclaim in an amount equal to or greater than the claim and the defense or counterclaim is not frivolous; and\n(ii) the interests of the debtor cannot be adequately protected by a bond filed by the creditor pursuant to section 571.932, subdivision 6, if property is garnished; and\n(iii) the harm suffered by the debtor as a result of garnishment would be greater than the harm that would be suffered by the creditor if property is not attached.\nIf the creditor makes the showing prescribed by subdivision 3 but the court nevertheless determines that an order of garnishment should not be issued for the reasons set forth in subdivision 3, clause (2), the court shall enter a further order protecting the rights of the creditor to the extent possible. The order may require that the debtor post a bond in an amount set by the court, that the debtor make the property available for inspection from time to time, that the debtor be restrained from certain activities, including, but not limited to, selling, disposing, or otherwise encumbering property, or any other provision the court considers appropriate.\nAn order permitting prejudgment garnishment of property may be stayed up to three days to allow the debtor time to post a bond.\n(a) Before issuing an order of garnishment, the court shall require the creditor to post a bond in the penal sum of at least $500, conditioned that if judgment be given for the debtor or if the order is vacated, the creditor will pay all costs that may be awarded against the creditor and all damages caused by the garnishment. Damages may be awarded in a sum in excess of the bond only if, before the issuance of the order establishing the amount of the bond, the debtor specifically notified the creditor and the court of the likelihood that the debtor would suffer the specific damages, or the court finds that the creditor acted in bad faith in bringing or pursuing the garnishment proceeding. In establishing the amount of the bond, the court shall consider the value and nature of the property garnished, the method of retention or storage of the property, the potential harm to the debtor or any party, and other factors that the court considers appropriate. Nothing in this section modifies or restricts the application of section 549.20 or 549.211.\n(b) The court may at any time modify the amount of the bond upon its own motion or upon the motion of a party based on the value of the property garnished, the nature of the property attached, the methods of retention or storage of the property, the potential harm to the debtor or a party, or other factor that the court considers appropriate.\n(c) In lieu of filing a bond, either the creditor or the debtor may satisfy the bonding requirements by depositing cash, an irrevocable letter of credit, a cashier's check, or a certified check with the court.\nAn order for prejudgment garnishment after notice and hearing must:\n(1) contain the findings required by section 571.932, subdivision 3;\n(2) state with particularity the facts upon which the findings are made;\n(3) state that a debtor who attended the hearing was offered an opportunity to identify exempt property, without waiver of the right to claim exemption in property not identified at the hearing;\n(4) direct the issuance of a garnishment summons; and\n(5) specify the amount of the bond.",
	"repealed": false
}