{
	"id": "146B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.10",
	"title": "146B.10 FEES.",
	"text": "(a) The fee for the initial technician licensure application and biennial licensure renewal application is $420.\n(b) The fee for temporary technician licensure application is $240.\n(c) The fee for the temporary guest artist license application is $140.\n(d) The fee for a dual body art technician license application is $420.\n(e) The fee for a provisional establishment license application required in section 146B.02, subdivision 5, paragraph (c), is $1,500.\n(f) The fee for an initial establishment license application and the two-year license renewal period application required in section 146B.02, subdivision 2, paragraph (b), is $1,500.\n(g) The fee for a temporary body art establishment event permit application is $200.\n(h) The commissioner shall prorate the initial two-year technician license fee based on the number of months in the initial licensure period. The commissioner shall prorate the first renewal fee for the establishment license based on the number of months from issuance of the provisional license to the first renewal.\n(i) The fee for verification of licensure to other states is $25.\n(j) The fee to change an establishment name or establishment type, such as tattoo, piercing, or dual, is $50.\n(a) The fee for late submission of a technician renewal application is $150.\n(b) The fee for late submission of an establishment renewal application is $300.\n(a) The technical violation fee for practicing body art after a body art license has expired and before it is renewed is $200 for any part of the first month, plus $200 for any part of any subsequent month up to one year. Continued practice or operation after one year becomes a disciplinary violation.\n(b) The technical violation fee for practicing body art after a temporary body art license has expired and before it is renewed is $100 for any part of the first month, plus $100 for any part of any subsequent month up to six months. Continued practice or operation after six months becomes a disciplinary violation.\n(c) The technical violation fee for operating a body art establishment after the license has expired and before it is renewed is $300 for any part of the first month, plus $300 for any part of any subsequent month up to six months. Continued practice or operation after six months becomes a disciplinary violation.\nFees collected by the commissioner under this section must be deposited in the state government special revenue fund. All fees are nonrefundable.",
	"repealed": false
}