{
	"id": "84.871",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.871",
	"title": "84.871 MUFFLER REQUIREMENTS; PENALTIES.",
	"text": "(a) Except as provided under paragraph (c), a person may not operate a snowmobile unless:\n(1) the snowmobile is equipped with a muffler meeting the requirements of rules adopted by the commissioner; and\n(2) the snowmobile is equipped at all times with a muffler in good working order that blends the exhaust noise into the overall snowmobile noise and is in constant operation to prevent excessive or unusual noise.\n(b) A snowmobile operated, offered for sale, or sold in this state must have an exhaust system that does not emit or produce a sharp popping or crackling sound.\n(c) This section does not apply to organized races or similar competitive events held on:\n(1) private lands, with the permission of the owner, lessee, or custodian of the land;\n(2) public lands and water under the jurisdiction of the commissioner of natural resources, with the commissioner's permission; or\n(3) other public lands, with the consent of the public agency owning the land.\n(d) No person shall have for sale, sell, or offer for sale on any new snowmobile any muffler that fails to comply with the specifications required by the rules of the commissioner after the effective date of the rules.\n[Repealed, 1999 c 4 s 5]\nBeginning July 1, 2026, all after-market mufflers installed on a snowmobile must have a permanent stamp, clearly visible on the muffler, certified by the muffler manufacturer and stating that the muffler conforms to the snowmobile muffler noise limits specified by the rules of the commissioner.\n(a) A person who operates a snowmobile in violation of subdivision 1, paragraph (a) or (b), is guilty of a misdemeanor.\n(b) Notwithstanding section 609.101, subdivision 4, clause (2), the minimum fine for a person who operates a snowmobile in violation of subdivision 1, paragraph (a) or (b), must not be less than:\n(1) $250 for the first offense;\n(2) $500 for the second offense; and\n(3) $1,000 for the third and subsequent offenses.\n(c) A conservation officer or other licensed peace officer may issue a civil citation to a person who operates a snowmobile in violation of subdivision 1, paragraph (a) or (b). A civil citation under this subdivision must impose a penalty of:\n(1) $250 for the first offense;\n(2) $500 for the second offense; and\n(3) $1,000 for the third and subsequent offenses.",
	"repealed": false
}