{
	"id": "354.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.51",
	"title": "354.51 PAYMENTS TO RECEIVE CREDIT FOR PRIOR SERVICE; SHORTAGES IN MEMBER DEDUCTIONS.",
	"text": "No member is entitled to make payments in lieu of salary deductions to the retirement board to receive allowable service credit for any period of service rendered before that date for which employee contributions were not deducted from the member's salary, except as provided in subdivision 5, or section 354.50 or 354.53.\n[Repealed, 1974 c 289 s 59]\n[Repealed, 1974 c 289 s 59]\n[Repealed, 2008 c 349 art 5 s 37]\n(a) Except as provided in paragraph (b), in the event that full required member contributions are not deducted from the salary of a teacher, payment of shortages in member deductions on salary earned are the sole obligation of the employing unit and are payable by the employing unit upon notification by the executive director of the shortage. The amount of the shortage shall be paid with interest at the applicable annual rate or rates specified in section 356.59, subdivision 4, compounded annually, from the end of the fiscal year in which the shortage occurred to the end of the month in which payment is made and the interest must be credited to the fund. The employing unit shall also pay the employer contributions as specified in section 354.42, subdivisions 3 and 5 for the shortages. If the shortage payment is not paid by the employing unit within 60 days of notification, and if the executive director does not use the recovery procedure in section 354.512, the executive director shall certify the amount of the shortage to the applicable county auditor, who shall spread a levy in the amount of the shortage payment over the taxable property of the taxing district of the employing unit if the employing unit is supported by property taxes. Payment may not be made for shortages in member deductions on salary paid or payable under paragraph (b) or for shortages in member deductions for persons employed by the Minnesota State Colleges and Universities system in a faculty position or in an eligible unclassified administrative position and whose employment was less than 25 percent of a full academic year, exclusive of the summer session, for the applicable institution that exceeds the most recent 36 months.\n(b) For a person who is employed by the Minnesota State Colleges and Universities system in a faculty position or in an eligible unclassified administrative position and whose employment was less than 25 percent of a full academic year, exclusive of the summer session, for the applicable institution, upon the person's election under section 354B.211 of retirement coverage under this chapter, the shortage in member deductions on the salary for employment by the Minnesota State Colleges and Universities system institution of less than 25 percent of a full academic year, exclusive of the summer session, for the applicable institution for the most recent 36 months and the associated employer contributions must be paid by the Minnesota State Colleges and Universities system institution, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 4, compounded annually, from the end of the fiscal year in which the shortage occurred to the end of the month in which the Teachers Retirement Association coverage election is made. An individual electing coverage under this paragraph shall repay the amount of the shortage in member deductions, plus interest, through deduction from salary or compensation payments within the first year of employment after the election under section 354B.211, subject to the limitations in section 16D.16. The Minnesota State Colleges and Universities system may use any means available to recover amounts which were not recovered through deductions from salary or compensation payments. No payment of the shortage in member deductions under this paragraph may be made for a period longer than the most recent 36 months.",
	"repealed": false
}