{
	"id": "326B.437",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.437",
	"title": "326B.437 REDUCED PRESSURE BACKFLOW PREVENTION REBUILDERS AND TESTERS.",
	"text": "(a) No person shall perform or offer to perform the installation, maintenance, repair, replacement, or rebuilding of reduced pressure zone backflow prevention assemblies unless the person obtains a plumbing contractor's license. An individual shall not engage in the testing, maintenance, repair, or rebuilding of reduced pressure zone backflow prevention assemblies, as regulated by the Plumbing Code, unless the individual is certified by the commissioner as a backflow prevention rebuilder.\n(b) An individual shall not engage in testing of a reduced pressure zone backflow prevention assembly, as regulated by the Plumbing Code, unless the individual possesses a backflow prevention rebuilder certificate or is certified by the commissioner as a backflow prevention tester.\n(c) Certificates are issued for an initial period of two years and must be renewed every two years thereafter for as long as the certificate holder installs, maintains, repairs, rebuilds, or tests reduced pressure zone backflow prevention assemblies. For purposes of calculating fees under section 326B.092, an initial or renewed backflow prevention rebuilder or tester certificate shall be considered an entry level license.\n(d) The Plumbing Board shall adopt expedited rules under section 14.389 that are related to the certification of backflow prevention rebuilders and backflow prevention testers. Section 326B.13, subdivision 8, does not apply to these rules. Notwithstanding the 18-month limitation under section 14.125, this authority expires on December 31, 2014.\n(e) The department shall recognize certification programs that are a minimum of 16 contact hours and include the passage of an examination. The examination must consist of a practical and a written component. This paragraph expires when the Plumbing Board adopts rules under paragraph (d).",
	"repealed": false
}