{
	"id": "299C.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.065",
	"title": "299C.065 UNDERCOVER BUY FUND; WITNESS AND VICTIM PROTECTION.",
	"text": "The commissioner of public safety shall make grants to local officials for the following purposes:\n(1) the cooperative investigation of cross jurisdictional criminal activity relating to the possession and sale of controlled substances;\n(2) receiving or selling stolen goods;\n(3) participating in gambling activities in violation of section 609.76;\n(4) violations of section 609.322 or any other state or federal law prohibiting the recruitment, transportation, or use of juveniles for purposes of prostitution;\n(5) for partial reimbursement of local costs associated with unanticipated, intensive, long-term, multijurisdictional criminal investigations that exhaust available local resources, except that the commissioner may not reimburse the costs of a local investigation involving a child who is reported to be missing and endangered unless the law enforcement agency complies with section 299C.53 and the agency's own investigative policy; and\n(6) for partial reimbursement of local costs associated with criminal investigations into the activities of violent criminal gangs and gang members.\n(a) A witness and victim protection fund is created under the administration of the commissioner of public safety. The commissioner may make grants to local officials to provide for the relocation or other protection of a victim, witness, or potential witness who is involved in a criminal prosecution and who the commissioner has reason to believe is or is likely to be the target of a violent crime or a violation of section 609.498 or 609.713, in connection with that prosecution. The awarding of grants under this subdivision is not limited to the crimes and investigations described in subdivision 1.\n(b) The commissioner may award grants for any of the following actions in connection with the protection of a witness or victim under this subdivision:\n(1) to provide suitable documents to enable the person to establish a new identity or otherwise protect the person;\n(2) to provide housing for the person;\n(3) to provide for the transportation of household furniture and other personal property to the person's new residence;\n(4) to provide the person with a payment to meet basic living expenses for a time period the commissioner deems necessary;\n(5) to assist the person in obtaining employment; and\n(6) to provide other services necessary to assist the person in becoming self-sustaining.\nA county sheriff or the chief administrative officer of a municipal police department may apply to the commissioner of public safety for a grant for any of the purposes described in subdivision 1 or 1a, on forms and pursuant to procedures developed by the superintendent. For grants under subdivision 1, the application shall describe the type of intended criminal investigation, an estimate of the amount of money required, and any other information the superintendent deems necessary.\nA report shall be made to the commissioner at the conclusion of an investigation for which a grant was made under subdivision 1 stating (1) the number of persons arrested, (2) the nature of charges filed against them, (3) the nature and value of controlled substances or contraband purchased or seized, (4) the amount of money paid to informants during the investigation, and (5) a separate accounting of the amount of money spent for expenses, other than \"buy money,\" of bureau and local law enforcement personnel during the investigation. The commissioner shall prepare and submit to the chairs of the committees in the senate and house of representatives with jurisdiction over criminal justice policy by January 1 of each even-numbered year a report of investigations receiving grants under subdivision 1.\nThe head of a law enforcement agency that receives a grant under subdivision 1a shall file a report with the commissioner at the conclusion of the case detailing the specific purposes for which the money was spent. The commissioner shall prepare and submit to the chairs of the committees in the senate and house of representatives with jurisdiction over criminal justice policy by January 1 of each even-numbered year a summary report of witness assistance services provided under this section.\nAn application to the commissioner for money is a confidential record. Information within investigative files that identifies or could reasonably be used to ascertain the identity of assisted witnesses, sources, or undercover investigators is a confidential record. A report at the conclusion of an investigation is a public record, except that information in a report pertaining to the identity or location of an assisted witness is private data.",
	"repealed": false
}