{
	"id": "245.4862",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4862",
	"title": "245.4862 MENTAL HEALTH URGENT CARE AND PSYCHIATRIC CONSULTATION.",
	"text": "The commissioner shall include mental health urgent care and psychiatric consultation services as part of, but not limited to, the redesign of six community-based behavioral health hospitals and the Anoka-Metro Regional Treatment Center. These services must not duplicate existing services in the region, and must be implemented as specified in subdivisions 3 to 7.\nFor purposes of this section:\n(a) Mental health urgent care includes:\n(1) initial mental health screening;\n(2) mobile crisis assessment and intervention;\n(3) rapid access to psychiatry, including psychiatric evaluation, initial treatment, and short-term psychiatry;\n(4) nonhospital crisis stabilization residential beds; and\n(5) health care navigator services that include, but are not limited to, assisting uninsured individuals in obtaining health care coverage.\n(b) Psychiatric consultation services includes psychiatric consultation to primary care practitioners.\nThe commissioner shall develop rapid access to psychiatric services based on the following criteria:\n(1) the individuals who receive the psychiatric services must be at risk of hospitalization and otherwise unable to receive timely services;\n(2) where clinically appropriate, the service may be provided via interactive video where the service is provided in conjunction with an emergency room, a local crisis service, or a primary care or behavioral care practitioner; and\n(3) the commissioner may integrate rapid access to psychiatry with the psychiatric consultation services in subdivision 4.\n(a) The commissioner shall establish a collaborative psychiatric consultation service based on the following criteria:\n(1) the service may be available via telephone, interactive video, email, or other means of communication to emergency rooms, local crisis services, mental health professionals, and primary care practitioners, including pediatricians;\n(2) the service shall be provided by a multidisciplinary team including, at a minimum, a child and adolescent psychiatrist, an adult psychiatrist, and a licensed clinical social worker;\n(3) the service shall include a triage-level assessment to determine the most appropriate response to each request, including appropriate referrals to other mental health professionals, as well as provision of rapid psychiatric access when other appropriate services are not available;\n(4) the first priority for this service is to provide the consultations required under section 256B.0625, subdivision 13j; and\n(5) the service must encourage use of cognitive and behavioral therapies and other evidence-based treatments in addition to or in place of medication, where appropriate.\n(b) The commissioner shall appoint an interdisciplinary work group to establish appropriate medication and psychotherapy protocols to guide the consultative process, including consultation with the Drug Utilization Review Board, as provided in section 256B.0625, subdivision 13j.\n(a) The commissioner may phase in the availability of mental health urgent care services based on the limits of appropriations and the commissioner's determination of level of need and cost-effectiveness.\n(b) For subdivisions 3 and 4, the first phase must focus on adults in Hennepin and Ramsey Counties and children statewide who are affected by section 256B.0625, subdivision 13j, and must include tracking of costs for the services provided and associated impacts on utilization of inpatient, emergency room, and other services.\nThe commissioner shall maximize use of available health care coverage for the services provided under this section. The commissioner's responsibility to provide these services for individuals without health care coverage must not exceed the appropriations for this section.\nTo implement this section, the commissioner shall select the structure and funding method that is the most cost-effective for each county or group of counties. This may include grants, contracts, service agreements with the Direct Care and Treatment executive board, and public-private partnerships. Where feasible, the commissioner shall make any grants under this section a part of the integrated adult mental health initiative grants under section 245.4661.",
	"repealed": false
}