{
	"id": "326B.106",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.106",
	"title": "326B.106 GENERAL POWERS OF COMMISSIONER OF LABOR AND INDUSTRY.",
	"text": "(a) Subject to paragraphs (c) and (d) and sections 326B.101 to 326B.194, the commissioner shall by rule and in consultation with the Construction Codes Advisory Council establish a code of standards for the construction, reconstruction, alteration, and repair of buildings, governing matters of structural materials, design and construction, fire protection, health, sanitation, and safety, including design and construction standards regarding heat loss control, illumination, and climate control. The code must also include duties and responsibilities for code administration, including procedures for administrative action, penalties, and suspension and revocation of certification. The code must conform insofar as practicable to model building codes generally accepted and in use throughout the United States, including a code for building conservation. In the preparation of the code, consideration must be given to the existing statewide specialty codes presently in use in the state. Model codes with necessary modifications and statewide specialty codes may be adopted by reference. The code must be based on the application of scientific principles, approved tests, and professional judgment. To the extent possible, the code must be adopted in terms of desired results instead of the means of achieving those results, avoiding wherever possible the incorporation of specifications of particular methods or materials. To that end the code must encourage the use of new methods and new materials. Except as otherwise provided in sections 326B.101 to 326B.194, the commissioner shall administer and enforce the provisions of those sections.\n(b) The commissioner shall develop rules addressing the plan review fee assessed to similar buildings without significant modifications including provisions for use of building systems as specified in the industrial/modular program specified in section 326B.194. Additional plan review fees associated with similar plans must be based on costs commensurate with the direct and indirect costs of the service.\n(c) Beginning with the 2018 edition of the model building codes and every six years thereafter, the commissioner shall review the new model building codes and adopt the model codes as amended for use in Minnesota, within two years of the published edition date. The commissioner may adopt amendments to the building codes prior to the adoption of the new building codes to advance construction methods, technology, or materials, or, where necessary to protect the health, safety, and welfare of the public, or to improve the efficiency or the use of a building.\n(d) Notwithstanding paragraph (c), the commissioner shall act on each new model residential energy code and the new model commercial energy code in accordance with federal law for which the United States Department of Energy has issued an affirmative determination in compliance with United States Code, title 42, section 6833. The commissioner may adopt amendments prior to adoption of the new energy codes, as amended for use in Minnesota, to advance construction methods, technology, or materials, or, where necessary to protect the health, safety, and welfare of the public, or to improve the efficiency or use of a building.\n(e) Beginning in 2024, the commissioner shall act on the new model commercial energy code by adopting each new published edition of ASHRAE 90.1 or a more efficient standard. The commercial energy code in effect in 2036 and thereafter must achieve an 80 percent reduction in annual net energy consumption or greater, using the ASHRAE 90.1-2004 as a baseline. The commissioner shall adopt commercial energy codes from 2024 to 2036 that incrementally move toward achieving the 80 percent reduction in annual net energy consumption. By January 15 of the year following each new code adoption, the commissioner shall make a report on progress under this section to the legislative committees with jurisdiction over the energy code.\n(f) Nothing in this section shall be interpreted to limit the ability of a public utility to offer code support programs, or to claim energy savings resulting from such programs, through its energy conservation and optimization plans approved by the commissioner of commerce under section 216B.241 or an energy conservation and optimization plan filed by a consumer-owned utility under section 216B.2403.\n(g) Beginning in 2026, the commissioner shall act on the new model residential energy code by adopting each new published edition of the International Energy Conservation Code or a more efficient standard. The residential energy code in effect in 2038 and thereafter must achieve a 70 percent reduction in annual net energy consumption or greater, using the 2006 International Energy Conservation Code State Level Residential Codes Energy Use Index for Minnesota, as published by the United States Department of Energy's Building Energy Codes Program, as a baseline. The commissioner shall adopt residential energy codes from 2026 to 2038 that incrementally move toward achieving the 70 percent reduction in annual net energy consumption. By January 15 of the year following each new code adoption, the commissioner shall submit a report on progress under this section to the legislative committees with jurisdiction over the energy code.\n[Renumbered 326B.107, subdivision 1]\n[Renumbered 326B.107, subd 2]\n[Renumbered 326B.107, subd 3]\n[Renumbered 326B.107, subd 4]\n[Renumbered 326B.107, subd 5]\n[Renumbered 326B.107, subd 6]\nThe commissioner may direct the state building official to assist a community that has been affected by a natural disaster with building evaluation and other activities related to building codes.\nThe commissioner shall administer and enforce the provisions of the code relating to elevators statewide, except as provided for under section 326B.184, subdivision 4.\nUnder the direction and supervision of the commissioner, the provisions of the code relating to electrical installations, plumbing, boilers, high pressure steam piping and appurtenances, and ammonia refrigeration piping shall be enforced by the Department of Labor and Industry. Fees for inspections conducted by the commissioner shall be paid in accordance with the rules of the department. Under direction of the commissioner of public safety, the state fire marshal shall enforce the State Fire Code as provided in chapter 299F. The commissioner shall adopt amendments to the mechanical code portion of the State Building Code to implement standards for process piping.\n(a) Space for commuter vans. The code must require that any parking ramp or other parking facility constructed in accordance with the code include an appropriate number of spaces suitable for the parking of motor vehicles having a capacity of seven to 16 persons and which are principally used to provide prearranged commuter transportation of employees to or from their place of employment or to or from a transit stop authorized by a local transit authority.\n(b) Smoke detection devices. The code must require that all dwellings, lodging houses, apartment houses, and hotels as defined in section 299F.362 comply with the provisions of section 299F.362.\n(c) Doors in nursing homes and hospitals. The State Building Code may not require that each door entering a sleeping or patient's room from a corridor in a nursing home or hospital with an approved complete standard automatic fire extinguishing system be constructed or maintained as self-closing or automatically closing.\n(d) Child care facilities in churches; ground level exit. A licensed day care center serving fewer than 30 preschool age persons and which is located in a belowground space in a church building is exempt from the State Building Code requirement for a ground level exit when the center has more than two stairways to the ground level and its exit.\n(e) Family and group family day care. Until the legislature enacts legislation specifying appropriate standards, the definition of dwellings constructed in accordance with the International Residential Code as adopted as part of the State Building Code applies to family and group family day care homes licensed by the Department of Children, Youth, and Families under Minnesota Rules, chapter 9502.\n(f) Enclosed stairways. No provision of the code or any appendix chapter of the code may require stairways of existing multiple dwelling buildings of two stories or less to be enclosed.\n(g) Double cylinder dead bolt locks. No provision of the code or appendix chapter of the code may prohibit double cylinder dead bolt locks in existing single-family homes, townhouses, and first floor duplexes used exclusively as a residential dwelling. Any recommendation or promotion of double cylinder dead bolt locks must include a warning about their potential fire danger and procedures to minimize the danger.\n(h) Relocated residential buildings. A residential building relocated within or into a political subdivision of the state need not comply with the State Energy Code or section 326B.439 provided that, where available, an energy audit is conducted on the relocated building.\n(i) Automatic garage door opening systems. The code must require all residential buildings as defined in section 325F.82 to comply with the provisions of sections 325F.82 and 325F.83.\n(j) Exterior wood decks, patios, and balconies. The code must permit the decking surface and upper portions of exterior wood decks, patios, and balconies to be constructed of (1) heartwood from species of wood having natural resistance to decay or termites, including redwood and cedars, (2) grades of lumber which contain sapwood from species of wood having natural resistance to decay or termites, including redwood and cedars, or (3) treated wood. The species and grades of wood products used to construct the decking surface and upper portions of exterior decks, patios, and balconies must be made available to the building official on request before final construction approval.\n(k) Bioprocess piping and equipment. No permit fee for bioprocess piping may be imposed by municipalities under the State Building Code, except as required under section 326B.92, subdivision 1. Permits for bioprocess piping shall be according to section 326B.92 administered by the Department of Labor and Industry. All data regarding the material production processes, including the bioprocess system's structural design and layout, are nonpublic data as provided by section 13.7911.\n(l) Use of ungraded lumber. The code must allow the use of ungraded lumber in geographic areas of the state where the code did not generally apply as of April 1, 2008, to the same extent that ungraded lumber could be used in that area before April 1, 2008.\n(m) Window cleaning safety. The commissioner shall adopt rules, using the expedited rulemaking process in section 14.389, requiring window cleaning safety features that comply with a nationally recognized standard as part of the State Building Code. Window cleaning safety features shall be provided for all windows on:\n(1) new buildings where determined by the code; and\n(2) existing buildings undergoing alterations where both of the following conditions are met:\n(i) the windows do not currently have safe window cleaning features; and\n(ii) the proposed work area being altered can include provisions for safe window cleaning.\n(n) Adult-size changing facilities. The commissioner shall adopt rules requiring adult-size changing facilities as part of the State Building Code.\nThe code must require suitable space for the separation, collection, and temporary storage of recyclable materials within or adjacent to new or significantly remodeled structures that contain 1,000 square feet or more. Residential structures with fewer than four dwelling units are exempt from this subdivision.\nThe commissioner of labor and industry shall adopt rules for radon control as part of the State Building Code for all new residential buildings. These rules shall incorporate the radon control methods found in the International Residential Code appendix as the model language, with necessary amendments to coordinate with the other adopted construction codes in Minnesota.\n(a) The commissioner of labor and industry shall adopt rules for window fall prevention devices as part of the State Building Code. Window fall prevention devices include, but are not limited to, safety screens, hardware, guards, and other devices that comply with the standards established by the commissioner of labor and industry. The rules shall require compliance with standards for window fall prevention devices developed by ASTM International, contained in the International Building Code as the model language with amendments deemed necessary to coordinate with the other adopted building codes in Minnesota. The rules shall establish a scope that includes the applicable building occupancies, and the types, locations, and sizes of windows that will require the installation of fall devices.\n(b) In one- and two-family dwellings and townhouses, as defined in Minnesota Rules, part 1309.0202, subpart 1, window fall prevention devices are not required when: (1) the lowest part of the window opening of an operable window is a minimum of 24 inches above the finished floor of the room in which the window is located; or (2) the lowest part of the opening of an operable window is located 72 inches or less above the exterior grade below.\n[Renumbered 326B.107, subd 7]\n(a) Public buildings. The code must require new public buildings and remodeled portions of existing public buildings to be accessible to and usable by persons with disabilities.\n(b) Leased space. No agency of the state may lease space for agency operations in a non-state-owned building unless the building satisfies the requirements of the State Building Code for accessibility by persons with disabilities, or is eligible to display the state symbol of accessibility. This limitation applies to leases of 30 days or more for space of at least 1,000 square feet.\n(c) Meetings or conferences. Meetings or conferences for the public or for state employees which are sponsored in whole or in part by a state agency must be held in buildings that meet the State Building Code requirements relating to accessibility for persons with disabilities. This subdivision does not apply to any classes, seminars, or training programs offered by the Minnesota State Colleges and Universities or the University of Minnesota. Meetings or conferences intended for specific individuals none of whom need the accessibility features for persons with disabilities specified in the State Building Code need not comply with this subdivision unless a person with a disability gives reasonable advance notice of an intent to attend the meeting or conference. When sign language interpreters will be provided, meetings or conference sites must be chosen which allow participants who are deaf or hard-of-hearing to see the sign language interpreters clearly.\n(d) Exemptions. The commissioner may grant an exemption from the requirements of paragraphs (b) and (c) in advance if an agency has demonstrated that reasonable efforts were made to secure facilities which complied with those requirements and if the selected facilities are the best available for access for persons with disabilities. Exemptions shall be granted using criteria developed by the commissioner in consultation with the Council on Disability.\n(e) Symbol indicating access. The wheelchair symbol adopted by Rehabilitation International's Eleventh World Congress is the state symbol indicating buildings, facilities, and grounds which are accessible to and usable by persons with disabilities. In the interests of uniformity, this symbol is the sole symbol for display in or on all public or private buildings, facilities, and grounds which qualify for its use. The secretary of state shall obtain the symbol and keep it on file. No building, facility, or grounds may display the symbol unless it is in compliance with the rules adopted by the commissioner under subdivision 1. Before any rules are proposed for adoption under this paragraph, the commissioner shall consult with the Council on Disability. Rules adopted under this paragraph must be enforced in the same way as other accessibility rules of the State Building Code.\n[Repealed, 2015 c 54 art 5 s 16]\nAll rooms in the State Office Building and in the Capitol that are used by the house of representatives or the senate for legislative hearings, and the public galleries overlooking the house of representatives and senate chambers, must be fitted with assistive listening devices for people with hearing loss. Each hearing room and the public galleries must have a sufficient number of receivers available so that members of the public who have hearing loss may participate in the committee hearings and public sessions of the house of representatives and senate.\nThe standards concerning heat loss, illumination, and climate control adopted pursuant to subdivision 1, shall require that electrical service to individual dwelling units in buildings containing two or more units be separately metered, with individual metering readily accessible to the individual occupants. The standards authorized by this subdivision shall only apply to buildings constructed after the effective date of the amended standards. Buildings intended for occupancy primarily by persons who are 62 years of age or older or disabled, supportive housing, or buildings that contain a majority of units not equipped with complete kitchen facilities, shall be exempt from the provisions of this subdivision. For purposes of this section, \"supportive housing\" means housing made available to individuals and families with multiple barriers to obtaining and maintaining housing, including those who are formerly homeless or at risk of homelessness and those who have mental illness, substance use disorder, debilitating disease, or a combination of these conditions.\nWhen issuing permits in compliance with the State Building Code to a residential building contractor, residential remodeler, manufactured home installer, or residential roofer licensed under section 326B.805, municipalities must verify lead certification qualifications of the licensee required under subdivision 14 for renovations performed on residential property constructed prior to 1978. Municipalities may charge a surcharge for verification of this certification under section 326B.815, subdivision 2. The state or any political subdivision must not impose a fee for the same or similar certification as required under Code of Federal Regulations, title 40, section 745.89.\nA residential building contractor, residential remodeler, manufactured home installer, or residential roofer licensed under section 326B.805 performing renovation as defined by Code of Federal Regulations, title 40, section 745.83, on a residential structure constructed prior to 1978 must be certified in accordance with Code of Federal Regulations, title 40, section 745.89, unless the property has been determined to meet an exemption under Code of Federal Regulations, title 40, section 745.82. Before performing the renovations as defined by Code of Federal Regulations, title 40, section 745.83, on a residential structure constructed prior to 1978, a licensee working on the structure must be able to provide to the commissioner information so that proof of certification can be obtained as required in this subdivision. The department shall provide on its website a link to the United States Environmental Protection Agency website for verification of certification of a licensee.\nNotwithstanding any other law to the contrary, the code must require that translucent panels or other skylights without raised curbs shall be supported to have equivalent load-bearing capacity as the surrounding roof.\nThe code shall require a minimum number of electric vehicle ready spaces, electric vehicle capable spaces, and electric vehicle charging stations either within or adjacent to new commercial and multifamily structures that provide on-site parking facilities. Residential structures with fewer than four dwelling units are exempt from this subdivision.\nNo provision of the code or appendix chapter of the code may prohibit or otherwise limit the use of a refrigerant designated as acceptable for use in accordance with United States Code, title 42, section 7671k, provided any equipment containing the refrigerant is listed and installed in full compliance with all applicable requirements, safety standards, and use conditions imposed pursuant to such a designation or as otherwise required by law.",
	"repealed": false
}