{
	"id": "327.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.31",
	"title": "327.31 DEFINITIONS.",
	"text": "Unless clearly indicated otherwise by the context, the terms defined by this section have the meanings given them.\n\"Authorized representative\" means any person, firm or corporation, or employee thereof, approved or hired by the commissioner of labor and industry to perform inspection services.\n\"Manufactured Home Building Code\" means, for manufactured homes manufactured after July 1, 1972, and prior to June 15, 1976, the standards code promulgated by the American National Standards Institute and identified as ANSI A119.1, including all revisions thereof in effect on May 21, 1971, or the provisions of the National Fire Protection Association and identified as NFPA 501B, and further revisions adopted by the commissioner of labor and industry.\n\"Manufactured Home Building Code\" means, for manufactured homes constructed after June 14, 1976, the manufactured home construction and safety standards promulgated by the United States Department of Housing and Urban Development which are in effect at the time of the manufactured home's manufacture.\n\"Commissioner\" means the commissioner of labor and industry.\n\"Dealer\" means any person engaged in the sale, leasing, or distribution of a manufactured home primarily to persons who purchase or lease for other than resale.\n\"Manufactured home\" means a structure, transportable in one or more sections, which in the traveling mode, is eight body feet or more in width or 40 body feet or more in length, or, when erected on site, is 320 or more square feet, and which is built on a permanent chassis and designed to be used as a dwelling with or without a permanent foundation when connected to the required utilities, and includes the plumbing, heating, air conditioning, and electrical systems contained therein; except that the term includes any structure which meets all the requirements and with respect to which the manufacturer voluntarily files a certification required by the secretary and complies with the standards established under this chapter.\n\"Individual\" means a human being.\n\"Person\" means any individual, limited liability company, corporation, partnership, incorporated or unincorporated association, sole proprietorship, joint stock company, or any other legal or commercial entity.\n\"Seal\" means a device or insignia issued by the commissioner to be displayed on the manufactured home to evidence compliance with the Manufactured Home Building Code.\n\"Support system\" means any foundation system or other structural method used for the purpose of supporting a manufactured home at the site of occupancy.\n\"Anchoring system\" means any method used for the purpose of securing the manufactured home to a foundation system or the ground.\n\"Manufactured home installer\" means any person, firm, or corporation that installs or repairs a manufactured home for others at the site of occupancy.\n\"Installation seal\" means a device or insignia issued by the commissioner to a manufactured home installer to be displayed on the manufactured home to evidence compliance with the commissioner's rules pertaining to manufactured home installations.\n\"Label\" means the approved form of certification required by the secretary or its agents to be affixed to each transportable section of each manufactured home manufactured for sale, after June 14, 1976, to a purchaser in the United States.\n\"Manufacturer\" means any person engaged in manufacturing or assembling manufactured homes, including any person engaged in importing manufactured homes for sale.\n\"Purchaser\" means the first individual purchasing a manufactured home in good faith for purposes other than resale.\n\"Distributor\" means any person engaged in the sale and distribution of manufactured homes for resale.\n\"Installation\" of a manufactured home means installation or reinstallation, at the site of occupancy, of all portions of a manufactured home, connection of the manufactured home to existing utility connections and installation of support and/or anchoring systems.\n\"Secretary\" means the secretary of the United States Department of Housing and Urban Development or the head of any successor agency with responsibility for enforcement of federal laws relating to manufactured homes.\n\"Manufactured home accessory structure\" means a factory built building or structure which is an addition or supplement to a manufactured home and, when installed, becomes a part of the manufactured home.\n\"Foundation system\" means a permanent foundation constructed in conformance with the State Building Code.\n\"Used manufactured home\" means a home being offered for sale not less than 24 months after the first purchaser took legal ownership or possession of the home.\n\"Seller\" means either the homeowner, manufactured home retailer or dealer, broker, or limited dealer or retailer.\nFor the purposes of this section, \"modular home\" means a one- or two-family dwelling constructed in accordance with applicable standards adopted in Minnesota Rules, chapter 1360 or 1361, and attached to a foundation designed to the State Building Code.",
	"repealed": false
}