{
	"id": "181A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.12",
	"title": "181A.12 PENALTIES.",
	"text": "(a) Any employer who hinders or delays the department or its authorized representative in the performance of its duties under sections 181A.01 to 181A.12 or refuses to admit the commissioner or an authorized representative to any place of employment or refuses to make certificates or lists available as required by sections 181A.01 to 181A.12, or otherwise violates any provisions of sections 181A.01 to 181A.12 or any rules issued pursuant thereto shall be assessed a fine to be paid to the commissioner for deposit in the general fund. The fine may be recovered in a civil action in the name of the department brought in the district court of the county where the violation is alleged to have occurred or the district court where the commissioner has an office. Fines are up to the amounts as follows for each violation:\n(b) An employer who refuses to make certificates or lists available as required by sections 181A.01 to 181A.12 shall be assessed a $500 fine.\n(c) Notwithstanding the factors in section 14.045, subdivision 3, the commissioner need only consider the size of the business of the employer, the gravity of the violation, and the history of previous violations when determining the total amount of fines to issue under this subdivision.\nAn employer or other person violating any provision of sections 181A.01 to 181A.12 excluding section 181A.04, subdivision 6, or any rules issued pursuant thereto or assisting another in such violation is guilty of a misdemeanor.\nAn employer who engages in repeated violations of sections 181A.01 to 181A.12 excluding section 181A.04, subdivision 6, is also guilty of a gross misdemeanor. An employer who engages in a single violation of sections 181A.01 to 181A.12 excluding section 181A.04, subdivision 6, is guilty of a gross misdemeanor if the violation results in the death of the minor or substantial bodily harm to the minor. For purposes of this subdivision, \"substantial bodily harm\" has the meaning given in section 609.02, subdivision 7a.\nAn employer who employs a minor in violation of section 181A.04, subdivision 5, may be liable to the minor for an amount equal to the minor's regular rate of pay for all hours worked in violation of section 181A.04, subdivision 5, as liquidated damages, in addition to the wages earned by the minor.\nAn employer shall not discharge, discipline, penalize, interfere with, threaten, restrain, coerce, or otherwise retaliate or discriminate against an employee for asserting rights or remedies under sections 181A.01 to 181A.12 or any rules promulgated under section 181A.09, including but not limited to filing a complaint with the department, informing the employer of the employee's intention to file a complaint, or participating in an investigation by the department. In addition to any other remedies provided by law, the commissioner may order an employer in violation of this subdivision to provide back pay, compensatory damages, reinstatement, and any other appropriate relief to the aggrieved employee.",
	"repealed": false
}