{
	"id": "289A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.25",
	"title": "289A.25 PAYMENT OF ESTIMATED TAX BY INDIVIDUALS, TRUSTS, S CORPORATIONS, OR PARTNERSHIPS.",
	"text": "An individual, trust, S corporation, or partnership must, when prescribed in subdivision 3, paragraph (b), make payments of estimated tax. For individuals, the term \"estimated tax\" means the amount the taxpayer estimates is the sum of the taxes imposed by chapter 290 for the taxable year. For trusts, S corporations, and partnerships, the term estimated tax means the amount the taxpayer estimates is the sum of the taxes for the taxable year imposed by chapter 290 and the composite income tax imposed by section 289A.08, subdivision 7. If the individual is an infant or incompetent person, the payments must be made by the individual's guardian. If joint payments on estimated tax are made but a joint return is not made for the taxable year, the estimated tax for that year may be treated as the estimated tax of either spouse or may be divided between them.\n(a) In the case of any underpayment of estimated tax by a taxpayer, except as provided in subdivision 6 or 7, there must be added to and become a part of the taxes imposed by chapter 290, for the taxable year an amount determined at the rate specified in section 270C.40 upon the amount of the underpayment for the period of the underpayment.\n(b) For purposes of paragraph (a), the amount of underpayment shall be the excess of\n(1) the amount of the installment required to be paid, over\n(2) the amount, if any, of the installment paid on or before the last day prescribed for the payment.\n(a) The period of the underpayment shall run from the date the installment was required to be paid to the earlier of the following dates:\n(1) The 15th day of the fourth month following the close of the taxable year.\n(2) With respect to any part of the underpayment, the date on which that part is paid. For purposes of this clause, a payment of estimated tax on any installment date is considered a payment of any unpaid required installments in the order in which the installments are required to be paid.\n(b) For purposes of this subdivision, there shall be four required installments for a taxable year. The times for payment of installments shall be:\nNo addition to tax is imposed under subdivision 2 for a taxable year if the tax shown on the return for the taxable year (or, if no return is filed, the tax) reduced by the credits allowable is less than $500.\nThe amount of any installment required to be paid shall be 25 percent of the required annual payment except as provided in clause (3). The term \"required annual payment\" means the lesser of\n(1) 90 percent of the tax shown on the return for the taxable year or 90 percent of the tax for the year if no return is filed; or\n(2) the total tax liability shown on the return of the taxpayer for the preceding taxable year, if a return showing a liability for the taxes was filed by the taxpayer for the preceding taxable year of 12 months. If the adjusted gross income shown on the return of the taxpayer for the preceding taxable year exceeds $150,000, this clause shall be applied by substituting \"110 percent of the total tax liability\" for \"the total tax liability\"\n(i) for an individual who is not a Minnesota resident for the entire year, the term \"adjusted gross income\" means the Minnesota share of that income apportioned to Minnesota under section 290.06, subdivision 2c, paragraph (e), or\n(ii) for a trust the term \"adjusted gross income\" means the income assigned to Minnesota under section 290.17; or\n(3) an amount equal to the applicable percentage of the tax for the taxable year computed by placing on an annualized basis the taxable income and alternative minimum taxable income for the months in the taxable year ending before the month in which the installment is required to be paid. The applicable percentage of the tax is 22.5 percent in the case of the first installment, 45 percent for the second installment, 67.5 percent for the third installment, and 90 percent for the fourth installment. For purposes of this clause, the taxable income and alternative minimum taxable income shall be placed on an annualized basis by\n(i) multiplying by 12 (or in the case of a taxable year of less than 12 months, the number of months in the taxable year) the taxable income and alternative minimum taxable income computed for the months in the taxable year ending before the month in which the installment is required to be paid; and\n(ii) dividing the resulting amount by the number of months in the taxable year ending before the month in which the installment date falls.\nA reduction in an installment under clause (3) must be recaptured by increasing the amount of the next required installment by the amount of the reduction.\n[Repealed, 1994 c 587 art 1 s 25]\n(a) For individuals, no addition to the tax is imposed under this section for any taxable year if:\n(1) the taxpayer did not have liability for tax for the preceding taxable year,\n(2) the preceding taxable year was a taxable year of 12 months, and\n(3) the individual was a resident of Minnesota throughout the preceding taxable year.\n(b) For trusts, S corporations, and partnerships, if in any previous taxable year the entity was subject to taxation under chapter 290 or composite income tax is elected under section 289A.08, subdivision 7, then an addition to the tax is imposed under this section. In all other taxable years, no addition to tax is imposed under this section.\nNo addition to the tax is imposed under this section with respect to an underpayment to the extent the commissioner determines that the provisions of section 6654(e)(3) of the Internal Revenue Code apply.\nFor purposes of this section, the estimated tax must be computed without reduction for the amount that the taxpayer estimates as the taxpayer's credit under section 290.92, subdivision 12 (relating to tax withheld at source on wages), and any other refundable credits allowed against income tax liability, and the amount of those credits for the taxable year is considered a payment of estimated tax, and an equal part of those amounts is considered paid on the installment date, determined under subdivision 3, paragraph (b), for that taxable year, unless the taxpayer establishes the dates on which the amounts were actually withheld, in which case the amounts so withheld are considered payments of estimated tax on the dates on which the amounts were actually withheld.\nIf, on or before January 31 of the following taxable year, the taxpayer files a return for the taxable year and pays in full the amount computed on the return as payable, then no addition to tax is imposed under subdivision 2 with respect to any underpayment of the fourth required installment for the taxable year.\nFor purposes of this section, if an individual is a farmer or fisherman as defined in section 6654(i)(2) of the Internal Revenue Code for a taxable year, only one installment is required for the taxable year, the due date of which is January 15 of the following taxable year, the amount of which is equal to the required annual payment determined under subdivision 5 by substituting \"66-2/3 percent\" for \"90 percent,\" and subdivision 9 shall be applied by substituting \"March 1\" for \"January 31,\" and by treating the required installment described as the fourth required installment.\nThe application of this section to taxable years beginning other than January 1 must be made by substituting, for the months named in this section, the months that correspond. This section must be applied to taxable years of less than 12 months, under rules issued by the commissioner.\nThe provisions of this section do not apply to an estate.\nIf an installment payment of estimated tax exceeds the correct amount of the installment payment, the overpayment must be credited against the unpaid installments, if any.\n(a) A trust, S corporation, or partnership with a short taxable year of less than 12 months, but at least four months, must pay estimated tax in equal installments on or before the 15th day of the third, sixth, ninth, and final month of the short taxable year, to the extent applicable based on the number of months in the short taxable year.\n(b) A trust, S corporation, or partnership is not required to make estimated tax payments for a short taxable year unless its tax liability before the first day of the last month of the taxable year can reasonably be expected to exceed $500.\n(c) No payment is required by a trust, S corporation, or partnership for a short taxable year of less than four months.",
	"repealed": false
}