{
	"id": "256R.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.10",
	"title": "256R.10 ALLOWED COSTS.",
	"text": "Only costs determined to be allowable shall be used to compute the total payment rate for nursing facilities participating in the medical assistance program. To be considered an allowable cost for rate-setting purposes, a cost must satisfy the following criteria:\n(1) the cost is ordinary, necessary, and related to resident care;\n(2) the cost is what a prudent and cost-conscious business person would pay for the specific good or service in the open market in an arm's-length transaction;\n(3) the cost is for goods or services actually provided in the nursing facility;\n(4) the cost effects of transactions that have the effect of circumventing this chapter are not allowable under the principle that the substance of the transaction shall prevail over form; and\n(5) costs that are incurred due to management inefficiency, unnecessary care or facilities, agreements not to compete, or activities not commonly accepted in the nursing facility care field are not allowable.\n(a) For facilities where employees are represented by collective bargaining agents, costs related to the salaries and wages, payroll taxes, and employer's share of fringe benefit costs, except employer health insurance costs, for facility employees who are members of the bargaining unit are allowed costs only if:\n(1) these costs are incurred pursuant to a collective bargaining agreement. The commissioner shall allow a collective bargaining agent until March 1 following the date on which the cost report was required to be submitted to notify the commissioner if a collective bargaining agreement, effective on the last day of the reporting period, was not in effect; or\n(2) the collective bargaining agent notifies the commissioner by October 1 following the date on which the cost report was required to be submitted that these costs are incurred pursuant to an agreement or understanding between the facility and the collective bargaining agent.\n(b) In any year when a portion of a facility's reported costs are not allowed costs under paragraph (a), when calculating the operating payment rate for the facility, the commissioner shall use the facility's allowed costs from the facility's second most recent cost report in place of the nonallowed costs. For the purpose of setting the other operating payment rate under section 256R.24, subdivision 3, the commissioner shall reduce the other operating payment rate by the difference between the nonallowed costs and the allowed costs from the facility's second most recent cost report.\nIn addition to the approved pension or profit-sharing plans allowed by Minnesota Rules, parts 9549.0010 to 9549.0080, the commissioner shall allow those plans specified in Internal Revenue Code, sections 403(b) and 408(k).\nThe commissioner shall allow as workers' compensation insurance costs under section 256R.02, subdivision 22, the costs of workers' compensation coverage obtained under the following conditions:\n(1) a plan approved by the commissioner of commerce as a Minnesota group or individual self-insurance plan as provided in section 79A.03;\n(2) a plan in which:\n(i) the nursing facility, directly or indirectly, purchases workers' compensation coverage in compliance with section 176.181, subdivision 2, from an authorized insurance carrier;\n(ii) a related organization to the nursing facility reinsures the workers' compensation coverage purchased, directly or indirectly, by the nursing facility; and\n(iii) all of the conditions in clause (4) are met;\n(3) a plan in which:\n(i) the nursing facility, directly or indirectly, purchases workers' compensation coverage in compliance with section 176.181, subdivision 2, from an authorized insurance carrier;\n(ii) the insurance premium is calculated retrospectively, including a maximum premium limit, and paid using the paid loss retro method; and\n(iii) all of the conditions in clause (4) are met;\n(4) additional conditions are:\n(i) the costs of the plan are allowable under the federal Medicare program;\n(ii) the reserves for the plan are maintained in an account controlled and administered by a person which is not a related organization to the nursing facility;\n(iii) the reserves for the plan cannot be used, directly or indirectly, as collateral for debts incurred or other obligations of the nursing facility or related organizations to the nursing facility;\n(iv) if the plan provides workers' compensation coverage for non-Minnesota nursing facilities, the plan's cost methodology must be consistent among all nursing facilities covered by the plan, and if reasonable, is allowed notwithstanding any reimbursement laws regarding cost allocation to the contrary;\n(v) central, affiliated, corporate, or nursing facility costs related to their administration of the plan are costs which must remain in the nursing facility's administrative cost category and must not be allocated to other cost categories;\n(vi) required security deposits, whether in the form of cash, investments, securities, assets, letters of credit, or in any other form are not allowable costs for purposes of establishing the facility's payment rate; and\n(vii) a group of nursing facilities related by common ownership that self-insures workers' compensation may allocate its directly identified costs of self-insuring its Minnesota nursing facility workers among those nursing facilities in the group that are reimbursed under this chapter. The method of cost allocation shall be based on the ratio of each nursing facility's total allowable salaries and wages to that of the nursing facility group's total allowable salaries and wages, then similarly allocated within each nursing facility's operating cost categories. The costs associated with the administration of the group's self-insurance plan must remain classified in the nursing facility's administrative cost category. A written request of the nursing facility group's election to use this alternate method of allocation of self-insurance costs must be received by the commissioner no later than May 1, 1998, to take effect July 1, 1998, or such costs shall continue to be allocated under the existing cost allocation methods. Once a nursing facility group elects this method of cost allocation for its workers' compensation self-insurance costs, it shall remain in effect until such time as the group no longer self-insures these costs;\n(5) any costs allowed pursuant to clauses (1) to (3) are subject to the following requirements:\n(i) if the nursing facility is sold or otherwise ceases operations, the plan's reserves must be subject to an actuarially based settle up after 36 months from the date of sale or the date on which operations ceased. The facility's medical assistance portion of the total excess plan reserves must be paid to the state within 30 days following the date on which excess plan reserves are determined;\n(ii) any distribution of excess plan reserves made to or withdrawals made by the nursing facility or a related organization are applicable credits and must be used to reduce the nursing facility's workers' compensation insurance costs in the reporting period in which a distribution or withdrawal is received;\n(iii) if reimbursement for the plan is sought under the federal Medicare program, and is audited pursuant to the Medicare program, the nursing facility must provide a copy of Medicare's final audit report, including attachments and exhibits, to the commissioner within 30 days of receipt by the nursing facility or any related organization. The commissioner shall implement the audit findings associated with the plan upon receipt of Medicare's final audit report. The department's authority to implement the audit findings is independent of its authority to conduct a field audit.\nSalaries and wages must be paid within 30 days of the end of the reporting period in order to be allowable costs of the reporting period.\nApplicable credits must be used to offset or reduce the expenses of the nursing facility to the extent that the cost to which the credits apply was claimed as a nursing facility cost. Interest income, dividend income, and other investment income of the nursing facility or related organization are not applicable credits except to the extent that the interest expense on working capital debt is incurred and claimed as a reimbursable expense by the nursing facility or related organization.\nWhen the cost category for allowed cost items or services is not specified in this chapter or the provider reimbursement manual, the commissioner, in consultation with stakeholders, shall determine the cost category for the allowed cost item or service.\n(a) Employer health insurance costs are allowable for (1) all employees and (2) the spouse and dependents of those employees who are employed on average at least 30 hours per week.\n(b) The commissioner must not treat employer contributions to employer-sponsored individual coverage health reimbursement arrangements as allowable costs if the facility does not provide the commissioner copies of the employer-sponsored individual coverage health reimbursement arrangement plan documents and documentation of any health insurance premiums and associated co-payments reimbursed under the arrangement. Documentation of reimbursements must denote any reimbursements for health insurance premiums or associated co-payments incurred by the spouses or dependents of employees who work on average less than 30 hours per week.",
	"repealed": false
}