{
	"id": "290.923",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.923",
	"title": "290.923 TAX WITHHELD ON ROYALTIES UPON ORE.",
	"text": "In this section, \"royalty\" means the amount in money or value of property received by any person having any right, title, or interest in any tract of land in this state for permission to explore, mine, take out, and remove ore from the land.\n(a) Every person making payment of royalties shall deduct and withhold upon the royalties a tax as provided in this section.\n(b) The amount of tax to be withheld shall be based upon tables to be prepared and distributed by the commissioner. The tables must be computed for several permissible withholding periods and shall take into account any exemptions allowed under this chapter. The amounts computed for withholding shall be such that the amount withheld for any person during the person's taxable year shall approximate in the aggregate as closely as possible the tax levied and imposed under this chapter for that taxable year upon the person's income subject to tax.\nEvery person who is required to deduct and withhold tax under subdivision 2 shall file returns and make deposits as required under sections 289A.09 and 289A.20, subdivision 2.\nEvery person required to deduct and withhold tax under this section shall furnish withholding statements as required by section 289A.09, subdivision 2.\nThe payor shall be liable for the payment of tax required to be deducted and withheld under subdivision 2 and shall not be liable to any person for the amount of the payment.\nThe commissioner may grant permission to payors who do not wish to use the withholding tax tables provided in accordance with subdivision 2, paragraph (b), in accordance with section 290.92, subdivision 9.\n[Repealed, 1990 c 480 art 1 s 45]\nEvery person liable for tax imposed by this section or for the collection of it shall be subject to the provisions of sections 270C.31 and 270C.32.\nNotwithstanding any other provision of this section a payor shall not be required to deduct and withhold any tax under this chapter upon a payment of royalties to a payee if there is in effect with respect to the payment a withholding allowance certificate, in the form and containing the information prescribed by the commissioner, furnished to the payor by the payee certifying that the payee:\n(1) incurred no liability for income tax imposed under this chapter for the payee's preceding taxable year; and\n(2) anticipates incurring no liability for income tax under this chapter for the current taxable year.\nThe commissioner shall provide by rule for the coordination of the provisions of this subdivision with the provisions of subdivision 4.\nA payor desiring to engage in business in Minnesota shall file with the commissioner an application for a withholding account number in accordance with section 290.92, subdivisions 24 and 25.\nA person or entity whose shares or certificates of beneficial interest are traded on the New York Stock Exchange or publicly traded on any recognized stock exchange and which issues 1099 or K1 forms to its shareholders or certificate holders and provides the 1099 or K1 information to the Department of Revenue, is exempt from deduction and withholding under this section.",
	"repealed": false
}