{
	"id": "92.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.06",
	"title": "92.06 PAYMENTS; INTEREST.",
	"text": "(a) The terms of payment on the sale of state public lands held before July 1, 2004, must be as follows: The purchaser shall pay in cash at the time of sale the appraised value of all timber and costs determined by the commissioner to be associated with the sale including survey, appraisal, publication, deed tax, filing fee, and similar costs. At least 15 percent of the purchase price of the land exclusive of timber and associated costs must be paid in cash at the time of sale. The balance of the purchase price must be paid in no more than 20 equal annual installments. Payments must be made by June 1 each year following the year in which the purchase was made, with interest at the rate in effect at the time of sale, calculated under this subdivision, on the unpaid balances. Any installment of principal or interest may be paid in advance, but part payment of an installment will not be accepted. For the purpose of computing interest, any installment of principal not paid on June 1 shall be credited on the following June 1. The purchaser may pay the balance due on a sale within 30 days of the sale with no interest due.\n(b) Interest on unpaid balances must be computed as annual simple interest. The rate of interest must be based on average effective interest rates on mortgage loans as provided in paragraph (c).\n(c) On or before December 31 of each year, the commissioner of natural resources shall determine the rate from the average effective interest rate on loans closed using the Office of Thrift Supervision series, formerly the Federal Home Loan Bank Board series, or its successor agency, for the most recent calendar month, reported on a monthly basis in the latest statistical release of the Board of Governors of the Federal Reserve System. This yield, rounded to the nearest quarter of one percent, is the annual interest rate for sales of state land during the succeeding calendar year.\n(d) For state land sales in calendar year 1993 after July 1, 1993, the rate is eight percent, which is the September 1992 average from the Office of Thrift Supervision series, rounded to the nearest quarter of one percent.\nNotwithstanding subdivision 1, for state land sales on or after July 1, 2004, the purchaser must pay at the time of sale ten percent of the total amount bid and the remainder of the payment is due within 90 days of the sale date. A person who fails to make final payment within 90 days of the sale date is in default. On default, all right, title, and interest of the purchaser or heirs, representatives, or assigns of the purchaser in the premises shall terminate without the state doing any act or thing. A record of the default must be made in the state land records of the commissioner.\nIf there are buildings or other improvements upon the land, their value must be determined separately and included in the purchase price. A person must not remove, injure, or destroy a building or other improvement until an amount equal to its determined value has been paid on the purchase price of the premises, in addition to any payment required for timber. Violation of this provision is a gross misdemeanor.\nA person who fails to make a payment required under a certificate of sale within 60 days from the date it becomes due is in default. On default, the certificate of sale shall be deemed canceled, and all right, title, and interest of the purchaser or heirs, representatives, or assigns of the purchaser, in the premises shall terminate without the doing by the state of any act or thing. A record of the default must be made in the state land records of the commissioner. The commissioner may prepare a certificate of default and file it with the county treasurer or record it in the office of the county recorder of the county containing the property. The record or certificate is prima facie evidence of the facts stated in it, but the cancellation and termination are effective without it. This subdivision does not apply to a sale made before May 1, 1941.\n(a) If a person has made improvements to the land and if: (1) the commissioner believes that person settled the land in good faith as homestead land under the laws of the United States before it was certified to the state, (2) the improvements were lawfully made by that person as a lessee of the state, or (3) the commissioner determines, based on clear and convincing evidence provided by the person, that the improvements were made by the person as an inadvertent trespasser, then the value of the improvements must be separately determined and, if the settler, lessee, or inadvertent trespasser purchases the land, the settler, lessee, or inadvertent trespasser is not required to pay for the improvements. If another person purchases the land, that person must pay the owner of the improvements, in addition to all other required payments, the determined amount for the improvements.\n(b) Payment for improvements must be made within 15 days of the auction sale, either in cash or upon terms and conditions agreeable to the owner of the improvements. If payment for improvements is not made in cash, and if there is no agreement between the parties within 15 days of the auction sale, the commissioner may:\n(1) sell the property to the second highest qualified bidder if that bidder submitted to the commissioner's representative, at the auction sale, a written request to buy the property at a specified price; or\n(2) void the sale and reoffer the property at a subsequent sale.\n(c) This subdivision does not apply unless the owner of the improvements makes a verified application to the commissioner showing entitlement to the improvements before the first state public sale at which the land is offered for sale. The applicant must appear at the sale and offer to purchase the land for at least its determined value including all timber on it, and make the purchase if no higher bid is received. Actions or other proceedings involving the land in question begun before the sale must have been completed.\nThe commissioner may require of the purchaser security for the payment of the deferred installments. The commissioner may recover the money and enforce any security by action brought in the director's name.",
	"repealed": false
}