{
	"id": "174.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.06",
	"title": "174.06 TRANSFER OF POWERS.",
	"text": "All powers, duties, and functions heretofore vested in or imposed on the commissioner of highways or the Department of Highways by chapters 160, 161, 162, 163, 164, 165, 167, 169, 173, or sections 473.405 to 473.449 or any other law relating to the duties and powers of the commissioner of highways are transferred to, vested in, and imposed on the commissioner of transportation. The position of the commissioner of highways and the Department of Highways as heretofore constituted are abolished.\nAll powers, duties, and functions heretofore vested in or imposed on the commissioner of aeronautics or the Department of Aeronautics by sections 360.011 to 360.076, 360.305 to 360.73, 360.81 to 360.91 or any other law relating to the duties and powers of the commissioner of aeronautics are transferred to, vested in, and imposed on the commissioner of transportation. The position of the commissioner of aeronautics and the Department of Aeronautics as heretofore constituted are abolished.\nAll powers, duties, and functions heretofore vested in or imposed on the Department of Public Service, the Public Utilities Commission, or the commissioner of the Department of Public Service by sections 174.60 to 174.63 are transferred to, vested in, and imposed on the commissioner of transportation.\n[Repealed, 1977 c 454 s 49]\nAny and all transfers of Department of Public Service personnel, records, and funds to the Department of Transportation, made pursuant to the provisions of this section, shall be subject to the approval of the commissioner of administration.\n[Repealed, 1981 c 253 s 48]\nIt is the intent of the legislature that gas, oil, slurry, and other pipelines, long-distance conveyor belt systems, and other modes of transportation not now regulated by the state be constructed and operated in a manner that best serves the public good and complements other means of transportation.\n[Repealed, 2014 c 227 art 1 s 23]",
	"repealed": false
}