{
	"id": "85B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/85B.02",
	"title": "85B.02 ORGANIZATION.",
	"text": "The Lake Superior Center Authority is established as a public corporation. The business of the corporation must be conducted under the name \"Lake Superior Center Authority.\"\nThe corporation is governed by a board of five directors. The term of a director, except as otherwise provided below, is six years. One of the five directors is the commissioner of the Department of Natural Resources. The other four members of the board shall be appointed by the governor. Two members of the initial board of directors shall be appointed for terms of four years, and two for terms of two years. Vacancies on the board shall be filled by appointment of the governor. Board members shall not be compensated for their service as board members other than to be reimbursed for reasonable expenses incurred in connection with their duties as board members. This reimbursement shall be reviewed each year by the commissioner of management and budget.\nThe board of directors shall adopt bylaws necessary for the conduct of the business of the corporation, consistent with sections 85B.01 to 85B.08. The corporation must publish the bylaws and amendments to the bylaws in the State Register.\nThe board shall locate and maintain the corporation's place of business within the state.\nThe board shall annually elect from among its members a chair and other officers necessary for the performance of its duties.\nThe board shall meet at least twice each year and may hold additional meetings upon giving notice in accordance with the bylaws of the corporation. Board meetings are subject to chapter 13D.\nA director, employee, or officer of the corporation may not participate in or vote on a decision of the board relating to an organization in which the director has either a direct or indirect financial interest.\nDirectors and officers of the corporation are public officials for the purpose of section 10A.09, and must file statements of economic interest with the state Campaign Finance and Public Disclosure Board.\nThis corporation shall not afford pecuniary gain, incidental or otherwise, to any private individual, firm, or corporation (except the payment of reasonable fees for goods and services rendered and approved in accordance with the bylaws of the corporation) and no part of the net income or net earnings of the corporation shall, directly or indirectly, be distributable to or otherwise inure to the benefit of any individual.",
	"repealed": false
}