{
	"id": "375.192",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.192",
	"title": "375.192 REDUCTIONS OR ABATEMENTS OF VALUATION OR TAXES.",
	"text": "MS 1989 Supp [Repealed, 1990 c 604 art 3 s 65]\nUpon written application by the owner of any property, the county board may grant the reduction or abatement of estimated market valuation or taxes and of any costs, penalties, or interest on them as the board deems just and equitable and order the refund in whole or part of any taxes, costs, penalties, or interest which have been erroneously or unjustly paid. Except as provided in sections 469.1812 to 469.1815, no reduction or abatement may be granted on the basis of providing an incentive for economic development or redevelopment. Except as provided in section 375.194, the county board may consider and grant reductions or abatements on applications only as they relate to taxes payable in the current year and the two prior years; provided that reductions or abatements for the two prior years shall be considered or granted only for (i) clerical errors, or (ii) when the taxpayer fails to file for a reduction or an adjustment due to hardship, as determined by the county board. The application must include the Social Security number of the applicant. The Social Security number is private data on individuals as defined by section 13.02, subdivision 12. All applications must be approved by the county assessor, or, if the property is located in a city of the first or second class having a city assessor, by the city assessor, and by the county auditor before consideration by the county board, except that the part of the application which is for the abatement of penalty or interest must be approved by the county treasurer and county auditor. Approval by the county or city assessor is not required for abatements of penalty or interest. No reduction, abatement, or refund of any special assessments made or levied by any municipality for local improvements shall be made unless it is also approved by the board of review or similar taxing authority of the municipality. On any reduction or abatement when the reduction of taxes, costs, penalties, and interest exceed $10,000, the county board shall give notice within 20 days to the school board and the municipality in which the property is located. The notice must describe the property involved, the actual amount of the reduction being sought, and the reason for the reduction.\nAn appeal may not be taken to the Tax Court from any order of the county board made in the exercise of the discretionary authority granted in this section.\nThe county auditor shall notify the commissioner of revenue of all abatements resulting from the erroneous classification of real property, for tax purposes, as nonhomestead property. For the abatements relating to the current year's tax processed through June 30, the auditor shall notify the commissioner on or before July 31 of that same year of all abatement applications granted. For the abatements relating to the current year's tax processed after June 30 through the balance of the year, the auditor shall notify the commissioner on or before the following January 31 of all applications granted. The county auditor shall submit a form containing the Social Security number of the applicant and such other information the commissioner prescribes.\nSubject to the approval of the commissioner of revenue, the county board shall authorize the county auditor to grant the classification denied under section 272.115, subdivision 4, if a certificate of value has been filed with the county auditor. The county board shall not hear any requests under this subdivision after May 31 of the year in which the taxes are payable.\nNotwithstanding any law to the contrary, the county board may delegate to the county auditor any authority, power, or responsibility assigned to the county board in this section. If delegation is granted under this subdivision, the county board shall prescribe the conditions for the delegation and may revoke delegation without good cause or prior notice. If the county auditor holds elective office, no delegation shall be made under this subdivision unless the county auditor concurs in the delegation.",
	"repealed": false
}