{
	"id": "103E.635",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.635",
	"title": "103E.635 DRAINAGE BOND ISSUES.",
	"text": "After the contract for the construction of a drainage project is awarded, the board of an affected county may issue the bonds of the county in an amount necessary to pay the cost of establishing and constructing the drainage project.\nThe board may include two or more drainage systems in a single drainage bond issue. The total amount of the drainage bond issue may not exceed the total cost, including expenses, to be assessed to pay for the drainage systems. The total cost to be assessed must be determined or estimated by the board when the drainage bonds are issued.\nThe drainage bonds must be issued in accordance with chapter 475 and must pledge the full faith, credit, and resources of the county for the prompt payment of the principal and interest of the drainage bonds. The drainage bonds are primarily payable from the funds of the drainage systems financed by the bonds or from the common drainage bond redemption fund of the county. The common drainage bond redemption fund may be created by resolution of the county board as a debt redemption fund for the payment of drainage bonds issued under this chapter.\n(a) The board shall determine, by resolution:\n(1) the time of payment for the drainage bonds, not to exceed 23 years from their date of issue;\n(2) the rates of interest for the drainage bonds, with the net average rate of interest over the term of the bonds not to exceed the rate established under section 475.55; and\n(3) whether the drainage bonds are payable annually or semiannually.\n(b) The board shall determine the years and amounts of principal maturities that are necessary by the anticipated collections of the drainage systems assessments, without regard to any limitations on the maturities imposed by section 475.54.\nThe board may issue and sell temporary drainage bonds under this subdivision maturing not more than two years after their date of issue, instead of bonds as provided under subdivision 4. The county shall issue and sell definitive drainage bonds before the maturity of bonds issued under this subdivision and use the proceeds to pay for the temporary drainage bonds and interest to the extent that the temporary bonds are not paid for by assessments collected or other available funds. The holders of temporary drainage bonds and the taxpayers of the county have and may enforce by mandamus or other appropriate proceedings:\n(1) all rights respecting the levy and collection of assessments sufficient to pay the cost of drainage proceedings and construction financed by the temporary drainage bonds that are granted by law to holders of other drainage bonds, except the right to require levies to be collected before the temporary drainage bonds mature; and\n(2) the right to require the offering of definitive drainage bonds for sale, or to require the issuance of definitive drainage bonds in exchange for the temporary drainage bonds, on a par for par basis, bearing interest at the rate established under section 475.55 if the definitive drainage bonds have not been sold and delivered before the maturity of the temporary drainage bonds.\nThe definitive drainage bonds issued in exchange for an issue of temporary drainage bonds must be numbered and mature serially at times and in amounts to allow the principal and interest to be paid when due by the collection of assessments levied for the drainage systems financed by the temporary bond issue. The definitive bonds are subject to redemption and prepayment on any interest payment date when the county notifies the definitive bondholders who have registered their names and addresses with the county treasurer. The bondholders must be notified by mail 30 days before the interest payment date. The definitive bonds must be delivered in order of their serial numbers, lowest numbers first, to the holders of the temporary drainage bonds in order of the serial numbers of the bonds held by them.\nThe board must sell and negotiate the definitive drainage bonds according to sections 475.56 and 475.60.\n(a) Funds of the issuing county may be invested in temporary drainage bonds under section 118A.04, except that the temporary drainage bonds may be:\n(1) purchased by the county when the temporary drainage bonds are initially issued;\n(2) purchased only out of funds that the board determines will not be required for other purposes before the temporary drainage bonds mature; and\n(3) resold before the temporary drainage bonds mature only if there is an unforeseen emergency.\n(b) If a temporary drainage bond purchase is made from money held in a sinking fund for other bonds of the county, the holders of the other bonds may enforce the county's obligation to sell definitive bonds at or before the maturity of the temporary drainage bonds, or exchange the other bonds, in the same manner as holders of the temporary drainage bonds.\nThe board may provide in the contract for the sale of drainage bonds, temporary drainage bonds, and definitive drainage bonds, that the bonds are delivered as the drainage work proceeds and the money is needed, and that interest is paid only from the date of delivery.\nEach drainage bond, temporary drainage bond, and definitive drainage bond must contain a recital that it is issued by authority of and in strict accordance with this chapter. The recital is conclusive in favor of the holders of the bonds as against the county, that the drainage project has been properly established, that property within the county is subject to assessment for benefits in an amount not less than the amount of the bonds, and that all proceedings and construction relative to the drainage systems financed by the bonds have been or will be made according to law.\nThe board may pay drainage bonds, temporary drainage bonds, and definitive drainage bonds issued under this chapter from any available funds in the county treasury if the money in the common drainage bond redemption fund or in the drainage fund for the issued bonds is insufficient. The county treasury funds that money is transferred from must be reimbursed, with interest at a rate of seven percent per year for the time the money is actually needed, from assessments on the drainage systems or from the sale of drainage funding bonds.",
	"repealed": false
}