{
	"id": "123A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.15",
	"title": "123A.15 ESTABLISHING EDUCATION DISTRICTS.",
	"text": "The purpose of an education district is to increase educational opportunities for learners by increasing cooperation and coordination among school districts, other governmental units, and postsecondary institutions, and to replace other existing cooperative structures.\n(a) Boards meeting the requirements of subdivision 3 may enter into a written agreement to establish an education district. Once established, cities, counties, and other governmental units as defined in section 471.59, may become members of the education district. The agreement and subsequent amendments must be adopted by majority vote of the full membership of each board.\n(b) The education district agreement may contain a special provision adopted by the vote of a majority of the full membership of each of the boards of the member districts to allow a postsecondary institution or cities, counties, and other governmental units to become a member of the education district.\n(a) An education district must have one of the following at the time of formation:\n(1) at least five districts;\n(2) at least four districts with a total of at least 5,000 pupils in average daily membership; or\n(3) at least four districts with a total of at least 2,000 square miles.\nMembers of an education district must be contiguous. Districts with a cooperation agreement according to section 123A.32 may belong to an education district only as a unit.\n(b) A noncontiguous district may be a member of an education district if the commissioner of education determines that:\n(1) a district between the education district and the noncontiguous district has considered and is unwilling to become a member; or\n(2) a noncontiguous configuration of member districts has sufficient technological or other resources to offer effective levels of programs and services.\nBefore entering into an agreement, the board of each member district must meet and confer with the exclusive representatives of the teachers of each district proposing to enter the education district.\nBefore entering into an agreement, the board of each member district must publish a summary of the proposed agreement and its effect upon the district at least once in a newspaper of general circulation in the district. The board must conduct a public hearing on the proposed agreement not more than ten days after the notice and at least 30 days before entering into an agreement.\nIf requested, service cooperatives must provide assistance to districts in establishing education districts. The assistance may include determination of appropriate boundaries of the education district and development of the agreement. The service cooperatives may provide any other services requested by the education district.",
	"repealed": false
}