{
	"id": "252.291",
	"url": "https://www.revisor.mn.gov/statutes/cite/252.291",
	"title": "252.291 LIMITATION ON DETERMINATION OF NEED.",
	"text": "Notwithstanding any law or rule to the contrary, the commissioner of human services shall deny any request for a determination of need and refuse to grant a license pursuant to section 245A.02 for any new intermediate care facility for persons with developmental disabilities or for an increase in the licensed capacity of an existing facility except as provided in this subdivision and subdivision 2. The total number of certified intermediate care beds for persons with developmental disabilities in community facilities and state hospitals shall not exceed 7,000 beds except that, to the extent that federal authorities disapprove any applications of the commissioner for home and community-based waivers under United States Code, title 42, section 1396n, as amended through December 31, 1987, the commissioner may authorize new intermediate care beds, as necessary, to serve persons with developmental disabilities who would otherwise have been served under a proposed waiver. \"Certified bed\" means an intermediate care bed for persons with developmental disabilities certified by the commissioner of health for the purposes of the medical assistance program under United States Code, title 42, sections 1396 to 1396p, as amended through December 31, 1987.\n(a) The commissioner of human services in coordination with the commissioner of health may approve a newly constructed or newly established publicly or privately operated community intermediate care facility for six or fewer persons with developmental disabilities only when:\n(1) the facility is developed in accordance with a request for proposal approved by the commissioner of human services;\n(2) the facility is necessary to serve the needs of identified persons with developmental disabilities who are seriously behaviorally disordered or who are seriously physically or sensorily impaired. No more than 40 percent of the capacity specified in the proposal submitted to the commissioner must be used for persons being discharged from regional treatment centers; and\n(3) the commissioner determines that the need for increased service capacity cannot be met by the use of alternative resources or the modification of existing facilities.\n(b) The percentage limitation in paragraph (a), clause (2), does not apply to state-operated, community-based facilities.\n(a) The commissioner shall authorize and grant a license under chapter 245A to a new intermediate care facility for persons with developmental disabilities effective January 1, 2000, under the following circumstances:\n(1) the new facility replaces an existing 64-bed intermediate care facility for the developmentally disabled located in Ramsey County;\n(2) the new facility is located upon a parcel of land contiguous to the parcel upon which the existing 64-bed facility is located;\n(3) the new facility is comprised of no more than eight twin home style buildings and an administration building;\n(4) the total licensed bed capacity of the facility does not exceed 64 beds; and\n(5) the existing 64-bed facility is demolished.\n(b) The medical assistance payment rate for the new facility shall be the higher of the rate specified in paragraph (c) or as otherwise provided by law.\n(c) The new facility shall be considered a newly established facility for rate setting purposes and shall be eligible for the investment per bed limit specified in section 256B.501, subdivision 11, paragraph (c), and the interest expense limitation specified in section 256B.501, subdivision 11, paragraph (d). Notwithstanding section 256B.5011, the newly established facility's initial payment rate shall be set according to Minnesota Rules, part 9553.0075.\n(d) During the construction of the new facility, Ramsey County shall work with residents, families, and service providers to explore all service options open to current residents of the facility.\nThe commissioner of health shall certify one additional bed in an intermediate care facility for persons with developmental disabilities in Nicollet County.\nThe commissioner shall:\n(1) establish standard admission criteria for state hospitals and county utilization targets to limit and reduce the number of intermediate care beds in state hospitals and community facilities in accordance with approved waivers under United States Code, title 42, sections 1396 to 1396p, as amended through December 31, 1987, to assure that appropriate services are provided in the least restrictive setting;\n(2) define services, including respite care, that may be needed in meeting individual service plan objectives;\n(3) provide technical assistance so that county boards may establish a request for proposal system for meeting individual service plan objectives through home and community-based services; alternative community services; or, if no other alternative will meet the needs of identifiable individuals for whom the county is financially responsible, a new intermediate care facility for persons with developmental disabilities;\n(4) establish a client tracking and evaluation system as required under applicable federal waiver regulations, Code of Federal Regulations, title 42, sections 431, 435, 440, and 441, as amended through December 31, 1987; and\n(5) develop a state plan for the delivery and funding of residential day and support services to persons with developmental disabilities in Minnesota. The biennial developmental disability plan shall include but not be limited to:\n(i) county by county maximum intermediate care bed utilization quotas;\n(ii) plans for the development of the number and types of services alternative to intermediate care beds;\n(iii) procedures for the administration and management of the plan;\n(iv) procedures for the evaluation of the implementation of the plan; and\n(v) the number, type, and location of intermediate care beds targeted for decertification.\nThe commissioner shall modify the plan to ensure conformance with the medical assistance home and community-based services waiver.\nThe commissioner of human services, in coordination with the commissioner of health, shall implement mechanisms to monitor and analyze the effect of the bed moratorium in the different geographic areas of the state. The commissioner of human services shall submit to the legislature annually beginning January 15, 1984, an assessment of the impact of the moratorium by geographic areas.\nThe commissioner of human services shall promulgate rules pursuant to chapter 14, the Administrative Procedure Act, to implement this section.",
	"repealed": false
}