{
	"id": "376.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/376.55",
	"title": "376.55 COUNTY NURSING HOME.",
	"text": "(a) Any county, or any group of counties acting jointly may establish a county nursing home, in sections 376.55 to 376.60 also termed \"nursing home,\" for the care and treatment of chronically ill or convalescent persons or persons who need nursing home care because old age or infirmity makes them unable to properly care for themselves, with the consent of a majority of the county board.\n(b) Any county, or group of counties, which owns a nursing home, may establish and operate an attached or related facility for the purpose of providing supportive services to elderly persons who are not yet in need of nursing home care. Supportive services may include congregate housing, adult day care, and respite care services.\nA county, or a group of counties acting jointly, may establish a nursing home and a facility for supportive services under sections 376.55 to 376.60, by converting suitable existing county owned buildings, by leasing suitable premises, or by acquiring a suitable site by gift, purchase, or condemnation proceedings instituted in the name of the county or counties and constructing suitable buildings which are equipped, maintained, enlarged or otherwise modified to be the same as a nursing home.\nThe county board may transfer surplus funds from any fund except the road and bridge, sinking or drainage ditch funds for the purpose of establishing, acquiring, maintaining, enlarging, or adding to a county nursing home. When surplus funds are not available for transfer, a county board may issue bonds to pay the cost of establishing, acquiring, equipping, furnishing, enlarging, or adding to a county nursing home, subject to section 376.56.\nA county, or a group of counties, not maintaining a nursing home, may purchase an interest in an existing county nursing home if the county board or boards owning the nursing home decide by majority vote of each county board to admit the county. The county board or boards owning the home shall set the cost for admission to ownership, taking into consideration their investment in the home. Any county admitted under this provision shall have all the rights and privileges provided for in sections 376.55 to 376.60.\nWhere in sections 376.55 to 376.57 and 376.58 to 376.60 the word \"county\" is used, it refers to a county acting singly, or as one of a group of counties acting jointly, unless the context clearly indicates otherwise.\nAny county board may withdraw its interest in a county nursing home if the county board or boards owning the nursing home decide by majority vote of each county board to allow the withdrawal. The county board or boards owning the home shall set the amount to be paid to the withdrawing county, taking into consideration their investment in the home.\nThe county board of any county that has not established a nursing home may by resolution authorize a statutory or home rule charter city within the county to exercise the powers of a county under sections 376.55 to 376.60. A city so designated may exercise within its boundaries all the powers of a county under sections 376.55 to 376.60.",
	"repealed": false
}