{
	"id": "256C.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/256C.28",
	"title": "256C.28 COMMISSION OF THE DEAF, DEAFBLIND AND HARD OF HEARING.",
	"text": "(a) The Commission of the Deaf, DeafBlind and Hard of Hearing consists of ten members appointed at large and one member each from up to five advisory committees established under section 256C.24, subdivision 3. At least 50 percent of the voting members must be deaf or deafblind or hard-of-hearing. Members shall include at least one parent or guardian of a person who is deaf, deafblind, or hard-of-hearing. The commissioners of education, health, and employment and economic development and the director of the Deaf, DeafBlind, and Hard of Hearing State Services Division in the Department of Human Services, or their designees, shall serve as ex officio, nonvoting members of the commission. The commission may appoint additional ex officio members from other bureaus, divisions, or sections of state departments directly concerned with the provision of services to persons who are deaf, deafblind, or hard-of-hearing.\n(b) Voting members of the commission are appointed by the governor for a four-year term and until successors are appointed and qualify. Voting members of the commission shall serve no more than three consecutive full terms.\n(c) Annually, by January 31, the commission shall select one member as chair and one member as vice-chair to serve until January 31 of the following year or until the commission selects a new chair or vice-chair, whichever occurs later.\nThe commission may establish an executive committee and other committees of its members as it deems necessary or proper and may authorize them to exercise any powers of the commission except those expressly required by law to be exercised by the commission. The executive committee must have at least three members. The executive committee may approve contracts not to exceed $50,000 to provide necessary services and supplies to the commission.\nThe compensation, removal of members, and filling of vacancies on the commission are as provided in section 15.059.\nThe commission shall serve as the principal agency of the state to advocate on behalf of Minnesotans who are deaf, deafblind, and hard-of-hearing by working to ensure those persons have equal access to the services, programs, and opportunities available to others.\nThe commission shall:\n(1) assist persons who are deaf, deafblind, and hard-of-hearing and parents of students who are deaf, deafblind, and hard-of-hearing in advocating for equal access to services, programs, and opportunities;\n(2) advise the governor, the legislature, the judicial branch, and the commissioners of all state agencies on the development of policies, programs, and services affecting persons who are deaf, deafblind, and hard-of-hearing, and on the use of appropriate federal and state money;\n(3) create a public awareness of the special needs and potential of persons who are deaf, deafblind, and hard-of-hearing;\n(4) provide the governor, the legislature, and the commissioners of all state agencies with a review of ongoing services, programs, and proposed legislation affecting persons who are deaf, deafblind, and hard-of-hearing;\n(5) advise the governor, the legislature, the judicial branch, and the commissioners of all state agencies on statutes, rules, and policies necessary to ensure that persons who are deaf, deafblind, and hard-of-hearing have equal access to benefits and services provided to individuals in Minnesota;\n(6) recommend to the governor, the legislature, the judicial branch, and the commissioners of all state agencies legislation designed to improve the economic and social conditions of persons who are deaf, deafblind, and hard-of-hearing in Minnesota;\n(7) propose solutions to problems of persons who are deaf, deafblind, and hard-of-hearing in the areas of education, employment, human rights, human services, health, housing, and other related programs;\n(8) recommend to the governor, the legislature, and the commissioners of all state agencies any needed revisions in the state's affirmative action program and any other steps necessary to eliminate the underemployment or unemployment of deaf, deafblind, and hard-of-hearing persons in the state's work force;\n(9) work with other state and federal agencies and organizations to promote economic development for Minnesotans who are deaf, deafblind, and hard-of-hearing;\n(10) coordinate its efforts with other state and local agencies serving persons who are deaf, deafblind, and hard-of-hearing;\n(11) research, formulate, and present plans, programs, and policies that will serve the needs of persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing; and\n(12) encourage and assist in the development of coordinated, interdepartmental goals and objectives, and the coordination of programs, services, and facilities among all state departments, political subdivisions, and private providers of service as they relate to persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing.\nThe commission may appoint, subject to the approval of the governor, an executive director who must be experienced in administrative activities and familiar with the problems and needs of persons who are deaf, deafblind, and hard-of-hearing. The commission may delegate to the executive director any powers and duties under this section that do not require commission approval. The executive director serves in the unclassified service and may be removed at any time by a majority vote of the commission. The executive director shall coordinate the provision of necessary support services to the commission with the Deaf and Hard-of-Hearing Services Division. The executive director may employ and direct staff necessary to carry out commission mandates, policies, activities, and objectives.\nThe commission may contract in its own name. Contracts must be executed by the chair and the executive director. Contracts for more than $50,000 must be approved by a majority of the members of the commission. The commission may apply for, receive, and expend in its own name grants and gifts of money consistent with the powers and duties specified in this section.\nThe commission may prepare and distribute periodic reports to the state agency commissioners, the governor, and the legislature concerning the activities of the commission and the needs and concerns of Minnesotans who are deaf, deafblind, and hard-of-hearing.\n(a) The commission is subject to the requirements of chapter 13D, but may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the commission participating in the meeting, wherever their physical location, can communicate with one another and can hear, see, or feel all discussion and testimony;\n(2) members of the public present at the regular meeting location of the commission can hear, see, or feel all discussion and testimony and all votes of members of the commission;\n(3) at least one member of the commission is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so that each member's vote on each issue can be identified and recorded.\n(b) Each member of the commission participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(c) If telephone or other electronic means is used to conduct a meeting, the commission, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The commission may require the person making a connection to pay for documented marginal costs that the commission incurs as a result of the additional connection.\n(d) If telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the commission shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and of the provisions of paragraph (c).",
	"repealed": false
}