{
	"id": "121A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.26",
	"title": "121A.26 SCHOOL PREASSESSMENT TEAMS.",
	"text": "Every public school, and every nonpublic school that participates in a school district chemical abuse program shall establish a chemical abuse preassessment team. The preassessment team must be composed of classroom teachers, administrators, and to the extent they exist in each school, school nurse, school counselor or psychologist, social worker, chemical abuse specialist, and other appropriate professional staff. The superintendents or their designees shall designate the team members in the public schools. The preassessment team is responsible for addressing reports of chemical abuse problems and making recommendations for appropriate responses to the individual reported cases.\nWithin 45 days after receiving an individual reported case, the preassessment team shall make a determination whether to provide the student and, in the case of a minor, the student's parents with information about school and community services in connection with chemical abuse. Data may be disclosed without consent in health and safety emergencies pursuant to section 13.32 and applicable federal law and regulations.\nNotwithstanding section 138.163, destruction of records identifying individual students shall be governed by this section. If the preassessment team decides not to provide a student and, in the case of a minor, the student's parents with information about school or community services in connection with chemical abuse, records created or maintained by the preassessment team about the student shall be destroyed not later than six months after the determination is made. If the preassessment team decides to provide a student and, in the case of a minor, the student's parents with information about school or community services in connection with chemical abuse, records created or maintained by the preassessment team about the student shall be destroyed not later than six months after the student is no longer enrolled in the district.",
	"repealed": false
}