{
	"id": "181A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.06",
	"title": "181A.06 AGE CERTIFICATES.",
	"text": "Every employer shall require proof of the age of any minor employee or prospective employee by requiring the minor to submit an age certificate, a copy of the minor's birth record, a copy of the minor's driver's license, or a United States Department of Homeland Security Citizenship and Immigration Services Employment Eligibility Verification Form I-9. Upon the request of a minor, an age certificate shall be issued by or under the authority of the school superintendent of the district in which the applicant resides. Superintendents, principals, or headmasters of independent or parochial schools shall issue age certificates to minors who attend such schools.\nThe age certificate shall show the age of the minor, the date of birth, the date of issuance of the certificate, the name and position of the issuing officer, the name, address, and description of the minor, and what evidence was accepted as proof of age. The age certificate shall also show the name of the employer, the proposed occupation, and shall state that a separate employment certificate is required for minors under 16 to work on regular school days during school hours. It shall be signed by the issuing officer and by the minor in the officer's presence.\nAn age certificate shall not be issued unless the minor's birth record or photocopy or extract thereof is exhibited to the issuing officer, or unless such evidence was previously examined by the school authorities and the information is shown on the school records. If a birth record is not available, other documentary evidence shall be accepted only as provided by the rules or orders of the department.\nThe employer shall keep an age certificate for the duration of the minor's employment and shall keep on file all age certificates, copies of birth records or copies of drivers' licenses presented to the employer pursuant to subdivision 1, where they may be readily examined by an agent of the Division of Labor Standards.",
	"repealed": false
}