{
	"id": "327C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.02",
	"title": "327C.02 RENTAL AGREEMENTS.",
	"text": "Every agreement to rent a lot must be a written agreement signed by the park owner and the resident. A copy of the rental agreement shall be given to the applicant for the purpose of reviewing the agreement prior to signing it. The agreement must specify the terms and conditions in connection with the rental of the lot and must include:\n(1) the location of the lot and its address or site number;\n(2) the amount of rent per month and a statement of all personal property, services and facilities which the park owner agrees to provide to the resident;\n(3) the rights, duties and obligations of the parties, and all rules applicable to the resident;\n(4) the amount of any security deposit or other financial obligation imposed on the resident by the park owner; and\n(5) the name of any person holding a security interest in the resident's home.\nThe park owner must give the resident at least 60 days' notice in writing of any rule change. A rule adopted or amended after the resident initially enters into a rental agreement may be enforced against that resident only if the new or amended rule is reasonable and is not a substantial modification of the original agreement. Any security deposit increase is a substantial modification of the rental agreement. A reasonable rent increase made in compliance with section 327C.06 is not a substantial modification of the rental agreement and is not considered to be a rule for purposes of section 327C.015, subdivision 12. A rule change necessitated by government action is not a substantial modification of the rental agreement. A rule change requiring all residents to maintain their homes, sheds and other appurtenances in good repair and safe condition shall not be deemed a substantial modification of a rental agreement. If a part of a resident's home, shed or other appurtenance becomes so dilapidated that repair is impractical and total replacement is necessary, the park owner may require the resident to make the replacement in conformity with a generally applicable rule adopted after the resident initially entered into a rental agreement with the park owner.\nIn any action in which a rule change is alleged to be a substantial modification of the rental agreement, a court may consider the following factors in limitation of the criteria set forth in section 327C.015, subdivision 17:\n(1) any significant changes in circumstances which have occurred since the original rule was adopted and which necessitate the rule change; and\n(2) any compensating benefits which the rule change will produce for the residents.\nNotwithstanding section 504B.345, in an action to recover possession of land for violation of a new or amended rule, if the court finds that the rule is reasonable or is not a substantial modification, the court shall issue an order in favor of the plaintiff for costs. The court shall order the defendant to comply with the rule within ten days. If the resident fails to comply with the rule at any time after the time period provided by the court, the park owner may, upon a showing to the court that three days' written notice was given to the resident, move the court for writ of recovery to recover possession of the lot.\nA park owner may give notice as required by this section or sections 327C.03 and 327C.09: (1) personally, (2) by mailing the notice to the last known mailing address of the resident, or (3) by delivering the notice to the home of the resident. Notice by certified mail is effective even if the resident refuses to accept delivery. Service by delivery to the resident's home is effective if the notice is left at the home with someone of suitable age and discretion or is placed in a secure and conspicuous location at the home.\nAny attempt to waive or circumscribe any privilege or right guaranteed by law to a resident or a park owner is void.\nA prospective resident, before being asked to sign a rental agreement, must be given the following notice printed verbatim in boldface type of a minimum size of ten points. The notice must be provided with the park residency application. The notice must be posted in a conspicuous and public location in the park:\n\"IMPORTANT NOTICE\nState law provides special rules for the owners, residents, and prospective residents of manufactured home parks.\nYou may keep your home in the park as long as the park is in operation and you meet your financial obligations, obey state and local laws which apply to the park, obey reasonable park rules, do not substantially annoy or endanger the other residents or substantially endanger park personnel and do not substantially damage the park premises. You may not be evicted or have your rent increased or your services cut for complaining to the park owner or to a governmental official.\nIf you receive an eviction notice and do not leave the park, the park owner may take you to court. If you lose in court, a sheriff may remove you and your home from the park within seven days. Or, the court may require you to leave the park within seven days but give you 60 days to sell the home within the park.\nIf you receive an eviction notice for a new or amended rule and the court finds the rule to be reasonable and not a substantial modification of your original agreement, the court will not order you to leave but will order you to comply with the rule within ten days. If you do not comply within the time given or if you violate the rule at a later time, you will be subject to eviction.\nAll park rules and policies must be reasonable. Your rent may not be increased more than twice a year. Changes made in park rules after you become a park resident will not apply to you if they substantially change your original agreement.\nThe park may not charge you an entrance fee.\nThe park may require a security deposit, but the deposit must not amount to more than two months rent.\nYou have a right to sell the home in the park. But the sale is not final until the park owner approves the buyer as a new resident, and you must advise in writing anyone who wants to buy your home that the sale is subject to final approval by the park owner.\nThe park must provide to you, in writing, the procedures and criteria used to evaluate a prospective resident. If your application is denied, you can request, in writing, the reason why.\nYou must also disclose in writing certain safety information about your home to anyone who wants to buy it in the park. You must give this information to the buyer before the sale, in writing, on the form that is attached to this notice. You must completely and accurately fill out the form and you and the buyer should each keep a copy.\nYour rental agreement and the park rules contain important information about your rights and duties. Read them carefully and keep a copy.\nYou must be given a copy of the shelter or evacuation plan for the park. This document contains information on where to seek shelter in times of severe weather conditions. You should carefully review the plan and keep a copy.\nBy February 1 of each year, the park must give you a certificate of rent paid as required by Minnesota Statutes, sections 290.0693, subdivision 4, and 290A.19.\nFor further information concerning your rights, consult a private attorney. The state law governing the rental of lots in manufactured home parks may also be enforced by the Minnesota Attorney General.\"",
	"repealed": false
}