{
	"id": "256K.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/256K.47",
	"title": "256K.47 SAFE HARBOR SHELTER AND HOUSING.",
	"text": "The commissioner of human services must establish a safe harbor shelter and housing grant program. Under this grant program, the commissioner must award grants to providers who are committed to serving sexually exploited youth and youth at risk of sexual exploitation. Grantees must use grant money to provide street and community outreach programs, emergency shelter programs, or supportive housing programs consistent with the program descriptions in this section to address the specialized outreach, shelter, and housing needs of sexually exploited youth and youth at risk of sexual exploitation.\nYouth 24 years of age or younger are eligible for all shelter, housing beds, and services provided under this section and all services, support, and programs provided by the commissioner of health to sexually exploited youth and youth at risk of sexual exploitation under sections 145.4716 and 145.4717.\n(a) Street and community outreach programs must locate, contact, and provide information, referrals, and services to eligible youth.\n(b) Information, referrals, and services provided by street and community outreach programs may include but are not limited to:\n(1) family reunification services;\n(2) conflict resolution or mediation counseling;\n(3) assistance in obtaining temporary emergency shelter;\n(4) assistance in obtaining food, clothing, medical care, or mental health counseling;\n(5) counseling regarding violence, sexual exploitation, substance use, sexually transmitted infections, and pregnancy;\n(6) referrals to other agencies that provide support services to sexually exploited youth and youth at risk of sexual exploitation;\n(7) assistance with education, employment, and independent living skills;\n(8) aftercare services;\n(9) specialized services for sexually exploited youth and youth at risk of sexual exploitation, including youth experiencing homelessness and youth with mental health needs; and\n(10) services to address the prevention of sexual exploitation and homelessness.\n(a) Emergency shelter programs must provide eligible youth with referral and walk-in access to emergency short-term residential care. The program shall provide eligible youth with safe and dignified shelter that includes private shower facilities, beds, and meals each day and must assist eligible youth with reunification with that youth's family or legal guardian when required or appropriate.\n(b) The services provided at emergency shelters may include but are not limited to:\n(1) specialized services to address the trauma of sexual exploitation;\n(2) family reunification services;\n(3) individual, family, and group counseling;\n(4) assistance obtaining clothing;\n(5) access to medical and dental care and mental health counseling;\n(6) counseling regarding violence, sexual exploitation, substance use, sexually transmitted infections, and pregnancy;\n(7) education and employment services;\n(8) recreational activities;\n(9) advocacy and referral services;\n(10) independent living skills training;\n(11) aftercare and follow-up services;\n(12) transportation; and\n(13) services to address the prevention of sexual exploitation and homelessness.\n(a) Supportive housing programs must help eligible youth find and maintain safe and dignified housing and provide related supportive services and referrals. Supportive housing programs may also provide rental assistance.\n(b) The services provided in supportive housing programs may include but are not limited to:\n(1) specialized services to address the trauma of sexual exploitation;\n(2) education and employment services;\n(3) budgeting and money management;\n(4) assistance in securing housing appropriate to needs and income;\n(5) counseling regarding violence, sexual exploitation, substance use, sexually transmitted infections, and pregnancy;\n(6) referral for medical services or chemical dependency treatment;\n(7) parenting skills;\n(8) self-sufficiency support services and independent living skills training;\n(9) aftercare and follow-up services; and\n(10) services to address the prevention of sexual exploitation and homelessness prevention.\nMoney appropriated for this section may be expended on programs described in subdivisions 3 to 5, technical assistance, and capacity building to meet the greatest need on a statewide basis.",
	"repealed": false
}