{
	"id": "150A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.11",
	"title": "150A.11 UNLAWFUL ACTS.",
	"text": "It is unlawful for any person to: enable an unlicensed person to practice dentistry; to practice or attempt to practice dentistry without a license; to practice dentistry under the name of a corporation or company; or to practice under any name that may tend to deceive the public or imply professional superiority to or greater skill than that possessed by another dentist. If a dentist practices under the dentist's own name, any public display or cards shall include the initials of the dentist's dental degree, such as D.D.S. or D.M.D., following the name. If a dentist practices under another name, the name shall include some designation which makes clear that the person is practicing dentistry or a specialty of dentistry; and that the names of all of the participating dentists practicing under the name be clearly identified on letterheads and building or office signs that display a name other than the dentist's own name. Any communication between dentist and patient shall clearly indicate the name of the dentist treating the patient. The board may promulgate rules regarding the name under which a dentist may practice. No corporation shall practice dentistry or engage in it, or hold itself out as being entitled to practice dentistry, or furnish dental services or dentists, or advertise under or assume the title of dentists or dental surgeons or equivalent title. No corporation shall furnish dental advice, or advertise or hold itself out with any other person or alone, that it has or owns a dental office or can furnish dental service, dentists, or dental surgeons, or solicit, through itself, or its agents, officers, employees, directors or trustees, dental patronage for any dentist or dental surgeon. This section:\n(1) Does not apply to any licensee while acting as an instructor in or under the University of Minnesota, the Mayo Foundation, or any other school in the state recognized by the state Board of Dentistry;\n(2) Does not prohibit dentists from incorporating their practice of dentistry for business purposes under the special provisions of a corporate practice act for dentistry;\n(3) Shall not be construed to change or amend the right of licensed dentists to provide dental care under any form of organization that is lawful under the laws of this state, or to contract to sell their services in any manner that is lawful under the laws of this state.\nPublic advertising by dentists may be controlled by reasonable rules of the board. Such rules shall include permission for such things as publication of a professional card, reasonable signs on or about the place of business, announcements of changes or opening of offices and telephone listings.\nNo person shall advertise in any manner the sale, supply, furnishing, construction, reproduction, relining, or repair without a written work order by a licensed dentist of prosthetic dentures, bridges, plates or other appliances to be used or worn as substitutes for natural teeth, or for the regulation thereof. All such advertisements shall contain the words \"A written work order from a licensed dentist is required\" in at least 10-point type size. Except for advertising permitted under this subdivision, a person not licensed to practice dentistry in this state shall not sell or offer any such service or products to other than the dental profession or its ancillary trades, provided, however that the mere delivery of such products to an ultimate consumer or person acting in the consumer's behalf for the purpose of transporting such products to the licensed dentist who provided the work order shall not violate this subdivision. This subdivision shall not apply to mailings, displays, and advertisements the primary distribution of which is to the dental profession or its ancillary trades.\nIt shall be unlawful for any dentist to divide fees with or promise to pay a part of the dentist's fee to, or to pay a commission to, any dentist or other person who calls the dentist in consultation or who sends patients to the dentist for treatment, or operation, but nothing herein shall prevent licensed dentists from forming a bona fide partnership for the practice of dentistry, nor to the actual employment by a licensed dentist of, a licensed dental therapist, a licensed dental hygienist, or another licensed dentist.",
	"repealed": false
}