{
	"id": "84A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/84A.33",
	"title": "84A.33 COUNTY AUDITORS TO CERTIFY TAX-DELINQUENT LANDS.",
	"text": "As soon as practicable after the approval and acceptance of a project, the auditor of each county where the project is situated shall certify to the commissioner of management and budget a list of lands within the project, except lands within the boundaries of an incorporated city, upon which taxes are delinquent for three years or more, which have been bid in for the state at any delinquent tax sale, and not redeemed or assigned to any actual purchaser. The certificates must contain:\n(1) the legal description of each parcel of the land; and\n(2) the name and number of the ditch and the amount of the principal and interest of each delinquent drainage assessment as it appears on the county tax books for all years before the date of the certificate against each parcel of land, together with interest on the amount at six percent annually since the due date of the installment.\nOn or before June 15 in each year after the report, the county auditor shall certify to the commissioner of management and budget a list of lands within the boundaries of a project, except lands within the boundaries of a city, and except lands described in any previous certificate, and upon which taxes are delinquent for three years or more and which have been bid in for the state at any delinquent tax sale and not redeemed or assigned to an actual purchaser. The certificate must contain:\n(1) The legal description of each parcel of the land, contained in an earlier certificate upon which all taxes have been redeemed.\n(2) The legal description of each parcel of the lands which, on May 14 of the year when the certificate is furnished, is delinquent for three years or more.\n(3) The name and number of the ditch and the amount of the principal and interest of each delinquent ditch assessment installment as it appears on the county tax books for all years before the date of the certificate against each parcel of land, together with interest on the amount at an annual rate of six percent since the due date of each installment. The certificate must not contain the delinquent drainage assessment installments included in any certificate furnished earlier.\nWhen the delinquent drainage assessment installment on any parcel of land included in a certificate of the county auditor is redeemed, paid, or assigned to any person, the county auditor shall report the fact to the commissioner of management and budget. The county treasurer shall pay the commissioner of management and budget the amount paid in the county treasury on account of the delinquent drainage assessment installments.\n(a) Upon the approval and acceptance of a project and after each distribution of the tax collections for the June and November tax settlements, the county auditor shall certify to the commissioner of management and budget the following information about bonds issued to finance or refinance public drainage ditches wholly or partly within the projects, and the collection of assessments levied for the ditches:\n(1) the amount of principal and interest to become due on the bonds before the next tax settlement and distribution;\n(2) the amount of money collected from the drainage assessments and credited to the funds of the ditches, not already sent to the commissioner of management and budget as provided in sections 84A.31 to 84A.42; and\n(3) the amount of the deficit in the ditch fund of the county chargeable to the ditches.\n(b) On approving this certificate of the county auditor, the commissioner of management and budget shall issue a payment, payable out of the fund provided for in sections 84A.31 to 84A.42, and send it to the county treasurer of the county. These funds must be credited to the proper ditch of the county and placed in the ditch bond fund of the county, which is created, and used only to pay the ditch bonded indebtedness of the county assumed by the state under sections 84A.31 to 84A.42. The total amount of payments issued must not exceed in any one year the total amount of the deficit provided for under this section.\n(c) The state is subrogated to all title, right, interest, or lien of the county in or on the lands so certified within these projects.\n(d) As to public drainage ditches wholly within a project, the amount paid to, or for the benefit of, the county under this subdivision must never exceed the principal and interest of the bonds issued to finance or refinance a ditch outstanding on April 22, 1933, less money on hand in the county ditch fund to the credit of a ditch. These liabilities must be reduced from time to time by the amount of any payments of assessments extended after April 22, 1933, made by the owners of lands assessed before that date for benefits on account of the ditches.\n(e) As to public drainage ditches partly within and partly outside a project the amount paid from the fund pertaining to the project to or for the benefit of the county must never exceed a certain percentage of bonds issued to finance and refinance a ditch so outstanding, less money on hand in the county ditch fund to the credit of a ditch on April 22, 1932. The percentage must bear the same proportion to the whole amount of the bonds as the original benefits assessed against these lands within the project bear to the original total benefits assessed to the entire system for a ditch. This liability must be reduced from time to time by the payments of all assessments extended after April 22, 1933, made by the owners of lands within the project of assessments for benefits assessed before that date on account of a ditch.\nThe commissioner of management and budget may provide and prescribe forms for required reports and require any further information from county officials which the commissioner of management and budget finds necessary for the administration of sections 84A.31 to 84A.42.",
	"repealed": false
}