{
	"id": "176.102",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.102",
	"title": "176.102 REHABILITATION.",
	"text": "(a) This section applies only to vocational rehabilitation of injured employees and their spouses as provided under subdivision 1a. Physical rehabilitation of injured employees is considered treatment subject to section 176.135.\n(b) Rehabilitation is intended to restore the injured employee so the employee may return to a job related to the employee's former employment or to a job in another work area which produces an economic status as close as possible to that the employee would have enjoyed without disability. Rehabilitation to a job with a higher economic status than would have occurred without disability is permitted if it can be demonstrated that this rehabilitation is necessary to increase the likelihood of reemployment. Economic status is to be measured not only by opportunity for immediate income but also by opportunity for future income.\nUpon the request of a qualified dependent surviving spouse, rehabilitation services shall be provided through the rehabilitation services section of the Workers' Compensation Division. For the purposes of this subdivision a qualified dependent surviving spouse is a dependent surviving spouse, as determined under section 176.111, who is in need of rehabilitation assistance to become self-supporting. A spouse who is provided rehabilitation services under this subdivision is not entitled to compensation under subdivision 11.\nThe commissioner shall hire a director of rehabilitation services in the classified service. The commissioner shall monitor and supervise rehabilitation services, including, but not limited to, making determinations regarding the selection and delivery of rehabilitation services and the criteria used to approve qualified rehabilitation consultants and rehabilitation vendors. The commissioner may also make determinations regarding fees for rehabilitation services and shall by rule establish a fee schedule or otherwise limit fees charged by qualified rehabilitation consultants and vendors. The commissioner shall annually review the fees and give notice of any adjustment in the State Register. The commissioner may hire qualified personnel to assist in the commissioner's duties under this section and may delegate the duties and performance.\nThere is created a rehabilitation review panel composed of the commissioner or a designee, who shall serve as an ex officio member and two members each from employers, insurers, and rehabilitation, two licensed or registered health care providers, one chiropractor, and four members representing labor. The members shall be appointed by the commissioner and shall serve four-year terms which may be renewed. Terms, compensation, and removal for members shall be governed by section 15.0575. Notwithstanding section 15.059, this panel does not expire unless the panel no longer fulfills the purpose for which the panel was established, the panel has not met in the last 18 months, or the panel does not comply with the registration requirements of section 15.0599, subdivision 3. The panel shall select a chair. The panel shall review and make a determination with respect to appeals from orders of the commissioner regarding certification approval of qualified rehabilitation consultants, qualified rehabilitation consultant firms, and vendors. The hearings are de novo and initiated by the panel under the contested case procedures of chapter 14, and are appealable to the Workers' Compensation Court of Appeals in the manner provided by section 176.421.\nThe panel has authority to discipline qualified rehabilitation consultants and vendors and may impose a penalty of up to $3,000 per violation, payable to the commissioner for deposit in the assigned risk safety account, and may suspend or revoke certification. Complaints against registered qualified rehabilitation consultants and vendors shall be made to the commissioner who may investigate complaints. If the investigation indicates a violation of this chapter or rules adopted under this chapter, the commissioner may initiate a contested case proceeding under the provisions of chapter 14. In these cases, the rehabilitation review panel shall make the final decision following receipt of the report of an administrative law judge. The decision of the panel is appealable to the Workers' Compensation Court of Appeals in the manner provided by section 176.421. The panel shall continuously study rehabilitation services and delivery, develop and recommend rehabilitation rules to the commissioner, and assist the commissioner in accomplishing public education.\nThe commissioner may appoint alternates for one-year terms to serve as a member when a member is unavailable. The number of alternates shall not exceed one labor member, one employer or insurer member, and one member representing a licensed or registered health care provider, chiropractic, or rehabilitation.\nRecommendations from the administrative law judge following a contested case hearing shall be determined by the panel. The panel may adopt rules of procedure which may be joint rules with the Medical Services Review Board.\n(a) Except where the rehabilitation review panel is making a decision in a contested case matter under subdivision 3, 3a, or 3b, the panel may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the panel participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the panel can hear clearly all discussion and testimony and all votes of members of the panel and, if needed, receive those services required by sections 15.44 and 15.441;\n(3) at least one member of the panel is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(b) Each member of the panel participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(c) If telephone or other electronic means are used to conduct a regular, special, or emergency meeting, the panel, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The panel or the Department of Labor and Industry may require the person making such a connection to pay for documented costs that the panel or the Department of Labor and Industry incurs as a result of the additional connection.\n(d) If telephone or other electronic means are used to conduct a regular, special, or emergency meeting, the panel shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and that a person may monitor the meeting electronically from a remote location. The timing and method of providing notice is governed by section 13D.04.\n(a) A rehabilitation consultation must be provided by the employer to an injured employee upon request of the employee, the employer, or the commissioner. When the commissioner has received notice or information that an employee has sustained an injury that may be compensable under this chapter, the commissioner must notify the injured employee of the right to request a rehabilitation consultation to assist in return to work. The notice may be included in other information the commissioner gives to the employee under section 176.235, and must be highlighted in a way to draw the employee's attention to it. If a rehabilitation consultation is requested, the employer shall provide a qualified rehabilitation consultant. If the injured employee objects to the employer's selection, the employee may select a qualified rehabilitation consultant of the employee's own choosing within 60 days following the filing of a copy of the employee's rehabilitation plan with the commissioner. If the consultation indicates that rehabilitation services are appropriate under subdivision 1, the employer shall provide the services. If the consultation indicates that rehabilitation services are not appropriate under subdivision 1, the employer shall notify the employee of this determination within 14 days after the consultation.\n(b) In order to assist the commissioner in determining whether or not to request rehabilitation consultation for an injured employee, an employer shall notify the commissioner whenever the employee's temporary total disability will likely exceed 13 weeks. The notification must be made within 90 days from the date of the injury or when the likelihood of at least a 13-week disability can be determined, whichever is earlier, and must include a current physician's report.\n(c) The qualified rehabilitation consultant shall disclose in writing at the first meeting or written communication with the employee any ownership interest or affiliation between the firm which employs the qualified rehabilitation consultant and the employer, insurer, adjusting or servicing company, including the nature and extent of the affiliation or interest. The consultant shall also disclose to all parties any affiliation, business referral or other arrangement between the consultant or the firm employing the consultant and any other party, attorney, or health care provider involved in the case.\n(d) After the initial provision or selection of a qualified rehabilitation consultant as provided under paragraph (a), the employee may request a different qualified rehabilitation consultant which shall be granted or denied by the commissioner or compensation judge according to the best interests of the parties.\n(e) The employee and employer shall enter into a program if one is prescribed in a rehabilitation plan within 30 days of the rehabilitation consultation if the qualified rehabilitation consultant determines that rehabilitation is appropriate. A copy of the plan, including a target date for return to work, shall be submitted to the commissioner within 15 days after the plan has been developed.\n(f) If the employer does not provide rehabilitation consultation requested under paragraph (a), the commissioner or compensation judge shall notify the employer that if the employer fails to provide a qualified rehabilitation consultant within 15 days to conduct a rehabilitation consultation, the commissioner or compensation judge shall appoint a qualified rehabilitation consultant to provide the consultation at the expense of the employer unless the commissioner or compensation judge determines the consultation is not required.\n(g) In developing a rehabilitation plan consideration shall be given to the employee's qualifications, including but not limited to age, education, previous work history, interest, transferable skills, and present and future labor market conditions.\n(h) The commissioner or compensation judge may waive rehabilitation services under this section if the commissioner or compensation judge is satisfied that the employee will return to work in the near future or that rehabilitation services will not be useful in returning an employee to work.\n(a) On-the-job training is to be given consideration in developing a rehabilitation plan especially where it would produce an economic status similar to that enjoyed prior to disability.\n(b) For purposes of this subdivision, job development means systematic contact with prospective employers resulting in opportunities for interviews and employment that might not otherwise have existed, and includes identification of job leads and arranging for job interviews. Job development facilitates a prospective employer's consideration of a qualified employee for employment. Job development services provided by a qualified rehabilitation consultant firm or a registered rehabilitation vendor must not exceed 20 hours per month or 26 consecutive or intermittent weeks. When 13 consecutive or intermittent weeks of job development services have been provided, the qualified rehabilitation consultant must consult with the parties and either file a plan amendment reflecting an agreement by the parties to extend job development services for up to an additional 13 consecutive or intermittent weeks, or file a request for a rehabilitation conference under section 176.106. The commissioner or compensation judge may issue an order modifying the rehabilitation plan or make other determinations about the employee's rehabilitation, but must not order more than 26 total consecutive or intermittent weeks of job development services.\n(a) The commissioner or a compensation judge shall determine eligibility for rehabilitation services and shall review, approve, modify, or reject rehabilitation plans developed under subdivision 4. The commissioner or a compensation judge shall also make determinations regarding rehabilitation issues not necessarily part of a plan including, but not limited to, determinations regarding whether an employee is eligible for further rehabilitation and the benefits under subdivisions 9 and 11 to which an employee is entitled.\n(b) A rehabilitation consultant must file a progress report on the plan with the commissioner six months after the plan is filed. The progress report must include a current estimate of the total cost and the expected duration of the plan. The commissioner may require additional progress reports. Based on the progress reports and available information, the commissioner may take actions including, but not limited to, redirecting, amending, suspending, or terminating the plan.\n[Repealed, 1987 c 332 s 117]\nUpon request by the commissioner, insurer, employer or employee, medical and rehabilitation reports shall be made by the provider of the medical and rehabilitation service to the commissioner, insurer, employer or employee.\n(a) Upon request to the commissioner or compensation judge by the employer, the insurer, or employee, or upon the commissioner's own request, the plan may be suspended, terminated, or altered upon a showing of good cause, including:\n(1) a physical impairment that does not allow the employee to pursue the rehabilitation plan;\n(2) the employee's performance level indicates the plan will not be successfully completed;\n(3) an employee does not cooperate with a plan;\n(4) that the plan or its administration is substantially inadequate to achieve the rehabilitation plan objectives;\n(5) that the employee is not likely to benefit from further rehabilitation services.\n(b) An employee may request a change in a rehabilitation plan once because the employee feels ill-suited for the type of work for which rehabilitation is being provided. If the rehabilitation plan includes retraining, this request must be made within 90 days of the beginning of the retraining program.\n(a) An employer is liable for the following rehabilitation expenses under this section:\n(1) cost of rehabilitation evaluation and preparation of a plan;\n(2) cost of all rehabilitation services and supplies necessary for implementation of the plan;\n(3) reasonable cost of tuition, books, travel, and custodial day care; and, in addition, reasonable costs of board and lodging when rehabilitation requires residence away from the employee's customary residence;\n(4) reasonable costs of travel and custodial day care during the job interview process;\n(5) reasonable cost for moving expenses of the employee and family if a job is found in a geographic area beyond reasonable commuting distance after a diligent search within the present community. Relocation shall not be paid more than once during any rehabilitation program, and relocation shall not be required if the new job is located within the same standard metropolitan statistical area as the employee's job at the time of injury. An employee shall not be required to relocate and a refusal to relocate shall not result in a suspension or termination of compensation under this chapter; and\n(6) any other expense agreed to be paid.\n(b) Charges for services provided by a rehabilitation consultant or vendor must be submitted on a billing form prescribed by the commissioner. No payment for the services shall be made until the charges are submitted on the prescribed form.\n(c) Except as provided in this paragraph, an employer is not liable for charges for services provided by a rehabilitation consultant or vendor unless the employer or its insurer receives a bill for those services within 45 days of the provision of the services. The commissioner or a compensation judge may order payment for charges not timely billed under this paragraph if the rehabilitation consultant or vendor can prove that the failure to submit the bill as required by this paragraph was due to circumstances beyond the control of the rehabilitation consultant or vendor. A rehabilitation consultant or vendor may not collect payment from any other person, including the employee, for bills that an employer is relieved from liability for paying under this paragraph.\n(a) The commissioner shall approve rehabilitation consultants who may propose and implement plans if they satisfy rules adopted by the commissioner for rehabilitation consultants. A consultant may be an individual or public or private entity, and except for rehabilitation services, Department of Employment and Economic Development, a consultant may not be a vendor or the agent of a vendor of rehabilitation services. The commissioner shall also approve rehabilitation vendors if they satisfy rules adopted by the commissioner. An employer or insurer must be approved by the commissioner as a qualified rehabilitation firm and create an account in CAMPUS as a firm to employ a qualified rehabilitation consultant to provide rehabilitation services to an employee under this section.\n(b) An applicant to be a qualified rehabilitation consultant intern must file in CAMPUS a plan of supervision prescribed by the commissioner and signed by the supervisor at the time the application is filed. The supervisor must be employed as a qualified rehabilitation consultant by the same firm as the intern applicant and meet experience requirements prescribed in rule by the commissioner. In the plan of supervision, the supervisor must agree to verify that the intern complies with all rehabilitation rules and statutes during the internship. All documents related to an employee's rehabilitation prepared by the intern that are filed with the commissioner must be reviewed by the supervisor before they are filed. The supervisor need not sign the intern's written work, but the intern must verify that the supervisor has reviewed the document at the time the document is filed with the commissioner in CAMPUS. An intern must file a new signed plan of supervision if there is a change of supervisors.\n(c) An individual qualified rehabilitation consultant registered by the commissioner must not provide any medical, rehabilitation, or disability case management services related to an injury that is compensable under this chapter when these services are part of the same claim, unless the case management services are part of an approved rehabilitation plan.\n(a) Retraining is limited to 156 weeks. An employee who has been approved for retraining may petition the commissioner or compensation judge for additional compensation not to exceed 25 percent of the compensation otherwise payable. If the commissioner or compensation judge determines that this additional compensation is warranted due to unusual or unique circumstances of the employee's retraining plan, the commissioner may award additional compensation in an amount not to exceed the employee's request. This additional compensation shall cease at any time the commissioner or compensation judge determines the special circumstances are no longer present.\n(b) If the employee is not employed during a retraining plan that has been specifically approved under this section, temporary total compensation is payable for up to 90 days after the end of the retraining plan; except that, payment during the 90-day period is subject to cessation in accordance with section 176.101. If the employee is employed during the retraining plan but earning less than at the time of injury, temporary partial compensation is payable at the rate of 66-2/3 percent of the difference between the employee's weekly wage at the time of injury and the weekly wage the employee is able to earn in the employee's partially disabled condition, subject to the maximum rate for temporary total compensation. Temporary partial compensation is not subject to the 275-week or 450-week limitations provided by section 176.101, subdivision 2, during the retraining plan, but is subject to those limitations before and after the plan.\n(c) Any request for retraining shall be filed with the commissioner before 208 weeks of any combination of temporary total or temporary partial compensation have been paid. Retraining shall not be available after 208 weeks of any combination of temporary total or temporary partial compensation benefits have been paid unless the request for the retraining has been filed with the commissioner prior to the time the 208 weeks of compensation have been paid.\n(d) The employer or insurer must notify the employee in writing of the 208-week limitation for filing a request for retraining with the commissioner. This notice must be given before 80 weeks of temporary total disability or temporary partial disability compensation have been paid, regardless of the number of weeks that have elapsed since the date of injury. If the notice is not given before the 80 weeks, the period of time within which to file a request for retraining is extended by the number of days the notice is late, but in no event may a request be filed later than 225 weeks after any combination of temporary total disability or temporary partial disability compensation have been paid. The commissioner may assess a penalty of $25 per day that the notice is late, up to a maximum penalty of $2,000, against an employer or insurer for failure to provide the notice. The penalty is payable to the commissioner for deposit in the assigned risk safety account.\nThis section is applicable to all employees injured prior to or on and after October 1, 1979, except for those provisions which affect an employee's monetary benefits.\n[Repealed, 1983 c 290 s 173]\n(a) All benefits payable under chapter 176 may, after a determination and order by the commissioner or compensation judge, be discontinued or forfeited for any time during which the employee refuses to submit to any reasonable examinations and evaluative procedures ordered by the commissioner or compensation judge to determine the need for and details of a plan of rehabilitation, or refuses to participate in rehabilitation evaluation as required by this section or does not make a good faith effort to participate in a rehabilitation plan. A discontinuance under this section is governed by sections 176.238 and 176.239.\n(b) Once the employer or insurer has accepted liability for a claim and a rehabilitation plan has been approved, the employer or insurer may not discontinue payment of rehabilitation services until notice has been filed with the commissioner and served on the qualified rehabilitation consultant, the employee, and the attorney representing the employee, if any. The notice shall state the date of intended discontinuance and set forth a statement of facts clearly indicating the reason for the action. Copies of whatever medical reports or other written reports in the employer's or insurer's possession which are relied on for the discontinuance shall be attached to the notice.\nThe commissioner shall impose fees sufficient to cover the cost of approving and monitoring qualified rehabilitation consultants, consultant firms, and vendors of rehabilitation services. These fees are payable to the commissioner for deposit in the special compensation fund.",
	"repealed": false
}