{
	"id": "144A.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.135",
	"title": "144A.135 TRANSFER AND DISCHARGE APPEALS.",
	"text": "(a) The commissioner shall establish a mechanism for hearing appeals on transfers and discharges of residents by nursing homes or boarding care homes licensed by the commissioner. The commissioner may adopt permanent rules to implement this section.\n(b) Until federal regulations are adopted under sections 1819(f)(3) and 1919(f)(3) of the Social Security Act that govern appeals of the discharges or transfers of residents from nursing homes and boarding care homes certified for participation in Medicare or medical assistance, the commissioner shall provide hearings under sections 14.57 to 14.62 and the rules adopted by the Office of Administrative Hearings governing contested cases. To appeal the discharge or transfer, or notification of an intended discharge or transfer, a resident or the resident's representative must request a hearing in writing no later than 30 days after receiving written notice, which conforms to state and federal law, of the intended discharge or transfer.\n(c) Hearings under this section shall be held no later than 14 days after receipt of the request for hearing, unless impractical to do so or unless the parties agree otherwise. Hearings shall be held in the facility in which the resident resides, unless impractical to do so or unless the parties agree otherwise.\n(d) A resident who timely appeals a notice of discharge or transfer, and who resides in a certified nursing home or boarding care home, may not be discharged or transferred by the nursing home or boarding care home until resolution of the appeal. The commissioner can order the facility to readmit the resident if the discharge or transfer was in violation of state or federal law. If the resident is required to be hospitalized for medical necessity before resolution of the appeal, the facility shall readmit the resident unless the resident's attending physician, advanced practice registered nurse, or physician assistant documents, in writing, why the resident's specific health care needs cannot be met in the facility.\n(e) The commissioner and Office of Administrative Hearings shall conduct the hearings in compliance with the federal regulations described in paragraph (b), when adopted.\n(f) Nothing in this section limits the right of a resident or the resident's representative to request or receive assistance from the Office of Ombudsman for Long-Term Care or the Office of Health Facility Complaints with respect to an intended discharge or transfer.\n(g) A person required to inform a health care facility of the person's status as a registered predatory offender under section 243.166, subdivision 4b, who knowingly fails to do so shall be deemed to have endangered the safety of individuals in the facility under Code of Federal Regulations, chapter 42, section 483.12. Notwithstanding paragraph (d), any appeal of the notice and discharge shall not constitute a stay of the discharge.",
	"repealed": false
}