{
	"id": "123B.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.94",
	"title": "123B.94 COMMON SCHOOL DISTRICTS; MEETINGS, ELECTIONS.",
	"text": "The annual meeting of all common districts must be held on the last Tuesday in June, at 8:00 p.m., unless a different hour has been fixed at the preceding annual meeting. The clerk shall give notice of the meeting, specifying the matters to come before such meeting. Failure of the clerk to give such notice, or to specify the business to be transacted, shall not affect the validity of any business, except the raising of money to build or purchase a school house, the authorizing of an issue of bonds, the fixing of a school house site, or the organization as an independent district. At the annual meeting in a common district five legal voters shall constitute a quorum. The chair and clerk of the board shall officiate in their respective capacities at all meetings of the electors of the district. In the event of the absence of the chair or clerk, the voters shall elect a chair or clerk pro tem. The voters shall have the power in an annual meeting to repeal and modify their proceedings. The polls at all meetings shall be open at least one hour.\nThe annual meeting must have power to elect, by ballot, officers of the district. In all elections or vote by ballot, the clerk shall record the names of all voters participating therein and the chair shall appoint two electors. The electors, with the assistance of the clerk, shall supervise the balloting and canvass the votes. If any candidates receive an equal number of votes for an office, the board shall resolve the tie by lot.\nAny person desiring to be a candidate for a district office at the annual meeting of the district shall file with the clerk of the district an application to be placed on the ballot for such office. Any five voters of the district may file an application for or on behalf of any qualified voter in the district that they desire to be a candidate. Applications shall be filed not less than 12 days before the annual district meeting. The clerk of the district, in the notice of annual meeting, shall state the names of the candidates for whom applications have been filed, failure to do so shall not affect the validity of the election thereafter held. At the annual meeting of common districts, nomination of candidates for offices may be made from the floor by any qualified voter.\nThe clerk shall prepare, at the expense of the district, necessary ballots for the election of officers placing thereon the names of the proposed candidates for such office with a blank space after such names. The ballots shall be marked as official ballots, and shall be used to the exclusion of all other ballots at such annual meeting or election in the election of officers of the district.\nAt the first meeting of each district, the chair shall be elected to hold office until July 1 following the next annual meeting. The treasurer, until one year from such date, and the clerk until two years from such date.\nA board member elected at an annual meeting upon notice from the clerk, shall, on or before the first Saturday in July, file with the clerk an acceptance of the office and an official oath. Any person appointed by the board or elected at a special meeting to fill a vacancy shall file in writing an acceptance of the office and an official oath within ten days after the notice of such appointment or election by the clerk. A person who fails to qualify prior to the time specified shall be deemed to have refused to serve, but such filing, if made at any time before action to fill the vacancy has been taken, shall be sufficient.\nUpon the filing of a petition therefor, executed by five eligible voters, as defined in Minnesota Election Law, of the common district, specifying the business to be acted upon, or upon the adoption of a proper resolution so specifying, signed by a majority of the members of the board, the clerk shall call a special meeting of the district. The clerk shall give ten days' posted notice and one week's published notice if there be a newspaper printed in the district and specify in the notice the business named in the request or resolution and the time and place of the meeting. If there is no clerk in the district or if the clerk fails for three days after receiving a request or resolution to give notice of a meeting, it may be called by like notice by five eligible voters, as defined in Minnesota Election Law, of the district. No business except that named in the notice shall be transacted at the meeting. If there are not five eligible voters, as defined in Minnesota Election Law, or if there is not a board therein, the county auditor may call a special meeting by giving notice thereof as provided in this section. The voters at a special meeting have power to repeal or modify their proceedings.",
	"repealed": false
}