{
	"id": "342.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.36",
	"title": "342.36 CANNABIS TRANSPORTER OPERATIONS.",
	"text": "Before transporting immature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products, a cannabis transporter shall obtain a shipping manifest on a form established by the office. The manifest must be kept with the products at all times and the cannabis transporter must maintain a copy of the manifest in its records.\nRecords of transportation must be kept for a minimum of three years at the cannabis transporter's place of business and are subject to inspection upon request by the office or law enforcement agency. Records of transportation include the following:\n(1) copies of transportation manifests for all deliveries;\n(2) a transportation log documenting the chain of custody for each delivery, including every employee and vehicle used during transportation; and\n(3) financial records showing payment for transportation services.\nImmature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, and hemp-derived consumer products must be transported in a locked, safe, and secure storage compartment that is part of the motor vehicle or in a locked storage container that has a separate key or combination pad. Items being transported may not be visible from outside the motor vehicle.\nNo vehicle or trailer may contain an image depicting the types of items being transported, including but not limited to an image depicting a cannabis or hemp leaf, or a name suggesting that the vehicle is used in transporting immature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products.\nA cannabis transporter shall ensure that all delivery times and routes are randomized.\nAll cannabis transporter vehicles transporting immature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products must be staffed with a minimum of two employees. At least one delivery team member shall remain with the motor vehicle at all times that the motor vehicle contains immature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products.\nOnly a cannabis worker employed by or contracted with the cannabis transporter and who is at least 21 years of age may transport immature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products. All passengers in a vehicle must be cannabis workers employed by or contracted with the cannabis transporter.\nAll drivers must carry a valid driver's license with the proper endorsements when operating a vehicle transporting immature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products.\nAny vehicle assigned for the purposes of transporting immature cannabis plants and seedlings, cannabis flower, cannabis products, artificially derived cannabinoids, hemp plant parts, hemp concentrate, lower-potency hemp edibles, or hemp-derived consumer products is subject to inspection and may be stopped or inspected at any licensed cannabis business or while en route during transportation.",
	"repealed": false
}