{
	"id": "641.262",
	"url": "https://www.revisor.mn.gov/statutes/cite/641.262",
	"title": "641.262 ESTABLISHMENT OF REGIONAL JAILS BY CONTIGUOUS COUNTIES.",
	"text": "Two or more counties, each contiguous at one or more points with one or more of the other counties, may cooperate to establish, operate, and maintain a regional jail in the manner provided in sections 641.261 to 641.266. A county may join with other counties in the establishment, operation, and maintenance of a regional jail by majority vote of its county board. A county board so voting shall also appropriate its approximate proportionate share of the initial expenses of the proposed county regional jail, which proportion is estimated in the manner provided in section 641.264, subdivision 2, and which is paid over upon receiving notice from the regional jail board as provided in section 641.263, subdivision 1.\nThe county board of each cooperating county shall appoint two members to a board to be known as the regional jail board. Members appointed to the board shall be county commissioners. One of the members first appointed to the regional jail board shall be appointed for a term expiring on June 30 next following appointment, the other for a term expiring one year later. After the appointment of the first members, one succeeding member shall be appointed each year for a two-year period beginning on July 1. Each appointee shall hold office until a successor is appointed and has qualified. Vacancies are filled by the appointing power. The members of the regional jail board serve without compensation but shall be reimbursed for all necessary expenses incurred by them in performance of their official duties. This reimbursement is payable by the county from which the member is appointed, until the regional jail fund is established. When the regional jail fund is established, reimbursement shall be made from that fund. Reimbursement authorized by this subdivision is in addition to any reimbursement received by a regional jail board member who is also a member of a county board.\nAs soon as possible after the appointment of the members of the regional jail board by the cooperating counties, the regional jail board shall hold a joint meeting and shall elect a chair, vice-chair, and secretary. The county board of the county first appointing members to the regional jail board shall call the first meeting of the board and shall designate the place of meeting. The regional jail board shall meet at least annually thereafter at a place designated by the regional jail board and may meet at such other times and places as it considers necessary.",
	"repealed": false
}