{
	"id": "241.067",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.067",
	"title": "241.067 RELEASE OF INMATES; DUTIES OF COMMISSIONER.",
	"text": "When releasing an inmate from prison, the commissioner shall:\n(1) provide the inmate with a copy of the inmate's unofficial criminal history compiled by the department and marked as unofficial;\n(2) provide information to the inmate on how to obtain the inmate's full official criminal history from the Bureau of Criminal Apprehension;\n(3) provide general information to the inmate describing the laws and processes for obtaining an expungement of the inmate's criminal record;\n(4) provide general information on the inmate's right to vote;\n(5) provide the inmate with current information on local career workforce centers in the county in which the inmate will reside and, upon the inmate's request, other counties;\n(6) provide the inmate with a record of the programs that the inmate completed while in prison;\n(7) provide the inmate with an accounting of any court-ordered payments, fines, and fees owed by the inmate upon release of which the department has knowledge;\n(8) provide assistance to the inmate in obtaining a Social Security card;\n(9) provide the inmate with a medical discharge summary;\n(10) provide the inmate with information on how the inmate may obtain a complete copy of the inmate's medical record at no charge to the inmate; and\n(11) provide the inmate with general information on the Supplemental Nutrition Assistance Program (SNAP) benefits, eligibility criteria, and application process.\n(a) Upon the request of an inmate, the commissioner shall assist the inmate in obtaining a copy of the inmate's birth certificate at no cost to the inmate. This assistance does not apply to inmates who (1) upon intake have six months or less remaining in their term of imprisonment, (2) already have an accessible copy of their birth certificate available or other valid identification, or (3) already have a valid photograph on file with the Department of Public Safety that may be used as proof of identity for renewing an identification document.\n(b) The commissioner, in collaboration with the Department of Public Safety, shall facilitate the provision of a state identification card to an inmate at no cost to the inmate under the same criteria described in paragraph (a) relating to birth certificates, provided the inmate possesses the necessary qualifying documents to obtain the card.\n(c) The commissioner shall inform inmates of the commissioner's duties under paragraphs (a) and (b) upon intake and again upon the initiation of release planning.\nAt least 45 days before the scheduled release of an inmate, the commissioner shall offer to assist the inmate in completing an application for medical assistance or MinnesotaCare and shall provide the assistance if the inmate accepts the offer.\n(a) When releasing an inmate from prison, the commissioner shall provide the inmate with a one-month supply of any non-narcotic medications that have been prescribed to the inmate and a prescription for a 30-day supply of these medications that may be refilled twice.\n(b) Paragraph (a) applies only to the extent the requirement is consistent with clinical guidelines and permitted under state and federal law.\n(c) Nothing in this subdivision overrides the requirements in section 244.054.\nWith the exception of subdivision 4, this section does not apply to inmates who are being imprisoned for a release violation. The requirements in subdivision 4 apply to all inmates being released.",
	"repealed": false
}