{
	"id": "62D.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.17",
	"title": "62D.17 PENALTIES AND ENFORCEMENT.",
	"text": "The commissioner of health may, for any violation of statute or rule applicable to a health maintenance organization, or in lieu of suspension or revocation of a certificate of authority under section 62D.15, levy an administrative penalty in an amount up to $25,000 for each violation. In the case of contracts or agreements made pursuant to section 62D.05, subdivisions 2 to 4, each contract or agreement entered into or implemented in a manner which violates sections 62D.01 to 62D.30 shall be considered a separate violation. In determining the level of an administrative penalty, the commissioner shall consider the following factors:\n(1) the number of enrollees affected by the violation;\n(2) the effect of the violation on enrollees' health and access to health services;\n(3) if only one enrollee is affected, the effect of the violation on that enrollee's health;\n(4) whether the violation is an isolated incident or part of a pattern of violations; and\n(5) the economic benefits derived by the health maintenance organization or a participating provider by virtue of the violation.\nReasonable notice in writing to the health maintenance organization shall be given of the intent to levy the penalty and the reasons therefor, and the health maintenance organization may have 15 days within which to file a written request for an administrative hearing and review of the commissioner of health's determination. Such administrative hearing shall be subject to judicial review pursuant to chapter 14. If an administrative penalty is levied, the commissioner must divide 50 percent of the amount among any enrollees affected by the violation, unless the commissioner certifies in writing that the division and distribution to enrollees would be too administratively complex or that the number of enrollees affected by the penalty would result in a distribution of less than $50 per enrollee.\nAny person who violates sections 62D.01 to 62D.30 or knowingly submits false information in any report required hereunder shall be guilty of a misdemeanor.\n(a) If the commissioner of health shall, for any reason, have cause to believe that any violation of sections 62D.01 to 62D.30 has occurred or is threatened, the commissioner of health may, before commencing action under sections 62D.15 and 62D.16, and subdivision 1, give notice to the health maintenance organization and to the representatives, or other persons who appear to be involved in such suspected violation, to arrange a voluntary conference with the alleged violators or their authorized representatives for the purpose of attempting to ascertain the facts relating to such suspected violation and, in the event it appears that any violation has occurred or is threatened, to arrive at an adequate and effective means of correcting or preventing such violation.\n(b) Proceedings under this subdivision shall not be governed by any formal procedural requirements, and may be conducted in such manner as the commissioner of health may deem appropriate under the circumstances.\n(a) The commissioner of health may issue an order directing a health maintenance organization or a representative of a health maintenance organization to cease and desist from engaging in any act or practice in violation of the provisions of sections 62D.01 to 62D.30.\n(1) The cease and desist order may direct a health maintenance organization to pay for or provide a service when that service is required by statute or rule to be provided.\n(2) The commissioner may issue a cease and desist order directing a health maintenance organization to pay for a service that is required by statute or rule to be provided, only if there is a demonstrable and irreparable harm to the public or an enrollee.\n(3) If the cease and desist order involves a dispute over the medical necessity of a procedure based on its experimental nature, the commissioner may issue a cease and desist order only if the following conditions are met:\n(i) the commissioner has consulted with appropriate and identified experts;\n(ii) the commissioner has reviewed relevant scientific and medical literature; and\n(iii) the commissioner has considered all other relevant factors including whether final approval of the technology or procedure has been granted by the appropriate government agency; the availability of scientific evidence concerning the effect of the technology or procedure on health outcomes; the availability of scientific evidence that the technology or procedure is as beneficial as established alternatives; and the availability of evidence of benefit or improvement without the technology or procedure.\n(b) Within 20 days after service of the order to cease and desist, the respondent may request a hearing on the question of whether acts or practices in violation of sections 62D.01 to 62D.30 have occurred. Such hearings shall be subject to judicial review as provided by chapter 14.\nIf the acts or practices involve violation of the reporting requirements of section 62D.08, or if the commissioner has ordered the rehabilitation, liquidation, or conservation of the health maintenance organization in accordance with section 62D.18, the health maintenance organization may request an expedited hearing on the matter. The hearing shall be held within 15 days of the request. Within ten days thereafter, an administrative law judge shall issue a recommendation on the matter. The commissioner shall make a final determination on the matter within ten days of receipt of the administrative law judge's recommendation.\nWhen a request for a stay accompanies the hearing request, the matter shall be referred to the Office of Administrative Hearings within three working days of receipt of the request. Within ten days thereafter, an administrative law judge shall issue a recommendation to grant or deny the stay. The commissioner shall grant or deny the stay within five days of receipt of the administrative law judge's recommendation.\nTo the extent the acts or practices alleged do not involve (1) violations of section 62D.08; (2) violations which may result in the financial insolvency of the health maintenance organization; (3) violations which threaten the life and health of enrollees; (4) violations which affect whole classes of enrollees; or (5) violations of benefits or service requirements mandated by law; if a timely request for a hearing is made, the cease and desist order shall be stayed for a period of 90 days from the date the hearing is requested or until a final determination is made on the order, whichever is earlier. During this stay, the respondent may show cause why the order should not become effective upon the expiration of the stay. Arguments on this issue shall be made through briefs filed with the administrative law judge no later than ten days prior to the expiration of the stay.\nIn the event of noncompliance with a cease and desist order issued pursuant to subdivision 4, the commissioner of health may institute a proceeding to obtain injunctive relief or other appropriate relief in Ramsey County District Court.",
	"repealed": false
}