{
	"id": "245C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.05",
	"title": "245C.05 BACKGROUND STUDY; INFORMATION AND DATA PROVIDED TO COMMISSIONER.",
	"text": "(a) The individual who is the subject of the background study must provide the applicant, license holder, or other entity under section 245C.04 with sufficient information to ensure an accurate study, including:\n(1) the individual's first, middle, and last name and all other names by which the individual has been known;\n(2) current home address, city, and state of residence;\n(3) current zip code;\n(4) sex;\n(5) date of birth;\n(6) driver's license number or state identification number or, for those without a driver's license or state identification card, an acceptable form of identification as determined by the commissioner; and\n(7) upon implementation of NETStudy 2.0, the home address, city, county, and state of residence for the past five years.\n(b) Every subject of a background study conducted or initiated by counties or private agencies under this chapter must also provide the home address, city, county, and state of residence for the past five years.\n(c) Every subject of a background study related to private agency adoptions or related to child foster care licensed through a private agency, who is 18 years of age or older, shall also provide the commissioner a signed consent for the release of any information received from national crime information databases to the private agency that initiated the background study.\n(d) The subject of a background study shall provide fingerprints and a photograph as required in subdivision 5.\n(e) The subject of a background study shall submit a completed criminal and maltreatment history records check consent form and criminal history disclosure form for applicable national and state level record checks.\n(f) A background study subject who has access to the NETStudy 2.0 applicant portal must provide updated contact information to the commissioner via NETStudy 2.0 any time the subject's personal information changes for as long as they remain affiliated on any roster.\n(g) An entity must update contact information in NETStudy 2.0 for a background study subject on the entity's roster any time the entity receives new contact information from the study subject.\n(a) The applicant, license holder, or other entity initiating the background study as provided in this chapter shall verify that the information collected under subdivision 1 about an individual who is the subject of the background study is correct and must provide the information on forms or in a format prescribed by the commissioner.\n(b) The information collected under subdivision 1 about an individual who is the subject of a completed background study may only be viewable by an entity that initiates a subsequent background study on that individual under NETStudy 2.0 after the entity has paid the applicable fee for the study and has provided the individual with the privacy notice in subdivision 2c.\nFor background studies related to child foster care when the applicant or license holder resides in the home where child foster care services are provided, county and private agencies initiating the background study must collect the information under subdivision 1 and forward it to the commissioner.\n(a) For background studies related to all family adult day services and to adult foster care when the adult foster care license holder resides in the adult foster care residence, the county agency or private agency initiating the background study must collect the information required under subdivision 1 and forward it to the commissioner.\n(b) Upon implementation of NETStudy 2.0, for background studies related to family child care and legal nonlicensed child care authorized under chapter 142E, the county agency initiating the background study must collect the information required under subdivision 1 and provide the information to the commissioner.\n(a) Prior to initiating each background study, the entity initiating the study must provide the commissioner's privacy notice to the background study subject required under section 13.04, subdivision 2. The notice must be available through the commissioner's electronic NETStudy and NETStudy 2.0 systems and shall include the information in paragraphs (b) and (c).\n(b) The background study subject shall be informed that any previous background studies that received a set-aside will be reviewed, and without further contact with the background study subject, the commissioner may notify the agency that initiated the subsequent background study that the individual has a disqualification that has been set aside for the program or agency that initiated the study.\n(c) The background study subject must also be informed that:\n(1) the subject's fingerprints collected for purposes of completing the background study under this chapter must not be retained by the Department of Public Safety, Bureau of Criminal Apprehension, or by the commissioner. The Federal Bureau of Investigation will not retain background study subjects' fingerprints;\n(2) effective upon implementation of NETStudy 2.0, the subject's photographic image will be retained by the commissioner, and if the subject has provided the subject's Social Security number for purposes of the background study, the photographic image will be available to prospective employers and agencies initiating background studies under this chapter to verify the identity of the subject of the background study;\n(3) the authorized fingerprint collection vendor or vendors shall, for purposes of verifying the identity of the background study subject, be able to view the identifying information entered into NETStudy 2.0 by the entity that initiated the background study, but shall not retain the subject's fingerprints, photograph, or information from NETStudy 2.0. The authorized fingerprint collection vendor or vendors shall retain no more than the subject's name and the date and time the subject's fingerprints were recorded and sent, only as necessary for auditing and billing activities;\n(4) the commissioner shall provide the subject notice, as required in section 245C.17, subdivision 1, paragraph (a), when an entity initiates a background study on the individual;\n(5) the subject may request in writing a report listing the entities that initiated a background study on the individual as provided in section 245C.17, subdivision 1, paragraph (b);\n(6) the subject may request in writing that information used to complete the individual's background study in NETStudy 2.0 be destroyed if the requirements of section 245C.051, paragraph (a), are met; and\n(7) notwithstanding clause (6), the commissioner shall destroy:\n(i) the subject's photograph after a period of two years when the requirements of section 245C.051, paragraph (c), are met; and\n(ii) any data collected on a subject under this chapter after a period of two years following the individual's death as provided in section 245C.051, paragraph (d).\nThe commissioner of human services shall notify all background study subjects under this chapter that the Department of Human Services, Department of Public Safety, and the Bureau of Criminal Apprehension do not retain fingerprint data after a background study is completed, and that the Federal Bureau of Investigation does not retain background study subjects' fingerprints.\n(a) For purposes of completing the background study, the commissioner may request the individual's Social Security number or race. The individual is not required to provide this information to the commissioner.\n(b) The commissioner may also require additional information if the commissioner determines the information is necessary to complete the background study. Failure to provide the required information may result in a disqualification pursuant to section 245C.09.\n(a) For background studies conducted by the Department of Human Services, the commissioner shall implement a secure system for the electronic transmission of:\n(1) background study information to the commissioner;\n(2) background study results to the license holder;\n(3) background study information obtained under this section and section 245C.08 to counties and private agencies for background studies conducted by the commissioner for child foster care, including a summary of nondisqualifying results, except as prohibited by law; and\n(4) background study results to county agencies for background studies conducted by the commissioner for adult foster care and family adult day services and, upon implementation of NETStudy 2.0, family child care.\n(b) Unless the commissioner has granted a hardship variance under paragraph (c), a license holder or an applicant must use the electronic transmission system known as NETStudy or NETStudy 2.0 to submit all requests for background studies to the commissioner as required by this chapter.\n(c) A license holder or applicant whose program is located in an area in which high-speed Internet is inaccessible may request the commissioner to grant a variance to the electronic transmission requirement.\n(d) Section 245C.08, subdivision 3, paragraph (c), applies to results transmitted under this subdivision.\n(e) The background study subject shall access background study-related documents electronically in the applicant portal. A background study subject may request for the commissioner to grant a variance to the requirement to access documents electronically in the NETStudy 2.0 applicant portal and may also request paper documentation of their background studies.\n[See Note.]\n(a) Notwithstanding paragraph (c), for background studies conducted by the commissioner for child foster care, children's residential facilities, adoptions, or a transfer of permanent legal and physical custody of a child, the subject of the background study, who is 18 years of age or older, shall provide the commissioner with a set of classifiable fingerprints obtained from an authorized agency for a national criminal history record check.\n(b) Notwithstanding paragraph (c), for background studies conducted by the commissioner for Head Start programs, the subject of the background study shall provide the commissioner with a set of classifiable fingerprints obtained from an authorized agency for a national criminal history record check.\n(c) For background studies initiated on or after the implementation of NETStudy 2.0, except as provided under subdivision 5a, every subject of a background study must provide the commissioner with a set of the background study subject's classifiable fingerprints and photograph. The photograph and fingerprints must be recorded at the same time by the authorized fingerprint collection vendor or vendors and sent to the commissioner through the commissioner's secure data system described in section 245C.32, subdivision 1a, paragraph (b).\n(d) The fingerprints shall be submitted by the commissioner to the Bureau of Criminal Apprehension and, when specifically required by law, submitted to the Federal Bureau of Investigation for a national criminal history record check.\n(e) The fingerprints must not be retained by the Department of Public Safety, Bureau of Criminal Apprehension, or the commissioner. The Federal Bureau of Investigation will not retain background study subjects' fingerprints.\n(f) The authorized fingerprint collection vendor or vendors shall, for purposes of verifying the identity of the background study subject, be able to view the identifying information entered into NETStudy 2.0 by the entity that initiated the background study, but shall not retain the subject's fingerprints, photograph, or information from NETStudy 2.0. The authorized fingerprint collection vendor or vendors shall retain no more than the name and date and time the subject's fingerprints were recorded and sent, only as necessary for auditing and billing activities.\n(g) For any background study conducted under this chapter, the subject shall provide the commissioner with a set of classifiable fingerprints when the commissioner has reasonable cause to require a national criminal history record check as defined in section 245C.02, subdivision 15a.\n(a) A background study completed under this chapter on a subject who is required to be studied under section 245C.03, subdivision 1, and is 17 years of age or younger shall be completed by the commissioner for:\n(1) a legal nonlicensed child care provider authorized under chapter 142E;\n(2) a licensed family child care program; or\n(3) a licensed foster care home.\n(b) The subject shall submit to the commissioner only the information under subdivision 1, paragraph (a).\n(c) A subject who is 17 years of age or younger is required to submit fingerprints and a photograph, and the commissioner shall conduct a national criminal history record check, if:\n(1) the commissioner has reasonable cause to require a national criminal history record check defined in section 245C.02, subdivision 15a; or\n(2) under paragraph (a), clauses (1) and (2), the subject is employed by the provider or supervises children served by the program.\n(d) A subject who is 17 years of age or younger is required to submit non-fingerprint-based data according to section 245C.08, subdivision 1, paragraph (a), clause (6), item (iii), and the commissioner shall conduct the check if:\n(1) the commissioner has reasonable cause to require a national criminal history record check defined in section 245C.02, subdivision 15a; or\n(2) the subject is employed by the provider or supervises children served by the program under paragraph (a), clauses (1) and (2).\n(a) The applicant, license holder, other entities as provided in this chapter, Bureau of Criminal Apprehension, law enforcement agencies, commissioner of health, and county agencies shall help with the study by giving the commissioner criminal conviction data and reports about the maltreatment of adults substantiated under section 626.557 and the maltreatment of minors substantiated under chapter 260E.\n(b) If a background study is initiated by an applicant, license holder, or other entities as provided in this chapter, and the applicant, license holder, or other entity receives information about the possible criminal or maltreatment history of an individual who is the subject of the background study, the applicant, license holder, or other entity must immediately provide the information to the commissioner.\n(c) The program or county or other agency must provide written notice to the individual who is the subject of the background study of the requirements under this subdivision.\n(a) A probation officer or corrections agent shall notify the commissioner of an individual's conviction if the individual:\n(1) has been affiliated with a program or facility regulated by the Department of Human Services or Department of Health, a facility serving children or youth licensed by the Department of Corrections, or any type of home care agency or provider of personal care assistance services within the preceding year; and\n(2) has been convicted of a crime constituting a disqualification under section 245C.14.\n(b) For the purpose of this subdivision, \"conviction\" has the meaning given it in section 609.02, subdivision 5.\n(c) The commissioner, in consultation with the commissioner of corrections, shall develop forms and information necessary to implement this subdivision and shall provide the forms and information to the commissioner of corrections for distribution to local probation officers and corrections agents.\n(d) The commissioner shall inform individuals subject to a background study that criminal convictions for disqualifying crimes shall be reported to the commissioner by the corrections system.\n(e) A probation officer, corrections agent, or corrections agency is not civilly or criminally liable for disclosing or failing to disclose the information required by this subdivision.\n(f) Upon receipt of disqualifying information, the commissioner shall provide the notice required under section 245C.17, as appropriate, to agencies on record as having initiated a background study or making a request for documentation of the background study status of the individual.\n(g) This subdivision does not apply to family child care programs or legal nonlicensed child care programs for individuals whose background study was completed in NETStudy 2.0.\nThe entity with which the background study subject is seeking affiliation shall initiate the background study in the NETStudy 2.0 system.",
	"repealed": false
}