{
	"id": "216C.377",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.377",
	"title": "216C.377 SOLAR GRANT PROGRAM; PUBLIC BUILDINGS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Cooperative electric association\" means a cooperative association organized under chapter 308A for the purpose of providing rural electrification at retail.\n(c) \"Developer\" means an entity that installs and may own, maintain, or decommission a solar energy generating system on a public building awarded a grant under this section.\n(d) \"Local unit of government\" means:\n(1) a county, statutory or home rule charter city, town, or other local government jurisdiction, excluding a school district eligible to receive financial assistance under section 216C.375; or\n(2) a federally recognized Indian Tribe in Minnesota.\n(e) \"Municipal electric utility\" means a utility that (1) provides electric service to retail customers in Minnesota, and (2) is governed by a city council or a local utilities commission.\n(f) \"Public building\" means:\n(1) a building owned and operated by a local unit of government; or\n(2) a building owned by a federally recognized Indian Tribe in Minnesota whose primary purpose is Tribal government operations.\n(g) \"Solar energy generating system\" has the meaning given in section 216E.01, subdivision 9a.\nA solar on public buildings grant program is established in the department. The purpose of the program is to provide grants to stimulate the installation of solar energy generating systems on public buildings.\nA solar on public buildings grant program account is established in the special revenue fund. Money received from the general fund and the renewable development account established in section 116C.779, subdivision 1, must be transferred to the commissioner of commerce and credited to the account. Earnings, including interest, dividends, and any other earnings arising from the assets of the account, must be credited to the account. Earnings remaining in the account at the end of a fiscal year do not cancel to the general fund or renewable development account but remain in the account until expended. The commissioner must manage the account.\nMoney in the account established under subdivision 3 is appropriated to the commissioner for the purposes of this section and must be used only:\n(1) for grant awards made under this section; and\n(2) to pay the reasonable costs of the department to administer this section.\n(a) A grant may be awarded to a local unit of government under this section only if the solar energy generating system that is the subject of the grant:\n(1) is installed (i) on or adjacent to a public building that consumes the electricity generated by the solar energy generating system, and (ii) on property within the service territory of the utility currently providing electric service to the public building; and\n(2) has a capacity that does not exceed the lesser of 40 kilowatts or 120 percent of the average annual electricity consumption, measured over the most recent three calendar years, of the public building at which the solar energy generating system is installed.\n(b) A public building that receives a rebate or other financial incentive under section 216B.241 for a solar energy generating system is eligible for a grant under this section for the same solar energy generating system.\n(c) Before filing an application for a grant under this section, a local unit of government or public building that is served by a municipal electric utility or cooperative electric association must inform the municipal electric utility or cooperative electric association of the local unit of government's or public building's intention to do so. A municipal electric utility may, under an agreement with a local unit of government, own and operate a solar energy generating system awarded a grant under this section on behalf of and for the benefit of the local unit of government.\n(a) The commissioner must issue a request for proposals to local units of government who may wish to apply for a grant under this section on behalf of a public building.\n(b) A local unit of government must submit an application to the commissioner on behalf of a public building on a form prescribed by the commissioner. The form must include, at a minimum, the following information:\n(1) the capacity of the proposed solar energy generating system and the amount of electricity that is projected to be generated;\n(2) the current energy demand of the public building on which the solar energy generating system is to be installed, information regarding any distributed energy resource that currently provides electricity to the public building, and the size of the public building's subscription to a community solar garden, if applicable;\n(3) information sufficient to estimate the energy and monetary savings that are projected to result from installation of the solar energy generating system over the system's useful life;\n(4) the total cost to purchase and install the solar energy generating system and the solar energy generating system's life cycle cost, including removal and disposal after decommissioning;\n(5) a copy of the proposed contract agreement between the local unit of government and the utility or developer that includes provisions addressing responsibility for maintenance, removal, and disposal of the solar energy generating system; and\n(6) a written statement from the interconnecting utility that no issues that would prevent interconnection of the solar energy generating system as proposed are foreseen.\n(c) The commissioner must administer an open application process under this section at least twice annually.\n(d) The commissioner must develop administrative procedures governing the application and grant award process under this section.\nAt the commissioner's request, a local unit of government awarded a grant under this section must provide the commissioner with information regarding energy conservation measures implemented at the public building where the solar energy generating system is to be installed. The commissioner may make recommendations to the local unit of government regarding cost-effective conservation measures the local unit of government can implement and may provide technical assistance and direct the local unit of government to available financial assistance programs.\nThe commissioner must provide technical assistance to local units of government to develop and execute projects under this section.\nThe commissioner must award a grant from the account established under subdivision 3 to a local unit of government for the necessary and reasonable costs associated with the purchase and installation of a solar energy generating system. In determining the amount of a grant award, the commissioner shall take into consideration the financial capacity of the local unit of government awarded the grant.\nAn application must not be submitted under this section after June 30, 2026.\nA contractor or subcontractor performing construction work on a project supported by a grant awarded under this section:\n(1) must pay employees working on the project no less than the prevailing wage rate, as defined in section 177.42; and\n(2) is subject to the requirements and enforcement provisions of sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45.\n(a) The utility to which a solar energy generating system awarded a grant under this section is interconnected must calculate the amount of net income accruing to the local unit of government annually as a result of the operation of the solar energy generating system, whether in the form of cash payments or electricity bill credits, and report that amount to the local unit of government no later than February 1.\n(b) Any net income accruing to a local unit of government as calculated under paragraph (a) must be forfeited to the utility by the local unit of government.\nBeginning January 15, 2025, and each year thereafter until January 15, 2027, the commissioner must report to the chairs and ranking minority members of the legislative committees with jurisdiction over energy finance and policy regarding grants and amounts awarded to local units of government under this section during the previous year and any remaining balances available in the account established under this section.",
	"repealed": false
}