{
	"id": "21.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.111",
	"title": "21.111 DEFINITIONS.",
	"text": "When used in sections 21.111 to 21.122 the terms defined in this section shall have the meanings ascribed to them.\n\"Inspected\" means that the potato plants are examined in the field and that the harvested potatoes produced by the potato plants are examined by or under the authority of the commissioner. For seed potatoes produced in a lab, inspected means that the lab's records, including records related to the lab's procedures and protocols, as well as the seed potatoes, have been examined under the authority of the commissioner.\n\"Certified\" means that the potatoes were inspected while growing in the field and again after being harvested, and were thereafter duly certified by or under the authority of the commissioner, as provided in sections 21.111 to 21.122, and as provided by rules adopted and published by the commissioner. For seed potatoes produced in a lab, certified means that:\n(1) the seed potato lab facilities and the lab's procedures and protocols have been examined under the authority of the commissioner; and\n(2) the seed potatoes have been inspected after they have been harvested, removed, or released from the lab, and were duly certified by or under the authority of the commissioner, as provided in sections 21.111 to 21.122.\nIn order to best use state resources, the commissioner may enter into agreements with other seed potato certification entities to carry out the purposes of sections 21.111 to 21.122. Any agreement may provide for field inspections, shipping point inspections, winter tests, and other certification functions to be carried out by personnel employed by either entity according to methods determined by the certification entities of the respective areas. The commissioner may extend seed potato certification services to states where growers wish to grow certified seed potatoes and the state does not have a seed potato certification program. Any agreement must be reported to the chairs of the legislative committees responsible for the budget or policy of the seed potato inspection program and to the commissioner of management and budget.\n[Repealed, 1955 c 287 s 1]\n\"Seed potatoes\" means potatoes used, sold, offered or exposed for sale, or held with intent to sell or as a sample representing any lot or stock of potatoes offered or exposed for sale or held with intent to sell within this state, for the purpose of planting.\n\"Person\" includes an individual, partnership, corporation, company, society, association, and firms.",
	"repealed": false
}