{
	"id": "60A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.61",
	"title": "60A.61 RISK-BASED CAPITAL REPORTS.",
	"text": "Every domestic insurer shall, on or before each March 1, prepare and submit to the commissioner a report of its risk-based capital levels as of the end of the calendar year just ended, in a form and containing the information required by the risk-based capital instructions. In addition, every domestic insurer shall file its risk-based capital report:\n(1) with the NAIC according to the risk-based capital instructions; and\n(2) with the insurance commissioner in a state in which the insurer is authorized to do business, if the insurance commissioner has notified the insurer of its request in writing, in which case the insurer shall file its risk-based capital report not later than the later of:\n(i) 15 days from the receipt of notice to file its risk-based capital report with that state; or\n(ii) March 1.\nA life and/or health insurer's risk-based capital must be determined according to the formula set forth in the risk-based capital instructions. The formula must take into account, and may adjust for the covariance between:\n(1) the risk with respect to the insurer's assets;\n(2) the risk of adverse insurance experience with respect to the insurer's liabilities and obligations;\n(3) the interest rate risk with respect to the insurer's business; and\n(4) all other business risks and other relevant risks set forth in the risk-based capital instructions;\ndetermined in each case by applying the factors in the manner set forth in the risk-based capital instructions.\nA property and casualty insurer's risk-based capital must be determined according to the formula set forth in the risk-based capital instructions. The formula must take into account, and may adjust for the covariance between:\n(1) asset risk;\n(2) credit risk;\n(3) underwriting risk; and\n(4) all other business risks and other relevant risks set forth in the risk-based capital instructions;\ndetermined in each case by applying the factors in the manner set forth in the risk-based capital instructions.\nAn excess of capital over the amount produced by the risk-based capital requirements contained in sections 60A.60 to 60A.696 and the formulas, schedules, and instructions referenced in sections 60A.60 to 60A.696 is desirable in the business of insurance. Accordingly, insurers should seek to maintain capital above the risk-based capital levels required by sections 60A.60 to 60A.696. Additional capital is used and useful in the insurance business and helps to secure an insurer against various risks inherent in, or affecting, the business of insurance and not accounted for or only partially measured by the risk-based capital requirements contained in sections 60A.60 to 60A.696.\nIf a domestic insurer files a risk-based capital report that in the judgment of the commissioner is inaccurate, then the commissioner shall adjust the risk-based capital report to correct the inaccuracy and shall notify the insurer of the adjustment. The notice must contain a statement of the reason for the adjustment. A risk-based capital report as so adjusted is referred to as an \"adjusted risk-based capital report.\"",
	"repealed": false
}