{
	"id": "500.216",
	"url": "https://www.revisor.mn.gov/statutes/cite/500.216",
	"title": "500.216 LIMITS ON CERTAIN RESIDENTIAL SOLAR ENERGY SYSTEMS PROHIBITED.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Private entity\" means a homeowners association, community association, or other association that is subject to a homeowners association document.\n(c) \"Homeowners association document\" means a document containing the declaration, articles of incorporation, bylaws, or rules and regulations of:\n(1) a common interest community, as defined in section 515B.1-103, regardless of whether the common interest community is subject to chapter 515B; and\n(2) a residential community that is not a common interest community.\n(d) \"Solar energy system\" has the meaning given in section 216C.06, subdivision 17.\nThis section applies to:\n(1) single-family detached dwellings whose owner is the sole owner of the entire building in which the dwelling is located and who is solely responsible for the maintenance, repair, replacement, and insurance of the entire building; and\n(2) multifamily attached dwellings whose owner is the sole owner of the entire building in which the dwelling is located and who is solely responsible for the maintenance, repair, replacement, and insurance of the entire building.\nExcept as otherwise provided in this section and notwithstanding any covenant, restriction, or condition contained in a deed, security instrument, homeowners association document, or any other instrument affecting the transfer, sale of, or an interest in real property, a private entity must not prohibit or refuse to permit the owner of a single-family dwelling to install, maintain, or use a roof-mounted solar energy system.\n(a) A private entity may require that:\n(1) a licensed contractor install a solar energy system;\n(2) a roof-mounted solar energy system not extend above the peak of a pitched roof or beyond the edge of the roof;\n(3) the owner or installer of a solar energy system indemnify or reimburse the private entity or the private entity's members for loss or damage caused by the installation, maintenance, use, repair, or removal of a solar energy system;\n(4) the owner and each successive owner of a solar energy system list the private entity as a certificate holder on the homeowner's insurance policy; or\n(5) the owner and each successive owner of a solar energy system be responsible for removing the system if reasonably necessary to repair, perform maintenance, or replace common elements or limited common elements, as defined in section 515B.1-103.\n(b) A private entity may impose other reasonable restrictions on installing, maintaining, or using solar energy systems, provided that the restrictions do not: (1) decrease the solar energy system's projected energy generation by more than ten percent; or (2) increase the solar energy system's cost by more than (i) 20 percent for a solar water heater, or (ii) $1,000 for a solar photovoltaic system, when compared with the solar energy system's energy generation and the cost of labor and materials originally proposed without the restrictions, as certified by the solar energy system's designer or installer. A private entity may obtain an alternative bid and design from a solar energy system designer or installer for the purposes of this paragraph.\n(c) A solar energy system must meet applicable standards and requirements imposed by the state and by governmental units, as defined in section 462.384.\n(d) A solar energy system for heating water must be certified by the Solar Rating Certification Corporation or an equivalent certification agency. A solar energy system for producing electricity must meet: (1) all applicable safety and performance standards established by the National Electrical Code, the Institute of Electrical and Electronics Engineers, and accredited testing laboratories, including but not limited to Underwriters Laboratories; and (2) where applicable, rules of the Public Utilities Commission regarding safety and reliability.\n(e) If approval by a private entity is required prior to installing or using a solar energy system, the application for approval (1) must be processed and approved in the same manner as an application for approval of an architectural modification to the property, and (2) must not be willfully avoided or delayed. In no event does a private entity have less than 60 days to approve or disapprove an application for a solar energy system.\n(f) An application for approval must be made in writing and must contain certification that the applicant must meet any conditions required by a private entity under subdivision 4. An application must include a copy of the interconnection application submitted to the applicable electric utility.\n(g) A private entity must approve or deny an application in writing. If an application is not denied in writing within 60 days of the date the application was received, the application is deemed approved unless the delay is the result of a reasonable request for additional information. If a private entity determines that additional information is needed from the applicant in order to approve or disapprove the application, the private entity must request the additional information in writing within 60 days from the date of receipt of the application. If the private entity makes a request for additional information within 15 days from the date the private entity initially received the application, the private entity shall have 60 days from the date of receipt of the additional information in which to approve or disapprove the application. If the private entity makes a written request to the applicant for additional information more than 15 days after the private entity initially received the application, the private entity has 15 days after the private entity receives the additional information requested from the applicant in which to approve or disapprove the application, but in no event does the private entity have less than 60 days from the date the private entity initially received the application in which to approve or disapprove the application.",
	"repealed": false
}