{
	"id": "326B.127",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.127",
	"title": "326B.127 STATE BUILDING OFFICIAL.",
	"text": "The commissioner shall appoint a state building official who under the direction and supervision of the commissioner shall administer the code.\nTo be eligible for appointment as state building official an individual must be competent in the field of administration and shall have the experience in building design, construction, and supervision which the commissioner considers necessary.\nThe state building official may, with the approval of the commissioner, employ personnel necessary to carry out the inspector's function under sections 326B.101 to 326B.194. The state building official shall perform other duties in administering the code assigned by the commissioner.\nThe state building official shall, with the approval of the commissioner, assign three department employees to assist municipalities in complying with section 326B.106, subdivision 9.\nTo achieve uniform and consistent application of the State Building Code, the commissioner has final interpretative authority applicable to all codes adopted as part of the State Building Code except for the Plumbing Code, the Electrical Code, and the High Pressure Piping Code. A final interpretative committee composed of seven members, consisting of three building officials, two inspectors from the affected field, and two construction industry representatives, shall review requests for final interpretations relating to that field for which the commissioner has final interpretative authority. The Plumbing Board has final interpretative authority applicable to the State Plumbing Code and shall review requests for final interpretation made to the board that relate to the State Plumbing Code. The Board of Electricity has final interpretative authority applicable to the State Electrical Code and shall review requests for final interpretation made to the board that relate to the State Electrical Code. The Board of High Pressure Piping Systems has final interpretative authority applicable to the State High Pressure Piping Code and shall review requests for final interpretation made to the board that relate to the State High Pressure Piping Code. Except for requests for final interpretations that relate to the State Plumbing Code, the State Electrical Code, and the State High Pressure Piping Code, requests for final interpretation must come from a local or state level building code board of appeals. The commissioner must establish procedures for membership of the final interpretative committees. The appropriate committee shall review the request and make a recommendation to the commissioner for the final interpretation within 30 days of the request. The commissioner must issue a final interpretation within ten business days after the receipt of the recommendation from the final interpretative committee. The Plumbing Board, the Board of Electricity, or the Board of High Pressure Piping Systems shall review a request and issue a final interpretation within 30 days of the request. Any person aggrieved by a final interpretation may appeal the interpretation within 30 days of its issuance by the commissioner or the board in accordance with chapter 14. The final interpretation must be published within ten business days of its issuance and made available to the public. Municipal building officials shall administer all final interpretations issued by the commissioner, the Plumbing Board, the Board of Electricity, or the Board of High Pressure Piping Systems until the final interpretations are considered by the commissioner, the Plumbing Board, the Board of Electricity, or the Board of High Pressure Piping Systems for adoption as part of the State Building Code, State Plumbing Code, State Electrical Code, and the State High Pressure Piping Code.",
	"repealed": false
}