{
	"id": "299A.783",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.783",
	"title": "299A.783 STATEWIDE ANTITRAFFICKING INVESTIGATION COORDINATION.",
	"text": "The commissioner of public safety must appoint a statewide antitrafficking investigation coordinator. The coordinator must be a current or former law enforcement officer or prosecutor with experience investigating or prosecuting trafficking-related offenses. The coordinator must also have knowledge of services available to and Safe Harbor response for victims of sex trafficking and sexual exploitation and Minnesota's child welfare system response. The coordinator serves at the pleasure of the commissioner in the unclassified service.\nThe coordinator shall have the following duties:\n(1) develop, coordinate, and facilitate training for law enforcement officers, prosecutors, courts, child welfare workers, social service providers, medical providers, and other community members;\n(2) establish standards for approved training and review compliance with those standards;\n(3) coordinate and monitor multijurisdictional sex trafficking task forces;\n(4) review, develop, promote, and monitor compliance with investigative protocols to ensure that law enforcement officers and prosecutors engage in best practices;\n(5) provide technical assistance and advice related to the investigation and prosecution of trafficking offenses and the treatment of victims;\n(6) promote the efficient use of resources by addressing issues of deconfliction, providing advice regarding questions of jurisdiction, and promoting the sharing of data between entities investigating and prosecuting trafficking offenses;\n(7) assist in the appropriate distribution of grants;\n(8) perform other duties necessary to ensure effective and efficient investigation and prosecution of trafficking-related offenses; and\n(9) coordinate with other federal, state, and local agencies to ensure multidisciplinary responses to trafficking and exploitation of youth in Minnesota.",
	"repealed": false
}