{
	"id": "79.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.251",
	"title": "79.251 ADMINISTRATION OF ASSIGNED RISK PLAN.",
	"text": "(a)(1) The commissioner shall have all the usual powers and authorities necessary for the discharge of the commissioner's duties under this section and may contract with individuals in discharge of those duties. The commissioner shall audit the reserves established (i) for individual cases arising under policies and contracts of coverage issued under subdivision 4 and (ii) for the total book of business issued under subdivision 4. If the commissioner determines on the basis of an audit that there is an excess surplus in the assigned risk plan, the commissioner must notify the commissioner of management and budget who shall transfer assets of the plan equal to the excess surplus to the budget reserve account in the general fund.\n(2) The commissioner shall monitor the operations of section 79.252 and this section and shall periodically make recommendations to the governor and legislature when appropriate, for improvement in the operation of those sections.\n(3) All insurers and self-insurance administrators issuing policies or contracts under subdivision 4 shall pay to the commissioner a .25 percent assessment on premiums for policies and contracts of coverage issued under subdivision 4 for the purpose of defraying the costs of performing the duties under clauses (1) and (2). Proceeds of the assessment shall be deposited in the state treasury and credited to the general fund.\n(4) The assigned risk plan shall not be deemed a state agency.\n(5) The commissioner shall monitor and have jurisdiction over all reserves maintained for assigned risk plan losses.\n(b) As used in this subdivision, \"excess surplus\" means the amount of assigned risk plan assets in excess of the amount needed to pay all current liabilities of the plan, including, but not limited to:\n(1) administrative expenses;\n(2) benefit claims; and\n(3) if the assigned risk plan is dissolved under subdivision 8, the amounts that would be due insurers who have paid assessments to the plan.\nTo assist small businesses with good safety records, the commissioner shall develop a merit rating plan applicable to all employers holding policies issued pursuant to subdivision 4. The plan shall provide that nonexperience rated employers, with no lost time claims for the last three policy years, shall receive 33 percent credit. The credit must be applied directly to the premium charged for the policy. Nonexperience rated employers with two or more lost time claims for the last three policy years may receive a debit. Experience rated employers shall receive a maximum credit or debit of ten percent of premium. The merit rating plan shall be subject to adjustment by the commissioner as necessary to fulfill the commissioner's assigned risk plan responsibilities.\n(a) Employers insured through the assigned risk plan are subject to paragraphs (b) and (c).\n(b) Classifications must be assigned according to a uniform classification system approved by the commissioner.\n(c) Rates must be modified according to an experience rating plan approved by the commissioner. Any experience rating plan is subject to Minnesota Rules, parts 2705.2800 and 2705.2900.\nInsureds served by the assigned risk plan shall be charged premiums based upon a rating plan, including a merit rating plan adopted by the commissioner by rule. The commissioner shall annually, not later than January 1 of each year, establish the schedule of rates applicable to assigned risk plan business. Assigned risk premiums shall not be lower than rates generally charged by insurers for the business. The commissioner shall fix the compensation received by the agent of record. The establishment of the assigned risk plan rates and agent fees are not subject to chapter 14.\nThe commissioner shall enter into service contracts as necessary or beneficial for accomplishing the purposes of the assigned risk plan. Services related to the administration of policies or contracts of coverage shall be performed by one or more qualified insurance companies licensed pursuant to section 60A.06, subdivision 1, clause (5), paragraph (b), or self-insurance administrators licensed pursuant to section 176.181, subdivision 2, paragraph (b). A qualified insurer or self-insurance administrator shall possess sufficient financial, professional, administrative, and personnel resources to provide the services contemplated in the contract. Services related to assignments, data management, assessment collection, and other services shall be performed by a licensed data service organization. The cost of those services is an obligation of the assigned risk plan.\nThe assigned risk plan must consider utilizing managed care plans certified under section 176.1351 with respect to its covered employees. In addition, the assigned risk plan must implement a medical cost containment program. The program must, at a minimum, include:\n(1) billings review to determine if claims are compensable under chapter 176;\n(2) utilization of cost management specialists familiar with billing practice guidelines;\n(3) review of treatment to determine if it is reasonable and necessary and has a reasonable chance to cure and relieve the employee's injury;\n(4) a system to reduce billed charges to the maximum permitted by law or rule;\n(5) review of medical care utilization; and\n(6) reporting of health care providers suspected of providing unnecessary, inappropriate, or excessive services to the commissioner of labor and industry.\nThe assigned risk plan must create a program that attempts to group employers in the same or similar risk classification for purposes of group premium underwriting and claims management. The assigned risk plan must engage in extensive safety consultation with group members to reduce the extent and severity of injuries of group members. The consultation should include on-site inspections and specific recommendations as to safety improvements.\nThe commissioner shall assess all insurers licensed pursuant to section 60A.06, subdivision 1, clause (5), paragraph (b) an amount sufficient to fully fund the obligations of the assigned risk plan, if the commissioner determines that the assets of the assigned risk plan are insufficient to meet its obligations. The assessment of each insurer shall be in a proportion equal to the proportion which the amount of compensation insurance written in this state during the preceding calendar year by that insurer bears to the total compensation insurance written in this state during the preceding calendar year by all licensed insurers.\nAmounts assessed under this subdivision are considered a liability of the assigned risk plan, to be repaid upon dissolution of the plan.\nA person licensed under chapter 60K may submit an application for coverage to the assigned risk plan and receive a fee from the assigned risk plan for submitting the application. However, the licensee is not an agent of the assigned risk plan for purposes of state law. All checks or similar instruments submitted in payment of assigned risk plan premiums must be made payable to the assigned risk plan and not the agent.\nThe commissioner shall certify and transfer to the state Board of Investment all assigned risk plan assets which in the commissioner's judgment are not required for immediate use. The State Board of Investment shall invest the certified assets, and may invest the assets consistent with the provisions of section 11A.14. All investment income and losses attributable to the investment of assigned risk plan assets must be credited to the assigned risk plan. When the commissioner certifies to the state board that invested assets are required for immediate use, the state board shall sell assets to provide the amount of assets the commissioner certifies. The board shall transfer the sale proceeds to the commissioner.\nUpon the dissolution of the assigned risk plan, the commissioner shall proceed to wind up the affairs of the plan, settle its accounts, and dispose of its assets. The assets and property of the assigned risk plan must be applied and distributed in the following order of priority:\n(1) to the establishment of reserves for claims under policies and contracts of coverage issued by the assigned risk plan before termination;\n(2) to the payment of all debts and liabilities of the assigned risk plan, including the repayment of loans and assessments;\n(3) to the establishment of reserves considered necessary by the commissioner for contingent liabilities or obligations of the assigned risk plan other than claims arising under policies and contracts of coverage; and\n(4) to the state of Minnesota.\nIf the commissioner determines that the assets of the assigned risk plan are insufficient to meet its obligations under clauses (1), (2), and (3), excluding the repayment of assessments, the commissioner shall assess all insurers licensed pursuant to section 60A.06, subdivision 1, clause (5), paragraph (b), an amount sufficient to fully fund these obligations.",
	"repealed": false
}