{
	"id": "116O.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/116O.115",
	"title": "116O.115 SMALL BUSINESS GROWTH ACCELERATION PROGRAM.",
	"text": "The small business growth acceleration program is established. The purpose of the program is to (1) help qualified companies implement technology and business improvements; and (2) bridge the gap between standard market pricing for technology and business improvements and what qualified companies can afford to pay.\nA company is qualified to receive assistance under the small business growth acceleration program if the company is a manufacturing company or a manufacturing-related service company that employs 250 or fewer full-time equivalent employees.\nA company seeking assistance under the small business growth acceleration program must file an application according to the requirements of the corporation. A company's application for small business growth acceleration program assistance must include documentation of the company's overall plan for technology and business improvement and prioritize the components of the overall plan. The application must also document the company's need for small business growth acceleration program funds in order to carry forward the highest priority components of the plan.\n(a) The corporation shall establish procedures for determining which applicants for assistance under the small business growth acceleration program will receive program funding. Funding shall be awarded only to accelerate a qualified company's adoption of needed technology or business improvements when the corporation concludes that it is unlikely the improvements could be accomplished in any other way.\n(b) The maximum amount of funds awarded to a qualified company under the small business growth acceleration program for a particular project must not exceed 75 percent of the total cost of a project and must not under any circumstances exceed $25,000 during a calendar year. The corporation shall not award to a qualified company small business growth acceleration program funds in excess of $50,000 per year.\n(c) Any funds awarded to a qualified company under the small business growth acceleration program must be used for business services and products that will enhance the operation of the company. These business services and products must come either directly from the corporation or from a network of expert providers identified and approved by the corporation. No company receiving small business growth acceleration program funds may use the funds for refinancing, overhead costs, new construction, renovation, equipment, or computer hardware.\n(d) Any funds awarded must be disbursed to the qualified company as reimbursement documented according to requirements of the corporation.\n(e) Receipt of funds from an award under this section is contingent upon a contribution of funds by the qualified company to the project, as follows:\n(1) a company with under 50 employees must contribute one dollar for every three dollars of program assistance awarded;\n(2) a company with 50 to 100 employees must contribute one dollar for every one dollar of program assistance awarded; and\n(3) a company with 101 to 250 employees must contribute three dollars for every one dollar of program assistance awarded.\nThe corporation shall enter a written service agreement with each company awarded funds under the small business growth acceleration program. Each service agreement shall clearly articulate the company's need for service, state the cost of the service, identify who will provide the service, and define the scope of the service that will be provided. The service agreement must also include an estimate of the financial impact of the service on the company and require the company to report the actual financial impact of the service to the corporation 24 months after the service is provided.\nThe corporation shall report annually to the legislative committees with fiscal jurisdiction over the Department of Employment and Economic Development:\n(1) the funds awarded under the small business growth acceleration program during the past 12 months;\n(2) the estimated financial impact of the funds awarded to each company receiving service under the program; and\n(3) the actual financial impact of funds awarded during the past 24 months.",
	"repealed": false
}