{
	"id": "103G.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.421",
	"title": "103G.421 CONTROL OF MISSISSIPPI HEADWATER LAKES.",
	"text": "The legislature finds that the regulation, control, and utilization of waters in the headwater lakes in the Mississippi River, including Leech Lake, Winnibigoshish Lake, Pokegama Lake, Pine River, the Whitefish chain, Sandy Lake, and Gull Lake are of tremendous economic importance and value to the state and the utility of these lakes in aid of navigation has been very greatly diminished since the time of the establishment of the reservoirs, and that the economic values in utilization of these waters for state purposes has increased tremendously. These factors require the assertion on the part of the state of Minnesota of its rights to utilization and control of these water areas.\nThe commissioner shall enter into cooperative agreements with the United States of America acting through the Department of the Army for the joint control and regulation of the Mississippi headwater reservoirs to control the water elevations and the water discharges from the Mississippi headwaters lakes in the interests of the state, subject only to:\n(1) a paramount need of waters from these sources in aid of substantial navigation requirements; and\n(2) a substantial requirement of providing necessary flood control storage capacity as determined by the United States Department of the Army Corps of Engineers.\n(a) The commissioner must develop a plan for the operation of the dams controlling each of the Mississippi headwater reservoirs that:\n(1) establishes the water elevation on each of the Mississippi headwater lakes at the most desirable height and stabilizes the stages at that point, as practicable, during the recreational use season;\n(2) considers reasonable fluctuations when desirable for the production of wild rice in the wild rice producing areas of Mississippi headwater lakes;\n(3) considers the elevations most desirable for the production and maintenance of wildlife resources;\n(4) considers the needs of water for recreation, agriculture, forestry, game and fish, industry, municipal water supply and sewage disposal, power generation, and other purposes in the Mississippi River headwaters and downstream;\n(5) establishes stages at which the water will be maintained, as practicable, but recognizing the following minimum stages in reference to present zeros on the respective government gauges:\n(6) prescribes maximum discharges when the elevations fall below the stages; and\n(7) prescribes maximum elevations and amounts of discharge from each lake to stabilize and effectuate the desired stages and, as practicable, does not allow the elevation to exceed the following maximum lake stages:\n(b) The plan developed by the commissioner must consider the following conditions:\n(1) the necessity for changing discharges to meet emergencies resulting from unexpected or abnormal inflows;\n(2) the possibility of overriding requirements of the federal government for substantial discharges to meet reasonable and substantial navigation requirements; and\n(3) the overriding authority and needs as prescribed by the United States Department of the Army Corps of Engineers in discharging their functions of requiring additional storage capacity for flood control purposes.\nBefore the plan of operation for a headwater lake is effective, the commissioner must publish a notice of hearing on the plan of operation for two weeks in a newspaper in each county where the affected waters are located.\n(a) The hearing must be conducted by the commissioner or an appointed referee. The hearing will not be governed by legal rules of evidence, but the findings of fact and orders, to be made and formulated by the commissioner, must be predicated only on relevant, material, and competent evidence.\n(b) Interested parties must have an opportunity to be heard, under oath, and are subject to cross-examination by adverse parties and by the attorney general or the attorney general's representative who shall represent the commissioner at the hearing.\n(c) The findings of fact and orders incorporating the plan determined by the commissioner must be published for two weeks in the same manner as the notice of hearing.\nA riparian owner or water user aggrieved by the commissioner's findings has the right to appeal by 30 days after completion of publication of the findings and order to the district court of a county where the regulated water is located. The appeal shall be determined by the court on the record made before the commissioner. Issues on the appeal are limited to the legal rights of the parties and whether the findings of the commissioner are reasonably supported by the evidence at the hearing.\n(a) After a plan has been put into effect, the commissioner is authorized to modify the stages sought to be maintained by modifying the plan with respect to any of the lakes involved to the extent of one foot in elevation according to the zeros of the present government gauges without holding additional hearings, except a departure from the elevation target may not be made to reduce proposed stages below the minimums prescribed by subdivision 3, paragraph (a), clause (5), during the recreational season.\n(b) A modification of the established plan that departs by more than one foot in elevation may be placed into effect only after a hearing is held in the same manner as the hearing establishing the plan as provided under subdivisions 4 and 5.",
	"repealed": false
}