{
	"id": "504B.385",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.385",
	"title": "504B.385 RENT ESCROW ACTION TO REMEDY VIOLATIONS.",
	"text": "(a) If a violation exists in a residential building, a residential tenant may deposit the amount of rent due to the landlord with the court administrator using the procedures described in paragraphs (b) to (d).\n(b) For a violation as defined in section 504B.001, subdivision 14, clause (1), the residential tenant may deposit with the court administrator the rent due to the landlord along with a copy of the written notice of the code violation as provided in section 504B.185, subdivision 2. The residential tenant may not deposit the rent or file the written notice of the code violation until the time granted to make repairs has expired without satisfactory repairs being made, unless the residential tenant alleges that the time granted is excessive.\n(c) For a violation as defined in section 504B.001, subdivision 14, clause (2) or (3), the residential tenant must give written notice to the landlord specifying the violation. The notice must be delivered personally or sent to the person or place where rent is normally paid. If the violation is not corrected within 14 days, the residential tenant may deposit the amount of rent due to the landlord with the court administrator along with an affidavit specifying the violation. The court must provide a simplified form affidavit for use under this paragraph.\n(d) The residential tenant need not deposit rent if none is due to the landlord at the time the residential tenant files the notice required by paragraph (b) or (c). All rent which becomes due to the landlord after that time but before the hearing under subdivision 6 must be deposited with the court administrator. As long as proceedings are pending under this section, the residential tenant must pay rent to the landlord or as directed by the court and may not withhold rent to remedy a violation.\n(a) The landlord may file a counterclaim for possession of the property in cases where the landlord alleges that the residential tenant did not deposit the full amount of rent with the court administrator.\n(b) The court must set the date for a hearing on the counterclaim not less than seven nor more than 14 days from the day of filing the counterclaim. If the rent escrow hearing and the hearing on the counterclaim for possession cannot be heard on the same day, the matters must be consolidated and heard on the date scheduled for the hearing on the counterclaim.\n(c) The contents of the counterclaim for possession must meet the requirements for a complaint under section 504B.321.\n(d) The landlord must serve the counterclaim as provided in section 504B.332, except that the affidavit of service or mailing may be brought to the hearing rather than filed with the court before the hearing.\n(e) The court must provide a simplified form for use under this section.\nThe defenses provided in section 504B.415 are defenses to an action brought under this section.\nThe court administrator may charge a filing fee in the amount set for complaints and counterclaims in conciliation court, subject to the filing of an inability to pay affidavit.\n(a) A hearing must be held within ten to 14 days from the day a residential tenant:\n(1) deposits rent with the court administrator; or\n(2) files the notice required under subdivision 1, paragraph (b) or (c), if the tenant is not required to deposit rent with the court administrator under subdivision 1, paragraph (d).\nNothing in this subdivision relieves the tenant of the obligation to deposit rent that becomes due to the landlord after the filing but before the hearing with the court administrator.\n(b) If the cost of remedying the violation, as estimated by the residential tenant, is within the jurisdictional limit for conciliation court, the court administrator shall notify the landlord and the residential tenant of the time and place of the hearing by first class mail.\n(c) The residential tenant must provide the court administrator with the landlord's name and address. If the landlord has disclosed a post office box as the landlord's address under section 504B.181, notice of the hearing may be mailed to the post office box.\n(d) If the cost of remedying the violation, as estimated by the tenant, is above the jurisdictional limit for conciliation court, the tenant must serve the notice of hearing according to the Minnesota Rules of Civil Procedure.\n(e) The notice of hearing must specify the amount the residential tenant has deposited with the court administrator and must inform the landlord that possession of the premises will not be in issue at the hearing unless the landlord files a counterclaim for possession or an eviction action.\nThe hearing shall be conducted by a court without a jury. A certified copy of an inspection report meets the requirements of rule 803(8) of the Minnesota Rules of Evidence as an exception to the rule against hearsay, and meets the requirements of rules 901 and 902 of the Minnesota Rules of Evidence as to authentication.\nIf the residential tenant gives written notice to the court administrator that the violation has been remedied, the court administrator must release the rent to the landlord and, unless the hearing has been consolidated with another action, must cancel the hearing. If the residential tenant and the landlord enter into a written agreement signed by both parties apportioning the rent between them, the court administrator must release the rent in accordance with the written agreement and cancel the hearing.\nActions under this section and eviction actions which involve the same parties must be consolidated and heard on the date scheduled for the eviction action.\n(a) Upon finding that a violation exists, the court may, in its discretion, do any or all of the following:\n(1) order relief as provided in section 504B.425, including retroactive rent abatement;\n(2) order that all or a portion of the rent in escrow be released for the purpose of remedying the violation;\n(3) order that rent be deposited with the court as it becomes due to the landlord or abate future rent until the landlord remedies the violation; or\n(4) impose fines as required in section 504B.391.\n(b) When a proceeding under this section has been consolidated with a counterclaim for possession or an eviction action, and the landlord prevails, the residential tenant may redeem the tenancy as provided in section 504B.291.\n(c) When a proceeding under this section has been consolidated with a counterclaim for possession or an eviction action on the grounds of nonpayment, the court may not require the residential tenant to pay the landlord's filing fee as a condition of retaining possession of the property when the residential tenant has deposited with the court the full amount of money found by the court to be owed to the landlord.\nIf the court finds, after a hearing on the matter has been held, that no violation exists in the building or that the residential tenant did not deposit the full amount of rent due with the court administrator, it shall order the immediate release of the rent to the landlord. If the court finds that a violation existed, but was remedied between the commencement of the action and the hearing, it may order rent abatement and must release the rent to the parties accordingly. Any rent found to be owed to the residential tenant must be released to the tenant.\nSection 504B.441 applies to proceedings under this section. The residential tenant rights under this section may not be waived or modified and are in addition to and do not limit other rights or remedies which may be available to the residential tenant and landlord, except as provided in subdivision 1.",
	"repealed": false
}