{
	"id": "253D.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.28",
	"title": "253D.28 JUDICIAL APPEAL PANEL.",
	"text": "(a) A person committed as a sexually dangerous person or a person with a sexual psychopathic personality under this chapter, or committed as both mentally ill and dangerous to the public under section 253B.18 and as a sexually dangerous person or a person with a sexual psychopathic personality under this chapter; the county attorney of the county from which the person was committed or the county of financial responsibility; or the executive board may petition the judicial appeal panel established under section 253B.19, subdivision 1, for a rehearing and reconsideration of a recommendation of the special review board under section 253D.27.\n(b) The petition must be filed with the supreme court within 30 days after the recommendation is mailed by the executive board as required in section 253D.27, subdivision 4. The hearing must be held within 180 days of the filing of the petition unless an extension is granted for good cause.\n(c) If no party petitions the judicial appeal panel for a rehearing or reconsideration within 30 days, the judicial appeal panel shall either issue an order adopting the recommendations of the special review board or set the matter on for a hearing pursuant to this section.\n(a) The supreme court shall refer a petition for rehearing and reconsideration to the chief judge of the judicial appeal panel. The chief judge shall notify the committed person, the county attorneys of the county of commitment and county of financial responsibility, the executive board, the executive director, any interested person, and other persons the chief judge designates, of the time and place of the hearing on the petition. The notice shall be given at least 14 days prior to the date of the hearing. The hearing may be conducted by interactive video conference under General Rules of Practice, rule 131, and Minnesota Rules of Civil Commitment, rule 14.\n(b) Any person may oppose the petition. The committed person, the committed person's counsel, the county attorneys of the committing county and county of financial responsibility, and the executive board shall participate as parties to the proceeding pending before the judicial appeal panel and shall, no later than 20 days before the hearing on the petition, inform the judicial appeal panel and the opposing party in writing whether they support or oppose the petition and provide a summary of facts in support of their position.\n(c) The judicial appeal panel may appoint court examiners and may adjourn the hearing from time to time. It shall hear and receive all relevant testimony and evidence and make a record of all proceedings. The committed person, the committed person's counsel, and the county attorney of the committing county or the county of financial responsibility have the right to be present and may present and cross-examine all witnesses and offer a factual and legal basis in support of their positions.\n(d) The petitioning party seeking discharge or provisional discharge bears the burden of going forward with the evidence, which means presenting a prima facie case with competent evidence to show that the person is entitled to the requested relief. If the petitioning party has met this burden, the party opposing discharge or provisional discharge bears the burden of proof by clear and convincing evidence that the discharge or provisional discharge should be denied.\n(e) A party seeking transfer under section 253D.29 must establish by a preponderance of the evidence that the transfer is appropriate.\nA majority of the judicial appeal panel shall rule upon the petition. The panel shall consider the petition de novo. No order of the judicial appeal panel granting a transfer, discharge, or provisional discharge shall be made effective sooner than 15 days after it is issued. The panel may not consider petitions for relief other than those considered by the special review board from which the appeal is taken. The judicial appeal panel may not grant a transfer or provisional discharge on terms or conditions that were not presented to the special review board.\nA party aggrieved by an order of the appeal panel may appeal that order as provided under section 253B.19, subdivision 5.",
	"repealed": false
}