{
	"id": "299C.063",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.063",
	"title": "299C.063 BOMB DISPOSAL EXPENSE REIMBURSEMENT.",
	"text": "The terms used in this section have the meanings given them in this subdivision:\n(a) \"Bomb disposal unit\" means a commissioner-approved unit consisting of persons who are trained and equipped to dispose of or neutralize bombs or other similar hazardous explosives and who are employed by a municipality.\n(b) \"Commissioner\" means the commissioner of public safety.\n(c) \"Explosives sweep\" means a detailed scanning service used in corporate office buildings, shipping hangars, event stadiums, transportation hubs, large outdoor events, and other critical facilities using ground-penetrating radar, magnetometers, metal detectors, and specially trained K-9 units to detect improvised explosive devices and explosive remnants of war, such as unexploded ordnance and abandoned ordnance.\n(d) \"Hazardous explosives\" means explosives as defined in section 299F.72, subdivision 2, explosive devices and incendiary devices as defined in section 609.668, subdivision 1, and all materials subject to regulation under United States Code, title 18, chapter 40.\n(e) \"Municipality\" has the meaning given in section 466.01.\n(a) The commissioner may reimburse bomb disposal units for reasonable expenses incurred:\n(1) to dispose of or neutralize bombs or other similar hazardous explosives for their employer-municipality or for another municipality outside the jurisdiction of the employer-municipality but within the state. Reimbursement is limited to the extent of appropriated funds;\n(2) to use the services of police explosive detection K-9 assets;\n(3) for dignitary explosive sweeps;\n(4) for explosive sweeps at large state events;\n(5) to provide for explosive security at large state events; and\n(6) for large-scale scheduled public events.\n(b) Reimbursement for expenses under this subdivision is limited to the extent of appropriated funds.\nThe commissioner may enter into contracts or agreements with bomb disposal units to implement and administer this section.\nThe commissioner may enter into contracts with public event organizers, as defined in section 299A.52, for costs associated with explosive sweeps conducted by state bomb disposal units.",
	"repealed": false
}