{
	"id": "214.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.06",
	"title": "214.06 FEES; LICENSE RENEWALS.",
	"text": "The commissioner of health as authorized by section 214.13 and all health-related licensing boards and non-health-related licensing boards shall propose or adjust any fee according to section 16A.1283. As provided in section 16A.1285, the fees shall be an amount sufficient so that the total fees collected by each board will be based on anticipated expenditures, including expenditures for the programs authorized by sections 214.10, 214.103, 214.11, 214.28 to 214.37, and 214.40, except that a health-related licensing board may have anticipated expenditures in excess of anticipated revenues in a biennium by using accumulated surplus revenues from fees collected by that board in previous bienniums. A health-related licensing board may accumulate up to one year of operating funds, and then shall propose a fee reduction according to section 16A.1283. A health-related licensing board shall not spend more money than the amount appropriated by the legislature for a biennium. For members of an occupation registered after July 1, 1984, by the commissioner of health under the provisions of section 214.13, the fee established must include an amount necessary to recover, over a five-year period, the commissioner's direct expenditures for adoption of the rules providing for registration of members of the occupation. All fees received shall be deposited in the state treasury.\n(a) Fees received by the commissioner of health or health-related licensing boards must be credited to the health occupations licensing account in the state government special revenue fund. The commissioner of management and budget shall ensure that the revenues and expenditures of each health-related licensing board are tracked separately in the health occupations licensing account.\n(b) The fees collected must be used only by the boards identified in section 214.01, subdivision 2, and only for the purposes of the programs they administer. The legislature must not transfer money generated by these fees from the state government special revenue fund to the general fund. Surcharges collected by a health-related licensing board under section 16E.22 are not subject to this subdivision.\nWhen a health-related licensing board imposes a surcharge, the surcharge must not be incorporated as a fee increase, but must be made as a separate assessment to be paid by the individuals regulated by the board.\nNotwithstanding any law to the contrary, each health-related and non-health-related licensing board shall promulgate rules providing for the renewal of licenses. The rules shall specify the period of time for which a license is valid, procedures and information required for renewal, and renewal fees to be set pursuant to subdivision 1.\nMS 1996 [Repealed, 1997 c 187 art 5 s 36]",
	"repealed": false
}