{
	"id": "200.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/200.02",
	"title": "200.02 DEFINITIONS.",
	"text": "The terms defined in this section apply to the Minnesota Election Law.\n\"General election\" means an election held at regular intervals on a day determined by law or charter at which the voters of the state or any of its subdivisions choose by ballot public officials or presidential electors.\n\"Primary\" means an election at which the voters of the state or any of its subdivisions choose by ballot the nominees for the offices to be filled at a general election.\n\"Special election\" means:\n(1) an election held at any time to fill vacancies in state or federal offices; or\n(2) an election for a special purpose held by a subdivision of the state on a date authorized by section 205.10, subdivision 3a, or 205A.05, subdivision 1a.\n\"Special primary\" means an election held to choose the nominees for vacant public offices to be filled at a special election.\n\"Political party\" means an association of individuals under whose name a candidate files for partisan office.\n(a) \"Major political party\" means a political party that maintains a party organization in the state; has complied with the party's constitution and rules; is in compliance with the requirements of sections 202A.12 and 202A.13; files with the secretary of state no later than December 1 of each odd-numbered year a certification that the party has met the foregoing requirements, including a list of the dates and locations of each convention held; and meets all other qualification requirements of this subdivision.\n(b) A political party qualifies as a major political party by:\n(1) presenting at least one candidate for election to the office of:\n(i) governor and lieutenant governor, secretary of state, state auditor, or attorney general at the last preceding state general election for those offices; or\n(ii) presidential elector or U.S. senator at the last preceding state general election for presidential electors; and\nwhose candidate received votes in each county in that election and received votes from not less than eight percent of the total number of individuals who voted in that election;\n(2) presenting at least 45 candidates for election to the office of state representative, 23 candidates for election to the office of state senator, four candidates for election to the office of representative in Congress, and one candidate for election to each of the following offices: governor and lieutenant governor, attorney general, secretary of state, and state auditor, at the last preceding state general election for those offices; or\n(3) presenting to the secretary of state at any time before the close of filing for the state partisan primary ballot a petition for a place on the state partisan primary ballot, which petition contains valid signatures of a number of the party members equal to at least five percent of the total number of individuals who voted in the preceding state general election. A signature is valid only if signed no more than one year prior to the date the petition was filed.\n(c) A political party whose candidate receives a sufficient number of votes at a state general election described in paragraph (b), clause (1), or a political party that presents candidates at an election as required by paragraph (b), clause (2), becomes a major political party as of January 1 following that election. A political party that complies with paragraph (a) retains its major party status for at least two state general elections even if the party fails to present a candidate who receives the number and percentage of votes required under paragraph (b), clause (1), or fails to present candidates as required by paragraph (b), clause (2), at subsequent state general elections.\n(d) A major political party whose candidates fail to receive the number and percentage of votes required under paragraph (b), clause (1), and that fails to present candidates as required by paragraph (b), clause (2), at each of two consecutive state general elections described by paragraph (b), clause (1) or (2), respectively, loses major party status as of December 31 following the later of the two consecutive state general elections.\n(e) A major political party that does not submit the certification required by this subdivision loses major party status on December 31 of the year in which the party did not file the certification.\n(f) The secretary of state must notify the chair of the major political party, the commissioner of revenue, and the Campaign Finance and Public Disclosure Board if the political party's status is changed pursuant to this section.\n\"City\" means a home rule charter or statutory city.\nMS 1971 [Repealed, 1973 c 123 art 3 s 7]\n\"Municipality\" means any city or town.\n\"Governing body\" means the board of commissioners of a county, the elected council of a city, or the board of supervisors of a town.\n\"Precinct\" means a geographical area the boundaries of which are established for election purposes in accordance with section 204B.14.\n\"Polling place\" means the place of voting.\n\"Convention\" means an organized body of delegates assembled for the purpose of transacting the business of a major political party.\n\"Election board\" means the election judges serving in a precinct.\n\"Eligible voter\" means an individual who is eligible to vote under section 201.014.\n\"County auditor\" means the county auditor or, in counties where that office does not exist, the principal county officer charged with duties relating to elections.\n\"Member of a major political party\" means an individual who:\n(1) supports the general principles of that party's constitution;\n(2) voted for a majority of that party's candidates in the last general election; or\n(3) intends to vote for a majority of that party's candidates in the next general election.\n\"Oath\" means an oath or affirmation, as the conscience of the individual dictates. If an affirmation is given instead of an oath, \"swear\" means to affirm and \"sworn\" means affirmed.\n\"School district\" means an independent, special, or county school district.\n\"Statewide registration system\" means the computerized central statewide voter registration system and database developed and maintained by the secretary of state pursuant to section 201.022.\n\"Local election official\" means the municipal clerk or principal officer charged with duties relating to elections.\n[Expired]\n(a) \"Minor political party\" means a political party that has adopted a state constitution, designated a state party chair, held a state convention in the last two years, filed with the secretary of state no later than December 31 following the most recent state general election a certification that the party has met the foregoing requirements, and met the requirements of paragraph (b) or (e), as applicable.\n(b) To be considered a minor party in all elections statewide, the political party must have presented at least one candidate:\n(1) for election to the office of governor and lieutenant governor, secretary of state, state auditor, or attorney general, at the last preceding state general election for those offices; or\n(2) for election to the office of presidential elector or U.S. senator at the preceding state general election for presidential electors; and\n(3) who received votes in each county that in the aggregate equal at least one percent of the total number of individuals who voted in the election, or its members must have presented to the secretary of state at any time before the close of filing for the state partisan primary ballot a nominating petition in a form prescribed by the secretary of state containing the valid signatures of party members in a number equal to at least one percent of the total number of individuals who voted in the preceding state general election. A signature is valid only if signed no more than one year prior to the date the petition was filed.\n(c) A political party whose candidate receives a sufficient number of votes at a state general election described in paragraph (b) becomes a minor political party as of January 1 following that election and retains its minor party status for at least two state general elections even if the party fails to present a candidate who receives the number and percentage of votes required under paragraph (b) at subsequent state general elections.\n(d) A minor political party whose candidates fail to receive the number and percentage of votes required under paragraph (b) at each of two consecutive state general elections described by paragraph (b) loses minor party status as of December 31 following the later of the two consecutive state general elections.\n(e) A minor party that qualifies to be a major party loses its status as a minor party at the time it becomes a major party. Votes received by the candidates of a major party must be counted in determining whether the party received sufficient votes to qualify as a minor party, notwithstanding that the party does not receive sufficient votes to retain its major party status. To be considered a minor party in an election in a legislative district, the political party must have presented at least one candidate for a legislative office in that district who received votes from at least ten percent of the total number of individuals who voted for that office, or its members must have presented to the secretary of state a nominating petition in a form prescribed by the secretary of state containing the valid signatures of party members in a number equal to at least ten percent of the total number of individuals who voted in the preceding state general election for that legislative office. A signature is valid only if signed no more than one year prior to the date the petition was filed.\n\"Metropolitan area\" means the counties of Anoka, Carver, Chisago, Dakota, Hennepin, Isanti, Ramsey, Scott, Sherburne, Washington, and Wright.\n\"Polling place roster\" or \"roster\" refers to a roster in (1) printed format; or (2) electronic format as permitted by section 201.225.\n\"Voter signature certificate\" means a printed form or label generated from an electronic polling place roster that contains the voter's name, address of residence, date of birth, voter identification number, the oath required by section 204C.10, and a space for the voter's original signature. A voter signature certificate is not a \"voter certificate\" under section 204C.12.\n\"Partisan offices\" means federal offices, presidential electors, constitutional offices, and legislative offices.\n\"Nonpartisan offices\" means all judicial, county, municipal, school district, and special district offices.\n\"Original signature\" does not include an electronic signature.",
	"repealed": false
}