{
	"id": "624.7174",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7174",
	"title": "624.7174 EMERGENCY ISSUANCE OF EXTREME RISK PROTECTION ORDER.",
	"text": "(a) In determining whether to grant an emergency extreme risk protection order, the court shall consider evidence of all facts identified in section 624.7172, subdivision 2, paragraphs (b) and (c).\n(b) The court shall advise the petitioner of the right to request an order after a hearing under section 624.7172 separately from or simultaneously with the petition.\n(c) If the court finds there is probable cause that (1) the respondent poses a significant danger of bodily harm to other persons or is at significant risk of suicide by possessing a firearm, and (2) the respondent presents an immediate and present danger of either bodily harm to others or of taking their life, the court shall issue an ex parte emergency order prohibiting the respondent from possessing or purchasing a firearm for the duration of the order. The order shall inform the respondent that the respondent is prohibited from possessing or purchasing firearms and shall issue a transfer order under section 624.7175, paragraph (d).\n(d) A finding by the court that there is a basis for issuing an emergency extreme risk protection order constitutes a finding that sufficient reasons exist not to require notice under applicable court rules governing applications for ex parte relief.\n(e) The emergency order shall have a fixed period of 14 days unless a hearing is set under section 624.7172 on an earlier date, in which case the order shall expire upon a judge's finding that no order is issued under section 624.7172.\n(f) Except as provided in paragraph (g), the respondent shall be personally served immediately with a copy of the emergency order and a copy of the petition and, if a hearing is requested by the petitioner under section 624.7172, notice of the date set for the hearing. If the petitioner does not request a hearing under section 624.7172, an order served on a respondent under this section must include a notice advising the respondent of the right to request a hearing challenging the issuance of the emergency order, and must be accompanied by a form that can be used by the respondent to request a hearing.\n(g) Service of the emergency order may be made by alternate service as provided under section 624.7172, subdivision 1, paragraph (e), provided that the petitioner files the affidavit required under that subdivision. If the petitioner does not request a hearing under section 624.7172, the petition mailed to the respondent's residence, if known, must be accompanied by the form for requesting a hearing described in paragraph (f).",
	"repealed": false
}