{
	"id": "473.516",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.516",
	"title": "473.516 WASTE FACILITIES; SEWAGE SLUDGE DISPOSAL.",
	"text": "Without limiting the grant or enumeration of any of the powers conferred on the council under sections 473.501 to 473.549, the council shall have the specific power to acquire by purchase, lease, condemnation, gift or grant any real or personal property, positive and negative easements and water and air rights, and it may construct, enlarge, improve, replace, repair, maintain and operate waste facilities in the metropolitan area deemed to be necessary or convenient in connection with the processing or disposal of waste resulting from sewage treatment, and the council may contract for the maintenance and operation of such waste facilities, subject to the bidding requirements of section 473.523. The council may accept for processing waste derived from outside the metropolitan area in the state, as well as waste derived from within the metropolitan area, and may fix and collect fees and charges for the acceptance of waste as the council determines to be reasonable.\nWith respect to its activities under this section, the council shall be subject to and comply with the applicable provisions of this chapter. Property acquired by the council under this section shall be subject to the provisions of section 473.545. Any site or facility owned or operated for or by the council shall conform to the policy plan adopted under section 473.149. The council shall contract with private persons for the construction, maintenance, and operation of waste facilities, subject to the bidding requirements of section 473.523, where the facilities are adequate and available for use and competitive with other means of providing the same service.\nCounties and local units of government may impose conditions respecting the construction, operation, inspection, monitoring, and maintenance of a waste facility of the council and conditions respecting the sale, gift, delivery, storage, use, and disposal of sewage sludge of the council on private property as a soil conditioner or amendment, but only in the manner and only to the extent authorized and approved by the council and the Pollution Control Agency as being consistent with the establishment and use of the council's waste facilities and the disposal of the council's sewage sludge on private property in accordance with the council's plan, adopted under Minnesota Statutes 1992, section 473.153, and agency permits and rules. Counties may exercise the enforcement powers granted under section 473.811, subdivision 5c, in the manner and to the extent authorized and approved in accordance with this subdivision.\nEach sewage sludge disposal facility of the council, or site used for the disposal of sewage sludge of the council, shall be required to have an agency permit issued pursuant to agency rules for permitting sewage sludge disposal facilities and sites. Each permit shall require a regular monitoring and testing program to be carried out by the council. A regular inspection program shall be conducted by the agency or a county under contract to the agency. The council shall reimburse the agency quarterly for the cost of the program, and the amounts reimbursed are hereby appropriated to the agency for the purposes of the program. The council shall attempt to the greatest practical extent to provide a sludge quality that permits desired nutrient loadings and minimizes elements not essential for plant growth when sludge is disposed of on private property as a soil conditioner or amendment. The council shall provide recipients with information on the facility generating the sludge and the content of the sludge taken from its various treatment facilities.\nMS 2013 Supp [Repealed, 2014 c 271 art 3 s 22]",
	"repealed": false
}