{
	"id": "151.555",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.555",
	"title": "151.555 MEDICATION REPOSITORY PROGRAM.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Central repository\" means a wholesale distributor that meets the requirements under subdivision 3 and enters into a contract with the Board of Pharmacy in accordance with this section.\n(c) \"Distribute\" means to deliver, other than by administering or dispensing.\n(d) \"Donor\" means:\n(1) an individual at least 18 years of age, provided that the drug or medical supply that is donated was obtained legally and meets the requirements of this section for donation; or\n(2) any entity legally authorized to possess medicine with a license or permit in good standing in the state in which it is located, without further restrictions, including but not limited to a health care facility, skilled nursing facility, assisted living facility, pharmacy, wholesaler, and drug manufacturer.\n(e) \"Drug\" means any prescription drug that has been approved for medical use in the United States, is listed in the United States Pharmacopoeia or National Formulary, and meets the criteria established under this section for donation; or any over-the-counter medication that meets the criteria established under this section for donation. This definition includes cancer drugs and antirejection drugs, but does not include controlled substances, as defined in section 152.01, subdivision 4, or a prescription drug that can only be dispensed to a patient registered with the drug's manufacturer in accordance with federal Food and Drug Administration requirements.\n(f) \"Health care facility\" means:\n(1) a physician's office or health care clinic where licensed practitioners provide health care to patients;\n(2) a hospital licensed under section 144.50;\n(3) a pharmacy licensed under section 151.19 and located in Minnesota; or\n(4) a nonprofit community clinic, including a federally qualified health center; a rural health clinic; public health clinic; or other community clinic that provides health care utilizing a sliding fee scale to patients who are low-income, uninsured, or underinsured.\n(g) \"Local repository\" means a health care facility that elects to accept donated drugs and medical supplies and meets the requirements of subdivision 4.\n(h) \"Medical supplies\" or \"supplies\" means any prescription or nonprescription medical supplies needed to administer a drug.\n(i) \"Original, sealed, unopened, tamper-evident packaging\" means packaging that is sealed, unopened, and tamper-evident, including a manufacturer's original unit dose or unit-of-use container, a repackager's original unit dose or unit-of-use container, or unit-dose packaging prepared by a licensed pharmacy according to the standards of Minnesota Rules, part 6800.3750.\n(j) \"Practitioner\" has the meaning given in section 151.01, subdivision 23, except that it does not include a veterinarian.\n(a) The Board of Pharmacy shall establish a medication repository program, through which donors may donate a drug or medical supply for use by an individual who meets the eligibility criteria specified under subdivision 5.\n(b) The board shall contract with a central repository that meets the requirements of subdivision 3 to implement and administer the medication repository program. The contract must:\n(1) require payment by the board to the central repository any amount appropriated by the legislature for the operation and administration of the medication repository program;\n(2) require the central repository to report the following performance measures to the board:\n(i) the number of individuals served and the types of medications these individuals received;\n(ii) the number of clinics, pharmacies, and long-term care facilities with which the central repository partnered;\n(iii) the number and cost of medications accepted for inventory, disposed of, and dispensed to individuals in need; and\n(iv) locations within the state to which medications were shipped or delivered; and\n(3) require the board to annually audit the expenditure by the central repository of any money appropriated by the legislature and paid under a contract by the board to ensure that the amount appropriated is used only for purposes specified in the contract.\n(a) The board may publish a request for proposal for participants who meet the requirements of this subdivision and are interested in acting as the central repository for the medication repository program. If the board publishes a request for proposal, it shall follow all applicable state procurement procedures in the selection process. The board may also work directly with the University of Minnesota to establish a central repository.\n(b) To be eligible to act as the central repository, the participant must be a wholesale drug distributor located in Minnesota, licensed pursuant to section 151.47, and in compliance with all applicable federal and state statutes, rules, and regulations.\n(c) The central repository shall be subject to inspection by the board pursuant to section 151.06, subdivision 1.\n(d) The central repository shall comply with all applicable federal and state laws, rules, and regulations pertaining to the medication repository program, drug storage, and dispensing. The facility must maintain in good standing any state license or registration that applies to the facility.\n(a) To be eligible for participation in the medication repository program, a health care facility must agree to comply with all applicable federal and state laws, rules, and regulations pertaining to the medication repository program, drug storage, and dispensing. The facility must also agree to maintain in good standing any required state license or registration that may apply to the facility.\n(b) A local repository may elect to participate in the program by submitting the following information to the central repository on a form developed by the board and made available on the board's website:\n(1) the name, street address, and telephone number of the health care facility and any state-issued license or registration number issued to the facility, including the issuing state agency;\n(2) the name and telephone number of a responsible pharmacist or practitioner who is employed by or under contract with the health care facility; and\n(3) a statement signed and dated by the responsible pharmacist or practitioner indicating that the health care facility meets the eligibility requirements under this section and agrees to comply with this section.\n(c) Participation in the medication repository program is voluntary. A local repository may withdraw from participation in the medication repository program at any time by providing written notice to the central repository on a form developed by the board and made available on the board's website.\n(a) At the time of or before receiving donated drugs or supplies as a new eligible patient, an individual must submit to a local repository an electronic or physical intake application form that is signed by the individual and attests that the individual:\n(1) is a resident of Minnesota;\n(2) is uninsured, has no prescription drug coverage, or is underinsured;\n(3) acknowledges that the drugs or medical supplies to be received through the program may have been donated; and\n(4) consents to a waiver of the child-resistant packaging requirements of the federal Poison Prevention Packaging Act.\n(b) The local repository shall send a copy of the intake application form to the central repository by regular mail, facsimile, or secured email within ten days from the date the application is approved by the local repository.\n(c) The board shall develop and make available on the board's website an application form.\n(a) Notwithstanding any other law or rule, a donor may donate drugs or medical supplies to the central repository or a local repository if the drug or supply meets the requirements of this section as determined by a pharmacist or practitioner who is employed by or under contract with the central repository or a local repository.\n(b) A drug is eligible for donation under the medication repository program if the following requirements are met:\n(1) the drug's expiration date is at least six months after the date the drug was donated. If a donated drug bears an expiration date that is less than six months from the donation date, the drug may be accepted and distributed if the drug is in high demand and can be dispensed for use by a patient before the drug's expiration date;\n(2) the drug is in its original, sealed, unopened, tamper-evident packaging that includes the expiration date. Single-unit-dose drugs may be accepted if the single-unit-dose packaging is unopened;\n(3) the drug or the packaging does not have any physical signs of tampering, misbranding, deterioration, compromised integrity, or adulteration;\n(4) the drug does not require storage temperatures other than normal room temperature as specified by the manufacturer or United States Pharmacopoeia, unless the drug is being donated directly by its manufacturer, a wholesale drug distributor, or a pharmacy located in Minnesota; and\n(5) the drug is not a controlled substance.\n(c) A medical supply is eligible for donation under the medication repository program if the following requirements are met:\n(1) the supply has no physical signs of tampering, misbranding, or alteration and there is no reason to believe it has been adulterated, tampered with, or misbranded;\n(2) the supply is in its original, unopened, sealed packaging; and\n(3) if the supply bears an expiration date, the date is at least six months later than the date the supply was donated. If the donated supply bears an expiration date that is less than six months from the date the supply was donated, the supply may be accepted and distributed if the supply is in high demand and can be dispensed for use by a patient before the supply's expiration date.\n(d) The board shall develop the medication repository donor form and make it available on the board's website. Prior to the first donation from a new donor, a central repository or local repository shall verify and record the following information on the donor form:\n(1) the donor's name, address, phone number, and license number, if applicable;\n(2) that the donor will only make donations in accordance with the program;\n(3) to the best of the donor's knowledge, only drugs or supplies that have been properly stored under appropriate temperature and humidity conditions will be donated; and\n(4) to the best of the donor's knowledge, only drugs or supplies that have never been opened, used, tampered with, adulterated, or misbranded will be donated.\n(e) Notwithstanding any other law or rule, a central repository or a local repository may receive donated drugs from donors. Donated drugs and supplies may be shipped or delivered to the premises of the central repository or a local repository, and shall be inspected by a pharmacist or an authorized practitioner who is employed by or under contract with the repository and who has been designated by the repository prior to dispensing. A drop box must not be used to deliver or accept donations.\n(f) The central repository and local repository shall maintain a written or electronic inventory of all drugs and supplies donated to the repository upon acceptance of each drug or supply. For each drug, the inventory must include the drug's name, strength, quantity, manufacturer, expiration date, and the date the drug was donated. For each medical supply, the inventory must include a description of the supply, its manufacturer, the date the supply was donated, and, if applicable, the supply's brand name and expiration date. The board may waive the requirement under this paragraph if an entity is under common ownership or control with a central repository or local repository and either the entity or the repository maintains an inventory containing all the information required under this paragraph.\n(a) A pharmacist or authorized practitioner who is employed by or under contract with the central repository or a local repository shall inspect all donated drugs and supplies before the drug or supply is dispensed to determine, to the extent reasonably possible in the professional judgment of the pharmacist or practitioner, that the drug or supply is not adulterated or misbranded, has not been tampered with, is safe and suitable for dispensing, has not been subject to a recall, and meets the requirements for donation. If a local repository receives drugs and supplies from the central repository, the local repository does not need to reinspect the drugs and supplies.\n(b) The central repository and local repositories shall store donated drugs and supplies in a secure storage area under environmental conditions appropriate for the drug or supply being stored. Donated drugs and supplies may not be stored with nondonated inventory.\n(c) The central repository and local repositories shall dispose of all drugs and medical supplies that are not suitable for donation in compliance with applicable federal and state statutes, regulations, and rules concerning hazardous waste.\n(d) In the event that controlled substances or drugs that can only be dispensed to a patient registered with the drug's manufacturer are shipped or delivered to a central or local repository for donation, the shipment delivery must be documented by the repository and returned immediately to the donor or the donor's representative that provided the drugs.\n(e) Each repository must develop drug and medical supply recall policies and procedures. If a repository receives a recall notification, the repository shall destroy all of the drug or medical supply in its inventory that is the subject of the recall and complete a record of destruction form in accordance with paragraph (f). If a drug or medical supply that is the subject of a Class I or Class II recall has been dispensed, the repository shall immediately notify the recipient of the recalled drug or medical supply. A drug that potentially is subject to a recall need not be destroyed if its packaging bears a lot number and that lot of the drug is not subject to the recall. If no lot number is on the drug's packaging, it must be destroyed.\n(f) A record of destruction of donated drugs and supplies that are not dispensed under subdivision 8, are subject to a recall under paragraph (e), or are not suitable for donation shall be maintained by the repository for at least two years. For each drug or supply destroyed, the record shall include the following information:\n(1) the date of destruction;\n(2) the name, strength, and quantity of the drug destroyed; and\n(3) the name of the person or firm that destroyed the drug.\nNo other record of destruction is required.\n(a) Donated prescription drugs and supplies may be dispensed if the drugs or supplies are prescribed by a practitioner for use by an eligible individual and are dispensed by a pharmacist or practitioner. A repository shall dispense drugs and supplies to eligible individuals in the following priority order: (1) individuals who are uninsured; (2) individuals with no prescription drug coverage; and (3) individuals who are underinsured. A repository shall dispense donated drugs in compliance with applicable federal and state laws and regulations for dispensing drugs, including all requirements relating to packaging, labeling, record keeping, drug utilization review, and patient counseling.\n(b) Before dispensing or administering a drug or supply, the pharmacist or practitioner shall visually inspect the drug or supply for adulteration, misbranding, tampering, and date of expiration. Drugs or supplies that have expired or appear upon visual inspection to be adulterated, misbranded, or tampered with in any way must not be dispensed or administered.\n(c) Before the first drug or supply is dispensed or administered to an individual, the individual must sign an electronic or physical drug repository recipient form acknowledging that the individual understands:\n(1) that the drug or supply being dispensed or administered has been donated and may have been previously dispensed;\n(2) that a visual inspection has been conducted by the pharmacist or practitioner to ensure that the drug or supply has not expired, has not been adulterated or misbranded, and is in its original, unopened packaging; and\n(3) that the dispensing pharmacist, the dispensing or administering practitioner, the central repository or local repository, the Board of Pharmacy, and any other participant of the medication repository program cannot guarantee the safety of the drug or medical supply being dispensed or administered and that the pharmacist or practitioner has determined that the drug or supply is safe to dispense or administer based on the accuracy of the donor's form submitted with the donated drug or medical supply and the visual inspection required to be performed by the pharmacist or practitioner before dispensing or administering.\n(a) The central or local repository may charge the individual receiving a drug or supply a handling fee of no more than 250 percent of the medical assistance program dispensing fee for each drug or medical supply dispensed or administered by that repository.\n(b) A repository that dispenses or administers a drug or medical supply through the medication repository program shall not receive reimbursement under the medical assistance program or the MinnesotaCare program for that dispensed or administered drug or supply.\n(c) A supply or handling fee must not be charged to an individual enrolled in the medical assistance or MinnesotaCare program.\n(a) The central repository and local repositories may distribute drugs and supplies donated under the medication repository program to other participating repositories for use pursuant to this program.\n(b) A local repository that elects not to dispense donated drugs or supplies must transfer all donated drugs and supplies to the central repository. A copy of the donor form that was completed by the original donor under subdivision 6 must be provided to the central repository at the time of transfer.\n(a) The following forms developed for the administration of this program shall be available on the board's website:\n(1) intake application form described under subdivision 5;\n(2) local repository participation form described under subdivision 4;\n(3) local repository withdrawal form described under subdivision 4;\n(4) medication repository donor form described under subdivision 6;\n(5) record of destruction form described under subdivision 7; and\n(6) medication repository recipient form described under subdivision 8.\nParticipants may use substantively similar electronic or physical forms.\n(b) All records, including drug inventory and disposal of donated drugs and medical supplies, must be maintained by a repository for a minimum of two years. Records required as part of this program must be maintained pursuant to all applicable practice acts.\n(c) Data collected by the medication repository program from all local repositories shall be submitted quarterly or upon request to the central repository. Data collected may consist of the information, records, and forms required to be collected under this section.\n(d) The central repository shall submit reports to the board as required by the contract or upon request of the board.\n(a) The manufacturer of a drug or supply is not subject to criminal or civil liability for injury, death, or loss to a person or to property for causes of action described in clauses (1) and (2). A manufacturer is not liable for:\n(1) the intentional or unintentional alteration of the drug or supply by a party not under the control of the manufacturer; or\n(2) the failure of a party not under the control of the manufacturer to transfer or communicate product or consumer information or the expiration date of the donated drug or supply.\n(b) A health care facility participating in the program, a pharmacist dispensing a drug or supply pursuant to the program, a practitioner dispensing or administering a drug or supply pursuant to the program, a donor of a drug or medical supply, or a person or entity that facilitates any of the above is immune from civil liability for an act or omission that causes injury to or the death of an individual to whom the drug or supply is dispensed and no disciplinary action by a health-related licensing board shall be taken against a person or entity so long as the drug or supply is donated, accepted, distributed, and dispensed according to the requirements of this section. This immunity does not apply if the act or omission involves reckless, wanton, or intentional misconduct, or malpractice unrelated to the quality of the drug or medical supply.\nNothing in this section allows a long-term care facility to donate a drug to a central or local repository when federal or state law requires the drug to be returned to the pharmacy that initially dispensed it, so that the pharmacy can credit the payer for the amount of the drug returned.\nThe central repository, as approved by the Board of Pharmacy, may enter into an agreement with another state that has an established drug repository or drug donation program if the other state's program includes regulations to ensure the purity, integrity, and safety of the drugs and supplies donated, to permit the central repository to offer to another state program inventory that is not needed by a Minnesota resident and to accept inventory from another state program to be distributed to local repositories and dispensed to Minnesota residents in accordance with this program.\nThe central repository may seek grants and other money from nonprofit charitable organizations, the federal government, and other sources to fund the ongoing operations of the medication repository program.",
	"repealed": false
}