{
	"id": "424A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.04",
	"title": "424A.04 VOLUNTEER RELIEF ASSOCIATIONS; BOARD OF TRUSTEES.",
	"text": "(a) A relief association that is directly associated with a municipal fire department must be managed by a board of trustees consisting of nine members. Six trustees must be elected from the membership of the relief association and three trustees must be drawn from the officials of the municipalities served by the fire department to which the relief association is directly associated. The bylaws of a relief association which provides a monthly benefit service pension may provide that one of the six trustees elected from the relief association membership may be a retired member receiving a monthly pension who is elected by the membership of the relief association. The three municipal trustees must be one elected municipal official and one elected or appointed municipal official who are designated as municipal representatives by the municipal governing board annually and the chief of the municipal fire department.\n(b) A relief association that is a subsidiary of an independent nonprofit firefighting corporation must be managed by a board of trustees consisting of nine members. Six trustees must be elected from the membership of the relief association, two trustees must be drawn from the officials of the municipalities served by the fire department to which the relief association is directly associated, and one trustee must be the fire chief serving with the independent nonprofit firefighting corporation. The bylaws of a relief association may provide that one of the six trustees elected from the relief association membership may be a retired member receiving a monthly pension who is elected by the membership of the relief association. The two municipal trustees must be elected or appointed municipal officials, selected as follows:\n(1) if only one municipality contracts with the independent nonprofit firefighting corporation, the municipal trustees must be two officials of the contracting municipality who are designated annually by the governing body of the municipality; or\n(2) if two or more municipalities contract with the independent nonprofit corporation, the municipal trustees must be one official from each of the two largest municipalities in population who are designated annually by the governing bodies of the applicable municipalities.\n(c) The municipal trustees for a relief association that is directly associated with a fire department operated as or by a joint powers entity must be the fire chief of the fire department and two trustees designated annually by the joint powers board. The municipal trustees for a relief association that is directly associated with a fire department service area township must be the fire chief of the fire department and two trustees designated by the township board.\n(d) If a relief association lacks the municipal board members provided for in paragraph (a), (b), or (c) because the fire department is not located in or associated with a municipality or joint powers entity, the municipal board members must be the fire chief of the fire department and two board members appointed from the fire department service area by the board of commissioners of the applicable county.\n(e) The term of the appointed municipal board members is one year or until the person's successor is qualified, whichever is later.\n(f) A municipal trustee under paragraph (a), (b), (c), or (d) has all the rights and duties accorded to any other trustee, except the right to be an officer of the relief association board of trustees.\n(g) A board must have at least three officers, who are a president, a secretary and a treasurer. These officers must be elected from among the elected trustees by either the full board of trustees or by the relief association membership, as specified in the bylaws. In no event may any trustee hold more than one officer position at any one time. The terms of the elected trustees and of the officers of the board must be specified in the bylaws of the relief association, but may not exceed three years. If the term of the elected trustees exceeds one year, the election of the various trustees elected from the membership must be staggered on as equal a basis as is practicable.\nThe board of trustees of a relief association shall undertake their activities consistent with chapter 356A.\nIn the discharge of their respective duties, the officers and trustees shall be held to the standard of care specified in section 11A.09. In addition, the trustees shall act in accordance with chapter 356A. Each member of the board is a fiduciary and shall undertake all fiduciary activities in accordance with the standard of care of section 11A.09, and in a manner consistent with chapter 356A. No fiduciary of a relief association shall cause a relief association to engage in a transaction if the fiduciary knows or should know that the transaction constitutes one of the following direct or indirect transactions:\n(1) sale or exchange or leasing of any real property between the relief association and a board member;\n(2) lending of money or other extension of credit between the relief association and a board member or member of the relief association;\n(3) furnishing of goods, services, or facilities between the relief association and a board member; or\n(4) transfer to a board member, or use by or for the benefit of a board member, of any assets of the relief association. A transfer of assets does not mean the payment of relief association benefits or administrative expenses permitted by law.\n(a) If a firefighters relief association employs or contracts with a consultant to provide legal or financial advice, the secretary of the relief association shall obtain and the consultant shall provide to the secretary of the relief association a copy of the consultant's certificate of insurance.\n(b) A consultant is any person who is employed under contract to provide legal or financial advice and who is or who represents to the firefighters relief association that the person is:\n(1) an actuary;\n(2) a certified public accountant;\n(3) an attorney;\n(4) an investment advisor or manager, or an investment counselor;\n(5) an investment advisor or manager selection consultant;\n(6) a pension benefit design advisor or consultant; or\n(7) any other financial consultant.",
	"repealed": false
}