{
	"id": "181.212",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.212",
	"title": "181.212 MINNESOTA NURSING HOME WORKFORCE STANDARDS BOARD; ESTABLISHMENT.",
	"text": "(a) The Minnesota Nursing Home Workforce Standards Board is created with the powers and duties established by law. The board is composed of the following voting members:\n(1) the commissioner of human services or a designee;\n(2) the commissioner of health or a designee;\n(3) the commissioner of labor and industry or a designee;\n(4) three members who represent nursing home employers or employer organizations, appointed by the governor in accordance with section 15.066; and\n(5) three members who represent nursing home workers or worker organizations, appointed by the governor in accordance with section 15.066.\n(b) In making appointments under clause (4), the governor shall consider the geographic distribution of nursing homes within the state.\n(a) Board members appointed under subdivision 1, clause (4) or (5), shall serve four-year terms following the initial staggered-lot determination.\n(b) For members appointed under subdivision 1, clause (4) or (5), the governor shall fill vacancies occurring prior to the expiration of a member's term by appointment for the unexpired term. A member appointed under subdivision 1, clause (4) or (5), must not be appointed to more than two consecutive terms.\n(c) A member serves until a successor is appointed.\nThe board shall elect a member by majority vote to serve as its chairperson and shall determine the term to be served by the chairperson.\nThe commissioner may employ an executive director for the board and other personnel to carry out duties of the board under sections 181.211 to 181.217.\nCompensation of board members is governed by section 15.0575.\nMeetings of the board are subject to chapter 13D. The board is subject to chapter 13. The board shall comply with section 15.0597.\nThe affirmative vote of five board members is required for the board to take any action, including actions necessary to establish minimum nursing home employment standards under section 181.213. At least two of the five affirmative votes must be cast by the commissioner members or the commissioner's appointees.\nTo carry out its duties, the board shall hold public hearings on, and conduct investigations into, working conditions in the nursing home industry in accordance with section 181.213.\nThe commissioner shall provide staff support to the board. The support includes professional, legal, technical, and clerical staff necessary to perform rulemaking and other duties assigned to the board. The commissioner shall supply necessary office space and supplies to assist the board in its duties.\nThe board shall establish operating procedures that meet all state and federal antitrust requirements and may prohibit board member access to data to meet the requirements of this subdivision.\nBy December 1, 2023, and each December 1 thereafter, the executive director of the board shall submit a report to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over labor and human services on any actions taken and any standards adopted by the board.",
	"repealed": false
}