{
	"id": "142D.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.14",
	"title": "142D.14 AFTER-SCHOOL COMMUNITY LEARNING PROGRAMS.",
	"text": "A competitive statewide after-school community learning grant program is established to provide grants to support eligible organizations to provide culturally affirming and enriching after-school and summer learning programs for school-age youth after school or during nonschool hours. Grants must be used to offer a broad array of academic enrichment activities that promote positive after-school and summer learning activities, including art, music, community engagement, literacy, science, technology, engineering, math, health, and recreation programs. The commissioner shall develop criteria for after-school community learning programs that promote partnerships and active collaboration with the schools that participating students attend. The commissioner may award grants under this section to community or nonprofit organizations, culturally specific organizations, American Indian organizations, Tribal Nations, political subdivisions, public libraries, or school-based programs that serve youth after school, during the summer, or during nonschool hours.\nThe objectives of the after-school community learning programs are to:\n(1) increase access to comprehensive and culturally affirming after-school and summer learning and enrichment opportunities that meet the academic, social, and emotional needs of historically underserved students;\n(2) promote engagement in learning and connections to school and community; and\n(3) encourage school attendance and improve academic performance.\n(a) An applicant must submit an after-school community learning program proposal to the commissioner. The submitted proposal must include:\n(1) an assessment of the needs and available resources for the after-school community learning program and a description of how the proposed program will address the needs identified, including how students and families were engaged in the process;\n(2) a description of the partnership between a school and another eligible entity;\n(3) an explanation of how the proposal will support the objectives identified in subdivision 2, including the use of best practices;\n(4) a plan to implement effective after-school and summer learning practices and provide staff access to professional development opportunities; and\n(5) a description of the data they will use to evaluate the impact of the program.\n(b) The commissioner must review proposals and award grants to programs that:\n(1) primarily serve historically underserved students; and\n(2) provide opportunities for academic enrichment and a broad array of additional services and activities to meet program objectives.\n(c) To the extent practicable, the commissioner must award grants equitably among the geographic areas of Minnesota, including rural, suburban, and urban communities.\n(a) The commissioner must monitor and evaluate the performance of grant recipients to assess the effectiveness of after-school community learning programs in meeting the objectives identified in subdivision 2.\n(b) The commissioner must provide technical assistance, capacity building, and professional development to grant recipients, including guidance on effective practices for after-school and summer learning programs.",
	"repealed": false
}