{
	"id": "469.110",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.110",
	"title": "469.110 DEFINITIONS.",
	"text": "In sections 469.109 to 469.123, the terms defined in this section have the meanings given them herein, unless the context indicates otherwise.\n\"Department\" means the Department of Employment and Economic Development.\n\"Local agency\" means the area or municipal redevelopment agencies created or authorized to be created by sections 469.109 to 469.123, or the governing body of any Indian tribe or any entity established and recognized by that governing body.\n\"Municipality\" means any home rule charter or statutory city, county, town, or school district.\n\"Governing body\" means the council, board of trustees, or other body charged with governing any municipality.\n\"Board\" means the governing body of any local or area redevelopment agency created in accordance with the provisions of sections 469.109 to 469.123.\n\"Redevelopment area\" means a depressed area within the territorial boundaries of any municipality or group of municipalities of the state reasonably defined by the local or area redevelopment agency wherein critical conditions of unemployment, underdevelopment, economic depression, depletion of natural resources, or widespread reliance on public assistance are found to exist by the municipality or municipalities.\n\"Federal agency\" means the government of the United States or any department, corporation, agency, or instrumentality thereof.\nMS 1994 [Repealed, 1995 c 186 s 80]\n\"Redevelopment project\" means any approved site, structure, facility, or undertaking comprising or connected with any industrial, recreational, commercial, or manufacturing enterprise established or assisted by a local, regional, or area redevelopment agency.\n\"Rural area\" means any area so defined in section 469.109 of the Rural Development Act of 1972, Public Law 92-419, and unless in conflict with that act, shall include all areas not within the outer boundary of any city having a population of 50,000 or more and its immediately adjacent urbanized and urbanizing areas with a population density of more than 100 persons per square mile.\n\"Indian economic enterprise\" means any commercial, industrial, or business activity established or organized for the purpose of profit, at least 51 percent of which is owned by persons of 25 percent or more Indian blood.\n\"Indian tribe\" means any group qualifying under Public Law 93-262, section 3.",
	"repealed": false
}