{
	"id": "308B.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.801",
	"title": "308B.801 MERGER AND CONSOLIDATION.",
	"text": "Unless otherwise prohibited, cooperatives organized under the laws of this state, including cooperatives organized under this chapter or chapter 308A, may merge or consolidate with each other, a Minnesota limited liability company under the provisions of sections 322C.1001 to 322C.1015, or other business entities organized under the laws of another state by complying with the provisions of this section and the law of the state where the surviving or new business entity will exist. A cooperative may not merge or consolidate with a business entity organized under the laws of this state, other than a cooperative organized under chapter 308A, unless the law governing the business entity expressly authorizes merger or consolidation with a cooperative. This subdivision does not authorize a foreign business entity to do any act not authorized by the law governing the foreign business entity.\nTo initiate a merger or consolidation of a cooperative, a written plan of merger or consolidation shall be prepared by the board or by a committee selected by the board to prepare a plan. The plan shall state:\n(1) the names of the constituent domestic cooperatives, the name of any Minnesota limited liability company that is a party to the merger, to the extent authorized under sections 322C.1001 to 322C.1005 and 322C.1015, and any foreign business entities;\n(2) the name of the surviving or new domestic cooperative, Minnesota limited liability company as required by section 322C.1002, or other foreign business entity;\n(3) the manner and basis of converting membership or ownership interests of the constituent domestic cooperatives, the surviving Minnesota limited liability company as provided in section 322C.1002, or foreign business entities into membership or ownership interests in the surviving or new domestic cooperative, the surviving Minnesota limited liability company as authorized in section 322C.1002, or foreign business entity;\n(4) the terms of the merger or consolidation;\n(5) the proposed effect of the consolidation or merger on the members and patron members of each constituent domestic cooperative; and\n(6) for a consolidation, the plan shall contain the articles of the entity or organizational documents to be filed with the state in which the entity is organized or, if the surviving organization is a Minnesota limited liability company, the articles of organization.\nThe following shall apply to notice:\n(1) the board shall mail or otherwise transmit or deliver notice of the merger or consolidation to each member. The notice shall contain the full text of the plan, and the time and place of the meeting at which the plan will be considered; and\n(2) a cooperative with more than 200 members may provide the notice in the same manner as a regular members' meeting notice.\n(a) A plan of merger or consolidation shall be adopted by a domestic cooperative as provided in this subdivision.\n(b) A plan of merger or consolidation is adopted if:\n(1) a quorum of the members eligible to vote is registered as being present or represented by mail vote or alternative ballot at the meeting; and\n(2) the plan is approved by the patron members, or if otherwise provided in the articles or bylaws is approved by a majority of the votes cast in each class of votes cast, or for a domestic cooperative with articles or bylaws requiring more than a majority of the votes cast or other conditions for approval, the plan is approved by a proportion of the votes cast or a number of total members as required by the articles or bylaws and the conditions for approval in the articles or bylaws have been satisfied.\n(c) After the plan has been adopted, articles of merger or consolidation stating the plan and that the plan was adopted according to this subdivision shall be signed by the chair, vice chair, records officer, or documents officer of each cooperative merging or consolidating.\n(d) The articles of merger or consolidation shall be filed in the Office of the Secretary of State.\n(e) For a merger, the articles of the surviving domestic cooperative subject to this chapter are deemed amended to the extent provided in the articles of merger.\n(f) Unless a later date is provided in the plan, the merger or consolidation is effective when the articles of merger or consolidation are filed in the office of the secretary of state or the appropriate office of another jurisdiction.\n(g) The secretary of state shall issue a certificate of organization of the merged or consolidated cooperative.\nFor a merger that does not involve a Minnesota limited liability company, the following shall apply to the effect of a merger:\n(a) After the effective date, the domestic cooperative, Minnesota limited liability company, if party to the plan, and any foreign business entity that is a party to the plan become a single entity. For a merger, the surviving business entity is the business entity designated in the plan. For a consolidation, the new domestic cooperative, the Minnesota limited liability company, if any, and any foreign business entity is the business entity provided for in the plan. Except for the surviving or new domestic cooperative, Minnesota limited liability company, or foreign business entity, the separate existence of each merged or consolidated domestic or foreign business entity that is a party to the plan ceases on the effective date of the merger or consolidation.\n(b) The surviving or new domestic cooperative, Minnesota limited liability company, or foreign business entity possesses all of the rights and property of each of the merged or consolidated business entities and is responsible for all their obligations. The title to property of the merged or consolidated domestic cooperative or foreign business entity is vested in the surviving or new domestic cooperative, Minnesota limited liability company, or foreign business entity without reversion or impairment of the title caused by the merger or consolidation.\n(c) If a merger involves a Minnesota limited liability company, this subdivision is subject to the provisions of section 322C.1002.",
	"repealed": false
}