{
	"id": "260C.613",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.613",
	"title": "260C.613 SOCIAL SERVICES AGENCY AS COMMISSIONER'S AGENT.",
	"text": "(a) The responsible social services agency has exclusive authority to make an adoptive placement decision for a child under the guardianship of the commissioner. The child is legally placed for adoption when the adopting parent, the agency, and the commissioner have fully executed an adoption placement agreement on the form prescribed by the commissioner.\n(b) The responsible social services agency shall use an individualized determination of the child's current and future needs, pursuant to section 260C.212, subdivision 2, paragraph (b), to determine the most suitable adopting parent for the child in the child's best interests. The responsible social services agency must consider adoptive placement of the child with relatives in the order specified in section 260C.212, subdivision 2, paragraph (a).\n(c) The responsible social services agency shall notify the court and parties entitled to notice under section 260C.607, subdivision 2, when there is a fully executed adoption placement agreement for the child.\n(d) Pursuant to section 260C.615, subdivision 1, paragraph (b), clause (4), the responsible social services agency shall immediately notify the commissioner if the agency learns of any new or previously undisclosed criminal or maltreatment information involving an adoptive placement of a child under guardianship of the commissioner.\n(e) In the event a party to an adoption placement agreement terminates the agreement, the responsible social services agency shall notify the court, the parties entitled to notice under section 260C.607, subdivision 2, and the commissioner that the agreement and the adoptive placement have terminated.\nThe responsible social services agency may disclose private data, as defined in section 13.02, to prospective adoptive parents for the purpose of identifying an adoptive parent willing and able to meet the child's needs as outlined in section 260C.212, subdivision 2, paragraph (b).\nThe responsible social services agency shall place siblings together for adoption according to section 260.012, paragraph (e), clause (4), unless:\n(1) the court makes findings required under section 260C.617; and\n(2) the court orders that the adoption or progress toward adoption of the child under the court's jurisdiction may proceed notwithstanding that the adoption will result in siblings being separated.\nPlacement of a child cannot be delayed or denied based on the race, color, or national origin of the prospective parent or the child.\nThe responsible social services agency shall document, in the records required to be kept under section 259.79, the reasons for the adoptive placement decision regarding the child, including the individualized determination of the child's needs based on the factors in section 260C.212, subdivision 2, paragraph (b); the agency's consideration of relatives in the order specified in section 260C.212, subdivision 2, paragraph (a); and the assessment of how the selected adoptive placement meets the identified needs of the child. The responsible social services agency shall retain in the records required to be kept under section 259.79, copies of all out-of-home placement plans made since the child was ordered under guardianship of the commissioner and all court orders from reviews conducted pursuant to section 260C.607.\n(a) The agency shall inform the adoptive parents that the adoptive parents of an adopted child under age 19 or an adopted person age 19 or older may maintain a current address on file with the agency and indicate a desire to be notified if the agency receives information of the death of a birth parent. The agency shall notify birth parents of the child's death and the cause of death, if known, provided that the birth parents desire notice and maintain current addresses on file with the agency. The agency shall inform birth parents entitled to notice under section 259.27 that they may designate individuals to notify the agency if a birth parent dies and that the agency receiving information of the birth parent's death will share the information with adoptive parents, if the adopted person is under age 19, or an adopted person age 19 or older who has indicated a desire to be notified of the death of a birth parent and who maintains a current address on file with the agency.\n(b) Notice to a birth parent that a child has died or to the adoptive parents or an adopted person age 19 or older that a birth parent has died shall be provided by an employee of the agency through personal and confidential contact, but not by mail.\nIf a birth parent or the child is terminally ill, the responsible social services agency shall inform the adoptive parents and birth parents of a child who is adopted that the birth parents, the adoptive parents of an adopted person under age 19, or an adopted person age 19 or older may request to be notified of the terminal illness. The agency shall notify the other parties if a request is received under this subdivision and upon a party's request the agency shall share information regarding a terminal illness with the adoptive or birth parents or an adopted person age 19 or older.\nThe responsible social services agency shall respond to requests from adopted persons age 19 years and over, adoptive parents of a minor child, and birth parents for social and medical history and genetic health conditions of the adopted person's birth family and genetic sibling information according to section 259.83.",
	"repealed": false
}