{
	"id": "626.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.76",
	"title": "626.76 RULES AND REGULATIONS; AIDING OTHER OFFICERS; EXCHANGE PROGRAMS.",
	"text": "Any appointive or elective agency or office of peace officers as defined in subdivision 3 may establish rules or regulations and enter into agreements with other agencies and offices for:\n(1) assisting other peace officers in the line of their duty and within the course of their employment; and\n(2) exchanging the agency's peace officers with peace officers of another agency or office on a temporary basis. Additionally, the agency or office may establish rules and regulations for assisting probation, parole, and supervised release agents who are supervising probationers, parolees, or supervised releasees in the geographic area within the agency's or office's jurisdiction.\n(a) When a peace officer gives assistance to another peace officer, or to a parole, probation, or supervised release agent, within the scope of the rules or regulations of the peace officer's appointive or elected agency or office, any such assistance shall be within the line of duty and course of employment of the officer rendering the assistance.\n(b) When a peace officer acts on behalf of another agency or office within the scope of an exchange agreement entered into under subdivision 1, the officer's actions are within the officer's line of duty and course of employment to the same extent as if the officer had acted on behalf of the officer's employing agency.\nFor the purposes of this section, \"peace officer\" means any member of a police department, State Patrol, game warden service, sheriff's office, or any other law enforcement agency, the members of which have, by law, the power of arrest.\nThis section shall in no way be construed as extending or enlarging the duties or authority of any peace officer or any other law enforcement agent as defined in subdivision 3 except as provided in this section.",
	"repealed": false
}