{
	"id": "62I.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/62I.22",
	"title": "62I.22 HEARING.",
	"text": "The commissioner shall forward a copy of the petition to activate the Joint Underwriting Association with respect to a class of business to the chief administrative law judge. The chief administrative law judge shall, within three business days of receipt of the copy of the petition, set a hearing date, assign an administrative law judge to hear the matter, and notify the commissioner of the hearing date and the administrative law judge assigned to hear the matter. The hearing date must be no less than 60 days nor more than 90 days from the date of receipt of the petition by the chief administrative law judge.\nThe commissioner of commerce shall publish notice of the hearing in the State Register at least 30 days before the hearing date. The notice should be that used for rulemaking under chapter 14. Approval by the administrative law judge of the notice prior to publication is not required. The notice must contain a statement that anyone wishing to oppose activation beyond 180 days for any particular class, must file a petition to intervene with the administrative law judge at least ten days before the hearing date. If no notice to intervene is filed for a class, then the class is activated beyond the 180-day period without further action.\nThe hearing and all matters after the hearing are a contested case under chapter 14. Within 45 days from the commencement of the hearing and within 15 days of the completion of the hearing the administrative law judge shall submit a report to the commissioner of commerce. The parties, or the administrative law judge, if the parties cannot agree, shall adjust all time requirements under the contested case procedure to conform with the 45-day requirement.\nThe commissioner shall make a decision within ten days of the receipt of the administrative law judge's report.\nIf all parties to the proceeding agree, any of the requirements of this section may be waived or modified.\nThe Department of Commerce, upon request by small businesses, shall assist small businesses in any specific class requesting continuation of coverage beyond the 180-day period, in coordinating the class and presenting the case in the contested hearing.\nFor purposes of this subdivision, \"small business\" means a business entity, including farming and other agricultural operations and its affiliates, that (1) is independently owned and operated; (2) is not dominant in its field; and (3) employs fewer than 50 full-time employees or has gross annual sales of less than $4,000,000.",
	"repealed": false
}