{
	"id": "518A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.51",
	"title": "518A.51 FEES FOR IV-D SERVICES.",
	"text": "(a) When a recipient of IV-D services is no longer receiving assistance under the state's title IV-A, IV-E foster care, or medical assistance programs, the public authority responsible for child support enforcement must notify the recipient, within five working days of the notification of ineligibility, that IV-D services will be continued unless the public authority is notified to the contrary by the recipient. The notice must include the implications of continuing to receive IV-D services, including the available services and fees, cost recovery fees, and distribution policies relating to fees.\n(b) In the case of an individual who has never received assistance under a state program funded under title IV-A of the Social Security Act and for whom the public authority has collected at least $550 of support, the public authority must impose an annual federal collections fee of $35 for each case in which services are furnished. This fee must be retained by the public authority from support collected on behalf of the individual, but not from the first $550 collected.\n(c) When the public authority provides full IV-D services to an obligee who has applied for those services, upon written notice to the obligee, the public authority must charge a cost recovery fee of two percent of the amount collected. This fee must be deducted from the amount of the child support and maintenance collected and not assigned under section 518A.81 before disbursement to the obligee. This fee does not apply to an obligee who:\n(1) is currently receiving assistance under the state's title IV-A, IV-E foster care, or medical assistance programs; or\n(2) has received assistance under the state's title IV-A or IV-E foster care programs, until the person has not received this assistance for 24 consecutive months.\n(d) When the public authority provides full IV-D services to an obligor who has applied for such services, upon written notice to the obligor, the public authority must charge a cost recovery fee of two percent of the monthly court-ordered child support and maintenance obligation. The fee may be collected through income withholding, as well as by any other enforcement remedy available to the public authority responsible for child support enforcement.\n(e) Fees assessed by state and federal tax agencies for collection of overdue support owed to or on behalf of a person not receiving public assistance must be imposed on the person for whom these services are provided. The public authority upon written notice to the obligee shall assess a fee of $25 to the person not receiving public assistance for each successful federal tax interception. The fee must be withheld prior to the release of the funds received from each interception and deposited in the general fund.\n(f) Federal collections fees collected under paragraph (b) and cost recovery fees collected under paragraphs (c) and (d) retained by the commissioner of human services shall be considered child support program income according to Code of Federal Regulations, title 45, section 304.50, and shall be deposited in the special revenue fund account established under paragraph (h). The commissioner of human services must elect to recover costs based on either actual or standardized costs.\n(g) The limitations of this section on the assessment of fees shall not apply to the extent inconsistent with the requirements of federal law for receiving funds for the programs under title IV-A and title IV-D of the Social Security Act, United States Code, title 42, sections 601 to 613 and United States Code, title 42, sections 651 to 662.\n(h) The commissioner of human services is authorized to establish a special revenue fund account to receive the federal collections fees collected under paragraph (b) and cost recovery fees collected under paragraphs (c) and (d).\n(i) The nonfederal share of the cost recovery fee revenue must be retained by the commissioner and distributed as follows:\n(1) one-half of the revenue must be transferred to the child support system special revenue account to support the state's administration of the child support enforcement program and its federally mandated automated system;\n(2) an additional portion of the revenue must be transferred to the child support system special revenue account for expenditures necessary to administer the fees; and\n(3) the remaining portion of the revenue must be distributed to the counties to aid the counties in funding their child support enforcement programs.\n(j) The nonfederal share of the federal collections fees must be distributed to the counties to aid them in funding their child support enforcement programs.\n(k) The commissioner of human services shall distribute quarterly any of the funds dedicated to the counties under paragraphs (i) and (j) using the methodology specified in section 518A.84, subdivision 11. The funds received by the counties must be reinvested in the child support enforcement program and the counties must not reduce the funding of their child support programs by the amount of the funding distributed.",
	"repealed": false
}