{
	"id": "484.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.50",
	"title": "484.50 SUMMONS; PLACE OF TRIAL; ST. LOUIS COUNTY.",
	"text": "A party wishing to have an appeal from an order of the public utilities commission, an election contest, a lien foreclosure, or a civil cause or proceeding of a kind commenced or appealed by a party in the court, tried in the city of Virginia shall, in the summons, notice of appeal in a matter, or other jurisdictional instrument issued, in addition to the usual provisions, print, stamp, or write thereon the words, \"to be tried at the city of Virginia,\" and a party wishing a matter commenced or appealed by a party in the court tried at the city of Hibbing shall, in the summons, notice of appeal in a matter, or other jurisdictional instrument issued, in addition to the usual provisions, print, stamp, or write thereon the words, \"to be tried at the city of Hibbing,\" and in a case where a summons, notice of appeal in a matter, or other jurisdictional instrument contains a specification, the case shall be tried at the city of Virginia, or the city of Hibbing, as the case may be, unless the defendant shall have the place of trial fixed in the manner specified in this section.\nIf the place of trial designated is not the proper place of trial, as specified in sections 484.44 to 484.52, the cause shall nevertheless be tried in a place, unless the defendant, in an answer in addition to the other allegations of defense, shall plead the location of the defendant's residence, and demand that the action be tried at the place of holding the court nearest the defendant's residence, as provided in this section; and in a case where the answer of the defendant pleads the place of residence and makes a demand of place of trial, the plaintiff, in reply, may admit or deny the allegations of residence, and if the allegations of residence are not expressly denied, the case shall be tried at the place demanded by the defendant, and if the allegations of residence are denied, the place of trial shall be determined by the court on motion.\nIf there are several defendants, residing at different places in a county, the trial shall be at the place in which the majority of the defendants unite in demanding, or if the numbers are equal, at the place nearest the residence of the majority of the defendants.\nThe venue of an action may be changed from one of these places to another, by order of the court, in the following cases:\n(1) upon written consent of the parties;\n(2) when it appears, on motion, that a party has been made a defendant for the purpose of preventing a change of venue as provided in this section;\n(3) when an impartial trial cannot be held in the place where the action is pending; or\n(4) when the convenience of witnesses and the ends of justice would be promoted by the change.\nApplication for a change under clause (2), (3), or (4), shall be made by motion which shall be returnable and heard at the place of commencement of the action.",
	"repealed": false
}