{
	"id": "169.872",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.872",
	"title": "169.872 RECEIPT OF CERTAIN OVERWEIGHT LOADS.",
	"text": "A person who weighs goods before or after unloading or a person who loads or unloads goods on the basis of liquid volume measure shall keep a written record of the origin, weight, and composition of each shipment, the date of loading or receipt, the name and address of the shipper, the total number of axles on the vehicle or combination of vehicles, and the registration number of the power unit or some other means of identification by which the shipment was transported. The record shall be retained for 14 days and shall be open to inspection and copying by a state law enforcement officer or motor transport representative, except state conservation officers, upon demand. No search warrant is required to inspect or copy the record. This subdivision does not apply to a person weighing goods who is not involved in the shipping, receiving, and transporting of those goods, or to a person weighing raw and unfinished farm products transported in a single-unit vehicle with not more than three axles or by a trailer towed by a farm tractor when the transportation is the first haul of the product.\nA civil penalty for excessive weight under section 169.871 may be imposed based on a record of a shipment under this section only if a state law enforcement officer or motor transportation representative: (1) has inspected and copied the record within 14 days of the date the shipment was received by the person keeping the record; and (2) has assessed the penalty within 90 days of the date the officer or representative inspected and copied the record.\nExcept for records relating to the loading and unloading of the first haul of unprocessed or raw farm products and the transportation of raw and unfinished forest products, a record kept and maintained as provided in subdivision 1 that shows that a vehicle has exceeded a gross weight limit imposed by this chapter is relevant evidence of a violation of this chapter. The foregoing provisions do not limit the introduction of other competent evidence bearing upon the question of whether or not there is a violation of the prescribed maximum weight limitation permitted by this chapter.\nA person who fails to keep, maintain, or open for inspection and copying, those documents as required in subdivision 1 is guilty of a misdemeanor. A person who does not accurately record the information required to be contained in those documents required in subdivision 1 is guilty of a misdemeanor.",
	"repealed": false
}