{
	"id": "58A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/58A.04",
	"title": "58A.04 STATE LICENSE AND REGISTRATION APPLICATION AND ISSUANCE.",
	"text": "An applicant for a license shall apply in a form as prescribed by the commissioner. The form must contain content as set forth by rule, instruction, or procedure of the commissioner and may be changed or updated as necessary by the commissioner in order to carry out the purposes of this chapter.\nIn order to fulfill the purposes of this chapter, the commissioner is authorized to establish relationships or contracts with the Nationwide Multistate Licensing System and Registry or other entities designated by the Nationwide Multistate Licensing System and Registry to collect and maintain records and process transaction fees or other fees related to licensees or other persons subject to this chapter.\nFor the purpose of participating in the Nationwide Multistate Licensing System and Registry, the commissioner is authorized to waive or modify, in whole or in part, by rule or order, any or all of the requirements of this chapter and to establish new requirements as reasonably necessary to participate in the Nationwide Multistate Licensing System and Registry.\nIn connection with an application for licensing as a mortgage loan originator, the applicant shall, at a minimum, furnish to the Nationwide Multistate Licensing System and Registry information concerning the applicant's identity, including:\n(1) fingerprints for submission to the Federal Bureau of Investigation, and a governmental agency or entity authorized to receive the information for a state, national, and international criminal history background check; and\n(2) personal history and experience in a form prescribed by the Nationwide Multistate Licensing System and Registry, including the submission of authorization for the Nationwide Multistate Licensing System and Registry and the commissioner to obtain:\n(i) an independent credit report obtained from a consumer reporting agency described in United States Code, title 15, section 1681a(p); and\n(ii) information related to administrative, civil, or criminal findings by a governmental jurisdiction.\nFor the purposes of this section and in order to reduce the points of contact which the Federal Bureau of Investigation may have to maintain for purposes of subdivision 4, clauses (1) and (2), the commissioner may use the Nationwide Multistate Licensing System and Registry as a channeling agent for requesting information from and distributing information to the Department of Justice or any governmental agency.\nFor the purposes of this section and in order to reduce the points of contact which the commissioner may have to maintain for purposes of subdivision 4, clause (2), the commissioner may use the Nationwide Multistate Licensing System and Registry as a channeling agent for requesting and distributing information to and from any source so directed by the commissioner.",
	"repealed": false
}