{
	"id": "274.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/274.135",
	"title": "274.135 COUNTY BOARDS; APPEALS AND EQUALIZATION COURSE AND MEETING REQUIREMENTS.",
	"text": "By no later than January 1, 2009, the commissioner of revenue must develop a handbook detailing procedures, responsibilities, and requirements for county boards of appeal and equalization. The handbook must include, but need not be limited to, the role of the county board in the assessment process, the legal and policy reasons for fair and impartial appeal and equalization hearings, county board meeting procedures that foster fair and impartial assessment reviews and other best practices recommendations, quorum requirements for county boards, and explanations of alternate methods of appeal.\nBeginning in 2009, and each year thereafter, there must be at least one member at each meeting of a county board of appeal and equalization who has attended an appeals and equalization course developed or approved by the commissioner within the last four years, as certified by the commissioner. The course may be offered in conjunction with a meeting of the Minnesota Association of Assessment Officers. The course content must include, but need not be limited to, a review of the handbook developed by the commissioner under subdivision 1.\n(a) Any county that conducts county boards of appeal and equalization meetings must comply with the training requirements of subdivision 2 by February 1, by having at least one member who has attended an appeals and equalization course described in subdivision 2 within the last four years. A county that does not comply with these requirements is deemed to have transferred its board of appeal and equalization powers to the special board of equalization appointed pursuant to section 274.13, subdivision 2, for a minimum of two assessment years, beginning with the current year's assessment and continuing thereafter unless the powers are reinstated under paragraph (c). A county that does not comply with the requirements of subdivision 2 and has not appointed a special board of equalization shall appoint a special board of equalization before the following year's assessment.\n(b) The county shall notify the taxpayers when the board of appeal and equalization for a county has been transferred to the special board of equalization under this subdivision and, prior to the meeting time of the special board of equalization, the county shall make available to those taxpayers a procedure for a review of the assessments, including, but not limited to, open book meetings. This alternate review process must take place in April and May.\n(c) A county board whose powers are transferred to the special board of equalization under this subdivision may be reinstated by resolution of the county board and upon proof of compliance with the requirements of subdivision 2. The resolution and proofs must be provided to the commissioner by February 1 in order to be effective for the current year's assessment.\n(d) If a person who was entitled to appeal to the county board of appeal and equalization or to the county special board of equalization is not able to do so in a particular year because the county board or special board did not meet the quorum and training requirements in this section and section 274.13, or because the special board was not appointed, that person may instead appeal to the commissioner of revenue, provided that the appeal is received by the commissioner prior to August 1. The appeal is not subject to either chapter 14 or section 270C.92. The commissioner must issue an appropriate order to the county assessor in response to each timely appeal, either upholding or changing the valuation or classification of the property. Prior to October 1 of each year, the commissioner must charge and bill the county where the property is located $500 for each tax parcel covered by an order issued under this paragraph in that year. Amounts received by the commissioner under this paragraph must be deposited in the state's general fund. If payment of a billed amount is not received by the commissioner before December 1 of the year when billed, the commissioner must deduct that unpaid amount from any state aid the commissioner would otherwise pay to the county under chapter 477A in the next year. Late payments may either be returned to the county uncashed and undeposited or may be accepted. If a late payment is accepted, the state aid paid to the county under chapter 477A must be adjusted within 12 months to eliminate any reduction that occurred because the payment was late. Amounts needed to make these adjustments are included in the appropriation under section 477A.03, subdivision 2.",
	"repealed": false
}