{
	"id": "115A.1415",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1415",
	"title": "115A.1415 ARCHITECTURAL PAINT; PRODUCT STEWARDSHIP PROGRAM; STEWARDSHIP PLAN.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"annual operating expenses\" means the total amount of a producer's or stewardship organization's expenses in a calendar year for developing a stewardship plan, operating and administering the program in accordance with the stewardship plan, and meeting the requirements of this section, determined at the time the annual report required under subdivision 12 is submitted;\n(2) \"architectural paint\" means interior and exterior architectural coatings sold in containers of five gallons or less. Architectural paint does not include industrial coatings, original equipment coatings, or specialty coatings;\n(3) \"brand\" means a name, symbol, word, or mark that identifies architectural paint, rather than its components, and attributes the paint to the owner or licensee of the brand as the producer;\n(4) \"discarded paint\" means architectural paint that is no longer used for its manufactured purpose;\n(5) \"producer\" means a person that:\n(i) has legal ownership of the brand, brand name, or cobrand of architectural paint sold in the state;\n(ii) imports architectural paint branded by a producer that meets item (i) when the producer has no physical presence in the United States;\n(iii) if items (i) and (ii) do not apply, makes unbranded architectural paint that is sold in the state; or\n(iv) sells architectural paint at wholesale or retail, does not have legal ownership of the brand, and elects to fulfill the responsibilities of the producer for the architectural paint by certifying that election in writing to the commissioner;\n(6) \"recycling\" means the process of collecting and preparing recyclable materials and reusing the materials in their original form or using them in manufacturing processes that do not cause the destruction of recyclable materials in a manner that precludes further use;\n(7) \"retailer\" means any person who offers architectural paint for sale at retail in the state;\n(8) \"reuse\" means donating or selling collected architectural paint back into the market for its original intended use, when the architectural paint retains its original purpose and performance characteristics;\n(9) \"sale\" or \"sell\" means transfer of title of architectural paint for consideration, including a remote sale conducted through a sales outlet, catalog, website, or similar electronic means. Sale or sell includes a lease through which architectural paint is provided to a consumer by a producer, wholesaler, or retailer;\n(10) \"stewardship assessment\" means the amount added to the purchase price of architectural paint sold in the state to implement a product stewardship program according to an approved stewardship plan;\n(11) \"stewardship organization\" means an organization appointed by one or more producers to act as an agent on behalf of the producer to design, submit, and administer a product stewardship program under this section; and\n(12) \"stewardship plan\" means a detailed plan describing the manner in which a product stewardship program under subdivision 2 will be implemented.\nFor architectural paint sold in the state, producers must, individually or through a stewardship organization, implement and finance a statewide product stewardship program that manages the architectural paint by reducing the paint's waste generation, promoting its reuse and recycling, and providing for negotiation and execution of agreements to collect, transport, and process the architectural paint for end-of-life recycling and reuse.\n(a) No producer, wholesaler, or retailer may sell or offer for sale in the state architectural paint unless the paint's producer participates in an approved stewardship plan, either individually or through a stewardship organization.\n(b) Each producer must operate a product stewardship program approved by the commissioner or enter into an agreement with a stewardship organization to operate, on the producer's behalf, a product stewardship program approved by the commissioner.\n(a) Before offering architectural paint for sale in the state, a producer must submit a stewardship plan to the commissioner and receive approval of the plan or must submit documentation to the commissioner that demonstrates the producer has entered into an agreement with a stewardship organization to be an active participant in an approved product stewardship program as described in subdivision 2. A stewardship plan must include all elements required under subdivision 5.\n(b) A proposed amendment to the plan, if determined necessary by the commissioner, must be submitted to the commissioner for review and approval or rejection every five years.\n(c) The entities responsible for each stewardship plan must notify the commissioner within 30 days of any significant proposed changes to the plan or its implementation. Within 30 days of the notification, a written proposed plan amendment must be submitted to the commissioner for review and approval or rejection.\nA stewardship plan must contain:\n(1) certification that the product stewardship program will accept all discarded paint regardless of which producer produced the architectural paint and its individual components;\n(2) contact information for the individual and the entity submitting the stewardship plan, a list of all producers participating in the product stewardship program, and the brands covered by the product stewardship program;\n(3) a description of the methods by which the discarded paint will be collected in all areas in the state without relying on end-of-life fees, including an explanation of how the collection system will be convenient and adequate to serve the needs of small businesses and residents in both urban and rural areas on an ongoing basis and a discussion of how the existing household hazardous waste infrastructure will be considered when selecting collection sites;\n(4) a description of how the adequacy of the collection program will be monitored and maintained;\n(5) the names and locations of collectors, transporters, and recyclers that will manage discarded paint;\n(6) a description of how the discarded paint and the paint's components will be safely and securely transported, tracked, and handled from collection through final recycling and processing;\n(7) a description of the method that will be used to reuse, deconstruct, or recycle the discarded paint to ensure that the paint's components, to the extent feasible, are transformed or remanufactured into finished products for use;\n(8) a description of the promotion and outreach activities that will be used to encourage participation in the collection and recycling programs and how the activities' effectiveness will be evaluated and the program modified, if necessary;\n(9) the proposed stewardship assessment established according to subdivision 5a;\n(10) evidence of adequate insurance and financial assurance that may be required for collection, handling, and disposal operations;\n(11) five-year performance goals, including an estimate of the percentage of discarded paint that will be collected, reused, and recycled during each of the first five years of the stewardship plan. The performance goals must include a specific goal for the amount of discarded paint that will be collected and recycled and reused during each year of the plan. The performance goals must be based on:\n(i) the most recent collection data available for the state;\n(ii) the estimated amount of architectural paint disposed of annually;\n(iii) the weight of the architectural paint that is expected to be available for collection annually; and\n(iv) actual collection data from other existing stewardship programs.\nThe stewardship plan must state the methodology used to determine these goals; and\n(12) a discussion of the status of end markets for collected architectural paint and what, if any, additional end markets are needed to improve the functioning of the program.\n(a) The producer or stewardship organization must propose a uniform stewardship assessment for any architectural paint sold in the state that covers but does not exceed the costs of developing the stewardship plan, operating and administering the program in accordance with the stewardship plan and the requirements of this section, and maintaining a financial reserve.\n(b) The producer or stewardship organization must retain an independent auditor to review the proposed stewardship assessment to ensure that the assessment meets the requirements of this section. The independent auditor must recommend an amount for the stewardship assessment.\n(c) A stewardship organization's or producer's product stewardship program must not maintain a financial reserve in excess of 75 percent of its annual operating expenses.\n(d) If the financial reserve exceeds 75 percent of the producer's or stewardship organization's annual operating expenses, the producer or stewardship organization must submit a proposed plan amendment according to subdivision 4, paragraph (c), to comply with this subdivision.\n(e) A producer or stewardship organization may submit a written request to the commissioner for an extension of the time to comply with paragraphs (c) and (d). The commissioner must review and approve or reject the request. If the commissioner approves a request, the commissioner must determine the length of the extension, which must not exceed two consecutive years. The request must demonstrate that the financial reserve is projected to fall below 75 percent of the producer's or stewardship organization's annual operating expenses without a plan amendment within two years of the request.\n(f) If the financial reserve falls below 60 percent of the producer's or stewardship organization's annual operating expenses, the producer or stewardship organization may submit a proposed plan amendment according to subdivision 4, paragraph (c), to comply with this subdivision.\n(g) The commissioner must review and approve or reject the stewardship assessment according to subdivision 7.\n(h) A producer or stewardship organization may not use any money collected through a stewardship assessment to pay for litigation against the state related to this section or to pay penalties imposed according to section 115.071 or 116.072.\nEach stewardship organization or individual producer submitting a stewardship plan or plan amendment must consult with stakeholders including retailers, contractors, collectors, recyclers, local government, and customers during the development of the plan or plan amendment.\n(a) Within 90 days after receiving a proposed stewardship plan, the commissioner must determine whether the plan complies with this section. If the commissioner approves a plan, the commissioner must notify the applicant of the plan approval in writing. If the commissioner rejects a plan, the commissioner must notify the applicant in writing of the reasons for rejecting the plan.\n(b) An applicant whose plan is rejected by the commissioner must submit a revised stewardship plan to the commissioner within 60 days after receiving notice of rejection.\n(c) Any proposed amendment to a stewardship plan must be reviewed and approved or rejected by the commissioner in writing according to this subdivision.\nAll proposed stewardship plans and amendments and approved stewardship plans and amendments must be placed on the agency's website for at least 30 days and made available at the agency's headquarters for public review and comment.\nA producer or stewardship organization that organizes collection, transport, and processing of architectural paint under this section is immune from liability for the conduct under state laws relating to antitrust, restraint of trade, unfair trade practices, and other regulation of trade or commerce only to the extent that the conduct is necessary to plan and implement the producer's or organization's chosen organized collection or recycling system.\n(a) On and after the date of implementation of a product stewardship program according to this section, a producer of architectural paint must add the stewardship assessment, as established under subdivision 5a, to the cost of architectural paint sold to retailers and distributors in the state by the producer.\n(b) Producers of architectural paint or the stewardship organization must provide consumers with educational materials regarding the stewardship assessment and product stewardship program. The materials must include, but are not limited to, information regarding available end-of-life management options for architectural paint offered through the product stewardship program and information that notifies consumers that a charge for the operation of the product stewardship program is included in the purchase price of architectural paint sold in the state.\n(a) No architectural paint may be sold in the state unless the paint's producer is participating in an approved stewardship plan.\n(b) On and after the implementation date of a product stewardship program according to this section, each retailer or distributor, as applicable, must ensure that the full amount of the stewardship assessment added to the cost of architectural paint by producers under subdivision 10 is included in the purchase price of all architectural paint sold in the state.\n(c) Any retailer may participate, on a voluntary basis, as a designated collection point pursuant to a product stewardship program under this section and in accordance with applicable law.\n(d) No retailer or distributor shall be found to be in violation of this subdivision if, on the date the architectural paint was ordered from the producer or its agent, the producer was listed as compliant on the agency's website according to subdivision 14.\nBy April 1 each year, producers of architectural paint sold in the state must individually or through a stewardship organization submit an annual report to the commissioner describing the product stewardship program for the preceding calendar year. At a minimum, the report must contain:\n(1) a description of the methods used to collect, transport, and process architectural paint in all regions of the state;\n(2) the weight of all architectural paint collected in all regions of the state and a comparison to the performance goals and recycling rates established in the stewardship plan;\n(3) the amount of unwanted architectural paint collected in the state by method of disposition, including reuse, recycling, and other methods of processing;\n(4) samples of educational materials provided to consumers and an evaluation of the effectiveness of the materials and the methods used to disseminate the materials; and\n(5) an independent financial audit.\nTrade secret and sales information, as defined under section 13.37, submitted to the commissioner under this section are private or nonpublic data under section 13.37.\nThe commissioner must provide, on the agency's website, a list of all compliant producers and brands participating in stewardship plans that the commissioner has approved and a list of all producers and brands the commissioner has identified as noncompliant with this section.\n(a) A city, county, or other public agency may choose to participate voluntarily in a product stewardship program.\n(b) Cities, counties, and other public agencies are encouraged to work with producers and stewardship organizations to assist in meeting product stewardship program reuse and recycling obligations, by providing education and outreach or using other strategies.\n(c) A city, county, or other public agency that participates in a product stewardship program must report for the first year of the program to the commissioner using the reporting form provided by the commissioner on the cost savings as a result of participation and must describe how the savings were used.\n(a) The stewardship organization or individual producer submitting a stewardship plan must pay an annual administrative fee to the commissioner. The commissioner may establish a variable fee based on relevant factors, including but not limited to the portion of architectural paint sold in the state by members of the organization compared to the total amount of architectural paint sold in the state by all organizations submitting a stewardship plan.\n(b) Before July 1 each year, the commissioner must identify the costs the agency incurs under this section. The commissioner must set the fee at an amount that, when paid by every stewardship organization or individual producer that submits a stewardship plan, is adequate to reimburse the agency's full costs of administering this section. The total amount of annual fees collected under this subdivision must not exceed the amount necessary to reimburse costs incurred by the agency to administer this section.\n(c) A stewardship organization or individual producer subject to this subdivision must pay the commissioner's administrative fee under paragraph (a) on or before July 1 each year. Each year after the initial payment, the annual administrative fee may not exceed five percent of the aggregate stewardship assessment added to the cost of all architectural paint sold by producers in the state for the preceding calendar year.\n(d) All fees received under this section must be deposited in the state treasury and credited to a product stewardship account in the special revenue fund. The amount collected under this section is annually appropriated to the commissioner to implement and enforce this section.\nUpon request of the commissioner for purposes of determining compliance with this section, a person must furnish to the commissioner any information that the person has or may reasonably obtain.",
	"repealed": false
}