{
	"id": "609.322",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.322",
	"title": "609.322 SOLICITATION, INDUCEMENT, AND PROMOTION OF PROSTITUTION; SEX TRAFFICKING.",
	"text": "(a) Whoever, while acting other than as a prostitute or patron, intentionally does any of the following may be sentenced to imprisonment for not more than 25 years or to payment of a fine of not more than $50,000, or both:\n(1) solicits or induces an individual under the age of 18 years to practice prostitution;\n(2) promotes the prostitution of an individual under the age of 18 years;\n(3) receives profit, knowing or having reason to know that it is derived from the prostitution, or the promotion of the prostitution, of an individual under the age of 18 years; or\n(4) engages in the sex trafficking of an individual under the age of 18 years.\n(b) Whoever violates paragraph (a) or subdivision 1a may be sentenced to imprisonment for not more than 30 years or to payment of a fine of not more than $60,000, or both, if one or more of the following aggravating factors are present:\n(1) the offender has committed a prior qualified human trafficking-related offense;\n(2) the offense involved a sex trafficking victim who suffered bodily harm during the commission of the offense;\n(3) the time period that a sex trafficking victim was held in debt bondage or forced or coerced labor or services exceeded 180 days; or\n(4) the offense involved more than one sex trafficking victim.\nWhoever, while acting other than as a prostitute or patron, intentionally does any of the following may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $40,000, or both:\n(1) solicits or induces an individual to practice prostitution;\n(2) promotes the prostitution of an individual;\n(3) receives profit, knowing or having reason to know that it is derived from the prostitution, or the promotion of the prostitution, of an individual; or\n(4) engages in the sex trafficking of an individual.\nSubdivisions 1, paragraph (a), clause (3), and 1a, clause (3), do not apply to:\n(1) a minor who is dependent on an individual acting as a prostitute and who may have benefited from or been supported by the individual's earnings derived from prostitution; or\n(2) a parent over the age of 55 who is dependent on an individual acting as a prostitute, who may have benefited from or been supported by the individual's earnings derived from prostitution, and who did not know that the earnings were derived from prostitution; or\n(3) the sale of goods or services to a prostitute in the ordinary course of a lawful business.\nActs by the defendant in violation of any one or more of the provisions in this section within any six-month period may be aggregated and the defendant charged accordingly in applying the provisions of this section; provided that when two or more offenses are committed by the same person in two or more counties, the accused may be prosecuted in any county in which one of the offenses was committed for all of the offenses aggregated under this subdivision.\n[Repealed, 1998 c 367 art 2 s 33]\n[Repealed, 1998 c 367 art 2 s 33]",
	"repealed": false
}