{
	"id": "145.9576",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9576",
	"title": "145.9576 MODEL JAIL PRACTICES.",
	"text": "(a) The commissioner of health may make grants to counties and groups of counties to implement model jail practices and to county governments, Tribal governments, or nonprofit organizations in corresponding geographic areas to build partnerships with county jails to support children of incarcerated parents and their caregivers.\n(b) \"Model jail practices\" means a set of practices that correctional administrators can implement to remove barriers that may prevent children from cultivating or maintaining relationships with their incarcerated parents during and immediately after incarceration without compromising the safety or security of the correctional facility.\n(a) The commissioner of health may award grants to eligible county jails to implement model jail practices and separate grants to county governments, Tribal governments, or nonprofit organizations in corresponding geographic areas to build partnerships with county jails to support children of incarcerated parents and their caregivers.\n(b) Grantee activities include but are not limited to:\n(1) parenting classes or groups;\n(2) family-centered intake and assessment of inmate programs;\n(3) family notification, information, and communication strategies;\n(4) correctional staff training;\n(5) policies and practices for family visits; and\n(6) family-focused reentry planning.\n(c) Grant recipients must report their activities to the commissioner in a format and at a time specified by the commissioner.\n(a) The commissioner may provide content expertise, training to grant recipients, and advice on evidence-based strategies, including evidence-based training to support incarcerated parents.\n(b) For the purposes of carrying out the grant program under subdivision 2, including for administrative purposes, the commissioner may award contracts to appropriate entities to assist in training and provide technical assistance to grantees.\n(c) Contracts awarded under paragraph (b) may be used to provide technical assistance and training in the areas of:\n(1) evidence-based training for incarcerated parents;\n(2) partnership building and community engagement;\n(3) evaluation of process and outcomes of model jail practices; and\n(4) expert guidance on reducing the harm caused to children of incarcerated parents and application of model jail practices.",
	"repealed": false
}