{
	"id": "163.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/163.16",
	"title": "163.16 IMPASSABLE ROAD.",
	"text": "When a written complaint, signed by five or more landowners of any town is presented to the county board stating that a described town road in or on the line of the town has not been opened and constructed or is not properly maintained, and because of such neglect is not reasonably passable, the county board by resolution, shall fix a time and place for hearing the complaint. The county auditor shall mail a copy of the complaint, together with notice of the time and place of hearing on the complaint, to the town clerk. All persons signing the complaint shall also be notified of the time and place of the hearing by the county auditor.\nAt the designated time and place the county board shall consider the complaint and hear and consider such testimony as may be offered by the officers of the town and the complainants relative to the matters set forth in the complaint. The chair of the county board, or the presiding officer thereof, may administer oaths to witnesses and require them to testify under oath. The county board may drive over the road and make such further investigations as it deems necessary.\nIf upon the hearing and investigation the county board shall be of the opinion that the complaint is well founded, it shall by resolution direct the town board to do such work or to make such improvements as it shall deem necessary to put the road in a passable condition. The resolution shall specify generally the work which is deemed necessary. The county auditor shall cause a copy of the resolution to be mailed to the clerk of the town. If the town for a period of 30 days after the mailing of the notice, fails or neglects to do the work or make the improvements set forth in the resolution, the county board may cause the work to be done or the improvements made, and the cost thereof shall be paid from the county road and bridge fund; provided that no such work shall be performed by the county when the cost thereof exceeds $3,000 per mile.\nWhen any county board shall have performed any work or made any improvement on any such road, it shall cause to be prepared in duplicate an itemized statement of the cost of the work or improvement. The statement shall be filed with the county auditor and a copy thereof shall be mailed by the county auditor to the clerk of the town. The town clerk shall forthwith notify the several members of the town board that such a statement has been filed and that a meeting of the town board to act thereon will be held at a time to be specified in the notice, not later than ten days after the receipt of the notice from the county auditor. The town board shall meet at the time and place specified in the notice so given by the clerk and levy a special tax upon all the taxable property in the town in an amount sufficient to pay the amount expended by the county in performing the work or making the improvement. The tax so levied shall be certified to the county auditor on or before October 15 next succeeding, and the county auditor shall extend the same with other town taxes upon the tax list of the town. If the town board shall for any reason fail to act as herein provided, the county auditor is hereby authorized and directed to levy the tax and extend the same with other town taxes upon the tax list of the town. The tax shall be collected and the payment thereof enforced in the same manner and subject to the same penalties and interest as other town taxes. When collected the tax shall be paid into the county treasury and credited to the county road and bridge fund.",
	"repealed": false
}