{
	"id": "116J.881",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.881",
	"title": "116J.881 SMALL BUSINESS LOAN GUARANTEE PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Borrower\" means a small business receiving an eligible loan under this section.\n(c) \"Commissioner\" means the commissioner of employment and economic development.\n(d) \"Eligible loan\" means a loan to a small business to be used for business purposes exclusively in Minnesota, including: machinery or equipment purchases, maintenance, or repair; expenses related to moving into or within Minnesota; and working capital when the working capital is secured by fixed assets when possible.\n(e) \"Loan guarantee\" means a guarantee of 80 percent of the loan amount provided by a QED lender. The guaranteed portion of the loan must not exceed $200,000 and may be subordinate to other loans made by lenders in the overall financing package.\n(f) \"Loan guarantee trust fund\" means a dedicated fund established under this section for the purpose of compensation for defaulted loan guarantees and for program administration.\n(g) \"Peacetime public health emergency\" means any peacetime emergency declared by the governor in an executive order that is related to the infectious disease known as COVID-19.\n(h) \"Qualified economic development lender\" or \"QED lender\" means a bank or other commercial lender, a public entity, or a private nonprofit economic development organization with not less than three years of active lending experience that provides financing to small businesses.\n(i) \"Small business\" means a business employing no more than the equivalent of 250 full-time persons in Minnesota.\n(j) \"Subordinated loan\" means a loan secured by a lien that is lower in priority than one or more specified other liens.\nA small business loan guarantee program to support the origination of small business loans that are expected to be made to Minnesota businesses by a QED lender, within the 12 months after a declaration of a peacetime public health emergency and not otherwise financially supported by a public entity, is created in the Department of Employment and Economic Development. The loan guarantee shall apply only to the portion of the loan that was made by the QED lender.\nLoan guarantees under this section for loans by QED lenders shall provide that:\n(1) principal and interest payments made by the borrower under the terms of the loan are to reduce the guaranteed and nonguaranteed portion of the loan on a proportionate basis. The nonguaranteed portion shall not receive preferential treatment over the guaranteed portion;\n(2) the QED lender shall not accelerate repayment of the loan or exercise other remedies if the borrower defaults, unless:\n(i) the borrower fails to make a required payment of principal or interest within 60 days of the due date;\n(ii) the commissioner consents in writing; or\n(iii) the loan guarantee agreement provides for accelerated repayment or other remedies.\nIn the event of a default, the QED lender may not make a demand for payment pursuant to the guarantee unless the commissioner agrees in writing that the default has materially affected the rights or security of the parties;\n(3) the QED lender has timely prepared and delivered to the commissioner, annually by the date specified in the loan guarantee, an audited or reviewed financial statement for the loan, prepared by a certified public accountant according to generally accepted accounting principles, if available, and documentation that the borrower used the loan proceeds solely for purposes of its Minnesota operations;\n(4) the commissioner has access to the loan documents prior to approval of the state credit enhancement;\n(5) the QED lender maintains adequate records and documents concerning the loan so that the commissioner may determine the borrower's financial condition and compliance with program requirements; and\n(6) orderly liquidation of collateral securing the loan is provided for in the event of default, with an option on the part of the commissioner to acquire the QED lender's interest in the assets pursuant to the loan guarantee.\nA loan guarantee trust fund account in the special revenue fund is created in the state treasury to pay for defaulted loan guarantees. The commissioner shall administer this fund and provide annual reports concerning the performance of the fund to the chairs of the standing committees of the house of representatives and senate having jurisdiction over economic development issues.\nAt no time shall total outstanding loan guarantees exceed five times the amount on deposit in the loan guarantee trust fund.\nParticipating QED lenders shall pay a fee to the fund of 0.25 percent of the principal amount of each guaranteed loan upon approval of each loan guarantee. The guarantee fee, along with any interest earnings from the trust fund, shall be used only for the administration of the small business loan guarantee program and as additional loan loss reserves.\nThe commissioner shall prepare a form for QED lenders to use in applying for loan guarantees under this section. The form shall include the following information:\n(1) the name and contact information for the QED lender, including the name and title of a contact person;\n(2) the names of the financial institutions, including the names and titles of contact persons, that are participating in the total financing being provided to the small business borrower, along with the dollar amount of the loan provided by the financial institution;\n(3) the percentage and dollar amount of the subordinated debt loan provided to the Minnesota small business by the QED lender;\n(4) the loan guarantee amount that is requested from the program; and\n(5) other information as requested by the commissioner.\nSubject to the availability of funds under subdivision 4, the commissioner shall publish a notice regarding the opportunity for QED lenders to originate loans. The commissioner shall decide whether to provide a loan guarantee for each loan based on:\n(1) the completeness of the loan guarantee application;\n(2) the availability of funds in the loan guarantee trust fund; and\n(3) execution of agreements that satisfy requirements established in subdivision 3.\nBy December 31, 2020, the commissioner shall report to the legislative committees with jurisdiction over economic development policy and finance on the loan guarantees provided under this section.",
	"repealed": false
}