{
	"id": "129D.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/129D.19",
	"title": "129D.19 GRANTS TO PUBLIC EDUCATIONAL RADIO STATIONS.",
	"text": "This section applies only to the Association of Minnesota Public Educational Radio Stations and the noncommercial radio stations that are members of the Association of Minnesota Public Educational Radio Stations.\nMoney appropriated from the Minnesota arts and cultural heritage fund may be designated to make grants to the Association of Minnesota Public Educational Radio Stations and its member stations and noncommercial radio stations, as defined in section 129D.14, subdivision 2. Grants received under this section must be used to create, produce, acquire, or distribute programs that educate, enhance, or promote local, regional, or statewide items of artistic, cultural, or historic significance. Grant funds may be used to cover any expenses associated with the creation, production, acquisition, or distribution of noncommercial radio programs through broadcast.\nMoney appropriated under this section must be used by the commissioner of administration to make grants based upon the recommendations of the Association of Minnesota Public Educational Radio Stations.\n(a) A noncommercial radio station receiving funds appropriated under this section must:\n(1) make programs produced with these funds available for broadcast to all other noncommercial radio stations eligible to receive grants under this section;\n(2) offer free public performance rights for public educational institutions;\n(3) archive programs produced with these funds and make the programs available for future use through encore broadcast or other distribution, including online; and\n(4) ensure that underwriting credit is given to the Minnesota arts and cultural heritage fund.\n(b) Programs produced in partnership with other mission-centered nonprofit organizations may be used by the partnering organization for their own educational or promotional purposes.\nA noncommercial radio station receiving funds appropriated under this section must report annually by January 15 to the commissioner, the Legislative Coordinating Commission, and the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over arts and cultural heritage policy and finance regarding how the previous year's grant funds were expended. In addition to all information required of each recipient of money from the arts and cultural heritage fund under section 3.303, subdivision 10, the report must contain specific information for each program produced and broadcast, including the cost of production, the number of stations broadcasting the program, estimated number of listeners, and other related measures. If the programs produced include educational material, the noncommercial radio station must report on these efforts.",
	"repealed": false
}