{
	"id": "145C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/145C.07",
	"title": "145C.07 AUTHORITY AND DUTIES OF HEALTH CARE AGENT.",
	"text": "The health care agent has authority to make any particular health care decision only if the principal lacks decision-making capacity, in the determination of the attending physician, advanced practice registered nurse, or physician assistant, to make or communicate that health care decision; or if other conditions for effectiveness otherwise specified by the principal have been met. The physician, advanced practice registered nurse, physician assistant, or other health care provider shall continue to obtain the principal's informed consent to all health care decisions for which the principal has decision-making capacity, unless other conditions for effectiveness otherwise specified by the principal have been met. An alternate health care agent has authority to act if the primary health care agent is not reasonably available to act.\nUnless the principal has otherwise specified in the health care directive, the appointment of the health care agent in a health care directive is considered a nomination of a guardian for purposes of sections 524.5-101 to 524.5-502.\nIn exercising authority under a health care directive, a health care agent has a duty to act in good faith. A health care agent or any alternate health care agent has a personal obligation to the principal to make health care decisions authorized by the health care power of attorney, but this obligation does not constitute a legal duty to act.\nIn the event of inconsistency between the appointment of a proxy under chapter 145B or section 253B.03, subdivision 6d, or of a health care agent under this chapter, the most recent appointment takes precedence. In the event of other inconsistencies among documents executed under this chapter, under chapter 145B, or under sections 253B.03, subdivision 6d, or 524.5-101 to 524.5-502, or other legally sufficient documents, the provisions of the most recently executed document take precedence only to the extent of the inconsistency.\nA health care agent may visit the principal when the principal is a patient in a health care facility regardless of whether the principal retains decision-making capacity, unless:\n(1) the principal has otherwise specified in the health care directive;\n(2) a principal who retains decision-making capacity indicates otherwise; or\n(3) a health care provider reasonably determines that the principal must be isolated from all visitors or that the presence of the health care agent would endanger the health or safety of the principal, other patients, or the facility in which the care is being provided.",
	"repealed": false
}