{
	"id": "27.138",
	"url": "https://www.revisor.mn.gov/statutes/cite/27.138",
	"title": "27.138 FARM PRODUCTS DEALERS' TRUST.",
	"text": "(a) A farm products dealer's perishable farm products and manufactured farm products and proceeds related to the sale of a farm products dealer's perishable farm products or manufactured farm products are held in trust for the benefit of unpaid sellers.\n(b) The trust assets are to be maintained as a nonsegregated floating trust. Commingling of the trust assets is contemplated.\n(c) The farm products dealer must maintain the trust assets in a manner that makes the trust assets freely available to satisfy the amounts owed to unpaid sellers and may not divert trust assets in a manner that impairs the ability of unpaid sellers to recover amounts due.\n(d) A farm products dealer must maintain the trust assets in trust until payment has been made in full to unpaid sellers. Payment is not made if a seller receives a payment instrument that is dishonored.\n(e) A farm products dealer holds trust assets in trust for the seller, except that the farm products dealer may transfer title to trust assets if the proceeds of the transfer are maintained as trust assets. Until a seller is paid, a farm products dealer must not transfer title to trust assets:\n(1) in a transaction made to another farm products dealer;\n(2) in a transaction intended to impair the ability of unpaid sellers to recover amounts due; or\n(3) for which the value is inadequate to satisfy filed beneficiaries notices.\n(a) An unpaid seller may recover trust assets for the net amount unpaid after the due date after allowing deductions of contemplated expenses or advances made in connection with the transaction. An amount is considered unpaid if a seller receives a payment instrument that is dishonored.\n(b) An unpaid seller may recover trust assets after filing a beneficiaries notice with the farm products dealer to whom the perishable farm products were transferred and the commissioner, and after filing in the central filing system under section 336.9-501 as if the trust were a security interest in the trust assets by 40 days after the due date for the payment to the seller or 40 days after a payment instrument to the seller for the perishable farm products is dishonored, whichever is later.\n(a) A beneficiaries notice must be in writing and in a form prescribed by the commissioner.\n(b) The beneficiaries notice must contain:\n(1) the name and address of the seller;\n(2) the name and address of the farm products dealer maintaining the trust assets;\n(3) the perishable farm products, amount of product, amount to be paid the seller, and the due date of transactions that are unpaid or, if appropriate, the date a payment instrument was dishonored; and\n(4) a description of the trust assets.\n(c) The filing officer must enter on the initial financing statement filed pursuant to this section the time of day and date of filing. The filing officer must accept filings, amendments, and terminations of an initial financing statement filed pursuant to this section and charge the same filing fees as provided in section 336.9-525. An initial financing statement filed pursuant to this section is void and may be removed from the filing system 18 months after the date of filing. The beneficiaries notice may be physically destroyed 30 months after the date of filing.\n(a) The unpaid seller's interest in trust assets is paramount to all other liens, security interests, and encumbrances in the trust assets. An unpaid seller who recovers trust assets recovers them free of any liens, security interests, or encumbrances.\n(b) If the trust assets are inadequate to pay unpaid sellers the amount due, the unpaid sellers shall share proportionately in the trust assets.\nAn action to recover trust assets may be brought in district court in a county where trust assets are located after the beneficiaries notice is filed. The beneficiaries notice may be amended, except the amount due, by leave of the court in furtherance of justice. An action to recover trust assets is barred if it is not brought by 18 months after the date the beneficiaries notice is filed.\nA seller must terminate a beneficiaries notice by ten days after the amount due for the farm products dealer is paid. The commissioner may terminate a beneficiaries notice upon request and demonstration by the farm products dealer that the amounts due under the beneficiaries notice have been paid.",
	"repealed": false
}