{
	"id": "161.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.241",
	"title": "161.241 RELOCATION OF RAILROAD TRACKS, ACQUISITION OF LAND.",
	"text": "Whenever the construction, reconstruction, or improvement of a trunk highway will require the acquisition by the state of lands or interests in lands owned by a railroad company, and will require the railroad company to relocate its tracks in order to provide right-of-way for the trunk highway, the commissioner of transportation may either reimburse the railroad company for replacement lands including all reasonable costs directly related to acquiring the replacement lands, necessary for relocation of its tracks or may acquire, by purchase, gift, or eminent domain proceedings, the lands or interests in lands necessary for the relocation of such tracks. Such acquisition is deemed to be for a trunk highway purpose. The commissioner and the railroad company shall mutually agree whether the replacement lands will be provided by the commissioner or acquired by the railroad company.\nThe lands to be acquired from the railroad company, and the lands necessary for the relocation of the railroad tracks to be acquired by the state, shall be described in a voluntary agreement between the railroad company and the commissioner. Such agreement shall set forth the consideration to be paid for the lands involved. The consideration may be an even exchange of land if the market value is equal, or there may be money payment or services to be rendered by one party or the other to the agreement in addition to the exchange of land, depending on the relative market values of the lands involved. Any money paid to the state shall be credited to the trunk highway fund.\nThe commissioner shall convey to the railroad company, by quitclaim deed, lands or interests in lands acquired by the state pursuant to the provisions of subdivisions 1 to 3.\nThe commissioner shall convey to a railroad company, by quitclaim deed, lands owned by the state in fee for trunk highway purposes, but no longer needed for such purposes, when the lands are needed by a railroad company for the relocation of its tracks which is required by the construction, reconstruction, or improvement of a trunk highway. The consideration must be set forth in a voluntary agreement between the railroad company and the commissioner of transportation and must be as provided in subdivision 2.\nMS 1974 [Repealed, 1976 c 163 s 63]",
	"repealed": false
}