{
	"id": "237.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.66",
	"title": "237.66 DISCLOSURE OF LOCAL SERVICE OPTIONS.",
	"text": "A telephone company, when a residential customer initially requests service or requests a change of service, and annually in the form of a bill insert, shall advise each residential customer of the price of all service options available to that customer. The requirement of an annual notice through a bill insert does not apply to long-distance service.\nEach residential and commercial telecommunications carrier customer may elect to require that the telephone company serving the customer receive authorization from the customer before a request to serve that customer from a different intrastate telecommunications carrier than the carrier currently serving the customer is processed.\n[Repealed, 1998 c 345 s 16]\nFor new installations, a telephone company shall notify a residential or commercial customer of the right described in subdivision 1a when the customer initially requests intraexchange service. Any customer notification of the rights set forth in this section shall be provided utilizing uniform, competitively neutral language and the form, content, and style of the authorization shall be consistent with federal law and regulation and shall use language provided and approved by the public utilities commission.\nA customer may change the election under subdivision 1a at any time by notifying the telephone company of that decision. No separate charge may be imposed on the customer for electing to exercise the right described in subdivision 1a or to change that election, but a telephone company may recover in rates the reasonable costs of administering the election.\nCopies of both the written notices and information provided to customer service representatives concerning the disclosure required under subdivision 1 must be filed once every 12 months with the commission and the department. Independent telephone companies, municipalities, and cooperative telephone associations are exempt from the requirements of this subdivision unless otherwise ordered by the commission.\nA telephone company, when a residential customer initially requests service, shall advise each residential customer of the availability of all blocking options including 900 number blocking and international long-distance blocking.\nIf, after an expedited procedure conducted under section 237.61, the commission finds that a telephone company is failing to provide disclosure as required under subdivision 1, or the notification required under subdivision 1c, it shall order the company to take corrective action as necessary.",
	"repealed": false
}