{
	"id": "216B.1638",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1638",
	"title": "216B.1638 RECOVERY OF NATURAL GAS EXTENSION PROJECT COSTS.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Contribution in aid of construction\" means a monetary contribution, paid by a developer or local unit of government to a utility providing natural gas service to a community receiving that service as the result of a natural gas extension project, that reduces or offsets the difference between the total revenue requirement of the project and the revenue generated from the customers served by the project.\n(c) \"Developer\" means a developer of the project or a person that owns or will own the property served by the project.\n(d) \"Local unit of government\" means a city, county, township, commission, district, authority, or other political subdivision or instrumentality of this state.\n(e) \"Natural gas extension project\" or \"project\" means the construction of new infrastructure or upgrades to existing natural gas facilities necessary to serve currently unserved or inadequately served areas.\n(f) \"Revenue deficiency\" means the deficiency in funds that results when projected revenues from customers receiving natural gas service as the result of a natural gas extension project, plus any contributions in aid of construction paid by these customers, fall short of the total revenue requirement of the natural gas extension project.\n(g) \"Total revenue requirement\" means the total cost of extending and maintaining natural gas service to a currently unserved or inadequately served area.\n(h) \"Transport customer\" means a customer for whom a natural gas utility transports gas the customer has purchased from another natural gas supplier.\n(i) \"Unserved or inadequately served area\" means an area in this state lacking adequate natural gas pipeline infrastructure to meet the demand of existing or potential end-use customers.\n(a) A public utility may petition the commission outside of a general rate case for a rider that shall include all of the utility's customers, including transport customers, to recover the revenue deficiency from a natural gas extension project.\n(b) The petition shall include:\n(1) a description of the natural gas extension project, including the number and location of new customers to be served and the distance over which natural gas will be distributed to serve the unserved or inadequately served area;\n(2) the project's construction schedule;\n(3) the proposed project budget;\n(4) the amount of any contributions in aid of construction;\n(5) a description of efforts made by the public utility to offset the revenue deficiency through contributions in aid to construction;\n(6) the amount of the revenue deficiency, and how recovery of the revenue deficiency will be allocated among industrial, commercial, residential, and transport customers;\n(7) the proposed method to be used to recover the revenue deficiency from each customer class, such as a flat fee, a volumetric charge, or another form of recovery;\n(8) the proposed termination date of the rider to recover the revenue deficiency; and\n(9) a description of benefits to the public utility's existing natural gas customers that will accrue from the natural gas extension project.\n(a) The commission shall allow opportunity for comment on the petition.\n(b) The commission shall approve a public utility's petition for a rider to recover the costs of a natural gas extension project if it determines that:\n(1) the project is designed to extend natural gas service to an unserved or inadequately served area; and\n(2) project costs are reasonable and prudently incurred.\n(c) The commission must not approve a rider under this section that allows a utility to recover more than 33 percent of the costs of a natural gas extension project.\n(d) The revenue deficiency from a natural gas extension project recoverable through a rider under this section must include the currently authorized rate of return, incremental income taxes, incremental property taxes, incremental depreciation expenses, and any incremental operation and maintenance costs.\nThe commission may issue orders necessary to implement and administer this section.\nNothing in this section commits a public utility to implement a project approved by the commission. The public utility seeking to provide natural gas service shall notify the commission whether it intends to proceed with the project as approved by the commission.\nBy January 15, 2017, and every three years thereafter, the commission shall report to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over energy policy:\n(1) the number of public utilities and projects proposed and approved under this section;\n(2) the total cost of each project;\n(3) rate impacts of the cost recovery mechanism; and\n(4) an assessment of the effectiveness of the cost recovery mechanism in realizing increased natural gas service to unserved or inadequately served areas from natural gas extension projects.",
	"repealed": false
}