{
	"id": "549.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/549.09",
	"title": "549.09 INTEREST ON VERDICTS, AWARDS, AND JUDGMENTS.",
	"text": "(a) When a judgment or award is for the recovery of money, including a judgment for the recovery of taxes, interest from the time of the verdict, award, or report until judgment is finally entered shall be computed by the court administrator or arbitrator as provided in paragraph (c) and added to the judgment or award.\n(b) Except as otherwise provided by contract or allowed by law, preverdict, preaward, or prereport interest on pecuniary damages shall be computed as provided in paragraph (c) from the time of the commencement of the action or a demand for arbitration, or the time of a written notice of claim, whichever occurs first, except as provided herein. The action must be commenced within two years of a written notice of claim for interest to begin to accrue from the time of the notice of claim. If either party serves a written offer of settlement, the other party may serve a written acceptance or a written counteroffer within 30 days. After that time, interest on the judgment or award shall be calculated by the judge or arbitrator in the following manner. The prevailing party shall receive interest on any judgment or award from the time of commencement of the action or a demand for arbitration, or the time of a written notice of claim, or as to special damages from the time when special damages were incurred, if later, until the time of verdict, award, or report only if the amount of its offer is closer to the judgment or award than the amount of the opposing party's offer. If the amount of the losing party's offer was closer to the judgment or award than the prevailing party's offer, the prevailing party shall receive interest only on the amount of the settlement offer or the judgment or award, whichever is less, and only from the time of commencement of the action or a demand for arbitration, or the time of a written notice of claim, or as to special damages from when the special damages were incurred, if later, until the time the settlement offer was made. Subsequent offers and counteroffers supersede the legal effect of earlier offers and counteroffers. For the purposes of clause (2), the amount of settlement offer must be allocated between past and future damages in the same proportion as determined by the trier of fact. Except as otherwise provided by contract or allowed by law, preverdict, preaward, or prereport interest shall not be awarded on the following:\n(1) judgments, awards, or benefits in workers' compensation cases, but not including third-party actions;\n(2) judgments or awards for future damages;\n(3) punitive damages, fines, or other damages that are noncompensatory in nature;\n(4) judgments or awards not in excess of the amount specified in section 491A.01; and\n(5) that portion of any verdict, award, or report which is founded upon interest, or costs, disbursements, attorney fees, or other similar items added by the court or arbitrator.\n(c)(1)(i) For a judgment or award of $50,000 or less or a judgment or award for or against the state or a political subdivision of the state, regardless of the amount, or a judgment or award in a family court action, except for a child support judgment, regardless of the amount, the interest shall be computed as simple interest per annum. The rate of interest shall be based on the secondary market yield of one year United States Treasury bills, calculated on a bank discount basis as provided in this section.\nOn or before the 20th day of December of each year the state court administrator shall determine the rate from the one-year constant maturity treasury yield for the most recent calendar month, reported on a monthly basis in the latest statistical release of the board of governors of the Federal Reserve System. This yield, rounded to the nearest one percent, or four percent, whichever is greater, shall be the annual interest rate during the succeeding calendar year. The state court administrator shall communicate the interest rates to the court administrators and sheriffs for use in computing the interest on verdicts and shall make the interest rates available to arbitrators.\nThis item applies to any section that references section 549.09 by citation for the purposes of computing an interest rate on any amount owed to or by the state or a political subdivision of the state, regardless of the amount.\n(ii) The court, in a family court action, may order a lower interest rate or no interest rate if the parties agree or if the court makes findings explaining why application of a lower interest rate or no interest rate is necessary to avoid causing an unfair hardship to the debtor. This item does not apply to child support or spousal maintenance judgments subject to section 548.091.\n(2) For a judgment or award over $50,000, other than a judgment or award for or against the state or a political subdivision of the state or a judgment or award in a family court action, the interest rate shall be ten percent per year until paid.\n(3) When a judgment creditor, or the judgment creditor's attorney or agent, has received a payment after entry of judgment, whether the payment is made voluntarily by or on behalf of the judgment debtor, or is collected by legal process other than execution levy where a proper return has been filed with the court administrator, the judgment creditor, or the judgment creditor's attorney, before applying to the court administrator for an execution shall file with the court administrator an affidavit of partial satisfaction. The affidavit must state the dates and amounts of payments made upon the judgment after the most recent affidavit of partial satisfaction filed, if any; the part of each payment that is applied to taxable disbursements and to accrued interest and to the unpaid principal balance of the judgment; and the accrued, but the unpaid interest owing, if any, after application of each payment.\n(4) Beginning August 1, 2022, interest shall not accrue on past, current, or future child support judgments.\n(d) This section does not apply to arbitrations between employers and employees under chapter 179 or 179A. An arbitrator is neither required to nor prohibited from awarding interest under chapter 179 or under section 179A.16 for essential employees.\n(e) For purposes of this subdivision:\n(1) \"state\" includes a department, board, agency, commission, court, or other entity in the executive, legislative, or judicial branch of the state; and\n(2) \"political subdivision\" includes a town, statutory or home rule charter city, county, school district, or any other political subdivision of the state.\nDuring each calendar year, interest shall accrue on the unpaid balance of the judgment or award from the time that it is entered or made until it is paid, at the annual rate provided in subdivision 1. The court administrator shall compute and add the accrued interest to the total amount to be collected when the execution is issued and compute the amount of daily interest accruing during the calendar year. The person authorized by statute to make the levy shall compute and add interest from the date that the writ of execution was issued to the date of service of the writ of execution and shall direct the daily interest to be computed and added from the date of service until any money is collected as a result of the levy.\nIf an affidavit is filed pursuant to subdivision 4, a judgment creditor, or the judgment creditor's attorney or agent, is entitled to deduct from any payment made upon a judgment, whether the payment is made voluntarily by or on behalf of the judgment debtor, or is collected by legal process, all disbursements that are made taxable by statute or by rule of court, that have been paid or incurred by the judgment creditor or the judgment creditor's attorney, after the entry of judgment. Any remaining portion of the payment must be applied to the interest that has accrued upon the unpaid principal balance of the judgment before any remaining part is applied to reduce the unpaid principal balance of the judgment.\nA judgment creditor, or the judgment creditor's attorney, may file an affidavit specifying the nature and amount of taxable disbursements paid or incurred by the judgment creditor, or the judgment creditor's attorney, after the entry of judgment. An execution issued by the court administrator must include increased disbursements as are included in the affidavit filed with the court administrator.",
	"repealed": false
}