{
	"id": "135A.163",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.163",
	"title": "135A.163 STUDENTS WITH DISABILITIES; ACCOMMODATIONS; GENERAL REQUIREMENTS.",
	"text": "This section may be cited as the \"Minnesota Respond, Innovate, Succeed, and Empower (RISE) Act.\"\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Institution of higher education\" means a public institution of higher education, Tribal college, and private institution of higher education that receives federal funding. The Board of Regents of the University of Minnesota is requested to comply with this section.\n(c) \"Plain language\" means communication the audience can understand the first time the audience reads or hears it.\n(d) \"Student with a disability\" means an admitted or enrolled student who meets the definition of an individual with a disability under the Americans with Disabilities Act and includes a student with an intellectual disability as defined in Code of Federal Regulations, title 34, section 668.231, who is admitted or enrolled in a comprehensive transition and postsecondary program.\n(a) Each institution of higher education shall adopt a policy making self-disclosure by a student with a disability sufficient to start the interactive process for reasonable accommodations under subdivision 4.\n(b) The policy adopted under this section must be transparent and explicit. The policy must include information describing the process by which the institution of higher education determines eligibility for accommodations for an individual with a disability and information about the disability resource center and other areas within the institution that provide student accommodations, such as housing and residence life. Each institution of higher education shall disseminate the information to applicants, students, parents, and faculty in plain language and in accessible formats. The information must be available during the student application process, during student orientation, in academic catalogs, and on the institution's public website.\n(a) An institution of higher education shall engage in an interactive process to document the student's accommodation needs to establish a reasonable accommodation. An institution may request documentation as part of the interactive process to establish accommodations for the student with a disability.\n(b) The following documentation submitted by an admitted or enrolled student is sufficient documentation for the interactive process to establish reasonable accommodations for a student with a disability:\n(1) documentation that the individual has had an individualized education program (IEP). The institution of higher education may request additional documentation from an individual who has had an IEP if the IEP was not in effect immediately before the date when the individual exited high school;\n(2) documentation that the individual has received services or accommodations under a section 504 plan. The institution of higher education may request additional documentation from an individual who has received services or accommodations provided to the individual under a section 504 plan if the section 504 plan was not in effect immediately before the date when the individual exited high school;\n(3) documentation of a plan or record of service for the individual from a private school, a local educational agency, a state educational agency, or an institution of higher education provided under a section 504 plan or in accordance with the Americans with Disabilities Act of 1990;\n(4) a record or evaluation from an appropriately qualified health or other service professional who is knowledgeable about the individual's condition, finding that the individual has a disability;\n(5) a plan or record of a disability from another institution of higher education;\n(6) documentation of a disability due to military service; or\n(7) additional information from an appropriately qualified health or other service professional who is knowledgeable about the student's condition and can clarify the need for a new accommodation not included in subdivision 4, paragraph (b), clauses (1) to (6).\n(c) An institution of higher education may establish less burdensome criteria to determine reasonable accommodations for an enrolled or admitted student with a disability.\n(d) An institution of higher education shall include a representative list of potential reasonable accommodations and disability resources for individuals with a disability that is accessible to applicants, students, parents, and faculty in plain language and in accessible formats. The information must be provided during the student application process, during student orientation, in academic catalogs, and on the institution's public website. The reasonable accommodations and disability resources available to students are individualized and not limited to the list.\nInstitutions of higher education shall:\n(1) before the beginning of each academic term, offer an opportunity for admitted students to self-identify as having a disability for which they may request an accommodation. The person or office responsible for arranging accommodations at the institution must initiate contact with any student who has self-identified under this clause. This does not preclude a student from requesting an accommodation for a disability at any other time;\n(2) not require a student to be reevaluated for or submit documentation to prove the presence of a permanent disability if the student previously provided proof of their disability status and is not requesting any new accommodations;\n(3) provide the student's accommodation letter to the student's instructors, if the student gives affirmative permission to share the information, and, if requested by the student, facilitate communication between the student and the student's instructors;\n(4) if a course instructor cannot provide an accommodation because it would fundamentally alter the nature of that course, require an instructor to provide a notification detailing why an accommodation cannot be provided to the student and submit that information to the student and the person or office responsible for arranging accommodations; and\n(5) provide a student with a disability who is denied accommodations the option to include the person or office responsible for arranging accommodations in the institution's grievance or appeal process, to resolve equitable access barriers and prevent academic or financial penalty due to no fault of the student.",
	"repealed": false
}