{
	"id": "270C.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.65",
	"title": "270C.65 RIGHT OF SETOFF.",
	"text": "The commissioner of revenue is authorized to certify to the commissioner of management and budget, or to any state agency described in subdivision 3 which disburses its own funds, that a taxpayer has an uncontested delinquent tax liability owed to the commissioner of revenue. The certification must be made within ten years after the date of assessment of the tax. Once certification is made, the commissioner of management and budget or the state agency shall apply to the delinquent tax liability funds sufficient to satisfy the unpaid tax liability from funds appropriated for payment of an obligation of the state or any of its agencies that are due and owing the taxpayer. No setoff shall be made against any funds exempt under Minnesota Statutes 2022, section 550.37, or those funds owed an individual taxpayer who receives assistance under the provisions of chapter 256.\nAll funds, whether general or dedicated, shall be subject to setoff in the manner herein provided. Transfer of funds as herein provided is payment of the obligation of the state or any of its agencies to such taxpayer and any actions for said funds, if any, shall be had against the Department of Revenue on the issue of such tax liability. Nothing in this section shall be construed to limit the previously existing right of the state or any of its agencies to setoff.\nNotwithstanding any provision to the contrary, every person, organization, or corporation doing business (hereafter called vendor) with the state of Minnesota or any of its departments, agencies, or educational institutions including the University of Minnesota (all hereafter called agency) shall provide that agency with either their Social Security number, federal taxpayer identification number, or Minnesota tax identification number. The commissioner may verify to the agency the identifying information provided by a vendor. The agency shall maintain records of this information, and shall make these records available, on request, to the commissioner for the sole purpose of identifying people who have not filed state tax returns or who have not paid uncontested tax liabilities (hereafter called delinquent taxpayer). When an agency is notified by the commissioner that a vendor is a delinquent taxpayer, payments shall not be made by the agency to the vendor until the commissioner notifies the agency that the vendor no longer is a delinquent taxpayer. Furthermore, if the vendor has an uncontested delinquent tax liability, the setoff provided in subdivision 1 may be implemented. The commissioner shall determine that a vendor no longer is a delinquent taxpayer when the vendor has filed all delinquent returns and (1) paid all uncontested tax liabilities or (2) entered into an agreement with the commissioner which provides for the payment of these liabilities.",
	"repealed": false
}