{
	"id": "329.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/329.11",
	"title": "329.11 LICENSE APPLICATION REQUIREMENTS.",
	"text": "Any transient merchant desiring to engage in, do, or transact business by auction or otherwise, in any county in this state shall file an application for a license for that purpose with the auditor of the county in which the desired business is to be conducted, which application shall state the name of the applicant, the proposed place of business, the kind of business proposed to be conducted, and the length of time desired to do business. Such transient merchant shall pay to the treasurer of such county a license fee of $150, and shall give bond to the county in an amount to be determined by the county treasurer, which shall be not less than $1,000 nor more than $3,000. The bond shall be approved by the treasurer and be conditioned that the merchant will in all things conform to the laws relating to transient merchants and further conditioned on full compliance with all material oral or written statements and representations made by the seller, the seller's agents, representatives, or auctioneers with reference to merchandise sold or offered for sale and on faithful performance under all warranties made with reference thereto. The treasurer of such county shall issue to such person receipts therefor, and such transient merchant shall thereupon file such receipts with the auditor of such county, who shall thereupon issue to such transient merchant a license to do business as such at the place described in the application; and the kind of business to be done shall be described therein. No license shall be good for more than one person unless such person shall be a member of a copartnership, nor for more than one place, and shall not be good outside of the county in which it was issued. Such license shall be good for a period of one year from the date of its issuance. The auditor shall keep a record of such licenses in a book provided for that purpose, which shall at all times be open for public inspection. No license shall be issued unless the merchant produces evidence that the merchant is the holder of a valid seller's permit issued under section 297A.83, or a written statement from the merchant that the merchant is not offering for sale any item that is taxable under chapter 297A.\nThe application shall further contain the applicant's residence and business address for the prior two-year period; the type of business engaged in during the previous two years; and the name and address of the auctioneer who will conduct the sale. No such sale shall be conducted in the name of any person other than the bona fide owner of the merchandise.\nThe applicant shall attach to the application an itemized list of merchandise to be offered for sale reciting as to each item a description thereof including serial number if any, the owner's actual cost thereof, and a designation by number corresponding with a number to be affixed to each item by a tag which shall be kept fastened to the item at all times until sold.\nPrior to the issuance of the license and approval of bond, the applicant shall in writing appoint the county auditor as the applicant's agent to accept service of process in any action commenced against the applicant arising out of the sale for which the license is sought. Such action shall be brought in the county where the sale was held.",
	"repealed": false
}