{
	"id": "237.773",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.773",
	"title": "237.773 ALTERNATIVE REGULATION FOR SMALL TELEPHONE COMPANY.",
	"text": "For purposes of this section, \"small telephone company\" means a local exchange telephone company with fewer than 50,000 subscribers that has made an election under subdivision 2 whether or not the company is subject to sections 237.59 and 237.60, subdivisions 1, 2, and 5.\nA local telephone company with fewer than 50,000 subscribers may elect to become a small telephone company by notice to the commission, in writing, of its decision. The small telephone company may not revoke its election for three years after making the election. While that election remains in effect, a small telephone company is not subject to the rate-of-return regulation or earnings investigation provisions of section 237.075 or 237.081.\nIf, before electing under this subdivision, a small telephone company has been found by the commission to have significant quality of service problems in violation of applicable commission rules, that company must either resolve the quality of service problems or develop a plan to resolve the quality of service problems in conformance with section 237.765. The quality of service plan must be approved by the commission in order for an election under this subdivision to be effective. The commission shall make a determination on the quality of service plan within 60 days after it is submitted.\n(a) Except as provided in paragraph (b), a small telephone company shall not implement a rate increase for any service listed in section 237.761, subdivision 3, beyond the level in effect 60 days prior to an election under subdivision 2, until the later of January 1, 1998, or two years after making an election. However, a small telephone company may implement any new service and establish rates for any new service and may change rates for any other service at any time subject to the requirements of section 237.761, subdivision 4. A small company shall provide to its customers the ability to block, at no extra charge, any new service which it offers, provides, or bills. This requirement shall not apply to services that require affirmative subscription by the customer. Nothing in this section shall prevent the commission from requiring blocking or other privacy or safety protections for other types of telecommunications services under section 237.081.\n(b) At any time following one year after electing under subdivision 2, a small telephone company may change rates for local services except switched network access services, listed in section 237.761, subdivision 3, to reflect:\n(1) changes in state and federal taxes;\n(2) changes in jurisdictional allocations from the Federal Communications Commission, the amount of which the small telephone company cannot control and for which equal and opposite exogenous changes are made on the federal level;\n(3) substantial financial impacts of investments in network upgrades which are made; or\n(i) if the investment exceeds 20 percent of the gross plant investment of the company; or\n(ii) as the result of government mandates to construct specific telephone infrastructure, if the mandate applies to local telephone companies and the company would not otherwise be compensated.\nA small telephone company may change rates for local services listed in section 237.761, subdivision 3, at any time, to implement extended area service or any successor to that service on an income-neutral basis.\nA small telephone company proposing an increase under this subdivision shall provide 60 days' advance written notice to the department and each of the company's customers including the individual rates affected and the procedure necessary for the customers to petition for investigation. If the department receives a petition within 45 days after the notice from five percent or 500, whichever is fewer, of the customers of the small telephone company, the department and the company shall jointly determine if the petition is valid and, if so, may investigate the rate change to determine if it conforms to the limitations of this subdivision. Within 30 days of validating the petition, the department shall report its findings to the commission, which shall either adopt the report or order changes to conform to this subdivision.\n(c) On or after the later of January 1998, or two years after making an election under subdivision 2, a small telephone company may increase rates for local services, except switched network access services, listed in section 237.761, subdivision 3. A small telephone company proposing an increase shall provide 60 days' advance written notice to its customers including individual rates affected and the procedure necessary for the customers to petition for investigation. If the commission receives a petition within 45 days after such notice, from five percent or 500, whichever is fewer, of the customers of the small telephone company, the department and the company shall jointly determine if the petition is valid and, if so, may investigate the proposed rate increase to determine if it is appropriate in light of rates charged by other local exchange telephone companies for comparable services, taking into account calling scope, quality of service, the availability of competitive alternatives, service costs, and the features available to the customers. Within 30 days of validating the petition, the department shall file a report with the commission which shall then approve appropriate rates for those services. Rates established by the commission under this paragraph shall not be increased within one year of implementation.\n(a) No election by a small telephone company may in any way change the terms or conditions of any interexchange access charge settlements approved by the commission before an election under subdivision 2.\n(b) While any interexchange access charge settlement approved by the commission remains in effect, the commission and department shall enforce the agreement without further investigation of interexchange access charges or earnings relating to the interexchange access service. Except as specifically provided in this section, the commission retains all of its authority under section 237.081 to investigate other matters relating to interexchange access charges and to issue appropriate orders, and the department retains its authority under sections 216A.07 and 237.15 to investigate matters relating to interexchange access charges.\n[Repealed, 2000 c 436 s 3]",
	"repealed": false
}