{
	"id": "504B.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.171",
	"title": "504B.171 COVENANT OF LANDLORD AND TENANT NOT TO ALLOW UNLAWFUL ACTIVITIES.",
	"text": "(a) In every lease or license of residential premises, whether in writing or parol, the landlord or licensor and the tenant or licensee covenant that:\n(1) neither will:\n(i) allow controlled substances in those premises or in the common area and curtilage of the premises in violation of any criminal provision of chapter 152;\n(ii) allow prostitution or prostitution-related activity as defined in section 617.80, subdivision 4, to occur on the premises or in the common area and curtilage of the premises;\n(iii) allow the unlawful use or possession of a firearm in violation of section 609.66, subdivision 1a, 609.67, or 624.713, on the premises or in the common area and curtilage of the premises; or\n(iv) allow stolen property or property obtained by robbery in those premises or in the common area and curtilage of the premises; and\n(2) the common area and curtilage of the premises will not be used by either the landlord or licensor or the tenant or licensee or others acting under the control of either to manufacture, sell, give away, barter, deliver, exchange, distribute, purchase, or possess a controlled substance in violation of any criminal provision of chapter 152. The covenant is not violated when a person other than the landlord or licensor or the tenant or licensee possesses or allows controlled substances in the premises, common area, or curtilage, unless the landlord or licensor or the tenant or licensee knew or had reason to know of that activity.\n(b) In every lease or license of residential premises, whether in writing or parol, the tenant or licensee covenant that the tenant or licensee will not commit an act enumerated under section 504B.206, subdivision 1, paragraph (a), against a tenant or licensee or any authorized occupant.\n(c) A landlord cannot prohibit a tenant from legally possessing, and a tenant cannot waive the right to legally possess, any cannabis products, lower-potency hemp edibles, or hemp-derived consumer products, or using any cannabinoid product or hemp-derived consumer product, other than consumption by combustion or vaporization of the product and inhalation of smoke, aerosol, or vapor from the product.\nA breach of the covenant created by subdivision 1 voids the tenant's or licensee's right to possession of the residential premises. All other provisions of the lease or license, including but not limited to the obligation to pay rent, remain in effect until the lease is terminated by the terms of the lease or operation of law. If the tenant or licensee breaches the covenant created by subdivision 1, the landlord may bring, or assign to the county or city attorney of the county or city in which the residential premises are located, the right to bring an eviction action against the tenant or licensee. The assignment must be in writing on a form provided by the county or city attorney, and the county or city attorney may determine whether to accept the assignment. If the county or city attorney accepts the assignment of the landlord's right to bring an eviction action:\n(1) any court filing fee that would otherwise be required in an eviction action is waived; and\n(2) the landlord retains all the rights and duties, including removal of the tenant's or licensee's personal property, following issuance of the writ of recovery of premises and order to vacate and delivery of the writ to the sheriff for execution.\nA residential landlord may not impose a penalty on a residential tenant or terminate the lease of a residential tenant for the conduct of the residential tenant, household member, or guest occurring off of the premises or curtilage of the premises, unless (1) the conduct would constitute a crime of violence against another tenant, the tenant's guest, the landlord, or the landlord's employees, regardless of whether a charge was brought or a conviction obtained; or (2) the conduct results in a conviction of a crime of violence against a person unrelated to the premises. For purposes of this subdivision, crime of violence has the meaning given in section 624.712, subdivision 5, except that it does not include offenses under chapter 152.\nThe parties to a lease or license of residential premises may not waive or modify the covenant imposed by this section.",
	"repealed": false
}