{
	"id": "72A.139",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.139",
	"title": "72A.139 USE OF GENETIC TESTS.",
	"text": "This section shall be known and may be cited as the \"Genetic Discrimination Act.\"\n(a) As used in this section, \"commissioner\" means the commissioner of commerce for health plan companies and other insurers regulated by that commissioner and the commissioner of health for health plan companies regulated by that commissioner.\n(b) As used in this section, a \"genetic test\" means a presymptomatic test of a person's genes, gene products, or chromosomes for the purpose of determining the presence or absence of a gene or genes that exhibit abnormalities, defects, or deficiencies, including carrier status, that are known to be the cause of a disease or disorder, or are determined to be associated with a statistically increased risk of development of a disease or disorder. \"Genetic test\" does not include a cholesterol test or other test not conducted for the purpose of determining the presence or absence of a person's gene or genes.\n(c) As used in this section, \"health plan\" has the meaning given in section 62Q.01, subdivision 3.\n(d) As used in this section, \"health plan company\" has the meaning given in section 62Q.01, subdivision 4.\n(e) As used in this section, \"individual\" means an applicant for coverage or a person already covered by the health plan company or other insurer.\nA health plan company, in determining eligibility for coverage, establishing premiums, limiting coverage, renewing coverage, or any other underwriting decision, shall not, in connection with the offer, sale, or renewal of a health plan:\n(1) require or request an individual or a blood relative of the individual to take a genetic test;\n(2) make any inquiry to determine whether an individual or a blood relative of the individual has taken or refused a genetic test, or what the results of any such test were;\n(3) take into consideration the fact that a genetic test was taken or refused by an individual or blood relative of the individual; or\n(4) take into consideration the results of a genetic test taken by an individual or a blood relative of the individual.\nSubdivisions 5, 6, and 7 apply only to a life insurance company or fraternal benefit society requiring a genetic test for the purpose of determining insurability under a policy of life insurance.\nIf an individual agrees to take a genetic test, the life insurance company or fraternal benefit society shall obtain the individual's written informed consent for the test. Written informed consent must include, at a minimum, a description of the specific test to be performed; its purpose, potential uses, and limitations; the meaning of its results; and the right to confidential treatment of the results. The written informed consent must inform the individual that the individual should consider consulting with a genetic counselor prior to taking the test and must state whether the insurer will pay for any such consultation. An informed consent disclosure form must be approved by the commissioner prior to its use.\nThe life insurance company or fraternal benefit society shall notify an individual of a genetic test result by notifying the individual or the individual's designated physician. If the individual tested has not given written consent authorizing a physician to receive the test results, the individual must be urged, at the time that the individual is informed of the genetic test result described in this subdivision, to contact a genetic counselor or other health care professional.\nA life insurance company or fraternal benefit society shall not require an individual to submit to a genetic test unless the cost of the test is paid by the life insurance company or fraternal benefit society.\nA violation of this section is subject to the investigative and enforcement authority of the commissioner, who shall enforce this section.",
	"repealed": false
}