{
	"id": "116C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.03",
	"title": "116C.03 ENVIRONMENTAL QUALITY BOARD; MEMBERSHIP; CHAIR; STAFF.",
	"text": "An environmental quality board, designated as the Minnesota Environmental Quality Board, is hereby created.\nThe members of the board are the commissioner of administration, the commissioner of commerce, the commissioner of the Pollution Control Agency, the commissioner of natural resources, the commissioner of agriculture, the commissioner of health, the commissioner of employment and economic development, the commissioner of transportation, and the chair of the Board of Water and Soil Resources. The governor shall appoint members from the general public to the board, one from each congressional district, subject to the advice and consent of the senate. At least four public members must have knowledge of and be conversant in environmental review or permitting. The governor must appoint the chair of the board. Notwithstanding the provisions of section 15.06, subdivision 6, members of the board may not delegate their powers and responsibilities as board members to any other person. Members appointed under this subdivision must not be registered lobbyists or legislators.\nThe membership terms, compensation, removal, and filling of vacancies of public members of the board shall be as provided in section 15.0575, except that a public member may be compensated at the rate of up to $125 a day.\n[Repealed, 1982 c 524 s 9]\n[Repealed, 2017 c 93 art 2 s 166]\nStaff and consultant support for board activities shall be provided by the Pollution Control Agency. This support shall be provided based upon an annual budget and work program developed by the board and certified to the commissioner by the chair of the board. The board shall have the authority to request and require staff support from all other agencies of state government as needed for the execution of the responsibilities of the board.\nThe board shall contract with the Pollution Control Agency for administrative services necessary to the board's activities. The services shall include personnel, budget, payroll and contract administration.\nThe board shall adopt an annual budget and work program.",
	"repealed": false
}