{
	"id": "103D.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.205",
	"title": "103D.205 ESTABLISHMENT PETITION.",
	"text": "To establish a watershed district, an establishment petition must be filed with the board.\n(a) The establishment petition must state:\n(1) the name of the proposed watershed district;\n(2) in general terms, a description of the property to be included in the watershed district;\n(3) the necessity for the watershed district and the contemplated improvements within the watershed district;\n(4) the reasons why the watershed district and the contemplated improvements would be conducive to public health and public welfare, or would accomplish any of the purposes in section 103D.201;\n(5) by illustration in a map, the proposed watershed district;\n(6) the number of managers proposed for the watershed district; and\n(7) a list of the nominees for manager positions containing at least twice the proposed number of managers.\n(b) The number of managers proposed for a watershed district may not be less than three nor more than nine. A manager must not be a public officer of the county, state, or federal government, except that a soil and water conservation supervisor may be a manager.\nThe establishment petition must be signed by one or more of the following groups:\n(1) one-half or more of the counties within the proposed watershed district;\n(2) counties having 50 percent or more of the area within the proposed watershed district;\n(3) a majority of the cities within the proposed watershed district; or\n(4) 50 or more resident owners residing in the proposed watershed district, excluding resident owners within the corporate limits of a city if the city has signed the petition.\nThe petitioners must file a copy of the establishment petition with the auditors of the counties affected by the proposed watershed district and the director. The original establishment petition, with a signed statement of delivery or receipt for each of the establishment petitions submitted to the auditors of affected counties and the director, must be filed with the board.\nSimilar and duplicate establishment petitions for the same proposed watershed district may be filed and regarded as one establishment petition. All establishment petitions filed before the establishment hearing must be considered by the board as part of the original petition.\nAn establishment petition that has the requisite number of petitioner signatures may not be dismissed because of defects in the establishment petition. The board must allow petitioners to amend a defective establishment petition at any time before the end of the establishment hearing.\nAfter an establishment petition has been filed, a petitioner may not withdraw from the establishment petition unless the withdrawing petitioner obtains the written consent of all other petitioners and files the written consent with the board.",
	"repealed": false
}