{
	"id": "97A.485",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.485",
	"title": "97A.485 ISSUANCE OF LICENSES.",
	"text": "The commissioner shall issue and sell licenses. The commissioner shall furnish licenses and applications to agents authorized to issue licenses.\n[Repealed, 1992 c 513 art 3 s 79]\n[Repealed, 2004 c 255 s 51]\nThe commissioner may appoint federal, state, or local government employees to be agents of the commissioner for the sale of licenses or permits to take additional deer under section 97B.301, subdivision 4. A bond is not required of a government employee appointed under this subdivision.\nThe commissioner may appoint agents of the commissioner to issue and sell licenses. The appointment may be revoked by the commissioner at any time.\nTo be an agent, a person must apply to the commissioner in writing and in a manner approved by the commissioner.\nAn agent must promptly deposit and remit all money received from the sale of licenses, except issuing fees, to the commissioner.\n(a) Persons authorized to sell licenses under this section must issue the following licenses for the license fee and the following issuing fees:\n(1) to take deer or bear with firearms and by archery, the issuing fee is $1;\n(2) Minnesota sporting, the issuing fee is $1;\n(3) to take small game, to take fish by angling or by spearing, and to trap fur-bearing animals, the issuing fee is $1;\n(4) to apply for a limited hunt drawing, the issuing fee is $1 unless the application requires a license purchase at the time of application and the license purchase requires an application fee;\n(5) for a prairie-chicken license, the issuing fee is $1;\n(6) for a turkey license, the issuing fee is $1;\n(7) for an elk license, the issuing fee is $1;\n(8) for a moose license, the issuing fee is $1;\n(9) for a wolf license, the issuing fee is $1;\n(10) for a stamp validation that is not issued simultaneously with a license, an issuing fee of 50 cents may be charged at the discretion of the authorized seller;\n(11) for stamp validations issued simultaneously with a license, there is no fee;\n(12) for licenses, seals, tags, or coupons issued without a fee under section 97A.441, subdivisions 1 to 6a, or 97A.465, there is no fee;\n(13) for lifetime licenses, there is no fee; and\n(14) for all other licenses, permits, renewals, or applications or any other transaction through the electronic licensing system under this chapter or any other chapter when an issuing fee is not specified, an issuing fee of $1 may be charged at the discretion of the authorized seller.\n(b) Only one issuing fee may be collected when selling more than one stamp in the same transaction after the end of the season for which the stamp was issued.\n(c) The agent shall keep the issuing fee as a commission for selling the licenses.\n(d) The commissioner shall collect the issuing fee on licenses sold by the commissioner.\n(e) A license, except stamps, must state the amount of the issuing fee and that the issuing fee is kept by the seller as a commission for selling the licenses.\n(f) For duplicate licenses, including licenses issued without a fee, the issuing fees are:\n(1) for licenses to take big game, 75 cents; and\n(2) for other licenses, 50 cents.\n[See Note.]\nThe commissioner shall retain for the operation of the electronic licensing system the commission established under section 84.027, subdivision 15, and issuing fees collected by the commissioner on all license fees.\n[Repealed, 2004 c 255 s 51]\nA license to guide bear hunters may not be issued after the day before the opening of the related firearms season.\n[Repealed, 2004 c 255 s 51]\nThe commissioner shall prescribe rules for the accounting and procedural requirements necessary to assure the efficient handling of licenses and license fees. The commissioner may, by rule, establish standards for the appointment and revocation of agents to assure the efficient distribution of licenses throughout the state.\n[Repealed, 2012 c 277 art 1 s 91]\nThe commissioner must allow one-day paper fishing licenses to be sold by fishing guides operating charter boats.\n[See Note.]",
	"repealed": false
}