{
	"id": "469.153",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.153",
	"title": "469.153 DEFINITIONS.",
	"text": "In sections 469.152 to 469.165, the terms defined in this section have the meanings given them herein, unless the context indicates a different meaning.\n(a) \"Project\" means (1) any properties, real or personal, used or useful in connection with a revenue producing enterprise, or any combination of two or more such enterprises engaged or to be engaged in generating, transmitting, or distributing electricity, assembling, fabricating, manufacturing, mixing, processing, storing, warehousing, or distributing any products of agriculture, forestry, mining, or manufacture, or in research and development activity in this field, or in the manufacturing, creation, or production of intangible property, including any patent, copyright, formula, process, design, know-how, format, or other similar item; (2) any properties, real or personal, used or useful in the abatement or control of noise, air, or water pollution, or in the disposal of solid wastes, in connection with a revenue producing enterprise, or any combination of two or more such enterprises engaged or to be engaged in any business or industry; (3) any properties, real or personal, used or useful in connection with the business of telephonic communications, conducted or to be conducted by a telephone company, including toll lines, poles, cables, switching, and other electronic equipment and administrative, data processing, garage, and research and development facilities; (4) any properties, real or personal, used or useful in connection with a district heating system, consisting of the use of one or more energy conversion facilities to produce hot water or steam for distribution to homes and businesses, including cogeneration facilities, distribution lines, service facilities, and retrofit facilities for modifying the user's heating or water system to use the heat energy converted from the steam or hot water.\n(b) \"Project\" also includes any properties, real or personal, used or useful in connection with a revenue producing enterprise, or any combination of two or more such enterprises engaged in any business.\n(c) \"Project\" also includes any properties, real or personal, used or useful for the promotion of tourism in the state. Properties may include hotels, motels, lodges, resorts, recreational facilities of the type that may be acquired under section 471.191, and related facilities.\n(d) \"Project\" also includes any properties, real or personal, used or useful in connection with a revenue producing enterprise, whether or not operated for profit, engaged in providing health care services, including hospitals, nursing homes, and related medical facilities.\n(e) \"Project\" does not include any property to be sold or to be affixed to or consumed in the production of property for sale, and does not include any housing facility to be rented or used as a permanent residence.\n(f) \"Project\" also means the activities of any revenue producing enterprise involving the construction, fabrication, sale, or leasing of equipment or products to be used in gathering, processing, generating, transmitting, or distributing solar, wind, geothermal, biomass, agricultural or forestry energy crops, or other alternative energy sources for use by any person or any residential, commercial, industrial, or governmental entity in heating, cooling, or otherwise providing energy for a facility owned or operated by that person or entity.\n(g) \"Project\" also includes any properties, real or personal, used or useful in connection with a county jail, county regional jail, community corrections facilities authorized by chapter 401, or other law enforcement facilities, the plans for which are approved by the commissioner of corrections; provided that the provisions of section 469.155, subdivisions 7 and 13, do not apply to those projects.\n(h) \"Project\" also includes any real properties used or useful in furtherance of the purpose and policy of section 469.141.\n(i) \"Project\" also includes related facilities as defined by Minnesota Statutes 2012, section 471A.02, subdivision 11.\n(j) \"Project\" also includes an undertaking to purchase the obligations of local governments located in whole or in part within the boundaries of the municipality that are issued or to be issued for public purposes.\n(k) \"Project\" also includes any properties designated as a qualified green building and sustainable design project under section 469.1655.\n\"Municipality\" means any home rule charter or statutory city, any town described in section 368.01, and any county if (1) the project is located outside the boundaries of a city or a town described in section 368.01 or (2) the project involves telephonic communications conducted by or to be conducted by a telephone company, or financial or other assistance to rail users as defined in section 222.48, subdivision 6, for the purpose of making capital investment loans for rail line rehabilitation. In any case in which a city or town described in section 368.01 has consented to the issuance of bonds by a county on behalf of an organization described in section 501(c)(3) of the Internal Revenue Code of 1986, as amended through December 31, 1986, to finance a project within its boundaries or to refund bonds previously issued by such city or town, \"municipality\" means any county.\n\"Redevelopment agency\" means any port authority referred to in sections 469.048 to 469.068, or any city authorized by general or special law to exercise the powers of a port authority; any economic development authority referred to in sections 469.090 to 469.108; any housing and redevelopment authority referred to in sections 469.001 to 469.047 or any body authorized to exercise the powers of a housing and redevelopment authority; and any area or municipal redevelopment agency referred to in sections 469.109 to 469.123.\n\"Commissioner\" means the commissioner of employment and economic development.\n\"Department\" means the Department of Employment and Economic Development.\n\"Telephone company\" means any person, firm, association, including a cooperative association formed pursuant to chapter 308A, or corporation, excluding municipal telephone companies, operating for hire any telephone line, exchange, or system, wholly or partly within this state.\n\"Contracting party\" means a party to a revenue agreement other than the municipality or redevelopment agency.\n\"Revenues\" of a project include payments under a revenue agreement, or under notes, debentures, bonds, and other secured or unsecured debt obligations of a contracting party.\n\"Revenue agreement\" means any written agreement between a municipality or redevelopment agency and a contracting party with respect to a project, whereby the contracting party agrees to pay to the municipality or redevelopment agency or its order amounts sufficient at all times to pay when due the principal of, premium, if any, and interest on all bonds issued by the municipality or redevelopment agency with respect to that project. A revenue agreement may be in the form of a lease, mortgage, direct or installment sale contract, loan agreement, take or pay or similar agreement, and be secured in manner the parties agree or be unsecured. A revenue agreement must satisfy the requirements of section 469.155, subdivision 5.\n\"Trustee\" means any corporation, bank, or other entity authorized under any law of the United States or of any state to exercise trust powers, or any natural person, acting as trustee, cotrustee or successor trustee under an indenture pursuant to designation of the municipality or redevelopment agency.\n\"Alternative energy\" means any energy source which does not depend upon nuclear fuel or nonrenewable fossil fuel, or which makes available another energy source which currently is wasted and which includes, but is not limited to, cogeneration or district heating.\n\"Related public improvements\" means any public improvements described in section 429.021, that are acquired and constructed in connection with the project and are financed by the contracting party under the revenue agreement.",
	"repealed": false
}