{
	"id": "609.2242",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.2242",
	"title": "609.2242 DOMESTIC ASSAULT.",
	"text": "Whoever does any of the following against a family or household member as defined in section 518B.01, subdivision 2, commits an assault and is guilty of a misdemeanor:\n(1) commits an act with intent to cause fear in another of immediate bodily harm or death; or\n(2) intentionally inflicts or attempts to inflict bodily harm upon another.\nWhoever violates subdivision 1 within ten years of a previous qualified domestic violence-related offense conviction or an adjudication of delinquency is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\n(a) When a person is convicted of a violation of this section or section 609.221, 609.222, 609.223, 609.224, or 609.2247, the court shall determine and make written findings on the record as to whether:\n(1) the assault was committed against a family or household member, as defined in section 518B.01, subdivision 2;\n(2) the defendant owns or possesses a firearm; and\n(3) the firearm was used in any way during the commission of the assault.\n(b) If the court determines that the assault was of a family or household member, and that the offender owns or possesses a firearm and used it in any way during the commission of the assault, it shall order that the firearm be summarily forfeited under section 609.5316, subdivision 3.\n(c) When a person is convicted of assaulting a family or household member and is determined by the court to have used a firearm in any way during commission of the assault, the court may order that the person is prohibited from possessing any type of firearm for any period longer than three years or for the remainder of the person's life. A person who violates this paragraph is guilty of a gross misdemeanor. At the time of the conviction, the court shall inform the defendant for how long the defendant is prohibited from possessing a firearm and that it is a gross misdemeanor to violate this paragraph. The failure of the court to provide this information to a defendant does not affect the applicability of the firearm possession prohibition or the gross misdemeanor penalty to that defendant.\n(d) Except as otherwise provided in paragraph (c), when a person is convicted of a violation of this section or section 609.224 and the court determines that the victim was a family or household member, the court shall inform the defendant that the defendant is prohibited from possessing a firearm for three years from the date of conviction and that it is a gross misdemeanor offense to violate this prohibition. The failure of the court to provide this information to a defendant does not affect the applicability of the firearm possession prohibition or the gross misdemeanor penalty to that defendant.\n(e) Except as otherwise provided in paragraph (c), a person is not entitled to possess a pistol if the person has been convicted after August 1, 1992, or a firearm if a person has been convicted on or after August 1, 2014, of domestic assault under this section or assault in the fifth degree under section 609.224 and the assault victim was a family or household member as defined in section 518B.01, subdivision 2, unless three years have elapsed from the date of conviction and, during that time, the person has not been convicted of any other violation of this section or section 609.224. Property rights may not be abated but access may be restricted by the courts. A person who possesses a firearm in violation of this paragraph is guilty of a gross misdemeanor.\n(f) Except as otherwise provided in paragraphs (b) and (h), when a person is convicted of a violation of this section or section 609.221, 609.222, 609.223, 609.224, or 609.2247 and the court determines that the assault was against a family or household member, the court shall order the defendant to transfer any firearms that the person possesses, within three business days, to a federally licensed firearms dealer, a law enforcement agency, or a third party who may lawfully receive them. The transfer may be permanent or temporary, unless the court prohibits the person from possessing a firearm for the remainder of the person's life under paragraph (c). A temporary firearm transfer only entitles the receiving party to possess the firearm. A temporary transfer does not transfer ownership or title. A defendant may not transfer firearms to a third party who resides with the defendant. If a defendant makes a temporary transfer, a federally licensed firearms dealer or law enforcement agency may charge the defendant a reasonable fee to store the person's firearms and may establish policies for disposal of abandoned firearms, provided such policies require that the person be notified by certified mail prior to disposal of abandoned firearms. For temporary firearms transfers under this paragraph, a law enforcement agency, federally licensed firearms dealer, or third party shall exercise due care to preserve the quality and function of the transferred firearms and shall return the transferred firearms to the person upon request after the expiration of the prohibiting time period imposed under this subdivision, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The return of temporarily transferred firearms to a person shall comply with state and federal law. If a defendant permanently transfers the defendant's firearms to a law enforcement agency, the agency is not required to compensate the defendant and may charge the defendant a reasonable processing fee. A law enforcement agency is not required to accept a person's firearm under this paragraph. The court shall order that the person surrender all permits to carry and purchase firearms to the sheriff.\n(g) A defendant who is ordered to transfer firearms under paragraph (f) must file proof of transfer as provided for in this paragraph. If the transfer is made to a third party, the third party must sign an affidavit under oath before a notary public either acknowledging that the defendant permanently transferred the defendant's firearms to the third party or agreeing to temporarily store the defendant's firearms until such time as the defendant is legally permitted to possess firearms. The affidavit shall indicate the serial number, make, and model of all firearms transferred by the defendant to the third party. The third party shall acknowledge in the affidavit that the third party may be held criminally and civilly responsible under section 624.7144 if the defendant gains access to a transferred firearm while the firearm is in the custody of the third party. If the transfer is to a law enforcement agency or federally licensed firearms dealer, the law enforcement agency or federally licensed firearms dealer shall provide proof of transfer to the defendant. The proof of transfer must specify whether the firearms were permanently or temporarily transferred and include the name of the defendant, date of transfer, and the serial number, make, and model of all transferred firearms. The defendant shall provide the court with a signed and notarized affidavit or proof of transfer as described in this section within two business days of the firearms transfer. The court shall seal affidavits and proofs of transfer filed pursuant to this paragraph.\n(h) When a person is convicted of a violation of this section or section 609.221, 609.222, 609.223, 609.224, or 609.2247, and the court determines that the assault was against a family or household member, the court shall determine by a preponderance of the evidence if the person poses an imminent risk of causing another person substantial bodily harm. Upon a finding of imminent risk, the court shall order that the local law enforcement agency take immediate possession of all firearms in the person's possession. The local law enforcement agency shall exercise due care to preserve the quality and function of the defendant's firearms and shall return the firearms to the person upon request after the expiration of the prohibiting time period, provided the person is not otherwise prohibited from possessing firearms under state or federal law. The local law enforcement agency shall, upon written notice from the person, transfer the firearms to a federally licensed firearms dealer or a third party who may lawfully receive them. Before a local law enforcement agency transfers a firearm under this paragraph, the agency shall require the third party or federally licensed firearms dealer receiving the firearm to submit an affidavit or proof of transfer that complies with the requirements for affidavits or proofs of transfer established in paragraph (g). The agency shall file all affidavits or proofs of transfer received with the court within two business days of the transfer. The court shall seal all affidavits or proofs of transfer filed pursuant to this paragraph. A federally licensed firearms dealer or third party who accepts a firearm transfer pursuant to this paragraph shall comply with paragraphs (f) and (g) as if accepting transfer from the defendant. If the law enforcement agency does not receive written notice from the defendant within three business days, the agency may charge a reasonable fee to store the defendant's firearms. A law enforcement agency may establish policies for disposal of abandoned firearms, provided such policies require that the person be notified via certified mail prior to disposal of abandoned firearms.\nWhoever violates the provisions of this section or section 609.224, subdivision 1, within ten years of the first of any combination of two or more previous qualified domestic violence-related offense convictions or adjudications of delinquency is guilty of a felony and may be sentenced to imprisonment for not more than five years or payment of a fine of not more than $10,000, or both.",
	"repealed": false
}