{
	"id": "12B.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/12B.45",
	"title": "12B.45 CLAIMS PROCESS.",
	"text": "(a) An applicant must submit to the director completed claims for payment of actual and eligible costs on forms provided by the director. All eligible costs claimed for payment must be documented and consistent with the eligibility provisions of this chapter.\n(b) If the director denies an applicant's claim for payment, the applicant has 30 days from receipt of the director's determination to appeal in writing to the commissioner. The appeal must include the applicant's rationale for reversing the director's determination. The commissioner has 30 days from receipt of the appeal to uphold or modify the director's determination and formally respond to the applicant. If, within 30 days of receiving the commissioner's decision, the applicant notifies the commissioner that the applicant intends to contest the commissioner's decision, the Office of Administrative Hearings shall conduct a hearing under the contested case provisions of chapter 14.\nUpon completion of all work by an applicant, the director may inspect all work claimed by the applicant. The applicant must provide the director with access to records pertaining to all claimed work and must permit the director to review all records relating to the work.\nThe director must close out an applicant's disaster assistance application after all of the following occur:\n(1) eligible work is complete;\n(2) the applicant receives the final amount due or pays any amount owed under section 12B.50; and\n(3) any extant or scheduled audits are complete.\n(a) An applicant must account for all funds received under this chapter in conformance with generally accepted accounting principles and practices. The applicant must maintain detailed records of expenditures to show that grants received under this chapter were used for the purpose for which the payment was made. The applicant must maintain records for five years and make the records available for inspection and audit by the director or the state auditor. The applicant must keep all financial records for five years after the final payment, including but not limited to all invoices and canceled checks or bank statements that support all eligible costs claimed by the applicant.\n(b) The director or state auditor may audit all applicant records pertaining to an application or payment under this chapter.\nThe director must post on the division website a list of the recipients and amounts of the payments made under this chapter.",
	"repealed": false
}