{
	"id": "116L.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.20",
	"title": "116L.20 WORKFORCE DEVELOPMENT FUND.",
	"text": "(a) In addition to amounts due from an employer under the Minnesota unemployment insurance program, each employer, except an employer making reimbursements is liable for a special assessment levied at the rate of .10 percent per year on all taxable wages, as defined in section 268.035, subdivision 24, except that effective July 1, 2009, until June 30, 2011, the special assessment shall be levied at a rate of .12 percent per year on all taxable wages as defined in section 268.035, subdivision 24. The assessment shall become due and be paid by each employer on the same schedule and in the same manner as other amounts due from an employer under section 268.051, subdivision 1.\n(b) The special assessment levied under this section shall be subject to the same requirements and collection procedures as any amounts due from an employer under the Minnesota unemployment insurance program.\n(a) The money collected under this section shall be deposited in the state treasury and credited to the workforce development fund to provide for employment and training programs. The workforce development fund is created as a special account in the state treasury.\n(b) All money in the fund not otherwise appropriated or transferred is appropriated to the Job Skills Partnership Board for the purposes of section 116L.17 and as provided for in paragraph (d). The board must act as the fiscal agent for the money and must disburse that money for the purposes of section 116L.17, not allowing the money to be used for any other obligation of the state. All money in the workforce development fund shall be deposited, administered, and disbursed in the same manner and under the same conditions and requirements as are provided by law for the other special accounts in the state treasury, except that all interest or net income resulting from the investment or deposit of money in the fund shall accrue to the fund for the purposes of the fund.\n(c) Reimbursement for costs related to collection of the special assessment shall be in an amount negotiated between the commissioner and the United States Department of Labor.\n(d) If the board determines that the conditions of section 116L.05, subdivision 5, have been met, the board may use funds for the purposes outlined in section 116L.04, or to provide incumbent worker training services under section 116L.18.",
	"repealed": false
}