{
	"id": "444.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/444.075",
	"title": "444.075 WATERWORKS SYSTEMS; STORM, SANITARY SEWER SYSTEMS.",
	"text": "The definitions in this subdivision apply in this section.\n(a) \"Municipality\" means a home rule charter or statutory city or a town.\n(b) \"Governing body\" means the town board with respect to towns.\n(c) \"Waterworks\" means waterworks systems, including mains, valves, hydrants, service connections, wells, pumps, reservoirs, tanks, treatment plants, and other appurtenances of a waterworks system.\n(d) \"Sanitary sewer\" means sanitary sewer systems, including sewage treatment works, disposal systems, and other facilities for disposing of sewage, industrial waste, or other wastes.\n(e) \"Storm sewer\" means storm sewer systems, including mains, holding areas and ponds, and other appurtenances and related facilities for the collection and disposal of stormwater.\n(f) \"Facilities\" means and includes waterworks, sanitary sewer and storm sewer systems, or any portion or portions thereof.\nAny municipality may build, construct, reconstruct, repair, enlarge, improve, or in any other manner obtain facilities, and maintain and operate the facilities inside or outside its corporate limits, and acquire by gift, purchase, lease, condemnation, or otherwise any and all land and easements required for that purpose. The authority hereby granted is in addition to all other powers with reference to the facilities otherwise granted by the laws of this state or by the charter of any municipality. The authority regarding storm sewers granted to municipalities which have territory within a watershed which has adopted a watershed plan pursuant to section 103B.231 shall be exercised, with respect to facilities acquired following the adoption of the watershed plan, only for facilities which are not inconsistent with the watershed plan. The authority regarding storm sewers granted to municipalities which have adopted local water management plans pursuant to section 103B.235 shall be exercised, with respect to facilities acquired following the adoption of a local plan, only for facilities which are not inconsistent with the local plan. Counties shall have the same authority granted to municipalities by this subdivision except for areas of the county organized into cities and areas of the county incorporated within a sanitary district established by special act of the legislature.\nFor the purpose of paying the cost of building, constructing, reconstructing, repairing, enlarging, improving, or in other manner obtaining the facilities or any portion of them, and of obtaining and complying with permits required by law, a municipality or county may issue and sell its general obligations, which may be made payable primarily from taxes or from special assessments to be levied to pay the cost of the facilities or from net revenues derived from facilities service charges or from other nontax revenues pledged for their payment under charter or other statutory authority, or from two or more of the sources; or it may issue special obligations, payable solely from taxes or special assessments or from revenues, or from two or more of the sources. Real estate tax revenues should be used only, and then on a temporary basis, to pay general or special obligations when the other revenues are insufficient to meet the obligations. All obligations shall be issued and sold in accordance with chapter 475. When special assessments are pledged for the payment of the obligations, they shall be authorized and issued in accordance with the provisions of chapter 429, or of the city's charter if it authorizes these obligations and the governing body determines to proceed under the charter. When net revenues are pledged to the payment of the obligations, together with or apart from taxes and special assessments, the pledge shall be made in accordance with the provisions of subdivision 3.\n(a) With respect to watershed districts, charges established under section 103D.729 for the purpose of projects under section 103D.730 may be billed and collected in a manner the district shall determine, including certification to the counties with territory within the district for collection by the counties. A county may bill and collect the charges in a manner the county board shall determine or as described in paragraph (b).\n(b) On or before October 15 in each year, the district or county board may certify to the county auditor all unpaid outstanding charges, and a description of the lands against which the charges arose. The county auditor shall extend the charges with interest not to exceed the interest rate provided for in section 279.03, subdivision 1, upon the tax rolls of the county for the taxes of the year in which the charge is filed. For each year ending October 15 the charge with interest shall be carried into the tax becoming due and payable in January of the following year, and shall be enforced and collected in the manner provided for the enforcement and collection of real property taxes. The charges, if not paid, shall become delinquent and subject to the same penalties and the same rate of interest as real property taxes.\n(c) Any individual may appeal the charges under section 103D.535.\n(a) To pay for the construction, reconstruction, repair, enlargement, improvement, or other obtainment, the maintenance, operation and use of the facilities, and of obtaining and complying with permits required by law, the governing body of a municipality or county may impose just and equitable charges for the use and for the availability of the facilities and for connections with them and make contracts for the charges as provided in this section. The charges may be imposed with respect to facilities made available by agreement with other municipalities, counties or private corporations or individuals, as well as those owned and operated by the municipality or county itself.\n(b) Notwithstanding local charter restrictions, charges made for service rendered shall be as nearly as possible proportionate to the cost of furnishing the service.\nSanitary sewer charges may be fixed:\n(1) on the basis of water consumed; or\n(2) by reference to a reasonable classification of the types of premises to which service is furnished; or\n(3) by reference to the quantity, pollution qualities and difficulty of disposal of sewage produced; or\n(4) on any other equitable basis including any combination of equitable bases referred to in clauses (1) to (3), but specifically excluding use of the basis referred to in subdivision 3b, clause (1); and otherwise without limit.\nStorm sewer charges may be fixed:\n(1) by reference to the square footage of the property charged, adjusted for a reasonable calculation of the stormwater runoff; or\n(2) by reference to a reasonable classification of the types of premises to which service is furnished; or\n(3) by reference to the quantity, pollution qualities, and difficulty of disposal of stormwater runoff produced; or\n(4) on any other equitable basis, including any combination of equitable bases referred to in clauses (1) to (3), but specifically excluding use of the basis referred to in subdivision 3a, clause (1); and otherwise without limit.\n(a) Minimum charges for the availability of water or sewer service may be imposed for all premises abutting on streets or other places where municipal or county water mains or sewers are located, whether or not connected to them.\n(b) Minimum charges or user charges collected for waterworks, sanitary sewers, or storm sewers must be used only to pay for items for which charges are authorized in subdivision 3.\nCharges for connections to the facilities may in the discretion of the governing body be fixed by reference to the portion of the cost of connection which has been paid by assessment of the premises to be connected, in comparison with other premises, as well as the cost of making or supervising the connection.\nThe governing body may make the charges a charge against the owner, lessee, occupant or all of them and may provide and covenant for certifying unpaid charges to the county auditor with taxes against the property served for collection as other taxes are collected.\nThe governing body may fix and levy taxes for the payment of reasonable charges to the municipality or county itself for the use and availability of the facilities for fire protection, for maintaining sanitary conditions, and for proper stormwater drainage in and for public buildings, parks, streets, and other public places.\nIn determining the reasonableness of the charges to be imposed, the governing body may give consideration to all costs of the establishment, operation, maintenance, depreciation and necessary replacements of the system, and of improvements, enlargements and extensions necessary to serve adequately the territory of the municipality or county including the principal and interest to become due on obligations issued or to be issued and the costs of obtaining and complying with permits required by law.\nWhen net revenues have been appropriated to the payment of the cost of the establishment, or of any specified replacement, improvement, enlargement or extension, or to pay the principal and interest due on obligations to be issued for such purpose, no charges imposed to produce net revenues adequate for the purpose shall be deemed unreasonable by virtue of the fact that the project to be financed has not been commenced or completed, if proceedings for it are taken with reasonable dispatch and the project, when completed, may be expected to make service available to the premises charged which will have a value reasonably commensurate with the charges.\nAll charges, when collected, and all moneys received from the sale of any facilities or equipment or any by-products, shall be placed in a separate fund, and used first to pay the normal, reasonable and current costs of operating and maintaining the facilities.\nThe net revenues received in excess of the costs may be pledged by resolutions of the governing body, or may be used though not so pledged, for the payment of principal and interest on obligations issued as provided in subdivision 2, or to pay the portion of the principal and interest as may be directed in the resolutions, and net revenues derived from any facilities of the types listed in subdivision 1a, whether or not financed by the issuance of the obligations, may be pledged or used to pay obligations issued for other facilities of the same types.\nIn resolutions authorizing the issuance of either general or special obligations and pledging net revenues to them, the governing body may make covenants for the protection of holders of the obligations and taxpayers of the municipality or county as it deems necessary, including, but without limitation, a covenant that the municipality or county will impose and collect charges of the nature authorized by this section at the times and in the amounts required to produce, together with any taxes or special assessments designated as a primary source of payment of the obligations, net revenues adequate to pay all principal and interest when due on the obligations and to create and maintain reserves securing the payments as may be provided in the resolutions.\nWhen a covenant is made it shall be enforceable by appropriate action on the part of any holder of the obligations or any taxpayer of the municipality or county in a court of competent jurisdiction, and the obligations shall be deemed to be payable wholly from the income of the system whose revenues are so pledged, within the meaning of sections 475.51 and 475.58.\nThe governing body of a municipality or county may also levy assessments against property within the municipal or county limits benefited by the facilities under the procedure authorized by law or charter with reference to other assessments for benefits of local improvements, may transfer and use for the purposes hereof surplus funds of the municipality or county not specifically dedicated to another purpose, and may levy taxes on property within the municipal or county limits for the purposes. A municipality or county may contract with any person, company or corporation for the purposes and under the restrictions set forth in subdivision 5. The contract shall be binding upon the parties to it for the full term agreed upon but in no event more than 30 years, and shall not be changed by either party without the consent of the other party.\nA municipality or county may permit a person, company or corporation located and doing business inside or outside the municipal or county limits to connect with the facilities and make use of them upon terms and upon the payment of fees and charges as may be prescribed or contracted for by the municipality or county, and to contract with a person, company or corporation for the payment by the person, company or corporation of a part of the cost of construction, maintenance or use of the facilities and to receive from the person, company or corporation doing business inside or outside the municipal or county limits payment in cash or installments of the portion of the cost of the construction, maintenance or use as may be agreed upon or contracted for with the municipality or county and devote the money received to the purpose of the construction, maintenance or use. The proportionate cost of construction, maintenance or use of the facilities to be paid by the person, company, or corporation may be made payable in installments due at not greater than annual intervals for a period not to exceed 30 years. A person, company or corporation which may pay part of the cost of construction, maintenance or use of the facilities in the manner described, shall have the right to use the facilities for the disposal or treatment of sewage, industrial waste, or other wastes, by the municipality or county upon the payment of reasonable charges for the use of the facilities or the charges contracted for in case there is a contract as provided in this subdivision. A municipality or county may contract with another municipality or county for the joint or cooperative obtainment or use of such facilities without limitation of time.\nMS 1961 [Repealed, 1963 c 696 s 4]",
	"repealed": false
}