{
	"id": "103D.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.251",
	"title": "103D.251 WATERSHED DISTRICT BOUNDARY CHANGES.",
	"text": "The boundaries of a watershed district as established or changed must define contiguous areas. The boundaries may include all or part of one or more watersheds or counties.\nThe boundaries of a watershed district may be changed as provided in this section, and for a watershed district entirely within the metropolitan area the boundary may also be changed as provided in sections 103B.215 and 103B.225.\nA proceeding to change the boundary of a watershed district must be initiated by a petition to the board requesting the boundary change.\nA petition for a watershed district boundary change must state:\n(1) the names of watershed districts affected by the proposed boundary changes;\n(2) a description, in general terms, of the property affected by the proposed boundary change;\n(3) reasons why the proposed boundary change would benefit the affected watershed districts;\n(4) by illustration in a map, the proposed boundary change, including watershed districts affected by the proposed boundary change; and\n(5) a request for the board to establish the proposed boundary change.\n(a) A petition for a watershed boundary change must be signed by:\n(1) at least one-half of the counties within the proposed watershed district if the boundary change were adopted;\n(2) counties having at least 50 percent of the area within the proposed watershed district if the boundary change were adopted;\n(3) a majority of the cities within the proposed watershed district if the boundary change were adopted;\n(4) at least 50 resident owners or 50 percent of resident owners, whichever is less, in the area to be added or removed by the proposed boundary change if it were adopted, excluding resident owners within the corporate limits of a city, if the city has signed the petition; or\n(5) the managers of a watershed district affected by the proposed boundary change.\n(b) The managers must pass a resolution authorizing the boundary change before the managers sign a petition for a boundary change.\nThe board must set a time and location for a hearing and give notice of the hearing in the same manner as an establishment hearing. The board must also give notice of the hearing by mail at least ten days before the hearing to the watershed district affected by the proposed boundary change. If a petition for a boundary change involves a common boundary of two or more watershed districts, the board must determine the watershed district where the hearing will be held.\n(a) After the hearing on the petition for a boundary change, the board must establish the proposed boundary change, by order, if the board determines that establishment of the proposed boundary change would benefit the public welfare and public interest and the proposed boundary change would advance the purpose of this chapter.\n(b) In the order establishing the boundary change, the board must include:\n(1) the findings of the board supporting its determination to establish the boundary change; and\n(2) the boundaries of watershed districts affected by the boundary change.\n(c) The board must file a certified copy of the findings and order establishing the boundary change with the secretary of state and, at the same time, mail a copy of the order to the auditors of counties affected by the change, the commissioner, the director, and the managers of watershed districts affected by the change.\n(d) The boundary change is effective the day the certified order establishing the boundary change is filed with the secretary of state.\nIf the board determines that a watershed district boundary change would not benefit the public welfare and public interest or would not serve the purposes of this chapter, the board must, by order, dismiss proceedings to change a watershed district boundary. A copy of the order dismissing the boundary change proceedings must be mailed to auditors of counties affected by the proposed boundary change, the commissioner, the director, and the boards of managers of watershed districts affected by the proposed boundary change.",
	"repealed": false
}