{
	"id": "79.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.38",
	"title": "79.38 PLAN OF OPERATION.",
	"text": "The plan of operation shall provide for all of the following:\n(a) the establishment of necessary facilities;\n(b) the management and operation of the reinsurance association;\n(c) a preliminary premium, payable by each member in proportion to its total premium in the year preceding the inauguration of the reinsurance association, for initial expenses necessary to commence operation of the reinsurance association;\n(d) procedures to be utilized in charging premiums, including adjustments from excess or deficient premiums from prior periods;\n(e) procedures governing the actual payment of premiums to the reinsurance association;\n(f) reimbursement of each member of the board by the reinsurance association for actual and necessary expenses incurred on reinsurance association business;\n(g) the composition, terms, compensation and other necessary rules consistent with section 79.37 for boards of directors of the reinsurance association;\n(h) the investment policy of the reinsurance association; and\n(i) any other matters required by or necessary to effectively implement sections 79.34 to 79.40.\nIf the reinsurance association is incorporated pursuant to chapter 317A, the plan of operation shall be filed with and accepted by the secretary of state as the corporation's articles of incorporation and bylaws. The plan of operation shall be valid as articles of incorporation and bylaws under chapter 317A, notwithstanding that one or more of the required provisions for articles and bylaws under chapter 317A is not included or requirements of form are not followed.\n(a) Procedure with members' ratification. The plan of operation may be amended, in whole or in part, as follows: proposal of an amendment by a member of the board and adoption by a majority vote of the board at a meeting duly called for that purpose, ratification by a majority vote of the members at any annual meeting or special meeting duly called for that purpose, and approval of the commissioner of labor and industry, provided that an amendment shall be deemed approved 30 days after the day following the date of ratification by the members if not sooner disapproved by written order of the commissioner.\n(b) Emergency board power to amend with delayed members' ratification. The board shall have emergency powers to amend the plan at a meeting duly called for that purpose, without ratification by the members; provided that a meeting of members shall be scheduled to consider ratification of the amendment within 90 days.\n(c) Commissioner's power to amend. If the board proposes an amendment which the members decline to ratify, the commissioner of labor and industry is authorized, upon request of the board, to amend the plan as proposed by the board when the commissioner determines that failure to adopt the proposed amendment may seriously impair the ability of the reinsurance association to meet its financial obligations.\n(d) Delegation of authority to ratify. By a majority vote, the members, voting in person, or by proxy if authorized by the board, at a meeting duly called for that purpose, may authorize the board to exercise the power of amendment of the plan without ratification by the members. When the members have authorized the board to amend the plan without ratification by the members, the board may, by a majority vote of the directors, amend the plan, provided that notice of the meeting and of the proposed amendment shall be given to each director and officer, including the commissioner of labor and industry. By a majority vote, the members, voting in person, or by proxy if authorized by the board, at a meeting duly called for that purpose, may prospectively revoke the authority of the board to amend the plan without ratification by the members.",
	"repealed": false
}