{
	"id": "152.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.22",
	"title": "152.22 DEFINITIONS.",
	"text": "For purposes of sections 152.22 to 152.37, the terms defined in this section have the meanings given them.\n[See Note.]\n\"Commissioner\" means the commissioner of health.\n[See Note.]\nMS 2022 [Repealed, 2024 c 121 art 2 s 154]\n\"Health care practitioner\" means a Minnesota licensed doctor of medicine, a Minnesota licensed physician assistant, or a Minnesota licensed advanced practice registered nurse who has the primary responsibility for the care and treatment of the qualifying medical condition of a person diagnosed with a qualifying medical condition.\n[See Note.]\n\"Health records\" means health records as defined in section 144.291, subdivision 2, paragraph (c).\n[See Note.]\n\"Hemp\" has the meaning given to industrial hemp in section 18K.02, subdivision 3.\n[See Note.]\n\"Hemp grower\" means a person licensed by the commissioner of agriculture under chapter 18K to grow hemp for commercial purposes.\n[See Note.]\n\"Hemp processor\" means a person or business licensed by the commissioner of agriculture under chapter 18K to convert raw hemp into a product.\n\"Indian lands\" means all lands within the limits of any Indian reservation within the boundaries of Minnesota and any lands within the boundaries of Minnesota, title to which are either held in trust by the United States or over which an Indian Tribe exercises governmental power.\n(a) \"Medical cannabis\" means any species of the genus cannabis plant, or any mixture or preparation of them, including whole plant extracts and resins, and is delivered in the form of:\n(1) liquid, including, but not limited to, oil;\n(2) pill;\n(3) vaporized delivery method with use of liquid or oil;\n(4) combustion with use of dried raw cannabis; or\n(5) any other method approved by the commissioner.\n(b) This definition includes any part of the genus cannabis plant prior to being processed into a form allowed under paragraph (a), that is possessed by a person while that person is engaged in employment duties necessary to carry out a requirement under sections 152.22 to 152.37 for a registered manufacturer or a laboratory under contract with a registered manufacturer. This definition also includes any hemp acquired by a manufacturer by a hemp grower as permitted under section 152.29, subdivision 1, paragraph (b).\n[See Note.]\n\"Medical cannabis manufacturer\" or \"manufacturer\" means an entity registered by the commissioner to cultivate, acquire, manufacture, possess, prepare, transfer, transport, supply, or dispense medical cannabis, delivery devices, or related supplies and educational materials.\n[See Note.]\n\"Medical cannabis product\" means any delivery device or related supplies and educational materials used in the administration of medical cannabis for a patient with a qualifying medical condition enrolled in the registry program.\n[See Note.]\n\"Patient\" means a Minnesota resident who has been diagnosed with a qualifying medical condition by a health care practitioner and who has otherwise met any other requirements for patients under sections 152.22 to 152.37 to participate in the registry program under sections 152.22 to 152.37.\n[See Note.]\n\"Patient registry number\" means a unique identification number assigned by the commissioner to a patient enrolled in the registry program.\n[See Note.]\n\"Registered designated caregiver\" means a person who:\n(1) is at least 18 years old;\n(2) has been approved by the office to assist a patient who requires assistance in administering medical cannabis or obtaining medical cannabis from a distribution facility; and\n(3) is authorized by the office to assist the patient with the use of medical cannabis.\n[See Note.]\n\"Registry program\" means the patient registry established in sections 152.22 to 152.37.\n[See Note.]\n\"Registry verification\" means the verification provided by the commissioner that a patient is enrolled in the registry program and that includes the patient's name, registry number, and, if applicable, the name of the patient's registered designated caregiver or parent, legal guardian, or spouse.\n[See Note.]\n\"Qualifying medical condition\" means either a medical condition for which an individual's health care practitioner has recommended, approved, or authorized the use of cannabis by that individual to treat the condition, or a diagnosis of any of the following conditions:\n(1) Alzheimer's disease;\n(2) autism spectrum disorder that meets the requirements of the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association;\n(3) cancer, if the underlying condition or treatment produces one or more of the following:\n(i) severe or chronic pain;\n(ii) nausea or severe vomiting; or\n(iii) cachexia or severe wasting;\n(4) chronic motor or vocal tic disorder;\n(5) chronic pain;\n(6) glaucoma;\n(7) human immunodeficiency virus or acquired immune deficiency syndrome;\n(8) intractable pain as defined in section 152.125, subdivision 1, paragraph (c);\n(9) obstructive sleep apnea;\n(10) post-traumatic stress disorder;\n(11) Tourette's syndrome;\n(12) amyotrophic lateral sclerosis;\n(13) seizures, including those characteristic of epilepsy;\n(14) severe and persistent muscle spasms, including those characteristic of multiple sclerosis;\n(15) inflammatory bowel disease, including Crohn's disease;\n(16) irritable bowel syndrome;\n(17) obsessive-compulsive disorder;\n(18) sickle cell disease; or\n(19) terminal illness, with a probable life expectancy of under one year, if the illness or its treatment produces one or more of the following:\n(i) severe or chronic pain;\n(ii) nausea or severe vomiting; or\n(iii) cachexia or severe wasting.\n[See Note.]\n\"Tribal medical cannabis board\" means an agency established by each federally recognized Tribal government and duly authorized by that Tribe's governing body to perform regulatory oversight and monitor compliance with a Tribal medical cannabis program and applicable regulations.\n\"Tribal medical cannabis program\" means a program established by a federally recognized Tribal government within the boundaries of Minnesota regarding the commercial production, processing, sale or distribution, and possession of medical cannabis and medical cannabis products.\n\"Tribal medical cannabis program manufacturer\" means an entity designated by a Tribal medical cannabis board within the boundaries of Minnesota or a federally recognized Tribal government within the boundaries of Minnesota to engage in production, processing, and sale or distribution of medical cannabis and medical cannabis products under that Tribe's Tribal medical cannabis program.\n\"Tribal medical cannabis program patient\" means a person who possesses a valid registration verification card or equivalent document that is issued under the laws or regulations of a Tribal Nation within the boundaries of Minnesota and that verifies that the person is enrolled in or authorized to participate in that Tribal Nation's Tribal medical cannabis program.\n\"Veteran\" means an individual who satisfies the requirements in section 197.447.",
	"repealed": false
}