{
	"id": "80F.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/80F.14",
	"title": "80F.14 ASSIGNMENT.",
	"text": "If a dealer leases a facility under a marketing agreement with the supplier or its affiliate, the provisions of this subdivision apply. A supplier shall not unreasonably withhold or delay its consent to any assignment or transfer of a marketing agreement. The dealer may assign the marketing agreement to another person that meets the reasonable standards of the supplier. A dealer who intends to assign the marketing agreement shall give the other party notice of the proposed assignment and shall identify the proposed assignee. At the time of serving notice of assignment, a dealer shall promptly provide, at the request of the other party, personal and financial data that is reasonably necessary to determine whether the assignment should be honored. If the supplier who is requested to approve the assignment believes in good faith that reasonable cause exists for refusing to honor the assignment, that person shall inform the dealer of the denial and the reasons for denial within 60 days of receiving the notice of assignment. A supplier may condition assignment upon the agreement of the dealer who intends to assign and the other assignee to be bound by all terms and conditions of the existing marketing agreement.\nIf a marketing agreement does not involve the lease of the facility by the dealer from the supplier, the agreement shall be freely assignable by the dealer or the supplier, provided that such assignment does not increase the burdens or obligations of the other party. A supplier may require an assignee to make reasonable and adequate credit arrangements for the payment of product delivered. If the assigning dealer has an incentive obligation to the supplier, the assigning dealer either shall obtain the consent of the supplier to the proposed assignment, which consent shall not be unreasonably withheld, or shall provide reasonable and adequate security for the benefit of the supplier to assure that the assignor's incentive obligation to the supplier is met by the assignee dealer.",
	"repealed": false
}