{
	"id": "268B.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.15",
	"title": "268B.15 COLLECTION OF PREMIUMS.",
	"text": "Any amount due from an employer, as computed by the commissioner, is presumed to be correctly determined and assessed, and the burden is upon the employer to show its incorrectness. A statement by the commissioner of the amount due is admissible in evidence in any court or administrative proceeding and is prima facie evidence of the facts in the statement.\n(a) Any payment received from an employer must be applied in the following order:\n(1) family and medical leave premiums under this chapter; then\n(2) interest on past due premiums; then\n(3) penalties, late fees, administrative service fees, and costs.\n(b) Paragraph (a) is the priority used for all payments received from an employer, regardless of how the employer may designate the payment to be applied, except when:\n(1) there is an outstanding lien and the employer designates that the payment made should be applied to satisfy the lien;\n(2) the payment is specifically designated by the employer to be applied to an outstanding overpayment of benefits of an applicant;\n(3) a court or administrative order directs that the payment be applied to a specific obligation;\n(4) a preexisting payment plan provides for the application of payment; or\n(5) the commissioner, under the compromise authority of section 268B.16, agrees to apply the payment to a different priority.\nOnly if an employer fails to make all necessary records available for an audit under section 268B.21 and the commissioner has reason to believe the employer has not reported all the required wages on the quarterly wage detail reports, may the commissioner then estimate the amount of premium due and assess the employer the estimated amount due.\n(a) Any employer and any applicant subject to section 268B.185, subdivision 2, that fails to pay any amount when due under this chapter is liable for any filing fees, recording fees, sheriff fees, costs incurred by referral to any public or private collection agency, or litigation costs, including attorney fees, incurred in the collection of the amounts due.\n(b) If any tendered payment of any amount due is not honored when presented to a financial institution for payment, any costs assessed the department by the financial institution and a fee of $25 must be assessed to the person.\nIf any amounts due from an employer under this chapter are not received on the date due, the commissioner must assess interest on any amount that remains unpaid. Interest is assessed at the rate of one percent per month or any part of a month. Interest is not assessed on unpaid interest. Interest collected under this subdivision is credited to the account.\nRegardless of section 549.09, if a judgment is entered upon any past due amounts from an employer under this chapter, the unpaid judgment bears interest at the rate specified in subdivision 5 until the date of payment.\n(a) If an employer makes an application for a credit adjustment of any amount paid under this chapter within four years of the date that the payment was due, in a manner and format prescribed by the commissioner, and the commissioner determines that the payment or any portion thereof was erroneous, the commissioner must make an adjustment and issue a credit without interest. If a credit cannot be used, the commissioner must refund, without interest, the amount erroneously paid. The commissioner, on the commissioner's own motion, may make a credit adjustment or refund under this subdivision.\n(b) Any refund returned to the commissioner is considered unclaimed property under chapter 345.\n(c) If a credit adjustment or refund is denied in whole or in part, a determination of denial must be sent to the employer by mail or electronic transmission.\n(d) If an employer receives a credit adjustment or refund under this section, the employer must determine the amount of any overpayment attributable to a deduction from employee wages under section 268B.14, subdivision 3, and return any amount erroneously deducted to each affected employee.\n[See Note.]\nIn the event of any distribution of an employer's assets according to an order of any court, including any receivership, assignment for benefit of creditors, adjudicated insolvency, or similar proceeding, premiums then or thereafter due must be paid in full before all other claims except claims for wages of not more than $1,000 per former employee, earned within six months of the commencement of the proceedings. In the event of an employer's adjudication in bankruptcy under federal law, premiums then or thereafter due are entitled to the priority provided in that law for taxes due in any state.",
	"repealed": false
}