{
	"id": "290.0133",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0133",
	"title": "290.0133 CORPORATIONS; ADDITIONS TO FEDERAL TAXABLE INCOME.",
	"text": "(a) For the purposes of this section, \"addition\" means an amount that must be added to federal taxable income in computing net income for the taxable year to which the amount relates.\n(b) The additions in this section apply to corporations other than S corporations.\n(c) Unless specifically indicated or unless the context clearly indicates otherwise, only amounts that were deducted or excluded in computing federal taxable income are an addition under this section.\nThe amount of any deduction taken for income, excise, or franchise taxes based on net income or related minimum taxes, including but not limited to the tax imposed under section 290.0922, paid by the corporation to Minnesota, another state, a political subdivision of another state, the District of Columbia, or any foreign country or possession of the United States, is an addition.\nInterest upon obligations of: the United States, its possessions, its agencies, or its instrumentalities; the state of Minnesota or any other state, any of its political or governmental subdivisions, any of its municipalities, or any of its governmental agencies or instrumentalities; the District of Columbia; or Indian tribal governments is an addition.\nExempt-interest dividends received as defined in section 852(b)(5) of the Internal Revenue Code are an addition.\nThe amount of any net operating loss deduction under section 172 or 832(c)(10) of the Internal Revenue Code or operations loss deduction under section 810 of the Internal Revenue Code is an addition.\nThe amount of any special deductions under sections 241 to 247, and 250, of the Internal Revenue Code is an addition.\nLosses from the business of mining, as defined in section 290.05, subdivision 1, clause (a), that are not subject to Minnesota franchise tax are an addition.\nThe amount of any capital losses under sections 1211 and 1212 of the Internal Revenue Code is an addition.\nThe amount of percentage depletion under sections 611 through 614 and 291 of the Internal Revenue Code is an addition.\nThe amount of a partner's pro rata share of net income which does not flow through to the partner because the partnership elected to pay the tax on the income under section 6242(a)(2) of the Internal Revenue Code is an addition.\n80 percent of the depreciation deduction allowed under section 168(k)(1)(A) and (k)(4)(A) of the Internal Revenue Code is an addition. For purposes of this subdivision, if the taxpayer has an activity that in the taxable year generates a deduction for depreciation under section 168(k)(1)(A) and (k)(4)(A) and the activity generates a loss for the taxable year that the taxpayer is not allowed to claim for the taxable year, \"the depreciation allowed under section 168(k)(1)(A) and (k)(4)(A)\" for the taxable year is limited to excess of the depreciation claimed by the activity under section 168(k)(1)(A) and (k)(4)(A) over the amount of the loss from the activity that is not allowed in the taxable year. In succeeding taxable years when the losses not allowed in the taxable year are allowed, the depreciation under section 168(k)(1)(A) and (k)(4)(A) is allowed.\n(a) For property placed in service in taxable years beginning before January 1, 2020, except for qualifying depreciable property, 80 percent of the amount by which the deduction allowed under the dollar limits of section 179 of the Internal Revenue Code exceeds the deduction allowable by section 179 of the Internal Revenue Code, as amended through December 31, 2003, is an addition.\n(b) For purposes of this subdivision, \"qualifying depreciable property\" means:\n(1) property for which a depreciation deduction is allowed under section 167 of the Internal Revenue Code; and\n(2) property received as part of an exchange that qualifies for gain or loss recognition deferral under section 1031 of the Internal Revenue Code of 1986, as amended through December 16, 2016, but that does not qualify for gain or loss recognition deferral under section 1031 of the Internal Revenue Code of 1986, as amended through December 31, 2018.\nMS 2018 [Repealed, 1Sp2019 c 6 art 1 s 74]\nMS 2018 [Repealed, 1Sp2019 c 6 art 1 s 74]\nFor any taxable year beginning after December 31, 2018, and before January 1, 2021, the amount of business interest deducted under the special rule in section 163(j)(10)(A) and (B) of the Internal Revenue Code of 1986, as amended through December 15, 2022, is an addition. Entities that are part of a combined reporting group under the unitary rules in section 290.17, subdivision 4, must compute deductions and additions as required under section 290.34, subdivision 5.",
	"repealed": false
}