{
	"id": "168A.1501",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.1501",
	"title": "168A.1501 SCRAPPED, DISMANTLED, OR DESTROYED VEHICLE.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Law enforcement agency\" or \"agency\" means a duly authorized municipal, county, state, or federal law enforcement agency.\n(c) \"Person\" means an individual, partnership, limited partnership, limited liability company, corporation, or other entity.\n(d) \"Scrap vehicle\" means a motor vehicle purchased primarily as scrap, for its reuse or recycling value as raw metal, or for dismantling for parts.\n(e) \"Scrap vehicle operator\" or \"operator\" means the following persons who engage in a transaction involving the purchase or acquisition of a scrap vehicle: scrap metal processors licensed under section 168.27, subdivision 1a, paragraph (c); used vehicle parts dealers licensed under section 168.27, subdivision 1a, paragraph (d); scrap metal dealers under section 325E.21; and junk yards under section 471.925.\n(f) \"Motor vehicle\" has the meaning given in section 169.011, subdivision 42.\n(g) \"Proof of identification\" means a driver's license, Minnesota identification card number, or other identification document issued for identification purposes by any state, federal, or foreign government if the document includes the person's photograph, full name, birth date, and signature.\n(h) \"Seller\" means any seller, prospective seller, or agent of the seller.\n(a) Every scrap vehicle operator, including an agent, employee, or representative of the operator, shall create a permanent record written in English, using ink or an electronic record program, as appropriate, at the time of each purchase or acquisition of a scrap vehicle. The record must include:\n(1) the vehicle identification number; license plate number, if any, including state of issue and month and year of validation; and vehicle make, model, and color;\n(2) the date, time, and place of the receipt of the vehicle purchased or acquired and a unique transaction identifier;\n(3) a photocopy or electronic scan of the seller's proof of identification including the identification number;\n(4) the amount paid and the number of the check or electronic transfer used to purchase the vehicle;\n(5) the license plate number and description of the vehicle used by the person when delivering the scrap vehicle, including the vehicle make and model, and any identifying marks on the vehicle, such as a business name, decals, or markings, if applicable;\n(6) a statement signed by the seller, under penalty of perjury as provided in section 609.48, attesting that the scrap vehicle is not stolen and is free of any liens or encumbrances and the seller has the right to sell it;\n(7) a copy of the title, if any, provided by the seller of a motor vehicle or, if no title is provided, documentation required under (i) subdivision 8, clause (3), item (i), or (ii) subdivision 9, paragraph (a), clause (3), item (i); and\n(8) a copy of the receipt, which must include at least the following information: the name and address of the operator; the date and time the scrap vehicle was received by the operator; an accurate description of the scrap vehicle; and the amount paid for the scrap vehicle.\n(b) The record, as well as the scrap vehicle purchased or received, shall at all reasonable times be open to the inspection of any properly identified law enforcement officer.\n(c) No record is required for property purchased from manufacturers, salvage pools, merchants operating under a contract with a scrap vehicle operator, insurance companies, rental car companies, financial institutions, charities, dealers licensed under section 168.27, or wholesale dealers, having an established place of business, or of any goods purchased at open sale from any bankrupt stock, but a receipt as required under paragraph (a), clause (8), shall be obtained and kept by the person, which must be shown upon demand to any properly identified law enforcement officer.\n(d) The operator must provide a copy of the receipt required under paragraph (a), clause (8), to the seller in every transaction.\n(e) Law enforcement agencies in the jurisdiction where an operator is located may conduct regular and routine inspections to ensure compliance, refer violations to the city or county attorney for criminal prosecution, and notify the registrar of motor vehicles.\n(f) Except as otherwise provided in this section, a scrap vehicle operator or the operator's agent, employee, or representative may not disclose personal information concerning a customer without the customer's consent unless the disclosure is required by law or made in response to a request from a law enforcement agency. A scrap vehicle operator must implement reasonable safeguards to protect the security of the personal information and prevent unauthorized access to or disclosure of the information. For purposes of this paragraph, \"personal information\" is any individually identifiable information gathered in connection with a record under paragraph (a).\nRecords required to be maintained by subdivision 2 shall be retained by the scrap vehicle operator for a period of three years, and a dealer licensed under section 168.27 shall maintain records and information as required under section 168A.11, subdivision 3.\n(a) Except as provided in paragraph (b), a scrap vehicle operator or the operator's agent, employee, or representative shall pay for all scrap vehicle purchases only by check or electronic transfer.\n(b) For purchase of a scrap vehicle without a title, payment shall be made only by check or by electronic transfer of funds to a bank account. Checks shall be payable only to the individual providing proof of identification at the time of purchase. The operator shall retain a record of the mailing address or unique transaction identifier for a period of three years and such information shall at all reasonable times be open for inspection by a properly identified law enforcement officer.\n(c) This subdivision does not apply to transactions under subdivision 2, paragraph (c).\nMS 2014 [Repealed, 2015 c 65 art 3 s 38]\nMS 2014 [Repealed, 2015 c 65 art 3 s 38]\nThe following entities must submit information on the purchase or acquisition of a scrap vehicle to the National Motor Vehicle Title Information System, established pursuant to United States Code, title 49, section 30502, by the close of business the following day:\n(1) an operator who is not licensed under section 168.27; and\n(2) an operator who purchases a scrap vehicle under subdivision 9.\nExcept as provided in subdivisions 8, 9, and 10, no person shall purchase a scrap vehicle unless the seller:\n(1) provides the vehicle title and lien releases, if the vehicle is subject to any liens, or an official bill of sale issued by a public impound lot, each listing the vehicle identification number;\n(2) provides proof of identification; and\n(3) signs a statement, under penalty of perjury as provided in section 609.48, attesting that the motor vehicle is not stolen and is free of any liens or encumbrances and that the seller has the right to sell the motor vehicle.\nIf the provisions of subdivision 7 are not met, an operator may purchase a scrap vehicle if:\n(1) the operator is a dealer licensed under section 168.27;\n(2) the vehicle has a manufacturer's designated model year equal to or less than the tenth year immediately preceding the current calendar year; and\n(3) the seller:\n(i) provides printed documentation from the commissioner that the vehicle has not been registered for more than seven years;\n(ii) provides proof of identification; and\n(iii) signs a statement, under penalty of perjury as provided in section 609.48, attesting that the motor vehicle is not stolen and is free of any liens or encumbrances and that the seller has the right to sell the motor vehicle.\n(a) If the provisions of subdivision 7 are not met, an operator may purchase a scrap vehicle if:\n(1) the operator is a used vehicle parts dealer licensed under section 168.27;\n(2) the vehicle is being purchased for dismantling for its parts; and\n(3) the seller:\n(i) agrees in writing to a sale with a seven-day hold period;\n(ii) provides proof of identification; and\n(iii) signs a statement, under penalty of perjury as provided in section 609.48, attesting that the motor vehicle is not stolen and is free of any liens or encumbrances and that the seller has the right to sell the motor vehicle.\n(b) An operator purchasing a scrap vehicle under this subdivision shall:\n(1) hold the vehicle for a period of seven consecutive days, excluding Saturdays, Sundays, and holidays; and\n(2) not scrap, resell, dismantle, or in any way destroy the vehicle during the hold period under clause (1).\nSubdivisions 7, 8, and 9 do not apply when a scrap vehicle is:\n(1) purchased from a manufacturer, salvage pool, merchant operating under a contract with a scrap vehicle operator, insurance company, rental car company, financial institution, charity, dealer licensed under section 168.27, or wholesale dealers, having an established place of business, or of any goods purchased at open sale from any bankrupt stock; or\n(2) an inoperable motor vehicle with a manufacturer's designated model year equal to or less than the 20th year immediately preceding the current calendar year.\nA scrap vehicle operator, or the agent, employee, or representative of the operator, who intentionally violates a provision of this section, is guilty of a misdemeanor.\n(a) Whenever a law enforcement official from any agency has probable cause to believe that a scrap vehicle or motor vehicle parts in the possession of a scrap vehicle operator are stolen or evidence of a crime and notifies the operator not to sell the item, the scrap vehicle operator shall not (1) process or sell the item, or (2) remove or allow its removal from the premises. This investigative hold must be confirmed in writing by the originating agency within 72 hours and will remain in effect for 30 days from the date of initial notification, or until the investigative hold is canceled or renewed, or until a law enforcement notification to confiscate or directive to release is issued, whichever comes first.\n(b) If a scrap vehicle or motor vehicle parts are identified as stolen or evidence in a criminal case, a law enforcement official may:\n(1) physically confiscate and remove the item from the scrap vehicle operator, pursuant to a written notification;\n(2) place the item on hold or extend the hold under paragraph (a) and leave it on the premises; or\n(3) direct its release to a registered owner or owner's agent.\nWhen an item is confiscated, the person doing so shall provide identification upon request of the scrap vehicle operator, and shall provide the name and telephone number of the confiscating agency and investigator, and the case number related to the confiscation.\n(c) An operator may request seized property be returned in accordance with section 626.04.\n(d) When an investigative hold or notification to confiscate is no longer necessary, the law enforcement official or designee shall so notify the operator.\n(e) A scrap vehicle operator may process or otherwise dispose of the scrap vehicle or motor vehicle parts if:\n(1) a notification to confiscate is not issued during the investigative hold; or\n(2) a law enforcement official does not physically remove the item from the premises within 15 calendar days from issuance of a notification to confiscate.\n(f) If a scrap vehicle operator is required to hold a scrap vehicle or motor vehicle parts at the direction of law enforcement for purposes of investigation or prosecution or it is seized by law enforcement, the operator, and any other victim, shall be entitled to seek restitution against the person who delivered the item to the scrap vehicle operator in any criminal case that may arise from the investigation, including any out-of-pocket expenses for storage and lost profit.\n(a) Each scrap vehicle operator shall install and maintain at each location video surveillance cameras, still digital cameras, or similar devices positioned to record or photograph a frontal view showing a clear and readily identifiable image of the face of each seller of a scrap vehicle who enters the location. The scrap vehicle operator shall also photograph the seller's vehicle, including license plate, either by video camera or still digital camera, so that an accurate and complete description of it may be obtained from the recordings made by the cameras. Photographs and recordings must be clearly and accurately associated with their respective records.\n(b) The video camera or still digital camera must be kept in operating condition and must be shown upon request to a properly identified law enforcement officer for inspection. The camera must record and display the accurate date and time. The video camera must be turned on at all times when the location is open for business and at any other time when a scrap vehicle is purchased.\n(c) Recordings and images required by paragraph (a) shall be retained by the scrap vehicle operator for a minimum period of 60 days and shall at all reasonable times be open to the inspection of any properly identified law enforcement officer.\n(d) If the scrap vehicle operator does not purchase some or any scrap vehicles at a specific business location, the operator need not comply with this subdivision with respect to those purchases.\n(e) This subdivision does not apply to the purchase of a scrap vehicle by a used vehicle parts dealer licensed under section 168.27, for dismantling the vehicle for its parts.\nThis section preempts and supersedes any local ordinance or rule concerning the same subject matter.",
	"repealed": false
}