{
	"id": "291.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/291.03",
	"title": "291.03 RATES.",
	"text": "The tax imposed must be computed by applying to the Minnesota taxable estate the following schedule of rates and then the resulting amount multiplied by a fraction, not greater than one, the numerator of which is the value of the Minnesota gross estate plus the value of gifts under section 291.016, subdivision 2, clause (3), with a Minnesota situs, and the denominator of which is the federal gross estate plus the value of gifts under section 291.016, subdivision 2, clause (3):\n(a) For estates of decedents dying in 2017:\n(b) For estates of decedents dying in 2018 and thereafter:\nFor the purposes of this section, expenses which are deducted for federal income tax purposes under section 642(g) of the Internal Revenue Code are not allowable in computing the tax under this chapter.\n[Repealed, 2014 c 150 art 3 s 8]\n[Repealed, 2014 c 150 art 3 s 8]\n(a) For the purposes of this section, the value of the Minnesota taxable estate is determined by taking into account the deduction available under section 2056(b) of the Internal Revenue Code. An election under section 2056(b) of the Internal Revenue Code may be made for Minnesota estate tax purposes regardless of whether the election is made for federal estate tax purposes. The value of the gross estate includes the value of any property in which the decedent had a qualifying income interest for life for which an election was made under this subdivision.\n(b) Except for an election made under section 2056(b) of the Internal Revenue Code, no federal election is allowable in computing the tax under this chapter unless the estate is required to file a federal estate tax return, the election is made on the federal estate tax return, and the election is allowed under federal law.\n[Repealed, 2002 c 377 art 12 s 18]\n[Repealed, 1Sp1985 c 14 art 13 s 14]\n[Repealed, 1Sp1985 c 14 art 13 s 14]\n[Repealed, 1Sp1985 c 14 art 13 s 14]\n[Repealed, 1Sp1985 c 14 art 13 s 14]\n[Repealed, 1Sp1985 c 14 art 13 s 14]\n(a) For purposes of this section, the following terms have the meanings given in this subdivision.\n(b) \"Family member\" means a family member as defined in section 2032A(e)(2) of the Internal Revenue Code, or a trust whose present beneficiaries are all family members as defined in section 2032A(e)(2) of the Internal Revenue Code.\n(c) \"Qualified heir\" means a family member who acquired qualified property upon the death of the decedent and satisfies the requirement under subdivision 9, clause (8), or subdivision 10, clause (5), for the property.\n(d) \"Qualified property\" means qualified small business property under subdivision 9 and qualified farm property under subdivision 10.\nProperty satisfying all of the following requirements is qualified small business property:\n(1) The value of the property was included in the federal adjusted taxable estate.\n(2) The property consists of the assets of a trade or business or shares of stock or other ownership interests in a corporation or other entity engaged in a trade or business. Shares of stock in a corporation or an ownership interest in another type of entity do not qualify under this subdivision if the shares or ownership interests are traded on a public stock exchange at any time during the three-year period ending on the decedent's date of death. For purposes of this subdivision, an ownership interest includes the interest the decedent is deemed to own under sections 2036, 2037, 2038, 2040, or 2044 of the Internal Revenue Code.\n(3) During the taxable year that ended before the decedent's death, the trade or business must not have been a passive activity within the meaning of section 469(c) of the Internal Revenue Code, and the decedent or the decedent's spouse must have materially participated in the trade or business within the meaning of section 469(h) of the Internal Revenue Code, excluding section 469(h)(3) of the Internal Revenue Code and any other provision provided by United States Treasury Department regulation that substitutes material participation in prior taxable years for material participation in the taxable year that ended before the decedent's death.\n(4) The gross annual sales of the trade or business were $10,000,000 or less for the last taxable year that ended before the date of the death of the decedent.\n(5) The property does not include:\n(i) cash;\n(ii) cash equivalents;\n(iii) publicly traded securities; or\n(iv) any assets not used in the operation of the trade or business.\n(6) For property consisting of shares of stock or other ownership interests in an entity, the value of items described in clause (5) must be excluded in the valuation of the decedent's interest in the entity.\n(7) The decedent or the decedent's spouse continuously owned the property, or an undivided or joint interest in the property, including property the decedent or the decedent's spouse is deemed to own under sections 2036, 2037, 2038, 2040, or 2044 of the Internal Revenue Code, or under subdivision 1d, for the three-year period ending on the date of death of the decedent. In the case of a sole proprietor, if the property replaced similar property within the three-year period, the replacement property will be treated as having been owned for the three-year period ending on the date of death of the decedent. For the purposes of the three-year holding period under this clause, any ownership by the decedent's spouse, whether the spouse predeceases or survives the decedent, is attributed to the decedent.\n(8) For three years following the date of death of the decedent, the trade or business is not a passive activity within the meaning of section 469(c) of the Internal Revenue Code, and a family member materially participates in the operation of the trade or business within the meaning of section 469(h) of the Internal Revenue Code, excluding section 469(h)(3) of the Internal Revenue Code and any other provision provided by United States Treasury Department regulation that substitutes material participation in prior taxable years for material participation in the three years following the date of death of the decedent.\n(9) The estate and the qualified heir elect to treat the property as qualified small business property and agree, in the form prescribed by the commissioner, to pay the recapture tax under subdivision 11, if applicable.\nProperty satisfying all of the following requirements is qualified farm property:\n(1) The value of the property was included in the federal adjusted taxable estate.\n(2) The property consists of agricultural land and is owned by a person or entity that is either not subject to or is in compliance with section 500.24.\n(3) For property taxes payable in the taxable year of the decedent's death, the property is classified as class 2a property under section 273.13, subdivision 23, and is classified as agricultural homestead, agricultural relative homestead, or special agricultural homestead under section 273.124.\n(4) The decedent or the decedent's spouse continuously owned the property, or an undivided or joint interest in the property, including property the decedent or the decedent's spouse is deemed to own under sections 2036, 2037, 2038, 2040, or 2044 of the Internal Revenue Code, or under subdivision 1d, for the three-year period ending on the date of death of the decedent either by ownership of the agricultural land or pursuant to holding an interest in an entity that is not subject to or is in compliance with section 500.24. For the purposes of the three-year holding period under this clause, any ownership by the decedent's spouse, whether the spouse predeceases or survives the decedent, is attributed to the decedent.\n(5) The property is classified for property tax purposes as class 2a property under section 273.13, subdivision 23, for three years following the date of death of the decedent.\n(6) The estate and the qualified heir elect to treat the property as qualified farm property and agree, in a form prescribed by the commissioner, to pay the recapture tax under subdivision 11, if applicable.\n(a) If, within three years after the decedent's death and before the death of the qualified heir, the qualified heir disposes of any interest in the qualified property, other than by a disposition to a family member, or a family member ceases to satisfy the requirement under subdivision 9, clause (8); or 10, clause (5), an additional estate tax is imposed on the property. In the case of a sole proprietor, if the qualified heir replaces qualified small business property excluded under subdivision 9 with similar property, then the qualified heir will not be treated as having disposed of an interest in the qualified property.\n(b) The amount of the additional tax equals the amount of the exclusion claimed by the estate under subdivision 8, paragraph (d), multiplied by 16 percent.\n(c) The additional tax under this subdivision is due on the day which is six months after the date of the disposition or cessation in paragraph (a).\n(d) The tax under this subdivision does not apply to the acquisition of title or possession of the qualified property by a federal, state, or local government unit, or any other entity with the power of eminent domain for a public purpose, as defined in section 117.025, subdivision 11, within the three-year holding period.\n(e) This subdivision shall not apply as a result of any of the following:\n(1) a portion of qualified farm property consisting of less than one-fifth of the acreage of the property is reclassified as class 2b property under section 273.13, subdivision 23, and the qualified heir has not substantially altered the reclassified property during the three-year holding period; or\n(2) a portion of qualified farm property classified as class 2a property at the death of the decedent pursuant to section 273.13, subdivision 23, paragraph (a), consisting of a residence, garage, and immediately surrounding one acre of land is reclassified as class 4bb property during the three-year holding period, and the qualified heir has not substantially altered the property.",
	"repealed": false
}