{
	"id": "126C.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.43",
	"title": "126C.43 LEVIES; STATUTORY OBLIGATIONS.",
	"text": "A district may levy the amount authorized for liabilities of dissolved districts pursuant to section 123A.67.\n(a) A district may levy the amount necessary (1) to pay the district's obligations under section 268.052, subdivision 1, and (2) to pay for job placement services offered to employees who may become eligible for benefits pursuant to section 268.085 for the fiscal year the levy is certified.\n(b) Districts with a balance remaining in their reserve for reemployment as of June 30, 2003, may not expend the reserved funds for future reemployment expenditures. Each year a levy reduction must be made to return these funds to taxpayers. The amount of the levy reduction must be equal to the lesser of: (1) the remaining reserved balance for reemployment; or (2) the amount of the district's current levy under paragraph (a).\n(c) The amount in paragraph (a) must not include the amounts for hourly school employees during the period of the summer term.\nA district may levy the amount necessary to pay judgments against the district under section 123B.25 that became final after the date the district certified its proposed levy in the previous year. With the approval of the commissioner, a district may spread this levy over a period not to exceed three years. Upon approval through the adoption of a resolution by each of an intermediate district's member school district boards, a member school district may include its proportionate share of the costs of a judgment against an intermediate school district that became final under section 123B.25 after the date that the earliest member school district certified its proposed levy in the previous year. With the approval of the commissioner, an intermediate school district member school district may spread this levy over a period not to exceed three years.\nA district may levy the amounts authorized by section 123A.73.\nA district may levy the amounts necessary to pay the district's obligations under section 123A.76.\nA district may levy for severance pay required by sections 124D.05, subdivision 3, and 123A.30, subdivision 6.",
	"repealed": false
}