{
	"id": "256B.0616",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0616",
	"title": "256B.0616 MENTAL HEALTH CERTIFIED FAMILY PEER SPECIALIST.",
	"text": "Medical assistance covers mental health certified family peer specialists services, as established in subdivision 2, subject to federal approval, if provided to recipients who have an emotional disturbance or severe emotional disturbance under chapter 245, and are provided by a mental health certified family peer specialist who has completed the training under subdivision 5 and is qualified according to section 245I.04, subdivision 12. A family peer specialist cannot provide services to the peer specialist's family.\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\nFamily peer support services may be provided to recipients of inpatient hospitalization, partial hospitalization, residential treatment, children's intensive behavioral health services, day treatment, children's therapeutic services and supports, or crisis services.\nThe commissioner shall develop a process to certify family peer support specialist programs, in accordance with the federal guidelines, in order for the program to bill for reimbursable services. Family peer support programs must operate within an existing mental health community provider or center.\nThe commissioner shall develop a training and certification process for certified family peer specialists. The candidates must have raised or be currently raising a child with a mental illness, have had experience navigating the children's mental health system, and must demonstrate leadership and advocacy skills and a strong dedication to family-driven and family-focused services. The training curriculum must teach participating family peer specialists specific skills relevant to providing peer support to other parents. In addition to initial training and certification, the commissioner shall develop ongoing continuing educational workshops on pertinent issues related to family peer support counseling.",
	"repealed": false
}