{
	"id": "477B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/477B.04",
	"title": "477B.04 APPROPRIATION, PAYMENT, AND ADMINISTRATION.",
	"text": "(a) The commissioner must make payments to the Public Employees Retirement Association for deposit in the statewide volunteer firefighter fund on behalf of a municipality or independent nonprofit firefighting corporation that is a member of the statewide volunteer firefighter plan under chapter 353G. The commissioner must directly pay all other municipalities qualifying for fire state aid, except as provided in paragraph (d). The payment is equal to the amount of fire state aid apportioned to the applicable fire state aid recipient under section 477B.03.\n(b) Fire state aid is payable on October 1 annually. The amount of state aid due and not paid by October 1 accrues interest payable to the recipient at the rate of one percent for each month or part of a month that the amount remains unpaid after October 1.\n(c) If the commissioner of revenue does not receive a financial compliance report described in section 6.495, subdivision 3, for a relief association, the amount of fire state aid apportioned to a municipality or independent nonprofit firefighting corporation under section 477B.03 for that relief association must be withheld from payment to the Public Employees Retirement Association or the municipality. The commissioner of revenue must issue a withheld payment within ten business days of receipt of a financial compliance report under section 6.495, subdivision 3. The interest under paragraph (b) does not apply to a payment withheld under this paragraph.\n(d) The commissioner must make payments directly to the largest municipality in population located within any area included in a joint powers entity that does not have a designated agency under section 471.59, subdivision 3, or within the fire department service area of an eligible independent nonprofit firefighting corporation. If there is no city or town within the fire department service area of an eligible independent nonprofit firefighting corporation, fire state aid must be paid to the county where the independent nonprofit firefighting corporation is located.\nThe amount necessary to make the payments under this section and section 477B.03 is annually appropriated to the commissioner from the general fund.\n(a) This paragraph applies if the municipality or the independent nonprofit firefighting corporation is covered by the statewide volunteer firefighter plan. If this paragraph applies and the executive director of the Public Employees Retirement Association has not approved an aid allocation plan under section 477B.041, the executive director must credit the fire state aid against future municipal contribution requirements under section 353G.08 and must notify the municipality or the independent nonprofit firefighting corporation of the fire state aid so credited at least annually. If this paragraph applies and the executive director has approved an aid allocation plan under section 477B.041, the executive director must allocate fire state aid in the manner described under section 477B.041.\n(b) If (1) the municipality or the independent nonprofit firefighting corporation is not covered by the statewide volunteer firefighter plan and is affiliated with a duly incorporated firefighters relief association, (2) the relief association has filed a financial report with the municipality pursuant to section 424A.014, subdivision 1 or 2, whichever applies, and (3) there is not an aid allocation agreement under section 477B.042 in effect, then the treasurer of the municipality must, within 30 days after receipt, transmit the fire state aid to the treasurer of the relief association. If clauses (1) and (2) are satisfied and there is an aid allocation agreement under section 477B.042 in effect, then fire state aid must be transmitted as described in that section. If the relief association has not filed a financial report with the municipality, then, regardless of whether an aid allocation agreement is in effect, the treasurer of the municipality must delay transmission of the fire state aid to the relief association until the complete financial report is filed.\n(c) The treasurer of the municipality must deposit the fire state aid money in the municipal treasury if (1) the municipality or independent nonprofit firefighting corporation is not covered by the statewide volunteer firefighter plan, (2) there is no relief association organized, (3) the association has dissolved, or (4) the association has been removed as trustees of state aid. The money may be disbursed from the municipal treasury only for the purposes and in the manner set forth in section 424A.08 or for the payment of the employer contribution requirement with respect to firefighters covered by the public employees police and fire retirement plan under section 353.65, subdivision 3.\n(a) An adjustment needed to correct a fire state aid overpayment or underpayment due to a clerical error must be made to subsequent fire state aid payments as provided in paragraphs (b) and (c). The authority to correct an aid payment under this subdivision is limited to three years after the payment was issued.\n(b) If an overpayment equals more than ten percent of the most recently paid aid amount, the commissioner must reduce the aid a municipality or independent nonprofit firefighting corporation is to receive by the amount overpaid over a period of no more than three years. If an overpayment equals or is less than ten percent of the most recently paid aid amount, the commissioner must reduce the next aid payment occurring in 30 days or more by the amount overpaid.\n(c) In the event of an underpayment, the commissioner must distribute the amount of underpaid funds to the municipality or independent nonprofit firefighting corporation over a period of no more than three years. An additional distribution to a municipality or independent nonprofit firefighting corporation must be paid from the general fund and must not diminish the payments made to other municipalities or independent nonprofit firefighting corporations under this chapter.",
	"repealed": false
}