{
	"id": "61A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.31",
	"title": "61A.31 REAL ESTATE HOLDINGS.",
	"text": "Except as provided in subdivisions 2, 3, and 4, every domestic life insurance company may acquire, hold and convey real property only for the following purposes and in the following manner:\n(1) such as shall have been mortgaged to it in good faith by way of security for loans previously contracted, or for moneys due;\n(2) such as shall have been conveyed to it in satisfaction of debts previously contracted in the course of its dealings;\n(3) such as shall have been purchased at sales on judgments, decrees or mortgages obtained or made for such debts;\n(4) such as shall have been subject to a contract for deed under which the company held the vendor's interest to secure the payment by the vendee.\nIn order to promote and supplement public and private efforts to provide an adequate supply of decent, safe, and sanitary dwelling accommodations for persons of low and moderate income; to relieve unemployment; to alleviate the shortage of rental residences; and to assist in relieving the emergency in the housing situation in this country through investment of funds, any life insurance company may purchase or lease from any owner or owners (including states and political subdivisions thereof), real property in any state in which such company is licensed to transact the business of life insurance; and on any real property so acquired or on real property so located and acquired otherwise in the conduct of its business, such company may erect apartment, or other dwelling houses, not including hotels, but including accommodations for retail stores, shops, offices, and other community services reasonably incident to such projects; or, to provide such housing or accommodations, may construct, reconstruct, improve, or remove any buildings or other improvements thereon. Such company may thereafter own, improve, maintain, manage, collect or receive income from, sell, lease, or convey any such real property and the improvements thereon. A company may not invest in the building projects if the investment causes the company's aggregate investments under this subdivision to exceed ten percent of its total admitted assets.\nAny domestic life insurance company may:\n(a) acquire real property or any interest in real property, including oil and gas and other mineral interests, in the United States or any state thereof, or in the Dominion of Canada or any province thereof, as an investment for the production of income, and hold, improve or otherwise develop, and lease, sell, and convey the same either directly or as a joint venturer or through a limited, limited liability, or general partnership in which the company is a partner or through a limited liability company in which the company is a member. A company may not invest in any real property asset other than property held for the convenience and accommodation of its business if the investment causes: (1) the company's aggregate investments in the real property assets to exceed ten percent of its admitted assets; or (2) the company's investment in any single parcel of real property to exceed one-half of one percent of its admitted assets;\n(b) acquire personal property in the United States or any state thereof, or in the Dominion of Canada or any province thereof, under lease or leases or commitment for lease or leases if: (1) either the fair value of the property exceeds the company's investment in it or the lessee, or at least one of the lessees, or a guarantor, or at least one of the guarantors, of the lease is a corporation with a net worth of $1,000,000 or more; and (2) the lease provides for rent sufficient to amortize the investment with interest over the primary term of the lease or the useful life of the property, whichever is less. A company may not invest in the personal property if the investment causes the company's aggregate investments in the personal property to exceed three percent of its admitted assets;\n(c) acquire and hold real estate (1) if the purpose of the acquisition is to enhance the sale value of real estate previously acquired and held by the company under this section and (2) if the company expects the real estate so acquired to qualify and be held by the company under paragraph (a) within five years after acquisition; and\n(d) not acquire real property under paragraphs (a) to (c) if the property is to be used primarily for agricultural, horticultural, ranch, mining, or church purposes.\nAll real property acquired or held under this subdivision must be carried at a value equal to the lesser of (1) cost plus the cost of capitalized improvements, less normal depreciation, or (2) market value.\nA company may acquire and hold real estate for the convenience and accommodation of its business. Without the prior approval of the Department of Commerce, a company may not invest in real estate authorized under this subdivision if the investment causes the company's aggregate investments under this subdivision to exceed five percent of its total admitted assets, except that a health service plan corporation operating under chapter 62C may not invest in real estate authorized under this subdivision if the investment causes the company's aggregate investments under this subdivision to exceed 25 percent of its total admitted assets.",
	"repealed": false
}