{
	"id": "237.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.025",
	"title": "237.025 COMPETITIVE MARKET REGULATION.",
	"text": "(a) Except as otherwise provided in this subdivision, a \"competitive service provider\" means:\n(1) a wireless voice service provider; or\n(2) any other provider of local voice service who owns a substantial proportion of the last-mile or loop facilities delivering service to a majority of households in an exchange service area, without regard to the technology used to deliver the service.\n\"Competitive service provider\" does not include:\n(i) a provider using satellite technology;\n(ii) a wireless voice service provider who resells voice services purchased at wholesale;\n(iii) a competitive local exchange carrier, as defined in Minnesota Rules, parts 7811.0100, subpart 12, and 7812.0100, subpart 12, who does not own a substantial proportion of the last-mile or loop facilities over which they provide local voice service;\n(iv) an over-the-top VOIP provider; or\n(v) a local exchange carrier petitioning to be regulated under this section or any affiliate of the petitioning local exchange carrier.\n(b) \"Exchange service area\" has the meaning given in Minnesota Rules, part 7810.0100, subpart 15.\n(c) \"Local exchange carrier\" means a telephone company, as defined in section 237.01, subdivision 7, or the corporate successor to a telephone company, providing local telephone service pursuant to a certificate granted by the commission under section 237.16 before August 1, 1995.\n(d) \"Over-the-top VOIP provider\" means a VOIP provider that:\n(1) requires the end user to obtain broadband transmission from a third-party provider; and\n(2) has no business relationship with the provider of the Internet connection used by the VOIP provider to deliver voice service.\n(e) \"VOIP\" or \"Voice over Internet Protocol\" means any service that:\n(1) enables real-time two-way voice communications that originate from or terminate at the user's location in Internet protocol or any successor protocol; and\n(2) permits users to receive calls that originate on the public switched telephone network and terminate calls to the public switched telephone network.\n(a) A local exchange carrier may petition the commission to have its residential voice services and business voice services to customers subscribing to three or fewer business lines regulated under this section in any exchange service area in which the carrier provides local voice service. The petition must be served on the commission, the department, the Office of the Attorney General, all telephone companies and telecommunications carriers with which the local exchange carrier has an interconnection agreement, and any other person designated by the commission.\n(b) A petition filed under this subdivision must include:\n(1) a list of exchange service areas in which the local exchange carrier is seeking to be regulated under this section;\n(2) the local services offered by the local exchange carrier in each exchange service area;\n(3) a list of competitive service providers in each exchange service area;\n(4) a description of affiliate relationships the petitioning local exchange carrier has with any provider of local service in each exchange service area;\n(5) documentation demonstrating the local exchange carrier's loss of local voice service customers to unaffiliated competitive service providers in each exchange service area over, at a minimum, the previous five years;\n(6) evidence demonstrating that the local exchange carrier satisfies the competitive criteria under subdivision 4 in each exchange service area; and\n(7) other information requested by the commission that is relevant to the applicable competitive criteria under subdivision 4.\n(a) A petition by a local exchange carrier seeking to be regulated under this section shall be reviewed by the commission as provided under this subdivision.\n(b) A party objecting to a local exchange carrier's petition filed under this section must file an objection within 45 days.\n(c) If no party objects to a petitioning local exchange carrier's proposed election within 45 days of the filing of the petition, the petition is deemed approved.\n(d) If a party raises an objection to a local exchange carrier's petition, the commission must provide interested parties and the petitioning carrier an opportunity to comment on the merits of the petition.\n(e) The commission shall make a final determination regarding a petition filed under this section within 180 days of the date all information required under subdivision 2 was submitted.\n(f) In reviewing the petition, the commission may request additional information from the petitioning local exchange carrier and other service providers under the commission's jurisdiction that provide service in the relevant exchange service area.\nThe commission shall approve a petition under this section if a petitioning local exchange carrier demonstrates to the commission's satisfaction that:\n(1) it serves fewer than 50 percent of the households in an exchange service area, and at least 60 percent of households in the exchange service area can choose voice service from at least one additional unaffiliated competitive service provider; or\n(2) it serves more than 50 percent of the households in an exchange service area, and:\n(i) at least 60 percent of households in the exchange service area can choose voice service from at least one additional unaffiliated competitive service provider;\n(ii) no significant economic, technological, or other barriers to market entry and exit exist;\n(iii) no single provider has the ability to maintain prices above competitive levels for a significant period of time or otherwise deter competition; and\n(iv) the petitioning local exchange carrier will continue to offer basic local service, as defined in subdivision 8, consistent with its tariffs in effect at the time of its petition.\nThe burden of proof to show that the competitive criteria of subdivision 4 have been met shall be on the petitioning local exchange carrier.\n(a) A local exchange carrier that has received approval from the commission to be regulated under this section in one or more of its exchange service areas shall be subject to regulation in those approved exchange service areas as a telecommunications carrier under section 237.035, and as a competitive local exchange carrier under Minnesota Rules, parts 7811.2210 and 7812.2210, as applicable. Nothing in this section shall be construed to provide or imply that a local exchange carrier regulated under this section is exempted from Minnesota Statutes and Minnesota Rules applying to competitive local exchange carriers, including, but not limited to:\n(1) sections 237.50 to 237.56;\n(2) sections 237.66, 237.661, 237.663, and 237.665;\n(3) sections 237.69 to 237.71; and\n(4) Minnesota Rules, chapter 7810.\n(b) Regulation under this section is effective 30 days after a petition is deemed approved under subdivision 3 or approved by the commission under subdivision 4.\n(a) Approval of a petition for regulation under this section does not relieve an incumbent local exchange carrier of its obligation to fulfill all the terms of an existing alternative form of regulation plan under sections 237.76 to 237.774 for the duration of the plan.\n(b) Following the expiration of the alternative form of regulation plan, an incumbent local exchange carrier whose petition is approved by the commission shall be subject to applicable provisions of this section in the approved local exchange areas.\n(a) For purposes of this subdivision, \"basic local service\" means:\n(1) single party voice-grade service and touch-tone capability;\n(2) access to the public switched network;\n(3) 911 or enhanced 911 access; and\n(4) telecommunications relay service capability and access necessary to comply with state and federal regulations.\n(b) Except as provided in paragraph (d) below:\n(1) prior to January 1, 2018, basic local service rates may not be increased beyond the rates in effect on May 20, 2016;\n(2) on or after January 1, 2018, basic local service rates for residential customers and business customers subscribing to three or fewer lines may not be increased on a per month basis by more than $2.00. Any new basic local service rate established must remain in effect for a minimum of 12 months. Until December 31, 2022, basic local service rates may not exceed $25.00; or\n(3) on or after January 1, 2023, basic local service rates for residential customers and business customers subscribing to three or fewer lines may not be increased on a per month basis by more than $2.00. Any new basic local service rate established must remain in effect for a minimum of 12 months. Any rate change effective after January 1, 2023, is deemed approved 90 days after the commission's receiving notice of the rate change, unless the commission begins an investigation pursuant to Minnesota Rules, part 7811.2210, subpart 17, or 7812.2210, subpart 17, to determine if the rate will result in substantial customer harm, in which case the commission must make a final determination within 180 days of receiving notice of the rate change.\n(c) Notwithstanding any statute or rule to the contrary, basic local service rates must be uniform within an exchange service area.\n(d) The provisions of paragraph (b) shall not apply to a rate of return carrier, as defined in Code of Federal Regulations, title 47, section 54.5.\nNothing in this section affects the obligation of a local exchange carrier that petitions the commission to be regulated under this section to provide service to customers, when requested, in accordance with this chapter, commission rules, and its duly authorized tariffs.\nNothing in this section restricts, creates, expands, or otherwise affects or modifies:\n(1) any entity's obligations or rights or the commission's authority under the Federal Communications Act of 1934, United States Code, title 47, sections 251 and 252;\n(2) any commission authority or existing orders related to wholesale services;\n(3) any commission jurisdiction:\n(i) over intrastate switched access rates, terms, and conditions, including the implementation of federal law with respect to intercarrier compensation, and\n(ii) to address or affect the resolution of disputes regarding intercarrier compensation; or\n(4) the rights of any entity, or the authority of the commission and local government authorities, with respect to the use and regulation of public rights-of-way under sections 237.162 and 237.163.\nThe commission may, upon petition or on its own motion, open a proceeding to examine whether the competitive criteria in subdivision 4 continue to be met in an exchange service area in which a local exchange carrier previously received commission approval to be regulated under this section. If the commission determines that the competitive criteria are no longer met, it shall determine the appropriate level of regulation for that provider in that exchange service area.",
	"repealed": false
}