{
	"id": "290.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.06",
	"title": "290.06 RATES OF TAX; CREDITS.",
	"text": "The franchise tax imposed upon corporations shall be computed by applying to their taxable income the rate of 9.8 percent.\n[Repealed, 1990 c 604 art 2 s 21]\n[Repealed, Ex1971 c 31 art 18 s 6]\n[Repealed, Ex1967 c 32 art 14 s 12]\n[Repealed, 1980 c 419 s 46]\n(a) The income taxes imposed by this chapter upon married individuals filing joint returns and surviving spouses as defined in section 2(a) of the Internal Revenue Code must be computed by applying to their taxable net income the following schedule of rates:\n(1) On the first $38,770, 5.35 percent;\n(2) On all over $38,770, but not over $154,020, 6.8 percent;\n(3) On all over $154,020, but not over $269,010, 7.85 percent;\n(4) On all over $269,010, 9.85 percent.\nMarried individuals filing separate returns, estates, and trusts must compute their income tax by applying the above rates to their taxable income, except that the income brackets will be one-half of the above amounts after the adjustment required in subdivision 2d.\n(b) The income taxes imposed by this chapter upon unmarried individuals must be computed by applying to taxable net income the following schedule of rates:\n(1) On the first $26,520, 5.35 percent;\n(2) On all over $26,520, but not over $87,110, 6.8 percent;\n(3) On all over $87,110, but not over $161,720, 7.85 percent;\n(4) On all over $161,720, 9.85 percent.\n(c) The income taxes imposed by this chapter upon unmarried individuals qualifying as a head of household as defined in section 2(b) of the Internal Revenue Code must be computed by applying to taxable net income the following schedule of rates:\n(1) On the first $32,650, 5.35 percent;\n(2) On all over $32,650, but not over $131,190, 6.8 percent;\n(3) On all over $131,190, but not over $214,980, 7.85 percent;\n(4) On all over $214,980, 9.85 percent.\n(d) In lieu of a tax computed according to the rates set forth in this subdivision, the tax of any individual taxpayer whose taxable net income for the taxable year is less than an amount determined by the commissioner must be computed in accordance with tables prepared and issued by the commissioner of revenue based on income brackets of not more than $100. The amount of tax for each bracket shall be computed at the rates set forth in this subdivision, provided that the commissioner may disregard a fractional part of a dollar unless it amounts to 50 cents or more, in which case it may be increased to $1.\n(e) An individual who is not a Minnesota resident for the entire year must compute the individual's Minnesota income tax as provided in this subdivision. After the application of the nonrefundable credits provided in this chapter, the tax liability must then be multiplied by a fraction in which:\n(1) the numerator is the individual's Minnesota source federal adjusted gross income as defined in section 62 of the Internal Revenue Code and increased by:\n(i) the additions required under sections 290.0131, subdivisions 2, 6, 8 to 10, 16, 17, 19, and 20, and 290.0137, paragraph (a); and reduced by\n(ii) the Minnesota assignable portion of the subtraction for United States government interest under section 290.0132, subdivision 2, the subtractions under sections 290.0132, subdivisions 9, 10, 14, 15, 17, 18, 27, 31, and 32, and 290.0137, paragraph (c), after applying the allocation and assignability provisions of section 290.081, clause (a), or 290.17; and\n(2) the denominator is the individual's federal adjusted gross income as defined in section 62 of the Internal Revenue Code, increased by:\n(i) the additions required under sections 290.0131, subdivisions 2, 6, 8 to 10, 16, 17, 19, and 20, and 290.0137, paragraph (a); and reduced by\n(ii) the subtractions under sections 290.0132, subdivisions 2, 9, 10, 14, 15, 17, 18, 27, 31, and 32, and 290.0137, paragraph (c).\n(f) If an individual who is not a Minnesota resident for the entire year is a qualifying owner of a qualifying entity that elects to pay tax as provided in section 289A.08, subdivision 7a, paragraph (b), the individual must compute the individual's Minnesota income tax as provided in paragraph (e), and also must include, to the extent attributed to the electing qualifying entity:\n(1) in paragraph (e), clause (1), item (i), and paragraph (e), clause (2), item (i), the addition under section 290.0131, subdivision 5; and\n(2) in paragraph (e), clause (1), item (ii), and paragraph (e), clause (2), item (ii), the subtraction under section 290.0132, subdivision 3.\nThe commissioner shall annually adjust the minimum and maximum dollar amounts for each rate bracket for which a tax is imposed in subdivision 2c as provided in section 270C.22. The statutory year is taxable year 2019. The rate applicable to any rate bracket must not be changed. The dollar amounts setting forth the tax shall be adjusted to reflect the changes in the rate brackets. The rate brackets as adjusted must be rounded to the nearest $10 amount. If the rate bracket ends in $5, it must be rounded up to the nearest $10 amount. The commissioner shall determine the rate bracket for married filing separate returns after this adjustment is done. The rate bracket for married filing separate must be one-half of the rate bracket for married filing joint.\n[Repealed, 1984 c 502 art 2 s 17]\n[Repealed, 1Sp1986 c 1 art 8 s 19]\n(a) For purposes of this subdivision, the terms defined in section 462D.02 have the meanings given in that section.\n(b) In addition to the tax computed under subdivision 2c, an additional amount of tax applies equal to the additional tax computed for the taxable year for the account holder of a first-time home buyer account under section 462D.06, subdivision 3.\n(a) For the purposes of this subdivision:\n(1) the definitions under section 290.0684 apply;\n(2) \"account owner\" means an individual who owns one or more qualified accounts;\n(3) \"credit ratio\" means the ratio of (i) two times the total amount of credits that an account owner claimed under section 290.0684 for contributions to the account owner's qualified accounts to (ii) the total contributions in all taxable years to the account owner's qualified accounts;\n(4) \"qualified higher education expenses\" has the meaning given in section 529(e)(3) of the Internal Revenue Code, except section 529(c)(7) does not apply; and\n(5) \"subtraction ratio\" means the ratio of (i) the total amount of subtractions that an account owner claimed under section 290.0132, subdivision 23, for contributions to the account owner's qualified accounts to (ii) the total contributions in all taxable years to the account owner's qualified accounts.\n(b) If a distribution from a qualified account is used for a purpose other than to pay for qualified higher education expenses, the account owner must pay an additional tax equal to:\n(1) 50 percent of the product of the credit ratio and the amount of the distribution; plus\n(2) ten percent of the product of the subtraction ratio and the amount of the distribution.\n(c) The additional tax under this subdivision does not apply to any portion of a distribution that is subject to the additional tax under section 529(c)(6) of the Internal Revenue Code.\n[Repealed, Ex1967 c 32 art 14 s 12]\n[Repealed, 1980 c 419 s 46]\n[Repealed, 1980 c 419 s 46]\n[Repealed, 1982 c 523 art 1 s 72]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, Ex1971 c 31 art 6 s 2]\n[Expired]\n[Repealed, Ex1971 c 31 art 6 s 2]\n[Expired]\n[Repealed, Ex1967 c 32 art 2 s 1]\n[Repealed, 1983 c 342 art 1 s 44]\n[Repealed, 1983 c 342 art 1 s 44]\n[Repealed, 2011 c 112 art 5 s 8]\n[Repealed, 1987 c 268 art 1 s 127]\n[Repealed, 1979 c 303 art 1 s 23]\n[Repealed, 1984 c 502 art 14 s 20]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1Sp1986 c 1 art 3 s 21]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1Sp1985 c 14 art 1 s 59]\n[Repealed, 1988 c 719 art 1 s 21]\n[Repealed, 1996 c 471 art 9 s 16]\n(a) A taxpayer who is liable for taxes based on net income to another state, as provided in paragraphs (b) through (f), upon income allocated or apportioned to Minnesota, is entitled to a credit for the tax paid to another state if the tax is actually paid in the taxable year or a subsequent taxable year. A taxpayer who is a resident of this state pursuant to section 290.01, subdivision 7, paragraph (b), and who is subject to income tax as a resident in the state of the individual's domicile is not allowed this credit unless the state of domicile does not allow a similar credit.\n(b) For an individual, estate, or trust, the credit is determined by multiplying the tax payable under this chapter by the ratio derived by dividing the income subject to tax in the other state that is also subject to tax in Minnesota while a resident of Minnesota by the taxpayer's federal adjusted gross income, as defined in section 62 of the Internal Revenue Code, modified by the addition required by section 290.0131, subdivision 2, and the subtraction allowed by section 290.0132, subdivision 2, to the extent the income is allocated or assigned to Minnesota under sections 290.081 and 290.17.\n(c) If the taxpayer is an athletic team that apportions all of its income under section 290.17, subdivision 5, the credit is determined by multiplying the tax payable under this chapter by the ratio derived from dividing the total net income subject to tax in the other state by the taxpayer's Minnesota taxable income.\n(d)(1) The credit determined under paragraph (b) or (c) shall not exceed the amount of tax so paid to the other state on the gross income earned within the other state subject to tax under this chapter; and\n(2) the allowance of the credit does not reduce the taxes paid under this chapter to an amount less than what would be assessed if the gross income earned within the other state were excluded from taxable net income.\n(e) In the case of the tax assessed on a lump-sum distribution under section 290.032, the credit allowed under paragraph (a) is the tax assessed by the other state on the lump-sum distribution that is also subject to tax under section 290.032, and shall not exceed the tax assessed under section 290.032. To the extent the total lump-sum distribution defined in section 290.032, subdivision 1, includes lump-sum distributions received in prior years or is all or in part an annuity contract, the reduction to the tax on the lump-sum distribution allowed under section 290.032, subdivision 2, includes tax paid to another state that is properly apportioned to that distribution.\n(f) If a Minnesota resident reported an item of income to Minnesota and is assessed tax in such other state on that same income after the Minnesota statute of limitations has expired, the taxpayer shall receive a credit for that year under paragraph (a), notwithstanding any statute of limitations to the contrary. The claim for the credit must be submitted within one year from the date the taxes were paid to the other state. The taxpayer must submit sufficient proof to show entitlement to a credit.\n(g) For the purposes of this subdivision, a resident shareholder of a corporation treated as an \"S\" corporation under section 290.9725, must be considered to have paid a tax imposed on the shareholder in an amount equal to the shareholder's pro rata share of any net income tax paid by the S corporation to another state. For the purposes of the preceding sentence, the term \"net income tax\" means any tax imposed on or measured by a corporation's net income.\n(h) For the purposes of this subdivision, a resident partner of an entity taxed as a partnership under the Internal Revenue Code must be considered to have paid a tax imposed on the partner in an amount equal to the partner's pro rata share of any net income tax paid by the partnership to another state. For purposes of the preceding sentence, the term \"net income\" tax means any tax imposed on or measured by a partnership's net income. For purposes of this paragraph, \"partnership\" includes a limited liability company and \"partner\" includes a member of a limited liability company.\n(i) For the purposes of this subdivision, \"another state\":\n(1) includes:\n(i) the District of Columbia; and\n(ii) a province or territory of Canada; but\n(2) excludes Puerto Rico and the several territories organized by Congress.\n(j) The limitations on the credit in paragraphs (b), (c), and (d), are imposed on a state by state basis.\n(k) For a tax imposed by a province or territory of Canada, the tax for purposes of this subdivision is the excess of the tax over the amount of the foreign tax credit allowed under section 27 of the Internal Revenue Code. In determining the amount of the foreign tax credit allowed, the net income taxes imposed by Canada on the income are deducted first. Any remaining amount of the allowable foreign tax credit reduces the provincial or territorial tax that qualifies for the credit under this subdivision.\n(l)(1) The credit allowed to a qualifying individual under this section for tax paid to a qualifying state equals the credit calculated under paragraphs (b) and (d), plus the amount calculated by multiplying:\n(i) the difference between the preliminary credit and the credit calculated under paragraphs (b) and (d), by\n(ii) the ratio derived by dividing the income subject to tax in the qualifying state that consists of compensation for performance of personal or professional services by the total amount of income subject to tax in the qualifying state.\n(2) If the amount of the credit that a qualifying individual is eligible to receive under clause (1) for tax paid to a qualifying state exceeds the tax due under this chapter before the application of the credit calculated under clause (1), the commissioner shall refund the excess to the qualifying individual. An amount sufficient to pay the refunds required by this subdivision is appropriated to the commissioner from the general fund.\n(3) For purposes of this paragraph, \"preliminary credit\" means the credit that a qualifying individual is eligible to receive under paragraphs (b) and (d) for tax paid to a qualifying state without regard to the limitation in paragraph (d), clause (2); \"qualifying individual\" means a Minnesota resident under section 290.01, subdivision 7, paragraph (a), who received compensation during the taxable year for the performance of personal or professional services within a qualifying state; and \"qualifying state\" means a state with which an agreement under section 290.081 is not in effect for the taxable year but was in effect for a taxable year beginning before January 1, 2010.\n(m) For purposes of this subdivision, a resident sole member of a disregarded limited liability company must be considered to have paid a tax imposed on the sole member in an amount equal to the net income tax paid by the disregarded limited liability company to another state. For the purposes of this paragraph, the term \"disregarded limited liability company\" means a limited liability company that is disregarded as an entity separate from its owner as defined in Code of Federal Regulations, title 26, section 301.7701, and \"net income tax\" means any tax imposed on or measured by a disregarded limited liability company's net income.\n[Repealed, 2013 c 143 art 6 s 34]\n(a) A taxpayer may claim a refund equal to the amount of the taxpayer's contributions made in the calendar year to candidates and to a political party. The maximum refund for an individual must not exceed $75 and for a married couple, filing jointly, must not exceed $150. A refund of a contribution is allowed only if the taxpayer files a form required by the commissioner and attaches to the form a copy of an official refund receipt form issued by the candidate or party and signed by the candidate, the treasurer of the candidate's principal campaign committee, or the chair or treasurer of the party unit, after the contribution was received. The receipt forms must be numbered, and the data on the receipt that are not public must be made available to the campaign finance and public disclosure board upon its request. A claim must be filed with the commissioner no sooner than January 1 of the calendar year in which the contribution was made and no later than April 15 of the calendar year following the calendar year in which the contribution was made. A taxpayer may file only one claim per calendar year. Amounts paid by the commissioner after June 15 of the calendar year following the calendar year in which the contribution was made must include interest at the rate specified in section 270C.405.\n(b) No refund is allowed under this subdivision for a contribution to a candidate unless the candidate:\n(1) has signed an agreement to limit campaign expenditures as provided in section 10A.322;\n(2) is seeking an office for which voluntary spending limits are specified in section 10A.25; and\n(3) has designated a principal campaign committee.\nThis subdivision does not limit the campaign expenditures of a candidate who does not sign an agreement but accepts a contribution for which the contributor improperly claims a refund.\n(c) For purposes of this subdivision, \"political party\" means a major political party as defined in section 200.02, subdivision 7, or a minor political party qualifying for inclusion on the income tax or property tax refund form under section 10A.31, subdivision 3a.\nA \"major party\" or \"minor party\" includes the aggregate of that party's organization within each house of the legislature, the state party organization, and the party organization within congressional districts, counties, legislative districts, municipalities, and precincts.\n\"Candidate\" means a candidate as defined in section 10A.01, subdivision 10, except a candidate for judicial office.\n\"Contribution\" means a gift of money.\n(d) The commissioner shall make copies of the form available to the public and candidates upon request.\n(e) The following data collected or maintained by the commissioner under this subdivision are private: the identities of individuals claiming a refund, the identities of candidates to whom those individuals have made contributions, and the amount of each contribution.\n(f) The commissioner shall report to the campaign finance and public disclosure board by each August 1 a summary showing the total number and aggregate amount of political contribution refunds made on behalf of each candidate and each political party. These data are public.\n(g) The amount necessary to pay claims for the refund provided in this section is appropriated from the general fund to the commissioner of revenue.\n(h) For a taxpayer who files a claim for refund via the Internet or other electronic means, the commissioner may accept the number on the official receipt as documentation that a contribution was made rather than the actual receipt as required by paragraph (a).\n(a) A credit is allowed against the tax imposed on a qualifying entity under section 289A.08, subdivision 7a, for pass-through entity tax paid to another state. The credit under this subdivision is allowed as a credit for taxes paid to another state under subdivision 22, paragraph (a), and may only be claimed by a qualifying owner. The credit allowed under this subdivision must be claimed in a manner prescribed by the commissioner.\n(b) This section expires at the same time and on the same terms as section 164(b)(6)(B) of the Internal Revenue Code, except that the expiration of this section does not affect the commissioner's authority to audit or power of examination and assessments for credits claimed under this section.\n(c) As used in this subdivision, the following terms have the meanings given:\n(1) \"income\" has the meaning provided in section 290.01, subdivision 19, paragraph (i);\n(2) \"pass-through entity tax\" means an entity-level tax imposed on the income of a partnership, limited liability corporation, or S corporation;\n(3) \"qualifying entity\" has the meaning provided in section 289A.08, subdivision 7a, paragraph (a); and\n(4) \"qualifying owner\" has the meaning provided in section 289A.08, subdivision 7a, paragraph (b).\n[Repealed, 2012 c 294 art 2 s 43]\n[Repealed, 1Sp2001 c 5 art 7 s 66]\n[Repealed, 1Sp2001 c 5 art 9 s 30]\n(a) A credit is allowed against the tax imposed under subdivision 1 for tax paid to another state based on net income. The credit must be claimed in a manner prescribed by the commissioner.\n(b) The amount of the credit equals the amount of qualifying tax paid to the other state for the taxable year, multiplied by the taxpayer's apportionment percentage under section 290.191. If the item of income or gain is assigned to Minnesota as nonbusiness income, the entire amount of the qualifying tax is allowed as a credit. The maximum amount of the credit is limited to the tax liability under subdivision 1 for the taxable year and, in no case, may the credit exceed the reduction in the amount of tax under subdivision 1 if the item of income or gain were excluded from net income.\n(c) For purposes of this subdivision, \"qualifying tax\" means the amount of tax paid to another state on an item of income or gain for the taxable year, if:\n(1) the law of another state requires and the taxpayer assigns the entire amount of the income or gain to one other state; and\n(2) the income or gain is included in the measure of the exercise of the corporate franchise that is taxable under subdivision 1.\n(d) The amount of tax paid to another state on an item of income or gain is the difference between the tax paid to the state and the amount of tax that would have been paid to the state if the item of income or gain had not been included in the net income of that state.\n(e) The taxpayer must report to the commissioner of revenue any change in tax in the other state, the change in qualifying tax, and a copy of the final determination of the tax by the taxing authority of the other state. A taxpayer who claims the credit consents to extend the period of limitation for the commissioner to recompute the credit and reassess the tax due, including a refund, for a period of one year following a report by the taxpayer of a final determination of tax by the state in which the entire amount of income or gain is reported, notwithstanding any period of limitations to the contrary, or within any applicable period of limitations, whichever is longer. If a taxpayer fails to report as required by this paragraph, the commissioner may recompute the tax, including a refund, based on the information available to the commissioner. The tax may be recomputed within six years after the report should have been filed, notwithstanding any period of limitations to the contrary.\nA taxpayer may take a credit against the tax due under this chapter equal to 30 percent of the expense incurred by the taxpayer to provide transit passes, for use in Minnesota, to employees of the taxpayer. As used in this subdivision, \"transit pass\" has the meaning given in section 132(f)(5)(A) of the Internal Revenue Code. If the taxpayer purchases the transit passes from the transit system operator, and resells them to the employees, the credit is based on the amount of the difference between the price paid for the passes by the employer and the amount charged to employees.\nA taxpayer that is a qualified business, as defined in section 469.310, subdivision 11, is allowed a credit as determined under section 469.318 against the tax imposed by this chapter.\n[Repealed, 2014 c 308 art 9 s 94]\n[Repealed, 2014 c 308 art 9 s 94]\n[Repealed, 2012 c 294 art 2 s 43]\n(a) An owner of cattle in Minnesota may take a credit against the tax due under this chapter for an amount equal to: (1) for corporate filers, including shareholders of an S corporation under section 290.9725, 25 percent of the expenses incurred during the taxable year to conduct tuberculosis testing on those cattle; and (2) for all other filers, one-half the expenses incurred during the taxable year to conduct tuberculosis testing on those cattle.\n(b) If the amount of credit which the taxpayer is eligible to receive under this subdivision exceeds the taxpayer's tax liability under this chapter, the commissioner of revenue shall refund the excess to the taxpayer.\n(c) The amount necessary to pay claims for the refund provided in this subdivision is appropriated from the general fund to the commissioner of revenue.\n(d) Expenses incurred in a calendar year in which tuberculosis testing of cattle in Minnesota is not federally required are not allowed in claiming the credit under paragraph (a).\n[Repealed, 2010 c 216 s 62]\n(a) An individual, estate, or trust is allowed a credit against the tax imposed by this chapter for investments in a qualifying business certified under section 116J.8732, subdivision 3. The credit equals 45 percent of the amount invested by the taxpayer in qualified businesses during the taxable year. The credit must not exceed $112,500 for each taxable year.\n(b) A pass-through entity that invests in a qualified business must be considered to be the taxpayer for purposes of the investment limitations in this subdivision and the amount of the credit allowed with respect to a pass-through entity's investment in a qualified business must be determined at the pass-through entity level. The amount of the total credit determined at the pass-through entity level must be allowed to the members in proportion to their respective interests in the pass-through entity.\n(c) An investment made in a qualified business from the assets of a retirement plan is deemed to be the retirement plan participant's investment for the purpose of this subdivision if a separate account is maintained for the plan participant and the participant directly controls where the account assets are invested.\n(d) The investment must be made on or after the certification effective date and must be at risk in the business to be eligible for the tax credit under this subdivision. An investment for which a credit is received under this subdivision must remain in the qualified business for at least three years. Investments placed in escrow do not qualify for the credit.\n(e) The entire amount of an investment for which a credit is claimed under this subdivision must be expended by the qualified business for plant, equipment, research and development, marketing and sales activity, or working capital for the qualified business.\n(f) A taxpayer who owns a controlling interest in the qualified business or who receives more than 50 percent of the taxpayer's gross annual income from the qualified business is not entitled to a credit under this subdivision. A member of the immediate family of a taxpayer disqualified by this subdivision is not entitled to the credit under this subdivision. For purposes of this subdivision, \"immediate family\" means the taxpayer's spouse, parent, sibling, or child or the spouse of any such person.\n(g) The commissioner may disallow any credit otherwise allowed under this subdivision if any representation by a business in the application for certification as a qualified business proves to be false or if the taxpayer or qualified business fails to satisfy any conditions under this subdivision or section 116J.8732 or any conditions consistent with those requirements otherwise determined by the commissioner. The commissioner has four years after the due date of the return or after the return was filed, whichever period expires later, to audit the credit and assess additional tax that may be found due to failure to comply with the provisions of this subdivision and section 116J.8732. The amount of any credit disallowed by the commissioner that reduced the taxpayer's income tax liability for any or all applicable tax years, plus penalty and interest as provided under chapter 289A, must be paid by the taxpayer.\n(h) If the amount of the credit under this subdivision for any taxable year exceeds the limitations under paragraph (a), the excess is a credit carryover to each of the four succeeding taxable years. The entire amount of the excess unused credit for the taxable year must be carried first to the earliest of the taxable years to which the credit may be carried. The amount of the unused credit that may be added under this paragraph may not exceed the taxpayer's liability for tax, less the credit for the taxable year. Each year, the aggregate amount of seed capital investment tax credit allowed for investments under this subdivision is limited to allocations that a border city has available for tax reductions in border city enterprise zones under section 469.169. The city must annually notify the commissioner of the amount of its section 469.169 allocations that it wishes to use to provide credits under this paragraph and the commissioner, after verifying the available allocation, shall implement the limit under this paragraph. If investments in qualified businesses reported to the commissioner exceed the limit on credits for investments imposed by this subdivision, the credit must be allowed to taxpayers in the chronological order of their investments in qualified businesses as determined from the forms filed under section 116J.8732.\n[Repealed, 1Sp2017 c 1 art 1 s 44]\n(a) A beginning farmer incentive credit is allowed against the tax due under this chapter for the sale or rental of agricultural assets to a beginning farmer according to section 41B.0391, subdivision 2, and is limited to the amount stated on the certificate issued under section 41B.0391, subdivision 4.\n(b) The credit may be claimed only after approval and certification by the Rural Finance Authority according to section 41B.0391.\n(c) The credit is limited to the liability for tax, as computed under this chapter, for the taxable year. If the amount of the credit determined under this subdivision for any taxable year exceeds this limitation, the excess is a beginning farmer incentive credit carryover to each of the 15 succeeding taxable years. The entire amount of the excess unused credit for the taxable year is carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. The amount of the unused credit which may be added under this paragraph must not exceed the taxpayer's liability for tax, less the beginning farmer incentive credit for the taxable year.\n(d) Credits allowed to a partnership, a limited liability company taxed as a partnership, an S corporation, or multiple owners of property are passed through to the partners, members, shareholders, or owners, respectively, pro rata to each based on the partner's, member's, shareholder's, or owner's share of the entity's assets or as specially allocated in the organizational documents or any other executed agreement, as of the last day of the taxable year.\n(e) For a nonresident or part-year resident, the credit under this section must be allocated using the percentage calculated in section 290.06, subdivision 2c, paragraph (e).\n(f) Notwithstanding the approval and certification by the Rural Finance Authority under section 41B.0391, the commissioner may utilize any audit and examination powers under chapter 270C or 289A to the extent necessary to verify that the taxpayer is eligible for the credit and to assess for the amount of any improperly claimed credit.\n(g) This subdivision expires at the same time and on the same terms as section 41B.0391, except that the expiration of this subdivision does not affect the commissioner of revenue's authority to audit or power of examination and assessment for credits claimed under this subdivision.\n(a) A taxpayer who is a beginning farmer may take a credit against the tax due under this chapter for participation in a financial management program according to section 41B.0391, subdivision 3.\n(b) The credit may be claimed only after approval and certification by the Rural Finance Authority according to section 41B.0391.\n(c) The credit is limited to the liability for tax, as computed under this chapter, for the taxable year. If the amount of the credit determined under this subdivision for any taxable year exceeds this limitation, the excess is a beginning farmer management credit carryover to each of the three succeeding taxable years. The entire amount of the excess unused credit for the taxable year is carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. The amount of the unused credit which may be added under this paragraph must not exceed the taxpayer's liability for tax, less the beginning farmer management credit for the taxable year.\n(d) For a part-year resident, the credit under this section must be allocated using the percentage calculated in section 290.06, subdivision 2c, paragraph (e).\n(e) Notwithstanding the approval and certification by the Rural Finance Authority under section 41B.0391, the commissioner may utilize any audit and examination powers under chapter 270C or 289A to the extent necessary to verify that the taxpayer is eligible for the credit and to assess for the amount of any improperly claimed credit.\n(f) This subdivision expires at the same time and on the same terms as section 41B.0391, except that the expiration of this subdivision does not affect the commissioner of revenue's authority to audit or power of examination and assessment for credits claimed under this subdivision.\n(a) A taxpayer, including a taxpayer to whom a credit has been assigned under section 116U.27, subdivision 3, may claim a credit against the tax imposed by this chapter equal to the amount certified on a credit certificate under section 116U.27, subject to the limitations in this subdivision.\n(b) The credit is limited to the liability for tax, as computed under this chapter, for the taxable year. If the amount of the credit determined under this subdivision for any taxable year exceeds this limitation, the excess is a film production credit carryover to each of the five succeeding taxable years. The entire amount of the excess unused credit for the taxable year is carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. The amount of the unused credit that may be added under this paragraph must not exceed the taxpayer's liability for tax, less any film production credit for the taxable year.\n(c) Credits allowed to a partnership, a limited liability company taxed as a partnership, or an S corporation are passed through to the partners, members, shareholders, or owners, respectively, pro rata to each based on the partner's, member's, shareholder's, or owner's share of the entity's assets, or as specially allocated in the organizational documents or any other executed agreement, as of the last day of the taxable year.\n(d) Notwithstanding the approval and certification by the commissioner of employment and economic development under section 116U.27, the commissioner may utilize any audit and examination powers under chapter 270C or 289A to the extent necessary to verify that the taxpayer is eligible for the credit and to assess the amount of any improperly claimed credit. The commissioner may only assess the original recipient of the credit certificate for the amount of improperly claimed credits. The commissioner may not assess a credit certificate assignee for any amount of improperly claimed credits, and an assignee's claim for credit is not affected by the commissioner's assessment of improperly claimed credits against the assignor.\n(e) This subdivision expires January 1, 2031, for taxable years beginning after December 31, 2030, except that the expiration of this section does not affect the commissioner of revenue's authority to audit or power of examination and assessment for credits claimed under this subdivision.\n(a) A qualifying owner of a qualifying entity that elects to pay the pass-through entity tax under section 289A.08, subdivision 7a, may claim a credit against the tax due under this chapter equal to the amount of the owner's tax liability as calculated under section 289A.08, subdivision 7a, paragraph (d).\n(b) If the amount of the credit the taxpayer may claim under this subdivision exceeds the taxpayer's tax liability under this chapter, the commissioner of revenue shall refund the excess to the taxpayer. The amount necessary to pay the claim for the refund provided in this subdivision is appropriated from the general fund to the commissioner of revenue.\n(c) For purposes of this subdivision, \"qualifying entity,\" \"qualifying owner,\" and \"tax liability\" have the meanings given in section 289A.08, subdivision 7a, paragraphs (a) and (d).",
	"repealed": false
}