{
	"id": "469.068",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.068",
	"title": "469.068 BID LAW FOR CONSTRUCTION CONTRACTS.",
	"text": "All construction work and every purchase of equipment, supplies, or materials necessary in carrying out the purposes of sections 469.048 to 469.068, that involve the expenditure of $1,000 or more, shall be awarded by contract as provided in this subdivision or in subdivision 1a. Before receiving bids under sections 469.048 to 469.068, the authority shall publish, once a week for two consecutive weeks in the official newspaper of the port's city, a notice that bids will be received for the construction work, or purchase of equipment, supplies, or materials. The notice shall state the nature of the work, and the terms and conditions upon which the contract is to be let and name a time and place where the bids will be received, opened, and read publicly, which time shall be not less than seven days after the date of the last publication. After the bids have been received, opened, read publicly, and recorded, the commissioners shall award the contract to the lowest responsible bidder, reserving the right to reject any or all bids. The contract shall be executed in writing and the person to whom the contract is awarded shall give sufficient bond to the board for its faithful performance. If no satisfactory bid is received, the port authority may readvertise, or, by an affirmative vote of two of its commissioners in the case of a three-member commission, or five of its members in the case of a seven-member commission, may authorize the authority to perform any part or parts of any construction work by day labor under conditions it prescribes. The commissioners may establish reasonable qualifications to determine the fitness and responsibility of bidders, and require bidders to meet the qualifications before bids are accepted. If the commissioners by a two-thirds or five-sevenths vote declare that an emergency exists requiring the immediate purchase of any equipment or material or supplies at a cost in excess of $1,000, but not exceeding $5,000, in amount, or making of emergency repairs, it shall not be necessary to advertise for bids, but the material, equipment, or supplies may be purchased in the open market at the lowest price obtainable, or the emergency repairs may be contracted for or performed without securing formal competitive bids. An emergency, for purposes of this section, is unforeseen circumstances or conditions which result in the jeopardizing of human life or property.\nIn all contracts involving the employment of labor, the commissioners shall stipulate conditions they deem reasonable, as to the hours of labor and wages and may stipulate as to the residence of employees to be employed by the contractors.\nBonds shall be required from contractors for any works of construction as provided in and subject to all the provisions of sections 574.26 to 574.31.\nAs an alternative to the procurement method described in subdivision 1, a contract may be awarded to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nA port authority may use the facilities of its city's purchasing department in connection with construction work and to purchase equipment, supplies, or materials.\nA port authority may use the dollar limits on contracts for the basis for competitive bids, quotations, or purchase or sale in the open market contained in section 471.345 as an alternative to the limits contained in subdivision 1.",
	"repealed": false
}