{
	"id": "462A.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.201",
	"title": "462A.201 HOUSING TRUST FUND ACCOUNT.",
	"text": "(a) The housing trust fund account is created as a separate account in the housing development fund.\n(b) The housing trust fund account consists of:\n(1) money appropriated and transferred from other state funds;\n(2) interest accrued from real estate trust accounts as provided under section 82.75, subdivision 8;\n(3) gifts, grants, and donations received from the United States, private foundations, and other sources; and\n(4) money made available to the agency for the purpose of the account from other sources.\n(a) The agency may use money from the housing trust fund account to provide loans or grants for:\n(1) projects for the development, construction, acquisition, preservation, and rehabilitation of low-income rental and limited equity cooperative housing units, including temporary and transitional housing;\n(2) the costs of operating rental housing, as determined by the agency, that are unique to the operation of low-income rental housing or supportive housing;\n(3) rental assistance, either project-based or tenant-based; and\n(4) programs to secure stable housing for families with children eligible for enrollment in a prekindergarten through grade 12 academic program.\nFor purposes of this section, \"transitional housing\" has the meaning given by the United States Department of Housing and Urban Development. Loans or grants for residential housing for migrant farmworkers may be made under this section.\n(b) The housing trust fund account must be used for the benefit of persons and families whose income, at the time of initial occupancy, does not exceed 60 percent of median income as determined by the United States Department of Housing and Urban Development for the metropolitan area. At least 75 percent of the funds in the housing trust fund account must be used for the benefit of persons and families whose income, at the time of initial occupancy, does not exceed 30 percent of the median family income for the metropolitan area as defined in section 473.121, subdivision 2. For purposes of this section, a household with a housing assistance voucher under Section 8 of the United States Housing Act of 1937, as amended, is deemed to meet the income requirements of this section.\nThe median family income may be adjusted for families of five or more.\n(c) Rental assistance under this section must be provided by governmental units which administer housing assistance supplements or by for-profit or nonprofit organizations experienced in housing management. Rental assistance shall be limited to households whose income at the time of initial receipt of rental assistance does not exceed 60 percent of median income, as determined by the United States Department of Housing and Urban Development for the metropolitan area. Priority among comparable applications for tenant-based rental assistance will be given to proposals that will serve households whose income at the time of initial application for rental assistance does not exceed 30 percent of median income, as determined by the United States Department of Housing and Urban Development for the metropolitan area. Rental assistance must be terminated when it is determined that 30 percent of a household's monthly income for four consecutive months equals or exceeds the market rent for the unit in which the household resides plus utilities for which the tenant is responsible. Rental assistance may only be used for rental housing units that meet the housing maintenance code of the local unit of government in which the unit is located, if such a code has been adopted, or the housing quality standards adopted by the United States Department of Housing and Urban Development, if no local housing maintenance code has been adopted.\n(d) In making the loans or grants, the agency shall determine the terms and conditions of repayment and the appropriate security, if any, should repayment be required. To promote the geographic distribution of grants and loans, the agency may designate a portion of the grant or loan awards to be set aside for projects located in specified congressional districts or other geographical regions specified by the agency. The agency may adopt rules for awarding grants and loans under this subdivision.\nThe agency may use money from the housing trust fund account to match federal, local, or private money to be used for projects authorized under subdivision 2.\nMS 2000 [Repealed, 1Sp2001 c 4 art 5 s 10]\nMS 1992 [Repealed, 1993 c 309 s 32]\nThe agency shall submit a biennial report to the legislature and the governor on the use of the housing trust fund account including the number of loans and grants made, the number and types of residential units assisted through the account, the number of households for whom rental assistance payments were provided, and the number of residential units assisted through the account that were rented to or cooperatively owned by persons or families at or below 30 percent of the median family income of the metropolitan area at the time of initial occupancy.\nFive percent of the money credited to the housing trust fund account under section 82.75, subdivision 8, may be used to make capacity building grants as provided under section 462A.21, subdivision 3b.",
	"repealed": false
}