{
	"id": "174.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.49",
	"title": "174.49 TRANSPORTATION ADVANCEMENT ACCOUNT.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of transportation.\n(c) \"Metropolitan counties\" means the following counties: Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington.\nA transportation advancement account is established in the special revenue fund. The account consists of funds under sections 168E.09, subdivision 2, and 297A.94, and as provided by law and any other money donated, allotted, transferred, or otherwise provided to the account.\nThe commissioner must distribute or transfer the funds in the transportation advancement account as follows:\n(1) 36 percent to metropolitan counties in the manner provided under subdivision 5;\n(2) ten percent to the county state-aid highway fund;\n(3) 15 percent to the larger cities assistance account under section 162.146, subdivision 1;\n(4) 27 percent to the small cities assistance account under section 162.145, subdivision 2;\n(5) 11 percent to the town road account under section 162.081; and\n(6) one percent to the food delivery support account under section 256.9752, subdivision 1a.\nThe amount available in the transportation advancement account under subdivision 3, clause (1), is annually appropriated to the commissioner for distribution to metropolitan counties as provided under subdivision 5.\nThe commissioner must apportion any funds that are specified for distribution under this subdivision as follows:\n(1) 50 percent of the funds proportionally based on each metropolitan county's share of population, as defined in section 477A.011, subdivision 3, compared to the total population of all metropolitan counties; and\n(2) 50 percent of the funds proportionally based on each metropolitan county's share of money needs, as determined under section 162.07, subdivision 2, compared to the total money needs of all metropolitan counties.\n(a) A metropolitan county must use funds that are received under subdivision 5 as follows:\n(1) 41.5 percent for active transportation and transportation corridor safety studies;\n(2) 41.5 percent for:\n(i) repair, preservation, and rehabilitation of transportation systems; and\n(ii) roadway replacement to reconstruct, reclaim, or modernize a corridor without adding traffic capacity, except for auxiliary lanes with a length of less than 2,500 feet; and\n(3) 17 percent for any of the following:\n(i) transit purposes, including but not limited to operations, maintenance, capital maintenance, demand response service, and assistance to replacement service providers under section 473.388;\n(ii) complete streets projects, as provided under section 174.75; and\n(iii) projects, programs, or operations activities that meet the requirements of a mitigation action under section 161.178, subdivision 4.\n(b) Funds under paragraph (a), clause (3), must supplement and not supplant existing sources of revenue.\n(c) A metropolitan county may use funds that are received under subdivision 5 as debt service for obligations issued by the county in accordance with chapter 475, provided that the obligations are issued for a use allowable under this section.",
	"repealed": false
}