{
	"id": "256R.267",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.267",
	"title": "256R.267 THRESHOLD PROJECT PROPERTY PAYMENT RATE INTERIM ADJUSTMENTS.",
	"text": "(a) A facility reimbursed under section 256R.26, subdivisions 1 to 8, may receive a property payment rate interim adjustment for threshold projects the cumulative cost of which during the three years between physical appraisals is between the following threshold project cost limits:\n(1) the lesser of $316,816 or $10,000 per bed in service; and\n(2) the greater of $1,620,943 or $20,000 per bed in service.\nThe commissioner shall update the threshold project cost limits each January 1 by the annual percent change in the construction cost per square foot value based on the information that is publicly available on November 1 immediately preceding the rate year.\n(b) A facility seeking a property payment rate interim adjustment must request an adjustment after the threshold project is completed. The nursing facility or the lease holder must have incurred the threshold project cost subsequent to the facility's last physical appraisal. The nursing facility must submit to the commissioner all building and fixed equipment cost data related to the project within 90 days of completing the project.\n(c) Effective January 1 or July 1, whichever occurs first after a facility completes a threshold project and requests the property payment rate interim adjustment, the commissioner shall add the allowable reported threshold project costs to the facility's URC under section 256R.26, subdivision 1, and to the DRC under section 256R.26, subdivision 3, before calculating an adjusted property payment rate under section 256R.26. The commissioner shall not include in the facility's limited URC threshold project costs reported to the commissioner between physical appraisals that exceed the maximum cumulative project cost limits described in paragraph (a).\n(d) In subsequent property payment rate calculations following the completion of a physical appraisal, the commissioner shall eliminate any interim adjustment to the DRC and URC under paragraph (c).\n(e) At the option of the commissioner, the commissioner may adjust the appraisal schedule for a nursing facility that has completed a threshold project.\n(f) If more or less than three years pass between a facility's physical appraisals, the commissioner shall prorate the facility's threshold project cost limits accordingly.\n(g) After the initial rate year project adjustments are allowed once annually based on the previous project completion date.\n(h) Two threshold projects may not be conducted at the same time. Purchases for a second project must be made after the completion date of the first project.",
	"repealed": false
}