{
	"id": "299A.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.80",
	"title": "299A.80 ADMINISTRATIVE POWERS AND PENALTIES; GENERAL.",
	"text": "(a) For purposes of sections 299A.80 to 299A.802, the terms defined in this subdivision have the meanings given them.\n(b) \"Administrative agent\" means a person or entity licensed by or granted authority by the commissioner of public safety under:\n(1) section 168.33 as a deputy registrar; or\n(2) section 171.061 as a driver's license agent.\n(c) \"Other authority\" means licenses, orders, stipulation agreements, settlements, or compliance agreements adopted or issued by the commissioner of public safety.\n(d) \"Commissioner\" means the commissioner of public safety.\n(e) \"License\" means a license, permit, registration, appointment, or certificate issued or granted to an administrative agent by the commissioner of public safety.\nSections 299A.80 to 299A.802 apply to administrative agents licensed by or subject to other authority of the commissioner.\nThe authority of the commissioner to issue a corrective order or assess an administrative penalty under sections 299A.80 to 299A.802 is in addition to other remedies available under statutory or common law, except that the state may not seek a civil penalty under any other law for a violation covered by an administrative penalty order. The payment of a penalty does not preclude the use of other enforcement provisions, under which civil fines are not assessed, in connection with the violation for which the penalty was assessed.\nThe commissioner, an employee, or an agent authorized by the commissioner, upon presentation of credentials, may:\n(1) examine and copy any books, papers, records, memoranda, or data of an administrative agent; and\n(2) enter upon any property where an administrative agent conducts its place of business to take actions authorized under statute, rule, or other authority, including (i) obtaining information from an administrative agent who has a duty to provide information under statute, rule, or other authority, (ii) taking steps to remedy violations, or (iii) conducting surveys or investigations.\n(a) An administrative agent may not:\n(1) make a false material statement, representation, or certification in a required document;\n(2) omit material information from a required document; or\n(3) alter, conceal, or fail to file or maintain a required document.\n(b) In this section, \"required document\" means a notice, application, record, report, plan, or other document required under statute, rule, or other authority.\n(a) The attorney general may proceed on behalf of the state to enforce administrative penalties that are due and payable under section 299A.802 in any manner provided by law for the collection of debts.\n(b) The attorney general may petition the district court to file a final administrative penalty order as an order of the court. At any court hearing to enforce a final administrative penalty order, the only issues the parties may contest are procedural and notice issues. Once entered, the administrative penalty order may be enforced in the same manner as a final judgment of the district court. This paragraph does not preclude district court review of the merits of an administrative penalty order if the order is appealed by the administrative agent under section 299A.802, subdivision 5.\n(c) If an administrative agent fails to pay an administrative penalty, the attorney general may bring a civil action in district court seeking payment of the penalty, injunctive relief, or other appropriate relief including monetary damages, attorney fees, costs, and interest.\n(a) In any judicial action brought by the attorney general for civil penalties, injunctive relief, or an action to compel performance pursuant to this section, if the state finally prevails, and if the proven violation was willful, the state, in addition to other penalties provided by law, may be allowed an amount determined by the court to be the reasonable value of all or part of the costs and attorney fees incurred by the state or the prevailing party. In determining the amount of the reasonable costs and attorney fees to be allowed, the court must give consideration to the economic circumstances of the defendant.\n(b) However, if a defendant prevails, the court may award the reasonable value of all or part of the reasonable costs and attorney fees incurred by the defendant.\nAn education and compliance account is created for the deposit of administrative penalty order receipts. Of the funds deposited in this account, $5,000 each year is appropriated to the commissioner for education and compliance activities related to the regulated parties affected by this chapter. At the end of each biennium, all money not expended lapses to the general fund.\nThe commissioner shall prepare a plan for using the administrative penalty order and cease and desist authority in this section. The commissioner shall provide a 30-day period for public comment on the plan. The plan must be finalized by July 1, 2004, and may be modified as necessary upon subsequent notice and opportunity for comment.",
	"repealed": false
}