{
	"id": "145.9268",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9268",
	"title": "145.9268 COMMUNITY CLINIC GRANTS.",
	"text": "For purposes of this section, \"eligible community clinic\" means:\n(1) a nonprofit clinic that is established to provide health services to low income or rural population groups; provides medical, preventive, dental, or mental health primary care services; and utilizes a sliding fee scale or other procedure to determine eligibility for charity care or to ensure that no person will be denied services because of inability to pay;\n(2) a governmental entity or an Indian tribal government or Indian health service unit that provides services and utilizes a sliding fee scale or other procedure as described under clause (1);\n(3) a consortium of clinics comprised of entities under clause (1) or (2); or\n(4) a nonprofit, tribal, or governmental entity proposing the establishment of a clinic that will provide services and utilize a sliding fee scale or other procedure as described under clause (1).\nThe commissioner of health shall award grants to eligible community clinics to plan, establish, or operate services to improve the ongoing viability of Minnesota's clinic-based safety net providers. Grants shall be awarded to support the capacity of eligible community clinics to serve low-income populations, reduce current or future uncompensated care burdens, or provide for improved care delivery infrastructure. The commissioner shall award grants to community clinics in metropolitan and rural areas of the state, and shall ensure geographic representation in grant awards among all regions of the state.\n(a) To receive a grant under this section, an eligible community clinic must submit an application to the commissioner of health by the deadline established by the commissioner. A grant may be awarded upon the signing of a grant contract. Community clinics may apply for and the commissioner may award grants for one-year or two-year periods.\n(b) An application must be on a form and contain information as specified by the commissioner but at a minimum must contain:\n(1) a description of the purpose or project for which grant funds will be used;\n(2) a description of the problem or problems the grant funds will be used to address;\n(3) a description of achievable objectives, a work plan, and a timeline for implementation and completion of processes or projects enabled by the grant; and\n(4) a process for documenting and evaluating results of the grant.\n(c) The commissioner shall review each application to determine whether the application is complete and whether the applicant and the project are eligible for a grant. In evaluating applications according to paragraph (d), the commissioner shall establish criteria including, but not limited to: the eligibility of the project; the applicant's thoroughness and clarity in describing the problem grant funds are intended to address; a description of the applicant's proposed project; a description of the population demographics and service area of the proposed project; the manner in which the applicant will demonstrate the effectiveness of any projects undertaken; and evidence of efficiencies and effectiveness gained through collaborative efforts. The commissioner may also take into account other relevant factors, including, but not limited to, the percentage for which uninsured patients represent the applicant's patient base and the degree to which grant funds will be used to support services increasing or maintaining access to health care services. During application review, the commissioner may request additional information about a proposed project, including information on project cost. Failure to provide the information requested disqualifies an applicant. The commissioner has discretion over the number of grants awarded.\n(d) In determining which eligible community clinics will receive grants under this section, the commissioner shall give preference to those grant applications that show evidence of collaboration with other eligible community clinics, hospitals, health care providers, or community organizations.\n(a) The commissioner may award grants for activities to:\n(1) provide a direct offset to expenses incurred for services provided to the clinic's target population;\n(2) establish, update, or improve information, data collection, or billing systems, including electronic health records systems;\n(3) procure, modernize, remodel, or replace equipment used in the delivery of direct patient care at a clinic;\n(4) provide improvements for care delivery, such as increased translation and interpretation services;\n(5) build a new clinic or expand an existing facility; or\n(6) other projects determined by the commissioner to improve the ability of applicants to provide care to the vulnerable populations they serve.\n(b) A grant awarded to an eligible community clinic may not exceed $300,000 per eligible community clinic. For an applicant applying as a consortium of clinics, a grant may not exceed $300,000 per clinic included in the consortium. The commissioner has discretion over the number of grants awarded.\nThe commissioner of health shall evaluate the overall effectiveness of the grant program. The commissioner shall collect progress reports to evaluate the grant program from the eligible community clinics receiving grants. Every two years, as part of this evaluation, the commissioner shall report to the legislature on the needs of community clinics and provide any recommendations for adding or changing eligible activities.",
	"repealed": false
}