{
	"id": "336.9-203",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-203",
	"title": "336.9-203 ATTACHMENT AND ENFORCEABILITY OF SECURITY INTEREST; PROCEEDS; SUPPORTING OBLIGATIONS; FORMAL REQUISITES.",
	"text": "(a) Attachment. A security interest attaches to collateral when it becomes enforceable against the debtor with respect to the collateral, unless an agreement expressly postpones the time of attachment.\n(b) Enforceability. Except as otherwise provided in subsections (c) through (i), a security interest is enforceable against the debtor and third parties with respect to the collateral only if:\n(1) value has been given;\n(2) the debtor has rights in the collateral or the power to transfer rights in the collateral to a secured party; and\n(3) one of the following conditions is met:\n(A) the debtor has signed a security agreement that provides a description of the collateral and, if the security interest covers timber to be cut, a description of the land concerned;\n(B) the collateral is not a certificated security and is in the possession of the secured party under section 336.9-313 pursuant to the debtor's security agreement;\n(C) the collateral is a certificated security in registered form and the security certificate has been delivered to the secured party under section 336.8-301 pursuant to the debtor's security agreement;\n(D) the collateral is controllable accounts, controllable electronic records, controllable payment intangibles, deposit accounts, electronic documents, electronic money, investment property, or letter of credit rights, and the secured party has control under section 336.7-106, 336.9-104, 336.9-105A, 336.9-106, 336.9-107, or 336.9-107A pursuant to the debtor's security agreement; or\n(E) the collateral is chattel paper and the secured party has possession and control under section 336.9-314A pursuant to the debtor's security agreement.\n(c) Other UCC provisions. Subsection (b) is subject to section 336.4-210 on the security interest of a collecting bank, section 336.5-118 on the security interest of a letter of credit issuer or nominated person, section 336.9-110 on a security interest arising under article 2 or 2A, and section 336.9-206 on security interests in investment property.\n(d) When person becomes bound by another person's security agreement. A person becomes bound as debtor by a security agreement entered into by another person if, by operation of law other than this article or by contract:\n(1) the security agreement becomes effective to create a security interest in the person's property; or\n(2) the person becomes generally obligated for the obligations of the other person, including the obligation secured under the security agreement, and acquires or succeeds to all or substantially all of the assets of the other person.\n(e) Effect of new debtor becoming bound. If a new debtor becomes bound as debtor by a security agreement entered into by another person:\n(1) the agreement satisfies subsection (b)(3) with respect to existing or after-acquired property of the new debtor to the extent the property is described in the agreement; and\n(2) another agreement is not necessary to make a security interest in the property enforceable.\n(f) Proceeds and supporting obligations. The attachment of a security interest in collateral gives the secured party the rights to proceeds provided by section 336.9-315 and is also attachment of a security interest in a supporting obligation for the collateral.\n(g) Lien securing right to payment. The attachment of a security interest in a right to payment or performance secured by a security interest or other lien on personal or real property is also attachment of a security interest in the security interest, mortgage, or other lien. The attachment of a security interest in the mortgage or lien on real property does not create an interest in real property.\n(h) Security entitlement carried in securities account. The attachment of a security interest in a securities account is also attachment of a security interest in the security entitlements carried in the securities account.\n(i) Commodity contracts carried in commodity account. The attachment of a security interest in a commodity account is also attachment of a security interest in the commodity contracts carried in the commodity account.",
	"repealed": false
}