{
	"id": "336A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/336A.01",
	"title": "336A.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Business day\" means a weekday on which government offices are open for business. Business day does not include state or federal holidays, Saturdays, or Sundays.\n\"Buyer in the ordinary course of business\" means a person who, in the ordinary course of business, buys farm products from a person engaged in farming operations who is in the business of selling farm products.\n\"Commission merchant\" means a person engaged in the business of receiving a farm product for sale on commission or for or on behalf of another person.\n\"Computerized filing system\" means the system created by the secretary of state for filing and giving notice of effective financing statements and farm products statutory liens.\n\"Crop year\" means:\n(1) for a crop, the calendar year in which it is harvested or to be harvested;\n(2) for animals, the calendar year in which they are born or acquired; and\n(3) for poultry or eggs, the calendar year in which they are sold or to be sold.\n\"Debtor\" means an individual or other legal entity that has borrowed money from or is otherwise indebted to a lienholder or secured party and whose farm products are subject to a farm products statutory lien created by operation of law or a security interest, to secure payment of the obligation.\n\"Effective financing statement\" means a statement that meets the requirements of section 336A.03.\n\"Farm product\" means an agricultural commodity, a species of livestock used or produced in farming operations, or a product of a crop or the livestock in its unmanufactured state, that is in the possession of a person engaged in farming operations.\n\"Farm product dealer\" means a buyer in the ordinary course of business, a commission merchant, or a selling agent.\n\"Farm products statutory lien\" means a lien on farm products which is given by statute or other rule of law for services or materials and includes an agricultural lien as defined in sections 336.9-102(a)(5); 514.963, subdivision 3; and 514.965, subdivision 2; and an agricultural producer's lien as provided in section 514.945.\n\"Filing office\" means the Office of the Secretary of State.\n\"Filing officer\" means the secretary of state or an agent of the secretary of state authorized to accept filings.\n\"Lienholder\" means an individual or other legal entity who has the right to collect money from a debtor and who has a farm products statutory lien.\n\"Lien notice\" means a statement that meets the requirements of section 336A.03.\n\"Monthly list\" means information about debtors, secured parties, lienholders, and farm products that is produced by the secretary of state and distributed once a month.\n[See Note.]\n\"Person\" means an individual, partnership, corporation, trust, or other business entity.\n\"Secured party\" means an individual or other legal entity that has received a security interest in farm products to secure repayment of the obligation owed to it.\n\"Security interest\" means an interest in farm products that secures payment or performance of an obligation.\n\"Selling agent\" means a person, other than a commission merchant, who is engaged in the business of negotiating the sale and purchase of a farm product on behalf of a person engaged in farming operations.",
	"repealed": false
}