{
	"id": "136A.1788",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1788",
	"title": "136A.1788 STUDENT LOAN DEBT COUNSELING.",
	"text": "A program is established under the Office of Higher Education to provide a grant to a Minnesota-based nonprofit qualified debt counseling organization to provide individual student loan debt repayment counseling to borrowers who are Minnesota residents concerning loans obtained to attend a postsecondary institution. The number of individuals receiving counseling may be limited to those capable of being served with available appropriations for that purpose. A goal of the counseling program is to provide two counseling sessions to at least 75 percent of borrowers receiving counseling.\nThe purpose of the counseling is to assist borrowers to:\n(1) understand their loan and repayment options;\n(2) manage loan repayment; and\n(3) develop a workable budget based on the borrower's full financial situation regarding income, expenses, and other debt.\nA qualified debt counseling organization is an organization that:\n(1) has experience in providing individualized student loan counseling;\n(2) employs certified financial counselors; and\n(3) is based in Minnesota and has offices at multiple rural and metropolitan area locations in the state to provide in-person counseling.\n(a) Applications for a grant shall be on a form created by the commissioner and on a schedule set by the commissioner. Among other provisions, the application must include a description of:\n(1) the characteristics of borrowers to be served;\n(2) the services to be provided and a timeline for implementation of the services;\n(3) how the services provided will help borrowers manage loan repayment;\n(4) specific program outcome goals and performance measures for each goal; and\n(5) how the services will be evaluated to determine whether the program goals were met.\n(b) The commissioner shall select one grant recipient for a two-year award every two years. A grant may be renewed biennially.\n(a) The grant recipient must submit a report to the commissioner by January 15 of the second year of the grant award. The report must evaluate and measure the extent to which program outcome goals have been met.\n(b) The grant recipient must collect, analyze, and report on participation and outcome data that enable the office to verify the outcomes.\n(c) The evaluation must include information on the number of borrowers served with on-time student loan payments, the number who brought their loans into good standing, the number of student loan defaults, the number who developed a monthly budget plan, and other information required by the commissioner. Recipients of the counseling must be surveyed on their opinions about the usefulness of the counseling and the survey results must be included in the report.\nBy February 1 of the second year of each grant award, the commissioner must submit a report to the committees in the legislature with jurisdiction over higher education finance regarding grant program outcomes.",
	"repealed": false
}