{
	"id": "609.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.092",
	"title": "609.092 JUVENILE PETTY OFFENDERS; USE OF RESTORATIVE JUSTICE.",
	"text": "(a) This subdivision applies to a child alleged to be a juvenile petty offender who:\n(1) has not been previously adjudicated delinquent or as a petty offender;\n(2) has not previously participated in or completed a diversion program for an offense;\n(3) has not previously been placed on probation without an adjudication for an offense or received a continuance under section 260B.198, subdivision 7; and\n(4) agrees to successfully complete a restorative justice program under this section.\n(b) Subject to subdivision 6, the prosecutor shall refer a child described in paragraph (a) to a restorative justice program or provider that has been included on the approved provider list described in subdivision 4. The program or provider shall arrange an appropriate outcome for the matter using restorative justice concepts. The program or provider shall involve the victim of the offense in the proceedings. If the victim is unwilling or unable to proceed, or if there is no identifiable victim, the program or provider shall ensure that someone serves as a proxy for the victim. The program or provider and child, along with other participants, shall agree in writing to an appropriate sanction for the child. The sanction may include any of the dispositions authorized in section 260B.235, if appropriate, along with any other sanctions agreed to.\nIf a person fails to comply with the settlement agreement, the person shall be referred back to the court for further proceedings.\nUpon the successful completion by a person of the sanctions agreed to in the settlement agreement, the program or provider shall notify the court and the court shall dismiss the charge against the person.\nThe prosecutor shall maintain a list of approved restorative justice programs and providers to which persons may be referred under this section.\nIf a restorative justice program or provider that is tailored in a more culturally specific manner to the person is on the list of approved providers under subdivision 4, and the prosecutor is referring the person to a restorative justice program or provider under this section, the prosecutor shall refer the person to the more appropriate program or provider.\nThis section applies only in jurisdictions where suitable restorative justice programs and providers are available and are able to accept the referral. This section does not apply if a prosecutor has determined that a nonrestorative justice diversion program is more appropriate for the person. In addition, this section does not apply to cases involving domestic violence or domestic assault.\nAs used in this section, \"restorative justice\" has the meaning given in section 611A.775. The term also includes Native American sentencing circles.",
	"repealed": false
}