{
	"id": "326.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.111",
	"title": "326.111 UNAUTHORIZED PRACTICE; DISCIPLINARY ACTION.",
	"text": "(a) If the board, or the complaint committee if authorized by the board, has a reasonable basis to believe that a person has engaged in an act or practice constituting the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the title certified interior designer, or a violation of a statute, rule, or order that the board has issued or is empowered to enforce, the board, or the complaint committee if authorized by the board, may proceed as described in subdivisions 2 and 3.\n(b) The board shall establish a complaint committee to investigate, mediate, or initiate administrative or legal proceedings on behalf of the board with respect to complaints filed with or information received by the board alleging or indicating the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the title certified interior designer, or a violation of statute, rule, or order that the board has issued or is empowered to enforce. The complaint committee shall consist of five members of the board, with no more than one from each of the professions licensed by the board, and no more than two public members.\n(c) Except as otherwise described in this section, all hearings shall be conducted in accordance with chapter 14.\n(a) When necessary to prevent the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the title certified interior designer, or a violation of a statute, rule, or order that the board has issued or is empowered to enforce, the board, or the complaint committee if authorized by the board, may bring an action in the name of the state in the district court in Ramsey County or in any county in which jurisdiction is proper to enjoin the act, practice, or violation and to enforce compliance with the statute, rule, or order. Upon a showing that a person has engaged in an act or practice constituting the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the title certified interior designer, or a violation of a statute, rule, or order that the board has issued or is empowered to enforce, a permanent or temporary injunction, restraining order, or other appropriate relief shall be granted.\n(b) For purposes of injunctive relief under this subdivision, irreparable harm exists when the board shows that a person has engaged in an act or practice constituting the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the title certified interior designer, or a violation of a statute, rule, or order that the board has issued or is empowered to enforce.\n(c) Injunctive relief granted under paragraph (a) does not relieve an enjoined person from criminal prosecution by a competent authority or from disciplinary action by the board with respect to the person's license, certificate, or application for examination, license, or renewal.\n(a) The board, or the complaint committee if authorized by the board, may issue and have served upon a person an order requiring the person to cease and desist from the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the titles architect, professional engineer, land surveyor, landscape architect, professional geologist, professional soil scientist, certified interior designer, or violation of the statute, rule, or order. The order shall be calculated to give reasonable notice of the rights of the person to request a hearing and shall state the reasons for the entry of the order.\n(b) Service of the order is effective if the order is served on the person or counsel of record personally or by certified mail to the most recent address provided to the board for the person or counsel of record.\n(c) Unless otherwise agreed by the board, or the complaint committee if authorized by the board, and the person requesting the hearing, the hearing shall be held no later than 30 days after the request for the hearing is received by the board.\n(d) The administrative law judge shall issue a report within 30 days of the close of the contested case hearing record, notwithstanding Minnesota Rules, part 1400.8100, subpart 3. Within 30 days after receiving the report and any exceptions to it, the board shall issue a further order vacating, modifying, or making permanent the cease and desist orders as the facts require.\n(e) If no hearing is requested within 30 days of service of the order, the order becomes final and remains in effect until it is modified or vacated by the board.\n(f) If the person to whom a cease and desist order is issued fails to appear at the hearing after being duly notified, the person is in default and the proceeding may be determined against that person upon consideration of the cease and desist order, the allegations of which may be considered to be true.\n(a) The board may, by order, deny, refuse to renew, suspend, temporarily suspend, or revoke the application, license, or certification of a person; censure or reprimand that person; condition or limit the person's practice; refuse to permit a person to sit for examination; or refuse to release the person's examination grades if the board finds that the order is in the public interest and the applicant, licensee, or certificate holder:\n(1) has violated a statute, rule, or order that the board has issued or is empowered to enforce;\n(2) has engaged in conduct or acts that are fraudulent, deceptive, or dishonest whether or not the conduct or acts relate to the practice of architecture, engineering, land surveying, landscape architecture, geoscience, or certified interior design, providing that the fraudulent, deceptive, or dishonest conduct or acts reflect adversely on the person's ability or fitness to engage in the practice of architecture, engineering, land surveying, landscape architecture, geoscience, or certified interior design;\n(3) has engaged in conduct or acts that are negligent or otherwise in violation of the standards established by Minnesota Rules, chapters 1800 and 1805, where the conduct or acts relate to the practice of architecture, engineering, land surveying, landscape architecture, geoscience, or use of the title certified interior designer;\n(4) has been convicted of or has pled guilty or nolo contendere to a felony, an element of which is dishonesty or fraud, whether or not the person admits guilt, or has been shown to have engaged in acts or practices tending to show that the applicant or licensee is incompetent or has engaged in conduct reflecting adversely on the person's ability or fitness to engage in the practice of architecture, engineering, land surveying, landscape architecture, geoscience, or use of the title certified interior designer;\n(5) employed fraud or deception in obtaining a certificate, license, renewal, or reinstatement or in passing all or a portion of the examination;\n(6) has had the person's architecture, engineering, land surveying, landscape architecture, geoscience, or interior design license, certificate, right to examine, or other similar authority revoked, suspended, canceled, limited, or not renewed for cause in any state, commonwealth, or territory of the United States, in the District of Columbia, or in any foreign country;\n(7) has had the person's right to practice before any federal, state, or other government agency revoked, suspended, canceled, limited, or not renewed;\n(8) failed to meet any requirement for the issuance or renewal of the person's license or certificate;\n(9) has attached the person's seal or signature to a plan, specification, report, plat, or other architectural, engineering, land surveying, landscape architectural, geoscientific, or interior design document not prepared by the person sealing or signing it or under that person's direct supervision; or\n(10) with respect to temporary suspension orders, has committed an act, engaged in conduct, or committed practices that may, or has in the opinion of the board, or the complaint committee if authorized by the board, resulted in an immediate threat to the public.\n(b) In lieu of or in addition to any remedy provided in paragraph (a), the board may require, as a condition of continued licensure, possession of certificate, termination of suspension, reinstatement of license or certificate, examination, or release of examination grades, that the person:\n(1) submit to a quality review of the person's ability, skills, or quality of work, conducted in such fashion and by such persons, entity, or entities as the board may require including, but not limited to, remedial education courses; and\n(2) complete to the satisfaction of the board such continuing professional education courses as the board may specify by rule.\n(c) Service of the order is effective if the order is served on the licensee, certificate holder, applicant, person, or counsel of record personally or by certified mail, to the most recent address provided to the board for the licensee, certificate holder, applicant, person, or counsel of record. The order shall state the reasons for the entry of the order.\n(d) All hearings required by this section shall be conducted in accordance with chapter 14, except with respect to temporary suspension orders, as provided for in subdivision 5, paragraph (d).\n(a) When the board, or the complaint committee if authorized by the board, issues a temporary suspension order, the suspension is in effect upon service of a written order on the licensee or counsel of record, specifying the statute, rule, or order violated. The order remains in effect until the board issues a final order in the matter after a hearing or upon agreement between the board and the licensee.\n(b) Service of the order is effective if the order is served on the licensee or counsel of record personally or by certified mail, to the most recent address provided to the board for the licensee or counsel of record.\n(c) The order shall set forth the rights to a hearing contained in this subdivision and shall state the reasons for the entry of the order.\n(d) Within ten days after service of the order, the licensee may request a hearing in writing. The board shall hold a hearing before its own members within five working days of receipt of a request for hearing on the sole issue of whether there is a reasonable basis to continue, modify, or lift the temporary suspension. This hearing is not subject to chapter 14. Evidence presented by the board or the licensee shall be in affidavit form only. The licensee or counsel of record may appear for oral argument.\n(e) Within five working days after the hearing, the board shall issue its order and, if the suspension is continued, schedule a contested case hearing within 30 days after issuance of the order. The administrative law judge shall issue a report within 30 days after closing of the contested case hearing record, notwithstanding the provisions of Minnesota Rules, part 1400.8100, subpart 3. The board shall issue a final order within 30 days after receipt of that report and any exceptions to it.\n(a) The board may impose a civil penalty not to exceed $10,000 per violation upon a person who commits an act or practice constituting the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the title certified interior designer, or violates a statute, rule, or order that the board has issued or is empowered to enforce.\n(b) The board may, in addition, impose a fee to reimburse the board for all or part of the cost of the proceedings resulting in disciplinary action authorized by this section, the imposition of civil penalties, or the issuance of a cease and desist order. The fee may be imposed when the board shows that the position of the person who commits an act or practice constituting the unauthorized practice of architecture, engineering, land surveying, landscape architecture, geoscience, or the unauthorized use of the title certified interior designer, or violates a statute, rule, or order that the board has issued or is empowered to enforce is not substantially justified, unless special circumstances make an award unjust, notwithstanding the provisions of Minnesota Rules, part 1400.8401. The costs include, but are not limited to, the amount paid by the board for services from the office of administrative hearings, attorney fees, court reporters, witnesses, reproduction of records, board members' per diem compensation, board staff time, and expense incurred by board members and staff.\nThe board may reinstate a suspended, revoked, or surrendered certificate or license upon petition of the former or suspended certificate holder or licensee. The board may, in its sole discretion, place any other conditions, including reexamination in whole or in part, upon reinstatement of a suspended, revoked, or surrendered certificate or license that it finds appropriate and necessary to ensure that the purposes of sections 326.02 to 326.15 are met. No suspended certificate or license shall be reinstated until the former certificate holder or licensee has completed one-half of the suspension.",
	"repealed": false
}