{
	"id": "611A.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/611A.74",
	"title": "611A.74 CRIME VICTIMS; RIGHTS; COMPLAINTS.",
	"text": "The commissioner shall have the authority under sections 611A.72 to 611A.74 to investigate decisions, acts, and other matters of the criminal justice system so as to promote the highest attainable standards of competence, efficiency, and justice for crime victims in the criminal justice system.\n[Repealed, 2002 c 220 art 7 s 33]\nThe commissioner may investigate complaints concerning possible violation of the rights of crime victims or witnesses provided under this chapter, the delivery of victim services by victim assistance programs, the administration of the crime victims reimbursement act, and other complaints of mistreatment by elements of the criminal justice system or victim assistance programs. The commissioner shall act as a liaison, when the commissioner deems necessary, between agencies, either in the criminal justice system or in victim assistance programs, and victims and witnesses. The commissioner may be concerned with activities that strengthen procedures and practices which lessen the risk that objectionable administrative acts will occur. The commissioner must answer questions concerning the criminal justice system and victim services put to the commissioner by victims and witnesses in accordance with the commissioner's knowledge of the facts or law, unless the information is otherwise restricted. The commissioner shall establish a procedure for referral to the crime victim crisis centers, the Crime Victims Reimbursement Board, and other victim assistance programs when services are requested by crime victims or deemed necessary by the commissioner.\nThe commissioner's files are confidential data as defined in section 13.02, subdivision 3, during the course of an investigation or while the files are active. Upon completion of the investigation or when the files are placed on inactive status, they are private data on individuals as defined in section 13.02, subdivision 12.\nThe commissioner has those powers necessary to carry out the duties set out in subdivision 2, including:\n(a) The commissioner may investigate, with or without a complaint, any action of an element of the criminal justice system or a victim assistance program included in subdivision 2.\n(b) The commissioner may request and shall be given access to information and assistance the commissioner considers necessary for the discharge of responsibilities. The commissioner may inspect, examine, and be provided copies of records and documents of all elements of the criminal justice system and victim assistance programs. The commissioner may request and shall be given access to police reports pertaining to juveniles and juvenile delinquency petitions, notwithstanding section 260B.171 or 260C.171. Any information received by the commissioner retains its data classification under chapter 13 while in the commissioner's possession. Juvenile records obtained under this subdivision may not be released to any person.\n(c) The commissioner may prescribe the methods by which complaints are to be made, received, and acted upon; may determine the scope and manner of investigations to be made; and subject to the requirements of sections 611A.72 to 611A.74, may determine the form, frequency, and distribution of commissioner conclusions, recommendations, and proposals.\n(d) After completing investigation of a complaint, the commissioner shall inform in writing the complainant, the investigated person or entity, and other appropriate authorities of the action taken. If the complaint involved the conduct of an element of the criminal justice system in relation to a criminal or civil proceeding, the commissioner's findings shall be forwarded to the court in which the proceeding occurred.\n(e) Before announcing a conclusion or recommendation that expressly or impliedly criticizes an administrative agency or any person, the commissioner shall consult with that agency or person.\nNeither the commissioner nor any member of the commissioner's staff may be compelled to testify or produce evidence in any judicial or administrative proceeding with respect to matters involving the exercise of official duties under sections 611A.72 to 611A.74 except as may be necessary to enforce the provisions of this section.\n(a) On finding a complaint valid after duly considering the complaint and whatever material the commissioner deems pertinent, the commissioner may recommend action to the appropriate authority.\n(b) If the commissioner makes a recommendation to an appropriate authority for action, the authority shall, within a reasonable time period, but not more than 30 days, inform the commissioner about the action taken or the reasons for not complying with the recommendation.\n(c) The commissioner may publish conclusions and suggestions by transmitting them to the governor, the legislature or any of its committees, the press, and others who may be concerned. When publishing an opinion adverse to an administrative agency, the commissioner shall include any statement the administrative agency may have made to the commissioner by way of explaining its past difficulties or its present rejection of the commissioner's proposals.\nIn addition to whatever reports the commissioner may make from time to time, the commissioner shall biennially report to the legislature and to the governor concerning the exercise of the commissioner's functions under sections 611A.72 to 611A.74 during the preceding biennium. The biennial report is due on or before the beginning of the legislative session following the end of the biennium.",
	"repealed": false
}