{
	"id": "60K.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.43",
	"title": "60K.43 LICENSE DENIAL, NONRENEWAL, OR REVOCATION.",
	"text": "The commissioner may, by order, restrict, censure, suspend, revoke, or refuse to issue or renew an insurance producer's license or may levy a civil penalty under section 45.027 or any combination of actions, for any one or more of the following causes:\n(1) providing incorrect, misleading, incomplete, or materially untrue information in the licensing application;\n(2) violating any insurance laws, including chapter 45 or chapters 60A to 72A, or violating any regulation, subpoena, or order of the commissioner or of another state's insurance commissioner;\n(3) obtaining or attempting to obtain a license through misrepresentation or fraud;\n(4) improperly withholding, misappropriating, or converting any money or properties received in the course of doing insurance business;\n(5) misrepresenting the terms of an actual or proposed insurance contract or application for insurance;\n(6) having pled guilty, with or without explicitly admitting guilt, pled nolo contendere, or been convicted of a felony, gross misdemeanor, or misdemeanor involving moral turpitude, including, but not limited to, assault or similar conduct;\n(7) having admitted or been found to have committed any insurance unfair trade practice or fraud;\n(8) using fraudulent, coercive, or dishonest practices, or demonstrating incompetence, untrustworthiness, or financial irresponsibility whether or not involving the business of insurance in this state or elsewhere;\n(9) having an insurance producer license, or its equivalent, denied, suspended, or revoked, or having been the subject of a fine or any other discipline in any other state, province, district, or territory;\n(10) forging another's name to an application for insurance or to any document, whether or not related to an insurance transaction;\n(11) improperly using notes or any other reference material to complete an examination for an insurance license;\n(12) knowingly accepting insurance business from an individual who is not licensed;\n(13) failing to comply with an administrative or court order imposing a child support obligation;\n(14) failing to pay state income tax or comply with any administrative or court order directing payment of state income tax;\n(15) being permanently or temporarily enjoined by any court of competent jurisdiction from engaging in or continuing any conduct or practice involving any aspect of the insurance business;\n(16) making any communication to a potential buyer that gives the impression that the producer is acting on behalf of a government agency; or\n(17) while performing residential mortgage activity regulated under chapter 58, violating any notification, disclosure, or record-keeping requirement, or any standard of conduct imposed by chapter 58.\n(a) If the commissioner determines that the producer is in violation of this section, the commissioner may issue an order requiring a licensee to show cause why any or all of the following should not occur:\n(1) the revocation or suspension of the license;\n(2) the censuring of the licensee; or\n(3) the imposition of a civil penalty.\nThe order must be calculated to give reasonable notice of the time and place for hearing on the matter and must state the reasons for the entry of the order. The commissioner may, by order, summarily suspend a license pending final determination of any order to show cause. If a license is suspended pending final determination of an order to show cause, a hearing on the merits must be held within 30 days of the issuance of the order of suspension. All hearings must be conducted in accordance with the provisions of chapter 14. After the hearing, the commissioner shall enter an order disposing of the matter as the facts require. If the licensee fails to appear at a hearing after having been duly notified of it, the licensee shall be considered in default, and the proceeding may be determined against the licensee upon consideration of the order to show cause, the allegations of which may be considered to be true.\n(b) In the event that the action by the commissioner is to nonrenew or to deny an application for a license, the commissioner shall notify the applicant or licensee and advise, in writing, the applicant or licensee of the reason for the denial or nonrenewal of the applicant's or licensee's license. The applicant or licensee may make written demand upon the commissioner within 30 days for a hearing to determine the reasonableness of the commissioner's action. The hearing must be held within 30 days and must be held pursuant to the contested case provisions of chapter 14. If no hearing is requested within 30 days of service of the notice of nonrenewal or denial, the nonrenewal or denial becomes final.\nThe license of a business entity may be suspended, revoked, or refused if the commissioner finds, after hearing, that an individual licensee's violation was known or should have been known by one or more of the partners, officers, or managers acting on behalf of the partnership or corporation and the violation was not reported to the commissioner in a timely manner.\nIn addition to or in lieu of any applicable denial, suspension, or revocation of a license, a person may, after hearing, be subject to a civil fine according to section 45.027, subdivision 6.\nIf a license lapses, is surrendered, withdrawn, terminated, or otherwise becomes ineffective, the commissioner may institute a proceeding under this subdivision within two years after the license was last effective and enter a revocation or suspension order as of the last date on which the license was in effect, or impose a civil penalty as provided for in section 45.027, subdivision 6.\nA revocation of a license prohibits the licensee from making a new application for a license for at least two years from the effective date of the revocation. Further, the commissioner shall, as a condition of reapplication, require the applicant to obtain a performance bond issued by an insurer authorized to transact business in this state in the amount of $20,000 or a greater amount the commissioner considers appropriate for the protection of citizens of this state in the event the commissioner grants the application. The bond must be filed with the commissioner, with the state of Minnesota as obligee, conditioned for the prompt payment to any aggrieved person entitled to payment of any amounts received by the licensee or to protect any aggrieved person from loss resulting from fraudulent, deceptive, dishonest, or other prohibited practices arising out of any transaction when the licensee was licensed or performed acts for which a license is required under this chapter. The bond remains operative for as long as that licensee is licensed. The bond required by this subdivision must provide coverage for all matters arising during the period of licensure.",
	"repealed": false
}