{
	"id": "122A.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.61",
	"title": "122A.61 RESERVED REVENUE FOR STAFF DEVELOPMENT.",
	"text": "(a) A district is required to reserve an amount equal to at least two percent of the basic revenue under section 126C.10, subdivision 2, for:\n(1) teacher development and evaluation under section 122A.40, subdivision 8, or 122A.41, subdivision 5;\n(2) principal development and evaluation under section 123B.147, subdivision 3;\n(3) professional development under section 122A.60;\n(4) in-service education for programs under section 120B.22, subdivision 2; and\n(5) teacher mentorship under section 122A.70, subdivision 1.\n(b) To the extent extra funds remain, staff development revenue may be used for staff development plans, including plans for challenging instructional activities and experiences under section 122A.60, and for curriculum development and programs, other in-service education, teachers' workshops, teacher conferences, the cost of substitute teachers for staff development purposes, preservice and in-service education for special education professionals and paraprofessionals, and other related costs for staff development efforts.\n(c) A district may annually waive the requirement to reserve their basic revenue under this section if a majority vote of the licensed teachers in the district and a majority vote of the school board agree to a resolution to waive the requirement. A district in statutory operating debt is exempt from reserving basic revenue according to this section. Districts may expend an additional amount of unreserved revenue for staff development based on their needs.\n[Repealed, 2014 c 272 art 3 s 57]\nA school district may use the revenue reserved under subdivision 1 for grants to the district's teachers to pay for coursework and training leading to certification as a college in the schools or concurrent enrollment teacher. In order to receive a grant, the teacher must be enrolled in a program that includes coursework and training focused on teaching a core subject.",
	"repealed": false
}