{
	"id": "572.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/572.41",
	"title": "572.41 DEBTOR AND CREDITOR MEDIATION.",
	"text": "The debtor and creditor in any transaction may request the other party to the transaction to enter mediation concerning possible adjustment, refinancing, or payment under this section and sections 572.31 to 572.40.\nAn individual who meets the qualifications established under subdivision 5 and who is willing to mediate in matters involving debtors and creditors may register with a nonprofit regional alternative dispute resolution corporation or, in a county where one does not exist, with the court administrator. The court administrator shall develop a list of mediators available in the county. It is desirable but not necessary that mediators under this section have knowledge of debtor and creditor law and relevant areas of finance. A mediator must not mediate a matter involving a debtor or creditor with whom the mediator has or has had a credit relationship.\nA debtor and creditor who agree to mediate may submit a written request for referral to a mediator to the court administrator in the county where either party resides or has a place of business. The court administrator shall assign a mediator from the list developed under subdivision 2. The court administrator may charge a fee for the referral not to exceed the conciliation court fee in that county.\nPrior to commencing mediation the debtor and creditor shall agree with each other and the mediator on the amount and allocation between them of any fee for the mediator's services.\nThe state court administrator, in consultation with the Bureau of Mediation Services, shall adopt rules to implement this section and may use portions of existing rules on certification of alternative dispute resolution programs that satisfy the purposes of this section. The rules must include qualifications of mediators under this section and grounds for challenging and removing mediators.",
	"repealed": false
}