{
	"id": "273.114",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.114",
	"title": "273.114 RURAL PRESERVE PROPERTY TAX PROGRAM.",
	"text": "MS 2010 [Repealed, 2011 c 13 s 8]\nClass 2b property that had been properly enrolled under section 273.111 for taxes payable in 2008, or that is part of an agricultural homestead under section 273.13, subdivision 23, paragraph (a), at least a portion of which is enrolled under section 273.111, is entitled to valuation and tax deferment under this section if:\n(1) the property is contiguous to class 2a property enrolled under section 273.111 under the same ownership;\n(2) there are no delinquent property taxes on the land; and\n(3) the property is not also enrolled for valuation and deferment under section 273.111 or 273.112, or chapter 290C or 473H.\nNotwithstanding sections 272.03, subdivision 8, and 273.11, the value of any real estate that qualifies under subdivision 2 must, upon timely application by the owner in the manner provided in subdivision 5, not exceed the value prescribed by the commissioner of revenue for class 2a tillable property in that county. The house and garage, if any, and the immediately surrounding one acre of land and a minor, ancillary nonresidential structure, if any, shall be valued according to their appropriate value. In determining the value for ad valorem tax purposes, the assessor shall not consider the presence of commercial, industrial, residential, or seasonal recreational land use influences that may affect the value of real estate subject to this section.\nThe assessor shall make a separate determination of the market value of the real estate based on its highest and best use. The tax based upon that value and the appropriate local tax rate applicable to the property in the taxing district shall be recorded on the property assessment records.\nApplication for deferment of taxes and assessment under this section shall be filed by May 1 of the year prior to the year in which the taxes are payable, provided that in calendar year 2011 the application must be filed before August 1. Any application filed under this subdivision and granted shall continue in effect for subsequent years until the property is withdrawn or no longer qualifies. The application must be filed with the assessor of the taxing district in which the real property is located on the form prescribed by the commissioner of revenue. Each application must include the most recent available aerial photograph or satellite image of the property provided by the Farm Service Agency of the United States Department of Agriculture or by the county geospatial information systems service that clearly delineates the land that is to be enrolled. The application form must contain a statement setting forth the consequences to the property owner of termination of qualification of property under the rural preserve program. The assessor may require proof by affidavit or otherwise that the property qualifies under subdivision 2.\n(a) When real property which is being, or has been valued and assessed under this section is sold, transferred, or no longer qualifies under subdivision 2, the portion sold, transferred, or no longer qualifying shall be subject to additional taxes in the amount equal to the difference between the taxes determined in accordance with subdivision 3 and the amount determined under subdivision 4, provided that the amount determined under subdivision 4 shall not be greater than it would have been had the actual bona fide sale price of the real property at an arm's-length transaction been used in lieu of the market value determined under subdivision 4. The additional taxes shall be extended against the property on the tax list for taxes payable in the current year, provided that no interest or penalties shall be levied on the additional taxes if timely paid and provided that the additional taxes shall only be levied with respect to the current year plus two prior years that the property has been valued and assessed under this section.\n(b) In the case of a sale or transfer, the additional taxes under paragraph (a) shall not be extended against the property if the new owner submits a successful application under this section by the later of May 1 of the current year or 30 days after the sale or transfer.\n(c) For the purposes of this section, the following events do not constitute a sale or transfer for property that qualified under subdivision 2 prior to the event:\n(1) death of a property owner when the surviving owners retain ownership of the property;\n(2) divorce of a married couple when one of the spouses retains ownership of the property;\n(3) marriage of a single property owner when that owner retains ownership of the property in whole or in part;\n(4) the organization or reorganization of a farm ownership entity that is not prohibited from owning agricultural land in this state under section 500.24, if all owners maintain the same beneficial interest both before and after the organization or reorganization; and\n(5) transfer of the property to a trust or trustee, provided that the individual owners of the property are the grantors of the trust and they maintain the same beneficial interest both before and after placement of the property in trust.\nThe additional tax imposed by this section shall be a lien upon the property assessed to the same extent and for the same duration as other taxes imposed on the property in this state. The tax shall be annually extended by the county auditor and if and when payable shall be collected and distributed in the manner provided by law for the collection and distribution of other property taxes.\nThe payment of special local assessments levied after June 1, 2011, for improvements made to any real property described in subdivision 1 together with the interest thereon shall, on timely application as provided in subdivision 6, be deferred as long as the property meets the conditions contained in this section. If special assessments against the property have been deferred pursuant to this subdivision, the governmental unit shall file with the county recorder in the county in which the property is located a certificate containing the legal description of the affected property and of the amount deferred. When the property no longer qualifies under subdivision 1, all deferred special assessments plus interest shall be payable in equal installments spread over the time remaining until the last maturity date of the bonds issued to finance the improvement for which the assessments were levied. If the bonds have matured, the deferred special assessments plus interest shall be payable within 90 days. The provisions of section 429.061, subdivision 2, apply to the collection of these installments. A penalty shall not be levied on these special assessments if timely paid. This subdivision does not apply to special assessments levied at any time by a county or district court under chapter 116A or by a watershed district under chapter 103D.",
	"repealed": false
}