{
	"id": "175.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/175.171",
	"title": "175.171 POWERS AND DUTIES, DEPARTMENT OF LABOR AND INDUSTRY.",
	"text": "The Department of Labor and Industry shall have the following powers and duties:\n(1) to exercise all powers and perform all duties of the department consistent with the provisions of this chapter;\n(2) to adopt reasonable and proper rules relative to the exercise of its powers and duties, and proper rules to govern its proceedings and to regulate the mode and manner of all investigations and hearings, which shall not be effective until ten days after their adoption, and a copy of these rules shall be delivered to every citizen making application therefor;\n(3) to collect, collate, and publish statistical and other information relating to the work under its jurisdiction, to keep records and to make public reports in its judgment necessary; and on or before October 1 in each even-numbered year the department shall report its doings, conclusions, and recommendations to the governor, which report shall be printed and distributed by November 15 of each even-numbered year to the legislature pursuant to section 3.195, and otherwise as the department may direct;\n(4) to establish and maintain branch offices as needed for the conduct of its affairs; and\n(5) to provide direct computer access to and electronic data interchange of public and nonpublic workers' compensation data and other data maintained by the department and to charge a reasonable fee for the access and electronic data interchange, except that in no circumstances may a fee be charged an employee or the employee's attorney seeking access and data interchange to information about the employee's claim or circumstances. Notwithstanding any other law to the contrary, the fee receipts for providing the computer access to and electronic data interchange of data shall be deposited in the special compensation fund. Access to and electronic data interchange of nonpublic data shall be only as authorized by the subject of the data, as authorized in chapter 13, or as otherwise authorized by law.",
	"repealed": false
}