{
	"id": "414.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.06",
	"title": "414.06 DETACHMENT OF PROPERTY FROM A MUNICIPALITY.",
	"text": "Property which is situated within a municipality and abutting the municipal boundary, rural in character and not developed for urban residential, commercial, or industrial purposes may be detached from the municipality according to the following procedure. The proceeding may be initiated by submitting to the chief administrative law judge a resolution of the municipality to which the land is attached or by submitting to the chief administrative law judge a petition of all of the property owners of the land to be detached if the area is less than 40 acres or of 75 percent of the property owners if over 40 acres. The petition or resolution shall set forth the boundaries and the area of the land to be detached, the number and character of the buildings, the resident population, and the municipal improvements, if any, in the area, and a statement of the reasons the petitioners or the municipality is seeking the detachment. In addition, the petitioners shall summarize what, if any, efforts were undertaken prior to filing the resolution or petition to resolve the issues forming the basis for the resolution or petition. If a petition is submitted without a resolution from the city, the petitioners shall also provide a copy of the petition to the city from which the land may be detached, and if the petition includes land for which a property owner has not signed the petition, to each property owner subject to the petition who has not signed the petition. A copy must also be mailed or otherwise delivered to the following parties: (1) the clerk of the town to which the property would be attached if the detachment is granted; (2) the clerk of any other abutting town or city; and (3) the county recorder in the county in which the land is located.\nUpon receipt of the notice provided in subdivision 1, the town board of the town to which the land is proposed to be attached may submit to the chief administrative law judge a resolution stating that the town board supports, opposes, or is neutral to the petition. The failure to submit a resolution before any hearing required under this section must be deemed a position of neutrality. If the town submits a resolution of support for a petition opposed by the municipality from which the land is proposed to be detached, or a resolution in opposition to a petition supported by a resolution of the municipality, the town becomes a party to the hearing required under this section and is subject to the distribution of costs as provided in subdivision 7.\nIf both a resolution of support from the municipality and a petition by all the property owners are submitted, and no resolution of opposition has been received from a town as provided in subdivision 1a, no hearing is necessary and the chief administrative law judge shall grant the petition. If both the municipality and town submit a resolution opposing the petition, a hearing must not be held and the chief administrative law judge shall deny the petition. In any other case, upon receipt of a petition or resolution, the chief administrative law judge shall designate a time and place for a hearing in accordance with section 414.09, except that instead of the meetings otherwise required under section 414.01, subdivision 16, the chief administrative law judge shall order the parties to participate in a mediation session. The mediator must be on a list of mediators approved by the Office of Administrative Hearings, unless the parties stipulate to a mediator not on the list. The cost of the mediation must be apportioned as provided for in subdivision 7.\nUpon completion of the hearing, the chief administrative law judge may order the detachment on finding that the requisite number of property owners have signed the petition if initiated by the property owners, that the property is rural in character and not developed for urban residential, commercial or industrial purposes, that the property is within the boundaries of the municipality and abuts a boundary, that the detachment would not unreasonably affect the symmetry of the detaching municipality, and that the land is not needed for reasonably anticipated future development. In making the findings, the chief administrative law judge shall consider all applicable comprehensive plans, land use regulations, and land use maps of the affected municipality, town, and county that have been adopted at the time the petition was submitted. The chief administrative law judge may deny the detachment on finding that the remainder of the municipality cannot continue to carry on the functions of government without undue hardship. The chief administrative law judge may decrease the area of property to be detached and may include only a part of the proposed area to be detached. If the tract abuts more than one town, it shall become a part of each town, being divided by projecting through it the boundary line between the towns. The detached area may be relieved of the primary responsibility for existing indebtedness of the municipality and be required to assume the indebtedness of the town of which it becomes a part, in such proportion as the chief administrative law judge shall deem just and equitable having in view the amount of taxes due and delinquent and the indebtedness of each town and the municipality affected, if any, and for what purpose the same was incurred, all in relation to the benefit inuring to the detached area as a result of the indebtedness and the last net tax capacity of the taxable property in each town and municipality.\nThe detachment shall be effective upon the issuance of the order, or at such later date, as provided by the order.\nA copy of the detachment order must be delivered immediately by the chief administrative law judge to the appropriate county auditors.\nFor the purposes of taxation, if the detachment becomes effective on or before August 1 of a levy year, the towns acquiring the detached area may levy on it beginning with that same levy year. If the detachment becomes effective after August 1 of a levy year, the municipality may continue to levy on the detached area for that levy year, and the towns acquiring the detached area may not levy on it until the following levy year.\nNotwithstanding the provisions of section 414.067, the chief administrative law judge shall apportion the costs of the mediation and hearing in an equitable manner, but unless the chief administrative law judge makes specific findings as to why a party shall be responsible for a greater share, the petitioning landowners are responsible for at least 50 percent of the total costs.",
	"repealed": false
}