{
	"id": "340A.404",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.404",
	"title": "340A.404 INTOXICATING LIQUOR; ON-SALE LICENSES.",
	"text": "(a) A city may issue an on-sale intoxicating liquor license to the following establishments located within its jurisdiction:\n(1) hotels;\n(2) restaurants;\n(3) bowling centers;\n(4) clubs or congressionally chartered veterans organizations with the approval of the commissioner, provided that the organization has been in existence for at least three years and liquor sales will only be to members and bona fide guests, except that a club may permit the general public to participate in a wine tasting conducted at the club under section 340A.419;\n(5) sports facilities, restaurants, clubs, or bars located on land owned or leased by the Minnesota Sports Facilities Authority;\n(6) sports facilities located on land owned by the Metropolitan Sports Commission;\n(7) exclusive liquor stores; and\n(8) resorts as defined in section 157.15, subdivision 11.\n(b) A city may issue an on-sale intoxicating liquor license, an on-sale wine license, or an on-sale malt liquor license to a theater within the city, notwithstanding any law, local ordinance, or charter provision. A license issued under this paragraph authorizes sales on all days of the week to persons attending events at the theater.\n(c) A city may issue an on-sale intoxicating liquor license, an on-sale wine license, or an on-sale malt liquor license to a convention center within the city, notwithstanding any law, local ordinance, or charter provision. A license issued under this paragraph authorizes sales on all days of the week to persons attending events at the convention center. This paragraph does not apply to convention centers located in the seven-county metropolitan area.\n(d) A municipality may issue an on-sale wine license and an on-sale malt liquor license to a person who is the owner of a summer collegiate league baseball team or baseball team competing in a league established by the Minnesota Baseball Association, or to a person holding a concessions or management contract with the owner, for beverage sales at a ballpark or stadium located within the municipality for the purposes of summer collegiate league baseball games, town ball games, and any other events at the ballpark or stadium, notwithstanding any law, local ordinance, or charter provision. A license issued under this paragraph authorizes sales on all days of the week to persons attending baseball games and any other events at the ballpark or stadium.\n(e) A municipality may issue an on-sale malt liquor license to a resort as defined in section 157.15, subdivision 11, notwithstanding any law, local ordinance, or charter provision. A license issued under this paragraph authorizes sales on all days of the week to persons staying at the resort and their guests.\nA municipality may issue an on-sale intoxicating liquor license to an auto racing facility located in the municipality. The license may authorize sales both to persons attending any and all events at the facility, and sales in a restaurant, bar, or banquet facility located on the premises of the auto racing facility. The license authorizes sales on all days of the week. The license may be issued for a space that is not compact and contiguous, provided that the licensed premises may include only the space within a defined area as described in the application for the license.\n(a) The city of Minneapolis may issue an on-sale intoxicating liquor license to the Guthrie Theater, the Cricket Theatre, the Orpheum Theatre, the State Theatre, and the Historic Pantages Theatre, notwithstanding the limitations of law, or local ordinance, or charter provision relating to zoning or school or church distances. The licenses authorize sales on all days of the week to holders of tickets for performances presented by the theaters and to members of the nonprofit corporations holding the licenses and to their guests.\n(b) The city of Minneapolis may issue an intoxicating liquor license to 510 Groveland Associates, a Minnesota cooperative, for use by a restaurant on the premises owned by 510 Groveland Associates, notwithstanding limitations of law, or local ordinance, or charter provision.\n(c) The city of Minneapolis may issue an on-sale intoxicating liquor license to Zuhrah Shrine Temple for use on the premises owned by Zuhrah Shrine Temple at 2540 Park Avenue South in Minneapolis, notwithstanding limitations of law, or local ordinances, or charter provision relating to zoning or school or church distances.\n(d) The city of Minneapolis may issue an on-sale intoxicating liquor license to the American Association of University Women, Minneapolis branch, for use on the premises owned by the American Association of University Women, Minneapolis branch, at 2115 Stevens Avenue South in Minneapolis, notwithstanding limitations of law, or local ordinances, or charter provisions relating to zoning or school or church distances.\n(e) The city of Minneapolis may issue an on-sale wine license and an on-sale 3.2 percent malt liquor license to a restaurant located at 5000 Penn Avenue South, and an on-sale wine license and an on-sale malt liquor license to a restaurant located at 1931 Nicollet Avenue South, notwithstanding any law or local ordinance or charter provision.\n(f) The city of Minneapolis may issue an on-sale wine license and an on-sale malt liquor license to the Brave New Workshop Theatre located at 3001 Hennepin Avenue South, the Theatre de la Jeune Lune, the Illusion Theatre located at 528 Hennepin Avenue South, the Hollywood Theatre located at 2815 Johnson Street Northeast, the Loring Playhouse located at 1633 Hennepin Avenue South, the Jungle Theater located at 2951 Lyndale Avenue South, Brave New Institute located at 2605 Hennepin Avenue South, the Guthrie Lab located at 700 North First Street, and the Southern Theatre located at 1420 Washington Avenue South, notwithstanding any law or local ordinance or charter provision. The license authorizes sales on all days of the week.\n(g) The city of Minneapolis may issue an on-sale intoxicating liquor license to University Gateway Corporation, a Minnesota nonprofit corporation, for use by a restaurant or catering operator at the building owned and operated by the University Gateway Corporation on the University of Minnesota campus, notwithstanding limitations of law, or local ordinance or charter provision. The license authorizes sales on all days of the week.\n(h) The city of Minneapolis may issue an on-sale intoxicating liquor license to the Walker Art Center's concessionaire or operator, for a restaurant and catering operator on the premises of the Walker Art Center, notwithstanding limitations of law, or local ordinance or charter provisions. The license authorizes sales on all days of the week.\n(i) The city of Minneapolis may issue an on-sale intoxicating liquor license to the Guthrie Theater's concessionaire or operator for a restaurant and catering operator on the premises of the Guthrie Theater, notwithstanding limitations of law, local ordinance, or charter provisions. The license authorizes sales on all days of the week.\n(j) The city of Minneapolis may issue an on-sale wine license and an on-sale malt liquor license to the Minnesota Book and Literary Arts Building, Inc.'s concessionaire or operator for a restaurant and catering operator on the premises of the Minnesota Book and Literary Arts Building, Inc. (dba Open Book), notwithstanding limitations of law, or local ordinance or charter provision. The license authorizes sales on all days of the week.\n(k) The city of Minneapolis may issue an on-sale intoxicating liquor license to a restaurant located at 5411 Penn Avenue South, notwithstanding any law or local ordinance or charter provision.\n(l) The city of Minneapolis may issue an on-sale intoxicating liquor license to the Museum of Russian Art's concessionaire or operator for a restaurant and catering operator on the premises of the Museum of Russian Art located at 5500 Stevens Avenue South, notwithstanding any law or local ordinance or charter provision.\n(m) The city of Minneapolis may issue an on-sale intoxicating liquor license to the American Swedish Institute or to its concessionaire or operator for use on the premises owned by the American Swedish Institute at 2600 Park Avenue South, notwithstanding limitations of law, or local ordinances, or charter provision relating to zoning or school or church distances.\n(n) Notwithstanding any other law, local ordinance, or charter provision, the city of Minneapolis may issue one or more on-sale intoxicating liquor licenses to the Minneapolis Society of Fine Arts (dba Minneapolis Institute of Arts), or to an entity holding a concessions or catering contract with the Minneapolis Institute of Arts for use on the premises of the Minneapolis Institute of Arts. The licenses authorized by this subdivision may be issued for space that is not compact and contiguous, provided that all such space is included in the description of the licensed premises on the approved license application. The licenses authorize sales on all days of the week.\n(o) The city of Minneapolis may issue an on-sale intoxicating liquor license to Norway House or to its concessionaire or operator for use on the premises owned by Norway House at 913 East Franklin Avenue, notwithstanding limitations of law, or local ordinances, or charter provision relating to zoning or school or church distances.\n(p) Notwithstanding any other law, including section 340A.504, subdivision 3, relating to seating requirements, local ordinance, or charter provision, the city of Minneapolis may issue one or more on-sale intoxicating liquor licenses to any entity holding a concessions or catering contract with the Minneapolis Park and Recreation Board for use on Minneapolis Park and Recreation Board premises. The licenses authorized by this subdivision may be used for space specified within the park property, provided all such space is included in the description of the licensed premises on the approved license application. The licenses authorize sales on the dates on the approved license application.\n(a) Notwithstanding any other law, local ordinance, or charter provision, the city of Minneapolis may issue one or more on-sale or combination on-sale and off-sale intoxicating liquor licenses to the owner of the sports arena located at 600 First Avenue North in Minneapolis, or to an entity holding a concessions contract with the owner for use on the premises of that sports arena.\n(b) The license authorizes sales on all days of the week to holders of tickets for events at the sports arena and to the owners of the sports arena and the owners' guests.\n(c) The licensee may not dispense intoxicating liquor to any person attending or participating in an amateur athletic event held on the premises unless such dispensing is authorized by the city. The city may not authorize the dispensing of intoxicating liquor at any event held under the auspices of the Minnesota State High School League.\n(d) The license authorized by this subdivision may be issued for space that is not compact and contiguous, provided that all such space is within the sports arena building and is included in the description of the licensed premises on the approved license application.\n(e) Notwithstanding any law or rule to the contrary, a person licensed to make off-sales within the sports arena building may deliver alcoholic beverages to rooms and suites within the sports arena building (1) between midnight and 8:00 a.m. on Monday through Thursday, and (2) between midnight and 8:00 a.m. and between 10:00 p.m. and midnight on Friday through Sunday. No delivery authorized by this paragraph may be made to a room or suite within the building at any time when an event utilizing the room or suite is in progress.\n(f) The holder of a license issued under this subdivision may dispense intoxicating liquor in miniature bottles if the intoxicating liquor is poured from the miniature bottles, mixed into another beverage, and dispensed on the premises by employees of the licensee.\nThe city of St. Paul may issue an on-sale intoxicating liquor license to the Fitzgerald Theatre, the Great American History Theater at 30 East 10th Street, and the Brave New Workshop at the Palace Theater at 17 West Seventh Place, notwithstanding the limitations of law, or local ordinance, or charter provision relating to zoning or school or church distances. The license authorizes sales on all days of the week to holders of tickets for performances presented by the theatre and to members of the nonprofit corporation holding the license and to their guests.\nA city shall within ten days of the issuance of a license under subdivision 1 or 5, inform the commissioner of the licensee's name and address and trade name, and the effective date and expiration date of the license. The city shall also inform the commissioner of a license transfer, cancellation, suspension, or revocation during the license period.\n(a) The governing body of a municipality may authorize a holder of a retail on-sale intoxicating liquor license issued by the municipality or by an adjacent municipality to dispense intoxicating liquor at any convention, banquet, conference, meeting, or social affair conducted on the premises of a sports, convention, or cultural facility owned by the municipality or instrumentality thereof having independent policy-making and appropriating authority and located within the municipality. The licensee must be engaged to dispense intoxicating liquor at an event held by a person or organization permitted to use the premises, and may dispense intoxicating liquor only to persons attending the event. The licensee may not dispense intoxicating liquor to any person attending or participating in a youth amateur athletic event, for persons 18 years of age or younger, held on the premises.\n(b) The governing body of a municipality may authorize a holder of a retail on-sale intoxicating liquor license issued by the municipality to dispense intoxicating liquor off premises at a community festival held within the municipality. The authorization shall specify the area in which the intoxicating liquor must be dispensed and consumed, and shall not be issued unless the licensee demonstrates that it has liability insurance as prescribed by section 340A.409 to cover the event.\n(a) Notwithstanding any other law, local ordinance, or charter provision, the commissioner may issue on-sale intoxicating liquor licenses:\n(1) to the state agency administratively responsible for, or to an entity holding a concession or facility management contract with such agency for beverage sales at, the premises of any Giants Ridge Recreation Area building or recreational improvement area owned by the state in the city of Biwabik, St. Louis County;\n(2) to the state agency administratively responsible for, or to an entity holding a concession or facility management contract with such agency for beverage sales at, the premises of any Ironworld Discovery Center building or facility owned by the state at Chisholm;\n(3) to the Board of Regents of the University of Minnesota for events at Northrop Auditorium, the intercollegiate football stadium, including any games played by the Minnesota Vikings at the stadium, and at no more than seven other locations within the boundaries of the University of Minnesota, provided that the Board of Regents has approved an application for a license for the specified location and provided that a license for an intercollegiate football stadium is void unless it meets the conditions of paragraph (b). It is solely within the discretion of the Board of Regents to choose the manner in which to carry out these conditions consistent with the requirements of paragraph (b); and\n(4) to the Duluth Entertainment and Convention Center Authority for beverage sales on the premises of the Duluth Entertainment and Convention Center Arena during intercollegiate hockey games.\nThe commissioner shall charge a fee for licenses issued under this subdivision in an amount comparable to the fee for comparable licenses issued in surrounding cities.\n(b) No alcoholic beverage may be sold or served at TCF Bank Stadium unless the Board of Regents holds an on-sale intoxicating liquor license for the stadium as provided in paragraph (a), clause (3), that provides for the sale of intoxicating liquor at a location in the stadium that is convenient to the general public attending an intercollegiate football game at the stadium. On-sale liquor sales to the general public must be available at that location through half-time of an intercollegiate football game at TCF Bank Stadium, and sales at the stadium must comply with section 340A.909.\n(a) A municipality may issue an on-sale wine license with the approval of the commissioner to a restaurant having facilities for seating at least 25 guests at one time. A wine license permits the sale of wine of up to 24 percent alcohol by volume for consumption. A wine license authorizes the sale of wine on all days of the week unless the issuing authority restricts the license's authorization to the sale of wine on all days except Sundays.\n(b) The governing body of a municipality may by ordinance authorize a holder of an on-sale wine license issued pursuant to paragraph (a) who is also licensed to sell 3.2 percent malt liquors at on-sale pursuant to section 340A.411, to sell intoxicating malt liquors at on-sale without an additional license.\n(c) A municipality may issue an on-sale wine license with the approval of the commissioner to a licensed bed and breakfast facility. A license under this paragraph authorizes a bed and breakfast facility to furnish wine only to registered guests of the facility and, if the facility contains a licensed commercial kitchen, also to guests attending private events at the facility.\n(d) The State Agricultural Society may issue an on-sale wine license to the holder of a state fair concession contract pursuant to section 37.21, subdivision 2.\nMS 2012 [Renumbered 340A.4175]\n(a) A county board may issue an annual on-sale intoxicating liquor license within the area of the county that is unorganized or unincorporated to a bowling center, restaurant, club, hotel, or resort as defined in section 157.15, subdivision 11, with the approval of the commissioner.\n(b) A county board may also with the approval of the commissioner issue up to ten seasonal on-sale licenses to restaurants and clubs for the sale of intoxicating liquor within the area of the county that is unorganized or unincorporated. Notwithstanding section 340A.412, subdivision 8, a seasonal license is valid for a period specified by the board, not to exceed nine months. Not more than one license may be issued for any one premises during any consecutive 12-month period.\n(c) A county board may issue an annual on-sale malt liquor license to a resort as defined in section 157.15, subdivision 11, within the area of the county that is unorganized or unincorporated, notwithstanding any law or local ordinance. A license issued under this paragraph authorizes sales on all days of the week to persons staying at the resort and their guests.\nMS 1990 [Repealed, 1991 c 249 s 33]\nOn-sale licenses may be issued by the Metropolitan Airports Commission for the sale of intoxicating liquor in major airports owned by the Metropolitan Airports Commission and used as terminals for regularly scheduled air passenger service. Notwithstanding any other law, the license authorized by this subdivision may be issued for space that is not compact and contiguous.\n(a) The commissioner may issue an on-sale intoxicating liquor license to a person regularly engaged, on an annual or seasonal basis, in the business of offering tours by boat on Lake Superior and adjacent bays, the St. Croix River, and the Mississippi River. The license shall authorize the sale of intoxicating liquor between May 1 and November 1 for consumption on the boat while underway or attached to a dock or other mooring. No license may be issued unless each boat used in the tour business regularly sells meals in the place where intoxicating liquor is sold.\n(b) All sales of intoxicating liquor made on a boat while it is attached to a dock or other mooring are subject to any restrictions on the sale of liquor prescribed by the governing body of the city where the boat is attached, or of a county when it is attached outside a city. A governing body may prohibit liquor sales within its jurisdiction but may not require an additional license, or require a fee or occupation tax, for the sales.\nThe commissioner may issue an on-sale license for the sale of intoxicating liquor within the boundaries of a military base or installation under the jurisdiction of the adjutant general with the approval of the adjutant general. No municipal or county license is required for the sale of intoxicating liquor under this subdivision.\n(a) The governing body of a municipality may issue to (1) a club or charitable, religious, or other nonprofit organization in existence for at least three years, (2) a political committee registered under section 10A.14, or (3) a state university, a temporary license for the on-sale of intoxicating liquor in connection with a social event within the municipality sponsored by the licensee. The license may authorize the on-sale of intoxicating liquor for not more than four consecutive days, except as provided for county fairs in section 340A.410, subdivision 10, and may authorize on-sales on premises other than premises the licensee owns or permanently occupies. The license may provide that the licensee may contract for intoxicating liquor catering services with the holder of a full-year on-sale intoxicating liquor license issued by any municipality. The licenses are subject to the terms, including a license fee, imposed by the issuing municipality. Licenses issued under this subdivision are subject to all laws and ordinances governing the sale of intoxicating liquor except sections 340A.409 and 340A.504, subdivision 3, paragraph (d), and those laws and ordinances which by their nature are not applicable. Licenses under this subdivision are not valid unless first approved by the commissioner of public safety.\n(b) A county under this section may issue a temporary license only to a premises located in the unincorporated or unorganized territory of the county.\n(c) The governing body of a municipality may issue to a brewer who manufactures fewer than 3,500 barrels of malt liquor in a year or a microdistillery a temporary license for the on-sale of intoxicating liquor in connection with a social event within the municipality sponsored by the brewer or microdistillery. The terms and conditions specified for temporary licenses under paragraph (a) shall apply to a license issued under this paragraph, except that the requirements of section 340A.409, subdivisions 1 to 3a, shall apply to the license.\nThe governing body of a municipality may issue to a farm winery licensed under section 340A.315 a temporary license for the on-sale at a county fair located within the municipality of intoxicating liquor produced by the farm winery. The licenses are subject to the terms, including a license fee, imposed by the issuing municipality and all laws and ordinances governing the sale of intoxicating liquor not inconsistent with this section. Licenses under this subdivision are not valid unless first approved by the commissioner of public safety.\nA restaurant licensed to sell intoxicating liquor or wine at on-sale under this section may permit a person purchasing a full bottle of wine in conjunction with the purchase of a meal to remove the bottle on leaving the licensed premises provided that the bottle has been opened and the contents partially consumed. A removal of a bottle under the conditions described in this subdivision is not an off-sale of intoxicating liquor and may be permitted without additional license.\nThe commissioner may issue a caterer's permit to a restaurant that holds an on-sale intoxicating liquor license issued by any municipality. The holder of a caterer's permit may sell intoxicating liquor as an incidental part of a food service that serves prepared meals at a place other than the premises for which the holder's on-sale intoxicating liquor license is issued.\n(a) A caterer's permit is auxiliary to the primary on-sale license held by the licensee.\n(b) The restrictions and regulations which apply to the sale of intoxicating liquor on the licensed premises also apply to the sale under the authority of a caterer's permit, and any act that is prohibited on the licensed premises is also prohibited when the licensee is operating other than on the licensed premises under a caterer's permit.\n(c) Any act, which if done on the licensed premises would be grounds for cancellation or suspension of the on-sale licensee, is grounds for cancellation of both the on-sale license and the caterer's permit if done when the permittee is operating away from the licensed premises under the authority of the caterer's permit.\n(d) The permittee shall notify prior to any catered event:\n(1) the police chief of the city where the event will take place, if the event will take place within the corporate limits of a city; or\n(2) the county sheriff of the county where the event will take place, if the event will be outside the corporate limits of any city.\n(e) If the primary license ceases to be valid for any reason, the caterer's permit ceases to be valid.\n(f) Permits issued under this subdivision are subject to all laws and ordinances governing the sale of intoxicating liquor except those laws and ordinances which by their nature are not applicable.\n(g) The annual state fee for a caterer's permit is $300.\nNotwithstanding any local ordinance or other law, a local government unit may adjust the licensing period for any holder of multiple on-sale alcoholic beverage licenses in the state, upon request of the licensee. The local government unit may charge a fee for an adjustment of the licensing period.\nNotwithstanding any other law, local ordinance, or charter provision, the governing body of a municipality may issue an on-sale intoxicating liquor license to a private, nonprofit college located within the municipality, or to any entity holding a caterer's permit and a contract with the private, nonprofit college for catering on the premises of the private, nonprofit college, or for any portion of the premises as described in the approved license application. The license authorized by this subdivision may be issued for space that is not compact and contiguous, provided that all such space is included in the description of the licensed premises on the approved license application. The license authorizes sales on all days of the week to persons attending events at the private, nonprofit college. All other provisions of this chapter not inconsistent with this section apply to the license authorized under this section.",
	"repealed": false
}