{
	"id": "68A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/68A.02",
	"title": "68A.02 HISTORIC STATUTORY PREMIUM RESERVE.",
	"text": "Upon issuance of each contract of title insurance issued on or after January 1, 1964, through January 1, 2001, by a domestic real estate title insurer, there shall be reserved initially a sum equal to ten percent of the original premium charged therefor. At the end of each calendar year following the year in which the contract of title insurance is issued, there shall be a reduction in the sum so reserved in the amount of one-twentieth of such sum. On any contract of title insurance issued prior to January 1, 1964, by a domestic real estate title insurer, a reserve shall be set up on January 1, 1964, and thereafter maintained in such sum as would have been required if the foregoing requirements with respect to title insurance reserves had existed at and after the date of the contract of title insurance. Such sums herein required to be reserved shall at all times and for all purposes be considered and constitute unearned portions of the original premiums on such contracts of title insurance, shall be charged as a reserve liability of the real estate title insurer in determining its financial condition, and, for the purpose of applying the provisions of section 60A.23, subdivision 4, shall be deemed to constitute the whole amount of the premiums on the unexpired risks of such real estate title insurer.\n(a) Additions to the reserve after January 1, 2001, and through January 1, 2004, must be made out of total charges for title insurance policies and guarantees written, equal to the sum of the following items, as set forth in the title insurer's most recent annual statement filed with the commissioner:\n(1) for each title insurance policy on a single risk written or assumed after January 1, 2001, a minimum rate of $0.36 per $1,000 of net retained liability for policies under $500,000 and $0.16 per $1,000 of net retained liability for policies of $500,000 or greater; and\n(2) a minimum of eight percent of escrow, settlement, and closing fees collected in contemplation of the issuance of title insurance policies or guarantees.\n(b) The amounts in paragraph (a) must be released from the reserve in accordance with section 68A.03, subdivision 3, paragraph (b).",
	"repealed": false
}