{
	"id": "169.792",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.792",
	"title": "169.792 REVOCATION OF LICENSE FOR FAILURE TO PRODUCE PROOF OF INSURANCE.",
	"text": "Any driver or owner of a vehicle consents, subject to the provisions of this section and section 169.791, to the requirement of having possession of proof of insurance, and to the revocation of the person's license if the driver or owner does not produce the required proof of insurance no later than the date and time specified in the citation for the driver's first court appearance, if a citation is issued, or within ten days of receipt of a written notice, if a written notice is sent or given. Any driver of a vehicle who is not the owner of the vehicle consents, subject to the provisions of this section and section 169.791, to providing to the officer the name and address of the owner of the vehicle.\nExcept as provided in subdivision 3, every driver of a vehicle shall, upon the demand of a peace officer, produce proof of insurance in force for the vehicle that was being operated at the time of the demand, to the district court administrator no later than the date and time specified in the citation for the driver's first court appearance. The required proof of insurance may be sent by the driver by mail as long as it is received no later than the date and time specified in the citation for the driver's first court appearance. A driver who is not the owner does not violate this section unless the driver knew or had reason to know that the owner did not have proof of insurance required by this section, provided that the driver provides the officer with the owner's name and address at the time of the demand or complies with subdivision 3.\nIf the driver is not the owner of the vehicle, then the driver shall provide the officer with the name and address of the owner at the time of the demand or shall, no later than the date and time specified in the citation for the driver's first court appearance, provide the district court administrator with proof of insurance or the name and address of the owner. Upon receipt of the owner's name and address, the district court administrator shall forward the information to the law enforcement agency. If the name and address received from the driver do not match information available to the district court administrator, the district court administrator shall notify the law enforcement agency of the discrepancy.\nIf the driver is not the owner of the vehicle, the officer may send or provide a notice to the owner requiring the owner to produce proof of insurance in force at the time of the demand covering the vehicle being operated. The notice shall be sent to the owner's current address or the address listed on the owner's driver's license. Within ten days after receipt of the notice, the owner shall produce the required proof of insurance to the place stated in the notice received by the owner. Notice to the owner by mail is presumed to be received within five days after mailing. It is not a defense that a person failed to notify the Department of Public Safety of a change of name or address as required under section 171.11.\n(a) When proof of insurance is demanded and none is in possession, the law enforcement agency may send or give the driver written notice as provided in this subdivision, unless the officer issues a citation to the driver under section 169.791 or 169.797. If the driver is not the owner and does not produce the required proof of insurance within ten days of the demand, the law enforcement agency may send or give written notice to the owner of the vehicle.\n(b) Within ten days after receipt of the notice, if given, the driver or owner shall produce the required proof of insurance to the place stated in the notice. Notice to the driver or owner by mail is presumed to be received within five days after mailing. It is not a defense that a person failed to notify the Department of Public Safety of a change of name or address as required under section 171.11.\n(c) The Department of Public Safety shall prescribe a form setting forth the written notice to be provided to the driver or owner. The department shall, upon request, provide a sample of the form to any law enforcement agency. The notice shall provide that the driver or owner must produce the proof of insurance to the law enforcement agency, at the place specified in the notice. The notice shall also state:\n(1) that Minnesota law requires every driver and owner to produce an insurance identification card, insurance policy, or written statement indicating that the vehicle had insurance at the time of an officer's demand, no later than the date and time specified in the citation for the driver's first court appearance, if a citation is issued, or within ten days of receipt of the written notice if a written notice is sent or given, provided, however, that a driver who does not own the vehicle shall provide the name and address of the owner;\n(2) that if the driver fails to produce the information within the required time or if the owner fails to produce the information within ten days of receipt of the notice from the peace officer, the commissioner of public safety shall revoke the person's driver's license or permit to drive for a minimum of 30 days, and shall revoke the registration of the vehicle;\n(3) that any person who displays or causes another to display an insurance identification card, insurance policy, or written statement, knowing that the insurance is not in force, is guilty of a misdemeanor; and\n(4) that any person who alters or makes a fictitious identification card, insurance policy, or written statement, or knowingly displays an altered or fictitious identification card, insurance policy, or written statement, is guilty of a misdemeanor.\nIf a driver fails to produce the required proof of insurance or name and address of the owner no later than the date and time specified in the citation for the driver's first court appearance, the district court administrator shall report the failure to the commissioner. If an owner who is not the driver fails to produce the required proof of insurance, or if a driver to whom a citation has not been issued does not provide proof of insurance or the owner's name and address, within ten days of receipt of the notice, the law enforcement agency shall report the failure to the commissioner. Failure to produce proof of insurance or the owner's name and address as required by this section must be reported to the commissioner promptly regardless of the status or disposition of any related criminal charges.\nUpon receiving the notification under subdivision 6 or notification of a conviction for violation of section 169.791, the commissioner shall revoke the person's driver's license or permit to drive. The revocation shall be effective beginning 14 days after the date of notification by the district court administrator or officer to the Department of Public Safety. In order to be revoked, notice must have been mailed to the person by the commissioner at least ten days before the effective date of the revocation. If the person, before the effective date of the revocation, provides the commissioner with the proof of insurance or other verifiable insurance information as determined by the commissioner, establishing that the required insurance covered the vehicle at the time of the original demand, the revocation must not become effective. Revocation based upon receipt of a notification under subdivision 6 must be carried out regardless of the status or disposition of any related criminal charge. The person's driver's license or permit to drive shall be revoked for the longer of: (i) the period provided in section 169.797, subdivision 4, paragraph (f), including any rules adopted under that paragraph, or (ii) until the driver or owner files proof of insurance with the Department of Public Safety satisfactory to the commissioner of public safety. A license must not be revoked more than once based upon the same demand for proof of insurance.\nA person whose license or permit has been revoked under subdivision 7 may obtain a new license or permit before the expiration of the period specified in subdivision 7 if the person provides to the Department of Public Safety proof of insurance or other verifiable insurance information as determined by the commissioner, establishing that insurance covered the vehicle at the time of the original demand and that any required insurance on any vehicle registered to the person remains in effect. The person shall pay the fee required by section 171.29, subdivision 2, paragraph (a), before reinstatement. The commissioner shall make a notation on the person's driving record indicating that the person satisfied the requirements of this subdivision. A person who knowingly provides false information for purposes of this subdivision is guilty of a misdemeanor.\nAt any time during a period of revocation imposed under this section, a driver or owner may request in writing a review of the order of revocation by the commissioner. Upon receiving a request, the commissioner or the commissioner's designee shall review the order, the evidence upon which the order was based, and any other material information brought to the attention of the commissioner, and determine whether sufficient cause exists to sustain the order. Within 15 days of receiving the request, the commissioner shall send the results of the review in writing to the person requesting the review. The review provided in this subdivision is not subject to the contested case provisions of the Administrative Procedure Act in sections 14.001 to 14.69.\nThe availability of administrative review for an order of revocation shall have no effect upon the availability of judicial review under section 171.19.\n[Repealed, 1992 c 571 art 14 s 14]\nBefore reinstatement of a driver's license or permit to drive, the driver or owner shall produce proof of insurance, or other form of verifiable insurance information as determined by the commissioner, indicating that the driver or owner has insurance coverage satisfactory to the commissioner. The commissioner may require the insurance identification card provided to satisfy this subdivision be certified by the insurance carrier to be noncancelable for a period not to exceed 12 months. The commissioner of public safety may also require an insurance identification card to be filed with respect to any and all vehicles required to be insured under section 65B.48 and owned by any person whose driving privileges have been revoked as provided in this section before reinstating the person's driver's license. A person who knowingly provides false information for purposes of this subdivision is guilty of a misdemeanor.\nBuses or other commercial vehicles operated by the Metropolitan Council, commercial vehicles required to file proof of insurance pursuant to chapter 221, and school buses as defined in section 171.01, subdivision 46, are exempt from this section.\nIf a person whose driver's license or permit is revoked under subdivision 7 is also the owner of the vehicle, the commissioner shall revoke the registration of the vehicle at the same time. If the owner of the vehicle does not have a driver's license or permit to drive, the commissioner shall revoke the registration of the vehicle. The commissioner shall reinstate registration of the vehicle only upon receiving proof of insurance or other verifiable insurance information as determined by the commissioner, and proof of compliance with all other requirements for reinstatement of motor vehicle registration, including payment of required fees.",
	"repealed": false
}