{
	"id": "116.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.065",
	"title": "116.065 CUMULATIVE IMPACTS ANALYSIS; PERMIT DECISIONS IN ENVIRONMENTAL JUSTICE AREAS.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of the Minnesota Pollution Control Agency.\n(c) \"Cumulative impacts\" means the impacts of aggregated levels of past and current air, water, and land pollution in a defined geographic area to which current residents are exposed.\n(d) \"Environmental justice\" means:\n(1) the fair treatment and meaningful involvement of all people, regardless of race, color, national origin, or income, with respect to the development, implementation, and enforcement of environmental laws, regulations, and policies; and\n(2) in all decisions that have the potential to affect the environment of an environmental justice area or the public health of its residents, due consideration is given to the history of the area's and its residents' cumulative exposure to pollutants and to any current socioeconomic conditions that could increase harm to those residents from additional exposure to pollutants.\n(e) \"Environmental justice area\" means one or more census tracts in Minnesota:\n(1) in which, based on the most recent decennial census data published by the United States Census Bureau:\n(i) 40 percent or more of the population is nonwhite;\n(ii) 35 percent or more of the households have an income at or below 200 percent of the federal poverty level; or\n(iii) 40 percent or more of the population over the age of five has limited English proficiency; or\n(2) located within Indian Country.\n(f) \"Environmental stressors\" means factors that may make residents of an environmental justice area susceptible to harm from exposure to pollutants. Environmental stressors include:\n(1) environmental effects on health from exposure to past and current pollutants in the environmental justice area, including any biomonitoring data from residents reported through the Centers for Disease Control, the Department of Health, or peer-reviewed scientific or medical articles; and\n(2) social and environmental factors, including but not limited to poverty, substandard housing, food insecurity, elevated rates of disease, and poor access to health insurance and medical care.\n(g) \"Indian Country\" has the meaning given in United States Code, title 18, section 1151.\n(h) \"Permit\" means a major source air permit, as defined in Minnesota Rules, part 7007.0200, or a state air permit required under Minnesota Rules, part 7007.0250, subpart 5 or 6. Permit includes a permit required for new construction or facility expansion or the reissuance of an existing permit.\n(a) This section applies to an application for a permit by a facility that:\n(1) is located in or within one mile of a census tract that is part of an environmental justice area; and\n(2) is located:\n(i) in the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington; or\n(ii) in a city of the first class.\n(b) The commissioner must enter into consultation, consistent with section 10.65, regarding the application of this section to permit applications located in Indian Country. After consultation, the Tribal government with jurisdiction over the applicable environmental justice area may elect that the facility seeking the permit action be subject to this section and must so notify the commissioner in writing.\n(a) The commissioner is responsible for determining:\n(1) whether a proposed permit action may substantially impact the environment or health of the residents of an environmental justice area; and\n(2) whether a cumulative impacts analysis is required.\n(b) A permit application must include:\n(1) the applicant's determination of whether the permit action sought is likely to impact the environment or the health of residents of an environmental justice area;\n(2) the data used by the applicant to make the determination; and\n(3) information and data necessary for the commissioner to determine whether the potential impact of issuing the permit exceeds any benchmarks adopted in rules required under subdivision 6 for requiring a cumulative analysis.\n(c) In making a determination whether a cumulative impacts analysis is required, the commissioner must:\n(1) review the permit application and the applicant's assessment of the need to conduct a cumulative analysis;\n(2) assess whether the proposed permit exceeds any of the benchmarks for conducting a cumulative impacts analysis established in rules adopted under subdivision 6; and\n(3) review any other information the commissioner deems relevant, including material evidence accompanying a petition submitted under paragraph (e).\n(d) The commissioner must require an applicant to conduct a cumulative impacts analysis if:\n(1) the potential impacts of the permit issuance exceed any of the benchmarks for conducting a cumulative impacts analysis established in rules adopted under subdivision 6; or\n(2) the commissioner determines that issuance of the permit may substantially impact the environment or health of the residents of an environmental justice area.\n(e) The commissioner may require the permit applicant or permit holder to conduct a cumulative impacts analysis if:\n(1) the facility is below all the benchmarks established for conducting a cumulative impacts analysis and the commissioner determines that a cumulative impacts analysis is necessary and supported by material evidence; or\n(2) a petition requesting that a cumulative analysis be conducted is signed by at least 100 individuals who reside or own property in the environmental justice area impacted by the facility and is supported by material evidence that demonstrates a potential adverse cumulative impact to the impacted environmental justice area if the permit is issued.\n(f) The commissioner must prepare a written document containing the reasons for the commissioner's decision regarding the need for a cumulative impacts analysis. The document must describe the information that was considered in making the decision and how the information was weighed. The commissioner must post the document on the agency website within 30 days of the determination.\n(a) A permit applicant or permit holder required to conduct a cumulative impacts analysis under this section must hold at least two public meetings in the environmental justice area impacted by the facility before the commissioner issues or denies a permit. The first public meeting must be held before conducting a cumulative impacts analysis, and the second must be held after conducting the analysis.\n(b) Before any public meeting held under this subdivision, the permit applicant or permit holder must:\n(1) publish notice containing the date, time, and location of the public meeting and a brief description of the permit or project in a newspaper of general circulation in the environmental justice area at least 30 days before the meetings;\n(2) post physical signage in the environmental justice area impacted, as directed by the commissioner; and\n(3) provide the commissioner with notice of the public meeting and a copy of the cumulative impacts analysis at least 45 days before the second public meeting.\n(c) The commissioner must post the notice and cumulative impacts analysis on the agency website at least 30 days before the second public meeting.\n(d) At any public meeting held under this subdivision, the permit applicant or permit holder must:\n(1) provide an opportunity for robust public and Tribal engagement; and\n(2) accept written and oral comments, as directed by the commissioner, from any interested party.\n(e) After a public meeting held under this subdivision, the permit applicant or permit holder must provide an electronic copy of all written comments and a transcript of all oral comments to the agency within 30 days of the meeting.\n(f) If the permit applicant or permit holder is applying for more than one permit that may affect the same environmental justice area, the permit applicant or permit holder may request that the commissioner consolidate the public meeting requirements under this subdivision, requiring the facility to hold two public meetings that address all of the permits sought. The commissioner may approve or deny the request.\n(g) The commissioner may incorporate conditions in a permit for a facility located in or affecting an environmental justice area to hold multiple in-person meetings with residents of the environmental justice area affected by the facility to share information and discuss community concerns.\n(a) In determining whether to issue or deny a permit under this section, the commissioner must consider the cumulative impacts analysis conducted, the testimony presented, and comments submitted in public meetings held under subdivision 4. The permit may be issued no earlier than 30 days following the last public meeting held under subdivision 4.\n(b) Unless the commissioner enters into a community benefit agreement with the facility owner or operator, the commissioner must deny a permit subject to this section for a facility in an environmental justice area if the cumulative impacts analysis determines that issuing the permit, in combination with the environmental stressors present in the environmental justice area and considering the socioeconomic impact of the facility to the residents of the environmental justice area, would have a substantial adverse impact on the environment or health of the environmental justice area and its residents.\n(c) If the facility owner or operator enters into a community benefit agreement with the commissioner, the agency may grant a permit that imposes conditions on the construction and operation of the facility to protect public health and the environment.\n(d) A community benefit agreement must be signed on or before the date a new or reissued permit is issued in an environmental justice area.\n(e) The commissioner must publish and maintain on the agency website a list of environmental justice areas in the state.\n(f) The agency must maintain an updated database of identified environmental stressors in specific census tracts and make this database accessible to the public.\n(a) The commissioner must adopt rules under chapter 14 to implement and govern the cumulative impacts analysis and issuance or denial of permits for facilities that impact environmental justice areas as provided in this section. Notwithstanding section 14.125, the agency must publish the notice of intent to adopt rules within 36 months of May 25, 2023, or the authority for the rules expires.\n(b) During the rulemaking process, the Pollution Control Agency must engage in robust public engagement, including public meetings, and Tribal consultation.\n(c) Rules adopted under this section must:\n(1) establish benchmarks to assist the commissioner's determination regarding the need for a cumulative impacts analysis;\n(2) establish the required content of a cumulative impacts analysis and must provide sources of public information that an applicant can access regarding environmental stressors that are present in an environmental justice area;\n(3) define conditions, criteria, or circumstances that establish an environmental or health impact as a substantial adverse impact;\n(4) establish the content of a community benefit agreement and procedures for entering into community benefit agreements, which must include:\n(i) active outreach to residents of the impacted environmental justice area designed to achieve significant community participation;\n(ii) considerations other than or in addition to economic considerations, but with priority given to considerations that directly impact the residents of the environmental justice area; and\n(iii) at least one public meeting held within the impacted environmental justice area;\n(5) establish a petition process and form to be submitted to the agency by environmental justice area residents to support the need for a cumulative impact analysis;\n(6) establish a process by which a Tribal government can elect to apply this section to a permit application, as provided under subdivision 2; and\n(7) establish methods for holding public meetings and handling public comments as required under subdivision 4.\n(d) The agency must provide translation services and translated materials upon request during rulemaking meetings.\n(e) The agency must provide public notice on the agency website at least 30 days before public meetings held on the rulemaking. The notice must include the date, time, and location of the meeting. The agency must use multiple communication methods to inform residents of environmental justice areas in the public meetings held for the rulemaking.\nA permit applicant is responsible for the cost of complying with this section. The reasonable costs of the agency to comply with this section are to be borne by permit applicants subject to this section, as required under section 116.07, subdivision 4d, paragraph (b).",
	"repealed": false
}