{
	"id": "297A.995",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.995",
	"title": "297A.995 UNIFORM SALES AND USE TAX ADMINISTRATION ACT.",
	"text": "This section may be cited as the Uniform Sales and Use Tax Administration Act.\nAs used in this section:\n(a) \"Agreement\" means the Streamlined Sales and Use Tax Agreement.\n(b) \"Certified automated system\" means software certified jointly by the states that are signatories to the agreement to calculate the tax imposed by each jurisdiction on a transaction, determine the amount of tax to remit to the appropriate state, and maintain a record of the transaction.\n(c) \"Certified service provider\" means an agent certified jointly by the states that are signatories to the agreement to perform all of the seller's sales tax functions.\nThe legislature finds that this state should enter into an agreement with one or more states to simplify and modernize sales and use tax administration in order to substantially reduce the burden of tax compliance for all sellers and for all types of commerce.\nThe commissioner of revenue is authorized and directed to enter into the agreement with one or more states to simplify and modernize sales and use tax administration in order to substantially reduce the burden of tax compliance for all sellers and for all types of commerce. In furtherance of the agreement, the commissioner is authorized to act jointly with other states that are members of the agreement to establish standards for certification of a certified service provider and certified automated system and establish performance standards for multistate sellers.\nThe commissioner of revenue is further directed to negotiate the agreement with the express intention of ensuring uniform sales and use taxation as applied to like-kind transactions.\nThe commissioner is further authorized to take other actions reasonably required to implement the provisions set forth in this article. Other actions authorized by this section include, but are not limited to, the adoption of rules and regulations and the joint procurement, with other member states, of goods and services in furtherance of the cooperative agreement.\nThe following officials are authorized to represent this state before the other states that are signatories to the agreement:\n(1) the commissioner or the commissioner's designee;\n(2) the chair of the house of representatives committee with jurisdiction over taxes or the house chair's designee; and\n(3) the chair of the senate committee with jurisdiction over taxes or the senate chair's designee.\nNo provision of the agreement authorized by this bill in whole or part invalidates or amends any provision of the law of this state. Adoption of the agreement by this state does not amend or modify any law of this state. Implementation of any condition of the agreement in this state, whether adopted before, at, or after membership of this state in the agreement, must be by the action of this state.\nThe commissioner of revenue shall not enter into the agreement unless the agreement requires each state to abide by the following requirements:\n(a) Uniform state rate. The agreement must set restrictions to achieve more uniform state rates through the following:\n(1) limiting the number of state rates;\n(2) eliminating maximums on the amount of state tax that is due on a transaction; and\n(3) eliminating thresholds on the application of state tax.\n(b) Uniform standards. The agreement must establish uniform standards for the following:\n(1) the sourcing of transactions to taxing jurisdictions;\n(2) the administration of exempt sales;\n(3) the allowances a seller can take for bad debts; and\n(4) sales and use tax returns and remittances.\n(c) Uniform definitions. The agreement must require states to develop and adopt uniform definitions of sales and use tax terms. The definitions must enable a state to preserve its ability to make policy choices not inconsistent with the uniform definitions.\n(d) Central registration. The agreement must provide a central, electronic registration system that allows a seller to register to collect and remit sales and use taxes for all signatory states.\n(e) No nexus attribution. The agreement must provide that registration with the central registration system and the collection of sales and use taxes in the signatory states will not be used as a factor in determining whether the seller has nexus with a state for any tax.\n(f) Local sales and use taxes. The agreement must provide for reduction of the burdens of complying with local sales and use taxes through the following:\n(1) restricting and eliminating variances between the state and local tax bases;\n(2) requiring states to administer any sales and use taxes levied by local jurisdictions within the state so that sellers collecting and remitting these taxes will not have to register or file returns with, remit funds to, or be subject to independent audits from local taxing jurisdictions;\n(3) restricting the frequency of changes in the local sales and use tax rates and setting effective dates for the application of local jurisdictional boundary changes to local sales and use taxes; and\n(4) providing notice of changes in local sales and use tax rates and of changes in the boundaries of local taxing jurisdictions.\n(g) Monetary allowances. The agreement must outline any monetary allowances that are to be provided by the states to sellers or certified service providers.\n(h) State compliance. The agreement must require each state to certify compliance with the terms of the agreement prior to joining and to maintain compliance, under the laws of the member state, with all provisions of the agreement while a member.\n(i) Consumer privacy. The agreement must require each state to adopt a uniform policy for certified service providers that protects the privacy of consumers and maintains the confidentiality of tax information.\n(j) Advisory councils. The agreement must provide for the appointment of an advisory council of private sector representatives and an advisory council of nonmember state representatives to consult with in the administration of the agreement.\nThe agreement authorized by this bill is an accord among individual cooperating sovereigns in furtherance of their governmental functions. The agreement provides a mechanism among the member states to establish and maintain a cooperative, simplified system for the application and administration of sales and use taxes under the duly adopted law of each member state.\n(a) The agreement authorized by this bill binds and inures only to the benefit of this state and the other member states. No person, other than a member state, is an intended beneficiary of the agreement. Any benefit to a person other than a state is established by the law of this state and the other member states and not by the terms of the agreement.\n(b) Consistent with paragraph (a), no person shall have any cause of action or defense under the agreement or by virtue of this state's approval of the agreement. No person may challenge, in any action brought under any provision of law, any action or inaction by any department, agency, or other instrumentality of this state, or any political subdivision of this state, on the ground that the action or inaction is inconsistent with the agreement.\n(c) No law of this state, or its application, may be declared invalid as to any person or circumstance on the ground that the provision or application is inconsistent with the agreement.\n(a) A certified service provider is the agent of a seller, with whom the certified service provider has contracted, for the collection and remittance of sales and use taxes. As the seller's agent, the certified service provider is liable for sales and use tax due each member state on all sales transactions it processes for the seller except as set out in this section.\nA seller that contracts with a certified service provider is not liable to the state for sales or use tax due on transactions processed by the certified service provider unless the seller misrepresented the type of items it sells or committed fraud. In the absence of probable cause to believe that the seller has committed fraud or made a material misrepresentation, the seller is not subject to audit on the transactions processed by the certified service provider. A seller is subject to audit for transactions not processed by the certified service provider. The member states acting jointly may perform a system check of the seller and review the seller's procedures to determine if the certified service provider's system is functioning properly and the extent to which the seller's transactions are being processed by the certified service provider.\n(b) A person that provides a certified automated system is responsible for the proper functioning of that system and is liable to the state for underpayments of tax attributable to errors in the functioning of the certified automated system. A seller that uses a certified automated system remains responsible and is liable to the state for reporting and remitting tax.\n(c) A seller that has a proprietary system for determining the amount of tax due on transactions and has signed an agreement establishing a performance standard for that system is liable for the failure of the system to meet the performance standard.\n(a) Notwithstanding subdivision 9, sellers and certified service providers are relieved from liability to the state for having charged and collected the incorrect amount of sales or use tax resulting from the seller or certified service provider (1) relying on erroneous data provided by the commissioner in the database files on tax rates, boundaries, or taxing jurisdiction assignments, or (2) relying on erroneous data provided by the state in its taxability matrix concerning the taxability of products and services.\n(b) Notwithstanding subdivision 9, sellers and certified service providers are relieved from liability to the state for having charged and collected the incorrect amount of sales or use tax resulting from the seller or certified service provider relying on the certification by the commissioner as to the accuracy of a certified automated system as to the taxability of product categories. The relief from liability provided by this paragraph does not apply when the sellers or certified service providers have incorrectly classified an item or transaction into a product category, unless the item or transaction within a product category was approved by the commissioner or approved jointly by the states that are signatories to the agreement. The sellers and certified service providers must revise a classification within ten days after receipt of notice from the commissioner that an item or transaction within a product category is incorrectly classified as to its taxability, or they are not relieved from liability for the incorrect classification following the notification.\n(c) Notwithstanding subdivision 9, if there are not at least 30 days between the enactment of a new tax rate and the effective date of the new rate, sellers and certified service providers shall be relieved from liability for failing to collect tax at the new rate during the first 30 days of the rate change, beginning on the day after the date of enactment of the rate change, provided the seller or certified service provider continued to impose and collect the tax at the immediately preceding tax rate during this period. Relief from liability provided by this paragraph shall not apply if the failure to collect at the newly effective rate extends beyond 30 days after the enactment of the new rate. The relief provided by this paragraph shall not apply if the commissioner determines that the seller or certified service provider fraudulently failed to collect at the new rate or that the seller or certified service provider solicited purchasers based on the immediately preceding tax rate.\n(a) Notwithstanding other provisions in the law, a purchaser is relieved from liability resulting from having paid the incorrect amount of sales or use tax if a purchaser, whether or not the commissioner gave the purchaser direct pay authorization, or a purchaser's seller or certified service provider relied on erroneous data provided by this state in the database files on tax rates, boundaries, taxing jurisdiction assignments, or in the taxability matrix. After providing an address-based database for assigning taxing jurisdictions and their associated rates, no relief for errors resulting from the purchaser's reliance on a database using zip codes is allowed.\n(b) With respect to reliance on the taxability matrix provided by this state in paragraph (a), relief is limited to erroneous classifications in the taxability matrix for items included within the classifications as \"taxable,\" \"exempt,\" \"included in sales price,\" \"excluded from sales price,\" \"included in the definition,\" and \"excluded from the definition.\"\n(c) Notwithstanding other provisions in the law, if there are not at least 30 days between the enactment of a new tax rate and the effective date of the new rate, a purchaser shall be relieved from liability resulting from failing to pay the tax at the new rate during the first 30 days of the rate change, beginning on the day after the date of enactment of the rate change, whether or not the purchaser has been given direct pay authorization by the commissioner. Relief from liability provided by this paragraph shall not apply if the failure to pay at the newly effective rate extends beyond 30 days after the enactment of the new rate, and shall not apply to a purchaser that did not continue to pay the tax at the immediately preceding tax rate during the 30-day period. The relief provided by this paragraph shall not apply if the commissioner determines that the purchaser fraudulently failed to pay at the new rate.\nFor purposes of this section, \"database files on tax rates, boundaries, and taxing jurisdiction assignments\" and the \"taxability matrix\" means those databases and the taxability matrix required under the agreement.",
	"repealed": false
}