{
	"id": "3.9221",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.9221",
	"title": "3.9221 INDIAN TRIBES; COMPACTS TO BE NEGOTIATED.",
	"text": "For purposes of this section, \"act\" means the Indian Gaming Regulatory Act, Public Law 100-497, and future amendments to it.\nThe governor or the governor's designated representatives shall, pursuant to section 11 of the act, negotiate in good faith a tribal-state compact regulating the conduct of class III gambling, as defined in section 4 of the act, on Indian lands of a tribe requesting negotiations. The agreement may include any provision authorized under section 11(d)(3)(C) of the act. The attorney general is the legal counsel for the governor or the governor's representatives in regard to negotiating a compact under this section. If the governor appoints designees to negotiate under this subdivision, the designees must include at least two members of the senate and two members of the house of representatives, two of whom must be the chairs of the senate and house of representatives standing committees with jurisdiction over gambling policy.\n(a) In the case of negotiations undertaken pursuant to a request for negotiations received before April 20, 1989, the authority granted under subdivision 2 to negotiate with an Indian tribe expires 180 days after April 20, 1989.\n(b) In the case of negotiations undertaken pursuant to a request for negotiations received after April 20, 1989, the authority granted under subdivision 2 to negotiate with an Indian tribe expires 180 days after receipt of the request by the governor.\nA compact agreed to on behalf of the state under this section must contain:\n(1) a provision recognizing the right of each party to the agreement, including the legislature by joint resolution, to request that the agreement be renegotiated or replaced by a new compact, and providing the terms under which either party, including the legislature, can request a renegotiation or the negotiation of a new compact; and\n(2) a provision that in the event of a request for a renegotiation or a new compact the existing compact will remain in effect until renegotiated or replaced.\nThe governor, the attorney general, and the governor's designated representatives shall report to the house of representatives and senate committees having jurisdiction over gambling regulation annually. This report shall contain information on compacts negotiated, and an outline of prospective negotiations.",
	"repealed": false
}