{
	"id": "147B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/147B.01",
	"title": "147B.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Acupressure\" means the application of pressure to acupuncture points.\n\"Acupuncture practice\" means a comprehensive system of health care using Oriental medical theory and its unique methods of diagnosis and treatment. Its treatment techniques include the insertion of acupuncture needles through the skin and the use of other biophysical methods of acupuncture point stimulation, including the use of heat, Oriental massage techniques, electrical stimulation, herbal supplemental therapies, dietary guidelines, breathing techniques, and exercise based on Oriental medical principles.\n\"Acupuncture needle\" means a needle designed exclusively for acupuncture purposes. It has a solid core, with a tapered point, and is 0.12 mm to 0.45 mm in thickness. It is constructed of stainless steel, gold, silver, or other board-approved materials as long as the materials can be sterilized according to recommendations of the National Centers for Disease Control and Prevention.\n\"Acupuncture points\" means specific anatomically described locations as defined by the recognized acupuncture reference texts. These texts are listed in the study guide to the examination for the NCCAOM certification exam.\n\"Acupuncture practitioner\" means a person licensed to practice acupuncture under this chapter.\n\"Board\" means the Board of Medical Practice or its designee.\nMS 2000 [Repealed, 2002 c 375 art 3 s 11]\n\"Breathing techniques\" means Oriental breathing exercises taught to a patient as part of a treatment plan.\n\"Cupping\" means a therapy in which a jar-shaped instrument is attached to the skin and negative pressure is created by using suction.\n\"Dermal friction\" means rubbing on the surface of the skin, using topical ointments with a smooth-surfaced instrument without a cutting edge that can be sterilized or, if disposable, a onetime only use product.\n\"Diplomate in acupuncture\" means a person who is certified by the NCCAOM as having met the standards of competence established by the NCCAOM, who subscribes to the NCCAOM code of ethics, and who has a current and active NCCAOM certificate. Current and active NCCAOM certification indicates successful completion of continued professional development and previous satisfaction of NCCAOM requirements.\n\"Electrical stimulation\" means a method of stimulating acupuncture points by an electrical current of .001 to 100 milliamps, or other current as approved by the board. Electrical stimulation may be used by attachment of a device to an acupuncture needle or may be used transcutaneously without penetrating the skin.\n\"Herbal therapies\" are the use of herbs and patent herbal remedies as supplements as part of the treatment plan of the patient.\nMS 2000 [Repealed, 2002 c 375 art 3 s 11]\n\"NCCAOM\" means the National Certification Commission for Acupuncture and Oriental Medicine, a not-for-profit corporation organized under section 501(c)(4) of the Internal Revenue Code.\n\"NCCAOM certification\" means a certification granted by the NCCAOM to a person who has met the standards of competence established for either NCCAOM certification in acupuncture or NCCAOM certification in Oriental medicine.\n\"Needle sickness\" is a temporary state of nausea and dizziness that is a potential side effect to needle insertion and from which full recovery occurs when the needles are removed.\n\"Oriental medicine\" means a system of healing arts that perceives the circulation and balance of energy in the body as being fundamental to the well-being of the individual. It implements the theory through specialized methods of analyzing the energy status of the body and treating the body with acupuncture and other related modalities for the purpose of strengthening the body, improving energy balance, maintaining or restoring health, improving physiological function, and reducing pain.",
	"repealed": false
}