{
	"id": "134.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.20",
	"title": "134.20 REGIONAL PUBLIC LIBRARY SYSTEMS.",
	"text": "Two or more counties or two or more cities located in two or more counties may, through action by their governing bodies under section 471.59, establish and maintain a regional public library system, even though one or more of the counties or cities may already have a library with a library board. In a county or city already having a library board, the approval of the library board shall also be required. Cities having public libraries may join in the regional public library system by being parties to the agreement which establishes the regional public library system through action of their library boards and their city councils, or as provided in subdivision 3.\nThe agreement establishing a regional public library system shall provide for a library board to govern the organization having all the powers and duties of city and county library boards as provided in sections 134.11, 134.12, and 134.13 and including exclusive determination of all library services to be provided under terms of the agreement as defined in section 134.001, and exclusive control of the expenditure of all funds for the services. The regional library system board may consist of as many members as the contracting parties deem necessary, appointed in a number from among the residents of the contracting parties and for terms by each party to the contract as determined by the contracting parties, irrespective of the existence of one or more city and county library boards already in existence in the participating cities and counties. Not more than one member from each contracting party shall be a member of the governing body of a contracting party and no member may be appointed to serve more than three consecutive three-year terms. In the participating cities and counties, the portion of the proceeds of the city and county library tax authorized by section 134.07, shall be used to support the regional public library system as the contracting agreement may provide.\nWhere a regional public library system is established, a city located in any of the contracting counties which is excluded from the county tax supporting the regional public library system under the provisions of section 134.07, may, upon recommendation of its library board and upon action by its governing body, be included in the county tax and become an integral part of the regional public library system. Cities included in the county tax and with public libraries which are part of the regional public library system, whether or not governed by home rule charter provisions, upon action by their city council, may levy taxes for the additional support of their local library services. A local public library board or governing body may, at its option, continue to control the local library fund or pay all or part of it to the regional public library system fund, to be used to increase or improve public library services in the city.\nAll property given, granted, conveyed, donated, devised or bequeathed to, or otherwise acquired by any regional library board or any regional public library system board however created shall vest in, and be held in the name of, the regional library board or regional public library system board. Any conveyance, grant, donation, devise, bequest, or gift made to, or in the name of, any regional library or public library system shall be deemed to have been made directly to the regional public library system board.\nAll property heretofore given, granted, conveyed, donated, devised, bequeathed to, or otherwise acquired by any regional library board or any regional public library system board however created is validated, ratified and confirmed as the property of the board.\nAny multicounty regional public library heretofore created, and the agreements creating them, are validated, ratified, and confirmed and the benefits of subdivisions 1 to 5 shall hereafter apply to them.",
	"repealed": false
}