{
	"id": "349.167",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.167",
	"title": "349.167 GAMBLING MANAGERS.",
	"text": "(a) All lawful gambling conducted by a licensed organization must be under the supervision of a gambling manager. A gambling manager designated by an organization to supervise lawful gambling is responsible for the gambling gross receipts of the organization and for its conduct in compliance with all laws and rules. A person designated as a gambling manager shall maintain a dishonesty bond in the sum of $10,000 in favor of the organization conditioned on the faithful performance of the manager's duties. The terms of the bond must provide that notice be given to the board in writing not less than 30 days before its cancellation.\n(b) A person may not act as a gambling manager for more than one organization.\n(c) An organization may not conduct lawful gambling without having a gambling manager.\n(d) An organization may not have more than one gambling manager at any time.\n(a) A person may not serve as a gambling manager for an organization unless the person possesses a valid gambling manager's license issued by the board or otherwise meets the temporary requirements allowed under paragraph (d). In addition to the disqualifications in section 349.155, subdivision 3, the board may not issue a gambling manager's license to a person applying for the license who:\n(1) has not complied with subdivision 4, clauses (1) and (2);\n(2) within the five years before the date of the license application, has committed a violation of law or board rule that resulted in the revocation of a license issued by the board;\n(3) has ever been convicted of a criminal violation involving fraud, theft, tax evasion, misrepresentation, or gambling; or\n(4) has engaged in conduct the board determines is contrary to the public health, welfare, or safety or the integrity of lawful gambling.\n(b) A gambling manager's license runs concurrent with the organization's license unless the gambling manager's license is suspended or revoked by the board or otherwise terminated by the organization or gambling manager.\n(c) The annual fee for a gambling manager's license is $100.\n(d) At the time of the death, disability, or termination of a gambling manager, the organization must:\n(1) contact the board within one business day to establish a plan to replace the gambling manager; and\n(2) submit a complete application and fee within four business days.\n(e) An organization that fails to meet the requirements of paragraph (d) must discontinue its gambling operation until a gambling manager application and fee is received by the board and a license has been issued by the board and received by the gambling manager.\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\nAll persons licensed as gambling managers must receive training in laws and rules governing lawful gambling to comply with the following requirements:\n(1) each gambling manager must receive training within the last six months before being issued a new license, except that in the case of the death, disability, resignation, or termination of a gambling manager, a replacement gambling manager must receive the training within 90 days of being issued a license;\n(2) each gambling manager must receive continuing education training at least once during each calendar year; and\n(3) the training required by this subdivision may be provided by a person authorized by the board to provide the training. Before authorizing a person to provide training, the board must determine that:\n(i) the provider and all of the provider's personnel conducting the training are qualified to do so;\n(ii) the curriculum to be used fully and accurately covers all elements of lawful gambling law and rules that the board determines are necessary for a gambling manager to know and understand;\n(iii) the fee to be charged for participants in the training sessions is fair and reasonable; and\n(iv) the training provider has an adequate system for documenting completion of training.\nThe board or the director may provide the training required by this subdivision using employees of the board.\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\nNo organization may seek or accept assistance from a manufacturer, distributor, or linked bingo game provider, or a representative, agent, affiliate, or employee of a manufacturer, distributor, or linked bingo game provider, in identifying or recruiting candidates to become a gambling manager for the organization.\nEach applicant for a new gambling manager's license must pass an examination prepared and administered by the board that tests the applicant's knowledge of the responsibilities of gambling managers, and of gambling procedures, laws, and rules before being issued the license. In the case of the death, disability, resignation, or termination of a gambling manager, a replacement gambling manager must pass the examination within 90 days of being issued a gambling manager's license. The board shall revoke the replacement gambling manager's license if the replacement gambling manager fails to pass the examination as required in this subdivision.",
	"repealed": false
}