{
	"id": "10A.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.245",
	"title": "10A.245 ADMINISTRATIVE TERMINATION OF INACTIVE COMMITTEES AND FUNDS.",
	"text": "(a) A principal campaign committee becomes inactive on the later of the following dates:\n(1) six years after the last election in which the individual for whom the committee exists was a candidate for the office sought or held at the time the principal campaign committee registered with the board; or\n(2) six years after the last day on which the individual for whom the committee exists served in an elective office subject to this chapter.\n(b) A political committee, political fund, or party unit becomes inactive when four years have elapsed since the end of a reporting period during which the political committee, political fund, or party unit made an expenditure or disbursement requiring itemized disclosure under this chapter.\n(c) A political fund that has elected voluntary inactive status under section 10A.244 becomes inactive within the meaning of this section when four years have elapsed during which the political fund was continuously in voluntary inactive status.\nThe board may terminate the registration of a principal campaign committee, party unit, political committee, or political fund found to be inactive under this section 60 days after sending written notice of inactivity by certified mail to the affected association at the last address on record with the board for that association. Within 60 days after the board sends notice under this section, the affected association must dispose of its assets as provided in this subdivision. The assets of the principal campaign committee, party unit, or political committee must be used for the purposes authorized by this chapter or section 211B.12 or must be liquidated and deposited in the general account of the state elections campaign account. The assets of an association's political fund that were derived from the association's general treasury money revert to the association's general treasury. Assets of a political fund that resulted from contributions to the political fund must be used for the purposes authorized by this chapter or section 211B.12 or must be liquidated and deposited in the general account of the state elections campaign account.",
	"repealed": false
}