{
	"id": "462.353",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.353",
	"title": "462.353 AUTHORITY TO PLAN; FUNDS; FEES; APPEAL.",
	"text": "A municipality may carry on comprehensive municipal planning activities for guiding the future development and improvement of the municipality and may prepare, adopt and amend a comprehensive municipal plan and implement such plan by ordinance and other official actions in accordance with the provisions of sections 462.351 to 462.364.\nIn exercising its powers under subdivision 1, a municipality may collect and analyze data, prepare maps, charts, tables, and other illustrations and displays, and conduct necessary studies. A municipality may publicize its purposes, suggestions, and findings on planning matters, may distribute reports thereon, and may advise the public on the planning matters within the scope of its duties and objectives. The commissioner of natural resources must provide the natural heritage data from the county biological survey, if available, to each municipality for use in the comprehensive plan.\nA municipality may appropriate moneys from any fund not dedicated to other purposes in order to finance its planning activities. A municipality may receive and expend grants and gifts for planning purposes and may enter into contracts with the federal and state governments or with other public or private agencies in furtherance of the planning activities authorized by sections 462.351 to 462.364.\n(a) A municipality may prescribe fees sufficient to defray the costs incurred by it in reviewing, investigating, and administering an application for an amendment to an official control established pursuant to sections 462.351 to 462.364 or an application for a permit or other approval required under an official control established pursuant to those sections. Except as provided in subdivision 4a, fees as prescribed must be by ordinance. Fees must be fair, reasonable, and proportionate and have a nexus to the actual cost of the service for which the fee is imposed.\n(b) A municipality must adopt management and accounting procedures to ensure that fees are maintained and used only for the purpose for which they are collected. Upon request, a municipality must explain the basis of its fees.\n(c) Except as provided in this paragraph, a fee ordinance or amendment to a fee ordinance is effective January 1 after its adoption. A municipality may adopt a fee ordinance or an amendment to a fee ordinance with an effective date other than the next January 1, but the ordinance or amendment does not apply if an application for final approval has been submitted to the municipality.\n(d) If a dispute arises over a specific fee imposed by a municipality related to a specific application, the person aggrieved by the fee may appeal under section 462.361, provided that the appeal must be brought within 60 days after approval of an application under this section and deposit of the fee into escrow. A municipality must not condition the approval of any proposed subdivision or development on an agreement to waive the right to challenge the validity of a fee. An approved application may proceed as if the fee had been paid, pending a decision on the appeal. This paragraph must not be construed to preclude the municipality from conditioning approval of any proposed subdivision or development on an agreement to waive a challenge to the cost associated with municipally installed improvements of the type described in section 429.021.\nA municipality that collects an annual cumulative total of $5,000 or less in fees under this section may prescribe the fees or refer to a fee schedule in the ordinance governing the official control or permit. A municipality may adopt a fee schedule under this subdivision by ordinance or resolution, either annually or more frequently, following publication of notice of proposed action on a fee schedule at least ten days prior to a public hearing held to consider action on or approval of the fee schedule. A municipality that collects a cumulative total in excess of $5,000 in fees under this section may prescribe a fee schedule by ordinance by following the notice and hearing procedures specified in this subdivision.\nA municipality may require, either as part of the necessary information on an application or as a condition of a grant of approval, an applicant for an amendment to an official control established pursuant to sections 462.351 to 462.364, or for a permit or other approval required under an official control established pursuant to those sections to certify that there are no delinquent property taxes, special assessments, penalties, interest, and municipal utility fees due on the parcel to which the application relates. Property taxes which are being paid under the provisions of a stipulation, order, or confession of judgment, or which are being appealed as provided by law, are not considered delinquent for purposes of this subdivision if all required payments that are due under the terms of the stipulation, order, confession of judgment, or appeal have been paid.",
	"repealed": false
}