{
	"id": "48A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.03",
	"title": "48A.03 CAPITAL AND SURPLUS REQUIREMENTS OF TRUST COMPANIES.",
	"text": "The capital of a trust company organized under this chapter must be not less than $500,000. The trust company must also provide a surplus of at least 20 percent of its capital in addition to the capital amounts required by this section. The capital or the surplus must not be reduced without the approval of the commissioner of commerce. In the case of a trust company organized as a limited liability company, \"capital and surplus\" is considered the \"contribution\" of its members reflected in the required records of a limited liability company.\nNo trust company shall transact business until all of its authorized capital stock and required surplus has been paid in, in cash, and at least 25 percent of the capital has been invested in one or more of the first, second, third, and fourth classes of authorized securities and railroad bonds, as described by section 48.37, and also in the farm loan bonds issued by the federal land banks, federal intermediate credit banks, and the banks for cooperatives. These investments must be assigned and transferred to and deposited with the commissioner of management and budget, provided, however, that no trust company shall be required to deposit securities in excess of $1,000,000. The commissioner of management and budget shall submit the securities deposited according to this subdivision to the commissioner. The commissioner shall carefully examine the securities offered for deposit and determine if they comply with all applicable provisions of law. Upon receipt of an order of the commissioner, the commissioner of management and budget shall issue a receipt. This deposit must be maintained unimpaired as a guaranty fund for depositors and creditors and for the faithful discharge of the trust company's duties, with the right to collect the income from it and to substitute other similar authorized securities, of equal amount and value, upon approval and order of the commissioner.\nIf the securities comply with the law, the commissioner shall issue a certificate of authorization for the trust company to begin business.\nThe capital stock of a trust company may be reduced with the approval of the commissioner, but not below the minimum amounts in this section. A trust company shall not return assets to the stockholders unless its deposits of authorized securities after the return equal one-fourth of the reduced capital, which in no event may be less than $125,000. The liability of a stockholder or participant upon an existing contract is not affected by the return of assets.\nWhen two or more trust companies have been or are consolidated under sections 49.34 to 49.41, or, in the case of a limited liability company that has been or is merged under sections 322C.1001 to 322C.1005 and 322C.1015, the capital of the consolidated or merged trust company is considered substituted for the capital of the several trust companies entering into the consolidation or merger, and the aggregate of the securities of these trust companies on deposit with the commissioner of management and budget, according to this section, must be increased or diminished accordingly.\nA company may also be organized, with its principal place of business in the state, with a capital of not less than $10,000, to be paid in cash, of which 50 percent must be invested in authorized securities and deposited with the commissioner of management and budget, as provided in this section. The powers and business of the company must be to act as assignee under an assignment for the benefit of creditors, or be appointed and act as a trustee or receiver, as a guardian of the person, conservator of the estate, or personal representative of an estate. The company may accept and perform any other lawful trust over which a state or federal court has jurisdiction. The company, before entering upon the duties of its trust, shall give a surety bond in the sum the court directs, with sufficient surety, conditioned for the faithful performance of its duties. The business of a company is limited to the matters in this subdivision. A company with a capital stock of less than $10,000 shall not use the word \"trust\" in the title or name of the company.",
	"repealed": false
}