{
	"id": "197.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.46",
	"title": "197.46 VETERANS PREFERENCE ACT; REMOVAL FORBIDDEN; RIGHT OF MANDAMUS.",
	"text": "(a) Any person whose rights may be in any way prejudiced contrary to any of the provisions of this section, is entitled to a writ of mandamus to remedy the wrong. After any initial hiring probationary period expires, no person holding a position either in the state civil service or by appointment or employment in any county, home rule charter or statutory city, town, school district, or any other political subdivision in the state who is a veteran separated from the military service under honorable conditions, shall be removed from the position or employment except for incompetency or misconduct shown after a hearing, upon due notice, upon stated charges, in writing.\n(b) Any veteran who has been notified of the intent to discharge the veteran from an appointed position or employment pursuant to this section shall be notified in writing of the intent to discharge and of the veteran's right to request a hearing within 30 days of receipt of the notice of intent to discharge. The failure of a veteran to request a hearing within the provided 30-day period constitutes a waiver of the right to a hearing. The failure also waives all other available legal remedies for reinstatement.\nRequest for a hearing concerning such a discharge shall be made in writing and submitted by mail or personal service to the employment office of the concerned employer or other appropriate office or person. If the veteran requests a hearing under this section, the written request must also contain the veteran's election to be heard by a civil service board or commission, a merit authority, or an arbitrator as defined in paragraph (c). If the veteran fails to identify the veteran's election, the governmental subdivision may select the hearing body.\n(c) In all governmental subdivisions having an established civil service board or commission, or merit system authority, the veteran may elect to have the hearing for removal or discharge before the civil service board or commission or merit system authority, or before an arbitrator as specified in this paragraph. Where no civil service board or commission or merit system authority exists, the hearing shall be held by an arbitrator. In cases where a hearing will be held by an arbitrator, the employer shall request from the Bureau of Mediation Services a list of seven persons to serve as an arbitrator. The employer shall strike the first name from the list and the parties shall alternately strike names from the list until the name of one arbitrator remains. After receiving each of the employer's elections to strike a person from the list, the veteran has 48 hours to strike a person from the list. The person remaining after the striking procedure must be the arbitrator. Upon the selection of the arbitrator, the employer shall notify the designated arbitrator and request available dates to hold the hearing. In the event that the hearing is authorized to be held before an arbitrator, the governmental subdivision's notice of intent to discharge shall state that the veteran must respond within 30 days of receipt of the notice of intent to discharge.\n(d) Either the veteran or the governmental subdivision may appeal from the decision of the hearing body upon the charges to the district court by causing written notice of appeal, stating the grounds of the appeal, to be served upon the other party within 15 days after notice of the decision and by filing the original notice of appeal with proof of service in the office of the court administrator of the district court within ten days after service thereof. Nothing in section 197.455 or this section shall be construed to apply to the position of private secretary, superintendent of schools, or one chief deputy of any elected official or head of a department, or to any person holding a strictly confidential relation to the appointing officer. Nothing in this section shall be construed to apply to the position of teacher. The burden of establishing such relationship shall be upon the appointing officer in all proceedings and actions relating thereto.\n(e) For disputes heard by a civil service board, commission or merit system authority, or an arbitrator, the governmental subdivisions shall bear all costs associated with the hearing but not including attorney fees for attorneys representing the veteran. If the veteran prevails in a dispute heard by a civil service board, commission or merit system authority, or an arbitrator and the hearing reverses the level of the alleged incompetency or misconduct requiring discharge, the governmental subdivision shall pay the veteran's reasonable attorney fees.\n(f) All officers, boards, commissions, and employees shall conform to, comply with, and aid in all proper ways in carrying into effect the provisions of section 197.455 and this section notwithstanding any laws, charter provisions, ordinances or rules to the contrary. Any willful violation of such sections by officers, officials, or employees is a misdemeanor.",
	"repealed": false
}