{
	"id": "297E.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.031",
	"title": "297E.031 GAMBLING TAX PERMIT.",
	"text": "A distributor who sells gambling products under this chapter must file an application with the commissioner, on a form prescribed by the commissioner, for a gambling tax permit and identification number. The commissioner, when satisfied that the applicant meets all applicable requirements under this chapter and chapter 349, shall issue the applicant a permit and number. A permit is not assignable and is valid only for the distributor in whose name it is issued.\n(a) If a distributor fails to comply with this chapter or a rule of the commissioner, or if a license issued under chapter 349 is revoked or suspended, the commissioner, after giving notice, may for reasonable cause revoke or suspend a permit held by a distributor. A notice must be sent to the distributor at least 15 days before the proposed suspension or revocation is to take effect. The notice must give the reason for the proposed suspension or revocation and must require the distributor to show cause why the proposed action should not be taken. The notice may be served personally or by mail.\n(b) The notice must inform the distributor of the right to a contested case hearing. If a request in writing is made to the commissioner within 14 days of the date of the notice, the commissioner shall defer action on the suspension or revocation and shall refer the case to the Office of Administrative Hearings for the scheduling of a contested case hearing. The distributor must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the distributor.\n(c) The commissioner shall issue a final order following receipt of the recommendation of the administrative law judge.\n(d) Under section 271.06, subdivision 1, an appeal to the Tax Court may be taken from the commissioner's order of revocation or suspension. The commissioner may not issue a new permit after revocation except upon application accompanied by reasonable evidence of the intention of the applicant to comply with all applicable laws and rules.",
	"repealed": false
}