{
	"id": "629.415",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.415",
	"title": "629.415 PROCEEDINGS ON SUMMONS TO APPEAR.",
	"text": "A court may issue a summons in accordance with rule 3.01 of the Rules of Criminal Procedure to notify a person charged with a criminal offense of the need to appear at a certain time and place to answer the charge.\nA summons may be served in accordance with rule 3.03 of the Rules of Criminal Procedure. The court shall record the manner in which the summons was served and, if the summons was served by mailing it to the defendant's last known address, the court shall record whether the summons was returned as undeliverable.\n(a) Unless a prosecutor makes the showing described in subdivision 4, the court shall issue a sign and release warrant if:\n(1) the court issued a summons;\n(2) the summons was served by mailing it to the defendant's last known address and was returned as undeliverable;\n(3) the defendant failed to appear at the time and place identified in the summons;\n(4) the defendant had not previously failed to appear in the same case; and\n(5) the defendant is charged with a misdemeanor offense other than a targeted misdemeanor, as defined in section 299C.10, subdivision 1, or a gross misdemeanor offense other than a violation of section 169A.20 (driving while impaired); 518B.01, subdivision 14 (violation of domestic abuse order for protection); 609.2231 (fourth-degree assault); 609.224 (fifth-degree assault); 609.2242 (domestic assault); 609.3451 (fifth-degree criminal sexual conduct); 609.377 (malicious punishment of a child); 609.378 (neglect or endangerment of a child); 609.748, subdivision 6 (violation of harassment restraining order); 609.749 (harassment or stalking); 609.78, subdivision 2 (interference with an emergency call); 617.261 (nonconsensual dissemination of private sexual images); or 629.75 (violation of domestic abuse no contact order).\n(b) A sign and release warrant shall not require the defendant to post bail or comply with any other conditions of release. A sign and release warrant does not authorize the arrest of the defendant.\n(c) Any court record provided or made available to a law enforcement agency shall indicate that the warrant is a sign and release warrant.\nThe court may issue a warrant that requires the defendant to post bail or comply with other conditions of release if a prosecutor shows, by a preponderance of the evidence, that bail is necessary:\n(1) for the safety of a victim;\n(2) because a defendant poses a risk to public safety; or\n(3) because the defendant otherwise poses a danger to self or others.\n(a) When a peace officer encounters a defendant who is the subject of a sign and release warrant, the officer shall inform the defendant of the missed court appearance and provide a new notice that includes a time to appear.\n(b) Notice of the new time to appear shall be made in writing and must include the court file number or the warrant number. The defendant may be asked to sign a form acknowledging receipt of the notice. A defendant may not be required to sign the acknowledgment, but the peace officer or other employee may indicate that a notice was given and that the defendant refused to sign.\n(c) After providing the notice, the peace officer shall release the defendant at the scene.\n(d) As soon as practicable after providing the notice, the peace officer shall:\n(1) inactivate the warrant or direct the appropriate office or department to inactivate the warrant; and\n(2) submit a form or other notification that can be filed in the court's electronic filing system that includes the court case number, updates the defendant's personal contact information, and indicates that the defendant received notice of the new time to appear.\nNothing in this section prohibits a peace officer from arresting a defendant for any lawful reason.\n(a) By January 1, 2024, the sheriff of every county, in coordination with the district court of that county, shall develop a procedure to inform peace officers about the type of warrant issued by the court and provide hearing dates for sign and release warrants.\n(b) At a minimum, the procedure shall include:\n(1) an office, department, or other entity that a peace officer can contact at any time to determine the type of warrant issued by a court;\n(2) if the warrant is a sign and release warrant, the ability to obtain an updated time for a defendant to appear to answer the charge;\n(3) the ability to inactivate a sign and release warrant after a defendant has been notified of the new time to appear; and\n(4) the ability to submit a form or other notification to the court's electronic filing system updating the defendant's personal contact information and indicating that the defendant received notice of the new time.\n(c) The sheriff may develop forms to provide defendants with notice of the new time to appear.",
	"repealed": false
}