{
	"id": "412.925",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.925",
	"title": "412.925 NATIVE LANDSCAPES.",
	"text": "(a) A statutory city or home rule charter city shall allow an owner, authorized agent, or authorized occupant of any privately owned lands or premises to install and maintain a managed natural landscape. For purposes of this section, the following terms have the meanings given:\n(1) \"managed natural landscape\" means a planned, intentional, and maintained planting of native or nonnative grasses, wildflowers, forbs, ferns, shrubs, or trees, including but not limited to rain gardens, meadow vegetation, and ornamental plants. Managed natural landscapes does not include turf-grass lawns left unattended for the purpose of returning to a natural state;\n(2) \"meadow vegetation\" means grasses and flowering broad-leaf plants that are native to, or adapted to, the state of Minnesota, and that are commonly found in meadow and prairie plant communities, not including noxious weeds. \"Noxious weed\" has the meaning given in section 18.77, subdivision 8;\n(3) \"ornamental plants\" means grasses, perennials, annuals, and groundcovers purposely planted for aesthetic reasons;\n(4) \"rain garden\" means a native plant garden that is designed not only to aesthetically improve properties, but also to reduce the amount of stormwater and accompanying pollutants from entering streams, lakes, and rivers; and\n(5) \"turf-grass lawn\" means a lawn composed mostly of grasses commonly used in regularly cut lawns or play areas, including but not limited to bluegrass, fescue, and ryegrass blends, intended to be maintained at a height of no more than eight inches.\n(b) Managed natural landscapes may include plants and grasses that are in excess of eight inches in height and have gone to seed, but may not include any noxious weeds and must be maintained.\n(c) Except as part of a managed natural landscape as defined in this section, any weeds or grasses growing upon any lot or parcel of land in a city to a greater height than eight inches or that have gone or are about to go to seed are prohibited.",
	"repealed": false
}