{
	"id": "626A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.35",
	"title": "626A.35 GENERAL PROHIBITION ON PEN REGISTER, TRAP AND TRACE DEVICE, AND MOBILE TRACKING DEVICE USE; EXCEPTION.",
	"text": "Except as provided in this section, no person may install or use a pen register, trap and trace device, or mobile tracking device without first obtaining a court order under section 626A.37.\nThe prohibition of subdivision 1 does not apply with respect to the use of a pen register or a trap and trace device by a provider of electronic or wire communication service:\n(1) relating to the operation, maintenance, and testing of a wire or electronic communication service or to the protection of the rights or property of the provider, or to the protection of users of that service from abuse of service or unlawful use of service; or\n(2) to record the fact that a wire or electronic communication was initiated or completed in order to protect the provider, another provider furnishing service toward the completion of the wire communication, or a user of that service, from fraudulent, unlawful, or abusive use of service; or\n(3) where the consent of the user of that service has been obtained.\nThe prohibition of subdivision 1 does not apply to the use of a mobile tracking device where the consent of the owner of the object to which the mobile tracking device is to be attached has been obtained.\n(a) The prohibition under subdivision 1 does not apply to the use of a mobile tracking device on a stolen motor vehicle when:\n(1) the consent of the owner of the vehicle has been obtained; or\n(2) the owner of the motor vehicle has reported to law enforcement that the vehicle is stolen, and the vehicle is occupied when the tracking device is installed.\n(b) Within 24 hours of a tracking device being attached to a vehicle pursuant to the authority granted in paragraph (a), clause (2), an officer employed by the agency that attached the tracking device to the vehicle must remove the device, disable the device, or obtain a search warrant granting approval to continue to use the device in the investigation.\n(c) A peace officer employed by the agency that attached a tracking device to a stolen motor vehicle must remove the tracking device if the vehicle is recovered and returned to the owner.\n(d) Any tracking device evidence collected after the motor vehicle is returned to the owner is inadmissible.\n(e) By August 1, 2024, and each year thereafter, the chief law enforcement officer of an agency that obtains a search warrant under paragraph (b), must provide notice to the superintendent of the Bureau of Criminal Apprehension of the number of search warrants the agency obtained under this subdivision in the preceding 12 months. The superintendent must provide a summary of the data received pursuant to this paragraph in the bureau's biennial report to the legislature required under section 299C.18.\nWhoever knowingly violates subdivision 1 shall be fined not more than $3,000 or imprisoned not more than 364 days, or both.",
	"repealed": false
}