{
	"id": "442A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.11",
	"title": "442A.11 TIME LIMITS FOR ORDERS; APPEALS.",
	"text": "All orders in proceedings under this chapter shall be issued within one year from the date of the first hearing thereon, provided that the time may be extended for a fixed additional period upon consent of all parties of record. Failure to so order shall be deemed to be an order denying the matter. An appeal may be taken from such failure to so order in the same manner as an appeal from an order as provided in subdivision 2.\n(a) Any person aggrieved by an order issued under this chapter may appeal to the district court upon the following grounds:\n(1) the order was issued without jurisdiction to act;\n(2) the order exceeded the jurisdiction of the presiding administrative law judge;\n(3) the order was arbitrary, fraudulent, capricious, or oppressive or in unreasonable disregard of the best interests of the territory affected; or\n(4) the order was based upon an erroneous theory of law.\n(b) The appeal must be taken in the district court in the county in which the majority of the area affected is located. The appeal does not stay the effect of the order. All notices and other documents must be served on both the chief administrative law judge and the attorney general's assistant assigned to the chief administrative law judge for purposes of this chapter.\n(c) If the court determines that the action involved is unlawful or unreasonable or is not warranted by the evidence in case an issue of fact is involved, the court may vacate or suspend the action involved, in whole or in part, as the case requires. The matter shall then be remanded for further action in conformity with the decision of the court.\n(d) To render a review of an order effectual, the aggrieved person shall file with the court administrator of the district court of the county in which the majority of the area is located, within 30 days of the order, an application for review together with the grounds upon which the review is sought.\n(e) An appeal lies from the district court as in other civil cases.",
	"repealed": false
}