{
	"id": "260C.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.152",
	"title": "260C.152 SERVICE OF SUMMONS, NOTICE.",
	"text": "The service of a summons or a notice in lieu of summons shall be as provided in the Rules of Juvenile Procedure.\nService of summons, notice, or subpoena required by sections 260C.151 to 260C.307 shall be made by any suitable person under the direction of the court, and upon request of the court shall be made by a probation officer or any peace officer. The fees and mileage of witnesses shall be paid by the county if the subpoena is issued by the court on its own motion or at the request of the county attorney. All other fees shall be paid by the party requesting the subpoena unless otherwise ordered by the court.\nIn any proceeding regarding a child in need of protection or services in a state court, where the court knows or has reason to know that an Indian child is involved, the prosecuting authority seeking the foster care placement of, or termination of parental rights to an Indian child, shall notify the parent or Indian custodian and the Indian child's tribe of the pending proceedings and of their right of intervention. The notice must be provided by registered mail with return receipt requested unless personal service is accomplished. If the identity or location of the parent or Indian custodian and the tribe cannot be determined, the notice shall be given to the Secretary of the Interior of the United States in like manner, according to the Indian Child Welfare Act of 1978, United States Code, title 25, section 1912. No foster care placement proceeding or termination of parental rights proceeding shall be held until at least ten days after receipt of notice by the parent or Indian custodian and the tribe or the Secretary. However, the parent or Indian custodian or the tribe shall, upon request, be granted up to 20 additional days to prepare for the proceeding.\nProof of the service required by this section shall be made by the person having knowledge thereof.\nThe foster parents, if any, of a child and any preadoptive parent or relative providing care for the child must be provided notice of and a right to be heard in any review or hearing to be held with respect to the child. Any other relative may also request, and must be granted, a notice and the right to be heard under this section. This subdivision does not require that a foster parent, preadoptive parent, relative providing care for the child, or any other relative be made a party to a review or hearing solely on the basis of the notice and right to be heard.",
	"repealed": false
}