{
	"id": "176.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.092",
	"title": "176.092 GUARDIAN; CONSERVATOR.",
	"text": "An injured employee or a dependent under section 176.111 who is a minor or an incapacitated person as that term is defined in section 524.5-102, subdivision 6, shall have a guardian or conservator to represent the interests of the employee or dependent in obtaining compensation according to the provisions of this chapter. This section applies if the employee receives or is eligible for permanent total disability benefits, supplementary benefits, or permanent partial disability benefits totaling more than $3,000 or a dependent receives or is eligible for dependency benefits, or if the employee or dependent receives or is offered a lump sum that exceeds five times the statewide average weekly wage.\nA parent is presumed to be the guardian of the minor employee for purposes of this section. Where the parents of the minor employee are divorced, either parent with legal custody may be considered the guardian for purposes of this section. Notwithstanding subdivision 1, where the employee receives or is eligible for a lump-sum payment of permanent total disability benefits, supplementary benefits, or permanent partial disability benefits totaling more than $3,000 or if the employee receives or is offered a settlement that exceeds five times the statewide average weekly wage, the compensation judge shall review such cases to determine whether benefits should be paid in a lump sum or through an annuity.\nIf an injured employee or dependent under section 176.111 does not have a guardian or conservator and the attorney representing the employee or dependent knows or has reason to believe the employee or dependent is a minor or an incapacitated person, the attorney shall, within 30 days, seek a district court order appointing a guardian or conservator. If the employer, insurer, or special compensation fund in a matter involving a claim against the fund knows or has reason to believe the employee or dependent is a minor or is incapacitated, the employer, insurer, or special compensation fund shall notify the attorney representing the employee or dependent. If the employee or dependent has no attorney or the attorney fails to seek appointment of a guardian or conservator within 30 days of being notified under this subdivision, the employer or insurer shall seek the appointment in district court and the special compensation fund shall notify the commissioner or a compensation judge for referral of the matter under subdivision 3. In the case of a minor who is not represented by an attorney, the commissioner shall refer the matter under subdivision 3.\nWhen, in a proceeding before them, it appears to the commissioner, compensation judge, or, in cases upon appeal, the Workers' Compensation Court of Appeals, that an injured employee or a dependent is a minor or an incapacitated person without a guardian or conservator, the commissioner, compensation judge, or court of appeals shall refer the matter to district court. The commissioner has no duty to monitor files at the department but must review a file for referral upon receiving a complaint that an injured employee or dependent is a minor or an incapacitated person without a guardian or conservator.\nA guardian or conservator of an injured employee or dependent shall have the powers and duties granted by the district court including, but not limited to:\n(1) representing the interests of the employee or dependent in obtaining compensation according to the provisions of this chapter;\n(2) receiving monetary compensation benefits, including the amount of any award, settlement, or judgment; and\n(3) acting as a fiduciary in distributing, managing, and investing monetary workers' compensation benefits.",
	"repealed": false
}