{
	"id": "298.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.225",
	"title": "298.225 APPROPRIATION.",
	"text": "(a) Except as provided under paragraph (c), the distribution of the taconite production tax as provided in section 298.28, subdivisions 3 to 5, 6, paragraph (b), 7, and 8, shall equal the lesser of the following amounts:\n(1) the amount distributed pursuant to this section and section 298.28, with respect to 1983 production if the production for the year prior to the distribution year is no less than 42,000,000 taxable tons. If the production is less than 42,000,000 taxable tons, the amount of the distributions shall be reduced proportionately at the rate of two percent for each 1,000,000 tons, or part of 1,000,000 tons by which the production is less than 42,000,000 tons; or\n(2)(i) for the distributions made pursuant to section 298.28, subdivisions 4, paragraphs (b) and (c), and 6, paragraph (c), 31.2 percent of the amount distributed pursuant to this section and section 298.28, with respect to 1983 production;\n(ii) for the distributions made pursuant to section 298.28, subdivision 5, paragraphs (b) and (d), 75 percent of the amount distributed pursuant to this section and section 298.28, with respect to 1983 production provided that the aid guarantee for distributions under section 298.28, subdivision 5, paragraph (b), shall be reduced by five cents per taxable ton for production years 2014 and thereafter.\n(b) The distribution of the taconite production tax as provided in section 298.28, subdivision 2, shall equal the following amount:\n(1) if the production for the year prior to the distribution year is at least 42,000,000 taxable tons, the amount distributed pursuant to this section and section 298.28 with respect to 1999 production; or\n(2) if the production for the year prior to the distribution year is less than 42,000,000 taxable tons, the amount distributed pursuant to this section and section 298.28 with respect to 1999 production, reduced proportionately at the rate of two percent for each 1,000,000 tons or part of 1,000,000 tons by which the production is less than 42,000,000 tons.\n(c) The distribution of the taconite production tax under section 298.28, subdivision 3, paragraph (a), must equal the amount distributed under 298.28, with respect to 1983 production.\nThe money necessary for funding the difference between the initial distribution made pursuant to section 298.28 and the amount guaranteed in subdivision 1 is appropriated in equal proportions from the initial current year distributions to the taconite environmental protection fund and to the Douglas J. Johnson economic protection trust pursuant to section 298.28. If the initial distributions to the taconite environmental protection fund and the Douglas J. Johnson economic protection trust are insufficient to fund the difference, the commissioner of Iron Range resources and rehabilitation shall make the payments of any remaining difference from the corpus of the taconite environmental protection fund and the corpus of the Douglas J. Johnson economic protection trust fund in equal proportions as directed by the commissioner of revenue.\nIf a taconite producer ceases beneficiation operations permanently and is required by a special law to make bond payments for a school district, the Douglas J. Johnson economic protection trust fund shall assume the payments of the taconite producer if the producer ceases to make the needed payments. The commissioner of Iron Range resources and rehabilitation shall make these school bond payments from the corpus of the Douglas J. Johnson economic protection trust fund in the amounts certified by the commissioner of revenue.",
	"repealed": false
}