{
	"id": "401.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.04",
	"title": "401.04 ACQUIRING PROPERTY; SELECTING ADMINISTRATIVE STRUCTURE; EMPLOYEES.",
	"text": "Any county or Tribal Nation electing to become a CCA jurisdiction may:\n(1) acquire by any lawful means, including purchase, lease, or transfer of custodial control, the lands, buildings, and equipment necessary and incident to accomplishing the purposes of this chapter;\n(2) determine and establish an administrative structure best suited to the efficient administration and delivery of correctional services; and\n(3) employ a director and other officers, employees, and agents as deemed necessary to implement this chapter.\n(a) To the extent that a county assumes and takes over state and local correctional services presently provided in the county, the probation officers and other employees displaced by the changeover must be employed by the county at no loss of salary. Years of service in the state are to be given full credit for future sick leave and vacation accrual purposes.\n(b) If an officer or other employee is hired by a county, employment must, to the extent possible and notwithstanding any other law to the contrary, be deemed a transfer in grade with all of the benefits enjoyed by the officer or employee while in the service of the state or local correctional service.\n(c) State or local employees displaced by county participation in the subsidy program are on layoff status and, if not hired by a participating county as provided under this subdivision, may exercise their rights under layoff procedures established by law or collective-bargaining agreement, whichever is applicable.\n(d) State or local officers and employees displaced by a county's participation in the Community Corrections Act and hired by the participating county retain all fringe benefits and recall from layoff benefits accrued by seniority and enjoyed by them while in the service of the state.\n(e) This subdivision applies to the extent consistent with state and Tribal law.",
	"repealed": false
}