{
	"id": "142G.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.14",
	"title": "142G.14 ELIGIBILITY; PARENTING OR PREGNANT MINORS.",
	"text": "(a) The definitions in this paragraph only apply to this section.\n(1) \"Household of a parent, legal guardian, or other adult relative\" means the place of residence of:\n(i) a natural or adoptive parent;\n(ii) a legal guardian according to appointment or acceptance under sections 260C.325 or 524.5-201 to 524.5-317, and related laws;\n(iii) a caregiver as defined in section 142G.02, subdivision 12; or\n(iv) an appropriate adult relative designated by a county agency.\n(2) \"Adult supervised supportive living arrangement\" means a private family setting which assumes responsibility for the care and control of the minor parent and minor child, or other living arrangement, not including a public institution, licensed by the commissioner of human services which ensures that the minor parent receives adult supervision and supportive services, such as counseling, guidance, independent living skills training, or supervision.\n(b) A minor parent and the minor child who is in the care of the minor parent must reside in the household of a parent, legal guardian, other adult relative, or in an adult supervised supportive living arrangement in order to receive MFIP unless:\n(1) the minor parent has no living parent, other adult relative, or legal guardian whose whereabouts is known;\n(2) no living parent, other adult relative, or legal guardian of the minor parent allows the minor parent to live in the parent's, other adult relative's, or legal guardian's home;\n(3) the minor parent lived apart from the minor parent's own parent or legal guardian for a period of at least one year before either the birth of the minor child or the minor parent's application for MFIP;\n(4) the physical or emotional health or safety of the minor parent or minor child would be jeopardized if the minor parent and the minor child resided in the same residence with the minor parent's parent, other adult relative, or legal guardian; or\n(5) an adult supervised supportive living arrangement is not available for the minor parent and child in the county in which the minor parent and child currently reside. If an adult supervised supportive living arrangement becomes available within the county, the minor parent and child must reside in that arrangement.\n(c) The county agency shall inform minor applicants both orally and in writing about the eligibility requirements, their rights and obligations under the MFIP program, and any other applicable orientation information. The county must advise the minor of the possible exemptions under section 142G.57, subdivision 5, and specifically ask whether one or more of these exemptions is applicable. If the minor alleges one or more of these exemptions, then the county must assist the minor in obtaining the necessary verifications to determine whether or not these exemptions apply.\n(d) If the county worker has reason to suspect that the physical or emotional health or safety of the minor parent or minor child would be jeopardized if they resided with the minor parent's parent, other adult relative, or legal guardian, then the county worker must make a referral to child protective services to determine if paragraph (b), clause (4), applies. A new determination by the county worker is not necessary if one has been made within the last six months, unless there has been a significant change in circumstances which justifies a new referral and determination.\n(e) If a minor parent is not living with a parent, legal guardian, or other adult relative due to paragraph (b), clause (1), (2), or (4), the minor parent must reside, when possible, in a living arrangement that meets the standards of paragraph (a), clause (2).\n(f) Regardless of living arrangement, MFIP must be paid, when possible, in the form of a protective payment on behalf of the minor parent and minor child according to section 142G.35, subdivisions 2 to 4.",
	"repealed": false
}