{
	"id": "176.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.081",
	"title": "176.081 LEGAL SERVICES OR DISBURSEMENTS; LIEN; REVIEW.",
	"text": "(a) A fee for legal services of 20 percent of the first $275,000 of compensation awarded to the employee is the maximum permissible fee and does not require approval by the commissioner, compensation judge, or any other party. All fees, including fees for obtaining medical or rehabilitation benefits, must be calculated according to the formula under this subdivision, except as otherwise provided in clause (1) or (2).\n(1) The contingent attorney fee for recovery of monetary benefits according to the formula in this section is presumed to be adequate to cover recovery of medical and rehabilitation benefit or services concurrently in dispute. Attorney fees for recovery of medical or rehabilitation benefits or services shall be assessed against the employer or insurer only if the attorney establishes that the contingent fee is inadequate to reasonably compensate the attorney for representing the employee in the medical or rehabilitation dispute. In cases where the contingent fee is inadequate the employer or insurer is liable for attorney fees based on the formula in this subdivision or in clause (2).\nFor the purposes of applying the formula where the employer or insurer is liable for attorney fees, the amount of compensation awarded for obtaining disputed medical and rehabilitation benefits under sections 176.102, 176.135, and 176.136 shall be the dollar value of the medical or rehabilitation benefit awarded, where ascertainable.\n(2) The maximum attorney fee for obtaining a change of doctor or qualified rehabilitation consultant, or any other disputed medical or rehabilitation benefit for which a dollar value is not reasonably ascertainable, is the amount charged in hourly fees for the representation or $500, whichever is less, to be paid by the employer or insurer.\n(3) The fees for obtaining disputed medical or rehabilitation benefits are included in the $55,000 limit in paragraph (b). An attorney must concurrently file all outstanding disputed issues. An attorney is not entitled to attorney fees for representation in any issue which could reasonably have been addressed during the pendency of other issues for the same injury.\n(b) All fees for legal services related to the same injury are cumulative and may not exceed $55,000. If multiple injuries are the subject of a dispute, the commissioner, compensation judge, or court of appeals shall specify the attorney fee attributable to each injury.\n(c) If the employer or the insurer or the defendant is given written notice of claims for legal services or disbursements, the claim shall be a lien against the amount paid or payable as compensation. Subject to the foregoing maximum amount for attorney fees, up to 20 percent of the first $275,000 of periodic compensation awarded to the employee may be withheld from the periodic payments for attorney fees or disbursements if the payor of the funds clearly indicates on the check or draft issued to the employee for payment the purpose of the withholding, the name of the attorney, the amount withheld, and the gross amount of the compensation payment before withholding. In no case shall fees be calculated on the basis of any undisputed portion of compensation awards. Allowable fees under this chapter shall be available to an attorney who procures a benefit on behalf of the employee and be based solely upon genuinely disputed claims or portions of claims, including disputes related to the payment of rehabilitation benefits or to other aspects of a rehabilitation plan. The existence of a dispute is dependent upon a disagreement after the employer or insurer has had adequate time and information to take a position on liability. Neither the holding of a hearing nor the filing of an application for a hearing alone may determine the existence of a dispute. Except where the employee is represented by an attorney in other litigation pending at the department or at the Office of Administrative Hearings, a fee may not be charged for services with respect to a medical or rehabilitation issue arising under section 176.102, 176.135, or 176.136 performed before the attorney has filed with the commissioner and served on the employer or insurer and the attorney representing the employer or insurer, if any, a request for certification of dispute containing the name of the employer and its insurer, the date of the injury, and a description of the benefits claimed, and the department certifies that there is a dispute and that it has tried to resolve the dispute. If within 30 days of the filing of the request the department has not issued a determination of whether a dispute exists, the dispute shall be certified if all of the following apply:\n(1) the insurer has not approved the requested benefit;\n(2) the employee, the employee's attorney, or the employee's treating provider has submitted any and all additional information requested by the insurer necessary to determine whether the requested benefit is disputed or approved; and\n(3) the insurer has had at least seven calendar days to review any additional information submitted.\nIn cases of nonemergency surgery, if the employer or insurer has requested a second opinion under section 176.135, subdivision 1a, or an examination under section 176.155, subdivision 1, a dispute shall be certified if 45 days have passed following a written request for an examination or second opinion and the conditions in clauses (1) to (3) have been met.\n(d) An attorney who is claiming legal fees for representing an employee in a workers' compensation matter shall file a statement of attorney fees with the office. A copy of the signed retainer agreement shall also be filed. The employee, employer or insurer, and the attorney representing the employer or insurer, if any, shall receive a copy of the statement of attorney fees. The statement shall be on a form prescribed by the commissioner and shall report the number of hours spent on the case.\n(e) Employers and insurers may not pay attorney fees or wages for legal services of more than $55,000 per case.\n(f) An attorney must file a statement of attorney fees within 12 months of the date the attorney has submitted the written notice specified in paragraph (c). If the attorney has not filed a statement of attorney fees within the 12 months, the attorney must send a renewed notice of lien to the insurer. If 12 months have elapsed since the last notice of lien has been received by the insurer and no statement of attorney fees has been filed, the insurer must release the withheld money to the employee, except that before releasing the money to the employee, the insurer must give the attorney 30 days' written notice of the pending release. The insurer must not release the money if the attorney files a statement of attorney fees within the 30 days.\n[Repealed, 1995 c 231 art 2 s 110]\nA party that is dissatisfied with attorney fees awarded by the commissioner or a compensation judge may file a petition for review by the Workers' Compensation Court of Appeals. The petition shall state the basis for the need of review and whether or not a hearing is requested. A copy of the petition shall be served by the court upon the attorney awarded or denied attorney fees. The Workers' Compensation Court of Appeals shall have the authority to raise the issue of the attorney fees at any time upon its own motion and shall have continuing jurisdiction over attorney fees.\n[Repealed, 1985 c 234 s 22]\n[Repealed, 1995 c 231 art 2 s 110]\nThe commissioner, Office of Administrative Hearings, and the Workers' Compensation Court of Appeals may adopt reasonable and proper joint rules to effect each of their obligations under this section.\nIf the employer or insurer files a denial of liability, notice of discontinuance, or fails to make payment of compensation or medical expenses within the statutory period after notice of injury or occupational disease, or otherwise unsuccessfully resists the payment of compensation or medical expenses, or unsuccessfully disputes the payment of rehabilitation benefits or other aspects of a rehabilitation plan, and the injured person has employed an attorney at law, who successfully procures payment on behalf of the employee or who enables the resolution of a dispute with respect to a rehabilitation plan, the compensation judge, commissioner, or the Workers' Compensation Court of Appeals upon appeal, upon application, shall award to the employee against the insurer or self-insured employer or uninsured employer, in addition to the compensation benefits paid or awarded to the employee, an amount equal to 30 percent of that portion of the attorney's fee which has been awarded pursuant to this section that is in excess of $250. This subdivision shall apply only to contingent fees payable from the employee's compensation benefits, and not to other fees paid by the employer and insurer, including but not limited to those fees payable for resolution of a medical dispute or rehabilitation dispute, or pursuant to section 176.191.\nAt any time prior to one day before a matter is to be heard, a party litigating a claim made pursuant to this chapter may serve upon the adverse party a reasonable offer of settlement of the claim, with provision for costs and disbursements then accrued. If before the hearing the adverse party serves written notice that the offer is accepted, either party may then file the offer and notice of acceptance, together with the proof of service thereof, and thereupon judgment shall be entered.\nIf an offer by an employer or insurer is not accepted by the employee, it shall be deemed withdrawn and evidence thereof is not admissible, except in a proceeding to determine attorney's fees.\nIf an offer by an employee is not accepted by the employer or insurer, it shall be deemed withdrawn and evidence thereof is not admissible, except in a proceeding to determine attorney's fees.\nThe fact that an offer is made but not accepted does not preclude a subsequent offer.\n[Repealed, 1995 c 231 art 2 s 110]\nAn attorney who is hired by an employee to provide legal services with respect to a claim for compensation made pursuant to this chapter shall prepare a retainer agreement in which the provisions of this section are specifically set out and provide a copy of this agreement to the employee. The retainer agreement shall provide a space for the signature of the employee. A signed agreement shall raise a conclusive presumption that the employee has read and understands the statutory fee provisions. No fee shall be awarded pursuant to this section in the absence of a signed retainer agreement.\nThe retainer agreement shall contain a notice to the employee regarding the maximum fee allowed under this section in ten-point type, which shall read:\nNotice of Maximum Fee\nThe maximum fee allowed by law for legal services is 20 percent of the first $130,000 of compensation awarded to the employee subject to a cumulative maximum fee of $26,000 for fees related to the same injury.\nThe employee shall take notice that the employee is under no legal or moral obligation to pay any fee for legal services in excess of the foregoing maximum fee.\nAn attorney who knowingly violates any of the provisions of this chapter with respect to authorized fees for legal services in connection with any demand made or suit or proceeding brought under the provisions of this chapter is guilty of a gross misdemeanor.\nAttorney fees and other disbursements for a proceeding under this chapter shall not be due or paid until the issue for which the fee or disbursement was incurred has been resolved.\nIf a party or party's attorney fails to appear at any conference or hearing scheduled under this chapter, is substantially unprepared to participate in the conference or hearing, or fails to participate in good faith, the commissioner or compensation judge, upon motion or upon its own initiative, shall require the party or the party's attorney or both to pay the reasonable expenses including attorney fees, incurred by the other party due to the failure to appear, prepare, or participate. Attorney fees or other expenses may not be awarded if the commissioner or compensation judge finds that the noncompliance was substantially justified or that other circumstances would make the sanction unjust. The Department of Labor and Industry, and the Office of Administrative Hearings may by rule establish additional sanctions for failure of a party or the party's attorney to appear, prepare for, or participate in a conference or hearing.",
	"repealed": false
}