{
	"id": "144A.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.101",
	"title": "144A.101 PROCEDURES FOR FEDERALLY REQUIRED SURVEY PROCESS.",
	"text": "This section applies to survey certification and enforcement activities by the commissioner related to regular, expanded, or extended surveys under Code of Federal Regulations, title 42, part 488.\nThe commissioner shall provide nursing facilities with draft statements of deficiencies at the time of the survey exit process and shall provide facilities with completed statements of deficiencies within 15 working days of the exit process.\nThe commissioner, upon the request of a nursing facility, shall provide the facility with copies of formal surveyor notes taken during the survey, with the exception of interview forms, at the time of the exit conference or at the time the completed statement of deficiency is provided to the facility. The survey notes shall be redacted to protect the confidentiality of individuals providing information to the surveyors. A facility requesting formal surveyor notes must agree to pay the commissioner for the cost of copying and redacting.\nThe commissioner, when posting statements of a nursing facility's deficiencies on the agency website, must include in the posting the facility's response to the citations. The website must also include the dates upon which deficiencies are corrected and the date upon which a facility is considered to be in compliance with survey requirements. If deficiencies are under dispute, the commissioner must note this on the website using a method that clearly identifies for consumers which citations are under dispute.\nThe commissioner shall conduct survey revisits within 15 calendar days of the date by which corrections will be completed, as specified by the provider in its plan of correction, in cases where category 2 or category 3 remedies are in place. The commissioner may conduct survey revisits by telephone or written communications for facilities at which the highest scope and severity score for a violation was level E or lower.\nNursing facility family councils shall be interviewed as part of the survey process and invited to participate in the exit conference.",
	"repealed": false
}