{
	"id": "256B.692",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.692",
	"title": "256B.692 COUNTY-BASED PURCHASING.",
	"text": "County boards or groups of county boards may elect to purchase or provide health care services on behalf of persons eligible for medical assistance who would otherwise be required to or may elect to participate in the prepaid medical assistance program according to section 256B.69. Counties that elect to purchase or provide health care under this section must provide all services included in prepaid managed care programs according to section 256B.69, subdivisions 1 to 22. County-based purchasing under this section is governed by section 256B.69, unless otherwise provided for under this section.\n(a) Notwithstanding chapters 62D and 62N, a county that elects to purchase medical assistance in return for a fixed sum without regard to the frequency or extent of services furnished to any particular enrollee is not required to obtain a certificate of authority under chapter 62D or 62N. The county board of commissioners is the governing body of a county-based purchasing program. In a multicounty arrangement, the governing body is a joint powers board established under section 471.59.\n(b) A county that elects to purchase medical assistance services under this section must satisfy the commissioner of health that the requirements for assurance of consumer protection, provider protection, and fiscal solvency of chapter 62D, applicable to health maintenance organizations will be met according to the following schedule:\n(1) for a county-based purchasing plan approved on or before June 30, 2008, the plan must have in reserve:\n(i) at least 50 percent of the minimum amount required under chapter 62D as of January 1, 2010;\n(ii) at least 75 percent of the minimum amount required under chapter 62D as of January 1, 2011;\n(iii) at least 87.5 percent of the minimum amount required under chapter 62D as of January 1, 2012; and\n(iv) at least 100 percent of the minimum amount required under chapter 62D as of January 1, 2013; and\n(2) for a county-based purchasing plan first approved after June 30, 2008, the plan must have in reserve:\n(i) at least 50 percent of the minimum amount required under chapter 62D at the time the plan begins enrolling enrollees;\n(ii) at least 75 percent of the minimum amount required under chapter 62D after the first full calendar year;\n(iii) at least 87.5 percent of the minimum amount required under chapter 62D after the second full calendar year; and\n(iv) at least 100 percent of the minimum amount required under chapter 62D after the third full calendar year.\n(c) Until a plan is required to have reserves equaling at least 100 percent of the minimum amount required under chapter 62D, the plan may demonstrate its ability to cover any losses by satisfying the requirements of chapter 62N. A county-based purchasing plan must also assure the commissioner of health that the requirements of sections 62J.041; 62J.48; 62J.71 to 62J.73; all applicable provisions of chapter 62Q, including sections 62Q.075; 62Q.1055; 62Q.106; 62Q.12; 62Q.135; 62Q.14; 62Q.19; 62Q.23, paragraph (c); 62Q.43; 62Q.47; 62Q.50; 62Q.52 to 62Q.56; 62Q.58; 62Q.68 to 62Q.72; and 72A.201 will be met.\n(d) All enforcement and rulemaking powers available under chapters 62D, 62J, 62N, and 62Q are hereby granted to the commissioner of health with respect to counties that purchase medical assistance services under this section.\n(e) The commissioner, in consultation with county government, shall develop administrative and financial reporting requirements for county-based purchasing programs relating to sections 62D.041, 62D.042, 62D.045, 62D.08, 62N.28, 62N.29, and 62N.31, and other sections as necessary, that are specific to county administrative, accounting, and reporting systems and consistent with other statutory requirements of counties.\n(f) The commissioner shall collect from a county-based purchasing plan under this section the following fees:\n(1) fees attributable to the costs of audits and other examinations of plan financial operations. These fees are subject to the provisions of Minnesota Rules, part 4685.2800, subpart 1, item F; and\n(2) an annual fee of $21,500, to be paid by June 15 of each calendar year.\nAll fees collected under this paragraph shall be deposited in the state government special revenue fund.\nA county board that intends to purchase or provide health care under this section, which may include purchasing all or part of these services from health plans or individual providers on a fee-for-service basis, or providing these services directly, must demonstrate the ability to follow and agree to the following requirements:\n(1) purchase all covered services for a fixed payment from the state that does not exceed the estimated state and federal cost that would have occurred under the prepaid medical assistance program;\n(2) ensure that covered services are accessible to all enrollees and that enrollees have a reasonable choice of providers, health plans, or networks when possible. If the county is also a provider of service, the county board shall develop a process to ensure that providers employed by the county are not the sole referral source and are not the sole provider of health care services if other providers, which meet the same quality and cost requirements are available;\n(3) issue payments to participating vendors or networks in a timely manner;\n(4) establish a process to ensure and improve the quality of care provided;\n(5) provide appropriate quality and other required data in a format required by the state;\n(6) provide a system for advocacy, enrollee protection, and complaints and appeals that is independent of care providers or other risk bearers and complies with section 256B.69;\n(7) ensure that the implementation and operation of the Minnesota senior health options demonstration project and the Minnesota disability health options demonstration project, authorized under section 256B.69, subdivision 23, will not be impeded;\n(8) ensure that all recipients that are enrolled in the prepaid medical assistance program will be transferred to county-based purchasing without utilizing the department's fee-for-service claims payment system;\n(9) ensure that all recipients who are required to participate in county-based purchasing are given sufficient information prior to enrollment in order to make informed decisions; and\n(10) ensure that the state and the medical assistance recipients will be held harmless for the payment of obligations incurred by the county if the county, or a health plan providing services on behalf of the county, or a provider participating in county-based purchasing becomes insolvent, and the state has made the payments due to the county under this section.\nThe commissioner shall pay counties that are purchasing or providing health care under this section a per capita payment for all enrolled recipients. Payments shall not exceed payments that otherwise would have been paid to health plans under medical assistance for that county or region. This payment is in addition to any administrative allocation to counties for education, enrollment, and advocacy. The state of Minnesota and the United States Department of Health and Human Services are not liable for any costs incurred by a county that exceed the payments to the county made under this subdivision. A county whose costs exceed the payments made by the state, or any affected enrollees or creditors of that county, shall have no rights under chapter 61B or section 62D.181. A county may assign risk for the cost of care to a third party.\n(a) A county that has elected to participate in a county-based purchasing plan under this section shall use any excess revenues over expenses that are received by the county and are not needed (1) for capital reserves under subdivision 2, (2) to increase payments to providers, or (3) to repay county investments or contributions to the county-based purchasing plan, for prevention, early intervention, and health care programs, services, or activities.\n(b) A county-based purchasing plan under this section is subject to the unreasonable expense provisions of section 62D.19.\n(a) A county board that wishes to purchase or provide health care under this section must submit a preliminary proposal that substantially demonstrates the county's ability to meet all the requirements of this section in response to criteria for proposals issued by the department. Counties submitting preliminary proposals must establish a local planning process that involves input from medical assistance recipients, recipient advocates, providers and representatives of local school districts, labor, and tribal government to advise on the development of a final proposal and its implementation.\n(b) The county board must submit a final proposal that demonstrates the ability to meet all the requirements of this section.\n(c) For a county in which the prepaid medical assistance program is in existence, the county board must submit a preliminary proposal at least 15 months prior to termination of health plan contracts in that county and a final proposal six months prior to the health plan contract termination date in order to begin enrollment after the termination. Nothing in this section shall impede or delay implementation or continuation of the prepaid medical assistance program in counties for which the board does not submit a proposal, or submits a proposal that is not in compliance with this section.\nThe commissioner may:\n(1) reject any preliminary or final proposal that:\n(i) substantially fails to meet the requirements of this section, or\n(ii) the commissioner determines would substantially impair the state's ability to purchase health care services in other areas of the state, or\n(iii) would substantially impair an enrollee's choice of care systems when reasonable choice is possible, or\n(iv) would substantially impair the implementation and operation of the Minnesota senior health options demonstration project authorized under section 256B.69, subdivision 23; and\n(2) assume operation of a county's purchasing of health care for enrollees in medical assistance in the event that the contract with the county is terminated.\nIn the event the commissioner rejects a proposal under subdivision 6, the county board may request the recommendation of a three-person mediation panel. The commissioner shall resolve all disputes after taking into account the recommendations of the mediation panel. The panel shall be composed of one designee of the president of the Association of Minnesota Counties, one designee of the commissioner of human services, and one person selected jointly by the designee of the commissioner of human services and the designee of the Association of Minnesota Counties. Within a reasonable period of time before the hearing, the panelists must be provided all documents and information relevant to the mediation. The parties to the mediation must be given 30 days' notice of a hearing before the mediation panel.\nA county that conducts county-based purchasing shall be considered to be a prepaid health plan for purposes of section 256.045.\nThe commissioner shall request any federal waivers and federal approval required to implement this section. County-based purchasing shall not be implemented without obtaining all federal approval required to maintain federal matching funds in the medical assistance program.\n[Repealed, 2014 c 262 art 2 s 18]",
	"repealed": false
}