{
	"id": "47.605",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.605",
	"title": "47.605 LOAN SOLICITATION; UNREQUESTED CHECKS REGULATED.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Facsimile check\" means a document that resembles a negotiable check, money order, draft, or other instrument.\n(c) \"Live check\" means a negotiable check, money order, draft, or other instrument that may be used by a consumer to activate a loan.\nNo financial institution or other lender may offer to make a loan by mailing to a Minnesota resident a live check payable to the addressee, which the addressee is requested to endorse and then cash, deposit, or otherwise negotiate as a means of accepting the loan offered, except as provided in subdivision 3. This section does not apply if the addressee already has an open-end credit arrangement or business relationship with the financial institution or other lender or if the addressee has requested in writing that the live check be mailed to the addressee.\n(a) The addressee is not liable for any loan contracted or allegedly contracted by means of a live check that violates subdivision 2, unless the live check is offered in compliance with the requirements in paragraphs (b) to (g).\n(b) The live check, regardless of its form, must not be negotiable after a period no longer than 30 days after the date shown on the live check. Printed material accompanying the live check must advise the consumer to void and destroy the live check if it is not going to be negotiated, and must be substantially similar to the following disclosure:\n\"THIS IS A SOLICITATION FOR A LOAN--READ THE ENCLOSED DISCLOSURES BEFORE SIGNING AND CASHING THIS CHECK.\"\n(c) Notification of the loan agreement must be on the back of the live check so that the consumer is advised that by signing the back of the live check the consumer will have activated a loan transaction. The following disclosure must appear on the back of the live check:\n\"By endorsing this instrument, you agree to repay this loan according to the terms of the Loan Agreement, which you acknowledge receiving and which provides you with the contract terms in connection with this loan transaction.\"\n(d) Opt-out provisions of United States Code, title 15, section 1681b(e), must be noted by reference in printed materials that accompany the live check.\n(e) Live check loan solicitations must be mailed in envelopes with no indication that a negotiable instrument is contained in the mailing. Envelopes must be marked with instructions to the postal service stating that the item is not to be forwarded if the intended addressee is no longer at the location.\n(f) The creditor who receives a negotiated live check must execute the following steps consistent with the structure of the creditor's business:\n(1) ensure that the instrument is placed in the consumer's loan folder, record, or other filing procedure consistent with the creditor's business which will enable recovery of the item, or an exact facsimile of the original document; and\n(2) provide to the customer a coupon book or billing statement or other medium consistent with the creditor's business practice as confirmation of the activation of the loan.\n(g) In the event that a live check is stolen or incorrectly received by someone other than the intended payee, and the live check is fraudulently cashed or otherwise negotiated, the following safeguards for the consumer must be triggered:\n(1) the creditor, upon receipt of notification that the consumer did not negotiate the live check, shall provide, and the consumer may complete, a statement confirming that the consumer did not deposit, cash, or otherwise negotiate the live check;\n(2) completion of the confirmation statement must be facilitated by the creditor by providing the consumer the opportunity to fill it out at a local location of the creditor, by mail, or both, and by explaining that the consumer is relieved from any liability on the loan. The creditor shall also provide the consumer with a contact person to provide assistance if required; and\n(3) upon submitting a completed confirmation statement to the creditor, the consumer who was the intended payee shall have no liability for the loan obligation, absent any fraud by that consumer.\nNo financial institution or other lender shall mail to a Minnesota resident a solicitation for a cash loan that includes a facsimile check payable to the addressee unless:\n(1) the facsimile check contains on the front and back, in at least a 30-point bold font, the words:\n\"This is not a check\";\n(2) the opt-out provisions of United States Code, title 15, section 1681b(e), are noted by reference in printed materials that accompany the facsimile check; and\n(3) the solicitation is mailed in an envelope that does not make it appear that a negotiable instrument is contained in the mailing.",
	"repealed": false
}