{
	"id": "52.203",
	"url": "https://www.revisor.mn.gov/statutes/cite/52.203",
	"title": "52.203 MERGER OR CONSOLIDATION.",
	"text": "Any credit union chartered by this state may merge with and be absorbed by any other state or federal credit union, and any credit union chartered by this or any other state or any federal credit union may be merged into a successor credit union chartered by this state, upon approval of all regulatory agencies concerned, and upon compliance with this section as regards the credit union chartered by this state. At the time of filing with the commissioner of any proposed merger or consolidation plan, the credit unions proposing to merge or consolidate shall submit a fee of $100 payable to the commissioner of commerce. The fee shall be paid in equal parts by the credit unions' party to the proposal.\nA credit union may be absorbed after a majority of its members who vote on the proposal have voted in favor of the merger at a special meeting called by a majority of the board of directors for that purpose, upon at least 45 but no more than 90 calendar days mailed written notice to each member at the member's last known address if by mail, or by other verifiable means, clearly stating the purpose of the special meeting, or at any regular meeting after like notice of the purpose has been given. Thereafter, the board of directors may execute an agreement of merger with the successor credit union, subject to approval of the agreement by the commissioner of commerce. The commissioner shall approve or disapprove of the agreement within 60 days of the date the agreement is submitted. The approved agreement must be filed with the secretary of state.\nIf the successor credit union which absorbs one or more credit unions is chartered by this state it may execute an agreement of merger upon approval of the agreement by the commissioner of commerce and by the board of directors of the credit union. The commissioner of commerce shall approve the merger agreement if it is in the best interest of the credit unions involved. In any event, the commissioner of commerce shall approve or disapprove of the merger agreement within 60 days of the date the agreement is submitted. Members of, and persons eligible for membership in, the credit union being absorbed have all rights of membership in the successor credit union.\nThe charter and license and all other rights and property of the credit union being absorbed is deemed to be transferred to and invested in the successor credit union upon execution and approval of the merger agreement without further action. Any pending action or other judicial proceeding to which the credit union being absorbed is a party at the date of merger does not abate by reason of the merger. If the credit union being absorbed is chartered by this state, its corporate existence ceases upon the execution and approval of the merger agreement without further action.",
	"repealed": false
}