{
	"id": "462.3593",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.3593",
	"title": "462.3593 TEMPORARY FAMILY HEALTH CARE DWELLINGS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Caregiver\" means an individual 18 years of age or older who:\n(1) provides care for a mentally or physically impaired person; and\n(2) is a relative, legal guardian, or health care agent of the mentally or physically impaired person for whom the individual is caring.\n(c) \"Instrumental activities of daily living\" has the meaning given in section 256B.0659, subdivision 1, paragraph (i).\n(d) \"Mentally or physically impaired person\" means a person who is a resident of this state and who requires assistance with two or more instrumental activities of daily living as certified in writing by a physician, a physician assistant, or an advanced practice registered nurse licensed to practice in this state.\n(e) \"Relative\" means a spouse, parent, grandparent, child, grandchild, sibling, uncle, aunt, nephew, or niece of the mentally or physically impaired person. Relative includes half, step, and in-law relationships.\n(f) \"Temporary family health care dwelling\" means a mobile residential dwelling providing an environment facilitating a caregiver's provision of care for a mentally or physically impaired person that meets the requirements of subdivision 2.\nA temporary family health care dwelling must:\n(1) be primarily assembled at a location other than its site of installation;\n(2) be no more than 300 gross square feet;\n(3) not be attached to a permanent foundation;\n(4) be universally designed and meet state-recognized accessibility standards;\n(5) provide access to water and electric utilities either by connecting to the utilities that are serving the principal dwelling on the lot or by other comparable means;\n(6) have exterior materials that are compatible in composition, appearance, and durability to the exterior materials used in standard residential construction;\n(7) have a minimum insulation rating of R-15;\n(8) be able to be installed, removed, and transported by a one-ton pickup truck as defined in section 168.002, subdivision 21b, a truck as defined in section 168.002, subdivision 37, or a truck tractor as defined in section 168.002, subdivision 38;\n(9) be built to either Minnesota Rules, chapter 1360 or 1361, and contain an Industrialized Buildings Commission seal and data plate or to American National Standards Institute Code 119.2; and\n(10) be equipped with a backflow check valve.\n(a) Unless the municipality has designated temporary family health care dwellings as permitted uses, a temporary family health care dwelling is subject to the provisions in this section. A temporary family health care dwelling that meets the requirements of this section cannot be prohibited by a local ordinance that regulates accessory uses or recreational vehicle parking or storage.\n(b) The caregiver or relative must apply for a temporary dwelling permit from the municipality. The permit application must be signed by the primary caregiver, the owner of the property on which the temporary family health care dwelling will be located, and the resident of the property if the property owner does not reside on the property, and include:\n(1) the name, address, and telephone number of the property owner, the resident of the property if different from the owner, and the primary caregiver responsible for the care of the mentally or physically impaired person; and the name of the mentally or physically impaired person who will live in the temporary family health care dwelling;\n(2) proof of the provider network from which the mentally or physically impaired person may receive respite care, primary care, or remote patient monitoring services;\n(3) a written certification that the mentally or physically impaired person requires assistance with two or more instrumental activities of daily living signed by a physician, a physician assistant, or an advanced practice registered nurse licensed to practice in this state;\n(4) an executed contract for septic service management or other proof of adequate septic service management;\n(5) an affidavit that the applicant has provided notice to adjacent property owners and residents of the application for the temporary dwelling permit; and\n(6) a general site map to show the location of the temporary family health care dwelling and other structures on the lot.\n(c) The temporary family health care dwelling must be located on property where the caregiver or relative resides. A temporary family health care dwelling must comply with all setback requirements that apply to the primary structure and with any maximum floor area ratio limitations that may apply to the primary structure. The temporary family health care dwelling must be located on the lot so that septic services and emergency vehicles can gain access to the temporary family health care dwelling in a safe and timely manner.\n(d) A temporary family health care dwelling is limited to one occupant who is a mentally or physically impaired person. The person must be identified in the application. Only one temporary family health care dwelling is allowed on a lot.\n(e) Unless otherwise provided, a temporary family health care dwelling installed under this section must comply with all applicable state law, local ordinances, and charter provisions.\nThe initial temporary dwelling permit is valid for six months. The applicant may renew the permit once for an additional six months.\nThe municipality may require that the permit holder provide evidence of compliance with this section as long as the temporary family health care dwelling remains on the property. The municipality may inspect the temporary family health care dwelling at reasonable times convenient to the caregiver to determine if the temporary family health care dwelling is occupied and meets the requirements of this section.\nThe municipality may revoke the temporary dwelling permit if the permit holder violates any requirement of this section. If the municipality revokes a permit, the permit holder has 60 days from the date of revocation to remove the temporary family health care dwelling.\nUnless otherwise provided by ordinance, the municipality may charge a fee of up to $100 for the initial permit and up to $50 for a renewal of the permit.\n(a) Due to the time-sensitive nature of issuing a temporary dwelling permit for a temporary family health care dwelling, the municipality does not have to hold a public hearing on the application.\n(b) The procedures governing the time limit for deciding an application for the temporary dwelling permit under this section are governed by section 15.99, except as provided in this section. The municipality has 15 days to issue a permit requested under this section or to deny it, except that if the statutory or home rule charter city holds regular meetings only once per calendar month the statutory or home rule charter city has 30 days to issue a permit requested under this section or to deny it. If the municipality receives a written request that does not contain all required information, the applicable 15-day or 30-day limit starts over only if the municipality sends written notice within five business days of receipt of the request telling the requester what information is missing. The municipality cannot extend the period of time to decide.\nA municipality may by ordinance opt-out of the requirements of this section.",
	"repealed": false
}