{
	"id": "245.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.50",
	"title": "245.50 INTERSTATE CONTRACTS, MENTAL HEALTH, CHEMICAL HEALTH, DETOXIFICATION SERVICES.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"Bordering state\" means Iowa, North Dakota, South Dakota, or Wisconsin.\n(b) \"Receiving agency\" means a public or private hospital, mental health center, chemical health treatment facility, detoxification facility, or other person or organization which provides mental health, chemical health, or detoxification services under this section to individuals from a state other than the state in which the agency is located.\n(c) \"Receiving state\" means the state in which a receiving agency is located.\n(d) \"Sending agency\" means a state or county agency which sends an individual to a bordering state for treatment or detoxification under this section.\n(e) \"Sending state\" means the state in which the sending agency is located.\n(a) The purpose of this section is to enable appropriate treatment or detoxification services to be provided to individuals, across state lines from the individual's state of residence, in qualified facilities that are closer to the homes of individuals than are facilities available in the individual's home state.\n(b) Unless prohibited by another law and subject to the exceptions listed in subdivision 3, a county board or the commissioner of human services may contract with an agency or facility in a bordering state for mental health, chemical health, or detoxification services for residents of Minnesota, and a Minnesota mental health, chemical health, or detoxification agency or facility may contract to provide services to residents of bordering states. Except as provided in subdivision 5, a person who receives services in another state under this section is subject to the laws of the state in which services are provided. A person who will receive services in another state under this section must be informed of the consequences of receiving services in another state, including the implications of the differences in state laws, to the extent the individual will be subject to the laws of the receiving state.\nA contract may not be entered into under this section for services to persons who:\n(1) are serving a sentence after conviction of a criminal offense;\n(2) are on probation or parole;\n(3) are the subject of a presentence investigation; or\n(4) have been committed involuntarily in Minnesota under chapter 253B for treatment of mental illness or chemical dependency, except as provided under subdivision 5.\nContracts entered into under this section must, at a minimum:\n(1) describe the services to be provided;\n(2) establish responsibility for the costs of services;\n(3) establish responsibility for the costs of transporting individuals receiving services under this section;\n(4) specify the duration of the contract;\n(5) specify the means of terminating the contract;\n(6) specify the terms and conditions for refusal to admit or retain an individual; and\n(7) identify the goals to be accomplished by the placement of an individual under this section.\n(a) An individual who is detained, committed, or placed on an involuntary basis under chapter 253B may be confined or treated in a bordering state pursuant to a contract under this section. An individual who is detained, committed, or placed on an involuntary basis under the civil law of a bordering state may be confined or treated in Minnesota pursuant to a contract under this section. A peace or health officer who is acting under the authority of the sending state may transport an individual to a receiving agency that provides services pursuant to a contract under this section and may transport the individual back to the sending state under the laws of the sending state. Court orders valid under the law of the sending state are granted recognition and reciprocity in the receiving state for individuals covered by a contract under this section to the extent that the court orders relate to confinement for treatment or care of mental illness, chemical dependency, or detoxification. Such treatment or care may address other conditions that may be co-occurring with the mental illness or chemical dependency. These court orders are not subject to legal challenge in the courts of the receiving state. Individuals who are detained, committed, or placed under the law of a sending state and who are transferred to a receiving state under this section continue to be in the legal custody of the authority responsible for them under the law of the sending state. Except in emergencies, those individuals may not be transferred, removed, or furloughed from a receiving agency without the specific approval of the authority responsible for them under the law of the sending state.\n(b) While in the receiving state pursuant to a contract under this section, an individual shall be subject to the sending state's laws and rules relating to length of confinement, reexaminations, and extensions of confinement. No individual may be sent to another state pursuant to a contract under this section until the receiving state has enacted a law recognizing the validity and applicability of this section.\n(c) If an individual receiving services pursuant to a contract under this section leaves the receiving agency without permission and the individual is subject to involuntary confinement under the law of the sending state, the receiving agency shall use all reasonable means to return the individual to the receiving agency. The receiving agency shall immediately report the absence to the sending agency. The receiving state has the primary responsibility for, and the authority to direct, the return of these individuals within its borders and is liable for the cost of the action to the extent that it would be liable for costs of its own resident.\n(d) Responsibility for payment for the cost of care remains with the sending agency.\n(e) This subdivision also applies to county contracts under subdivision 2 which include emergency care and treatment provided to a county resident in a bordering state.\n(f) If a Minnesota resident is admitted to a facility in a bordering state under this chapter, an individual who is licensed in the bordering state may act as a court examiner under sections 253B.07, 253B.08, 253B.092, 253B.12, and 253B.17 subject to the same requirements and limitations in section 253B.02, subdivision 4d. An examiner under section 253B.02, subdivision 7, may initiate an emergency hold under section 253B.051 on a Minnesota resident who is in a hospital that is under contract with a Minnesota governmental entity under this section provided the resident, in the opinion of the examiner, meets the criteria in section 253B.051.\n(g) This section shall apply to detoxification services that are unrelated to treatment whether the services are provided on a voluntary or involuntary basis.",
	"repealed": false
}