{
	"id": "216B.169",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.169",
	"title": "216B.169 RENEWABLE AND HIGH-EFFICIENCY ENERGY RATE OPTIONS.",
	"text": "For the purposes of this section, the following terms have the meanings given them.\n(a) \"Utility\" means a public utility, municipal utility, or cooperative electric association providing electric service at retail to Minnesota consumers.\n(b) \"Renewable energy\" has the meaning given in section 216B.2422, subdivision 1, paragraph (c).\n(c) \"High-efficiency, low-emissions, distributed generation\" means a distributed generation facility of no more than ten megawatts of interconnected capacity that is certified by the commissioner under subdivision 3 as a high-efficiency, low-emissions facility.\n(a) A utility may offer its customers one or more options that allow a customer to determine that a certain amount of the electricity generated or purchased on behalf of the customer is renewable energy or energy generated by high-efficiency, low-emissions, distributed generation such as fuel cells and microturbines fueled by a renewable fuel.\n(b) Rates charged to customers must be calculated using the utility's cost of acquiring the energy for the customer and must:\n(1) reflect the difference between the cost of generating or purchasing the additional renewable energy and the cost that would otherwise be attributed to the customer for the same amount of energy based on the utility's mix of renewable and nonrenewable energy sources; and\n(2) be distributed on a per kilowatt-hour basis among all customers who choose to participate in the program.\n(c) The utility may acquire the energy demanded by customers, in whole or in part, through procuring or generating the renewable energy directly, or through the purchase of credits from a provider that has received certification of eligible power supply pursuant to subdivision 3.\n(d) For the purposes of this section, \"renewable energy\" has the meaning given to \"eligible energy technology\" in section 216B.1691, subdivision 1, paragraph (c), but does not include energy recovered from combustion of mixed municipal solid waste or refuse-derived fuel from mixed municipal solid waste.\n(a) The commissioner shall certify a power supply or supplies as eligible to satisfy customer requirements under this section upon finding:\n(1) the power supply is renewable energy or energy generated by high-efficiency, low-emissions, distributed generation; and\n(2) the sales arrangements of energy from the supplies are such that the power supply is only sold once to retail consumers.\n(b) To facilitate compliance with this section, the commission may, by order, establish a program for tradable credits for eligible power supplies.",
	"repealed": false
}