{
	"id": "116A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.14",
	"title": "116A.14 PROCEDURE WHEN CONTRACT NOT LET.",
	"text": "Subsequent to the establishment of any water or sewer system, if no bids are received except for a price more than 30 percent in excess of the engineer's estimate proceedings may be had as follows:\n(a) If it shall appear to the persons interested in said system that the engineer made an error in the estimate or that the plans and specifications could be changed in a manner materially affecting the cost of the improvements without interfering with the efficiency thereof, then any of said persons may petition the board or court so stating and asking that an order be made reconsidering and rescinding the order theretofore made establishing the system, and that the engineer's and viewers' reports be referred back to the engineer and to the viewers for further consideration.\n(b) Upon presentation of such petition, the board or court shall order a hearing, therein designating the time and place for hearing, and cause notice thereof to be given by publication in the same newspapers where the notice of final hearing was theretofore published.\n(c) At the time and place specified in the order and notice, the board or court shall consider the petition and hear all interested parties.\n(d) Upon said hearing, if it shall appear that the engineer's original estimate was erroneous and should be corrected, or that the plans and specifications could be changed in a manner materially affecting the cost of the improvement without interfering with the efficiency thereof, and further, that upon said correction or modification, a contract could be let within the 30 percent limitation then the board or court may, by order, authorize the engineer to amend the report. If the changes recommended by the engineer in any manner affect the amount of damages to any property, the viewers' report shall be referred back to the viewers to reexamine the damages and report the same to the board or court.\n(e) The board or court may continue the hearing to give the engineer or the viewers additional time for the making of their amended reports and in such case the jurisdiction of the board or court shall continue in all respects at the adjourned hearing.\n(f) Upon said hearing the board or court shall have full authority to reopen the original order establishing said system, and to set said order aside, and to consider the amended engineer's report and the amended viewers' report, if any, and to make findings and an order thereon the same as is provided in section 116A.12. All proceedings thereafter taken shall be the same as is provided upon the original findings and order of the board or court.",
	"repealed": false
}