{
	"id": "462.396",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.396",
	"title": "462.396 GRANTS; LEVIES; BUDGET; ACCOUNTS; AUDITS; BIDS; DEPOSITS.",
	"text": "The governor and the legislature shall determine the amount of state assistance and designate an agency to make grants to any commission created under sections 462.381 to 462.398 from appropriations made available for those purposes. Any regional commission may levy a tax on all taxable property in the region to provide money for the purposes of sections 462.381 to 462.398.\nOn or before August 20 each year, the commission shall submit its proposed budget for the ensuing calendar year showing anticipated receipts, disbursements and ad valorem tax levy with a written notice of the time and place of the public hearing on the proposed budget to each county auditor and municipal clerk within the region and those town clerks who in advance have requested a copy of the budget and notice of public hearing. On or before September 15 each year, the commission shall adopt, after a public hearing held not later than September 15, a budget covering its anticipated receipts and disbursements for the ensuing year and shall decide upon the total amount necessary to be raised from ad valorem tax levies to meet its budget. After adoption of the budget and no later than September 15, the secretary of the commission shall certify to the auditor of each county within the region the county share of the tax, which shall be an amount bearing the same proportion to the total levy agreed on by the commission as the net tax capacity of the county bears to the net tax capacity of the region. (1) For taxes levied in 1998, the maximum amounts of levies made for the purposes of sections 462.381 to 462.398 are the following amounts: for Region 1, $180,337; for Region 2, $180,000; for Region 3, $353,110; for Region 5, $195,865; for Region 6E, $197,177; for Region 6W, $180,000; for Region 7E, $180,000; for Region 8, $206,107; for Region 9, $343,572. (2) For taxes levied in 1999 and thereafter, the maximum amount that may be levied by each commission shall be the amount authorized in clause (1), or 103 percent of the amount levied in the previous year, whichever is greater. The auditor of each county in the region shall add the amount of any levy made by the commission within the limits imposed by this subdivision to other tax levies of the county for collection by the county treasurer with other taxes. When collected the county treasurer shall make settlement of the taxes with the commission in the same manner as other taxes are distributed to political subdivisions.\nThe commission is a special purpose unit of government which may accept gifts, apply for and use grants or loans of money or other property from the United States, the state, or any person, local or governmental body for any commission purpose and may enter into agreements required in connection therewith and may hold, use, and dispose of such moneys or property in accordance with the terms of the gift, grant, loan, agreement, or contract relating thereto.\nFor purposes of receipt of state or federal funds for community and economic development, regional commissions shall be considered general purpose units of government.\nThe commission shall keep an accurate account of its receipts and disbursement. Disbursements of funds of the commission shall be made by check signed by the chair or vice-chair or secretary of the commission and countersigned by the executive director or an authorized deputy thereof after such auditing and approval of the expenditure as may be provided by rules of the commission. The state auditor may audit the books and accounts of the commission once each year, or as often as funds and personnel of the state auditor permit. The commission shall pay to the state the total cost and expenses of such examination, including the salaries paid to the auditors while actually engaged in making such examination. The general fund shall be credited with all collections made for any such examination. In lieu of an annual audit by the state auditor, the commission shall contract with a certified public accountant for the annual audit of the books and accounts of the commission. If a certified public accountant performs the audit, the commission shall send a copy of the audit to the state auditor.\nEvery contract of the commission for the purchase of merchandise, materials, or supplies shall be let in accordance with the provisions of section 471.345.\nThe commission shall from time to time designate one or more national or state banks, or trust companies authorized to do a banking business, as official depositories for money of the commission, and thereupon shall require the treasurer to deposit all or part of such money in such bank or banks. Such designation shall be in writing and set forth all the terms and conditions upon which the deposits are made, and shall be signed by the chair and secretary, and made a part of the minutes of the commission. Any bank or trust company so designated shall qualify as a depository by furnishing a corporate surety bond or collateral as required by chapter 118A, and shall thereafter, as long as money of the commission is on deposit therein, maintain such bond or collateral and shall be required to secure any deposit, insofar as it is insured under federal law, as provided in section 118A.03.",
	"repealed": false
}