{
	"id": "290.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.095",
	"title": "290.095 OPERATING LOSS DEDUCTION.",
	"text": "(a) There shall be allowed as a deduction for the taxable year the amount of any net operating loss deduction as provided in section 172 of the Internal Revenue Code, subject to the limitations and modifications provided in this section.\n(b) A net operating loss deduction shall be available under this section only to corporate taxpayers except that subdivisions 9 and 11 hereof apply only to individuals, estates, and trusts.\n(c) In the case of a regulated investment company or fund thereof, as defined in section 851(a) or 851(g) of the Internal Revenue Code, the deduction provided by this section shall not be allowed.\n[Repealed, 1Sp2001 c 5 art 9 s 30]\n(a) The term \"net operating loss\" as used in this section shall mean a net operating loss as defined in section 172(c) of the Internal Revenue Code, with the modifications specified in subdivision 4. The deductions provided in section 290.21 cannot be used in the determination of a net operating loss.\n(b) The term \"net operating loss deduction\" as used in this section means the aggregate of the net operating loss carryovers to the taxable year, computed in accordance with subdivision 3. The provisions of section 172(b) of the Internal Revenue Code relating to the carryback of net operating losses, do not apply.\n(c) The amount of net operating loss deduction under this section must not exceed 70 percent of taxable net income in a single taxable year.\n(a) A net operating loss incurred during the taxable year shall be a net operating loss carryover to each of the 15 taxable years following the taxable year of such loss.\n(b) The entire amount of the net operating loss for any taxable year shall be carried to the earliest of the taxable years to which such loss may be carried. The portion of such loss which shall be carried to each of the other taxable years shall be the excess, if any, of the amount of such loss over the sum of the taxable net income, adjusted by the modifications specified in subdivision 4, for each of the taxable years to which such loss may be carried.\n(c) Where a corporation apportions its income under the provisions of section 290.191, the net operating loss deduction incurred in any taxable year shall be allowed to the extent of the apportionment ratio of the loss year.\n(d) The provisions of sections 381, 382, and 384 of the Internal Revenue Code apply to carryovers in certain corporate acquisitions and special limitations on net operating loss carryovers. The limitation amount determined under section 382 shall be applied to net income, before apportionment, in each post change year to which a loss is carried.\nThe following modifications shall be made in computing a net operating loss in any taxable year and also in computing the taxable net income for any taxable year before a net operating loss deduction shall be allowed:\n(a) No deduction shall be allowed for or with respect to losses connected with income producing activities if the income therefrom would not be required to be either assignable to this state or included in computing the taxpayer's taxable net income.\n(b) A net operating loss deduction shall not be allowed.\n(c) The amount deductible on account of losses from sales or exchanges of capital assets shall not exceed the amount includable on account of gains from sales or exchanges of capital assets.\n(d) Renegotiation of profits for a prior taxable year under the renegotiation laws of the United States of America, including renegotiation of the profits with a subcontractor, shall not enter into the computation.\n(e) Federal income and excess profits taxes shall not be allowed as a deduction.\nWherever, under the provisions of this chapter, any taxpayer is required or permitted to make a return for a period of less than 12 months, such period shall be deemed a taxable year in the application of the provisions of this section.\n[Repealed, 1980 c 419 s 46]\n[Repealed, 1Sp2001 c 5 art 7 s 66]\n[Repealed, 1987 c 268 art 1 s 127]\nFor the purposes of sections 289A.40 and 289A.50 if the claim for refund relates to an overpayment attributable to a net operating loss carryback under this section, in lieu of the period of limitation prescribed in section 289A.40, the period shall be that period which ends with the expiration of the 15th day of the 46th month following the end of the taxable year of the net operating loss which results in such carryback, plus any extension of time granted for filing the return, but only if the return was filed within the extended time.\n[Repealed, 1987 c 268 art 1 s 127]\n(a) Except as provided in paragraphs (c) and (d), for individuals, estates, and trusts the amount of a net operating loss that may be carried back or carried over shall be the same dollar amount allowable in the determination of federal taxable income, provided that, notwithstanding any other provision, estates and trusts must apply the following adjustments to the amount of the net operating loss that may be carried back or carried over:\n(1) Nonassignable income or losses as required by section 290.17.\n(2) Deductions not allocable to Minnesota under section 290.17.\n(b) The net operating loss carryback or carryover applied as a deduction in the taxable year to which the net operating loss is carried back or carried over shall be equal to the net operating loss carryback or carryover applied in the taxable year in arriving at federal taxable income provided that trusts and estates must apply the following modifications:\n(1) Increase the amount of carryback or carryover applied in the taxable year by the amount of losses and interest, taxes and other expenses not assignable or allowable to Minnesota incurred in the taxable year.\n(2) Decrease the amount of carryback or carryover applied in the taxable year by the amount of income not assignable to Minnesota earned in the taxable year. For estates and trusts, the net operating loss carryback or carryover to the next consecutive taxable year shall be the net operating loss carryback or carryover as calculated in clause (b) less the amount applied in the earlier taxable year(s). No additional net operating loss carryback or carryover shall be allowed to estates and trusts if the entire amount has been used to offset Minnesota income in a year earlier than was possible on the federal return. However, if a net operating loss carryback or carryover was allowed to offset federal income in a year earlier than was possible on the Minnesota return, an estate or trust shall still be allowed to offset Minnesota income but only if the loss was assignable to Minnesota in the year the loss occurred.\n(c) This paragraph does not apply to eligible small businesses that make a valid election to carry back their losses for federal purposes under section 172(b)(1)(H) of the Internal Revenue Code as amended through March 31, 2009.\n(1) A net operating loss of an individual, estate, or trust that is allowed under this subdivision and for which the taxpayer elects to carry back for more than two years under section 172(b)(1)(H) of the Internal Revenue Code is a net operating loss carryback to each of the two taxable years preceding the loss, and unused portions may be carried forward for 20 taxable years after the loss.\n(2) The entire amount of the net operating loss for any taxable year must be carried to the earliest of the taxable years to which the loss may be carried. The portion of the loss which may be carried to each of the other taxable years is the excess, if any, of the amount of the loss over the greater of the taxable net income or alternative minimum taxable income for each of the taxable years to which the loss may be carried.\n(d) The amount of a net operating loss carried forward must be reduced by any amounts used for the subtraction in section 290.0132, subdivision 33, in the next taxable year following the subtraction in which a net operating loss deduction is claimed.\n[See Note.]\n[Repealed, 1988 c 719 art 2 s 57]",
	"repealed": false
}