{
	"id": "253B.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.12",
	"title": "253B.12 TREATMENT REPORT; REVIEW; HEARING.",
	"text": "(a) If a patient who was committed as a person who poses a risk of harm due to a mental illness, or as a person who has a developmental disability or chemical dependency, is discharged from commitment within the first 60 days after the date of the initial commitment order, the head of the treatment facility, state-operated treatment program, or community-based treatment program shall file a written report with the committing court describing the patient's need for further treatment. A copy of the report must be provided to the county attorney, the patient, and the patient's counsel.\n(b) If a patient who was committed as a person who poses a risk of harm due to a mental illness, or as a person who has a developmental disability or chemical dependency, remains in treatment more than 60 days after the date of the commitment, then at least 60 days, but not more than 90 days, after the date of the order, the head of the facility or program that has custody of the patient shall file a written report with the committing court and provide a copy to the county attorney, the patient, and the patient's counsel. The report must set forth in detailed narrative form at least the following:\n(1) the diagnosis of the patient with the supporting data;\n(2) the anticipated discharge date;\n(3) an individualized treatment plan;\n(4) a detailed description of the discharge planning process with suggested after care plan;\n(5) whether the patient is in need of further care and treatment, the treatment facility, state-operated treatment program, or community-based treatment program that is needed, and evidence to support the response;\n(6) whether the patient satisfies the statutory requirement for continued commitment with documentation to support the opinion;\n(7) a statement from the patient related to accepting treatment, if possible; and\n(8) whether the administration of neuroleptic medication is clinically indicated, whether the patient is able to give informed consent to that medication, and the basis for these opinions.\n(c) Prior to the termination of the initial commitment order or final discharge of the patient, the head of the facility or program that has custody or care of the patient shall file a written report with the committing court with a copy to the county attorney, the patient, and the patient's counsel that sets forth the information required in paragraph (b).\n(d) If the patient has been provisionally discharged from a facility or program, the report shall be filed by the designated agency, which may submit the discharge report as part of its report.\n(e) If a report describes the patient as not in need of further court-ordered treatment, the proceedings must be terminated by the committing court and the patient discharged from the treatment facility, state-operated treatment program, or community-based treatment program, unless the patient chooses to voluntarily receive services.\n(f) If no written report is filed within the required time, the court must notify the county, facility or program to which the person is committed, and designated agency and require a report be filed within five business days. If a report is not filed within five business days a hearing must be held within three business days.\nMS 2018 [Repealed, 1Sp2020 c 2 art 6 s 124]\n(a) Unless the proceedings are terminated under subdivision 1, paragraph (e), a review hearing must be held within 14 days after receipt by the committing court of the report required under subdivision 1, paragraph (c) or (d), and before the time the commitment expires. For good cause shown, the court may continue the hearing for up to an additional 14 days and extend any orders until the review hearing is held.\n(b) The patient, the patient's counsel, the petitioner, and other persons as the court directs must be given at least five days' notice of the time and place of the hearing. The hearing may be conducted by interactive video conference under General Rules of Practice, rule 131, and Minnesota Rules of Civil Commitment, rule 14.\nPrior to the review hearing, the court shall inform the patient of the right to an independent examination by a court examiner chosen by the patient and appointed in accordance with provisions of section 253B.07, subdivision 3. The report of the court examiner may be submitted at the hearing.\n(a) The committing court shall not make a final determination of the need to continue commitment unless the court finds by clear and convincing evidence that (1) the patient continues to have a mental illness, developmental disability, or chemical dependency; (2) involuntary commitment is necessary for the protection of the patient or others; and (3) there is no alternative to involuntary commitment.\n(b) In determining whether a patient continues to require commitment due to mental illness, developmental disability, or chemical dependency, the court need not find that there has been a recent attempt or threat to physically harm self or others, or a recent failure to provide necessary food, clothing, shelter, or medical care. Instead, the court must find that the patient is likely to attempt to physically harm self or others, or to fail to obtain necessary food, clothing, shelter, or medical care unless involuntary commitment is continued.\n[Repealed, 1997 c 217 art 1 s 118]\nA patient, after consultation with counsel, may waive any hearing under this section or section 253B.13 in writing. The waiver shall be signed by the patient and counsel. The waiver must be submitted to the committing court.\nWhere continued commitment is ordered, the findings of fact and conclusions of law shall specifically state the conduct of the proposed patient which is the basis for the final determination, that the statutory criteria of commitment continue to be met, and that less restrictive alternatives have been considered and rejected by the court. Reasons for rejecting each alternative shall be stated. A copy of the final order for continued commitment shall be forwarded to the head of the facility or program to which the person is committed and, if the patient has been provisionally discharged, to the designated agency responsible for monitoring the provisional discharge.\n[Repealed, 1997 c 217 art 1 s 118]",
	"repealed": false
}