{
	"id": "168.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.33",
	"title": "168.33 COMMISSIONER AS REGISTRAR OF VEHICLES; DEPUTY REGISTRARS.",
	"text": "The commissioner of public safety is the registrar of vehicles of the state of Minnesota, and shall exercise all the powers granted to and perform all the duties imposed by this chapter. The commissioner of public safety is authorized to obtain information about all vehicles subject to taxation under this chapter upon which the tax has not been paid, and to present suitable complaints to courts of competent jurisdiction.\n(a) The commissioner may appoint, and for cause discontinue, a deputy registrar for any statutory or home rule charter city as the public interest and convenience may require, without regard to whether the county auditor of the county in which the city is situated has been appointed as the deputy registrar for the county or has been discontinued as the deputy registrar for the county, and without regard to whether the county in which the city is situated has established a county license bureau that issues motor vehicle licenses as provided in section 373.32.\n(b) The commissioner may appoint, and for cause discontinue, a deputy registrar for any statutory or home rule charter city as the public interest and convenience may require, if the auditor for the county in which the city is situated chooses not to accept appointment as the deputy registrar for the county or is discontinued as a deputy registrar, or if the county in which the city is situated has not established a county license bureau that issues motor vehicle licenses as provided in section 373.32.\n(c) The commissioner may appoint, and for cause discontinue, the county auditor of each county as a deputy registrar.\n(d) Despite any other provision, a person other than a county auditor or a director of a county license bureau, who was appointed by the registrar before August 1, 1976, as a deputy registrar for any statutory or home rule charter city, may continue to serve as deputy registrar and may be discontinued for cause only by the commissioner. The county auditor who appointed the deputy registrars is responsible for the acts of deputy registrars appointed by the auditor.\n(e) Each deputy, before entering upon the discharge of duties, shall take and subscribe an oath to faithfully discharge the duties and to uphold the laws of the state.\n(f) If a deputy registrar appointed under this subdivision is not an officer or employee of a county or statutory or home rule charter city, the deputy shall in addition give bond to the state in the sum of $10,000, or a larger sum as may be required by the commissioner, conditioned upon the faithful discharge of duties as deputy registrar.\n(g) A corporation governed by chapter 302A or 317A may be appointed a deputy registrar. Upon application by an individual serving as a deputy registrar and the giving of the requisite bond as provided in this subdivision, personally assured by the individual or another individual approved by the commissioner, a corporation named in an application then becomes the duly appointed and qualified successor to the deputy registrar.\n(h) Each deputy registrar appointed under this subdivision shall keep and maintain office locations approved by the commissioner for the registration of vehicles and the collection of taxes and fees on vehicles.\n(i) The deputy registrar shall keep records and make reports to the commissioner as the commissioner requires. The records must be maintained at the offices of the deputy registrar in a manner that complies with sections 13.05, subdivision 5, and 13.055. As an alternative to paper copy storage, a deputy registrar may retain records and documents in a secure electronic medium that complies with the security requirements under the United States Federal Bureau of Investigation, Criminal Justice Information Services Division, Policy 5.4 or any successor policy, provided 60 days have elapsed since the transaction and subject to standards established by the commissioner. The deputy registrar is responsible for all costs associated with the conversion to electronic records and maintenance of the electronic storage medium, including the destruction of existing paper records after conversion to the electronic format. All queries and responses in the secure electronic medium, and all actions in which data are entered, updated, accessed, or shared or disseminated by the deputy registrar must be contained in a data audit trail. Data contained in the audit trail are public to the extent the data are not otherwise classified under this section. The records and offices of the deputy registrar must at all times be open to the inspection of the commissioner or the commissioner's agents. The deputy registrar shall report to the commissioner by the next working day following receipt all registrations made and taxes and fees collected by the deputy registrar.\n(j) The filing fee imposed under subdivision 7 must be deposited in the treasury of the place for which appointed or, if not a public official, a deputy shall retain the filing fee, but the registration tax and any additional fees for delayed registration the deputy registrar has collected the deputy registrar shall deposit by the next working day following receipt in an approved state depository to the credit of the state through the commissioner of management and budget. The place for which the deputy registrar is appointed through its governing body must provide the deputy registrar with facilities and personnel to carry out the duties imposed by this subdivision if the deputy is a public official. In all other cases, the deputy shall maintain a suitable facility for serving the public.\nPersons serving as deputy registrars on July 1, 1970, shall continue to hold office until a successor is duly appointed and qualifies.\n(a) Deputy registrars, and their employees, who retain the filing fee in lieu of a salary, shall, after July 1, 1971, be considered as independent contractors for pension purposes, and ineligible because of such service for coverage under the Minnesota State Retirement System or membership in the Public Employees Retirement Association.\n(b) Those deputy registrars as defined in this subdivision who are covered by the Minnesota State Retirement System on June 30, 1971, may terminate coverage on July 1, 1971, or continue coverage until termination of state service. The form of this option and the time for filing must be as prescribed by the board of directors of the system. Those choosing to continue coverage shall provide from the filing fees retained the employee and employer contributions as required by chapter 352.\n[Renumbered 168.0185]\nMS 1994 [Repealed, 1996 c 435 s 18]\nMS 1994 [Repealed, 1996 c 435 s 18]\nEvery deputy registrar shall use application forms or formats as prescribed by or approved by the commissioner.\n(a) In addition to all other statutory fees and taxes:\n(1) an $8 filing fee is imposed on every vehicle registration renewal, excluding pro rate transactions; and\n(2) a $12 filing fee is imposed on every other type of vehicle transaction, including motor carrier fuel licenses under sections 168D.05 and 168D.06, and pro rate transactions.\n(b) Notwithstanding paragraph (a):\n(1) a filing fee may not be charged for a document returned for a refund or for a correction of an error made by the Department of Public Safety, a dealer, or a deputy registrar; and\n(2) no filing fee or other fee may be charged for the permanent surrender of a title for a vehicle.\n(c) The filing fee must be shown as a separate item on all registration renewal notices sent out by the commissioner.\n(d) The statutory fees and taxes, the filing fees imposed under paragraph (a), and the surcharge imposed under paragraph (f) may be paid by credit card or debit card. The deputy registrar may collect a surcharge on the payment made under this paragraph not greater than the cost of processing a credit card or debit card transaction, in accordance with emergency rules established by the commissioner of public safety. The surcharge authorized by this paragraph must be used to pay the cost of processing credit and debit card transactions.\n(e) The fees collected under paragraph (a) by the department must be allocated as follows:\n(1) of the fees collected under paragraph (a), clause (1):\n(i) $6.50 must be deposited in the driver and vehicle services operating account under section 299A.705, subdivision 1; and\n(ii) $1.50 must be deposited in the driver and vehicle services technology account under section 299A.705, subdivision 3; and\n(2) of the fees collected under paragraph (a), clause (2):\n(i) $3.50 must be deposited in the general fund;\n(ii) $7 must be deposited in the driver and vehicle services operating account under section 299A.705, subdivision 1; and\n(iii) $1.50 must be deposited in the driver and vehicle services technology account under section 299A.705, subdivision 3.\n(f) In addition to all other statutory fees and taxes, a deputy registrar must assess a $1 surcharge on every transaction for which filing fees are collected under this subdivision. The surcharge authorized by this paragraph must be (1) deposited in the treasury of the place for which the deputy registrar is appointed, or (2) if the deputy registrar is not a public official, retained by the deputy registrar. For purposes of this paragraph, a deputy registrar does not include the commissioner.\nThe commissioner shall allow deputy registrars to implement and follow procedures for processing applications and accepting and remitting fee payments for disability certificates issued under section 169.345, subdivision 3c, that are identical or substantially similar to the procedures required by law or rule for vehicle registration and titling transactions.\n(a) If the commissioner accepts electronic transmission of a motor vehicle transfer and registration by a new or used motor vehicle dealer, a deputy registrar who is equipped with electronic transmission technology and trained in its use must receive the filing fee provided for in subdivision 7 and review the transfer of each new or used motor vehicle to determine its genuineness and regularity before issuance of a certificate of title, and must receive and retain the filing fee under subdivision 7, paragraph (a), clause (2).\n(b) The commissioner must establish reasonable performance, security, technical, and financial standards to approve companies that provide computer software and services to motor vehicle dealers to electronically transmit vehicle title transfer and registration information. An approved company must be offered access to department facilities, staff, and technology on a fair and reasonable basis. An approved company must not have an ownership interest with a deputy registrar or a driver's license agent. An approved company is not eligible to be appointed by the commissioner as a deputy registrar or a driver's license agent.\n(a) Notwithstanding any statute or rule to the contrary, if a deputy registrar appointed under this section permanently stops offering services at the approved office location and permanently closes the approved office location, the commissioner must use a competitive bidding process for the appointment of a replacement deputy registrar. If available, the replacement deputy registrar appointed by the commissioner under this section must continue to offer services at the approved office location. If the existing office location is not available to the replacement deputy registrar, the replacement office location must be at a location that must be approved by the commissioner and must serve a similar service area as the existing office location.\n(b) The commissioner must not give a preference to a partner, owner, manager, or employee of the deputy registrar that has permanently stopped offering services at the closed office location in a competitive bidding process.\n(c) The commissioner must adopt rules to administer and enforce a competitive bidding process to select a replacement deputy registrar. If the replacement deputy registrar elects to not offer services at the office location of the prior registrar, Minnesota Rules, chapter 7406, governing the selection of a proposed office location of a driver's license agent, applies.\n[See Note.]\nThe commissioner may adopt rules for administering and enforcing section 168.0185 and this section.",
	"repealed": false
}