{
	"id": "205A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/205A.06",
	"title": "205A.06 CANDIDATES, FILING.",
	"text": "An individual who is eligible and desires to become a candidate for an office to be voted on at the election must file an affidavit of candidacy with the school district clerk. The affidavit must be in the form prescribed by section 204B.06. The school district clerk shall also accept an application signed by at least five voters and filed on behalf of an eligible voter in the school district whom they desire to be a candidate, if service of a copy of the application has been made on the candidate and proof of service is endorsed on the application being filed. No individual shall be nominated by nominating petition for a school district elective office. Upon receipt of the proper filing fee, the clerk shall place the name of the candidate on the official ballot without partisan designation.\nIn school districts that have adopted a resolution to choose nominees for school board by a primary election, affidavits of candidacy must be filed with the school district clerk no earlier than the 84th day and no later than the 70th day before the second Tuesday in August in the year when the school district general election is held. In all other school districts, affidavits of candidacy must be filed no earlier than the 98th day and no later than the 84th day before the school district general election.\nA sex offender who has been convicted of an offense for which registration is required under section 243.166 is ineligible to become a candidate for the office of school board member and may not file an affidavit of candidacy for that office. Ineligibility is determined by the registration requirements in effect at the time the offender files for office, not by the registration requirements, if any, that were in effect at the time the offender was convicted.\nA candidate for the office of school board member who will be absent from the state during the filing period may submit a properly executed affidavit of candidacy, the appropriate filing fee, and any necessary petitions in person to the filing officer. The candidate shall state in writing the reason for being unable to submit the affidavit during the filing period. The affidavit, filing fee, and petitions must be submitted to the filing officer during the seven days immediately preceding the candidate's absence from the state.\nAt least two weeks before the first day to file affidavits of candidacy, the school district clerk shall publish a notice in the official newspaper stating the first and last dates on which affidavits of candidacy may be filed in the clerk's office and the closing time for filing on the last day for filing. The clerk shall post a similar notice in the administrative offices of the school district at least ten days before the first day to file affidavits of candidacy.\nThe filing fee for a school district office is $2.\nA candidate for school district office may file a petition in place of the filing fees in subdivision 3. The petition must meet the requirements of section 204B.11, subdivision 2.\nA candidate for a school district elective office may withdraw from the election by filing an affidavit of withdrawal with the school district clerk no later than 5:00 p.m. two days after the last day for filing affidavits of candidacy. After that date, no candidate may file an affidavit of withdrawal.",
	"repealed": false
}