{
	"id": "609.221",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.221",
	"title": "609.221 ASSAULT IN THE FIRST DEGREE.",
	"text": "Whoever assaults another and inflicts great bodily harm may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $30,000, or both.\nWhoever assaults a peace officer, prosecuting attorney, judge, or correctional employee by using or attempting to use deadly force against the officer, attorney, judge, or employee while the person is engaged in the performance of a duty imposed by law, policy, or rule may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $30,000, or both.\nWhoever assaults a peace officer, prosecuting attorney, judge, or correctional employee and inflicts great bodily harm on the officer, attorney, judge, or employee while the person is engaged in the performance of a duty imposed by law, policy, or rule may be sentenced to imprisonment for not more than 25 years or to payment of a fine of not more than $35,000, or both.\nWhoever assaults and inflicts great bodily harm upon a peace officer, prosecuting attorney, judge, or correctional employee with a dangerous weapon or by using or attempting to use deadly force against the officer, attorney, judge, or employee while the person is engaged in the performance of a duty imposed by law, policy, or rule may be sentenced to imprisonment for not more than 30 years or to payment of a fine of not more than $40,000, or both.\n(a) A person convicted of assaulting a peace officer, prosecuting attorney, judge, or correctional employee shall be committed to the custody of the commissioner of corrections for not less than:\n(1) ten years, nor more than 20 years, for a violation of subdivision 2;\n(2) 15 years, nor more than 25 years, for a violation of subdivision 3; or\n(3) 25 years, nor more than 30 years, for a violation of subdivision 4.\n(b) A defendant convicted and sentenced as required by this subdivision is not eligible for probation, parole, discharge, work release, or supervised release, until that person has served the full term of imprisonment as provided by law, notwithstanding the provisions of sections 241.26, 242.19, 243.05, 244.04, 609.12, and 609.135. Notwithstanding section 609.135, the court may not stay the imposition or execution of this sentence.\nAs used in this section:\n(1) \"correctional employee\" means an employee of a public or private prison, jail, or workhouse;\n(2) \"deadly force\" has the meaning given in section 609.066, subdivision 1;\n(3) \"peace officer\" has the meaning given in section 626.84, subdivision 1;\n(4) \"prosecuting attorney\" means an attorney, with criminal prosecution or civil responsibilities, who is the attorney general, a political subdivision's elected or appointed county or city attorney, or a deputy, assistant, or special assistant of any of these; and\n(5) \"judge\" means a judge or justice of any court of this state that is established by the Minnesota Constitution.",
	"repealed": false
}