{
	"id": "142D.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.31",
	"title": "142D.31 TEACHER EDUCATION AND COMPENSATION HELPS; EARLY CHILDHOOD TEACHER EDUCATION INCENTIVES.",
	"text": "The teacher education and compensation helps program (TEACH) is established to provide tuition scholarships and education incentives to early care and education providers. The commissioner shall make a grant with appropriations for this purpose to a nonprofit organization licensed to administer the TEACH early childhood program.\n(a) The nonprofit organization must use the grant for:\n(1) tuition scholarships up to $10,000 per year for courses leading to the nationally recognized child development associate credential or college-level courses leading to an associate's degree or bachelor's degree in early childhood development and school-age care; and\n(2) education incentives of a minimum of $250 to participants in the tuition scholarship program if they complete a year of working in the early care and education field.\n(b) Applicants for the scholarship must be employed by a licensed early childhood or child care program and working directly with children, a licensed family child care provider, employed by a public prekindergarten program, or an employee in a school-age program exempt from licensing under section 142B.05, subdivision 2, paragraph (a), clause (8). Lower wage earners must be given priority in awarding the tuition scholarships. Scholarship recipients must contribute at least ten percent of the total scholarship and must be sponsored by their employers, who must also contribute at least five percent of the total scholarship. Scholarship recipients who are self-employed must contribute 20 percent of the total scholarship.\nThe TEACH early childhood and Minnesota early childhood teacher education incentive programs may have an advisory board as prescribed by the national TEACH organization.\nA nonprofit organization that receives a grant under this section may use ten percent of the grant amount to administer the program.",
	"repealed": false
}