{
	"id": "356.302",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.302",
	"title": "356.302 DISABILITY BENEFIT WITH COMBINED SERVICE.",
	"text": "(a) The terms used in this section are defined in this subdivision.\n(b) \"Average salary\" means the highest average of covered salary for the appropriate period of credited service that is required for the calculation of a disability benefit by the covered retirement plan and that is drawn from any period of credited service and successive years of covered salary in a covered retirement plan.\n(c) \"Covered retirement plan\" or \"plan\" means a retirement plan listed in subdivision 7.\n(d) \"Duty-related\" means a disabling illness or injury that occurred while the person was actively engaged in employment duties or that arose out of the person's active employment duties.\n(e) \"General employee retirement plan\" means a covered retirement plan listed in subdivision 7, clauses (1) to (6) and (11).\n(f) \"Occupationally disabled\" means the condition of having a medically determinable physical or mental impairment that makes a person unable to satisfactorily perform the minimum requirements of the person's employment position or a substantially similar employment position.\n(g) \"Public safety employee retirement plan\" means a covered retirement plan listed in subdivision 7, clauses (7) to (10).\n(h) \"Totally and permanently disabled\" means the condition of having a medically determinable physical or mental impairment that makes a person unable to engage in any substantial gainful activity and that is expected to continue or has continued for a period of at least one year or that is expected to result directly in the person's death.\nNotwithstanding any provision of law to the contrary governing any covered retirement plan, a member of a covered retirement plan may receive a combined service disability benefit from each covered retirement plan in which the person has credit for at least one-half year of allowable service if that person meets the applicable qualifying conditions. Subdivision 3 applies to a member of a general employee retirement plan. Subdivision 4 applies to a member of a public safety employee retirement plan. Subdivision 5 applies to a member of a covered retirement plan with both general employee and public safety employee retirement plan service.\nA disabled member of a covered retirement plan who has credit for allowable service in a combination of general employee retirement plans is entitled to a combined service disability benefit if the member:\n(1) is less than the normal retirement age on the date of the application for the disability benefit;\n(2) has become totally and permanently disabled;\n(3) has credit for allowable service in any combination of general employee retirement plans totaling at least the number of years required by the applicable retirement plan with the longest service credit requirement for disability benefit receipt;\n(4) has credit for at least one-half year of allowable service with the current general employee retirement plan before the commencement of the disability;\n(5) has at least three continuous years of allowable service credit by the general employee retirement plan or has at least a total of three years of allowable service credit by a combination of general employee retirement plans in a 72-month period during which no interruption of allowable service credit from a termination of employment exceeded 29 days; and\n(6) was not receiving a retirement annuity or disability benefit from any covered general employee retirement plan at the time of the commencement of the disability.\nA disabled member of a covered retirement plan who has credit for allowable service in a combination of public safety employee retirement plans is entitled to a combined service disability benefit if the member:\n(1) has become occupationally disabled;\n(2) has credit for allowable service in any combination of public safety employee retirement plans totaling at least the minimum period of service credit required by the applicable retirement plan with the longest service credit eligibility requirement for the receipt of a duty-related disability benefit if the disability is duty-related or totaling at least the minimum period of service credit required by the applicable retirement plan with the longest service credit eligibility requirement for a disability benefit that is not duty-related if the disability is not duty-related;\n(3) has credit for at least one-half year of allowable service with the current public safety employee retirement plan before the commencement of the disability; and\n(4) was not receiving a retirement annuity or disability benefit from any covered public safety employee retirement plan at the time of the commencement of the disability.\nA disabled member of a covered retirement plan who has credit for allowable service in a combination of both a public safety employee retirement plan and general employee retirement plan must meet the qualifying requirements in subdivisions 3 and 4 to receive a combined service disability benefit from the applicable general employee and public safety employee retirement plans, except that the person need only be a member of a covered retirement plan at the time of the commencement of the disability, that the person must have allowable service credit for the applicable retirement plan with the longest service credit eligibility requirement for the receipt of a disability benefit, and that the minimum allowable service requirements of subdivisions 3, clauses (3) and (5), and 4, clauses (3) and (4), may be met in any combination of covered retirement plans.\n(a) The combined service disability benefit from each covered retirement plan must be based on the allowable service in each retirement plan, except as specified in paragraphs (b) to (f).\n(b) The disability benefit must be governed by the law in effect for each covered retirement plan on the date of the commencement of the member's most recent qualifying disability as a member of a covered retirement plan.\n(c) All plans must base the disability benefit on the same average salary figure to the extent practicable.\n(d) If the method of the covered retirement plan used to compute a disability benefit varies based on the length of allowable service credit, the benefit accrual formula percentages used by the plan must recognize the allowable service credit in the plan as a continuation of any previous allowable service credit with other covered retirement plans.\n(e) If the covered retirement plan is a defined benefit or formula plan and the method used to compute a disability benefit does not vary based on the length of allowable service credit, the portion of the specified benefit amount from the plan must bear the same proportion to the total specified benefit amount as the allowable service credit in that plan bears to the total allowable service credit in all covered retirement plans. If the covered retirement plan is a defined contribution or nonformula plan, the disability benefit amount for allowable service under the plan is not affected, but the service and the covered salary under the plan must be used as applicable in calculations by other covered retirement plans.\n(f) A period for which a person has allowable service credit in more than one covered retirement plan must be used only once in determining the total allowable service credit for calculating the combined service disability benefit, with any period of duplicated service credit handled as provided in section 356.30, subdivision 1, paragraphs (g) and (h).\n(g) If a person is entitled to a minimum benefit payable from one of the public pension plans enumerated in section 356.30, subdivision 3, the person may receive additional credit for only those years of service in another covered pension plan that, when added to the years of service in the pension plan that is paying the minimum benefit, exceed the years of service on which the minimum benefit is based.\n(h) A partially employed recipient of a disability benefit must have any current reemployment income plus the total disability payments from all plans enumerated in subdivision 7 added together, and then compared to their final salary rate as a public employee. If current income plus the total disability payments exceed the final salary of the person at the time of retirement, then disability benefit payments from all the plans must be reduced on a prorated basis relative to the years of service in each fund so that earnings plus benefit payments do not exceed the final salary rate.\nThis section applies to the following retirement plans:\n(1) the general state employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(2) the unclassified state employees retirement program of the Minnesota State Retirement System, established by chapter 352D;\n(3) the general employees retirement plan of the Public Employees Retirement Association, established by chapter 353;\n(4) the Teachers Retirement Association, established by chapter 354;\n(5) the St. Paul Teachers Retirement Fund Association, established by chapter 354A;\n(6) the state correctional employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(7) the State Patrol retirement plan, established by chapter 352B;\n(8) the public employees police and fire plan of the Public Employees Retirement Association, established by chapter 353;\n(9) the local government correctional service retirement plan of the Public Employees Retirement Association, established by chapter 353E; and\n(10) the judges retirement plan, established by chapter 490.",
	"repealed": false
}