{
	"id": "390.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/390.33",
	"title": "390.33 APPOINTMENT OF MEDICAL EXAMINER; INQUEST.",
	"text": "A county board shall appoint as permanent county medical examiner a doctor of medicine or osteopathic medicine licensed to practice pursuant to chapter 147, or similar laws in any other state. A county medical examiner shall perform the duties imposed upon medical examiners by sections 390.31 to 390.35 and serve at the pleasure of the county board. The county board shall pay the medical examiner a salary to be determined by the board and provide for the payment of the medical examiner's expenses incurred in the performance of duties.\nThe judge exercising probate jurisdiction may issue subpoenas for witnesses, returnable immediately or at a time and place the judge directs. The persons served with subpoenas shall be allowed the same fees, the sheriff shall enforce their attendance in the same manner, and they shall be subject to the same penalties as if they had been served with a subpoena in behalf of the state in a criminal case before a district court judge.\nThe following oath shall be administered to the witnesses by the judge: \"Do you solemnly swear that the evidence you shall give to this inquest concerning the death under investigation shall be the whole truth and nothing but the truth, so help you God?\"\nThe testimony of the inquest and all records of the proceedings before the judge exercising probate jurisdiction must be kept as a permanent record of the court. The record or any portion of it must be transcribed upon order of the court or upon the request of any witness who shall pay the county treasurer the cost of the transcript or portion of it determined by the judge. The record of the inquest proceedings and the report may not be used in evidence in a civil action arising out of the death for which the inquest was ordered.\nIf the judge finds that murder, manslaughter, or assault has been committed, the judge shall hold over by recognizance any witnesses the judge thinks proper to appear and testify at the next term of the district court at which indictment for the offense can be found. The judge shall return to the court the inquisition, written evidence, and all recognizances and examinations taken, and may commit to the county jail any witness who refuses to recognize as the judge directs.\nIf a person charged by the inquest as having committed the offense is not in custody, the judge may issue process for apprehension of the person. The warrant must be made returnable before any court having jurisdiction in the case. The court shall proceed in the same manner as in similar cases.\nMS 1978 [Repealed, 1980 c 509 s 149]\nEach sheriff shall have fingerprinted all deceased persons in the county whose identity is not immediately established. Within 24 hours, the sheriff shall forward the fingerprints, fingerprint records, and other identification data to the Bureau of Criminal Apprehension. The superintendent of the bureau shall prescribe the form of these reports.\nAny duty of the coroner imposed by law prior to May 18, 1971, and not transferred by sections 390.31 to 390.35 or some other provision of law is transferred to the medical examiner of the county in which the coroner was elected or appointed.",
	"repealed": false
}