{
	"id": "204D.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.13",
	"title": "204D.13 BALLOT; PARTISAN OFFICES.",
	"text": "The candidates for partisan offices shall be placed on the state general election ballot in the following order: senator in Congress shall be first; representative in Congress, second; state senator, third; and state representative, fourth. The candidates for state offices shall follow in the order specified by the secretary of state. Candidates for governor and lieutenant governor shall appear so that a single vote may be cast for both offices. Vacant offices being filled by special election must be listed with other offices of that type, but after any office of that type for which a candidate will be elected for a full term.\nThe first name printed for president and vice president of the United States on the state general election ballot shall be that of the candidate of the major political party that received the smallest average number of votes at the last state general election. The succeeding names shall be those of the candidates of the other major political parties that received a succeedingly higher average number of votes respectively. For the purposes of this subdivision, the average number of votes of a major political party shall be computed by dividing the total number of votes counted for all of the party's candidates for statewide office at the state general election by the number of those candidates at the election. The names of candidates nominated by petition for president and vice president shall be placed on the state general election ballot after the names of the candidates for that office who were nominated by major political parties. No later than 11 weeks before the state general election, the secretary of state shall determine by lot the order of candidates nominated by petition. The drawing of lots must be by political party or principle.\nExcept as provided in subdivision 2, the names of candidates for partisan offices on the state general election ballot shall be rotated in the manner provided for rotation of names on state partisan primary ballots by section 204D.08, subdivision 3.\nFor candidates nominated by petition for partisan office, the political party or political principle of a candidate as stated on the petition shall be placed after the name of a candidate nominated by petition. The word \"nonpartisan\" shall not be used to designate any partisan candidate whose name is placed on the state general election ballot by nominating petition.\n[Expired]",
	"repealed": false
}