{
	"id": "144.9508",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9508",
	"title": "144.9508 RULES.",
	"text": "The commissioner shall adopt, by rule, methods for:\n(1) lead inspections, lead hazard screens, lead risk assessments, and clearance inspections;\n(2) environmental surveys of lead in paint, soil, dust, and drinking water to determine areas at high risk for toxic lead exposure;\n(3) soil sampling for soil used as replacement soil;\n(4) drinking water sampling, which shall be done in accordance with lab certification requirements and analytical techniques specified by Code of Federal Regulations, title 40, section 141.89; and\n(5) sampling to determine whether at least 25 percent of the soil samples collected from a census tract within a standard metropolitan statistical area contain lead in concentrations that exceed 100 parts per million.\n(a) The commissioner shall adopt rules establishing regulated lead work standards and methods in accordance with the provisions of this section, for lead in paint, dust, drinking water, and soil in a manner that protects public health and the environment for all residences, including residences also used for a commercial purpose, child care facilities, playgrounds, and schools.\n(b) In the rules required by this section, the commissioner shall require lead hazard reduction of intact paint only if the commissioner finds that the intact paint is on a chewable or lead-dust producing surface that is a known source of actual lead exposure to a specific individual. The commissioner shall prohibit methods that disperse lead dust into the air that could accumulate to a level that would exceed the lead dust standard specified under this section. The commissioner shall work cooperatively with the commissioner of administration to determine which lead hazard reduction methods adopted under this section may be used for lead-safe practices including prohibited practices, preparation, disposal, and cleanup. The commissioner shall work cooperatively with the commissioner of the Pollution Control Agency to develop disposal procedures. In adopting rules under this section, the commissioner shall require the best available technology for regulated lead work methods, paint stabilization, and repainting.\n(c) The commissioner of health shall adopt regulated lead work standards and methods for lead in bare soil in a manner to protect public health and the environment. The commissioner shall adopt a maximum standard of 100 parts of lead per million in bare soil. The commissioner shall set a soil replacement standard not to exceed 25 parts of lead per million. Soil lead hazard reduction methods shall focus on erosion control and covering of bare soil.\n(d) The commissioner shall adopt regulated lead work standards and methods for lead in dust in a manner to protect the public health and environment. Dust standards shall use a weight of lead per area measure and include dust on the floor, on the window sills, and on window wells. Lead hazard reduction methods for dust shall focus on dust removal and other practices which minimize the formation of lead dust from paint, soil, or other sources.\n(e) The commissioner shall adopt lead hazard reduction standards and methods for lead in drinking water both at the tap and public water supply system or private well in a manner to protect the public health and the environment. The commissioner may adopt the rules for controlling lead in drinking water as contained in Code of Federal Regulations, title 40, part 141. Drinking water lead hazard reduction methods may include an educational approach of minimizing lead exposure from lead in drinking water.\n(f) The commissioner of the Pollution Control Agency shall adopt rules to ensure that removal of exterior lead-based coatings from residences and steel structures by abrasive blasting methods is conducted in a manner that protects health and the environment.\n(g) All regulated lead work standards shall provide reasonable margins of safety that are consistent with more than a summary review of scientific evidence and an emphasis on overprotection rather than underprotection when the scientific evidence is ambiguous.\n(h) No unit of local government shall have an ordinance or regulation governing regulated lead work standards or methods for lead in paint, dust, drinking water, or soil that require a different regulated lead work standard or method than the standards or methods established under this section.\n(i) Notwithstanding paragraph (h), the commissioner may approve the use by a unit of local government of an innovative lead hazard reduction method which is consistent in approach with methods established under this section.\n(j) The commissioner shall adopt rules for issuing lead orders required under section 144.9504, rules for notification of abatement or interim control activities requirements, and other rules necessary to implement sections 144.9501 to 144.9512.\n(k) The commissioner shall adopt rules consistent with section 402(c)(3) of the Toxic Substances Control Act and all regulations adopted thereunder to ensure that renovation in a pre-1978 affected property is conducted in a manner that protects health and the environment. Notwithstanding sections 14.125 and 14.128, the authority to adopt these rules does not expire.\n(l) The commissioner shall adopt rules consistent with sections 406(a) and 406(b) of the Toxic Substances Control Act. Notwithstanding sections 14.125 and 14.128, the authority to adopt these rules does not expire.\nThe commissioner may, by rule, establish lead standards for exterior horizontal surfaces, concrete or other impervious surfaces, and street dust on residential property to protect the public health and the environment.\nThe commissioner shall adopt rules to license lead supervisors, lead workers, lead project designers, lead inspectors, lead risk assessors, and lead sampling technicians. The commissioner shall also adopt rules requiring certification of firms that perform regulated lead work. The commissioner shall require periodic renewal of licenses and certificates and shall establish the renewal periods.\nThe commissioner shall establish by rule requirements for training course providers and the renewal period for each lead-related training course required for certification or licensure. The commissioner shall establish criteria in rules for the content and presentation of training courses intended to qualify trainees for licensure under subdivision 3. The commissioner shall establish criteria in rules for the content and presentation of training courses for lead renovation and lead sampling technicians.\nIn adopting the rules required under this section, the commissioner shall provide variance procedures for any provision in rules adopted under this section, except for the numerical standards for the concentrations of lead in paint, dust, bare soil, and drinking water. A variance shall be considered only according to the procedures and criteria in Minnesota Rules, parts 4717.7000 to 4717.7050.\n[Repealed, 2001 c 205 art 1 s 43]",
	"repealed": false
}