{
	"id": "383A.287",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.287",
	"title": "383A.287 PERSONNEL REVIEW BOARD.",
	"text": "The Ramsey County Personnel Review Board is created to review disciplinary appeals and conduct performance reviews of the Human Resources Department.\nThe county board, by a majority vote, shall appoint seven persons to the Personnel Review Board to serve four-year staggered terms. Any vacancies shall be filled by a majority vote of the county board for the unexpired term. Each member shall hold office until a successor has been appointed. Membership on the Personnel Review Board shall be limited as follows:\n(a) each member shall take an oath of office before assuming the duties of office;\n(b) no person shall be a member of the Personnel Review Board while holding a public office, or while holding office in a political party above the state legislative district level, nor for two years after having held that kind of public or political office; and\n(c) each member shall be a resident of the county and if a member becomes a nonresident, the member forfeits the office.\nA Personnel Review Board member may be removed from office by the county board for cause, after a copy of the charges has first been given to the member and opportunity of being publicly heard before the county board, upon not less than ten days' written notice. A majority vote of the county board shall be required for removal.\nCompensation for members of the Personnel Review Board shall be set by resolution of the county board.\n(a) Nondisciplinary appeals. The Personnel Review Board shall hear all nondisciplinary personnel appeals as defined in the rules adopted by the county board pursuant to section 383A.284, subdivision 1.\n(b) Grievances and disciplinary appeals. All appeals or grievances relating to discharge, suspension, demotion for cause, salary decrease, or other disciplinary action shall be heard by an administrative law judge appointed pursuant to section 14.55. The administrative law judge shall hear the grievance or appeal and report a recommendation to the Personnel Review Board in a timely manner consistent with section 383A.294 and the rules and regulations promulgated by the county board.\n(c) Review of Human Resources Department performance. Periodically, as requested by the county board, the Personnel Review Board shall review, report, and make recommendations to the county board regarding Human Resources Department services, procedures, and practices.",
	"repealed": false
}