{
	"id": "144.653",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.653",
	"title": "144.653 RULES; PERIODIC INSPECTIONS; ENFORCEMENT.",
	"text": "The state commissioner of health is the exclusive state agency charged with the responsibility and duty of inspecting all facilities required to be licensed under the provisions of sections 144.50 to 144.58. The state commissioner of health shall enforce its rules subject only to the authority of the Department of Public Safety respecting the enforcement of fire and safety standards in licensed health care facilities and the responsibility of the commissioner of human services pursuant to sections 245A.01 to 245A.16 and 252.28.\nAll facilities required to be licensed under the provisions of sections 144.50 to 144.58 shall be periodically inspected by the state commissioner of health to ensure compliance with rules and standards. Inspections shall occur at different times throughout the calendar year. The commissioner of health may enter into agreements with political subdivisions providing for the inspection of such facilities by locally employed inspectors.\nThe commissioner of health shall conduct inspections and reinspections of facilities licensed under the provisions of sections 144.50 to 144.56 with a frequency and in a manner calculated to produce the greatest benefit to residents within the limits of the resources available to the commissioner. In performing this function, the commissioner may devote proportionately more resources to the inspection of those facilities in which conditions present the most serious concerns with respect to resident health, treatment, comfort, safety, and well-being.\nThese conditions include but are not limited to: change in ownership; frequent change in administration in excess of normal turnover rates; complaints about care, safety, or rights; where previous inspections or reinspections have resulted in correction orders related to care, safety, or rights; and, where persons involved in ownership or administration of the facility have been indicted for alleged criminal activity. Any health care facility that has none of the above conditions or any other condition established by the commissioner that poses a risk to resident care, safety, or rights shall be inspected once every two years.\nWith the exception of the Department of Public Safety which has the exclusive jurisdiction to enforce state fire and safety standards, the state commissioner of health is the exclusive state agency charged with the responsibility and duty of inspecting facilities required to be licensed under the provisions of sections 144.50 to 144.58 and enforcing the rules and standards prescribed by it.\nThe commissioner may request and must be given access to relevant information, records, incident reports, or other documents in the possession of a licensed facility if the commissioner considers them necessary for the discharge of responsibilities. For the purposes of inspections and securing information to determine compliance with the licensure laws and rules, the commissioner need not present a release, waiver, or consent of the individual. The identities of patients or residents must be kept private as defined by section 13.02, subdivision 12.\nOne or more unannounced inspections of each facility required to be licensed under the provisions of sections 144.50 to 144.58 or Minnesota Rules, chapter 4675, shall be made annually.\nWhenever a duly authorized representative of the state commissioner of health finds upon inspection of a facility required to be licensed under the provisions of sections 144.50 to 144.58 that the licensee of such facility is not in compliance with sections 144.411 to 144.417, 144.50 to 144.58, 144.651, or 626.557, or the applicable rules promulgated under those sections, a correction order shall be issued to the licensee. The correction order shall state the deficiency, cite the specific rule violated, and specify the time allowed for correction.\nIf upon reinspection it is found that the licensee of a facility required to be licensed under the provisions of sections 144.50 to 144.58 has not corrected deficiencies specified in the correction order, a notice of noncompliance with a correction order shall be issued stating all deficiencies not corrected. Unless a hearing is requested under subdivision 8, the licensee shall forfeit to the state within 15 days after receipt by the licensee of such notice of noncompliance with a correction order up to $1,000 for each deficiency not corrected. For each subsequent reinspection, the licensee may be fined an additional amount for each deficiency which has not been corrected. All forfeitures shall be paid into the general fund. The commissioner of health shall promulgate by rule a schedule of fines applicable for each type of uncorrected deficiency.\nAny unpaid forfeitures may be recovered by the attorney general.\nA licensee of a facility required to be licensed under the provisions of sections 144.50 to 144.58 is entitled to a hearing on any notice of noncompliance with a correction order issued to the licensee as a result of a reinspection, provided that the licensee makes a written request therefor within 15 days of receipt by the licensee of the notice of noncompliance with a correction order. Failure to request a hearing shall result in the forfeiture of a penalty as determined by the commissioner of health in accordance with subdivision 6. A request for a hearing shall operate as a stay during the hearing and review process of the payment of any forfeiture provided for in this section. Upon receipt of the request for a hearing, a hearing officer, who shall not be an employee of the state commissioner of health, shall be appointed by the state commissioner of health, and the hearing officer shall promptly schedule a hearing on the matter, giving at least ten days' notice of the date, time, and place of the hearing to the licensee. Upon determining that the licensee of a facility required to be licensed under sections 144.50 to 144.58 has not corrected the deficiency specified in the correction order, the hearing officer shall impose a penalty as determined by the commissioner of health in accordance with subdivision 6. The hearing and review thereof shall be in accordance with the relevant provisions of the Administrative Procedure Act.\nNothing in this section shall be construed to limit the powers granted to the state commissioner of health in section 144.55.",
	"repealed": false
}