{
	"id": "609.5641",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.5641",
	"title": "609.5641 WILDFIRE ARSON.",
	"text": "A person who intentionally sets a fire to burn out of control on land of another containing timber, underbrush, grass, or other vegetative combustible material is guilty of a felony and may be sentenced as provided in subdivision 1a.\n(a) Except as provided in paragraphs (b), (c), and (d), a person who violates subdivision 1 may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(b) A person who violates subdivision 1 where the fire threatens to damage or damages in excess of five buildings or dwellings, burns 500 acres or more, or damages crops in excess of $100,000, may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $15,000, or both.\n(c) A person who violates subdivision 1 where the fire threatens to damage or damages in excess of 100 buildings or dwellings, burns 1,500 acres or more, or damages crops in excess of $250,000, may be sentenced to imprisonment for not more than 20 years or to payment of a fine of not more than $25,000, or both.\n(d) A person who violates subdivision 1 where the fire causes another person to suffer demonstrable bodily harm may be sentenced to imprisonment for not more than ten years or to payment of a fine of $15,000, or both.\n(e) For purposes of this section, a building or dwelling is threatened when there is a probability of damage to the building or dwelling requiring evacuation for safety of life.\nA person is guilty of a gross misdemeanor who possesses a flammable, explosive, or incendiary device, substance, or material with intent to use the device, substance, or material to violate subdivision 1.\nIn addition to the sentence otherwise authorized, the court may order a person who is convicted of violating this section to pay fire suppression costs, damages to the owner of the damaged land, costs associated with injuries sustained by a member of a municipal or volunteer fire department in the performance of the member's duties, and any other restitution costs allowed under section 611A.04.",
	"repealed": false
}