{
	"id": "142F.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/142F.30",
	"title": "142F.30 FINANCIAL ASSISTANCE FOR COMMUNITY ACTION AGENCIES.",
	"text": "For the purposes of sections 142F.30 to 142F.302, \"poverty level population\" means the number of people whose household income is at or below the poverty line established by the United States Office of Management and Budget in accordance with the most recent state population figures established by the United States Department of Commerce, Bureau of the Census.\nThe commissioner of children, youth, and families may provide financial assistance for community action agencies, Indian reservations, and migrant and seasonal farmworker organizations to carry out community action programs as described in section 142F.302 in accordance with the Omnibus Reconciliation Act of 1981, Public Law 97-35, as amended in 1984, Public Law 98-558, state law, and federal law and regulation.\n(a) State money appropriated and community service block grant money allotted to the state and all money transferred to the community service block grant from other block grants shall be allocated annually to community action agencies and Indian reservation governments under paragraphs (b) and (c), and to migrant and seasonal farmworker organizations under paragraph (d).\n(b) The available annual money will provide base funding to all community action agencies and the Indian reservations. Base funding amounts per agency are as follows: for agencies with low-income populations up to 23,999, $50,000; and 24,000 or more, $100,000.\n(c) All remaining money of the annual money available after the base funding has been determined must be allocated to each agency and reservation in proportion to the size of the poverty-level population in the agency's service area compared to the size of the poverty-level population in the state.\n(d) Allocation of money to migrant and seasonal farmworker organizations must not exceed three percent of the total annual money available. Base funding allocations must be made for all community action agencies and Indian reservations that received money under this subdivision, in fiscal year 1984, and for community action agencies designated under this section with a service area population of 35,000 or greater.\nIn the case of a merger between community action agencies, the newly created agency receives a base funding amount equal to the sum of the merged agencies' base funding amounts at the point of the merger as described in subdivision 2, paragraph (b), unless the commissioner determines the funding amount should be less than the sum of the merged agencies' base funding amount due to savings resulting from fewer redundancies and duplicative services.\nEach community action agency receiving funds under this section shall report annually to the commissioner concerning the use of the funds.",
	"repealed": false
}