{
	"id": "216B.1695",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1695",
	"title": "216B.1695 ENVIRONMENTAL PROJECTS; ADVANCE DETERMINATION OF PRUDENCE.",
	"text": "A public utility may petition the commission for an advance determination of prudence for a project undertaken to comply with federal or state air quality standards of states in which the utility's electric generation facilities are located, if the project has an expected jurisdictional cost to Minnesota ratepayers of at least $10,000,000. A project is undertaken to comply with federal or state air quality standards if it is required:\n(1) by the state in which the generation facility is located in a state implementation plan, permit, or order; or\n(2) to comply with section 111 or 112 of the federal Clean Air Act, United States Code, title 42, section 7411 or 7412.\n(a) A utility requesting an advance determination under subdivision 1 must, as part of the evidence required when filing a petition under subdivision 3, provide to the Public Utilities Commission and the Pollution Control Agency an assessment of all anticipated state and federal environmental regulations related to the production of electricity from the utility's facility subject to the filing, including regulations relating to:\n(1) air pollution by nitrogen oxide and sulphur dioxide, including an assumption that Minnesota will be included in the federal Clean Air Interstate Rule region, hazardous air pollutants, carbon dioxide, particulates, and ozone;\n(2) coal waste; and\n(3) water consumption and water pollution.\n(b) In addition, the utility shall provide an assessment of the financial and operational impacts of these pending regulations applicable to the generating facility that is the subject of the filing and provide a range of regulatory response scenarios that include, but are not limited to:\n(1) the installation of pollution control equipment;\n(2) the benefits of the retirement or repowering of the plant that is the subject of the filing with cleaner fuels considering the costs of complying with state and federal environmental regulations; and\n(3) the use of pollution allowances to achieve compliance.\n(c) The utility shall consult with interested stakeholders in establishing the scope of the regulatory, financial, and operational assessments prior to or during the 60-day period of the notice under subdivision 4.\nA petition filed under this section must include a description of the project, evidence supporting the project's reasonableness, a discussion of project alternatives, a project implementation schedule, a cost estimate and support for the reasonableness of the estimated cost, and a description of the public utility's efforts to ensure the lowest reasonable costs. Following receipt of the Pollution Control Agency's verification under subdivision 4, the commission shall allow opportunity for oral and written comment on the petition. The commission shall make a final determination on the petition within ten months of its filing date. The commission must make findings in support of its determination.\nAt least 60 days prior to filing a petition to the commission under subdivision 3, the utility shall file notice with the Pollution Control Agency that describes the project and how it qualifies under subdivision 1. The Pollution Control Agency shall, within 60 days of receipt of the notice, verify that the project qualifies under subdivision 1, and shall forward written verification to the commission.\nThe utility may begin recovery of costs that have been incurred by the utility in connection with implementation of the project in the next rate case following an advance determination of prudence or in a rider approved under section 216B.1692. The commission shall review the costs incurred by the utility for the project. The utility must show that the project costs are reasonable and necessary, and demonstrate its efforts to ensure the lowest reasonable project costs. Notwithstanding the commission's prior determination of prudence, it may accept, modify, or reject any of the project costs. The commission may determine whether to require an allowance for funds used during construction offset.\nThe return on investment in the rider shall be at the level approved by the commission in the public utility's last general rate case, unless the commission determines that a different rate of return is in the public interest.\nA petition for an advance determination of prudence may not be filed after December 31, 2015.",
	"repealed": false
}