{
	"id": "223.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/223.28",
	"title": "223.28 GRAIN BONDS; NEW LICENSE HOLDERS.",
	"text": "(a) Except as provided in paragraph (b), before the commissioner issues a grain buyer or public grain warehouse operator license, a person who has not been licensed to buy grain or operate a public grain warehouse in the previous licensing period must file with the commissioner a grain bond in a penal sum of $100,000. A grain bond must remain in effect for the first three years of the license.\n(b) A grain buyer who purchases grain immediately upon delivery solely with cash; a certified check; a cashier's check; or a postal, bank, or express money order is exempt from this subdivision if the grain buyer's gross annual purchases are $1,000,000 or less.\n(c) The commissioner may require a supplemental bond in an amount prescribed by the commissioner based on the financial statements required in section 223.17, subdivision 6.\n(d) A grain bond must be on a form provided by the commissioner.\n(e) A grain bond required under paragraphs (a) and (c) must provide for the payment of any loss caused by the grain buyer's failure to pay upon the owner's demand, including loss caused by the grain buyer's failure to pay within the time required. The grain bond must be conditioned upon the grain buyer being duly licensed.\n(f) A grain bond required under paragraphs (a) and (c) that is obtained by a public grain warehouse operator must be conditioned that the public grain warehouse operator issuing a grain warehouse receipt is liable to the depositor for the delivery of the kind, grade, and net quantity of grain called for by the receipt. A grain bond must be conditioned upon the operator being duly licensed.\n(g) A grain bond must not be cumulative from one licensing period to the next. The maximum liability of the grain bond must be the grain bond's face value for the licensing period.\n(h) A grain bond must be continuous until canceled. To cancel a grain bond, a surety must provide 90 days' written notice of the grain bond's termination date to the licensee and the commissioner.\n(i) Upon the commissioner's determination that a claim is valid, the surety for any claims against the grain bond must make payments to the grain indemnity account.",
	"repealed": false
}