{
	"id": "270C.7105",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.7105",
	"title": "270C.7105 EFFECT OF CERTIFICATE OF SALE.",
	"text": "(a) In all cases of sale pursuant to section 270C.7101 of personal property, the certificate of sale given pursuant to section 270C.7104 shall be prima facie evidence of the right of the commissioner to make the sale, and conclusive evidence of the regularity of the proceedings in making the sale. The certificate shall transfer to the purchaser all right, title, and interest of the party delinquent in and to the property sold.\n(b) If the property consists of stocks, the certificate of sale shall be notice, when received, to any corporation, company, or association of the transfer, and shall be authority to the corporation, company, or association to record the transfer on its books and records in the same manner as if the stocks were transferred or assigned by the party holding the same, in lieu of any original or prior certificate, which shall be void, whether canceled or not.\n(c) If the subject of sale is securities or other evidences of debt, the certificate of sale shall be a good and valid receipt to the person holding the same, as against any person holding or claiming to hold possession of the securities or other evidences of debt.\n(d) If the property consists of a motor vehicle, the certificate of sale shall be notice, when received, to the registrar of motor vehicles of this state of the transfer, and shall be authority to the registrar to record the transfer on the books and records in the same manner as if the certificate of title to the motor vehicle were transferred or assigned by the party holding the same, in lieu of any original or prior certificate, which shall be void, whether canceled or not.\nIn the case of the sale of real property pursuant to section 270C.7101, the certificate of sale given pursuant to section 270C.7104 shall be prima facie evidence of the facts therein stated, and shall be considered and operate as a conveyance of all the right, title, and interest the party delinquent had in and to the real property thus sold at the time the lien of the state of Minnesota attached thereto.\nA certificate of sale of personal property or real property given pursuant to section 270C.7104 shall discharge the property from all liens, encumbrances, and titles over which the lien of the state of Minnesota with respect to which the levy was made had priority.",
	"repealed": false
}