{
	"id": "219.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.375",
	"title": "219.375 RAILROAD YARD LIGHTING.",
	"text": "By January 15 of each year, each Class I and Class II railroad common carrier that operates one or more railroad yards in this state where, between sunset and sunrise, cars or locomotives are frequently switched, repaired, or inspected, or where trains are assembled and disassembled, shall submit to the commissioner of transportation a plan that:\n(1) identifies all railroad yards operated by the railroad where the described work is frequently accomplished between sunset and sunrise;\n(2) describes the nature and placement of lighting equipment currently in use in the yard and the maintenance status and practices regarding this equipment;\n(3) states whether the lighting meets or exceeds guidelines for illumination established by the American Railway Engineering and Maintenance-of-Way Association;\n(4) describes whether existing lighting is installed and operated in a manner consistent with energy conservation, glare reduction, minimization of light pollution, and preservation of the natural night environment; and\n(5) identifies plans and timelines to bring into compliance railroad yards that do not utilize and maintain lighting equipment that meets or exceeds the standards and guidelines under clauses (3) and (4), or states any reason why the standards and guidelines should not apply.\nA railroad common carrier that is required to file a report under subdivision 1 shall maintain all railroad yard lighting equipment in good working order and shall repair or replace any malfunctioning equipment within 48 hours after the malfunction has been reported to the carrier. Repairs must be made in compliance with, or to exceed the standards in, the Minnesota Electrical Code and chapter 326B.\nBy January 15 of each year, the union representative of the workers at each railroad yard required to submit a report under subdivision 1 shall submit to the commissioner of transportation a report that:\n(1) describes the nature and placement of lighting equipment currently in use in the yard and maintenance status and practices regarding the equipment;\n(2) describes the level of maintenance of lighting equipment and the carrier's promptness in responding to reports of lighting malfunction;\n(3) states whether the available lighting is adequate to provide safe working conditions for crews working at night; and\n(4) describes changes in the lighting equipment and its adequacy that have occurred since the last previous worker representative report.\nMS 2016 [Repealed, 1Sp2017 c 3 art 3 s 144]\nBy December 31, 2015, a railroad common carrier shall establish lighting that meets the standards and guidelines under subdivision 1, clauses (3) and (4), at each railroad yard where:\n(1) between sunset and sunrise:\n(i) locomotives, or railcars carrying placarded hazardous materials, are frequently switched, repaired, or inspected; or\n(ii) trains with more than 25 tanker railcars carrying placarded hazardous materials are assembled and disassembled; and\n(2) the yard is located within two miles of a petroleum refinery having a crude oil production capacity of 150,000 or more barrels per day.",
	"repealed": false
}