{
	"id": "347.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.50",
	"title": "347.50 DEFINITIONS.",
	"text": "For the purpose of sections 347.50 to 347.56, the terms defined in this section have the meanings given them.\n\"Dangerous dog\" means any dog that has:\n(1) without provocation, inflicted substantial bodily harm on a human being on public or private property;\n(2) killed a domestic animal without provocation while off the owner's property; or\n(3) been found to be potentially dangerous, and after the owner has notice that the dog is potentially dangerous, the dog aggressively bites, attacks, or endangers the safety of humans or domestic animals.\n\"Potentially dangerous dog\" means any dog that:\n(1) when unprovoked, inflicts bites on a human or domestic animal on public or private property;\n(2) when unprovoked, chases or approaches a person, including a person on a bicycle, upon the streets, sidewalks, or any public or private property, other than the dog owner's property, in an apparent attitude of attack; or\n(3) has a known propensity, tendency, or disposition to attack unprovoked, causing injury or otherwise threatening the safety of humans or domestic animals.\n\"Proper enclosure\" means securely confined indoors or in a securely enclosed and locked pen or structure suitable to prevent the animal from escaping and providing protection from the elements for the dog. A proper enclosure does not include a porch, patio, or any part of a house, garage, or other structure that would allow the dog to exit of its own volition, or any house or structure in which windows are open or in which door or window screens are the only obstacles that prevent the dog from exiting.\n\"Owner\" means any person, firm, corporation, organization, or department possessing, harboring, keeping, having an interest in, or having care, custody, or control of a dog.\n\"Substantial bodily harm\" has the meaning given it under section 609.02, subdivision 7a.\n\"Great bodily harm\" has the meaning given it under section 609.02, subdivision 8.\n\"Animal control authority\" means an agency of the state, county, municipality, or other governmental subdivision of the state which is responsible for animal control operations in its jurisdiction.\n\"Provocation\" means an act that an adult could reasonably expect may cause a dog to attack or bite.",
	"repealed": false
}