{
	"id": "245.4884",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4884",
	"title": "245.4884 FAMILY COMMUNITY SUPPORT SERVICES.",
	"text": "By July 1, 1991, county boards must provide or contract for sufficient family community support services within the county to meet the needs of each child with severe emotional disturbance who resides in the county and the child's family. Children or their parents may be required to pay a fee in accordance with section 245.481.\nFamily community support services must be designed to improve the ability of children with severe emotional disturbance to:\n(1) manage basic activities of daily living;\n(2) function appropriately in home, school, and community settings;\n(3) participate in leisure time or community youth activities;\n(4) set goals and plans;\n(5) reside with the family in the community;\n(6) participate in after-school and summer activities;\n(7) make a smooth transition among mental health and education services provided to children; and\n(8) make a smooth transition into the adult mental health system as appropriate.\nIn addition, family community support services must be designed to improve overall family functioning if clinically appropriate to the child's needs, and to reduce the need for and use of placements more intensive, costly, or restrictive both in the number of admissions and lengths of stay than indicated by the child's diagnostic assessment.\nThe commissioner of human services shall work with mental health professionals to develop standards for clinical supervision of family community support services. These standards shall be incorporated in rule and in guidelines for grants for family community support services.\n(a) Day treatment services must be part of the family community support services available to each child with severe emotional disturbance residing in the county. A child or the child's parent may be required to pay a fee according to section 245.481. Day treatment services must be designed to:\n(1) provide a structured environment for treatment;\n(2) provide support for residing in the community;\n(3) prevent placements that are more intensive, costly, or restrictive than necessary to meet the child's need;\n(4) coordinate with or be offered in conjunction with the child's education program;\n(5) provide therapy and family intervention for children that are coordinated with education services provided and funded by schools; and\n(6) operate during all 12 months of the year.\n(b) County boards may request a waiver from including day treatment services if they can document that:\n(1) alternative services exist through the county's family community support services for each child who would otherwise need day treatment services; and\n(2) county demographics and geography make the provision of day treatment services cost ineffective and unfeasible.\n(a) By January 1, 1991, county boards must provide or contract for sufficient professional home-based family treatment within the county to meet the needs of each child with severe emotional disturbance who is at risk of out-of-home placement due to the child's emotional disturbance or who is returning to the home from out-of-home placement. The child or the child's parent may be required to pay a fee according to section 245.481. The county board shall require that all service providers of professional home-based family treatment set fee schedules approved by the county board that are based on the child's or family's ability to pay. The professional home-based family treatment must be designed to assist each child with severe emotional disturbance who is at risk of or who is returning from out-of-home placement and the child's family to:\n(1) improve overall family functioning in all areas of life;\n(2) treat the child's symptoms of emotional disturbance that contribute to a risk of out-of-home placement;\n(3) provide a positive change in the emotional, behavioral, and mental well-being of children and their families; and\n(4) reduce risk of out-of-home placement for the identified child with severe emotional disturbance and other siblings or successfully reunify and reintegrate into the family a child returning from out-of-home placement due to emotional disturbance.\n(b) Professional home-based family treatment must be provided by a team consisting of a mental health professional and others who are skilled in the delivery of mental health services to children and families in conjunction with other human service providers. The professional home-based family treatment team must maintain flexible hours of service availability and must provide or arrange for crisis services for each family, 24 hours a day, seven days a week. Case loads for each professional home-based family treatment team must be small enough to permit the delivery of intensive services and to meet the needs of the family. Professional home-based family treatment providers shall coordinate services and service needs with case managers assigned to children and their families. The treatment team must develop an individual treatment plan that identifies the specific treatment objectives for both the child and the family.\nBy January 1, 1992, county boards must provide or contract for foster care with therapeutic support as defined in section 245.4871, subdivision 34. Foster families caring for children with severe emotional disturbance must receive training and supportive services, as necessary, at no cost to the foster families within the limits of available resources.\nThe county board must offer help to a child with severe emotional disturbance and the child's family in applying for federal benefits, including Supplemental Security Income, medical assistance, and Medicare.",
	"repealed": false
}