{
	"id": "204B.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.21",
	"title": "204B.21 APPOINTMENT OF ELECTION JUDGES.",
	"text": "On May 1 in a year in which there is an election for a partisan political office, each major political party shall prepare a list of eligible voters to act as election judges in each election precinct. The list provided by the party must indicate which eligible voters are willing to travel to a precinct outside of their home jurisdiction to act as an election judge, and the jurisdictions to which each eligible voter is willing to travel for that purpose. The political parties shall furnish the lists electronically to the secretary of state, in a format specified by the secretary of state. The secretary of state must combine the data received from each political party under this subdivision and must process the data to locate the precinct in which the address provided for each potential election judge is located. If the data submitted by a political party is insufficient for the secretary of state to locate the proper precinct, the associated name must not appear in any list forwarded to an appointing authority under this subdivision. The secretary of state shall notify political parties of any proposed election judges with addresses that could not be located in a precinct.\nBy May 15, the secretary of state shall furnish electronically to the county auditor a list of the appropriate names for each election precinct in the jurisdiction of the appointing authority, and a list of the names of individuals residing outside of the jurisdiction who indicated a willingness to travel to that jurisdiction to act as an election judge, noting the political party affiliation of each individual on the list. The county auditor must promptly forward the appropriate names to the appropriate municipal clerk.\nElection judges for precincts in a municipality shall be appointed by the governing body of the municipality. Election judges for precincts in unorganized territory and for performing election-related duties assigned by the county auditor shall be appointed by the county board. Election judges for a precinct composed of two or more municipalities must be appointed by the governing body of the municipality or municipalities responsible for appointing election judges as provided in the agreement to combine for election purposes. Except as otherwise provided in this section, appointments shall be made from the list of voters who maintain residence in each precinct, furnished pursuant to subdivision 1, subject to the eligibility requirements and other qualifications established or authorized under section 204B.19. At least two election judges in each precinct must be affiliated with different major political parties. If no lists have been furnished or if additional election judges are required after all listed names in that municipality have been exhausted, the appointing authority may appoint other individuals who meet the qualifications to serve as an election judge, including persons on the list furnished pursuant to subdivision 1 who indicated a willingness to travel to the municipality, and persons who are not affiliated with a major political party. An individual who is appointed from a source other than the list furnished pursuant to subdivision 1 must provide to the appointing authority the individual's major political party affiliation or a statement that the individual does not affiliate with any major political party. An individual who refuses to provide the individual's major political party affiliation or a statement that the individual does not affiliate with a major political party must not be appointed as an election judge. The appointments shall be made at least 25 days before the election at which the election judges will serve, except that the appointing authority may pass a resolution authorizing the appointment of additional election judges within the 25 days before the election if the appointing authority determines that additional election judges will be required.\nNotwithstanding section 13.43, the major political party affiliation of an election judge or a statement that the judge does not affiliate with a major political party may be shared with other election judges assigned to the precinct at the same election, to verify compliance with party balance requirements. This data may not be disclosed or used by the election judges for any other purpose.",
	"repealed": false
}