{
	"id": "148.9105",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.9105",
	"title": "148.9105 EMERITUS REGISTRATION.",
	"text": "Retired providers who are licensed or were formerly licensed to practice psychology in the state according to the Minnesota Psychology Practice Act may apply to the board for psychologist emeritus registration if they declare that they are retired from the practice of psychology in Minnesota, have not been the subject of disciplinary action in any jurisdiction, and have no unresolved complaints in any jurisdiction. Retired providers shall complete the necessary forms provided by the board and pay a onetime, nonrefundable fee of $150 at the time of application.\nEmeritus registration is not a license to provide psychological services as defined in the Minnesota Psychology Practice Act. The registrant shall not engage in the practice of psychology.\nEmeritus registrants who request a change to active licensure status shall meet the requirements for relicensure following termination in the Minnesota Psychology Practice Act. Master's level emeritus registrants who request licensure at the doctoral level shall comply with current licensure requirements.\nA provider granted emeritus registration shall receive a document certifying that emeritus status has been granted by the board and that the registrant has completed the registrant's active career as a psychologist licensed in good standing with the board.\nIn addition to the descriptions allowed in section 148.96, subdivision 3, paragraph (e), former licensees who have been granted emeritus registration may represent themselves as \"psychologist emeritus\" but shall not represent themselves or allow themselves to be represented to the public as \"licensed\" or otherwise as current licensees of the board.\nThe continuing education requirements of the Minnesota Psychology Practice Act do not apply to emeritus registrants.\nAn emeritus registrant is not subject to license renewal or special fees.",
	"repealed": false
}