{
	"id": "144E.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.40",
	"title": "144E.40 COOPER/SAMS VOLUNTEER AMBULANCE PROGRAM.",
	"text": "The Cooper/Sams volunteer ambulance program is established. The program is intended to recognize the service rendered to state and local government and the citizens of Minnesota by qualified ambulance service personnel, and to reward qualified ambulance service personnel for significant contributions to state and local government and to the public. The purpose of the Cooper/Sams volunteer ambulance trust is to accumulate resources to allow for the payment of longevity awards to qualified ambulance service personnel upon the completion of a substantial ambulance service career.\n(a) Unless paragraph (c) applies, consistent with the responsibilities of the State Board of Investment and the various ambulance services, the Cooper/Sams volunteer ambulance program must be administered by the director. The administrative responsibilities of the director for the program relate solely to the record keeping, award application, and award payment functions. The State Board of Investment is responsible for the investment of the Cooper/Sams volunteer ambulance trust. The applicable ambulance service is responsible for determining, consistent with this chapter, who is a qualified ambulance service person, what constitutes a year of credited ambulance service, what constitutes sufficient documentation of a year of prior service, and for submission of all necessary data to the director in a manner consistent with this chapter. Determinations of an ambulance service are final.\n(b) The director may administer its assigned responsibilities regarding the program directly or may retain a qualified governmental or nongovernmental plan administrator under contract to administer those responsibilities regarding the program. A contract with a qualified plan administrator must be the result of an open competitive bidding process and must be reopened for competitive bidding at least once during every five-year period after July 1, 1993.\n(c) The commissioner of management and budget shall review the options within state government for the most appropriate administration of pension plans or similar arrangements for emergency service personnel and recommend to the governor the most appropriate future pension plan or nonpension plan administrative arrangement for this chapter. If the governor concurs in the recommendation, the governor shall transfer the future administrative responsibilities relating to this chapter to that administrative agency.",
	"repealed": false
}