{
	"id": "323A.1102",
	"url": "https://www.revisor.mn.gov/statutes/cite/323A.1102",
	"title": "323A.1102 STATEMENT OF FOREIGN QUALIFICATION.",
	"text": "(a) Before transacting business in this state, a foreign limited liability partnership must file a statement of foreign qualification. The statement must contain:\n(1) the name of the foreign limited liability partnership which satisfies the requirements of the state or other jurisdiction under whose law it is formed and ends with \"Registered Limited Liability Partnership,\" \"Limited Liability Partnership,\" \"R.L.L.P.,\" \"L.L.P.,\" \"RLLP,\" or \"LLP.\" A foreign limited liability partnership may use an alternate name to transact business in the state if it lists the alternate name in the statement;\n(2) the street address, including the zip code, of the partnership's chief executive office and, if different, the street address, including the zip code, of an office of the partnership in this state, if any;\n(3) if there is no office of the partnership in this state, the name and street address, including the zip code, of the partnership's agent for service of process. If an agent for service of process is listed, the limited liability partnership shall comply with section 5.36;\n(4) a deferred effective date, if any; and\n(5) the name of the jurisdiction under whose law the foreign limited liability partnership was originally registered.\n(b) The agent of a foreign limited liability company for service of process must be an individual who is a resident of this state or other person authorized to do business in this state.\n(c) The status of a partnership as a foreign limited liability partnership is effective on the later of the filing of the statement of foreign qualification or a date specified in the statement. The status remains effective, regardless of changes in the partnership, until it is canceled pursuant to section 323A.0105(d) or revoked pursuant to section 323A.1003.\n(d) An amendment or cancellation of a statement of foreign qualification is effective when it is filed or on a deferred effective date specified in the amendment or cancellation.\n(e) A statement of foreign qualification may include the information necessary to make an election under section 319B.04, subdivision 2, and to update that information as provided in section 319B.04, subdivision 3.",
	"repealed": false
}