{
	"id": "256.362",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.362",
	"title": "256.362 REPORTS AND IMPLEMENTATION.",
	"text": "The commissioners of human services and health shall recommend to the legislature, by January 1, 1993, methods to incorporate discounts for wellness factors of up to 25 percent into the MinnesotaCare program premium sliding scale. Beginning October 1, 1992, the commissioner of human services shall inform MinnesotaCare program enrollees of the future availability of the wellness discount, and shall encourage enrollees to incorporate wellness factors into their lifestyles.\nBy October 1, 1992, the commissioners of human services and revenue shall apply for any federal waivers or approvals necessary to allow enrollees in state health care programs to assign the federal health insurance credit component of the earned income tax credit to the state.\n(a) The commissioner shall develop and implement a plan to combine medical assistance and MinnesotaCare program application and eligibility procedures. The plan may include the following changes:\n(1) use of a single mail-in application;\n(2) elimination of the requirement for personal interviews;\n(3) postponing notification of paternity disclosure requirements;\n(4) modifying verification requirements for pregnant women and children;\n(5) using shorter forms for recertifying eligibility;\n(6) expedited and more efficient eligibility determinations for applicants;\n(7) expanded outreach efforts, including combined marketing of the two plans; and\n(8) other changes that improve access to services provided by the two programs.\n(b) The plan may include seeking the following changes in federal law:\n(1) extension and expansion of exemptions for different eligibility groups from Medicaid quality control sanctions;\n(2) changing requirements for the redetermination of eligibility;\n(3) eliminating asset tests for all children; and\n(4) other changes that improve access to services provided by the two programs.\n(c) The commissioner shall seek any necessary federal approvals, and any necessary changes in federal law. The commissioner shall implement each element of the plan as federal approval is received, and shall report to the legislature by January 1, 1993, on progress in implementing this plan.\nBy January 1, 1993, the commissioner of human services shall present a plan to the legislature for providing all medical assistance and MinnesotaCare program services through managed care arrangements. The commissioner shall apply to the secretary of health and human services for any necessary federal waivers or approvals, and shall begin to implement the plan for managed care upon receipt of the federal waivers or approvals.\n[Repealed, 1994 c 625 art 8 s 74]",
	"repealed": false
}