{
	"id": "72B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/72B.05",
	"title": "72B.05 NONRESIDENTS.",
	"text": "(a) Unless refused licensure pursuant to section 72B.08, a nonresident person shall receive a nonresident adjuster license if:\n(1) the person is currently licensed in good standing as an adjuster in the person's resident or home state;\n(2) the person has submitted the proper request for licensure and has paid the fees required by section 72B.041, subdivision 9;\n(3) the person has submitted or transmitted to the commissioner the appropriate completed application for licensure; and\n(4) the person's designated home state awards nonresident adjuster licenses to persons of this state on the same basis.\n(b) The commissioner may verify the adjuster's licensing status through any appropriate database, including the producer database maintained by the National Association of Insurance Commissioners, its affiliates, or its subsidiaries, or may request certification of good standing as described in section 72B.041, subdivision 5.\n(c) As a condition to the continuation of a nonresident adjuster license, the licensee must maintain a resident adjuster license in the licensee's home state. The nonresident adjuster license issued under this chapter must terminate and be surrendered immediately to the commissioner if the resident adjuster license terminates for any reason, unless the termination is due to the adjuster being issued a new resident adjuster license in the adjuster's new home state. The new state resident adjuster license must have reciprocity with the licensing nonresident states, otherwise, the nonresident adjuster license must terminate. Notice of resident adjuster license termination must be given to any state that issued a nonresident adjuster license. Notice must be given within 30 days of the termination date; if terminated for change in the resident home state, then the notice must include both the previous and current address. Maintaining a resident adjuster license is required for the nonresident adjuster license to remain valid.\n(d) No resident of Canada may be licensed under this section, unless the applicant is licensed as a resident adjuster under the laws of another state, except that such applicant shall not be subject to section 270C.72, subdivision 4.",
	"repealed": false
}