{
	"id": "260D.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/260D.10",
	"title": "260D.10 TERMINATION OF VOLUNTARY PLACEMENT AGREEMENT.",
	"text": "(a) The child's parent may terminate a voluntary placement agreement under this chapter upon written notice to the agency of the termination of the agreement. The termination of a voluntary foster care agreement regarding an Indian child shall be governed by section 260.765, subdivision 4.\n(b) The agency may terminate a voluntary placement agreement under this section upon written notice of the termination of the agreement to the parent. Prior to sending notice of termination of the voluntary foster care placement agreement, the agency shall contact the parent regarding transition planning under paragraph (e). Written notice by the agency shall be considered received by the parent three business days after mailing by the agency.\n(c) Upon receipt of notice of the termination of the voluntary foster care agreement, the agency, the parent, and the facility may agree to a time that the child shall return home. The scheduled time to return home shall meet the child's need for safety and reasonable transition. Unless otherwise agreed by the parent and the agency, the child's return home shall not occur sooner than 72 hours and not later than 30 days after written notice of termination is received or sent by the agency.\n(d) A parent who disagrees with the termination of a voluntary foster care agreement by the agency under this chapter has the right to a fair hearing under section 142A.20 to appeal the termination of the voluntary foster care agreement. When the agency gives written notice to the parent of the termination of the agreement, the agency must also give the parent notice of the parent's right to a fair hearing under section 142A.20 to appeal the agency's decision to terminate the voluntary foster care agreement.\n(e) The agency and the child's parents shall engage in transition planning for the child's return home, including establishing a scheduled time for the child to return home, an increased visitation plan between the parent and child, and a plan for what services will be provided and in place upon the child's return home.\n(f) Notice of termination of voluntary foster care agreement does not terminate the agreement. The voluntary foster care agreement and the agency's legal authority to place the child are terminated by the child's return home or by court order.",
	"repealed": false
}