{
	"id": "302A.473",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.473",
	"title": "302A.473 PROCEDURES FOR ASSERTING DISSENTERS' RIGHTS.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Corporation\" means the issuer of the shares held by a dissenter before the corporate action referred to in section 302A.471, subdivision 1 or the successor by merger of that issuer.\n(c) \"Fair value of the shares\" means the value of the shares of a corporation immediately before the effective date of the corporate action referred to in section 302A.471, subdivision 1.\n(d) \"Interest\" means interest commencing five days after the effective date of the corporate action referred to in section 302A.471, subdivision 1, up to and including the date of payment, calculated at the rate provided in section 549.09, subdivision 1, paragraph (c), clause (1).\n(a) If a corporation calls a shareholder meeting at which any action described in section 302A.471, subdivision 1 is to be voted upon, the notice of the meeting shall inform each shareholder of the right to dissent and shall include a copy of section 302A.471 and this section and a brief description of the procedure to be followed under these sections.\n(b) In connection with a qualified offer as described in section 302A.613, subdivision 4, the constituent corporation subject to the offer may, but is not required to, send to all shareholders a written notice informing each shareholder of the right to dissent and must include a copy of this section and section 302A.471 and a brief description of the procedure to be followed under these sections. To be effective, the notice must be sent as promptly as practicable at or following the commencement of the offer, but in any event at least ten days before the consummation of the offer.\nIf the proposed action must be approved by the shareholders and the corporation holds a shareholder meeting, a shareholder who is entitled to dissent under section 302A.471 and who wishes to exercise dissenters' rights must file with the corporation before the vote on the proposed action a written notice of intent to demand the fair value of the shares owned by the shareholder and must not vote the shares in favor of the proposed action. If the proposed action is to be effected pursuant to section 302A.613, subdivision 4, and the corporation has elected to send a notice of action in accordance with subdivision 2, paragraph (b), a shareholder who is entitled to dissent under section 302A.471 and who wishes to exercise dissenters' rights must not tender the shares owned by the shareholder in response to the offer and must file with the corporation a written notice of intent to demand the fair value of the shares owned by the shareholder. Written notice must be filed with the corporation before the consummation of the offer.\n(a) After the proposed action has been approved by the board and, if necessary, the shareholders, the corporation shall send (i) in any case where subdivision 3 is applicable, to all shareholders who have complied with subdivision 3, (ii) in any case where a written action of shareholders gave effect to the action creating the right to obtain payment under section 302A.471, to all shareholders who did not sign or consent to a written action that gave effect to the action creating the right to obtain payment under section 302A.471, and (iii) in any other case, to all shareholders entitled to dissent, a notice that contains:\n(1) the address to which a demand for payment and certificates of certificated shares must be sent in order to obtain payment and the date by which they must be received;\n(2) any restrictions on transfer of uncertificated shares that will apply after the demand for payment is received;\n(3) a form to be used to certify the date on which the shareholder, or the beneficial owner on whose behalf the shareholder dissents, acquired the shares or an interest in them and to demand payment; and\n(4) a copy of section 302A.471 and this section and a brief description of the procedures to be followed under these sections.\n(b) In order to receive the fair value of the shares, a dissenting shareholder must demand payment and deposit certificated shares or comply with any restrictions on transfer of uncertificated shares within 30 days after the notice required by paragraph (a) was given, but the dissenter retains all other rights of a shareholder until the proposed action takes effect.\n(a) After the corporate action takes effect, or after the corporation receives a valid demand for payment, whichever is later, the corporation shall remit to each dissenting shareholder who has complied with subdivisions 3 and 4 the amount the corporation estimates to be the fair value of the shares, plus interest, accompanied by:\n(1) the corporation's closing balance sheet and statement of income for a fiscal year ending not more than 16 months before the effective date of the corporate action, together with the latest available interim financial statements;\n(2) an estimate by the corporation of the fair value of the shares and a brief description of the method used to reach the estimate; and\n(3) a copy of section 302A.471 and this section, and a brief description of the procedure to be followed in demanding supplemental payment.\n(b) The corporation may withhold the remittance described in paragraph (a) from a person who was not a shareholder on the date the action dissented from was first announced to the public or who is dissenting on behalf of a person who was not a beneficial owner on that date. If the dissenter has complied with subdivisions 3 and 4, the corporation shall forward to the dissenter the materials described in paragraph (a), a statement of the reason for withholding the remittance, and an offer to pay to the dissenter the amount listed in the materials if the dissenter agrees to accept that amount in full satisfaction. The dissenter may decline the offer and demand payment under subdivision 6. Failure to do so entitles the dissenter only to the amount offered. If the dissenter makes demand, subdivisions 7 and 8 apply.\n(c) If the corporation fails to remit payment within 60 days of the deposit of certificates or the imposition of transfer restrictions on uncertificated shares, it shall return all deposited certificates and cancel all transfer restrictions. However, the corporation may again give notice under subdivision 4 and require deposit or restrict transfer at a later time.\nIf a dissenter believes that the amount remitted under subdivision 5 is less than the fair value of the shares plus interest, the dissenter may give written notice to the corporation of the dissenter's own estimate of the fair value of the shares, plus interest, within 30 days after the corporation mails the remittance under subdivision 5, and demand payment of the difference. Otherwise, a dissenter is entitled only to the amount remitted by the corporation.\nIf the corporation receives a demand under subdivision 6, it shall, within 60 days after receiving the demand, either pay to the dissenter the amount demanded or agreed to by the dissenter after discussion with the corporation or file in court a petition requesting that the court determine the fair value of the shares, plus interest. The petition shall be filed in the county in which the registered office of the corporation is located, except that a surviving foreign corporation that receives a demand relating to the shares of a constituent domestic corporation shall file the petition in the county in this state in which the last registered office of the constituent corporation was located. The petition shall name as parties all dissenters who have demanded payment under subdivision 6 and who have not reached agreement with the corporation. The corporation shall, after filing the petition, serve all parties with a summons and copy of the petition under the Rules of Civil Procedure. Nonresidents of this state may be served by registered or certified mail or by publication as provided by law. Except as otherwise provided, the Rules of Civil Procedure apply to this proceeding. The jurisdiction of the court is plenary and exclusive. The court may appoint appraisers, with powers and authorities the court deems proper, to receive evidence on and recommend the amount of the fair value of the shares. The court shall determine whether the shareholder or shareholders in question have fully complied with the requirements of this section, and shall determine the fair value of the shares, taking into account any and all factors the court finds relevant, computed by any method or combination of methods that the court, in its discretion, sees fit to use, whether or not used by the corporation or by a dissenter. The fair value of the shares as determined by the court is binding on all shareholders, wherever located. A dissenter is entitled to judgment in cash for the amount by which the fair value of the shares as determined by the court, plus interest, exceeds the amount, if any, remitted under subdivision 5, but shall not be liable to the corporation for the amount, if any, by which the amount, if any, remitted to the dissenter under subdivision 5 exceeds the fair value of the shares as determined by the court, plus interest.\n(a) The court shall determine the costs and expenses of a proceeding under subdivision 7, including the reasonable expenses and compensation of any appraisers appointed by the court, and shall assess those costs and expenses against the corporation, except that the court may assess part or all of those costs and expenses against a dissenter whose action in demanding payment under subdivision 6 is found to be arbitrary, vexatious, or not in good faith.\n(b) If the court finds that the corporation has failed to comply substantially with this section, the court may assess all fees and expenses of any experts or attorneys as the court deems equitable. These fees and expenses may also be assessed against a person who has acted arbitrarily, vexatiously, or not in good faith in bringing the proceeding, and may be awarded to a party injured by those actions.\n(c) The court may award, in its discretion, fees and expenses to an attorney for the dissenters out of the amount awarded to the dissenters, if any.",
	"repealed": false
}