{
	"id": "515B.4-115",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.4-115",
	"title": "515B.4-115 STATUTE OF LIMITATIONS FOR WARRANTIES; CIC CREATED BEFORE AUGUST 1, 2010.",
	"text": "(a) A judicial proceeding for breach of an obligation arising under section 515B.4-101(e) or 515B.4-106(d), shall be commenced within six months after the conveyance of the unit or other parcel of real estate.\n(b) A judicial proceeding for breach of an obligation arising under section 515B.4-112 or 515B.4-113 shall be commenced within six years after the cause of action accrues, but the parties may agree to reduce the period of limitation to not less than two years. An agreement reducing the period of limitation shall be binding on the purchaser's assigns. With respect to a unit that may be occupied for residential use, an agreement to reduce the period of limitation must be evidenced by an instrument separate from the purchase agreement signed by the purchaser.\n(c) Subject to subsection (d), a cause of action under section 515B.4-112 or 515B.4-113, regardless of the purchasers' lack of knowledge of the breach, accrues:\n(1) as to a unit, at the earlier of the time of conveyance of the unit by the declarant to a bona fide purchaser of the unit other than an affiliate of a declarant, or the time the purchaser enters into possession of the unit; and\n(2) as to each common element, the latest of (i) the time the common element is completed, (ii) the time the first unit in the common interest community is conveyed to a bona fide purchaser, or if the common element is located on property that is additional real estate at the time the first unit therein is conveyed to a bona fide purchaser; or (iii) the termination of the period of declarant control.\n(d) If a warranty explicitly extends to future performance or duration of any improvement or component of the common interest community, the cause of action accrues at the time the breach is discovered or at the end of the period for which the warranty explicitly extends, whichever is earlier.\n(e) This section applies only to common interest communities created before August 1, 2010.",
	"repealed": false
}