{
	"id": "204B.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.44",
	"title": "204B.44 ERRORS AND OMISSIONS; REMEDY.",
	"text": "(a) Any individual may file a petition in the manner provided in this section for the correction of any of the following errors, omissions, or wrongful acts which have occurred or are about to occur:\n(1) an error or omission in the placement or printing of the name or description of any candidate or any question on any official ballot, including the placement of a candidate on the official ballot who is not eligible to hold the office for which the candidate has filed;\n(2) any other error in preparing or printing any official ballot;\n(3) failure of the chair or secretary of the proper committee of a major political party to execute or file a certificate of nomination;\n(4) any wrongful act, omission, or error of any election judge, municipal clerk, county auditor, canvassing board or any of its members, the secretary of state, or any other individual charged with any duty concerning an election.\n(b) The petition shall describe the error, omission, or wrongful act and the correction sought by the petitioner. The petition shall be filed with any judge of the supreme court in the case of an election for state or federal office or any judge of the district court in that county in the case of an election for county, municipal, or school district office. The petitioner shall serve a copy of the petition on the officer, board or individual charged with the error, omission, or wrongful act, on all candidates for the office in the case of an election for state, federal, county, municipal, or school district office, and on any other party as required by the court. Upon receipt of the petition the court shall immediately set a time for a hearing on the matter and order the officer, board or individual charged with the error, omission or wrongful act to correct the error or wrongful act or perform the duty or show cause for not doing so. In the case of a review of a candidate's eligibility to hold office, the court may order the candidate to appear and present sufficient evidence of the candidate's eligibility. The court shall issue its findings and a final order for appropriate relief as soon as possible after the hearing. Failure to obey the order is contempt of court.",
	"repealed": false
}