{
	"id": "17.694",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.694",
	"title": "17.694 ACCREDITATION.",
	"text": "Any association accredited under this section may engage in bargaining as provided for under sections 17.691 to 17.702.\n(1) An association desiring accreditation shall file with the commissioner in the form required by the commissioner. The request shall contain properly certified evidence that the association meets the standards for accreditation and shall be accompanied by a report of the names and addresses of member producers, the name of each handler to whom the member producer delivered or contracted to deliver the agricultural commodity during the previous two calendar years. A fee to cover the costs of the commissioner in processing the request shall be established pursuant to chapter 14, and paid by the association when the request is filed.\n(2) The commissioner shall notify all handlers named in the request for accreditation of an association of producers. The notice must be sent to the handlers named in the request by first class mail within ten days of the commissioner receiving the request for accreditation. The commissioner shall maintain records indicating the date of mailing.\n(3) The commissioner may require all handlers of an agricultural commodity produced in a bargaining unit area as individuals to file within 30 days following a request, a report, properly certified, showing the correct names and addresses of all producers of the agricultural commodity who have delivered the agricultural commodity to the handler during the two calendar years preceding the filing of the report.\n(4) Data submitted to the commissioner by producer associations under clause (1) and by commodity handlers under clause (3) are private data on individuals or nonpublic data, as defined in section 13.02, subdivision 9 or 12.\nIn determination of accreditation, the commissioner shall determine the appropriate bargaining unit by plant, but may define the bargaining unit by processor or company if there is a history of identical contracts offered to producers on a processor or companywide basis. This determination shall be the unit area for the bargaining provisions of sections 17.691 to 17.702 as is applicable to associations and handlers. In making a determination, the commissioner shall define as appropriate the bargaining unit area in terms of the agricultural commodity produced, the definition of the agricultural commodity, geographic area covered, and number of producers included as is consistent with the following criteria:\n(1) the community of interest of the producers included;\n(2) the potential serious conflicts of interests among members of the proposed unit;\n(3) the effect of exclusions on the capacity of the association to effectively bargain for the bargaining unit as defined;\n(4) the kinds, types, and subtypes of products to be classed together as agricultural commodity for which the bargaining unit is proposed;\n(5) whether the producers eligible for membership in the proposed bargaining unit meet the definition of \"producer\" for the agricultural commodity involved;\n(6) the wishes of the producers; and\n(7) the pattern of past marketing of the commodity.\nAn association shall be accredited only if it complies with the following:\n(a) The association meets the requirements of the Capper-Volstead Act, United States Code, title 7, section 291-2.\n(b) The association has submitted a copy of its bylaws which provide that: Each member of the association shall have one vote in all votes of the membership of the association; that officers or directors shall be elected by a majority of the members voting or by delegates representing a majority of the membership; and that all elections shall be by secret ballot.\n(c) The association would have marketing and bargaining contracts for the current or next marketing year with more than 50 percent of the producers of an agricultural commodity who are in the bargaining unit area. An association whose main purpose is bargaining but which processes a surplus into a form which is not the subject of bargaining is not a processing cooperative. The contracts with members shall specify the agricultural commodity and that the members have appointed the association as their exclusive agent in negotiations with handlers for prices and other terms of trade with respect to the sale and marketing of the agricultural commodity and obligate the members of the association to dispose of their production or holdings of the agricultural commodity through or at the direction of the association.\nWithin 60 days of the filing date of the request for accreditation by an association, the commissioner shall determine whether the association shall be accredited. If the commissioner determines that insufficient evidence was filed by the association, the commissioner may permit the association to file an amended request for accreditation within 30 days following the determination and notification of the association. The commissioner shall then determine, within 30 days of the filing of the amended request, whether the association shall be accredited. An association which is denied accreditation after filing of an amended request may not file another request for accreditation for a period of one year.\nWithin 30 days of a decision by the commissioner denying accreditation to an association, the association may request a hearing before the commissioner. The commissioner shall then conduct a hearing to determine whether the association shall be accredited. This hearing shall be governed by the provisions of sections 14.57 and 14.60. If the commissioner, after this hearing has been held, determines that the association should not be accredited, the association may appeal this decision in accordance with sections 14.63 and 14.69. Only an association denied certification after such hearing may appeal under this chapter.\nAccreditation of the association by the commissioner shall be effective upon receipt by the association of the notice of accreditation from the commissioner.\nThe commissioner shall consider revocation of accreditation upon any of the following conditions:\n(a) Upon receipt of a request from an accredited association for its own disaccreditation.\n(b) Upon receipt of a petition requesting that the accredited association be disaccredited and bearing the signatures of at least ten percent of the producers of an accredited association in the bargaining unit. Within ten days following the receipt of a petition bearing the signatures of at least ten percent of the producers of an accredited association in a bargaining unit, the commissioner shall order a referendum, to take place at least seven days but not more than 20 days after the order, among the members of the accredited association and if in the referendum 50 percent of association members approve, the association accreditation shall be revoked by the commissioner. The commissioner shall have representatives of the department present at the referendum vote to conduct the referendum and take action to prevent unfair practices by the association of producers or handlers to obstruct or influence voting. Tabulation of the vote is the responsibility of the department. The department may adopt rules governing any referendum for repeal of accreditation. A request for a revocation of accreditation may occur only during the first three months of a marketing year.\nThe accredited association shall represent all member producers who are in the bargaining unit area and it shall act as exclusive sales agents for the members of the accredited association in the bargaining unit area in negotiations with handlers. The association may not assess, bargain for, or claim to represent those producers who choose not to be represented by the association or choose not to have a bargaining committee bargain for them.",
	"repealed": false
}