{
	"id": "171.162",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.162",
	"title": "171.162 COMMERCIAL DRIVER'S LICENSE, REQUIRED RECORDS.",
	"text": "As required by Code of Federal Regulations, title 49, section 383.73, before issuing a class A, class B, or class C commercial driver's license, the department shall request the applicant's complete driving record from all states where the applicant was previously licensed over the last ten years to operate any type of motor vehicle.\nAs required by Code of Federal Regulations, title 49, section 383.71, an applicant for a class A, class B, or class C commercial driver's license shall certify, on a form prescribed by the department, whether:\n(1) the applicant operates or expects to operate a class A, class B, or class C motor vehicle in interstate or foreign commerce or is otherwise subject to the medical examination requirements of Code of Federal Regulations, title 49, part 391;\n(2) the applicant operates or expects to operate a class A, class B, or class C motor vehicle in interstate or foreign commerce but is exempt from the medical examination requirements of Code of Federal Regulations, title 49, part 391;\n(3) the applicant operates or expects to operate a class A, class B, or class C motor vehicle entirely in intrastate commerce, is not subject to the medical examination requirements of Code of Federal Regulations, title 49, part 391, but is subject to the medical examination requirements of chapter 221; or\n(4) the applicant operates or expects to operate a class A, class B, or class C motor vehicle entirely in intrastate commerce, is not subject to the medical examination requirements of Code of Federal Regulations, title 49, part 391, and is exempt from the medical examination requirements of chapter 221.\nAn applicant for a class A, class B, or class C commercial driver's license who is subject to the medical examination requirements of chapter 221 or Code of Federal Regulations, title 49, part 391, shall submit a valid medical examiner's certificate or a current medical waiver to the department.\nThe holder of a class A, class B, or class C commercial driver's license who is subject to the medical examination requirements of chapter 221 or Code of Federal Regulations, title 49, part 391, shall submit a valid medical examiner's certificate or a current medical waiver to the department prior to the expiration of the certificate or waiver previously submitted by the person.\nBy November 30, 2013, a person who holds a class A, class B, or class C commercial driver's license as of August 1, 2013, shall submit to the department the self-certification described in subdivision 2. If the licensee certifies that the licensee is subject to the medical examination requirements of chapter 221 or Code of Federal Regulations, title 49, part 391, the licensee shall also submit to the department a valid medical examiner's certificate or a current medical waiver. If the licensee fails to submit the self-certification or, if required, a valid medical examiner's certificate or current medical waiver, the department shall follow the notice and license downgrade procedures of subdivision 6.\n(a) If a licensee has previously certified to the department that the licensee is subject to the medical examination requirements of chapter 221 or Code of Federal Regulations, title 49, part 391, the department shall send written notice if the licensee's medical examiner's certificate or medical waiver has expired or been removed, rescinded, or revoked. The notice must state that the commercial driver's license will be downgraded to a class D driver's license unless, within 30 days of the date of the notice, the licensee submits to the department:\n(1) a valid medical examiner's certificate or a current medical waiver; or\n(2) a new self-certification, as described in subdivision 2, in which the licensee certifies that the licensee is subject to a different set of medical examination requirements or exemptions than indicated on the licensee's previous self-certification, accompanied by a valid medical examiner's certificate or a current medical waiver, if applicable.\n(b) The department shall send the notice described in paragraph (a):\n(1) by electronic mail to the electronic mail address provided by the licensee to the department for that purpose;\n(2) by facsimile transmission to the telephone number provided by the licensee to the department for that purpose; or\n(3) by mail, addressed to the licensee's last known address with postage prepaid.\n(c) As applied to licensees who have previously certified they operate or expect to operate motor vehicles in interstate or foreign commerce, the notice described in paragraph (a) must conform to the requirements of Code of Regulations, title 49, section 383.73, paragraph (j).\n(d) If the licensee does not submit a new self-certification but submits a valid medical examiner's certificate or a current medical waiver within the 30-day period described in paragraph (a), the commissioner shall take no action. If the licensee submits a new self-certification as described in paragraph (a), along with a valid medical examiner's certificate or a current medical waiver, as applicable, the commissioner shall restrict the licensee's operating privileges to the extent required under section 171.09, subdivision 1, paragraph (c) or (d). If the licensee does not submit a new self-certification, a valid medical examiner's certificate, or a current medical waiver within the 30-day period described in paragraph (a), the commissioner shall remove the licensee's privilege to operate a class A, class B, or class C motor vehicle.\nThe commissioner shall adopt rules to implement and administer this section and section 171.09, subdivision 1.",
	"repealed": false
}