{
	"id": "429.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/429.011",
	"title": "429.011 DEFINITIONS.",
	"text": "For the purpose of this chapter the terms defined in this section shall have the meanings ascribed to them.\n\"Municipality\" means any city of the second, third, or fourth class however organized, or any statutory city or any town as defined in section 368.01.\n\"Municipality\" also includes the following:\n(1) a county in the case of construction, reconstruction, or improvement of a county state-aid highway;\n(2) a county in the case of construction, reconstruction, or improvement of a county highway as defined in section 160.02 including curbs and gutters and storm sewers;\n(3) a county exercising its powers and duties under section 444.075, subdivision 1;\n(4) a county for expenses not paid for under section 403.113, subdivision 3, paragraph (b), clause (3);\n(5) a county in the case of the abatement of nuisances; and\n(6) a county operating an energy improvements financing program under section 216C.436 or 216C.437.\n\"Municipality\" also includes any town not having the powers granted herein pursuant to any other law in the case of construction, reconstruction or improvement of a town road including curbs and gutters and storm sewers and in the case of those improvements designated in section 429.021, subdivision 1, clauses (1), (2), (4), (5), (6), (7), (8), and (10).\n\"Council\" means the body of the city having general legislative powers, the town board of the town, or the county board of a county.\n\"Clerk\" means the chief clerical officer of the municipality.\n\"Improvement\" means any type of improvement made under authority granted by section 429.021, and in the case of a county is limited to the construction, reconstruction, or improvement of a county state-aid highway or county highway including curbs and gutters and storm sewers, and to the purchase, installation, or maintenance of signs, posts, and markers for addressing related to the operation of enhanced 911 telephone service.\n\"Newspaper\" means the official newspaper of the municipality, or if there is no official newspaper, a legal newspaper of general circulation in the municipality.\n\"Street\" means any street, alley, or other public way, or any part thereof.\n\"Utilities commission\" means the municipal board or commission, other than the council, which exercises any authority or control over the operation of any municipally owned public utility.\n\"Pedestrian skyway system\" means any system of providing for pedestrian traffic circulation, mechanical or otherwise, elevated above ground, within and without the public right-of-way, and through or above private property and buildings, and includes overpasses, bridges, passageways, walkways, concourses, hallways, corridors, arcades, courts, plazas, elevators, escalators, heated canopies, and accesses and all fixtures, furniture, equipment, facilities, services, and appurtenances which in the judgment of the council will enhance the movement, safety, security, convenience and enjoyment of pedestrians and benefit the city and adjoining properties.\n\"Underground pedestrian concourse\" means any system of providing for pedestrian traffic circulation, mechanical or otherwise, below ground, within and without the public right-of-way, and through or below private property, and includes tunnels, passageways, walkways, concourses, hallways, corridors, arcades, plazas, elevators, escalators, heated canopies, and accesses and all fixtures, furniture, equipment, facilities, and appurtenances which in the judgment of the council will enhance the movement, safety, security, convenience and enjoyment of pedestrians and benefit the city and adjoining properties.\n\"Special lighting system\" means lights or light displays of any type located within or without the public right-of-way.\n\"Acquire\" includes, but is not limited to, the obtaining by purchase, condemnation, or leasing rights or interests in the areas above or below the surface of the ground of real property or structures or improvements thereon.\n\"Public mall, plaza, or courtyard\" means any wholly or partly opened or enclosed public area adjacent to or attached to a wall, fence, commercial structure, hotel, or any other building and designed as a place for passive recreation, public entertainment, exhibition and education, or a pedestrian walk.\n\"Fire protection system\" means pipes, standpipes, sprinklers, control systems and other devices and equipment installed in or outside a building for the primary purpose of eliminating or reducing the spread of fire in the building or providing for safe evacuation of the building, whether the devices and equipment are publicly or privately owned.\n\"Highway sound barriers\" means sound abatement walls erected along highways to reduce noise levels attributable to vehicular traffic.\n\"On-site water contaminant improvements\" means pipes, wells, and other devices and equipment installed in or outside a building for the primary purpose of eliminating water contamination caused by lead or other toxic or health threatening substances in the water, whether the improvements so installed are publicly or privately owned.",
	"repealed": false
}