{
	"id": "136A.1795",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1795",
	"title": "136A.1795 LARGE ANIMAL VETERINARIAN LOAN FORGIVENESS PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Veterinarian\" means an individual who has been awarded a doctor of veterinary medicine degree from the College of Veterinary Medicine, University of Minnesota.\n(c) \"Designated rural area\" means an area in Minnesota outside the counties of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, and Washington, excluding the cities of Duluth, Mankato, Moorhead, Rochester, and St. Cloud.\n(d) \"Emergency circumstances\" means those conditions that make it impossible for the participant to fulfill the service commitment, including death, total and permanent disability, or temporary disability lasting more than two years.\n(e) \"Qualified educational loan\" means a government, commercial, or foundation loan for actual costs paid for tuition, reasonable education expenses, and reasonable living expenses related to the education of a veterinarian.\n(a) The commissioner shall establish and administer a loan forgiveness program for large animal veterinarians who:\n(1) agree to practice in designated rural areas that are considered underserved; and\n(2) work full time in a practice that is at least 50 percent involved with the care of food animals.\n(b) A large animal veterinarian loan forgiveness program account is established in the special revenue fund. Money in the account is appropriated to the commissioner to establish and administer the program under this section. Appropriations to the commissioner for the program are for transfer to the account. Appropriations from the account do not cancel and are available until expended.\n(a) To be eligible to participate in the loan forgiveness program, an individual must:\n(1) be a veterinarian who has been awarded a veterinary medicine degree within three years of submitting an application under this section, or be enrolled in the veterinarian degree program and making satisfactory progress in the College of Veterinary Medicine, University of Minnesota; and\n(2) submit an application to the commissioner in the form and manner prescribed by the commissioner.\n(b) An applicant selected to participate must sign a contract agreeing to complete a five-year service obligation to practice as required under subdivision 2, paragraph (a).\n(a) The commissioner may select eligible applicants each year for participation in the loan forgiveness program, within the limits of available funding. Applicants are responsible for securing their own qualified educational loans.\n(b) The commissioner must select participants based on their suitability for practice serving the designated rural area, as indicated by experience or training. The commissioner must give preference to applicants closest to completing their training.\n(c) The commissioner must make annual disbursements directly to the participant of $15,000 or the balance of the participant's qualifying educational loans, whichever is less, for each year that a participant meets the service obligation required under subdivision 3, paragraph (b), up to a maximum of five years.\n(d) Before receiving loan repayment disbursements and as requested, the participant must complete and return to the commissioner a confirmation of practice form provided by the commissioner verifying that the participant is practicing as required under subdivision 2, paragraph (a). The participant must provide the commissioner with verification that the full amount of loan repayment disbursement received by the participant has been applied toward the designated loans. After each disbursement, verification must be received by the commissioner and approved before the next loan repayment disbursement is made.\n(e) Participants who move their practice remain eligible for loan repayment as long as they practice as required under subdivision 2, paragraph (a).\nIf a participant does not fulfill the required minimum commitment of service required under subdivision 3, paragraph (b), the commissioner must collect from the participant the total amount paid to the participant under the loan forgiveness program plus interest at a rate established according to section 270C.40. The commissioner must deposit the money collected in the state general fund. The commissioner must allow waivers of all or part of the money owed the commissioner as a result of a nonfulfillment penalty if emergency circumstances prevented fulfillment of the service obligation.\nThe commissioner may adopt rules to implement this section.",
	"repealed": false
}