{
	"id": "123A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.60",
	"title": "123A.60 REMAINING DISTRICTS, ACTION OF COUNTY BOARD; ELECTION.",
	"text": "Any organized district not maintaining a classified school within the district, except those districts which have a contract with a state university or with the Board of Regents of the University of Minnesota for the education of all the children of the district, shall hereby be dissolved as of the date the district ceases to maintain a classified school. Any such district not maintaining a classified school must be attached by order of the county board to such district maintaining classified elementary or secondary schools upon notice and hearing as provided in section 123A.46 for the attachment of dissolved districts.\nPrior to the order of the county board, the board may direct the county auditor to call a special election in the manner and form in which district elections are held. The purpose of the election shall be to determine to which district or districts the dissolved district shall be attached. The county board after hearing must determine the form of question as it should appear on the ballot. The results of the election shall be advisory in nature only.\nThe county auditor shall certify the results of the election to the county board. Within 45 days after such election, the county board must issue its order dissolving the district. The order must also attach the dissolved district to a proper district as determined by the county board, and a copy of such order must be filed with the commissioner. Title to all the property, real and personal, of the district dissolved passes to the district to which such dissolved district is attached. If a district is divided by virtue of the proceedings the county board shall issue its order providing for the division of the current assets and liabilities according to such terms as it may deem just and equitable. If the order of the county board attaches any land area to a district with bonded debt, the taxable property in such area assumes its proportionate share of the authorized and outstanding debt of the district to which it is attached.",
	"repealed": false
}