{
	"id": "115A.9157",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.9157",
	"title": "115A.9157 RECHARGEABLE BATTERIES AND PRODUCTS.",
	"text": "For the purpose of this section, \"rechargeable battery\" means a sealed nickel-cadmium battery, a sealed lead acid battery, or any other rechargeable battery, except a rechargeable battery governed by section 115A.9155 or exempted by the commissioner under subdivision 9.\nEffective August 1, 1991, a person may not place in mixed municipal solid waste a rechargeable battery, a rechargeable battery pack, a product with a nonremovable rechargeable battery, or a product powered by rechargeable batteries or rechargeable battery pack, from which all batteries or battery packs have not been removed.\nA manufacturer of rechargeable batteries or products powered by rechargeable batteries is responsible for the costs of collecting and managing its waste rechargeable batteries and waste products to ensure that the batteries are not part of the solid waste stream.\n[Repealed, 2007 c 13 art 2 s 7]\n(a) By September 20, 1995, the manufacturers or their representative organization shall implement permanent programs, based on the results of the pilot projects required in Minnesota Statutes 1994, section 115A.9157, subdivision 4, that may be reasonably expected to collect 90 percent of the waste rechargeable batteries and the participating manufacturers' products powered by rechargeable batteries that are generated in the state. The batteries and products collected must be recycled or otherwise managed or disposed of properly.\n(b) In every odd-numbered year after 1995, each manufacturer or a representative organization shall provide information to the senate and house of representatives committees having jurisdiction over environment and natural resources and environment and natural resources finance that specifies at least the estimated amount of rechargeable batteries subject to this section sold in the state by each manufacturer and the amount of batteries each collected during the previous two years. A representative organization may report the amounts in aggregate for all the members of the organization.\nA manufacturer or its representative organization shall inform the committees listed in subdivision 5 when they begin participating in the projects and programs and immediately if they withdraw participation.\nA manufacturer or a representative organization of manufacturers may contract with the state or a political subdivision to provide collection services under this section. The manufacturer or organization shall fully reimburse the state or political subdivision for the value of any contractual services rendered under this subdivision.\nA manufacturer or organization of manufacturers and its officers, members, employees, and agents who participate in projects or programs to collect and properly manage waste rechargeable batteries or products powered by rechargeable batteries are immune from liability under state law relating to antitrust, restraint of trade, unfair trade practices, and other regulation of trade or commerce for activities related to the collection and management of batteries and products required under this section.\nTo ensure that new types of batteries do not add additional hazardous or toxic materials to the mixed municipal solid waste stream, the commissioner of the agency may exempt a new type of rechargeable battery from the requirements of this section if it poses no unreasonable hazard when placed in and processed or disposed of as part of a mixed municipal solid waste.",
	"repealed": false
}