{
	"id": "103F.367",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.367",
	"title": "103F.367 MISSISSIPPI HEADWATERS BOARD.",
	"text": "The Mississippi Headwaters Board established by the counties of Clearwater, Hubbard, Beltrami, Cass, Itasca, Aitkin, Crow Wing, and Morrison by agreement entered into on February 22, 1980, pursuant to section 471.59, is established as a permanent board with authority to prepare, adopt, and implement a comprehensive land use plan designed to protect and enhance the Mississippi River and related shoreland areas situated within the counties.\n(a) The board shall consist of eight members. The governing body of each county shall appoint one of its members to serve on the board.\n(b) The terms of board members are two years commencing on the first Monday in January of odd-numbered years.\n(c) Vacancies on the board shall be filled for the remainder of the term by the governing body that made the original appointment.\n(d) The governing body of a county may designate another member of the governing body or a county officer to act as an alternate for the member appointed by that county.\n(a) The board shall annually appoint from among its members a chair, vice-chair, and secretary-treasurer who shall serve for concurrent one-year terms.\n(b) The chair shall preside over all meetings of the board and may call special meetings at reasonable times and upon adequate notice when necessary.\n(c) The vice-chair shall preside over the meetings of the board in the absence of the chair.\n(d) The secretary-treasurer or the designee of the secretary-treasurer shall keep a record of all proceedings of the board. The secretary-treasurer shall provide for the proper receipt and disbursement of funds.\n(a) The regular meetings of the board shall be held at times and places prescribed by it.\n(b) A majority of all members of the board shall constitute a quorum and a majority vote of all members shall be required for actions taken by the board.\nThe board may employ staff and contract for goods and services as necessary to implement sections 103F.361 to 103F.377. Contracts are subject to the statutory procedures and restrictions applicable to county contracts.\nThe board shall annually submit to each county for its approval an estimate of the funds it will need from that county in the next fiscal year to prepare and implement the plan and otherwise carry out the duties imposed upon it by sections 103F.361 to 103F.377. Each county shall, upon approval of the estimate by its governing body, furnish the necessary funds to the board. The board may apply for, receive, and disburse federal, state, and other grants and donations.\nThe board shall appoint advisory committees, representing a broad geographical area and diverse public interests, and conduct public meetings and hearings necessary to afford the public an opportunity to become fully informed of all deliberations in the preparation and implementation of the plan.\nThe board shall initiate and maintain contacts with governmental agencies as necessary to properly prepare the plan and shall negotiate cooperative management agreements with the United States Forest Service and Bureau of Land Management and the state Department of Natural Resources. The board, Beltrami, Cass, Hubbard, and Itasca Counties shall initiate and maintain contacts with the governing body of the Leech Lake Indian Reservation and shall negotiate a cooperative management and jurisdiction agreement with the reservation governing body.",
	"repealed": false
}