{
	"id": "304A.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/304A.301",
	"title": "304A.301 ANNUAL BENEFIT REPORT.",
	"text": "Before each April 1, a public benefit corporation must deliver to the secretary of state for filing an annual benefit report covering the 12-month period ending on December 31 of the previous year and pay a fee of $35 to the secretary of state. The annual benefit report must state the name of the public benefit corporation, be signed by the public benefit corporation's chief executive officer not more than 30 days before the report is delivered to the secretary of state for filing, and must be current when signed.\nFor a specific benefit corporation, the annual benefit report must contain:\n(1) with regard to the period covered by the report, a narrative description of:\n(i) the ways in which the corporation pursued and created the specific public benefit stated in its articles;\n(ii) the extent to which that specific public benefit purpose was pursued and created; and\n(iii) any circumstances that hindered efforts to pursue or create the specific public benefit; and\n(2) a certification that its board of directors has reviewed and approved the report.\nThe annual benefit report of a general benefit corporation must:\n(1) certify that its board of directors has:\n(i) chosen the third-party standard designated pursuant to clause (2), item (i);\n(ii) determined that the organization that promulgated the third-party standard is independent; and\n(iii) approved the report;\n(2) with regard to the period covered by the report:\n(i) identify a third-party standard determined by the board; and\n(ii) with reference to that third-party standard, describe:\n(A) how the corporation has pursued general public benefit;\n(B) the extent to which and the ways in which the corporation has created general public benefit; and\n(C) any circumstances that hindered efforts to pursue or create general public benefit;\n(3) if the report is the first delivered for filing by the general benefit corporation, explain how and why the board chose the third-party standard identified under clause (2), item (i);\n(4) if the third-party standard identified under clause (2), item (i), is the same third-party standard identified in the immediately prior report:\n(i) state whether the third-party standard is being applied in a manner consistent with the third-party standard's application in the prior reports; and\n(ii) if the third-party standard is not being so applied in a consistent manner, explain why;\n(5) if the third-party standard identified under clause (2), item (i), is not the same as the third-party standard identified in the immediately prior report, explain how and why the board chose a different third-party standard; and\n(6) if the general benefit corporation has also stated a specific public benefit purpose in its articles, the information required in subdivision 2, clause (1).\nA public benefit corporation is not required to have its annual benefit report audited, certified, or otherwise evaluated by a third party.\nIf a public benefit corporation fails to file, before April 1 of any calendar year, the annual benefit report required by this section, the secretary of state shall revoke the corporation's status as a public benefit corporation under this chapter and must notify the public benefit corporation of the revocation using the information provided by the corporation pursuant to section 5.002 or 5.34 or provided in the articles.\n(a) A public benefit corporation that has lost its public benefit corporation status for failure to timely file an annual benefit report or by terminating that status pursuant to section 304A.103 is not entitled to the benefits afforded to a public benefit corporation under this chapter as of the date of revocation or termination and must amend the articles of incorporation to reflect a name compliant with section 302A.115, but which does not include the corporate designation provided for in section 304A.101, subdivision 2.\n(b) Within 30 days of issuance of revocation of public benefit corporation status by the secretary of state, filing a renewal complying with this section and a $500 fee with the secretary of state will reinstate the corporation as a public benefit corporation under this chapter as of the date of revocation.\nA shareholder of the public benefit corporation may obtain payment for the fair value of the shareholder's shares pursuant to section 302A.473 as a result of revocation of public benefit corporation status pursuant to this section caused by the intentional failure to file an annual benefit report.\nThe duration of a corporation that has had public benefit status terminated or revoked and which fails to change the corporate name as provided in subdivision 6 expires automatically 30 days after termination or revocation of the public benefit corporation status.",
	"repealed": false
}