{
	"id": "473.511",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.511",
	"title": "473.511 SEWER SERVICE FUNCTION.",
	"text": "At any time after January 1, 1970, until July 1, 1994, the former Metropolitan Waste Control Commission, and after July 1, 1994, the council shall assume ownership of all existing interceptors and treatment works which will be needed to implement the council's comprehensive plan for the collection, treatment, and disposal of sewage in the metropolitan area, in the manner and subject to the conditions prescribed in subdivisions 2 and 4, and shall thereafter acquire, construct, equip, operate and maintain all additional interceptors and treatment works which will be needed for such purpose. The council shall assume ownership of all treatment works owned by a local government unit if any part of such treatment works will be needed for such purpose.\nThe council may require any local government unit to transfer to the council, all of its right, title and interest in any interceptors or treatment works and all necessary appurtenances thereto owned by such local government unit which will be needed for the purpose stated in subdivision 1. Appropriate instruments of conveyance for all such property shall be executed and delivered to the council by the proper officers of each local government unit concerned. All persons regularly employed by a local government unit to operate and maintain any treatment works so transferred to the council, on the date on which the transfer becomes effective, shall be employees of the council, in the same manner and with the same options and rights as are reserved to employees of sanitary districts and joint boards under subdivision 3. The council, upon assuming ownership of any such interceptors or treatment works, shall become obligated to pay to such local government unit amounts sufficient to pay when due all remaining principal of and interest on bonds issued by such local government unit for the acquisition or betterment of the interceptors or treatment works taken over. Such amounts may be offset against any amount to be paid to the council by the local government unit as provided in section 473.517.\nEffective January 1, 1971, the corporate existence of the Minneapolis-St. Paul Sanitary District, the North Suburban Sanitary Sewer District, and any joint board created by agreement among local government units under section 471.59, to provide interceptors and treatment works for such local government units, terminate. All persons regularly employed by such sanitary districts and joint boards on that date or on any earlier date on which the former waste control commission pursuant to subdivisions 1 and 2 assumed ownership and control of any interceptors or treatment works owned or operated by such sanitary districts and joint boards, and who are employees of the commission on July 1, 1994, are employees of the council. Members of trades who are employed by the former Metropolitan Waste Control Commission, who have trade union pension coverage under a collective bargaining agreement, and who elected exclusion from coverage under section 473.512, or who are first employed after July 1, 1977, may not be covered by the Minnesota State Retirement System. The council shall make the employer's contributions to pension funds of its employees. Such employees shall perform such duties as may be prescribed by the council. All funds of such sanitary districts and joint boards then on hand, and all subsequent collections of taxes, special assessments or service charges levied or imposed by or for such sanitary districts or joint boards must be transferred to the council. The local government units otherwise entitled to such cash, taxes, assessments, or service charges must be credited with such amounts, and such credits must be offset against any amounts to be paid by them to the council as provided in section 473.517. The former Metropolitan Waste Control Commission, and on July 1, 1994, the council shall succeed to and become vested by action of law with all right, title and interest in and to any property, real or personal, owned or operated by such sanitary districts and joint boards. Prior to that date the proper officers of such sanitary districts and joint boards, or the former Metropolitan Waste Control Commission, shall execute and deliver to the council all deeds, conveyances, bills of sale, and other documents or instruments required to vest in the council good and marketable title to all such real or personal property; provided that vesting of the title must occur by operation of law and failure to execute and deliver the documents does not affect the vesting of title in the former Metropolitan Waste Control Commission or the council on the dates indicated in this subdivision. The council shall become obligated to pay or assume all bonded or other debt and contract obligations incurred by the former Metropolitan Waste Control Commission, or by such sanitary districts and joint boards, or incurred by local government units for the acquisition or betterment of any interceptors or treatment works owned or operated by such sanitary districts or joint boards.\nWhen the council assumes the ownership of any existing interceptors or treatment works as provided in subdivision 2 or 3, the local government unit or units which paid part or all of the cost of such facility, directly or pursuant to contracts for reimbursement of costs, shall be entitled to receive a credit against amounts to be allocated to them under section 473.517, which may be spread over such period not exceeding 30 years as the council shall determine, and an additional credit equal to interest on the unused credit balance from time to time at the rate of four percent per annum. The amount of such credit shall equal the current value of the facility computed by the council in the manner provided in this subdivision at the time the council acquires it. The original cost of a facility shall be computed as the total actual costs of constructing it, including engineering, legal, and administrative costs, less any part of it paid from federal or state funds and less the principal amount of any then outstanding bonds which were issued to finance its construction. The original cost shall be multiplied by a factor equal to a current cost index divided by the same cost index at the time of construction, to determine replacement cost. The cost indices used shall be the Engineering News Record Construction Cost Indices for facilities or parts thereof completed before 1930, and the United States Public Health Service Federal Water Pollution Control Values for Sewer and Treatment Plant Construction, as applied to facilities or parts thereof completed in or after 1930. The current value of the facility shall be the replacement cost depreciated by 4.00 percent per annum from the date of construction of treatment works, 2.50 percent per annum from the date of construction of interceptors which operate under pressure, and 1.25 percent per annum from the date of construction of interceptors which do not operate under pressure; and decreased further by a reasonable allowance for obsolescence if the council determines that the facility or any part thereof will not be useful for council purposes for at least the remaining period required to depreciate it fully, assuming no salvage value. The current value of each such facility shall be credited to each local government unit in proportion to the amount of the construction cost paid by that unit, as determined by the council, taking into account reimbursements previously made under contracts between any of the local government units. The council shall prepare an itemized statement of the amount of credit each local government unit is entitled to receive under this subdivision, and the years and amounts of installments of principal and interest thereon, and shall cause it to be mailed or delivered to the governing body of each local government unit concerned. All credits allowed under this subdivision shall be used to finance current costs allocated to the local government unit by the council or for other sewer costs, and the credits shall not be considered as proceeds from the sale of municipal property so as to permit their use for other purposes. At its option, the council may make a periodic payment to each local government unit in the amount of the credits provided pursuant to this subdivision, in lieu of a credit against amounts to be allocated to such local government units under section 473.517.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]",
	"repealed": false
}