{
	"id": "245A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.02",
	"title": "245A.02 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them in this section.\n\"Adult\" means a person who is 18 years old or older and who:\n(1) has mental illness, developmental disability, physical disability, or functional impairment; or\n(2) has substance use disorder or abuses substances.\n\"Adult day care,\" \"adult day services,\" and \"family adult day services\" mean a program operating less than 24 hours per day that provides functionally impaired adults with an individualized and coordinated set of services including health services, social services, and nutritional services that are directed at maintaining or improving the participants' capabilities for self-care. Adult day care, adult day services, and family adult day services do not include programs where adults gather or congregate primarily for purposes of socialization, education, supervision, caregiver respite, religious expression, exercise, or nutritious meals.\nWith the exception of subdivision 2c, \"annual\" or \"annually\" means prior to or within the same month of the subsequent calendar year.\n[Renumbered 142B.01, subd 3]\n\"Applicant\" means an individual, organization, or government entity, as defined in section 13.02, subdivision 7a, that is subject to licensure under this chapter and that has applied for but not yet been granted a license under this chapter.\n\"Certification\" means the commissioner's written authorization for a license holder licensed by the commissioner of human services or the commissioner of corrections to serve children in a residential program and provide specialized services based on certification standards in Minnesota Rules. The term \"certification\" and its derivatives have the same meaning and may be substituted for the term \"licensure\" and its derivatives in this chapter.\n\"Authorized agent\" means the controlling individual designated by the license holder responsible for communicating with the commissioner of human services on all matters related to this chapter and on whom service of all notices and orders must be made pursuant to section 245A.04, subdivision 1.\nFor the purposes of section 245A.25, a youth who is \"at risk of becoming a victim of sex trafficking or commercial sexual exploitation\" means a youth who meets the criteria established by the commissioner of human services for this purpose.\n\"Child\" means a person who has not reached age 18.\n\"Children's residential facility\" means a residential program licensed under this chapter or chapter 241 according to the applicable standards in Minnesota Rules, parts 2960.0010 to 2960.0710.\n\"Commissioner\" means the commissioner of human services or the commissioner's designated representative including county agencies and private agencies.\n(a) \"Controlling individual\" means an owner of a program or service provider licensed under this chapter and the following individuals, if applicable:\n(1) each officer of the organization, including the chief executive officer and chief financial officer;\n(2) the individual designated as the authorized agent under section 245A.04, subdivision 1, paragraph (b);\n(3) the individual designated as the compliance officer under section 256B.04, subdivision 21, paragraph (g);\n(4) each managerial official whose responsibilities include the direction of the management or policies of a program; and\n(5) the president and treasurer of the board of directors of a nonprofit corporation.\n(b) Controlling individual does not include:\n(1) a bank, savings bank, trust company, savings association, credit union, industrial loan and thrift company, investment banking firm, or insurance company unless the entity operates a program directly or through a subsidiary;\n(2) an individual who is a state or federal official, or state or federal employee, or a member or employee of the governing body of a political subdivision of the state or federal government that operates one or more programs, unless the individual is also an officer, owner, or managerial official of the program, receives remuneration from the program, or owns any of the beneficial interests not excluded in this subdivision;\n(3) an individual who owns less than five percent of the outstanding common shares of a corporation:\n(i) whose securities are exempt under section 80A.45, clause (6); or\n(ii) whose transactions are exempt under section 80A.46, clause (2);\n(4) an individual who is a member of an organization exempt from taxation under section 290.05, unless the individual is also an officer, owner, or managerial official of the program or owns any of the beneficial interests not excluded in this subdivision. This clause does not exclude from the definition of controlling individual an organization that is exempt from taxation; or\n(5) an employee stock ownership plan trust, or a participant or board member of an employee stock ownership plan, unless the participant or board member is a controlling individual according to paragraph (a).\n(c) For purposes of this subdivision, \"managerial official\" means an individual who has the decision-making authority related to the operation of the program, and the responsibility for the ongoing management of or direction of the policies, services, or employees of the program. A site director who has no ownership interest in the program is not considered to be a managerial official for purposes of this definition.\n\"Cradleboard\" means a board or frame on which an infant is secured using blankets or other material, such as fabric or leather sides, and laces and often has a frame extending to protect the infant's head. The infant is always placed with the infant's head facing outward, and the infant remains supervised in the cradleboard while sleeping or being carried.\n\"County agency\" means the agency designated by the county board of commissioners, human service boards, local social services agencies or multicounty local social services agencies, or departments where those have been established under the law.\n[Renumbered 142B.01, subd 11]\n[Renumbered 142B.01, subd 12]\n\"Foster care for adults\" means a program operating 24 hours a day that provides functionally impaired adults with food, lodging, protection, supervision, and household services in a residence, in addition to services according to the individual service plans under Minnesota Rules, part 9555.5105, subpart 18.\n\"Foster family setting\" has the meaning given in Minnesota Rules, part 2960.3010, subpart 23, and includes settings licensed by the commissioner of human services or the commissioner of corrections.\n\"Foster residence setting\" has the meaning given in Minnesota Rules, part 2960.3010, subpart 26, and includes settings licensed by the commissioner of human services or the commissioner of corrections.\n\"Family adult foster care home\" means an adult foster care home:\n(1) that is licensed by the Department of Human Services;\n(2) that is the primary residence of the license holder; and\n(3) in which the license holder is the primary caregiver.\nFor the purposes of adult day care, adult day services, family adult day services, or adult foster care, \"functional impairment\" means:\n(1) a condition that is characterized by substantial difficulty in carrying out one or more of the essential major activities of daily living, such as caring for oneself, performing manual tasks, walking, seeing, hearing, speaking, breathing, learning, working; or\n(2) a disorder of thought or mood that significantly impairs judgment, behavior, capacity to recognize reality, or ability to cope with the ordinary demands of life and that requires support to maintain independence in the community.\n\"HIV minimum standards\" means those items approved by the department and contained in the HIV-1 Guidelines for substance use disorder treatment and care programs in Minnesota including HIV education to clients, completion of HIV training by all new and existing staff, provision for referral to individual HIV counseling and services for all clients, and the implementation of written policies and procedures for working with HIV-infected clients.\n[Repealed, 2014 c 262 art 5 s 7]\n\"License\" means a certificate issued by the commissioner under section 245A.04 authorizing the license holder to provide a specified program for a specified period of time and in accordance with the terms of the license and the rules of the commissioner.\n\"License holder\" means an individual, organization, or government entity that is legally responsible for the operation of the program or service, and has been granted a license by the commissioner under this chapter and the rules of the commissioner.\n\"Nonresidential program\" means care, supervision, rehabilitation, training or habilitation of a person provided outside the person's own home and provided for fewer than 24 hours a day, including adult day care programs; and substance use disorder or substance abuse programs that are located in a nursing home or hospital and receive public funds for providing substance abuse or substance use disorder treatment services under chapter 254B. Nonresidential programs include home and community-based services for persons with disabilities or persons age 65 and older that are provided in or outside of a person's own home under chapter 245D.\n[Renumbered 142B.01, subd 21]\n\"Owner\" means an individual or organization that has a direct or indirect ownership interest of five percent or more in a program licensed under this chapter. For purposes of this subdivision, \"direct ownership interest\" means the possession of equity in capital, stock, or profits of an organization, and \"indirect ownership interest\" means a direct ownership interest in an entity that has a direct or indirect ownership interest in a licensed program. For purposes of this chapter, \"owner of an employee stock ownership plan\" means the president and treasurer of the entity. A government entity or nonprofit corporation that is issued a license under this chapter shall be designated the owner.\n\"Organization\" means a domestic or foreign corporation, nonprofit corporation, limited liability company, partnership, limited partnership, limited liability partnership, association, voluntary association, and any other legal or commercial entity. For purposes of this chapter, organization does not include a government entity.\n\"Person\" means a child or adult as defined in subdivisions 2 and 4.\n[Renumbered 142B.01, subd 22]\n\"Individual who is related\" means a spouse, a parent, a birth or adopted child or stepchild, a stepparent, a stepbrother, a stepsister, a niece, a nephew, an adoptive parent, a grandparent, a sibling, an aunt, an uncle, or a legal guardian.\n(a) Except as provided in paragraph (b), \"residential program\" means a program that provides 24-hour-a-day care, supervision, food, lodging, rehabilitation, training, education, habilitation, or treatment outside a person's own home, including a program in an intermediate care facility for four or more persons with developmental disabilities; and substance use disorder or substance abuse programs that are located in a hospital or nursing home and receive public funds for providing substance abuse or substance use disorder treatment services under chapter 254B.\n(b) For a residential program under chapter 245D, \"residential program\" means a single or multifamily dwelling that is under the control, either directly or indirectly, of the service provider licensed under chapter 245D and in which at least one person receives services under chapter 245D, including residential supports and services under section 245D.03, subdivision 1, paragraph (c), clause (3); out-of-home crisis respite services under section 245D.03, subdivision 1, paragraph (c), clause (1), item (ii); and out-of-home respite services under section 245D.03, subdivision 1, paragraph (b), clause (1). A residential program does not include out-of-home respite services when a case manager has determined that an unlicensed site meets the assessed needs of the person. A residential program also does not include multifamily dwellings where persons receive integrated community supports, even if authorization to provide these supports is granted under chapter 245D and approved in the federal waiver.\n\"Respite care services\" means temporary services provided to a person due to the absence or need for relief of the primary caregiver, the person's family member, or legal representative who is the primary caregiver and principally responsible for the care and supervision of the person. Respite care services are those that provide the level of supervision and care that is necessary to ensure the health and safety of the person. Respite care services do not include services that are specifically directed toward the training and habilitation of the person.\n[Renumbered 142B.01, subd 25]\n[Renumbered 142B.01, subd 26]\n[Renumbered 142B.01, subd 27]\nFor the purposes of section 245A.25, \"trauma\" means an event, series of events, or set of circumstances experienced by an individual as physically or emotionally harmful or life-threatening and has lasting adverse effects on the individual's functioning and mental, physical, social, emotional, or spiritual well-being. Trauma includes the cumulative emotional or psychological harm of group traumatic experiences transmitted across generations within a community that are often associated with racial and ethnic population groups that have suffered major intergenerational losses.\n[Renumbered 142B.01, subd 13]\n\"Weekly\" means at least once every calendar week, for the purposes of substance use disorder treatment programs licensed under chapter 245G.\n\"Monthly\" means at least once every calendar month, for the purposes of substance use disorder treatment programs licensed under chapter 245G.\n\"Quarterly\" means at least every 90 calendar days, for the purposes of substance use disorder treatment programs licensed under chapter 245G.\nFor the purposes of section 245A.25, \"victim of sex trafficking or commercial sexual exploitation\" means a person who meets the definitions in section 260C.007, subdivision 31, clauses (4) and (5).\nFor the purposes of section 245A.25, \"youth\" means a child as defined in section 260C.007, subdivision 4, and includes individuals under 21 years of age who are in foster care pursuant to section 260C.451.",
	"repealed": false
}