{
	"id": "356B.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/356B.10",
	"title": "356B.10 PUBLIC PENSION FACILITIES.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Boards\" mean the Board of Directors of the Minnesota State Retirement System, the board of trustees of the Public Employees Retirement Association, and the board of trustees of the Teachers Retirement Association.\n(c) \"Commissioner\" means the commissioner of administration.\nThe commissioner of administration shall provide a building and related facilities to be jointly occupied by the board of directors of the Minnesota State Retirement System, the board of trustees of the Public Employees Retirement Association, and the board of trustees of the Teachers Retirement Association for the administration of their public pension systems.\n(a) Any land, building, or facility leased, constructed, or acquired and any leasehold interest acquired under this section must be held by the state in trust for the three retirement systems as tenants in common. Each retirement system fund must consider its interest as a fixed asset of its pension fund in accordance with governmental accounting standards.\n(b) The commissioner may lease to another governmental subdivision or to a private company under contract with the State Board of Investment or with the Board of Directors of the Minnesota State Retirement System, whichever applies, to provide deferred compensation services under section 352.965, any portion of the funds' building and lands that is not required for the direct use of the retirement systems upon terms and conditions that they deem to be in the best interest of the pension funds. Any income accruing from the rentals must be separately accounted for and utilized to offset ongoing administrative expenses and any excess must be carried forward as a reserve for future administrative expenses. The commissioner may also enter into lease agreements for the establishment of satellite offices if the retirement plan boards find them to be necessary in order to assure their members reasonable access to their services. The commissioner may lease under section 16B.24 any portion of the facilities not required for the direct use of the retirement plan boards.\n(c) The boards shall formulate, adopt, and periodically revise a written working agreement that sets forth the nature of each retirement system's ownership interest, the duties and obligations of each system toward the construction, operation, and maintenance costs of its facilities, and identifies one retirement fund to serve as manager for operating and maintenance purposes. The boards may contract with independent third parties for maintenance-related activities, services, and supplies, and may use the services of the Department of Administration where the boards determine that it is economically feasible to do so. If the boards cannot agree or cannot resolve a dispute about the operations or maintenance of the facilities, they may request the commissioner of administration to appoint a representative from the department's real estate management division to serve as arbitrator of the dispute with authority to issue a written resolution of the dispute.\n(a) The commissioner of management and budget may issue bonds for the purpose of refunding bonds issued under Minnesota Statutes 2001, section 356.89, subdivision 4. The bonds may be sold and issued on terms and in a manner the commissioner of management and budget determines to be in the best interests of the state.\n(b) The proceeds of the bonds must be credited to a bond proceeds account in the pension building fund which the commissioner of management and budget must create in the state treasury.\n(a) The boards may pledge any or all assets of the retirement fund or funds administered by the boards as security for the bonds.\n(b) The bonds and the interest on them must be paid solely from and secured by the assets of the boards pledged and appropriated for these purposes to the debt service fund created in subdivision 6 and any investment income on the fund and any reserve established for this purpose.\n(c) The bonds are not public debt, and the full faith, credit, and taxing powers of the state are not pledged for their payment. The bonds and the interest on them must not be paid, directly or indirectly, in whole or in part, from a tax of statewide application on any class of property, income, transaction, or privilege.\nThere is established in the state treasury a separate and special pension building debt service fund. Money in the funds managed by the boards is appropriated to the boards for transfer to the pension building debt service fund. Money appropriated and transferred to the fund and investment income on it on hand or required to be transferred to the fund must be used and is irrevocably appropriated to pay when due the principal of and interest on the bonds referenced in subdivision 4.\nThe covenants and agreements entered into by the commissioner of management and budget for the construction of the pension building that were not inconsistent with Minnesota Statutes 2001, section 356.89, subdivisions 1 to 6, and determined by the commissioner as necessary or desirable to facilitate the sale and issuance of the bonds on terms favorable to the state, including, but not limited to, covenants and agreements relating to the payment of and security for the bonds, tax exemption, and disclosure of information required by federal and state securities laws, constitute an enforceable contract of the state and by that contract the state pledges and agrees with the holders of any bonds that the state will not limit or alter the rights vested in the commissioner of management and budget to fulfill the terms of the covenants or agreements made with the holders of the bonds, or in any way impair the rights and remedies of the holders until the bonds, together with the interest on them, with interest on any unpaid installments of interest, and all costs and expenses in connection with any action or proceeding by or on behalf of the holders, are fully met and discharged. Sections 16A.672 and 16A.675 apply to the bonds.",
	"repealed": false
}