{
	"id": "354A.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.31",
	"title": "354A.31 COORDINATED PROGRAM RETIREMENT BENEFITS.",
	"text": "Any coordinated member or former coordinated member of the St. Paul Teachers Retirement Fund Association who has ceased to render teaching service for Independent School District No. 625, who is vested and who has either attained the age of at least 55 years or received credit for not less than 30 years of allowable service regardless of age, is entitled upon written application to a retirement annuity.\nApplication for a retirement annuity may be made by a member or by a person authorized to act on behalf of the member. Every application for retirement must be made in writing on a form prescribed by the executive secretary or director and must be substantiated by written proof of the member's age and identity. The notarized signature of a member's spouse on a retirement annuity application acknowledging the member's annuity selection meets the notice requirement to the spouse under section 356.46, subdivision 3. An application for a retirement annuity is not complete until all necessary supporting documents are received by the executive secretary or director.\nA coordinated member or former coordinated member may make application to the board of the teachers retirement fund association for a retirement annuity any time after the member has satisfied the age and service requirements specified in subdivision 1, but no application for retirement may be accepted by the board more than 60 days prior to the termination of teaching service. The retirement annuity shall begin to accrue after the occurrence of a retirement precondition event, which for purposes of this subdivision is the later of the termination of teaching service for the school district in which the teachers retirement fund association exists, the filing of an application for a retirement annuity with the board, or receipt of the final salary payment. Accrual shall commence on the sixteenth day of the month if the retirement precondition event occurs on or before the fifteenth day of that month or on the first day of the month next following if the retirement precondition event occurs on or after the sixteenth day of the month.\nIf an application for retirement is filed with the board during the 90-day period immediately following the termination of teaching service, the annuity may begin to accrue as if the application for retirement had been filed with the board on the date teaching service terminated. In no event may an annuity begin to accrue more than one month before the date of final salary receipt.\n(a) Any person who retired and is receiving a coordinated program retirement annuity under the provisions of sections 354A.31 to 354A.41 or any person receiving a basic program retirement annuity under the governing sections in the articles of incorporation or bylaws and who has resumed teaching service for the school district in which the teachers retirement fund association exists is entitled to continue to receive retirement annuity payments, except that all or a portion of the annuity payments must be deferred during the calendar year immediately following the calendar year in which the person's salary from the teaching service is in an amount greater than $46,000. The amount of the annuity deferral is one-third the salary amount in excess of $46,000 and must be deducted from the annuity payable for the calendar year immediately following the calendar year in which the excess amount was earned.\n(b) If the person is retired for only a fractional part of the calendar year during the initial year of retirement, the maximum reemployment salary exempt from triggering a deferral as specified in this subdivision must be prorated for that calendar year.\n(c) After a person has reached the Social Security normal retirement age, no deferral requirement is applicable regardless of the amount of any compensation received for teaching service for the school district in which the teachers retirement fund association exists.\n(d) The amount of the retirement annuity deferral must be handled or disposed of as provided in section 356.47.\n(e) Notwithstanding other paragraphs of this subdivision, for any retired St. Paul Teachers Retirement Fund Association basic or coordinated program member whose effective date of retirement is after June 30, 2013, amounts specified as deferred under this subdivision must instead be forfeited to the St. Paul Teachers Retirement Fund Association fund.\n(f) For the purpose of this subdivision, salary from teaching service includes: (i) all income for services performed as a consultant or independent contractor; or income resulting from working with the school district in any capacity; and (ii) the greater of either the income received or an amount based on the rate paid with respect to an administrative position, consultant, or independent contractor in the school district in which the teachers retirement fund association exists and at the same level as the position occupied by the person who resumes teaching service.\n(g) On or before February 15 of each year, each applicable employing unit shall report to the teachers retirement fund association the amount of postretirement salary as defined in this subdivision, earned as a teacher, consultant, or independent contractor during the previous calendar year by each retiree of the teachers retirement fund association for teaching service performed after retirement. The report must be in a format approved by the executive secretary or director.\n(a) The annuity reduction provisions of subdivision 3 do not apply to a person who:\n(1) retires from the technical college system with at least ten years of service credit in the system from which the person retires;\n(2) was employed on a full-time basis immediately preceding retirement as a technical college faculty member;\n(3) was not a recipient of an early retirement incentive under section 136F.481;\n(4) begins drawing an annuity from the teachers retirement fund association; and\n(5) returns to work on not less than a one-third time basis and not more than a two-thirds time basis in the technical college system under an agreement in which the person may not earn a salary of more than $62,000 in a calendar year through the technical college system.\n(b) Initial participation, the amount of time worked, and the duration of participation under this section must be mutually agreed upon by the employer and the employee. The employer may require up to a one-year notice of intent to participate in the program as a condition of participation under this section. The employer shall determine the time of year the employee shall work.\n(c) Notwithstanding any law to the contrary, a person eligible under paragraphs (a) and (b) may not earn further service credit in the teachers retirement fund association and is not eligible to participate in the individual retirement account plan or the supplemental retirement plan established in chapter 354B as a result of service under this section. No employer or employee contribution to any of these plans may be made on behalf of such a person.\n(a) This subdivision applies to the coordinated program of the St. Paul Teachers Retirement Fund Association.\n(b) The normal coordinated retirement annuity is an amount equal to a retiring coordinated member's average salary under section 354A.011, subdivision 7a, multiplied by the retirement annuity formula percentage.\n(c) This paragraph, in conjunction with subdivision 6, applies to a person who first became a member or a member in a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, unless paragraph (d), in conjunction with subdivision 7, produces a higher annuity amount, in which case paragraph (d) will apply. For service rendered before July 1, 2015, the retirement annuity formula percentage for purposes of this paragraph is 1.2 percent per year for each year of coordinated service for the first ten years and 1.7 percent for each year of coordinated service thereafter. For service rendered after June 30, 2015, the retirement annuity formula percentage for purposes of this paragraph is 1.4 percent per year for each year of coordinated service for the first ten years and 1.9 percent for each year of coordinated service thereafter.\n(d) This paragraph applies to a person who has become at least 55 years old and who first becomes a member after June 30, 1989, and to any other member who has become at least 55 years old and whose annuity amount, when calculated under this paragraph and in conjunction with subdivision 7 is higher than it is when calculated under paragraph (c), in conjunction with the provisions of subdivision 6. The retirement annuity formula percentage for purposes of this paragraph is 1.7 percent for each year of coordinated service rendered before July 1, 2015, and 1.9 percent for each year of coordinated service thereafter.\n[Repealed, 2014 c 296 art 6 s 48]\nUpon retirement at normal retirement age, a vested coordinated member is entitled to a normal retirement annuity calculated under subdivision 4.\nIf a member retires on or after July 1, 2023, when the member is at least age 62 and has at least 30 years of service, the member is entitled to receive a retirement annuity calculated using the retirement annuity formula percentage in subdivision 4.\n(a) This subdivision applies only to a person who first became a coordinated member or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, and whose annuity is higher when calculated using the retirement annuity formula percentage in subdivision 4, paragraph (c), in conjunction with this subdivision than when calculated under subdivision 4, paragraph (d), in conjunction with subdivision 7.\n(b) Upon retirement at an age before normal retirement age or prior to age 62 with at least 30 years of service credit, a vested coordinated member shall be entitled to a retirement annuity in an amount equal to the normal retirement annuity calculated using the retirement annuity formula percentage in subdivision 4, paragraph (c), reduced by one-quarter of one percent for each month that the coordinated member is under normal retirement age if the coordinated member has less than 30 years of service credit or is under the age of 62 if the coordinated member has at least 30 years of service credit.\n(c) Any coordinated member whose attained age plus credited allowable service totals 90 years is entitled, upon application, to a retirement annuity in an amount equal to the normal retirement annuity calculated using the retirement annuity formula percentage in subdivision 4, paragraph (c), without any reduction by reason of early retirement.\n(a) This subdivision applies to a person who has become at least 55 years old and first becomes a coordinated member after June 30, 1989, and to any other coordinated member who has become at least 55 years old and whose annuity is higher when calculated using the retirement annuity formula percentage in subdivision 4, paragraph (d), in conjunction with this subdivision than when calculated under subdivision 4, paragraph (c), in conjunction with subdivision 6. An employee who retires under the formula annuity before the normal retirement age shall be paid the normal annuity reduced as described in paragraph (b) if the person retires on or after July 1, 2019, or in paragraph (c) if the person retires before July 1, 2019, as applicable.\n(b) (1) Unless the member is eligible for an unreduced early retirement annuity under subdivision 5a, a coordinated member who retires before the normal retirement age and on or after July 1, 2019, is entitled to receive a retirement annuity calculated using the retirement annuity formula percentage in subdivision 4, paragraph (d), reduced as described in clause (2).\n(2) If the member retires when the member is younger than age 62 or with fewer than 30 years of service, the annuity must be reduced by an early reduction factor for each year that the member's age of retirement precedes normal retirement age. The early reduction factors are four percent per year for members whose age at retirement is at least 55 but not yet 59 and seven percent per year for members whose age at retirement is at least 59 but not yet normal retirement age. The resulting annuity must be further adjusted to take into account augmentation as if the employee had deferred receipt of the annuity until normal retirement age and the annuity were augmented at the applicable annual rate, compounded annually, from the day the annuity begins to accrue until normal retirement age. The applicable annual rate is the rate in effect on the employee's effective date of retirement and shall be considered as fixed for the employee. The applicable annual rates are the following:\n(i) until June 30, 2019, 2.5 percent;\n(ii) a rate that changes each month, beginning July 1, 2019, through June 30, 2024, which is determined by reducing the rate in item (i) to zero in equal monthly increments over the five-year period; and\n(iii) after June 30, 2024, zero percent.\nAfter June 30, 2024, the reduced annuity commencing before normal retirement age under this clause shall not take into account any augmentation.\n(c) Unless the member is eligible for an unreduced early retirement annuity under subdivision 5a, a coordinated member who retires before the normal retirement age and before July 1, 2019, is entitled to receive a retirement annuity calculated using the retirement annuity formula percentage in subdivision 4, paragraph (d), multiplied by the applicable early retirement factor specified below:\nFor normal retirement ages between ages 65 and 66, the early retirement factors must be determined by linear interpolation between the early retirement factors applicable for normal retirement ages 65 and 66.\nAn employee who returns to covered service following a termination and who is not receiving a retirement annuity under this section must have earned at least 85 days of credited service following the return to covered service to be eligible for improved benefits resulting from any law change enacted subsequent to that termination.",
	"repealed": false
}