{
	"id": "412.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.081",
	"title": "412.081 SEPARATION FROM TOWN.",
	"text": "Any statutory city hereafter organized shall be constituted an election and assessment district separate from the town in which it lies immediately upon incorporation, except that if the incorporation occurs between March 15 and July 1 the town assessor shall assess the property in the city that year and the city assessor shall not assume duties until the following year. Where the town assessor makes the assessment, the city shall pay such proportion of the cost of the assessment as its net tax capacity bears to the net tax capacity of the town, including the city.\nAny existing city not heretofore constituted a separate election and assessment district may become such by the vote of a majority of its electors casting their ballots upon the question at a special election called for that purpose or at a general election in the notice of which the question is plainly submitted. The council may submit the question of separation to the electors on its own motion and shall do so upon presentation of a petition of electors equal in number to 25 percent of those voting at the last preceding city election. A certificate giving the result of the vote shall be presented by the judges of election to the council. The clerk shall then file a similar certificate with the county auditor of the county in which the city is situated, and, if the election is favorable to separation, the clerk shall file a copy with the secretary of state. The separation shall take effect 30 days from the date of the election. The council shall then appoint an assessor to serve until the first business day of January in the next odd-numbered year.\nUpon separation of an existing city from the town or upon incorporation of a city hereafter, if there is any money in the town treasury in excess of its then floating indebtedness, such proportion of the excess as the total net tax capacity of the real and personal property within the city bears to the entire net tax capacity of the town, including the city, shall belong to the city and shall be paid to the city treasurer by the town treasurer. All town taxes levied upon property within the city before separation and not yet collected or not yet distributed by the county treasurer shall be paid to the city when so distributed. If the town has any bonded debt, the property within the city shall continue to be taxed to retire the bonds and to pay the interest thereon until the bonds are fully paid. Any personal property belonging to the town at the time of separation, and any real estate situated within the city and belonging to the town at that time shall remain the joint property of the city and town with the interest of each being proportional to its net tax capacity at the time of separation; but either the city or the town may purchase the interest of the other in such real or personal property and become its sole owner. Meetings and elections of the town may be held in the city and any town officer may maintain an office in the city notwithstanding such separation.",
	"repealed": false
}