{
	"id": "325E.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.33",
	"title": "325E.33 MISCONDUCT OF ATHLETIC AGENTS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Student athlete\" means a person who engages in, is eligible to engage in, or may be eligible to engage in any intercollegiate sporting event, contest, exhibition, or program. The term includes any individual who may be eligible to engage in collegiate sports in the future.\n(c) \"Athletic director\" means the person discharging the duties of coordinating and administering the overall athletic program for the educational institution attended by the student athlete.\n(d) \"Educational institution\" means the public or private high school, college, junior college, or university that the student athlete last attended or to which the student athlete has expressed written intention to attend.\nA student athlete's waiver of intercollegiate athletic eligibility is not effective until the waiver of eligibility form prescribed by this subdivision has been filed with the Offices of the Secretary of State and the athletic director for seven days. The waiver is considered to have been on file seven days as of the eighth day after the receipt by the Offices of the Secretary of State and the athletic director of the completed waiver of eligibility form prescribed by this subdivision. The original waiver is to be filed with the secretary of state and must be available for public inspection in the Office of the Secretary of State during normal business hours. The waiver form must provide:\n\"WAIVER OF INTERCOLLEGIATE ATHLETIC ELIGIBILITY\nI, ......................, hereby waive any and all intercollegiate athletic eligibility. This waiver is not effective until seven days after it has been received by the Minnesota secretary of state and the office of the athletic director.\nThis waiver is revocable until my intercollegiate athletic eligibility is terminated as a result of my entering either a contract with an athletic agent or a professional sports contract.\n.......................\nSTUDENT ATHLETE\n.......................\nEDUCATIONAL INSTITUTION\n.......................\nDATE\"\nA person may not, before the effective date of a student athlete's waiver of intercollegiate athletic eligibility, enter into a contract, written or oral, with a student athlete to:\n(1) serve as the agent of the student athlete in obtaining a professional sports contract; or\n(2) represent the student athlete or a professional sports organization in obtaining a professional sports contract for or with a student athlete.\nA person who violates this subdivision is subject to the remedies under section 8.31, except that a civil penalty imposed under that section may be not more than $100,000, or three times the amount given, offered, or promised as an inducement for the student athlete to enter the agency contract or professional sports contract, exclusive of the compensation provided by the professional sports contract, whichever is greater.\nA person may not offer, give, or promise to give an employee of an educational institution, directly or indirectly, any benefit, reward, or consideration to which the employee is not legally entitled, with the intent that:\n(1) the employee will influence a student athlete to enter into a contract with the person to serve as the athlete's agent or to enter into a professional sports contract; or\n(2) the employee will refer student athletes to the person.\nA person who violates this subdivision is subject to the remedies under section 8.31, except that a civil penalty imposed under that section may be not more than $100,000, or three times the value offered to the employee in violating this subdivision, whichever is greater.\nA contract entered into in violation of subdivision 3 is voidable by the student athlete. If voided by the student athlete, the athletic agent shall return to the student athlete any compensation received under the contract. The athletic agent shall also pay reasonable attorney's fees and costs incurred by a student athlete in any action or defense under this subdivision.",
	"repealed": false
}