{
	"id": "148.513",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.513",
	"title": "148.513 LICENSURE; PROTECTED TITLES AND RESTRICTIONS ON USE; EXEMPTIONS.",
	"text": "A person must not engage in the practice of speech-language pathology or audiology or practice as a speech-language pathology assistant unless the person is licensed as a speech-language pathologist, an audiologist, or a speech-language pathology assistant under sections 148.511 to 148.5198. For purposes of this subdivision, a speech-language pathology assistant's duties are limited to the duties described in accordance with section 148.5192, subdivision 2.\n[See Note.]\n(a) Notwithstanding paragraph (c), the use of the following terms or initials which represent the following terms, alone or in combination with any word or words, by any person to form an occupational title is prohibited unless that person is licensed as a speech-language pathologist or audiologist under sections 148.511 to 148.5198:\n(1) speech-language;\n(2) speech-language pathologist, S, SP, or SLP;\n(3) speech pathologist;\n(4) language pathologist;\n(5) audiologist, A, or AUD;\n(6) speech therapist;\n(7) speech clinician;\n(8) speech correctionist;\n(9) language therapist;\n(10) voice therapist;\n(11) voice pathologist;\n(12) logopedist;\n(13) communicologist;\n(14) aphasiologist;\n(15) phoniatrist;\n(16) audiometrist;\n(17) audioprosthologist;\n(18) hearing therapist;\n(19) hearing clinician; or\n(20) hearing aid audiologist.\n(b) Use of the term \"Minnesota licensed\" in conjunction with the titles protected under paragraph (a) by any person is prohibited unless that person is licensed as a speech-language pathologist or audiologist under sections 148.511 to 148.5198.\n(c) A speech-language pathology assistant practicing under sections 148.511 to 148.5198 must not represent, indicate, or imply to the public that the assistant is a licensed speech-language pathologist and shall only utilize the titles provided in subdivision 2b.\n[See Note.]\nAn audiologist must not hold out as a licensed hearing aid dispenser.\n(a) The use of the following terms or initials which represent the following terms, alone or in combination with any word or words, by any person to form an occupational title is prohibited unless that person is licensed under section 148.5181:\n(1) speech-language pathology assistant;\n(2) SLP assistant; or\n(3) SLP asst.\n(b) Use of the term \"Minnesota licensed\" in conjunction with the titles protected under this subdivision by any person is prohibited unless that person is licensed under section 148.5181.\n(c) A speech-language pathology assistant practicing under section 148.5192 must not represent, indicate, or imply to the public that the assistant is a licensed speech-language pathologist and must only utilize the title provided in paragraph (a).\n[See Note.]\n(a) Nothing in sections 148.511 to 148.5198 prohibits the practice of any profession or occupation licensed, certified, or registered by the state by any person duly licensed, certified, or registered to practice the profession or occupation or to perform any act that falls within the scope of practice of the profession or occupation.\n(b) Subdivision 1 does not apply to a student participating in supervised field work or supervised course work that is necessary to meet the requirements of section 148.515, subdivision 2, or 148.5181, subdivision 2, if the person is designated by a title which clearly indicates the person's status as a student trainee.\n(c) Subdivisions 1, 2, and 2a do not apply to a person visiting and then leaving the state and using titles restricted under this section while in the state, if the titles are used no more than 30 days in a calendar year as part of a professional activity that is limited in scope and duration and is in association with an audiologist or speech-language pathologist licensed under sections 148.511 to 148.5198.\n[See Note.]\nNothing in sections 148.511 to 148.5198 shall preclude licensed audiologists from dispensing or selling over-the-counter hearing aids.",
	"repealed": false
}