{
	"id": "308A.705",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.705",
	"title": "308A.705 DISTRIBUTION OF INCOME.",
	"text": "Net income in excess of dividends on capital stock, nonstock units of equity, and additions to reserves shall be distributed on the basis of patronage. A cooperative may establish allocation units, whether the units are functional, divisional, departmental, geographic, or otherwise, and pooling arrangements and may account for and distribute net income on the basis of allocation units and pooling arrangements. A cooperative may offset the net loss of an allocation unit or pooling arrangement against the net income of other allocation units or pooling arrangements to the extent permitted by section 1388(j) of the Internal Revenue Code of 1986, as amended through December 31, 1996.\n(a) Distribution of net income shall be made at least annually.\n(b) A cooperative with income from trucking operations may only distribute net income annually. The board shall present to the members at their annual meeting a report covering the operations of the cooperative during the preceding fiscal year.\nDividends may be paid on common stock and nonstock units of equity only if the net income of the cooperative for the previous fiscal year is sufficient. Unless otherwise provided in the articles of incorporation, the dividends are not cumulative.\nA cooperative may distribute net income in cash, capital stock credits, allocated patronage equities, revolving fund certificates, or its own or other securities.\n(a) The members may provide in the bylaws that nonmember patrons are allowed to participate in the distribution of net income on equal terms with member patrons.\n(b) If a nonmember patron is qualified and eligible for membership, the amount of patronage refund due shall be credited to the patron's individual account.\n(c) If the credits equal the value of a share of common stock that entitles the stockholder to vote, or a membership, a share of stock or a membership shall be issued to the nonmember patron.\nIf a nonmember patron with patronage credits is not qualified or eligible for membership, a refund due may be credited to the patron's individual account. If the credited amount in the individual account of a patron ineligible for membership equals the value of a share of common stock and does not entitle the holder to vote, or to preferred stock or a certificate of interest, the board may issue a share of preferred stock or a certificate of interest. After the patron is issued preferred stock or a certificate of interest, the patron may participate in the distribution of income on the same basis as a stockholder or member.",
	"repealed": false
}