{
	"id": "3C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/3C.10",
	"title": "3C.10 PUBLICATION POWERS.",
	"text": "The revisor's office, in preparing printer's copy for editions of statutes, may not alter the sense, meaning, or effect of any legislative act, but may:\n(a) renumber sections or subdivisions and parts of sections or subdivisions;\n(b) change the wording of headnotes;\n(c) rearrange sections or subdivisions;\n(d) combine sections or subdivisions into other sections or other subdivisions, or both;\n(e) divide sections or subdivisions into other sections or subdivisions so as to give to distinct subject matters a section or subdivision number;\n(f) substitute the proper section, chapter, or subdivision numbers for the terms \"this act,\" \"the preceding section,\" and the like;\n(g) substitute figures for written words and vice versa;\n(h) substitute the date on which the law becomes effective for the words \"the effective date of this act,\" and the like;\n(i) change capitalization for the purpose of uniformity;\n(j) correct manifest clerical, typographical, grammatical, or punctuation errors;\n(k) correct words misspelled in enrollments;\n(l) change reference numbers to agree with renumbered chapters, sections, or subdivisions;\n(m) delete the phrases \"Minnesota Statutes,\" \"Minnesota Statutes 1980,\" and phrases identifying other editions of and supplements to Minnesota Statutes if the phrases are used in a reference to a statutory section;\n(n) replace gender specific words with gender neutral words and, if necessary, recast the sentences containing gender specific words; and\n(o) make similar editorial changes to ensure the accuracy and utility of the publication.\nThe revisor's office may integrate agency rules into Minnesota Statutes, or publish the rules as an adjunct to Minnesota Statutes, or coordinate publication of the rules with Minnesota Statutes.\nThe revisor's office may negotiate for all or part of the editing, indexing, compiling, and printing of Minnesota Statutes, supplements to Minnesota Statutes, and Laws of Minnesota and contract with a law book publisher for these services. The provisions of chapter 16C as they relate to competitive bidding do not apply to these contracts. No contract may be made until the revisor of statutes has consulted with the Legislative Coordinating Commission. Failure or refusal of the commission to make a recommendation promptly shall be deemed an affirmative recommendation.",
	"repealed": false
}