{
	"id": "120B.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.22",
	"title": "120B.22 VIOLENCE PREVENTION EDUCATION.",
	"text": "(a) The commissioner of education, in consultation with the commissioners of health and human services, state minority councils, battered women's and domestic abuse programs, battered women's shelters, sexual assault centers, representatives of religious communities, and the assistant commissioner of the Office of Drug Policy and Violence Prevention, shall assist districts on request in developing or implementing a violence prevention program for students in kindergarten to grade 12 that can be integrated into existing curriculum. The purpose of the program is to help students learn how to resolve conflicts within their families and communities in nonviolent, effective ways.\n(b) Each district is encouraged to integrate into its existing curriculum a program for violence prevention that includes at least:\n(1) a comprehensive, accurate, and age appropriate curriculum on violence prevention, nonviolent conflict resolution, sexual, racial, and cultural harassment, self-protection, and student hazing that promotes equality, respect, understanding, effective communication, individual responsibility, thoughtful decision making, positive conflict resolution, useful coping skills, critical thinking, listening and watching skills, and personal safety;\n(2) planning materials, guidelines, and other accurate information on preventing physical and emotional violence, identifying and reducing the incidence of sexual, racial, and cultural harassment, and reducing child abuse and neglect;\n(3) a special parent education component of early childhood family education programs to prevent child abuse and neglect and to promote positive parenting skills, giving priority to services and outreach programs for at-risk families;\n(4) involvement of parents and other community members, including the clergy, business representatives, civic leaders, local elected officials, law enforcement officials, and the county attorney;\n(5) collaboration with local community services, agencies, and organizations that assist in violence intervention or prevention, including family-based services, crisis services, life management skills services, case coordination services, mental health services, and early intervention services;\n(6) collaboration among districts and service cooperatives;\n(7) targeting early adolescents for prevention efforts, especially early adolescents whose personal circumstances may lead to violent or harassing behavior;\n(8) opportunities for teachers to receive in-service training or attend other programs on strategies or curriculum designed to assist students in intervening in or preventing violence in school and at home; and\n(9) administrative policies that reflect, and a staff that models, nonviolent behaviors that do not display or condone sexual, racial, or cultural harassment or student hazing.\n(c) The department may provide assistance at a neutral site to a nonpublic school participating in a district's program.\nEach district is encouraged to provide training for district staff and school board members on the following:\n(1) helping students identify violence in the family and the community so that students may learn to resolve conflicts in effective, nonviolent ways;\n(2) responding to a disclosure of child sexual abuse in a supportive, appropriate manner; and\n(3) complying with mandatory reporting requirements under chapter 260E.\nThe in-service training must be ongoing and involve experts familiar with sexual abuse, domestic violence, and personal safety issues.\nDistricts may accept funds from public and private sources for violence prevention programs developed and implemented under this section.",
	"repealed": false
}