{
	"id": "11A.236",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.236",
	"title": "11A.236 ACCOUNT TO INVEST FINANCIAL ASSURANCE MONEY FROM PERMITS TO MINE.",
	"text": "(a) The State Board of Investment, when requested by the commissioner of natural resources, may invest money collected by the commissioner as part of financial assurance provided under a permit to mine issued under chapter 93. The State Board of Investment may establish one or more accounts into which money may be deposited for the purposes of this section, subject to the policies and procedures of the State Board of Investment. Use of any money in the account is restricted to the financial assurance purposes identified in sections 93.46 to 93.51 and rules adopted thereunder and as authorized under any trust fund agreements or other conditions established under a permit to mine.\n(b) Money in an account established under paragraph (a) is appropriated to the commissioner of natural resources for the purposes for which the account is established under this section.\n(a) The commissioner of natural resources may deposit money in the appropriate account and may withdraw money from the appropriate account for the financial assurance purposes identified in sections 93.46 to 93.51 and rules adopted thereunder and as authorized under any trust fund agreements or other conditions established under the permit to mine for which the financial assurance is provided, subject to the policies and procedures of the State Board of Investment.\n(b) Investment strategies related to an account established under this section must be determined jointly by the commissioner of natural resources and the executive director of the State Board of Investment. The authorized investments for an account are the investments authorized under section 11A.24 that are made available for investment by the State Board of Investment.\n(c) Investment transactions must be at a time and in a manner determined by the executive director of the State Board of Investment. Decisions to withdraw money from the account must be determined by the commissioner of natural resources, subject to the policies and procedures of the State Board of Investment. Investment earnings must be credited to the appropriate account for financial assurance under the identified permit to mine.\n(d) The commissioner of natural resources may terminate an account at any time, so long as the termination is in accordance with applicable statutes, rules, trust fund agreements, or other conditions established under the permit to mine, subject to the policies and procedures of the State Board of Investment.",
	"repealed": false
}