{
	"id": "436.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/436.06",
	"title": "436.06 JOINT MUNICIPAL POLICE DEPARTMENTS.",
	"text": "Two or more adjacent cities may, by agreement entered into through action of their governing bodies, establish, equip, and operate a joint municipal police department to protect and safeguard life and property and to furnish police protection in the municipalities entering into the agreement. Any such agreement shall comply with section 471.59 relating to the joint or cooperative exercise of powers by two or more governmental units.\nUpon execution of an agreement to establish, equip, and operate a joint municipal police department the governing bodies of all participating municipalities shall meet in joint session and thereafter hold joint sessions from time to time for the purpose of organizing and supervising the administration of such a department and establishing rules and regulations for the government of the same. In lieu of joint sessions the agreement may provide for a board of police commissioners to control and supervise the administration of the joint department. Each municipality entering into the agreement shall be entitled to representation on the board as the agreement may provide, but otherwise the organization, composition, selection, removal, and powers delegated to the board shall be as specified in the agreement. Subject to the authority of a joint police civil service commission, if one is established under subdivision 3, the board of police commissioners may be given the power to appoint, promote, suspend, and remove officers and employees of the joint department.\nThe agreement may also provide for a joint police civil service commission. If a joint police civil service commission is established each municipality shall be entitled to representation on the commission as the agreement may provide, but otherwise the organization, composition, selection, and removal of members of the joint police civil service commission shall be as specified in the agreement. Except as otherwise provided in this subdivision, sections 419.01 to 419.181 and acts amendatory thereof relating to police civil service commissions shall apply to and govern the commission. If the agreement provides for a joint police civil service commission, any existing police civil service commission in any municipality which becomes a party to the agreement is automatically abolished upon the effective date thereof.\nAny person regularly employed as a police officer in any municipality entering into a joint municipal police department agreement shall automatically become an officer of the joint police department unless the person refuses to accept such employment. Except for layoffs due to reduction in force made in accordance with civil service law and rules any such officer regularly employed in a police department under a civil service or merit system at the time of becoming an officer of the joint department shall not be removed or discharged except for cause upon written charges and after an opportunity to be heard in defense of the charges; but the rank and grade of such officers and of any other officers who automatically become officers in the joint department shall be as determined in the agreement.\nPolice officers of a joint municipal police department are peace officers and shall have all the powers of peace officers in each municipality participating in a joint police department agreement.\nThis section shall not apply to any cities or statutory cities located in counties containing a city of the first class unless otherwise authorized by law to maintain a joint municipal police department.",
	"repealed": false
}