{
	"id": "142A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.29",
	"title": "142A.29 WORK REPORTING SYSTEM.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Date of hiring\" means the earlier of: (1) the first day for which an employee is owed compensation by an employer; or (2) the first day that an employee reports to work or performs labor or services for an employer.\n(c) \"Earnings\" means payment owed by an employer for labor or services rendered by an employee.\n(d) \"Employee\" means a person who resides or works in Minnesota, performs services for compensation, in whatever form, for an employer and satisfies the criteria of an employee under chapter 24 of the Internal Revenue Code. Employee does not include:\n(1) persons hired for domestic service in the private home of the employer, as defined in the Federal Tax Code; or\n(2) an employee of the federal or state agency performing intelligence or counterintelligence functions, if the head of such agency has determined that reporting according to this law would endanger the safety of the employee or compromise an ongoing investigation or intelligence mission.\n(e) \"Employer\" means a person or entity located or doing business in this state that employs one or more employees for payment, and satisfies the criteria of an employer under chapter 24 of the Internal Revenue Code. Employer includes a labor organization as defined in paragraph (g). Employer also includes the state, political or other governmental subdivisions of the state, and the federal government.\n(f) \"Hiring\" means engaging a person to perform services for compensation and includes the reemploying or return to work of any previous employee who was laid off, furloughed, separated, granted a leave without pay, or terminated from employment when a period of 60 days elapses from the date of layoff, furlough, separation, leave, or termination to the date of the person's return to work.\n(g) \"Labor organization\" means entities located or doing business in this state that meet the criteria of labor organization under section 2(5) of the National Labor Relations Act. This includes any entity, that may also be known as a hiring hall, used to carry out requirements described in chapter 7 of the National Labor Relations Act.\n(h) \"Payor\" means a person or entity located or doing business in Minnesota who pays money to an independent contractor according to an agreement for the performance of services.\nThe commissioner of children, youth, and families shall establish a centralized work reporting system for the purpose of receiving and maintaining information from employers on newly hired or rehired employees. The commissioner of children, youth, and families shall take reasonable steps to inform the state's employers of the requirements of this section and the acceptable processes by which employers can comply with the requirements of this section.\nEmployers doing business in this state shall report to the commissioner of children, youth, and families the hiring of any employee who resides or works in this state to whom the employer anticipates paying earnings. Employers shall submit reports required under this subdivision within 20 calendar days of the date of hiring of the employee.\nEmployers are not required to report the hiring of any person who will be employed for less than two months' duration; and will have gross earnings less than $250 per month.\nEmployers may report by delivering, mailing, or telefaxing a copy of the employee's federal W-4 form or W-9 form or any other document that contains the required information, submitting electronic media in a compatible format, toll-free telecommunication, or other means authorized by the commissioner of children, youth, and families that will result in timely reporting.\nReports required under this section must contain all the information required by federal law.\nIf an employer fails to report under this section, the commissioner of children, youth, and families, by certified mail, shall send the employer a written notice of noncompliance requesting that the employer comply with the reporting requirements of this section. The notice of noncompliance must explain the reporting procedure under this section and advise the employer of the penalty for noncompliance. An employer who has received a notice of noncompliance and later incurs a second violation is subject to a civil penalty of $25 for each intentionally unreported employee. An employer who has received a notice of noncompliance is subject to a civil penalty of $500 for each intentionally unreported employee, if noncompliance is the result of a conspiracy between an employer and an employee not to supply the required report or to supply a false or incomplete report. These penalties may be imposed and collected by the commissioner of children, youth, and families. An employer who has been served with a notice of noncompliance and incurs a second or subsequent violation resulting in a civil penalty, has the right to a contested case hearing under chapter 14. An employer has 20 days from the date of service of the notice, to file a request for a contested case hearing with the commissioner. The order of the administrative law judge constitutes the final decision in the case.\nThe commissioner of children, youth, and families shall retain the information reported to the work reporting system for a period of six months. Data in the work reporting system may be disclosed to the commissioner of children, youth, and families; the public authority responsible for child support enforcement; federal agencies; state and local agencies of other states for the purposes of enforcing state and federal laws governing child support; and agencies responsible for the administration of programs under title IV-A of the Social Security Act, the Department of Employment and Economic Development, and the Department of Labor and Industry.\nThe commissioner may contract for services to carry out this section.\nThe state and all political subdivisions of the state, when acting in the capacity of an employer, shall report the hiring of any person as an independent contractor to the centralized work reporting system in the same manner as the hiring of an employee is reported.\nOther payors may report independent contractors to whom they make payments that require the filing of a 1099-MISC report. Payors reporting independent contractors shall report by use of the same means and provide the same information required under subdivisions 4 and 5. The commissioner of children, youth, and families shall establish procedures for payors reporting under this section.\nThe commissioner of children, youth, and families is authorized to use information from the work reporting system to determine eligibility for applicants and recipients of public assistance programs administered by the Department of Children, Youth, and Families. Data including names, dates of birth, and Social Security numbers of people applying for or receiving public assistance benefits will be compared to the work reporting system information to determine if applicants or recipients of public assistance are employed. County agencies will be notified of discrepancies in information obtained from the work reporting system.\nUpon receipt of the discrepant information, county agencies will notify clients of the information and request verification of employment status and earnings. County agencies must attempt to resolve the discrepancy within 45 days of receipt of the information.\nPersons applying for public assistance programs administered by the Department of Children, Youth, and Families will be notified at the time of application that data including their name, date of birth, and Social Security number will be shared with the work reporting system to determine possible employment. All current public assistance recipients will be notified of this provision prior to its implementation.",
	"repealed": false
}