{
	"id": "256L.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/256L.09",
	"title": "256L.09 RESIDENCY.",
	"text": "The legislature finds that the enactment of a comprehensive health plan for uninsured Minnesotans creates a risk that persons needing medical care will migrate to the state for the primary purpose of obtaining medical care subsidized by the state. The risk of migration undermines the state's ability to provide to legitimate state residents a valuable and necessary health care program which is an important component of the state's comprehensive cost containment and health care system reform plan. Intent-based residency requirements, which are expressly authorized under decisions of the United States Supreme Court, are an unenforceable and ineffective method of denying benefits to those persons the Supreme Court has stated may legitimately be denied eligibility for state programs. If the state is unable to limit eligibility to legitimate permanent residents of the state, the state faces a significant risk that it will be forced to reduce the eligibility and benefits it would otherwise provide to Minnesotans. The legislature finds that a durational residence requirement is a legitimate, objective, enforceable standard for determining whether a person is a permanent resident of the state. The legislature also finds low-income persons who have not lived in the state for the required time period will have access to necessary health care services through the medical assistance program and public and private charity care programs.\nTo be eligible for health coverage under the MinnesotaCare program, individuals and families with children must meet the residency requirements as provided by Code of Federal Regulations, title 42, section 435.403.\n[Repealed, 1998 c 407 art 5 s 48]\n(a) For purposes of this section, a permanent Minnesota resident is a person who has demonstrated, through persuasive and objective evidence, that the person is domiciled in the state and intends to live in the state permanently.\n(b) To be eligible as a permanent resident, an applicant must demonstrate the requisite intent to live in the state permanently by:\n(1) showing that the applicant maintains a residence at a verified address, through the use of evidence of residence described in section 256D.02, subdivision 12a, paragraph (b), clause (2);\n(2) demonstrating that the applicant has been continuously domiciled in the state for no less than 180 days immediately before the application; and\n(3) signing an affidavit declaring that (A) the applicant currently resides in the state and intends to reside in the state permanently; and (B) the applicant did not come to the state for the primary purpose of obtaining medical coverage or treatment.\n(c) A person who is temporarily absent from the state does not lose eligibility for MinnesotaCare. \"Temporarily absent from the state\" means the person is out of the state for a temporary purpose and intends to return when the purpose of the absence has been accomplished. A person is not temporarily absent from the state if another state has determined that the person is a resident for any purpose. If temporarily absent from the state, the person must follow the requirements of the health plan in which the person is enrolled to receive services.\nAn individual or family that moved to Minnesota primarily to obtain medical treatment or health coverage for a preexisting condition is not a permanent resident.\nIf the 180-day requirement in subdivision 4, paragraph (b), clause (2), is determined by a court to be unconstitutional, the commissioner of human services shall impose a 12-month preexisting condition exclusion on coverage for persons who have been domiciled in the state for less than 180 days.\nIf any paragraph, sentence, clause, or phrase of this section is for any reason determined by a court to be unconstitutional, the decision shall not affect the validity of the remaining portions of the section. The legislature declares that it would have passed each paragraph, sentence, clause, and phrase in this section, irrespective of the fact that any one or more paragraphs, sentences, clauses, or phrases is declared unconstitutional.",
	"repealed": false
}