{
	"id": "308B.545",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.545",
	"title": "308B.545 MEMBER VOTING RIGHTS.",
	"text": "A patron member of a cooperative is only entitled to one vote on an issue to be voted upon by members holding patron membership interests, except that if authorized in the articles or bylaws a patron member may be entitled to additional votes based on patronage criteria in section 308B.551. On any matter of the cooperative, the entire patron members voting power shall be voted collectively based upon the vote of the majority of patron members voting on the issue and the collective vote of the patron members shall be a majority of the vote cast unless otherwise provided in the bylaws. The bylaws may not reduce the collective patron member vote to less than 15 percent of the total vote on matters of the cooperative. A nonpatron member has the voting rights in accordance to his nonpatron membership interests as granted in the bylaws, subject to the provisions of this chapter.\nA member or delegate may exercise voting rights on any matter that is before the members as prescribed in the articles or bylaws at a members' meeting from the time the member or delegate arrives at the members' meeting, unless the articles or bylaws specify an earlier and specific time for closing the right to vote.\nA member's vote at a members' meeting shall be in person or by mail if a mail vote is authorized by the board or by alternative method if authorized by the board and not by proxy, except as provided in subdivision 4.\n(a) The provisions of this subdivision apply to members represented by delegates.\n(b) A cooperative may provide in the articles or bylaws that units or districts of members are entitled to be represented at members' meetings by delegates chosen by the members of the unit or district. The delegates may vote on matters at the members' meeting in the same manner as a member. The delegates may only exercise the voting rights on a basis and with the number of votes as prescribed in the articles or bylaws.\n(c) If the approval of a certain portion of the members is required for adoption of amendments, a dissolution, a merger, a consolidation, or a sale of assets, the votes of delegates shall be counted as votes by the members represented by the delegate.\n(d) Patron members may be represented by the proxy of other patron members.\n(e) Nonpatron members may be represented by proxy if authorized in the bylaws.\n(a) The provisions of this subdivision apply to absentee ballots.\n(b) A member who is or will be absent from a members' meeting may vote by mail or by an approved alternative method on the ballot prescribed in this subdivision on any motion, resolution, or amendment that the board submits for vote by mail or alternative method to the members.\n(c) The ballot shall be in the form prescribed by the board and contain:\n(1) the exact text of the proposed motion, resolution, or amendment to be acted on at the meeting; and\n(2) the text of the motion, resolution, or amendment for which the member may indicate an affirmative or negative vote.\n(d) The member shall express a choice by marking an appropriate choice on the ballot and mail, deliver, or otherwise submit the ballot to the cooperative in a plain, sealed envelope inside another envelope bearing the member's name or by an alternative method approved by the board.\n(e) A properly executed ballot shall be accepted by the board and counted as the vote of the absent member at the meeting.",
	"repealed": false
}