{
	"id": "253B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.03",
	"title": "253B.03 RIGHTS OF PATIENTS.",
	"text": "(a) A patient has the right to be free from restraints. Restraints shall not be applied to a patient in a treatment facility or state-operated treatment program unless the head of the treatment facility, head of the state-operated treatment program, a member of the medical staff, or a licensed peace officer who has custody of the patient determines that restraints are necessary for the safety of the patient or others.\n(b) Restraints shall not be applied to patients with developmental disabilities except as permitted under section 245.825, the rules of the commissioner of human services, and the rules of the executive board. Consent must be obtained from the patient or patient's guardian except for emergency procedures as permitted under rules of the commissioner of human services adopted under section 245.825 or rules of the executive board adopted under chapter 246C.\n(c) Each use of a restraint and reason for it shall be made part of the clinical record of the patient under the signature of the head of the treatment facility.\nMS 2012 [Renumbered 253D.18]\nA patient has the right to correspond freely without censorship. The head of the treatment facility or head of the state-operated treatment program may restrict correspondence if the patient's medical welfare requires this restriction. For a patient in a state-operated treatment program, that determination may be reviewed by the executive board. Any limitation imposed on the exercise of a patient's correspondence rights and the reason for it shall be made a part of the clinical record of the patient. Any communication which is not delivered to a patient shall be immediately returned to the sender.\nSubject to the general rules of the treatment facility or state-operated treatment program, a patient has the right to receive visitors and make phone calls. The head of the treatment facility or head of the state-operated treatment program may restrict visits and phone calls on determining that the medical welfare of the patient requires it. Any limitation imposed on the exercise of the patient's visitation and phone call rights and the reason for it shall be made a part of the clinical record of the patient.\nA patient has the right to meet with or call a personal physician, advanced practice registered nurse, or physician assistant; spiritual advisor; and counsel at all reasonable times. The patient has the right to continue the practice of religion.\nUpon admission to a treatment facility or state-operated treatment program where federal law prohibits unauthorized disclosure of patient or resident identifying information to callers and visitors, the patient or resident, or the legal guardian of the patient or resident, shall be given the opportunity to authorize disclosure of the patient's or resident's presence in the facility to callers and visitors who may seek to communicate with the patient or resident. To the extent possible, the legal guardian of a patient or resident shall consider the opinions of the patient or resident regarding the disclosure of the patient's or resident's presence in the facility.\nA patient has the right to periodic medical assessment, including assessment of the medical necessity of continuing care and, if the treatment facility, state-operated treatment program, or community-based treatment program declines to provide continuing care, the right to receive specific written reasons why continuing care is declined at the time of the assessment. The treatment facility, state-operated treatment program, or community-based treatment program shall assess the physical and mental condition of every patient as frequently as necessary, but not less often than annually. If the patient refuses to be examined, the treatment facility, state-operated treatment program, or community-based treatment program shall document in the patient's chart its attempts to examine the patient. If a patient is committed as developmentally disabled for an indeterminate period of time, the three-year judicial review must include the annual reviews for each year regarding the patient's need for continued commitment.\n(a) A patient has the right to give prior consent to any medical or surgical treatment, other than treatment for chemical dependency or nonintrusive treatment for mental illness.\n(b) The following procedures shall be used to obtain consent for any treatment necessary to preserve the life or health of any committed patient:\n(1) the written, informed consent of a competent adult patient for the treatment is sufficient;\n(2) if the patient is subject to guardianship which includes the provision of medical care, the written, informed consent of the guardian for the treatment is sufficient;\n(3) if the head of the treatment facility or state-operated treatment program determines that the patient is not competent to consent to the treatment and the patient has not been adjudicated incompetent, written, informed consent for the surgery or medical treatment shall be obtained from the person appointed the health care power of attorney, the patient's agent under the health care directive, or the nearest proper relative. For this purpose, the following persons are proper relatives, in the order listed: the patient's spouse, parent, adult child, or adult sibling. If the nearest proper relatives cannot be located, refuse to consent to the procedure, or are unable to consent, the head of the treatment facility or state-operated treatment program or an interested person may petition the committing court for approval for the treatment or may petition a court of competent jurisdiction for the appointment of a guardian. The determination that the patient is not competent, and the reasons for the determination, shall be documented in the patient's clinical record;\n(4) consent to treatment of any minor patient shall be secured in accordance with sections 144.341 to 144.346. A minor 16 years of age or older may consent to hospitalization, routine diagnostic evaluation, and emergency or short-term acute care; and\n(5) in the case of an emergency when the persons ordinarily qualified to give consent cannot be located in sufficient time to address the emergency need, the head of the treatment facility or state-operated treatment program may give consent.\n(c) No person who consents to treatment pursuant to the provisions of this subdivision shall be civilly or criminally liable for the performance or the manner of performing the treatment. No person shall be liable for performing treatment without consent if written, informed consent was given pursuant to this subdivision. This provision shall not affect any other liability which may result from the manner in which the treatment is performed.\nMS 1990 [Renumbered subd 6c]\nA patient with a developmental disability, or the patient's guardian, has the right to give or withhold consent before:\n(1) the implementation of any aversive or deprivation procedure except for emergency procedures permitted in rules of the commissioner of human services adopted under section 245.825 or rules of the executive board adopted under chapter 246C; or\n(2) the administration of psychotropic medication.\nA competent patient admitted voluntarily to a treatment facility or state-operated treatment program may be subjected to intrusive mental health treatment only with the patient's written informed consent. For purposes of this section, \"intrusive mental health treatment\" means electroconvulsive therapy and neuroleptic medication and does not include treatment for a developmental disability. An incompetent patient who has prepared a directive under subdivision 6d regarding intrusive mental health treatment must be treated in accordance with this section, except in cases of emergencies.\n[Repealed, 1997 c 217 art 1 s 118]\n(a) A competent adult patient may make a declaration of preferences or instructions regarding intrusive mental health treatment. These preferences or instructions may include, but are not limited to, consent to or refusal of these treatments. A declaration of preferences or instructions may include a health care directive under chapter 145C or a psychiatric directive.\n(b) A declaration may designate a proxy to make decisions about intrusive mental health treatment. A proxy designated to make decisions about intrusive mental health treatments and who agrees to serve as proxy may make decisions on behalf of a declarant consistent with any desires the declarant expresses in the declaration.\n(c) A declaration is effective only if it is signed by the declarant and two witnesses. The witnesses must include a statement that they believe the declarant understands the nature and significance of the declaration. A declaration becomes operative when it is delivered to the declarant's physician, advanced practice registered nurse, physician assistant, or other mental health treatment provider. The physician, advanced practice registered nurse, physician assistant, or provider must comply with the declaration to the fullest extent possible, consistent with reasonable medical practice, the availability of treatments requested, and applicable law. The physician, advanced practice registered nurse, physician assistant, or provider shall continue to obtain the declarant's informed consent to all intrusive mental health treatment decisions if the declarant is capable of informed consent. A treatment provider must not require a patient to make a declaration under this subdivision as a condition of receiving services.\n(d) The physician, advanced practice registered nurse, physician assistant, or other provider shall make the declaration a part of the declarant's medical record. If the physician, advanced practice registered nurse, physician assistant, or other provider is unwilling at any time to comply with the declaration, the physician, advanced practice registered nurse, physician assistant, or provider must promptly notify the declarant and document the notification in the declarant's medical record. The physician, advanced practice registered nurse, physician assistant, or provider may subject the declarant to intrusive treatment in a manner contrary to the declarant's expressed wishes, only if the declarant is committed as a person who poses a risk of harm due to mental illness or as a person who has a mental illness and is dangerous to the public and a court order authorizing the treatment has been issued or an emergency has been declared under section 253B.092, subdivision 3.\n(e) A declaration under this subdivision may be revoked in whole or in part at any time and in any manner by the declarant if the declarant is competent at the time of revocation. A revocation is effective when a competent declarant communicates the revocation to the attending physician, advanced practice registered nurse, physician assistant, or other provider. The attending physician, advanced practice registered nurse, physician assistant, or other provider shall note the revocation as part of the declarant's medical record.\n(f) A provider who administers intrusive mental health treatment according to and in good faith reliance upon the validity of a declaration under this subdivision is held harmless from any liability resulting from a subsequent finding of invalidity.\n(g) In addition to making a declaration under this subdivision, a competent adult may delegate parental powers under section 524.5-211 or may nominate a guardian under sections 524.5-101 to 524.5-502.\nA patient receiving services under this chapter has the right to receive proper care and treatment, best adapted, according to contemporary professional standards, to rendering further supervision unnecessary. The treatment facility, state-operated treatment program, or community-based treatment program shall devise a written treatment plan for each patient which describes in behavioral terms the case problems, the precise goals, including the expected period of time for treatment, and the specific measures to be employed. The development and review of treatment plans must be conducted as required under the license or certification of the treatment facility, state-operated treatment program, or community-based treatment program. If there are no review requirements under the license or certification, the treatment plan must be reviewed quarterly. The treatment plan shall be devised and reviewed with the designated agency and with the patient. The clinical record shall reflect the treatment plan review. If the designated agency or the patient does not participate in the planning and review, the clinical record shall include reasons for nonparticipation and the plans for future involvement. The commissioner shall monitor the treatment plan and review process for state-operated treatment programs to ensure compliance with the provisions of this subdivision.\nA patient has the right to access to personal medical records. Notwithstanding the provisions of section 144.292, every person subject to a proceeding or receiving services pursuant to this chapter and the patient's attorney shall have complete access to all medical records relevant to the person's commitment. A provider may require an attorney to provide evidence of representation of the patient or an authorization signed by the patient.\n[Repealed, 1997 c 217 art 1 s 118]\n(a) All patients admitted or committed to a treatment facility or state-operated treatment program, or temporarily confined under section 253B.045, shall be notified in writing of their rights regarding hospitalization and other treatment.\n(b) This notification must include:\n(1) patient rights specified in this section and section 144.651, including nursing home discharge rights;\n(2) the right to obtain treatment and services voluntarily under this chapter;\n(3) the right to voluntary admission and release under section 253B.04;\n(4) rights in case of an emergency admission under section 253B.051, including the right to documentation in support of an emergency hold and the right to a summary hearing before a judge if the patient believes an emergency hold is improper;\n(5) the right to request expedited review under section 62M.05 if additional days of inpatient stay are denied;\n(6) the right to continuing benefits pending appeal and to an expedited administrative hearing under section 256.045 if the patient is a recipient of medical assistance or MinnesotaCare; and\n(7) the right to an external appeal process under section 62Q.73, including the right to a second opinion.\nA legally authorized health care proxy, agent, or guardian may exercise the patient's rights on the patient's behalf.",
	"repealed": false
}