{
	"id": "122A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.09",
	"title": "122A.09 DUTIES.",
	"text": "The Professional Educator Licensing and Standards Board must develop by rule a code of ethics covering standards of professional teaching practices, including areas of ethical conduct and professional performance and methods of enforcement.\nThe Professional Educator Licensing and Standards Board must act in an advisory capacity to members of the profession in matters of interpretation of the code of ethics.\nThe Professional Educator Licensing and Standards Board shall elect a chair and such other officers as it may deem necessary.\n(a) The Professional Educator Licensing and Standards Board must license teachers, as defined in section 122A.15, subdivision 1, except for supervisory personnel, as defined in section 122A.15, subdivision 2. The board must not delegate its authority to make all licensing decisions with respect to applicants for teacher licensure. The board must evaluate applicants for compliance with statutory or rule requirements for licensure and develop licensure verification requirements.\n(b) The Professional Educator Licensing and Standards Board must approve teacher preparation providers seeking to prepare applicants for teacher licensure in Minnesota.\nThe Professional Educator Licensing and Standards Board must provide reports in accordance with section 122A.091.\n[Repealed, 1Sp2017 c 5 art 12 s 23]\nThe Professional Educator Licensing and Standards Board must keep a record of the proceedings of and a register of all persons licensed pursuant to the provisions of this chapter. The register must show the name, licenses and permissions held, including renewals, and license number. This list must be available on the board's website.\nAll money received by the Professional Educator Licensing and Standards Board shall be paid into the state treasury as provided by law. The expenses of administering sections 120B.363, 122A.01, 122A.05 to 122A.09, 122A.15, 122A.16, 122A.17, 122A.18, 122A.181, 122A.182, 122A.183, 122A.184, 122A.185, 122A.187, 122A.188, 122A.20, 122A.21, 122A.22, 122A.23, 122A.2451, 122A.26, 122A.40, 122A.41, 122A.42, 122A.45, 122A.49, 122A.54, 122A.55, 122A.56, 122A.57, and 122A.58 that are incurred by the Professional Educator Licensing and Standards Board shall be paid for from appropriations made to the Professional Educator Licensing and Standards Board.\n[Repealed, 1Sp2017 c 5 art 12 s 23]\n(a) The Professional Educator Licensing and Standards Board must adopt rules subject to the provisions of chapter 14 to implement sections 120B.363, 122A.05 to 122A.09, 122A.092, 122A.16, 122A.17, 122A.18, 122A.181, 122A.182, 122A.183, 122A.184, 122A.185, 122A.187, 122A.188, 122A.19, 122A.20, 122A.21, 122A.23, 122A.26, 122A.28, 122A.29, and 124D.72.\n(b) The board must adopt rules relating to fields of licensure and grade levels that a licensed teacher may teach, including a process for granting permission to a licensed teacher to teach in a field that is different from the teacher's field of licensure without change to the teacher's license tier level.\n(c) If a rule adopted by the board is in conflict with a session law or statute, the law or statute prevails. Terms adopted in rule must be clearly defined and must not be construed to conflict with terms adopted in statute or session law.\n(d) The board must include a description of a proposed rule's probable effect on teacher supply and demand in the board's statement of need and reasonableness under section 14.131.\n(e) The board must adopt rules only under the specific statutory authority.\n(a) Notwithstanding subdivision 9 and sections 14.055 and 14.056, the Professional Educator Licensing and Standards Board may grant waivers to its rules upon application by a school district or a charter school for purposes of implementing experimental programs in learning or management.\n(b) To enable a school district or a charter school to meet the needs of students enrolled in an alternative education program and to enable licensed teachers instructing those students to satisfy content area licensure requirements, the Professional Educator Licensing and Standards Board may permit a licensed teacher teaching in an alternative education program to instruct students in a content area for which the teacher is not licensed, consistent with paragraph (a).\n(c) A special education license permission issued by the Professional Educator Licensing and Standards Board for a primary employer's low-incidence region is valid in all low-incidence regions.\n(d) An applicant that has obtained career and technical education certification may apply for a Tier 1 license under section 122A.181. Consistent with section 136F.361, the Professional Educator Licensing and Standards Board must strongly encourage approved teacher preparation programs throughout Minnesota to develop alternative pathways for certifying and licensing high school career and technical education instructors and teachers, allowing such applicants to meet certification and licensure standards that demonstrate their content knowledge, classroom experience, and pedagogical practices and their qualifications based on a combination of occupational testing, professional certification or licensure, and long-standing work experience.\n[Repealed, 1Sp2017 c 5 art 12 s 23]",
	"repealed": false
}