{
	"id": "290.0122",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0122",
	"title": "290.0122 ITEMIZED DEDUCTIONS.",
	"text": "A taxpayer's itemized deductions equal the sum of the amounts allowed as a deduction under this section, reduced by the amount calculated under subdivision 2.\n(a) The itemized deductions of a taxpayer with adjusted gross income over $220,650 are reduced by the lesser of:\n(1) three percent of the excess of the taxpayer's adjusted gross income over $220,650 but not over $304,970; plus ten percent of the taxpayer's adjusted gross income over $304,970; or\n(2) 80 percent of the amount of the taxpayer's itemized deductions.\n(b) Notwithstanding paragraph (a), for a taxpayer with adjusted gross income over $1,000,000, a taxpayer's itemized deductions are reduced by 80 percent.\n(c) For a married individual filing a separate return, the reduction under paragraph (a) must be calculated using one-half of the adjusted gross income amounts specified in that paragraph.\n(d) For the purposes of this subdivision, \"itemized deductions\" means the itemized deductions otherwise allowable to the taxpayer under subdivision 1, except itemized deductions excludes:\n(1) the portion of the deduction for interest under subdivision 5 that represents investment interest;\n(2) the deduction for medical expenses under subdivision 6; and\n(3) the deduction for losses under subdivision 8.\n(e) For taxable years beginning after December 31, 2023, the commissioner must adjust for inflation the adjusted gross income amounts under paragraphs (a) and (b) as provided in section 270C.22. The statutory year is taxable year 2023. The amounts as adjusted must be rounded down to the nearest $50 amount. The threshold amount for married individuals filing separate returns must be one-half of the adjusted amount for married individuals filing joint returns.\n(a) A taxpayer is allowed a deduction for taxes paid. The deduction equals the sum of the following amounts for the taxable year:\n(1) state and local personal property taxes and real property taxes, in a total amount for both types not to exceed $10,000, or $5,000 for a married taxpayer filing a separate return;\n(2) foreign income, war profits, and excess profits taxes to the extent not reduced by the federal foreign tax credit; and\n(3) for individuals who are allowed a federal foreign tax credit for taxes that do not qualify for a credit under section 290.06, subdivision 22, an amount equal to the carryover of subnational foreign taxes for the taxable year, but not to exceed the total subnational foreign taxes reported in claiming the foreign tax credit, and to the extent not deducted under clause (2).\n(b) For purposes of this subdivision, the following terms have the meanings given them:\n(1) \"carryover of subnational foreign taxes\" equals the carryover allowed under section 904(c) of the Internal Revenue Code minus national level foreign taxes to the extent they exceed the federal foreign tax credit;\n(2) \"federal foreign tax credit\" means the credit allowed under section 27 of the Internal Revenue Code; and\n(3) \"foreign income, war profits, and excess profits taxes\" and \"state and local real and personal property taxes\" have the meanings given in section 164 of the Internal Revenue Code.\n(a) A taxpayer is allowed a deduction for charitable contributions. The deduction equals the amount of the charitable contribution deduction allowable to the taxpayer under section 170 of the Internal Revenue Code, including the denial of the deduction under section 408(d)(8), except that the provisions of section 170(b)(1)(G) apply regardless of the taxable year.\n(b) For taxable years beginning after December 31, 2017, the determination of carryover amounts must be made by applying the rules under section 170 of the Internal Revenue Code based on the charitable contribution deductions claimed and allowable under this section.\nA taxpayer is allowed a deduction for interest. The deduction equals the amount allowed to the taxpayer as interest paid or accrued during the taxable year under section 163 of the Internal Revenue Code with the following exceptions:\n(1) qualified residence interest excludes home equity interest;\n(2) acquisition indebtedness must not exceed $750,000, or $375,000 for a married separate return, for indebtedness incurred on or after December 16, 2017; and\n(3) mortgage insurance premiums treated as interest under section 163(h)(3)(E) are not interest for the purposes of this subdivision.\nA taxpayer is allowed a deduction for medical expenses. The deduction equals the amount allowed under section 213 of the Internal Revenue Code, except that the threshold percentage of adjusted gross income in paragraph (a) is ten percent regardless of the federal percentage for the taxable year.\nA taxpayer is allowed a deduction for unreimbursed employee expenses. The deduction equals the amount of the taxpayer's trade or business expenses incurred as an employee and allowed under section 162 of the Internal Revenue Code in excess of two percent of the taxpayer's adjusted gross income, disregarding the suspension of the deduction in section 67, paragraph (g), of the Internal Revenue Code.\nA taxpayer is allowed a deduction for losses allowed under section 165(a) of the Internal Revenue Code, including the limitation provided by section 67(b)(3) of the Internal Revenue Code, for the following:\n(1) losses described in section 165(c)(3) of the Internal Revenue Code, including the provisions of section 165(h) of the Internal Revenue Code, but disregarding paragraph (h)(5); and\n(2) losses described in section 165(d) of the Internal Revenue Code.\nA taxpayer is allowed a miscellaneous deduction. The deduction equals the sum of the following amounts for the taxable year:\n(1) impairment-related work expenses allowed under section 67(d) of the Internal Revenue Code;\n(2) the deduction for estate tax under section 691(c) of the Internal Revenue Code;\n(3) any deduction allowable in connection with personal property used in a short sale as described under section 67(b)(8) of the Internal Revenue Code;\n(4) the deduction under section 1341 of the Internal Revenue Code;\n(5) the deduction under section 72(b)(3) of the Internal Revenue Code;\n(6) the deduction under section 171 of the Internal Revenue Code; and\n(7) the deduction under section 216 of the Internal Revenue Code.",
	"repealed": false
}