{
	"id": "125A.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.33",
	"title": "125A.33 SERVICE COORDINATION.",
	"text": "(a) The team responsible for the initial evaluation and the child- and family-directed assessment and for developing the IFSP under section 125A.32, if appropriate, must select a service coordinator to carry out service coordination activities on an interagency basis. Service coordination must actively promote a family's capacity and competency to identify, obtain, coordinate, monitor, and evaluate resources and services to meet the family's needs. Service coordination activities include:\n(1) coordinating the performance of evaluations and assessments;\n(2) facilitating and participating in the development, review, and evaluation of individualized family service plans;\n(3) assisting families in identifying available service providers;\n(4) coordinating and monitoring the delivery of available services;\n(5) informing families of the availability of advocacy services;\n(6) coordinating with medical, health, and other service providers;\n(7) facilitating the development of a transition plan to preschool, school, or, if appropriate, to other services, at least 90 days before the time the child is no longer eligible for infant and toddler intervention services or, at the discretion of all parties, not more than nine months prior to the child's third birthday, if appropriate;\n(8) managing the early intervention record and submitting additional information to the local primary agency at the time of periodic review and annual evaluations; and\n(9) notifying a local primary agency when disputes between agencies impact service delivery required by an IFSP.\n(b) A service coordinator must be knowledgeable about children and families receiving services under this section, requirements of state and federal law, and services available in the interagency early childhood intervention system. The IFSP must include the name of the services coordinator from the profession most relevant to the child's or family's needs or who is otherwise qualified to carry out all applicable responsibilities under the Individuals with Disabilities Education Act, United States Code, title 20, sections 1471 to 1485 (Part C, Public Law 102-119), who will be responsible for implementing the early intervention services identified in the child's IFSP, including transition services, and coordination with other agencies and persons.",
	"repealed": false
}