{
	"id": "611.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.26",
	"title": "611.26 DISTRICT PUBLIC DEFENDERS.",
	"text": "[Repealed, 1991 c 345 art 3 s 30]\nThe State Board of Public Defense shall appoint a chief district public defender for each judicial district. Each chief district public defender shall be a qualified attorney licensed to practice law in this state. The chief district public defender shall be appointed for a term of four years, beginning January 1, pursuant to the following staggered term schedule: (1) in 2008, the second and eighth districts; (2) in 2009, the first, third, fourth, and tenth districts; (3) in 2010, the fifth and ninth districts; and (4) in 2011, the sixth and seventh districts. The chief district public defenders shall serve for four-year terms and may only be removed before the end of a term by a majority vote of the board members at a meeting of the state Board of Public Defense. Vacancies in the office shall be filled by the appointing authority for the unexpired term. The chief district public defenders shall devote full time to the performance of duties and shall not engage in the general practice of law.\n(a) The compensation of the chief district public defender shall be set by the Board of Public Defense.\n(b) This subdivision does not limit the rights of public defenders to collectively bargain with their employers.\n(a) Notwithstanding subdivision 3 or any other law to the contrary, compensation and economic benefit increases for chief district public defenders and assistant district public defenders, who are full-time county employees, shall be paid out of the budget for that judicial district public defender's office.\n(b) In the Second Judicial District, the district public defender's office shall be funded by the Board of Public Defense. The budget for the Second Judicial District Public Defender's Office shall not include Ramsey County property taxes.\n(c) In the Fourth Judicial District, the district public defender's office shall be funded by the Board of Public Defense and by the Hennepin County Board. Personnel expenses of state employees hired on or after January 1, 1999, in the Fourth Judicial District Public Defender's Office shall be funded by the Board of Public Defense.\nA chief district public defender shall appoint assistants who are qualified attorneys licensed to practice law in this state and other staff as the chief district public defender finds prudent and necessary subject to the standards adopted by the state public defender. A chief district public defender is authorized, subject to approval by the state public defender or their designee, to hire an independent contractor to perform the duties of an assistant public defender.\n[Repealed, 1987 c 250 s 20]\nThe district public defender shall represent, without charge, a defendant charged with a felony, a gross misdemeanor, or misdemeanor when so directed by the district court. The district public defender shall also represent a minor ten years of age or older in the juvenile court when so directed by the juvenile court. The district public defender must not serve as advisory counsel or standby counsel. The juvenile court may not order the district public defender to represent a minor who is under the age of ten years, to serve as a guardian ad litem, or to represent a guardian ad litem.\nAssistant district public defenders may engage in the general practice of law where not employed on a full-time basis.\n[Repealed, 1987 c 250 s 20]\n[Repealed, 1998 c 367 art 8 s 26]\nThe chief district public defender is responsible for the administration of public defender services in the district, consistent with standards adopted by the state Board of Public Defense and the policies and procedures adopted by the state public defender.",
	"repealed": false
}