{
	"id": "259.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.83",
	"title": "259.83 POSTADOPTION SERVICES.",
	"text": "(a) Agencies shall provide assistance and counseling services upon receiving a request for current information from adoptive parents, birth parents, adopted persons aged 18 years of age and older, or adult siblings of adopted persons. The agency shall contact the other adult persons or the adoptive parents of a minor child in a personal and confidential manner to determine whether there is a desire to receive or share information or to have contact. If there is such a desire, the agency shall provide the services requested. The agency shall complete the search request within six months of the request being made. If the agency is unable to complete the search request within the specified time frame, the agency shall inform the requester of the status of the request and include a reasonable estimate of when the request can be completed.\n(b) Upon a request for assistance or services from an adoptive parent of a minor child, birth parent, or an adopted person 18 years of age or older, the agency must inform the person:\n(1) about the right of an adopted person to request and obtain a copy of the adopted person's original birth record at the age and circumstances specified in section 144.2253; and\n(2) about the right of the birth parent named on the adopted person's original birth record to file a contact preference form with the state registrar pursuant to section 144.2253.\nWhen making or supervising an adoptive placement, the agency must provide in writing to the birth parents listed on the original birth record the information required under this paragraph and section 259.37, subdivision 2, clause (7).\n(a) If a person aged 18 years of age and older who was adopted on or after August 1, 1994, or the adoptive parent requests the detailed nonidentifying social and medical history of the adopted person's birth family that was provided at the time of the adoption, agencies must provide the information to the adopted person or adoptive parent on the applicable form required under sections 259.43 and 260C.212, subdivision 15.\n(b) If an adopted person aged 18 years of age and older or the adoptive parent requests the agency to contact the adopted person's birth parents to request current nonidentifying social and medical history of the adopted person's birth family, agencies must use the applicable form required under sections 259.43 and 260C.212, subdivision 15, when obtaining the information for the adopted person or adoptive parent.\n(a) A person who is at least 18 years of age who was adopted or who was committed to the guardianship of the commissioner of children, youth, and families and not adopted must upon request be advised of other siblings who were adopted or who were committed to the guardianship of the commissioner of children, youth, and families and not adopted.\n(b) The agency must provide assistance to the person requesting information to the extent that information is available in the records required to be kept under section 259.79. If the sibling received services from another agency, the agencies must share necessary information in order to locate the other siblings and to offer services, as requested. A reasonable fee may be imposed by the agency.\nWhen the agency receives information about a medical or genetic condition which has affected or may affect the physical or mental health of genetically related persons, the agency shall make a diligent effort to contact those persons in order to transmit the health information.\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]\nAgencies shall provide adoptive parents, birth parents and adult siblings, and adopted persons aged 18 years and over reasonable assistance in a manner consistent with state and federal laws, rules, and regulations regarding the confidentiality and privacy of child welfare and adoption records.\nThe commissioner, the commissioner's agents, and licensed child-placing agencies may require a reasonable expense reimbursement for providing services required in this section. Reimbursements received by the commissioner according to this subdivision shall be deposited in the general fund.",
	"repealed": false
}