{
	"id": "17.1195",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.1195",
	"title": "17.1195 FARM SAFETY GRANT AND OUTREACH PROGRAMS.",
	"text": "(a) The commissioner may award grants to Minnesota farmers and Minnesota schools that retrofit eligible tractors with eligible rollover protective structures.\n(b) Grants for farmers are limited to 70 percent of the farmer's documented cost to purchase, ship, and install an eligible rollover protective structure. The commissioner must increase a farmer's grant award amount over the 70 percent grant limitation requirement if necessary to limit a farmer's cost per tractor to no more than $500.\n(c) Schools are eligible for grants that cover the full amount of a school's documented cost to purchase, ship, and install an eligible rollover protective structure.\n(d) A rollover protective structure is eligible if it is certified to appropriate national or international rollover protection structure standards with a seat belt.\n(e) \"Eligible tractor\" means a tractor that was built before 1987.\n(a) The commissioner may award grants to Minnesota farmers who purchase eligible grain storage facility safety equipment. Grants are limited to 75 percent of the farmer's documented cost to purchase, ship, and install grain storage facility safety equipment, or $400 per bin or silo, whichever is less. A farm entity may not receive more than one grant each fiscal year.\n(b) Eligible grain storage facility safety equipment includes:\n(1) fall protection systems;\n(2) engineering controls to prevent contact with an auger or other moving parts;\n(3) dust collection systems to minimize explosion hazards;\n(4) personal protective equipment to increase survivability in the event of a grain-bin-related emergency;\n(5) grain silo air quality monitoring equipment; and\n(6) other grain storage facility safety equipment approved by the commissioner.\n(c) The commissioner may create a farm safety outreach campaign, including but not limited to development and distribution of safety educational materials related to grain bins, silos, and other agricultural confined spaces.\nThe commissioner may spend up to six percent of total program dollars each fiscal year to promote and administer the programs to Minnesota farmers and schools.",
	"repealed": false
}