{
	"id": "477A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.14",
	"title": "477A.14 USE OF FUNDS.",
	"text": "Except as provided in subdivisions 2 and 3, 40 percent of the total payment to the county shall be deposited in the county general revenue fund to be used to provide property tax levy reduction. The remainder shall be distributed by the county in the following priority:\n(1) 64.2 cents, for each acre of county-administered other natural resources land shall be deposited in a resource development fund to be created within the county treasury for use in resource development, forest management, game and fish habitat improvement, and recreational development and maintenance of county-administered other natural resources land. Any county receiving less than $5,000 annually for the resource development fund may elect to deposit that amount in the county general revenue fund;\n(2) within 30 days of receipt of the payment to the county, the county treasurer shall pay a township with land that qualifies for payment under section 477A.12, subdivision 1, clauses (1), (2), and (5) to (7), ten percent of the payment the county received for such land within that township. Payments for natural resources lands not located in an organized township shall be deposited in the county general revenue fund. Payments to counties and townships pursuant to this paragraph shall be used to provide property tax levy reduction, except that of the payments for natural resources lands not located in an organized township, the county may allocate the amount determined to be necessary for maintenance of roads in unorganized townships; and\n(3) any remaining funds shall be deposited in the county general revenue fund. Provided that, if the distribution to the county general revenue fund exceeds $35,000, the excess shall be used to provide property tax levy reduction.\nIn the case of payments for consolidated conservation land, at least 15 percent of the amount paid on account of that land under section 477A.12 must be distributed to the county for use as provided in section 84A.51, subdivision 4, clause (1). The remainder of the payment under section 477A.12 will be distributed in proportion to the distributions described in subdivision 1.\n(a) The county treasurer shall allocate the payment for wildlife management land and military game refuge land among the county, towns, and school districts on the same basis as if the payments were taxes on the land received in the year. Payment of a town's or a school district's allocation must be made by the county treasurer to the town or school district within 30 days of receipt of the payment to the county. The county's share of the payment shall be deposited in the county general revenue fund.\n(b) The county treasurer of a county with a population over 39,000, but less than 42,000, in the 1950 federal census shall allocate the payment only among the towns and school districts on the same basis as if the payments were taxes on the lands received in the current year.\n(c) If a town received a payment in calendar year 2006 or thereafter under this subdivision, and subsequently incorporated as a city, the city shall continue to receive any future year's allocations of wildlife land payments that would have been made to the town had it not incorporated, provided that the payments shall terminate if the governing body of the city passes an ordinance that prohibits hunting within the boundaries of the city.",
	"repealed": false
}