{
	"id": "144A.073",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.073",
	"title": "144A.073 EXCEPTIONS TO MORATORIUM; REVIEW.",
	"text": "For purposes of this section, the following terms have the meanings given them.\n(a) \"Conversion\" means the relocation of a nursing home bed from a nursing home to an attached hospital.\n(b) \"Relocation\" means the movement of licensed nursing home beds or certified boarding care beds.\n(c) \"Renovation\" means extensive remodeling of an existing facility with a total cost exceeding ten percent of the appraised value of the facility or $200,000, whichever is less. A renovation may include the replacement or upgrade of existing mechanical or electrical systems.\n(d) \"Replacement\" means the construction of a complete new facility.\n(e) \"Addition\" means the construction of new space to an existing facility.\n(f) \"Upgrading\" means a change in the level of licensure of a bed from a boarding care bed to a nursing home bed in a certified boarding care facility.\n(g) \"Phased project\" means a proposal that identifies construction occurring with more than one distinct completion date. To be considered a distinct completion, each phase must have construction that is ready for resident use, as determined by the commissioner, that is not dependent on similar commissioner approval for future phases of construction. The commissioner of human services shall only allow rate adjustments for construction projects in phases if the proposal from a facility identifies construction in phases and each phase can be approved for use independent of the other phases.\nAt the authorization by the legislature of additional medical assistance expenditures for exceptions to the moratorium on nursing homes, the commissioner shall publish in the State Register a request for proposals for nursing home and certified boarding care home projects for conversion, relocation, renovation, replacement, upgrading, or addition. The public notice of this funding and the request for proposals must specify how the approval criteria will be prioritized by the commissioner. The notice must describe the information that must accompany a request and state that proposals must be submitted to the commissioner within 150 days of the date of publication. The notice must include the amount of the legislative appropriation available for the additional costs to the medical assistance program of projects approved under this section. If money is appropriated, the commissioner shall initiate the application and review process described in this section at least once each biennium. A second application and review process must occur if remaining funds are either greater than $300,000 or more than 50 percent of the baseline appropriation for the biennium. Authorized funds may be awarded in full in the first review process of the biennium. Appropriated funds not encumbered within a biennium shall carry forward. To be considered for approval, a proposal must include the following information:\n(1) whether the request is for renovation, replacement, upgrading, conversion, addition, or relocation;\n(2) a description of the problems the project is designed to address;\n(3) a description of the proposed project;\n(4) an analysis of projected costs of the nursing facility proposed project, including:\n(i) initial construction and remodeling costs;\n(ii) site preparation costs;\n(iii) equipment and technology costs;\n(iv) financing costs, the current estimated long-term financing costs of the proposal, which is to include details of any proposed funding mechanism already arranged or being considered, including estimates of the amount and sources of money, reserves if required, annual payments schedule, interest rates, length of term, closing costs and fees, insurance costs, any completed marketing study or underwriting review; and\n(v) estimated operating costs during the first two years after completion of the project;\n(5) for proposals involving replacement of all or part of a facility, the proposed location of the replacement facility and an estimate of the cost of addressing the problem through renovation;\n(6) for proposals involving renovation, an estimate of the cost of addressing the problem through replacement;\n(7) the proposed timetable for commencing construction and completing the project;\n(8) a statement of any licensure or certification issues, such as certification survey deficiencies;\n(9) the proposed relocation plan for current residents if beds are to be closed according to section 144A.161; and\n(10) other information required by permanent rule of the commissioner of health in accordance with subdivisions 4 and 8.\nWithin the limits of money specifically appropriated to the medical assistance program for this purpose, the commissioner of health may grant exceptions to the nursing home licensure or certification moratorium for proposals that satisfy the requirements of this section. The commissioner of health shall approve or disapprove a project. The commissioner of health shall base approvals or disapprovals on a comparison and ranking of proposals using only the criteria in subdivision 4 and in rules adopted by the commissioner. The cost to the medical assistance program of the proposals approved must be within the limits of the appropriations specifically made for this purpose. Approval of a proposal expires 18 months after approval by the commissioner of health unless the facility has commenced construction as defined in section 144A.071, subdivision 1a, paragraph (d).\n[Repealed, 1995 c 207 art 7 s 43]\n(a) Nursing facilities that have received approval for exceptions to the moratorium on nursing homes through the process described in this section may request amendments to the designs of the projects by writing the commissioner within 15 months of receiving approval. Applicants shall submit supporting materials that demonstrate how the amended projects meet the criteria described in paragraph (b).\n(b) The commissioner shall approve requests for amendments for projects approved according to the following criteria:\n(1) the amended project designs must provide solutions to all of the problems addressed by the original application that are at least as effective as the original solutions;\n(2) the amended project designs may not reduce the space in each resident's living area or in the total amount of common space devoted to resident and family uses by more than five percent;\n(3) the costs of amended project designs shall be the cost estimate associated with the project as originally approved, except under conditions described in clause (4); and\n(4) total costs of the amendment are no greater than ten percent of the cost estimate associated with the project as initially approved if the proposer can document that one of the following circumstances is true:\n(i) changes are needed due to a natural disaster;\n(ii) conditions that affect the safety or durability of the project that could not have reasonably been known prior to approval are discovered;\n(iii) state or federal law require changes in project design; or\n(iv) documentable circumstances occur that are beyond the control of the owner and require changes in the design.\n(c) Approval of a request for an amendment does not alter the expiration of approval of the project according to subdivision 3.\n(d) Reimbursement for amendments to approved projects is independent of the actual construction costs and based on the allowable appraised value of the completed project. An approved project may not be amended to reduce the scope of an approved project.\n(a) Notwithstanding subdivision 3, the commissioner may at any time accept proposals, or amendments to proposals previously approved under this section, for relocations to existing licensed nursing facilities when costs are less than the maximum threshold limit determined under section 256R.267, paragraph (a). The commissioner, in consultation with the commissioner of human services, shall evaluate proposals according to subdivision 4a, clauses (1), (4), (5), (6), and (8), and other criteria established in rule or law. The commissioner of human services shall determine the allowable payment rates of the facility receiving the beds in accordance with section 256R.21. No part of the source facility rates are transferred to the receiving facility. The commissioner shall approve or disapprove a project within 90 days.\n(b) Bed relocation threshold projects seeking reimbursement for costs that exceed the moratorium limit or that result in a newly constructed or newly licensed building must apply to relocate beds as part of the competitive moratorium application and review process under subdivisions 2 and 3.\n[Repealed by amendment, 2008 c 230 s 3]\n[Repealed, 2011 c 22 art 1 s 8]\nIn reviewing the application materials and submitted costs by an applicant to the moratorium process, the review panel shall consider the following criteria in recommending proposals:\n(1) the extent to which the proposed nursing home project is integrated with other health and long-term care services for older adults;\n(2) the extent to which the project provides for the complete replacement of an outdated physical plant;\n(3) the extent to which the project results in a reduction of nursing facility beds in an area that has a relatively high number of beds per thousand occupied by persons age 85 and over;\n(4) the extent to which the project produces improvements in health; safety, including life safety code corrections; quality of life; and privacy of residents;\n(5) the extent to which, under the current facility ownership and management, the provider has shown the ability to provide good quality of care based on health-related findings on certification surveys, quality indicator scores, and quality-of-life scores, including those from the Minnesota nursing home report card;\n(6) the extent to which the project integrates the latest technology and design features in a way that improves the resident experience and improves the working environment for employees;\n(7) the extent to which the sustainability of the nursing facility can be demonstrated based on the need for services in the area and the proposed financing of the project; and\n(8) the extent to which the project provides or maintains access to nursing facility services needed in the community.\n[Repealed, 2011 c 22 art 1 s 8]\nProposals submitted or approved under this section involving conversion must satisfy the following conditions:\n(1) conversion is limited to a total of five beds;\n(2) an equivalent number of hospital beds must be delicensed;\n(3) the average occupancy rate in the existing nursing home beds must be greater than 96 percent according to the most recent annual statistical and cost report of the Department of Human Services;\n(4) the cost of remodeling the hospital rooms to meet current nursing home construction standards must not exceed ten percent of the appraised value of the nursing home or $200,000, whichever is less; and\n(5) the conversion must not result in an increase in operating costs.\nProposals submitted or approved under this section involving upgrading must satisfy the following conditions:\n(1) the facility must meet minimum nursing home licensure requirements; and\n(2) if beds are upgraded to nursing home beds, the number of boarding care beds in a facility must not increase in the future.\nThe commissioner of health shall adopt rules to implement this section. The permanent rules must be in accordance with and implement only the criteria listed in this section.\n[Repealed, 2012 c 247 art 4 s 51]\n[Repealed by amendment, 2008 c 230 s 3]\nThe commissioner shall monitor the status of projects approved under this section to identify, in consultation with each facility with an approved project, if projects will be canceled or will expire. For projects that have been canceled or have expired, if originally approved after June 30, 2001, the commissioner's approval authority for the estimated annual state cost to medical assistance shall carry forward and shall be available for the issuance of a new moratorium round later in that fiscal year or in either of the following two fiscal years.\nNotwithstanding subdivision 3, the commissioner of health shall extend project approval by an additional 18 months for an approved proposal for an exception to the nursing home licensure and certification moratorium if the proposal was approved under this section between July 1, 2007, and June 30, 2009.\nIn fiscal year 2013, the commissioner of health may approve moratorium exception projects under this section for which the full annualized state share of medical assistance costs does not exceed $1,000,000 plus any carryover of previous appropriations for this purpose.\nIn fiscal year 2015, the commissioner of health may approve moratorium exception projects under this section for which the full annualized state share of medical assistance costs does not exceed $1,000,000 plus any carryover of previous appropriations for this purpose.\nIn fiscal year 2017, the commissioner may approve moratorium exception projects under this section for which the full annualized state share of medical assistance costs does not exceed $1,000,000 plus any carryover of previous appropriations for this purpose.\nIn fiscal year 2020, the commissioner may approve moratorium exception projects under this section for which the full annualized state share of medical assistance costs does not exceed $1,250,000 plus any carryover of previous appropriations for this purpose.\n(a) During the biennium beginning July 1, 2021, and during each biennium thereafter, the commissioner of health may approve moratorium exception projects under this section for which the full biennial state share of medical assistance costs does not exceed $4,000,000, plus any carryover of previous appropriations for this purpose.\n(b) For the purposes of this subdivision, \"biennium\" has the meaning given in section 16A.011, subdivision 6.",
	"repealed": false
}