{
	"id": "168.017",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.017",
	"title": "168.017 MONTHLY SERIES REGISTRATION SYSTEM.",
	"text": "All passenger automobiles, ambulances, hearses, and pickup trucks shall be registered by the registrar according to the monthly series system of registration prescribed by this section.\nThere are established 12 registration periods, each to be designated by a calendar month and to start on the first day of such month and end on the last day of the 12th month from the date of commencing. The registrar shall register all vehicles subject to registration under the monthly series system for a minimum period of 12 consecutive calendar months.\nThe registrar shall register all vehicles subject to registration under the monthly series system for a period of 12 consecutive calendar months, unless:\n(1) the application is an original under section 168.127; or\n(2) the applicant is a licensed motor vehicle lessor under section 168.27 and the vehicle is leased or rented for periods of time of not more than 28 days, in which case the applicant may apply for initial or renewed registration of a vehicle for a period of four or more months, the month of expiration to be designated by the applicant at the time of registration. To qualify for this exemption, the applicant must present the application to a designated deputy registrar office. Subsequent registration periods when the applicant is not a qualified motor vehicle lessor under this subdivision must be for a period of 12 months commencing from the last month for which registration was issued.\nExcept as otherwise provided in this subdivision, the applicant for registration of a vehicle under the monthly series system shall pay in full the calendar year registration fee prescribed by law during the 12 consecutive calendar months of registration under the monthly series system. If the registrar registers the vehicle for a period greater or less than a calendar year pursuant to subdivision 3, the calendar year registration fee shall be apportioned as follows: During the first period the fee is 1/12 of the first calendar year fee times the number of months in the period. During the first 12 consecutive months of registration under the monthly series system, the fee is the sum of the following: (a) 1/12 of the first calendar year fee times the months remaining after subtracting the months in the first period of issuance from 12 months, and (b) 1/12 of the second calendar year fee times the number of months in the first period of issuance. The registration fee shall be computed in the same manner for second and subsequent periods of 12 consecutive months of registration under the monthly series system, subject to changes provided by law for registration fees under the calendar year system. If the registrar registers the vehicle for a part of a year pursuant to subdivision 3, the calendar year registration fee shall be apportioned as above in the case of an original registration for part of a year except that the computation shall begin with the second calendar year fee.\n(a) Notwithstanding subdivisions 3 and 4, a person leasing for at least one year a vehicle registered under this section may obtain an extension of the motor vehicle's registration period for the unexpired portion of the lease period, for a period not to exceed 11 months beyond the expiration of the registration period.\n(b) In order to obtain an extension under this subdivision a lessee must:\n(1) apply to the registrar on a form the registrar prescribes;\n(2) submit to the registrar a copy of the lease;\n(3) pay an administrative fee of $5; and\n(4) pay a tax of 1/12 of the tax for the registration period being extended for each month of the extension.\n(c) On an applicant's compliance with paragraph (b) the registrar shall issue the applicant a license plate tab or sticker designating the new month of expiration of the registration. The extended registration expires on the tenth day of the month following the month designated on the tab or sticker.\n(d) All fees collected under paragraph (b), clause (3), must be deposited in the driver and vehicle services operating account under section 299A.705, subdivision 1. Taxes collected under paragraph (b), clause (4), must be deposited in the highway user tax distribution fund.",
	"repealed": false
}