{
	"id": "238.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.08",
	"title": "238.08 FRANCHISE REQUIREMENT.",
	"text": "(a) A municipality shall require a franchise or extension permit of any cable communications system providing service within the municipality.\n(b) No municipality shall grant an additional franchise for cable service for an area included in an existing franchise on terms and conditions more favorable or less burdensome than those in the existing franchise pertaining to: (1) the area served; (2) public, educational, or governmental access requirements; or (3) franchise fees. The provisions of this paragraph shall not apply when the area in which the additional franchise is being sought is not actually being served by any existing cable communications system holding a franchise for the area. Nothing in this paragraph prevents a municipality from imposing additional terms and conditions on any additional franchises.\n(c) An area for an additional cable franchise is not more favorable or less burdensome if the franchisee is a telephone company, as defined in section 237.01, subdivision 7, and the area of the franchise is no less than the area within the municipality in which the telephone company offers local exchange telephone service. This paragraph is in addition to and not a limit to the authority of a municipality to grant an additional franchise for cable service.\nNothing in this chapter shall be construed to prevent franchise requirements in excess of those prescribed unless such requirement is inconsistent with this chapter.\nUnless otherwise prohibited by applicable law, any municipality may construct, purchase, and operate cable communications systems or operate facilities and channels for community television, including, but not limited to, public, educational, and governmental access and local origination programming. Any municipal system, including the operation of community television by a municipality, is subject to this chapter to the same extent as any nonpublic cable communications system.\nNothing in this chapter shall be construed to limit the power of any municipality to impose upon any person operating a cable communications system a fee, tax, or charge.\nMunicipalities may by ordinance or resolution create a joint cable communications commission under section 471.59, to which each member municipality may delegate authority vested in the municipality by statute or charter to prepare, adopt, grant, administer, and enforce a cable communications franchise, and establish rates thereunder. The adoption, granting, administration and enforcement of a cable communications franchise, and the establishment of rates thereunder by a joint cable communications commission, pursuant to this subdivision is deemed to comply with procedural requirements of a statute or charter for the adoption, granting, administration and enforcement of a franchise, and establishment of rates. A member of the commission may, by ordinance adopted in the manner provided by section 412.191, subdivision 4, adopt by reference the joint cable communication franchise in the manner provided by section 471.62. The members and governing body of the joint commission shall consist of two representatives appointed by each municipality, at least one of whom shall be a member of the council of that municipality or its designee and the other a qualified voter residing within that municipality.",
	"repealed": false
}