{
	"id": "274.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/274.10",
	"title": "274.10 PROPERTY OMITTED OR UNDERVALUED.",
	"text": "The governor shall appoint an examiner when it appears to the governor on a verified complaint, or by the finding of a court or of the legislature, or any committee of the legislature, that a considerable amount of property in any county has been improperly omitted from the tax lists and assessment roll of the county for a year; or, if assessed, that the property has been grossly undervalued by the assessor or other county officials, whether or not the assessment has been reviewed by the county board of equalization. The appointment must be in writing. The appointee must be a competent citizen of the state, but not a resident of the county. The person appointed shall determine the character, location, value, and ownership of the real and personal property in the county omitted or undervalued. The person shall take an oath to faithfully perform the duties.\nThe person shall examine the subject and prepare a report in duplicate. A list must be attached to the report, showing the character, location, ownership, and valuation of all property that has been omitted or undervalued. The list must state the years or part of years that the property has been omitted or undervalued. The list must show opposite each piece or parcel of land or item of personal property undervalued, the amount of the assessment, its actual and market value at the time it should have been assessed, and the difference between its assessed and actual value. On or before January 1, in the assessment year, the examiner shall file the report and list with the county auditor and with the commissioner of management and budget. Lists must be verified substantially as follows:\n\"I, ............................., solemnly swear that I have personally examined the real and personal property in the attached list, and that it is a correct and full list of the real and personal property subject to taxation in the county, and omitted from taxation for the years stated in it, or, if assessed for those years, grossly undervalued, and that the character, location, ownership, and valuation of the property as set down in the proper column, opposite the property, are correct, to the best of my knowledge and belief.\"\nWhen necessary to properly perform duties within the time prescribed by law, with the approval of the governor, the examiner may appoint one or more well-qualified citizens of the state as deputies to assist in the performance of examiner's duties. The deputies shall perform the duties assigned them by the examiner. The deputies must take an oath to faithfully perform the duties.\nThe examiner shall be paid $3 for services, and each deputy shall be paid $2, for every day they are necessarily employed in the performance of their duties. The examiner and deputies shall be paid their necessary expenses. Upon the approval by the governor, the compensation and expenses must be paid out of the general fund in the state treasury. The respective counties shall reimburse the state two years after the payments are made. The state auditor shall notify the county auditor of the amount to be paid. The county auditor shall levy a tax on the taxable property in the county sufficient to pay it. When collected, the proceeds of the tax must be paid into the state treasury like other state taxes.",
	"repealed": false
}