{
	"id": "97B.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.301",
	"title": "97B.301 DEER LICENSES AND LIMITS.",
	"text": "A person may not take deer without a license. A person must have a firearms deer license to take deer with firearms during the regular firearms season, a muzzleloader license to take deer with a muzzleloader during the muzzleloader season, and an archery deer license to take deer by archery except as provided in this section.\nA person may obtain one regular firearms season deer license, one muzzleloader season deer license, and one archery season deer license in the same license year, but may not take more than one deer except as provided in subdivisions 3 and 4.\nIf two or more persons with licenses to take deer by firearms, or two or more persons with licenses to take deer by archery, are hunting as a party, a member of the party may take more than one deer, but the total number of deer taken by the party may not exceed the number of persons licensed to take deer in the party.\nThe commissioner may, by rule, allow a person to take more than one deer. The commissioner shall prescribe the conditions for taking the additional deer including:\n(1) taking by firearm, muzzleloader, or archery;\n(2) obtaining additional licenses;\n(3) payment of a fee not more than the fee for a firearms deer license; and\n(4) the total number of deer that an individual may take.\n[Repealed, 1995 c 220 s 141; 1Sp1995 c 1 s 48]\nA resident or nonresident under the age of 18 may take a deer of either sex except in those antlerless permit areas and seasons where no antlerless permits are offered. In antlerless permit areas where no antlerless permits are offered, the commissioner may provide a limited number of youth either sex permits to residents or nonresidents under age 18, under the procedures provided in section 97B.305, and may give preference to residents or nonresidents under the age of 18 that have not previously been selected. This subdivision does not authorize the taking of a deer by another member of a party under subdivision 3.\n[Repealed, 2009 c 176 art 2 s 71]\n[Repealed, 2009 c 176 art 2 s 71]\nA resident age 84 or over may take a deer of either sex. This subdivision does not authorize the taking of an antlerless deer by another member of a party under subdivision 3.",
	"repealed": false
}