{
	"id": "260.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.63",
	"title": "260.63 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 260.61 to 260.693.\n\"Active efforts\" means a rigorous and concerted level of effort that the responsible social services agency must continuously make throughout the time that the responsible social services agency is involved with an African American or a disproportionately represented child and the child's family. To provide active efforts to preserve an African American or a disproportionately represented child's family, the responsible social services agency must continuously involve an African American or a disproportionately represented child's family in all services for the family, including case planning and choosing services and providers, and inform the family of the ability to file a report of noncompliance with this act with the commissioner through the child welfare compliance and feedback portal. When providing active efforts, a responsible social services agency must consider an African American or a disproportionately represented child's family's social and cultural values at all times while providing services to the African American or disproportionately represented child and the child's family. Active efforts includes continuous efforts to preserve an African American or a disproportionately represented child's family and to prevent the out-of-home placement of an African American or a disproportionately represented child. If an African American or a disproportionately represented child enters out-of-home placement, the responsible social services agency must make active efforts to reunify the African American or disproportionately represented child with the child's family as soon as possible. Active efforts sets a higher standard for the responsible social services agency than reasonable efforts to preserve the child's family, prevent the child's out-of-home placement, and reunify the child with the child's family. Active efforts includes the provision of reasonable efforts as required by Title IV-E of the Social Security Act, United States Code, title 42, sections 670 to 679c.\n\"Adoptive placement\" means the permanent placement of an African American or a disproportionately represented child made by the responsible social services agency upon a fully executed adoption placement agreement, including the signatures of the adopting parent, the responsible social services agency, and the commissioner of children, youth, and families according to section 260C.613, subdivision 1.\n\"African American child\" means a person under 18 years of age having origins in Africa, including a child of two or more races who has at least one parent with origins in Africa. Whether a child or parent has origins in Africa is based upon self-identification or identification of the child's origins by the parent or guardian.\nThe \"best interests of the African American or disproportionately represented child\" means providing a culturally informed practice lens that acknowledges, utilizes, and embraces the African American or disproportionately represented child's community and cultural norms and allows the child to remain safely at home with the child's family. The best interests of the African American or disproportionately represented child support the child's sense of belonging to the child's family, extended family, kin, and cultural community.\n(a) \"Child placement proceeding\" means any judicial proceeding that could result in:\n(1) an adoptive placement;\n(2) a foster care placement;\n(3) a preadoptive placement; or\n(4) a termination of parental rights.\n(b) Judicial proceedings under this subdivision include a child's placement based upon a child's juvenile status offense but do not include a child's placement based upon:\n(1) an act which if committed by an adult would be deemed a crime; or\n(2) an award of child custody in a divorce proceeding to one of the child's parents.\n\"Commissioner\" means the commissioner of children, youth, and families or the commissioner's designee.\n\"Custodian\" means any person who is under a legal obligation to provide care and support for an African American or a disproportionately represented child, or who is in fact providing daily care and support for an African American or a disproportionately represented child. This subdivision does not impose a legal obligation upon a person who is not otherwise legally obligated to provide a child with necessary food, clothing, shelter, education, or medical care.\n\"Disproportionality\" means the overrepresentation of African American children and other disproportionately represented children in Minnesota's child welfare system population as compared to the representation of those children in Minnesota's total child population.\n\"Disproportionately represented child\" means a person who is under the age of 18 and who is a member of a community whose race, culture, ethnicity, disability status, or low-income socioeconomic status is disproportionately encountered, engaged, or identified in the child welfare system as compared to the representation in the state's total child population, as determined on an annual basis by the commissioner. A child's race, culture, or ethnicity is determined based upon a child's self-identification or identification of a child's race, culture, or ethnicity as reported by the child's parent or guardian.\n\"Egregious harm\" has the meaning given in section 260E.03, subdivision 5.\n\"Foster care placement\" means the temporary placement of an African American or a disproportionately represented child in foster care as defined in section 260C.007, subdivision 18, following the court-ordered removal of the child when the parent or legal custodian cannot have the child returned upon demand.\n\"Imminent physical damage or harm\" means that a child is threatened with immediate and present conditions that are life-threatening or likely to result in abandonment, sexual abuse, or serious physical injury. The existence of community or family poverty, isolation, single parenthood, age of the parent, crowded or inadequate housing, substance use, prenatal drug or alcohol exposure, mental illness, disability or special needs of the parent or child, or nonconforming social behavior does not by itself constitute imminent physical damage or harm.\n\"Responsible social services agency\" has the meaning given in section 260C.007, subdivision 27a.\n\"Parent\" means the biological parent of an African American or a disproportionately represented child or any person who has legally adopted an African American or a disproportionately represented child. Parent includes an unmarried father whose paternity has been acknowledged or established and a putative father. Paternity has been acknowledged when an unmarried father takes any action to hold himself out as the biological father of a child.\n\"Preadoptive placement\" means a responsible social services agency's placement of an African American or a disproportionately represented child when the child is under the guardianship of the commissioner for the purpose of adoption but an adoptive placement agreement for the child has not been fully executed.\n\"Relative\" has the meaning given in section 260C.007, subdivision 27.\n\"Safety network\" means a group of individuals identified by the parent and child, when appropriate, that is accountable for developing, implementing, sustaining, supporting, or improving a safety plan to protect the safety and well-being of a child.\n\"Sexual abuse\" has the meaning given in section 260E.03, subdivision 20.\n\"Termination of parental rights\" means an action resulting in the termination of the parent-child relationship under section 260C.301.",
	"repealed": false
}