{
	"id": "299C.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.37",
	"title": "299C.37 POLICE COMMUNICATION EQUIPMENT; USE, SALE.",
	"text": "(a) No person other than peace officers within the state, the members of the State Patrol, and persons who hold an amateur radio license issued by the Federal Communications Commission, shall equip any motor vehicle with any radio equipment or combination of equipment, capable of receiving any radio signal, message, or information from any police emergency frequency, or install, use, or possess the equipment in a motor vehicle without permission from the superintendent of the bureau upon a form prescribed by the superintendent. An amateur radio license holder is not entitled to exercise the privilege granted by this paragraph if the license holder has been convicted in this state or elsewhere of a crime of violence, as defined in section 624.712, subdivision 5, unless ten years have elapsed since the person has been restored to civil rights or the sentence has expired, whichever occurs first, and during that time the person has not been convicted of any other crime of violence. For purposes of this section, \"crime of violence\" includes a crime in another state or jurisdiction that would have been a crime of violence if it had been committed in this state. Radio equipment installed, used, or possessed as permitted by this paragraph must be under the direct control of the license holder whenever it is used. A person who is designated in writing by the chief law enforcement officer of a political subdivision issued a permit under subdivision 3 may use and possess radio equipment while in the course and scope of duties or employment without also having to obtain an individual permit.\n(b) Except as provided in paragraph (c), any person who is convicted of a violation of this subdivision shall, upon conviction for the first offense, be guilty of a misdemeanor, and for the second and subsequent offenses shall be guilty of a gross misdemeanor.\n(c) An amateur radio license holder who exercises the privilege granted by paragraph (a) shall carry the amateur radio license in the motor vehicle at all times and shall present the license to a peace officer on request. A violation of this paragraph is a petty misdemeanor. A second or subsequent violation is a misdemeanor.\n[Repealed, 1971 c 71 s 2]\n(a) The superintendent of the bureau shall, upon written application, issue a written permit, which shall be nontransferable, to a person, firm, political subdivision, or corporation showing good cause to use radio equipment capable of receiving a police emergency frequency, as a necessity, in the lawful pursuit of a business, trade, or occupation.\n(b) Notwithstanding paragraph (a), a permit is not required for emergency response personnel, as defined in section 299F.092, who are members of a public safety agency, as defined in section 403.02, to use agency-issued radio equipment as described in subdivision 1, paragraph (a), when:\n(1) the holder of a Federal Communications Commission (FCC) license has granted the public safety agency written permission for the use of the frequencies authorized under the FCC license; or\n(2) the agency is authorized to monitor or operate on any police emergency talk group on the ARMER public safety radio system in accordance with the technical and operational standards adopted by the Statewide Radio Board, as provided in section 403.37 or where the public safety agency use of a frequency allocated to police interoperability is consistent with any applicable rules or regulations.\n[Repealed, 1983 c 293 s 115]",
	"repealed": false
}