{
	"id": "240.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.14",
	"title": "240.14 RACING DAYS.",
	"text": "The commission shall assign racing days to each racetrack licensee authorized to conduct racing with pari-mutuel betting, and a licensee may conduct racing with pari-mutuel betting only on a racing day assigned by the commission. The assignment of racing days and times of racing to a facility licensed under section 240.06, subdivision 5a, may not prevent the commission from assigning to a racetrack in existence on January 1, 1987, the same or overlapping days or times. The commission may not assign non-standard-bred racing days for a racetrack licensed under section 240.06, subdivision 5a. The commission may assign racing days for up to three years beyond the year in which the assignment is made. Assignments of racing days in any year must be made by December 31 of the previous year, except that days may be assigned after that date to a licensee whose license is issued after that date.\nMS 1990 [Repealed, 1991 c 336 art 1 s 33]\nA public hearing is required before the commission may:\n(1) make an assignment of racing days;\n(2) revise the assignment during the year; or\n(3) assign racing days to a licensee whose license is issued after the initial assignment.\nThe commission may without a hearing assign one additional racing day to a licensee for each originally assigned racing day during the same racing meeting on which racing was not conducted for reasons beyond the licensee's control.\nThe commission may assign to a class D licensee the following racing days:\n(1) those racing days, not to exceed ten racing days, that coincide with the days on which the licensee's county fair is running; and\n(2) additional racing days.\nThe commission may, after a public hearing, rescind one or more racing days assigned to a licensee if it determines that the licensee has not met or will not meet the terms of the license. A day or days so rescinded may be reassigned to another licensee.",
	"repealed": false
}