{
	"id": "296A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.04",
	"title": "296A.04 SPECIAL FUEL DEALER'S LICENSE; REQUIREMENTS.",
	"text": "No person, except a licensed distributor, shall engage in the business of selling or delivering special fuel, upon which no tax has been imposed, as a special fuel dealer without having applied for and secured from the commissioner a special fuel dealer's license. The application shall be made in a form and manner prescribed by the commissioner and shall be accompanied by the payment of a $25 license fee. A special fuel dealer's license shall be issued to any responsible person qualifying as a special fuel dealer who makes proper application. The license shall be displayed in a conspicuous manner in the place of business and shall expire annually on November 30.\nThe provisions of section 296A.03, subdivision 2, paragraph (c), apply to special fuel dealers.\nMS 2018 [Repealed, 1Sp2019 c 6 art 11 s 20]\nA sales ticket shall be issued for each delivery of special fuel to a special fuel dealer or bulk purchaser. A sales ticket shall also be issued for each delivery into the supply tank of an aircraft or a licensed motor vehicle, if so requested by the purchaser. The person who delivers the special fuel shall issue the sales ticket and shall show on the ticket the name and address of the purchaser, date of sale, number of gallons, price per gallon, amount of tax, and total amount of sale.\nEvery special fuel dealer shall make all withdrawals of special fuel, except liquefied petroleum gas, through an accumulating meter in working order, which shall be provided by such dealer. Whenever a licensed special fuel dealer fails to comply with the provisions of this subdivision or any rules of the commissioner pertinent thereto, the license issued to such dealer under subdivision 1 may be revoked by the commissioner.\nA special fuel dealer who discontinues, sells, or disposes of the business in any manner, at any time, shall surrender the special fuel dealer's license at the commissioner's office in St. Paul, Minnesota.",
	"repealed": false
}