{
	"id": "430.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.06",
	"title": "430.06 SPREADING OF ASSESSMENT INSTALLMENTS.",
	"text": "The city clerk shall send a certified copy of the assessment roll to the auditor of the county in which assessed land lies. The auditor shall include five percent of the principal amount of the assessment as part of the taxes upon each parcel annually for 20 years, including annual interest at the rate ascertained. The city council and board of park commissioners may, by concurrent resolution, determine that the amount of the assessment must be collected in five or ten equal annual installments instead of 20. In that case the county auditor shall include a corresponding percentage of the principal amount of the assessment as part of the annual taxes, including annual interest, until the principal amount is collected.\nThe auditor shall include in the annual taxes one of the installments and one year's interest upon that installment, and all subsequent installments at the same rate. Each installment, together with interest, must be collected with the annual taxes upon the land, together with penalties and interest on default. All of these must be collected with and enforced as the annual taxes and credited to the proper city fund.\nAny parcel assessed may be discharged from the assessment at any time after the auditor receives the assessment by paying all installments that have gone into the hands of the county treasurer, with accrued interest, penalties, and costs, and by paying all subsequent installments; or any parcel assessed may be discharged from the assessment by presenting certificates or bonds sold against the assessments under this chapter, sufficient in amount to cover all installments due on that parcel and accrued interest, penalties, and costs, and all installments yet to accrue, by surrendering the certificates or bonds to the county treasurer for cancellation or having endorsed on them the installments, interest, penalties, and costs.\nAn assessment is a lien on the land against the owner and every person in any way interested in the land. The owner and any person interested in the land may defend against an assessment at the time of application for judgment in the regular proceedings for the enforcement of delinquent taxes. The assessment is not invalid because of any irregularity if the notices have been published substantially as required. No defense is allowed except upon the ground that the cost of the improvement is substantially less than the amount of the assessment, and then only to the extent of the difference between the assessment and the actual cost.\nAssessments made under this chapter must be called special street, motor vehicle parking lot, and parkway assessments of the city of ..... and numbered consecutively. When an assessment is certified by the city clerk to the county auditor, a duplicate must be sent to the city comptroller; all assessments must be sufficiently identified by name and number.",
	"repealed": false
}