{
	"id": "342.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.55",
	"title": "342.55 DUTIES OF HEALTH CARE PRACTITIONERS; REGISTRY PROGRAM.",
	"text": "Before a patient's enrollment in the registry program, a health care practitioner must:\n(1) determine, in the health care practitioner's medical judgment, whether a patient has a qualifying medical condition and, if so determined, provide the patient with a certification of that diagnosis;\n(2) advise patients, registered designated caregivers, and parents, legal guardians, and spouses acting as caregivers of any nonprofit patient support groups or organizations;\n(3) provide to patients explanatory information from the office, including information about the experimental nature of the therapeutic use of medical cannabis flower and medical cannabinoid products; the possible risks, benefits, and side effects of the proposed treatment; and the application and other materials from the office;\n(4) provide to patients a Tennessen warning as required under section 13.04, subdivision 2; and\n(5) agree to continue treatment of the patient's qualifying medical condition and to report findings to the office.\nUpon receiving notification from the office of the patient's enrollment in the registry program, a health care practitioner must:\n(1) participate in the patient registry reporting system under the guidance and supervision of the office;\n(2) report to the office patient health records throughout the patient's ongoing treatment in a manner determined by the office and in accordance with subdivision 4;\n(3) determine, every three years, if the patient continues to have a qualifying medical condition and, if so, issue the patient a new certification of that diagnosis. The patient assessment conducted under this clause may be conducted via telehealth, as defined in section 62A.673, subdivision 2; and\n(4) otherwise comply with requirements established by the office.\nNothing in this section requires a health care practitioner to participate in the registry program.\nData on patients collected by a health care practitioner and reported to the registry program, including data on patients who are veterans who receive care from the United States Department of Veterans Affairs, are health records under section 144.291 and are private data on individuals under section 13.02 but may be used or reported in an aggregated nonidentifiable form as part of a scientific peer-reviewed publication of research conducted under section 342.54 or in the creation of summary data, as defined in section 13.02, subdivision 19.\nThe requirements of this section do not apply to a patient who is a veteran who receives care from the United States Department of Veterans Affairs or a health care practitioner employed by the United States Department of Veterans Affairs. Such a patient must meet the certification requirements developed pursuant to section 342.52, subdivision 3, before the patient's enrollment in the registry program.",
	"repealed": false
}