{
	"id": "430.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.07",
	"title": "430.07 METHOD OF IMPROVEMENTS; ASSESSMENTS.",
	"text": "The city council and park commissioners may, by concurrent resolution, or by separate resolution when acting separately, specify the method of improving any street, pedestrian mall, park, or parkway under this chapter, including grading, drainage, planting, street lighting, paving, curbing, building gutters and sidewalks, installing sewer and water mains where necessary in the case of parks, and installing necessary structures and apparatus for playgrounds and general park uses.\n\"Pedestrian mall improvement\" means an improvement designed and to be used primarily for the movement, safety, convenience, and enjoyment of pedestrians, whether or not a part of a street is set apart for roadway for emergency vehicles, transit vehicles, or private vehicles. A \"pedestrian mall improvement\" may provide and include space for seating, cafe tables, shelters, trees, flower plantings, sculptures, newsstands, telephone booths, traffic signs, kiosks, fire hydrants, street lighting, ornamental signs, ornamental lights, trash receptacles, display cases, marquees, awnings, canopies, overhead radiant heating fixtures, underground radiant heating pipes and devices, walls, bollards and chains, and similar fixtures, equipment, facilities, and appurtenances which, in the judgment of the council, will enhance the movement, safety, convenience, and enjoyment of pedestrians and benefit the city and adjoining properties. Sidewalks on pedestrian malls may be constructed of concrete, bricks, asphalt tiles, blocks, granite sets or other materials and combinations of materials the council approves.\nThe council may narrow a roadway to be maintained in connection with a pedestrian mall, may have street vaults reconstructed or removed, may construct crosswalks at any point within a block and at the ends of blocks, and may design the roadway to curve and meander within the limits of the street regardless of the uniformity of width of the street or curve or absence of curve in the centerline of the street to enhance the usefulness and appearance of a pedestrian mall.\nThe city engineer shall estimate the cost of each item in an improvement separately or by reasonable classifications detailed to the satisfaction of the city council or the park commissioners, and shall submit the estimate with the plat. In the case of property used for residential purposes only for no more than a four-family dwelling, these estimates may not exceed six-inch water mains and 24-inch sewers. The city council shall examine the estimates, change them if necessary, and adopt an estimate of the cost. The city council, in appointing commissioners, shall provide the estimate, and the commissioners shall assess the amount of the estimate or a part of it as directed by the city council, upon land in the city they consider specifically benefited, in proportion to the benefits and not exceeding the actual benefit to a parcel. The commissioners shall add these assessments to the benefits assessed under section 430.02 and report the net result of damages or benefits as required by section 430.02. The procedure following the report must be the same as that following a report under section 430.02.\nIf, in proceedings under this chapter, the actual cost of the improvement of a street, park, or parkway is less than the estimated cost adopted by the city council, the council shall cancel and annul the assessments made in the proceedings to a total amount that does not exceed the fractional part of the total amount of the excess of estimated cost over the actual cost equivalent to the fraction obtained by dividing the total amount of the assessments by the total amount of the estimated cost.\nIf the assessments in a proceeding have not been entirely collected, or if the city council considers that assessments cannot be fully collected, the council may direct the city comptroller to keep in the fund in the proceeding an amount the city council thinks will cover the deficiencies in the collection of the assessments. The city council shall direct that the rest of the excess of estimated cost must be disposed of in the following manner. The city council shall direct the city comptroller to certify the amount of this balance to the county auditor. The auditor shall deduct the amount from the first installment of the assessment to be collected after the receipt of the certificate. This deduction must be made from the assessment against each piece or parcel of property in the proportion that the excess, as certified by the city comptroller, bears to the total of the installment of the assessment. If the balance as certified exceeds one installment, it must be deducted from succeeding installments until it is fully deducted. Alternatively, the city council may direct that the city comptroller's certification of the excess be accompanied by a request that the excess be applied to reduce all unpaid installments in proportion to the amount of such unpaid installments. In that case, the assessment rolls shall be recomputed by reducing the amount of the original assessment against each piece or parcel of property in the proportion that the excess, as certified by the city comptroller, bears to the total original assessment. The balance for each piece or parcel of property, after deduction of principal installments previously paid or in the process of collection, shall then be divided into equal annual installments of principal or equal annual installments of principal and interest, whichever method was used for the original assessments. The same rate of interest and collection period shall apply to the new installments as was provided for the original assessment.\nIf the assessment against a piece or parcel of property has been paid in full, and the amount to be refunded does not exceed $1, the city council may deposit the amount of the potential refund in the city's permanent improvement fund or bond redemption fund.\nIf the amount to be refunded exceeds $1, but does not exceed $20, the city comptroller shall mail to the current owner of the property a notice stating that the refund is available. The notice must be mailed within 60 days after the city council determines the actual cost of the improvement.\nIf the amount to be refunded exceeds $20 the following notice procedure must be followed. The city comptroller shall mail to the person who owned the property when the assessment was paid, at the person's last known address, a notice stating that the refund is available. The notice must be mailed within 60 days after the city council determines the actual cost of the improvement. If a response is not received from the owner within ten days of the date of mailing, a second notice must be mailed. If the refund is not claimed by the person who owned the property when the assessment was paid within 30 days of the date of mailing the last required notice, the city council may deposit the amount of the potential refund in the city's permanent improvement fund or bond redemption fund.\nIf some of the damages and cost of the improvement has been paid by the city, the city council shall direct the city comptroller to certify to the county auditor only that part of the excess of estimated cost equal to the part of the total estimated cost of the improvement and damages that has been or is assessed against benefited property. The council shall not direct that a certificate be issued to the county auditor until the city engineer reports that the improvement work has been completed and each item of damage or cost in the proceeding has been paid. This report by the city engineer must be made to the city council immediately upon completion of the work in the proceeding. In a proceeding where there is or may be an excess of estimated cost and there is or will be a balance in the fund in the proceeding over and above the actual cost, the city council may withdraw from the fund a percentage of the fund equal to the percentage of the cost of the improvement paid by the city and have this money deposited in the fund from which it was originally drawn or taken by the city council.\nA street, park, parkway, or pedestrian mall may be improved and the cost assessed and raised under this chapter, including the following improvements: widening, grading, drainage, planting, pavement, sidewalks, curb and gutter, sewers and water mains, and in the case of parks, the necessary structures and apparatus for playgrounds and general park uses. For streets or parkways over 80 feet wide, the resolution may, to facilitate connections with private property and avoid cutting or breaking into the improvements, order a double water main or a double sewer, one on either side of the street or parkway, or adopt another feasible arrangement or device.",
	"repealed": false
}