{
	"id": "524.5-416",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-416",
	"title": "524.5-416 TERMS AND REQUIREMENTS OF BOND.",
	"text": "(a) The following rules apply to any bond required:\n(1) Except as otherwise provided by the terms of the bond, sureties and the conservator are jointly and severally liable.\n(2) By executing the bond of a conservator, a surety submits to the jurisdiction of the court that issued letters to the primary obligor in any proceeding pertaining to the fiduciary duties of the conservator in which the surety is named as a party. Notice of any proceeding seeking to surcharge any interested party or the bond must be sent or delivered to the surety at the address shown in the court records at the place where the bond is filed and to any other address then known to the petitioner.\n(3) On petition of a successor conservator or any interested person, a proceeding may be brought against a surety for breach of the obligation of the bond of the conservator.\n(4) The bond of the conservator may be proceeded against until liability under the bond is exhausted.\n(5) Except as otherwise provided in this section, in any proceeding where the value of the personal property of the estate of the proposed person subject to conservatorship in the initial inventory of the estate filed by the conservator under section 524.5-419 is expected to be at least $10,000, the court shall require the conservator to furnish a bond in an amount that the court determines is necessary to reasonably protect the assets of the person subject to conservatorship. Joint conservators may unite in a bond or each may give a separate bond.\n(b) In lieu of executing and filing a bond, the conservator may request that access to certain assets of the person subject to conservatorship be blocked. The court may grant the request if sufficient evidence is filed with the court to establish that those assets are being held in a manner that prevents the conservator from accessing the assets without a specific court order or the court finds that the manner in which the assets are held is sufficient to protect the assets. To the extent that assets not placed in blocked accounts are expected to be at least $10,000, the bond requirement under paragraph (a) applies.\n(c) A proceeding may not be brought against a surety on any matter as to which an action or proceeding against the primary obligor is barred.",
	"repealed": false
}