{
	"id": "142G.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.62",
	"title": "142G.62 INJURY PROTECTION FOR WORK EXPERIENCE PARTICIPANTS.",
	"text": "(a) This section must be used to determine payment of any claims resulting from an alleged injury or death of a person participating in a county or a tribal uncompensated work experience program under section 142G.50, subdivision 11, paragraph (a), clause (3), that is approved by the commissioner and is operated by:\n(1) the county agency;\n(2) the tribe;\n(3) a state agency; or\n(4) a community-based organization under contract with a tribe or county agency to provide an uncompensated work experience program or the Supplemental Nutrition Assistance Program (SNAP) employment and training program under section 142F.10.\n(b) This section applies to the community work experience program under section 142G.61, the Supplemental Nutrition Assistance Program uncompensated work experience programs, and other uncompensated work programs approved by the commissioner for persons applying for or receiving cash assistance. Uncompensated work experience programs are considered to be approved by the commissioner if they are included in an approved tribal or county biennial service agreement under section 142G.76, subdivision 4.\nClaims that are subject to this section must be investigated by the county agency or tribe responsible for placing a participant in an uncompensated work experience program to determine whether the claimed injury occurred, whether the claimed medical expenses are reasonable, and whether the loss is covered by the claimant's insurance. If insurance coverage is established, the county agency or tribe shall submit the claim to the appropriate insurance entity for payment. The investigating county agency or tribe shall submit all remaining claims, in the amount net of any insurance payments, to the Department of Children, Youth, and Families.\nThe commissioner shall submit all claims for permanent partial disability compensation to the commissioner of labor and industry. The commissioner of labor and industry shall review all submitted claims and recommend to the Department of Children, Youth, and Families an amount of compensation comparable to that which would be provided under the permanent partial disability compensation schedule of section 176.101, subdivision 2a.\nThe commissioner shall approve a claim of $1,000 or less for payment if appropriated funds are available, if the county agency or tribe responsible for placing a participant in an uncompensated work experience program has made the determinations required by this section, and if the work program was operated in compliance with the safety provisions of this section. The commissioner shall pay the portion of an approved claim of $1,000 or less that is not covered by the claimant's insurance within three months of the date of submission. On or before February 1 of each year, the commissioner shall submit to the appropriate committees of the senate and the house of representatives a list of claims of $1,000 or less paid during the preceding calendar year and shall be reimbursed by legislative appropriation for any claims that exceed the original appropriation provided to the commissioner to operate the injury protection program for uncompensated work experience participants. Any unspent money from this appropriation shall carry over to the second year of the biennium, and any unspent money remaining at the end of the second year shall be returned to the state general fund.\nOn or before February 1 of each year, the commissioner shall submit to the appropriate committees of the senate and the house of representatives a list of claims in excess of $1,000 and a list of claims of $1,000 or less that were submitted to but not paid by the commissioner, together with any recommendations of appropriate compensation. These claims shall be heard and determined by the appropriate committees of the senate and house of representatives and, if approved, must be paid under the legislative claims procedure.\nCompensation paid under this section is limited to reimbursement for reasonable medical expenses and permanent partial disability compensation for disability in like amounts as allowed in section 176.101, subdivision 2a. Compensation for injuries resulting in death shall include reasonable medical expenses and burial expenses in addition to payment to the participant's estate in an amount up to $200,000. No compensation shall be paid under this section for pain and suffering, lost wages, or other benefits provided in chapter 176. Payments made under this section shall be reduced by any proceeds received by the claimant from any insurance policy covering the loss. For the purposes of this section, \"insurance policy\" does not include the medical assistance program authorized under chapter 256B.\nThe procedures established by this section apply to uncompensated work experience programs under subdivision 1 and are exclusive of all other legal, equitable, and statutory remedies against the state, its political subdivisions, or employees of the state or its political subdivisions under section 13.02, subdivision 11. The claimant shall not be entitled to seek damages from any state, county, tribal, or reservation insurance policy or self-insurance program. A provider who accepts or agrees to accept an injury protection program payment for services provided to an individual must not require any payment from the individual.\nA claim is invalid for purposes of this section if the county agency or tribe responsible for placing a participant cannot verify to the commissioner:\n(1) that appropriate safety training and information is provided to all persons being supervised by the uncompensated work experience site under this section; and\n(2) that all programs under subdivision 1 comply with federal Occupational Safety and Health Administration and state Department of Labor and Industry safety standards. An invalid claim due to a failure to verify safety training or compliance with safety standards will not be paid by the Department of Children, Youth, and Families or through the legislative claims process and must be heard, decided, and paid, if appropriate, by the county agency or tribe responsible for placing the claimant.",
	"repealed": false
}