{
	"id": "160.276",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.276",
	"title": "160.276 TRAVEL INFORMATION ADVERTISING PROGRAM.",
	"text": "The commissioner of transportation may lease advertising space within travel information centers and safety rest areas for the purpose of providing information to travelers through travel-related commercial and public service advertising.\nMS 2002 [Repealed by amendment, 2004 c 295 art 2 s 7]\nThe commissioner of transportation, by public negotiation or bid, shall enter into agreements for the purposes of this section.\nThe commissioner may contract to permit a vendor to construct, operate, and maintain additional information structures by and at the expense of the vendor on state-owned lands within safety rest areas or travel information center areas. All structures constructed by the vendor must meet or exceed specifications prescribed by the commissioner of transportation and must satisfy the requirements of the State Building Code for accessibility by the physically disabled. The vendor shall design all structures to enhance the site and surroundings in a manner harmonious with the natural environment as determined by the commissioner.\nThe commissioner shall require the vendor to obtain liability insurance in an amount prescribed by the commissioner jointly insuring the state and the vendor against any and all liability for claims for damage occurring wholly or partly because of the existence of the vendor contract.\nThe commissioner shall determine the sites to be included in this program and shall also determine the extent and location of space available for advertising in each facility.\nThe commissioner shall provide space free of charge to Explore Minnesota Tourism for travel information centers. The commissioner shall not charge Explore Minnesota Tourism for any regular expenses associated with the operation of the travel information centers. The commissioner shall provide highway maps free of charge for use and distribution through the travel information centers.\nEach vendor agreement must contain the following provisions:\n(1) that the vendor shall comply with Code of Federal Regulations, title 23, part 752, and subsequent revisions pertaining to privately operated information systems;\n(2) that at least 40 percent of the commercial advertising space must be offered initially for a reasonable period of time to local advertisers who provide services for travelers within a 60-mile radius of the safety rest area or travel information center;\n(3) that the vendor shall make appropriate marketing efforts in an attempt to lease at least 40 percent of the commercial advertising space to local advertisers;\n(4) reasonable performance standards, and maintenance standards for structures constructed by the vendor; and\n(5) limitations on advertising space within state-owned buildings or on state-owned property in safety rest areas and travel information centers.\nThe commissioner of transportation may require additional reasonable terms and conditions to be included in the vendor agreement, including but not limited to provisions governing the renewal and termination of the agreement and, in the event of termination, the rights of the state and the vendor in advertising contracts and in buildings constructed by the vendor.\nThe agreement may provide that the vendor pay a portion of the gross revenues derived from advertising. These revenues must be paid to the state for deposit in the safety rest area account established in section 160.2745. The commissioner of transportation and director of Explore Minnesota Tourism may enter into an interagency agreement to define the distribution of the revenues generated in this subdivision and subdivisions 2a and 3a.",
	"repealed": false
}