{
	"id": "124D.957",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.957",
	"title": "124D.957 MINNESOTA YOUTH COUNCIL COMMITTEE.",
	"text": "The Minnesota Youth Council Committee is established within and under the auspices of the Minnesota Alliance With Youth. The committee consists of four members from each congressional district in Minnesota and four members selected at-large. Members must be selected through an application and interview process conducted by the Minnesota Alliance With Youth. In making its appointments, the Minnesota Alliance With Youth should strive to ensure gender and ethnic diversity in the committee's membership. Members must be in grades 8 through 12 and serve two-year terms, except that one-half of the initial members must serve a one-year term. Members may serve a maximum of two terms.\nThe Minnesota Youth Council Committee shall:\n(1) provide advice and recommendations to the legislature and the governor on issues affecting youth;\n(2) serve as a liaison for youth around the state to the legislature and the governor; and\n(3) submit an annual report of the council's activities and goals.\nThe Minnesota Youth Council Committee shall partner with nonprofits, the private sector, and educational resources to fulfill its duties.\n(a) The Minnesota Youth Council Committee shall meet at least twice each year during the regular session of the legislature.\n(b) The committee may:\n(1) select introduced bills in the house of representatives and senate for consideration for a public hearing before the committee;\n(2) propose youth legislation;\n(3) provide advisory opinions to the legislature on bills heard before the committee; and\n(4) prepare a youth omnibus bill.\n(c) The leaders of the majority and minority parties of the house of representatives and senate shall each appoint one legislator to serve as a legislative liaison to the committee. Leadership of the house of representatives and senate, on rotating years, may appoint a staff member to staff the committee.",
	"repealed": false
}