{
	"id": "245C.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.28",
	"title": "245C.28 CONTESTED CASE HEARING RIGHTS.",
	"text": "(a) If a maltreatment determination or a disqualification for which reconsideration was timely requested and which was not set aside is the basis for a denial of a license under section 245A.05 or a licensing sanction under section 245A.07, the license holder has the right to a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The license holder must submit the appeal under section 245A.05 or 245A.07, subdivision 3.\n(b) As provided under section 245A.08, subdivision 2a, if the denial of a license or licensing sanction is based on a disqualification for which reconsideration was timely requested and was not set aside, the scope of the consolidated contested case hearing must include:\n(1) the disqualification, to the extent the license holder otherwise has a hearing right on the disqualification under this chapter; and\n(2) the licensing sanction or denial of a license.\n(c) As provided for under section 245A.08, subdivision 2a, if the denial of a license or licensing sanction is based on a determination of maltreatment under section 626.557 or chapter 260E, or a disqualification for serious or recurring maltreatment which was not set aside, the scope of the contested case hearing must include:\n(1) the maltreatment determination, if the maltreatment is not conclusive under section 245C.29;\n(2) the disqualification, if the disqualification is not conclusive under section 245C.29; and\n(3) the licensing sanction or denial of a license. In such cases, a fair hearing must not be conducted under section 256.045. If the disqualification was based on a determination of substantiated serious or recurring maltreatment under section 626.557 or chapter 260E, the appeal must be submitted under section 245A.07, subdivision 3, 260E.33, or 626.557, subdivision 9d.\n(d) Except for family child care and child foster care, reconsideration of a maltreatment determination under sections 260E.33 and 626.557, subdivision 9d, and reconsideration of a disqualification under section 245C.22, must not be conducted when:\n(1) a denial of a license under section 245A.05, or a licensing sanction under section 245A.07, is based on a determination that the license holder is responsible for maltreatment or the disqualification of a license holder based on serious or recurring maltreatment;\n(2) the denial of a license or licensing sanction is issued at the same time as the maltreatment determination or disqualification; and\n(3) the license holder appeals the maltreatment determination, disqualification, and denial of a license or licensing sanction. In such cases a fair hearing under section 256.045 must not be conducted under sections 245C.27, 260E.33, and 626.557, subdivision 9d. Under section 245A.08, subdivision 2a, the scope of the consolidated contested case hearing must include the maltreatment determination, disqualification, and denial of a license or licensing sanction.\nNotwithstanding clauses (1) to (3), if the license holder appeals the maltreatment determination or disqualification, but does not appeal the denial of a license or a licensing sanction, reconsideration of the maltreatment determination shall be conducted under sections 260E.33 and 626.557, subdivision 9d, and reconsideration of the disqualification shall be conducted under section 245C.22. In such cases, a fair hearing shall also be conducted as provided under sections 245C.27, 260E.33, and 626.557, subdivision 9d.\nIf the basis for the commissioner's denial of a license under section 245A.05 or a licensing sanction under section 245A.07 is a maltreatment determination or disqualification that was not set aside under section 245C.22, and the disqualified subject is an individual other than the license holder and upon whom a background study must be conducted under section 245C.03, the hearing of all parties may be consolidated into a single contested case hearing upon consent of all parties and the administrative law judge.\n(a) A disqualified individual who is an employee of an employer, as defined in section 179A.03, subdivision 15, may request a contested case hearing under chapter 14, and specifically Minnesota Rules, parts 1400.8505 to 1400.8612, following a reconsideration decision under section 245C.23, unless the disqualification is deemed conclusive under section 245C.29. The request for a contested case hearing must be made in writing and must be postmarked and sent within 30 calendar days after the employee receives notice of the reconsideration decision. If the individual was disqualified based on a conviction or admission to any crimes listed in section 245C.15, the scope of the contested case hearing shall be limited solely to whether the individual poses a risk of harm pursuant to section 245C.22.\n(b) When an individual is disqualified based on a maltreatment determination, the scope of the contested case hearing under paragraph (a), must include the maltreatment determination and the disqualification. In such cases, a fair hearing must not be conducted under section 256.045.\n(c) Rules adopted under this chapter may not preclude an employee in a contested case hearing for a disqualification from submitting evidence concerning information gathered under this chapter.\n(d) When an individual has been disqualified from multiple licensed programs, if at least one of the disqualifications entitles the person to a contested case hearing under this subdivision, the scope of the contested case hearing shall include all disqualifications from licensed programs.\n(e) In determining whether the disqualification should be set aside, the administrative law judge shall consider all of the characteristics that cause the individual to be disqualified, as well as all the factors set forth in section 245C.22, in order to determine whether the individual has met the burden of demonstrating that the individual does not pose a risk of harm. The administrative law judge's recommendation and the commissioner's order to set aside a disqualification that is the subject of the hearing constitutes a determination that the individual does not pose a risk of harm and that the individual may provide direct contact services in the individual program specified in the set aside.\n(f) An individual may not request a contested case hearing under this section if a contested case hearing has previously been held regarding the individual's disqualification on the same basis.\nThe commissioner's final order under section 245A.08, subdivision 5, is conclusive on the issue of maltreatment and disqualification, including for purposes of subsequent background studies. The contested case hearing under this section is the only administrative appeal of the final agency determination, specifically, including a challenge to the accuracy and completeness of data under section 13.04.",
	"repealed": false
}