{
	"id": "260C.704",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.704",
	"title": "260C.704 REQUIREMENTS FOR THE QUALIFIED INDIVIDUAL'S ASSESSMENT OF THE CHILD FOR PLACEMENT IN A QUALIFIED RESIDENTIAL TREATMENT PROGRAM.",
	"text": "(a) A qualified individual must complete an assessment of the child prior to the child's placement in a qualified residential treatment program in a format approved by the commissioner of human services unless, due to a crisis, the child must immediately be placed in a qualified residential treatment program. When a child must immediately be placed in a qualified residential treatment program without an assessment, the qualified individual must complete the child's assessment within 30 days of the child's placement. The qualified individual must:\n(1) assess the child's needs and strengths, using an age-appropriate, evidence-based, validated, functional assessment approved by the commissioner of human services;\n(2) determine whether the child's needs can be met by the child's family members or through placement in a family foster home; or, if not, determine which residential setting would provide the child with the most effective and appropriate level of care to the child in the least restrictive environment;\n(3) develop a list of short- and long-term mental and behavioral health goals for the child; and\n(4) work with the child's family and permanency team using culturally competent practices.\nIf a level of care determination was conducted under section 245.4885, that information must be shared with the qualified individual and the juvenile treatment screening team.\n(b) The child and the child's parents, when appropriate, may request that a specific culturally competent qualified individual complete the child's assessment. The agency shall make efforts to refer the child to the identified qualified individual to complete the assessment. The assessment must not be delayed for a specific qualified individual to complete the assessment.\n(c) The qualified individual must provide the assessment, when complete, to the responsible social services agency. If the assessment recommends placement of the child in a qualified residential treatment facility, the agency must distribute the assessment to the child's parent or legal guardian and file the assessment with the court report as required in section 260C.71, subdivision 2. If the assessment does not recommend placement in a qualified residential treatment facility, the agency must provide a copy of the assessment to the parents or legal guardians and the guardian ad litem and file the assessment determination with the court at the next required hearing as required in section 260C.71, subdivision 5. If court rules and chapter 13 permit disclosure of the results of the child's assessment, the agency may share the results of the child's assessment with the child's foster care provider, other members of the child's family, and the family and permanency team. The agency must not share the child's private medical data with the family and permanency team unless: (1) chapter 13 permits the agency to disclose the child's private medical data to the family and permanency team; or (2) the child's parent has authorized the agency to disclose the child's private medical data to the family and permanency team.\n(d) For an Indian child, the assessment of the child must follow the order of placement preferences in the Indian Child Welfare Act of 1978, United States Code, title 25, section 1915.\n(e) In the assessment determination, the qualified individual must specify in writing:\n(1) the reasons why the child's needs cannot be met by the child's family or in a family foster home. A shortage of family foster homes is not an acceptable reason for determining that a family foster home cannot meet a child's needs;\n(2) why the recommended placement in a qualified residential treatment program will provide the child with the most effective and appropriate level of care to meet the child's needs in the least restrictive environment possible and how placing the child at the treatment program is consistent with the short-term and long-term goals of the child's permanency plan; and\n(3) if the qualified individual's placement recommendation is not the placement setting that the parent, family and permanency team, child, or tribe prefer, the qualified individual must identify the reasons why the qualified individual does not recommend the parent's, family and permanency team's, child's, or tribe's placement preferences. The out-of-home placement plan under section 260C.708 must also include reasons why the qualified individual did not recommend the preferences of the parents, family and permanency team, child, or tribe.\n(f) If the qualified individual determines that the child's family or a family foster home or other less restrictive placement may meet the child's needs, the agency must move the child out of the qualified residential treatment program and transition the child to a less restrictive setting within 30 days of the determination. If the responsible social services agency has placement authority of the child, the agency must make a plan for the child's placement according to section 260C.212, subdivision 2. The agency must file the child's assessment determination with the court at the next required hearing.\n(g) If the qualified individual recommends placing the child in a qualified residential treatment program and if the responsible social services agency has placement authority of the child, the agency shall make referrals to appropriate qualified residential treatment programs and, upon acceptance by an appropriate program, place the child in an approved or certified qualified residential treatment program.",
	"repealed": false
}