{
	"id": "4.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/4.06",
	"title": "4.06 VACANCY; SUCCESSION; DISABILITY.",
	"text": "(a) When a vacancy occurs, from any cause whatever, in the office of governor, the lieutenant governor shall become governor and the last duly elected president of the senate shall become lieutenant governor for the remainder of the term. When a vacancy occurs, from any cause whatever, in the office of governor and in the office of lieutenant governor, the president of the senate shall become governor for the remainder of the term. If there be no president of the senate, then the speaker of the house shall become governor for the remainder of the term; or if there be none, then the secretary of state, or the auditor, or the attorney general, in that order, shall upon resignation from office, become governor for the remainder of the term.\n(b) In case of the death or other failure to take office of the governor-elect, the lieutenant governor-elect shall become governor from the same time and in the same manner and for the same term as provided for the governor-elect. In case of the death or other failure to take office of both the governor-elect and lieutenant governor-elect, the last duly elected president of the senate, or in the case of death or other failure to take office, the last duly elected speaker of the house, or in the case of death or other failure to take office, the secretary of state-elect, or under the same circumstances the auditor-elect, or the attorney general-elect, in that order shall become governor from the same time and in the same manner and for the same term as provided for the governor-elect.\n(c) If the governor transmits to the president of the senate and the speaker of the house a written declaration of an inability to discharge the powers and duties of the office of governor, and until the governor transmits a written declaration to the contrary, the powers and duties of the governor shall be discharged by the lieutenant governor.\n(d) The governor may be declared unable to discharge the powers and duties of the office if a declaration is signed by four out of five of the following persons and transmitted to the president of the senate and the speaker of the house: the chief justice of the supreme court, the lieutenant governor, the governor's chief of staff, the governor's personal physician, and a member of the governor's cabinet designated in advance by the governor. If no cabinet member has been designated, three out of four shall be sufficient. The lieutenant governor shall then discharge the powers and duties of the office of governor.\n(e) The declaration remains in effect until the governor transmits to the president of the senate and the speaker of the house a written declaration that no inability exists, unless four out of five of the persons described in paragraph (d), or three out of four if no cabinet member has been designated, sign and transmit to the president of the senate and the speaker of the house within four days of the governor's declaration a declaration that the governor is unable to discharge the powers and duties of the office. In that event, the lieutenant governor shall continue to discharge the duties of the office until the legislature decides the issue, assembling within 48 hours for that purpose if not in session. If the legislature, within 21 days after receipt of the declaration that the governor is unable to discharge the powers and duties of the office or, if the legislature is not in session, within 21 days after being required to assemble, determines by two-thirds vote of both houses that the governor is unable to discharge the powers and duties of the office, the lieutenant governor shall continue to discharge the powers and duties of the office. Otherwise, the governor shall resume the powers and duties of the office.",
	"repealed": false
}