{
	"id": "94.346",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.346",
	"title": "94.346 TITLES.",
	"text": "The state may bring and maintain an action to quiet or register the title to any land or interest in land which it owns or claims in any capacity and to determine all adverse claims thereto under any law pertaining to such proceedings, whether or not the land is actually in possession of or occupied by the state or any other person or corporation.\n(a) The attorney general, at the request or with the approval of the board, may commence and carry on any necessary or proper actions to perfect the titles to lands owned by the state and subject to exchange under sections 94.341 to 94.347, and may authorize any county attorney or other attorney to assist in conducting any such action. The expenses of these actions, including such attorneys' fees as the attorney general may allow to county attorneys or other attorneys representing the state, shall be payable out of any appropriations available for the purposes of sections 94.341 to 94.347. Any county attorney performing such service shall be entitled to the fees allowed therefor in addition to regular compensation unless the salary is fixed on a full time basis.\n(b) In case an action is necessary to perfect the title to any privately owned land involved in an exchange hereunder, and the owner of the land is unable to bear the expense thereof, the Land Exchange Board may authorize the attorney general to conduct such action and pay the expenses thereof as in case of actions to perfect the title to state lands. The expenses of the action, including attorney's fees, shall be deducted from the value of the land for the purpose of exchange, subject to payment by the owner for any difference in value as herein provided, or shall be repaid by the owner otherwise upon such terms as the board may direct. All money received on account of such expenses shall be remitted to the commissioner of management and budget and credited to the fund from which the expenses were paid.",
	"repealed": false
}