{
	"id": "609.352",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.352",
	"title": "609.352 SOLICITATION OF CHILDREN TO ENGAGE IN SEXUAL CONDUCT; COMMUNICATION OF SEXUALLY EXPLICIT MATERIALS TO CHILDREN.",
	"text": "As used in this section:\n(a) \"child\" means a person 15 years of age or younger;\n(b) \"sexual conduct\" means sexual contact of the individual's primary genital area, sexual penetration as defined in section 609.341, or sexual performance as defined in section 617.246; and\n(c) \"solicit\" means commanding, entreating, or attempting to persuade a specific person in person, by telephone, by letter, or by computerized or other electronic means.\nA person 18 years of age or older who solicits a child or someone the person reasonably believes is a child to engage in sexual conduct with intent to engage in sexual conduct is guilty of a felony and may be sentenced as provided in subdivision 4.\nA person 18 years of age or older who uses the Internet, a computer, computer program, computer network, computer system, an electronic communications system, or a telecommunications, wire, or radio communications system, or other electronic device capable of electronic data storage or transmission to commit any of the following acts, with the intent to arouse the sexual desire of any person, is guilty of a felony and may be sentenced as provided in subdivision 4:\n(1) soliciting a child or someone the person reasonably believes is a child to engage in sexual conduct;\n(2) engaging in communication with a child or someone the person reasonably believes is a child, relating to or describing sexual conduct; or\n(3) distributing any material, language, or communication, including a photographic or video image, that relates to or describes sexual conduct to a child or someone the person reasonably believes is a child.\nA person may be convicted of an offense under subdivision 2a if the transmission that constitutes the offense either originates within this state or is received within this state.\n(a) Mistake as to age is not a defense to a prosecution under this section.\n(b) The fact that an undercover operative or law enforcement officer was involved in the detection or investigation of an offense under this section does not constitute a defense to a prosecution under this section.\nA person convicted under subdivision 2 or 2a is guilty of a felony and may be sentenced to imprisonment for not more than five years, or to payment of a fine of not more than $10,000, or both.",
	"repealed": false
}