{
	"id": "58B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/58B.06",
	"title": "58B.06 DUTIES OF STUDENT LOAN SERVICERS.",
	"text": "Upon receiving a written communication from a borrower, a student loan servicer must:\n(1) acknowledge receipt of the communication in less than ten days from the date the communication is received; and\n(2) provide information relating to the communication and, if applicable, the action the student loan servicer will take to either (i) correct the borrower's issue or (ii) explain why the issue cannot be corrected. The information must be provided less than 30 days after the date the written communication was received by the student loan servicer.\n(a) A student loan servicer must ask a borrower in what manner the borrower would like any overpayment to be applied to a student loan. A borrower's instruction regarding the application of overpayments is effective for the term of the loan or until the borrower provides a different instruction.\n(b) For purposes of this subdivision, \"overpayment\" means a payment on a student loan that exceeds the monthly amount due.\n(a) A student loan servicer must apply a partial payment in a manner intended to minimize late fees and the negative impact on the borrower's credit history. If a borrower has multiple student loans with the same student loan servicer, upon receipt of a partial payment the servicer must apply the payments to satisfy as many individual loan payments as possible.\n(b) For purposes of this subdivision, \"partial payment\" means a payment on a student loan that is less than the monthly amount due.\n(a) If a borrower's student loan servicer changes pursuant to the sale, assignment, or transfer of the servicing, the original student loan servicer must:\n(1) require the new student loan servicer to honor all benefits that were made available, or which may have become available, to a borrower from the original student loan servicer or are authorized under the student loan contract, including any benefits for which the student loan borrower has not yet qualified unless that benefit is no longer available under the federal or state laws and regulations; and\n(2) transfer to the new student loan servicer all information regarding the borrower, the account of the borrower, and the borrower's student loan, including but not limited to the repayment status of the student loan and the benefits described in clause (1).\n(b) The student loan servicer must complete the transfer under paragraph (a), clause (2), less than 45 days from the date of the sale, assignment, or transfer of the servicing.\n(c) A sale, assignment, or transfer of the servicing must be completed no less than seven days from the date the next payment is due on the student loan.\n(d) A new student loan servicer must adopt policies and procedures to verify that the original student loan servicer has met the requirements of paragraph (a).\n(a) A student loan servicer must evaluate a borrower for eligibility for an income-driven repayment program before placing a borrower in forbearance or default.\n(b) A student loan servicer must provide the following information on the student loan servicer's website:\n(1) a description of any income-driven repayment programs available under the student loan contract or federal or state laws and regulations; and\n(2) information on the policies and procedures the student loan servicer implements to facilitate the evaluation of student loan income-driven repayment program requests, including accurate information regarding any options that may be available to the borrower through the promissory note or that may have been marketed to the borrower through marketing materials.\nA student loan servicer must maintain adequate records of each student loan for not less than two years following the final payment on the student loan or the sale, assignment, or transfer of the servicing.",
	"repealed": false
}