{
	"id": "97A.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.041",
	"title": "97A.041 EXHIBITION OF WILDLIFE.",
	"text": "For the purposes of this section, \"wildlife\" means any wild mammal, wild bird, reptile, or amphibian.\nA person connected with a commercial enterprise may not possess wildlife in captivity for public exhibition purposes, except under permit as provided in this section.\nThe commissioner may issue a permit to possess wildlife for public exhibition to an applicant qualified by education or experience in the care and treatment of wildlife. The permit fee is $10. The commissioner may prescribe terms and conditions of the permit. A permit issued under this section shall include a condition that allows an enforcement officer to enter and inspect the facilities where the wildlife covered by the permit are held in captivity.\nAn application for a permit must include:\n(1) a statement regarding the education or experience in the care and treatment of wildlife of the applicant and each individual employed by the applicant for that purpose;\n(2) a description of the facilities used to keep the wildlife in captivity;\n(3) a statement of the number of species or subspecies of wildlife to be covered by the permit and a statement describing where and from whom the wildlife was acquired;\n(4) a signed agreement that the standards prescribed by the commissioner will be followed; and\n(5) other information requested by the commissioner.\nThe commissioner shall adopt, under chapter 14, reasonable standards for the care and treatment of captive wildlife for public display purposes, including standards of sanitation.\nIf a violation is found during an inspection, the commissioner shall give the permittee notice to abate the violation within an adequate time determined by the commissioner. If the violation has not been abated when the time expires, the commissioner may request the attorney general to bring an action to abate the violation.\nThis section does not apply to a publicly owned zoo or wildlife exhibit, privately owned traveling zoo or circus, or a pet shop.",
	"repealed": false
}