{
	"id": "364.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/364.03",
	"title": "364.03 RELATION OF CONVICTION TO EMPLOYMENT OR OCCUPATION.",
	"text": "Notwithstanding any other provision of law to the contrary, no person shall be disqualified from public employment, nor shall a person be disqualified from pursuing, practicing, or engaging in any occupation for which a license is required solely or in part because of a prior conviction of a crime or crimes, unless the crime or crimes for which convicted directly relate to the position of employment sought or the occupation for which the license is sought.\nIn determining if a conviction directly relates to the position of public employment sought or the occupation for which the license is sought, the hiring or licensing authority shall consider:\n(1) the nature and seriousness of the crime or crimes for which the individual was convicted;\n(2) the relationship of the crime or crimes to the purposes of regulating the position of public employment sought or the occupation for which the license is sought;\n(3) the relationship of the crime or crimes to the ability, capacity, and fitness required to perform the duties and discharge the responsibilities of the position of employment or occupation.\n(a) A person who has been convicted of a crime or crimes which directly relate to the public employment sought or to the occupation for which a license is sought shall not be disqualified from the employment or occupation if the person can show competent evidence of sufficient rehabilitation and present fitness to perform the duties of the public employment sought or the occupation for which the license is sought. Competent evidence of sufficient rehabilitation may be established by the production of the person's most recent certified copy of a United States Department of Defense form DD-214 showing the person's honorable discharge, or separation under honorable conditions, from the United States armed forces for military service rendered following conviction for any crime that would otherwise disqualify the person from the public employment sought or the occupation for which the license is sought, or:\n(1) a copy of the local, state, or federal release order; and\n(2) evidence showing that at least one year has elapsed since release from any local, state, or federal correctional institution without subsequent conviction of a crime; and evidence showing compliance with all terms and conditions of probation or parole; or\n(3) a copy of the relevant Department of Corrections discharge order or other documents showing completion of probation or parole supervision.\n(b) In addition to the documentary evidence presented, the licensing or hiring authority shall consider any evidence presented by the applicant regarding:\n(1) the nature and seriousness of the crime or crimes for which convicted;\n(2) all circumstances relative to the crime or crimes, including mitigating circumstances or social conditions surrounding the commission of the crime or crimes;\n(3) the age of the person at the time the crime or crimes were committed;\n(4) the length of time elapsed since the crime or crimes were committed; and\n(5) all other competent evidence of rehabilitation and present fitness presented, including, but not limited to, letters of reference by persons who have been in contact with the applicant since the applicant's release from any local, state, or federal correctional institution.\n(c) The certified copy of a person's United States Department of Defense form DD-214 showing the person's honorable discharge or separation under honorable conditions from the United States armed forces ceases to qualify as competent evidence of sufficient rehabilitation for purposes of this section upon the person's conviction for any gross misdemeanor or felony committed by the person subsequent to the effective date of that honorable discharge or separation from military service.",
	"repealed": false
}