{
	"id": "299E.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/299E.01",
	"title": "299E.01 CAPITOL COMPLEX SECURITY DIVISION.",
	"text": "A division in the Department of Public Safety to be known as the Capitol Complex Security Division is under the supervision and control of the director of Capitol complex security, who must be a member of the State Patrol and to whom are assigned the duties and responsibilities described in this section. The commissioner may place the director's position in the unclassified service if the position meets the criteria of section 43A.08, subdivision 1a.\n(a) The division is responsible and must utilize state employees for security and public information services in state-owned buildings and state leased-to-own buildings in the Capitol Area, as described in section 15B.02. It must provide personnel as are required by the circumstances to insure the orderly conduct of state business and the convenience of the public. Until July 1, 2026, it must provide emergency assistance and security escorts at any location within the Capitol Area, as described in section 15B.02, when requested by a state constitutional officer.\n(b) As part of the division permanent staff, the director must establish the position of emergency manager that includes, at a minimum, the following duties:\n(1) oversight of the consolidation, development, and maintenance of plans and procedures that provide continuity of security operations;\n(2) the development and implementation of tenant training that addresses threats and emergency procedures; and\n(3) the development and implementation of threat and emergency exercises.\n(c) The director must provide a minimum of one state trooper assigned to the Capitol complex at all times.\n(d) The director, in consultation with the advisory committee under section 299E.04, shall, at least annually, hold a meeting or meetings to discuss, among other issues, Capitol complex security, emergency planning, public safety, and public access to the Capitol complex. The meetings must include, at a minimum:\n(1) Capitol complex tenants and state employees;\n(2) nongovernmental entities, such as lobbyists, vendors, and the media; and\n(3) the public and public advocacy groups.\nAll powers, duties and responsibilities heretofore assigned by law to the commissioner of administration relating to the general function of security in Capitol complex state-owned buildings are hereby transferred to the commissioner of public safety. The commissioner of public safety shall have the final authority regarding public safety and security in the Capitol complex. The commissioner of administration shall have the powers, duties, and responsibilities relating to the Capitol complex of state-owned buildings as provided under chapter 16B.\nMS 1969 [Repealed, Ex1971 c 48 s 8 subd 3]\nFor purposes of this section, the Capitol complex of state-owned buildings shall be as defined in chapter 15B, and acts amendatory thereof and such other state-owned or state-leased buildings and property within the Twin Cities metropolitan area as the governor from time to time may designate.\nNothing in this section shall be construed to conflict with the power of the legislature to appoint and assign such personnel and equipment as it deems necessary for the conduct of its business.\nTowing policy and practice for vehicles in public parking spaces within the Capitol complex must conform to provisions of section 168B.035.",
	"repealed": false
}