{
	"id": "462A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.07",
	"title": "462A.07 ADDITIONAL POWERS AND DUTIES OF THE AGENCY.",
	"text": "In addition to the powers granted in sections 462A.05 and 462A.06 the agency shall have the further powers granted in this section.\nIt may provide general technical services and support to assist in the planning, processing, design, construction or rehabilitation, and inspection of residential housing for occupancy by persons and families of low and moderate income and to increase the capacity of entities to meet the housing needs in the state.\nIt may provide underwriting, loan processing, and closing services in behalf of other lenders where those services are not otherwise available and the loans relate to residential housing for occupancy by low- and moderate-income persons and families. The agency may charge fees for those services in amounts determined by the members to be reasonable.\nIt may provide general consultative project assistance services for residential housing for occupancy by persons and families of low and moderate income and for the residents thereof with respect to management, training and social services, homeownership counseling and continuing technical home maintenance services.\nIt shall make available technical assistance to potential applicants to encourage applications for multifamily housing projects which afford residents participation in the ownership or management of the project.\nIt may promote research and development in scientific methods of constructing low cost residential housing of high durability.\nIt may enter into agreements with sponsors, mortgagors, or the issuers of securities for the purpose of regulating the planning, development, and management of housing projects financed in whole or in part by the proceeds of eligible loans or eligible securities purchased by the agency.\nIt may enter into agreements with housing and agreements with sponsors, redevelopment authorities or other appropriate local governmental units to foster multifamily housing rehabilitation and shall act to develop the agreements. It may give advance reservations of mortgage financing and federal rent subsidies as part of the agreements, with the understanding that the agency will only approve the mortgage loans pursuant to normal procedures, and may adopt special procedures designed to meet problems inherent in a program of multifamily housing rehabilitation. The agreements may include the United States Department of Housing and Urban Development when desirable and appropriate.\nIt may undertake and carry out studies and analyses of housing needs within the state and ways of meeting such needs including data with respect to population and family and size; and the distribution thereof according to income groups, the amount and quality of available housing and its distribution according to rentals and sales prices, employment, wages and other factors affecting housing needs and the meeting thereof; and may make the results of such studies and analyses available to the public and the housing and supply industries, and may engage in research and disseminate information on housing.\nIt may survey and investigate the housing conditions and needs, both urban and rural, throughout the state and make recommendations to the governor as to legislation and other measures necessary or advisable to alleviate any existing housing shortage in the state.\nIt may assist the commissioner of labor and industry in the development, implementation and revision of the State Building Code.\nIt may establish such rules as may be necessary to ensure that priority for assistance by the agency will be given to projects located in municipal jurisdictions or counties, which have adopted the uniform State Building Code.\nIn the exercise of the powers granted to it under this chapter, it shall promulgate rules as may be necessary to encourage counties and municipalities to promote the economical construction of housing units for persons and families of low and moderate income.\nIt may establish and enforce such rules as may be necessary to ensure compliance with chapter 363A, and to ensure that occupancy of housing assisted under this chapter shall be open to all persons, and that contractors and subcontractors engaged in the construction of such housing shall provide an equal opportunity for employment to all persons, without discrimination as to race, color, creed, religion, national origin, sex, marital status, age, and status with regard to public assistance or disability.\nIt may establish cooperative relationships with such regional county and multicounty housing authorities as may be established, including the Metropolitan Council, and may develop priorities for the utilization of agency resources and assistance within a region in cooperation with regional county and multicounty housing authorities.\nIt may delegate, use or employ any federal, state, regional or local public or private agency or organization, including organizations of physically disabled persons, upon terms it deems necessary or desirable, to assist in the exercise of any of the powers granted by this chapter and to carry out the objectives of this chapter and may pay for the services from the housing development fund.\nIt may engage or assist in the development and operation of low-income housing if the federal government provides assistance in connection with the housing and the development and operation is in conformity with the applicable provisions of federal laws and regulations. The agency shall determine whether the applicable federal laws governing use of such funds permit a portion thereof to be used for residential housing for American Indians within the state.\n(a) It may engage in housing programs for low- and moderate-income American Indians developed and administered separately or in combination by the Minnesota Chippewa tribe, the Red Lake band of Chippewa Indians, and the Sioux communities as determined by such tribe, band, or communities. In furtherance of the policy of economic integration stated in section 462A.02, subdivision 6, it may engage in housing programs for American Indians who intend to reside on reservations and who are not persons of low and moderate income, provided that the aggregate dollar amount of the loans for persons who are not of low- or moderate-income closed in each lender's fiscal year shall not exceed an amount equal to 25 percent of the total dollar amount of all loans closed by that lender during the same fiscal year. In developing such housing programs, the tribe, band, or communities shall take into account the housing needs of all American Indians residing both on and off reservations within the state. A plan for each such program, which specifically describes the program content, utilization of funds, administration, operation, implementation and other matter, as determined by the agency, must be submitted to the agency for its review and approval prior to the making of eligible loans pursuant to section 462A.21. All such programs must conform to rules promulgated by the agency concerning program administration, including but not limited to rules concerning costs of administration; the quality of housing; interest rates, fees, and charges in connection with making eligible loans; and other matters determined by the agency to be necessary in order to effectuate the purposes of this subdivision and section 462A.21, subdivisions 4b and 4c. All such programs must provide for a reasonable balance in the distribution of funds appropriated for the purpose of this section between American Indians residing on and off reservations within the state. Nothing in this section shall preclude such tribe, band, or communities from requesting and receiving cooperation, advice, and assistance from the agency as regards program development, operation, delivery, financing, or administration. As a condition to the making of such eligible loans, the Minnesota Chippewa tribe, the Red Lake band of Chippewa Indians, and the Sioux communities shall:\n(1) enter into a loan agreement and other contractual arrangements with the agency for the purpose of transferring the allocated portion of loan funds and to ensure compliance with the provisions of this section and this chapter; and\n(2) agree that all of their official books and records related to such housing programs shall be subjected to audit by the legislative auditor in the manner prescribed for agencies of state government.\nThe agency shall submit a biennial report concerning the various housing programs for American Indians, and related receipts and expenditures as provided in section 462A.22, subdivision 9, and such tribe, band, or communities to the extent that they administer such programs, shall be responsible for any costs and expenses related to such administration provided, however, they shall be eligible for payment for costs, expenses, and services pursuant to subdivision 12 and section 462A.21. The agency may provide or cause to be provided essential general technical services as set forth in subdivision 2, and general consultative project assistance services, including, but not limited to, management training, and home ownership counseling as set forth in subdivision 3. Members of boards, committees, or other governing bodies of the tribe, band, and communities administering the programs authorized by this subdivision must be compensated for those services as provided in section 15.0575.\n(b) The agency may engage in demonstration projects to encourage the participation of financial institutions or other leveraging sources in providing housing opportunities for American Indians. The agency shall consult with the Minnesota Chippewa tribe, the Red Lake band of Chippewa Indians, and the Sioux communities in developing the demonstration projects. The income limits specified in paragraph (a) do not apply to the demonstration projects.\n(c) The agency may make home improvement loans under this subdivision without regard to household income.\nIt may engage in housing programs for low and moderate income American Indians residing in the metropolitan area defined in section 473.121, subdivision 2, cities with a population greater than 50,000 persons, and cities with an American Indian population greater than 1,000 persons. The programs shall demonstrate innovative methods of providing housing for urban Indians, may involve the construction, purchase, and rehabilitation of residential housing, and may be administered through any other provision of this chapter. To the extent possible, the programs shall combine appropriated money with other money from both public and private sources, except that interest earned on the portion of an appropriation to be expended for Indian housing programs in the city of Duluth does not have to be combined with money from other sources. Effective June 30, 1985, all money allocated by the agency under this subdivision to programs for urban Indian housing that are not subject to active contracts shall be reallocated by the agency to programs to fulfill the purposes of this subdivision. Members of boards, committees, or other governing bodies of organizations administering the urban Indian programs authorized by this subdivision must be compensated for those services as provided in section 15.0575. The agency shall consult with the Advisory Council on Urban Indians created pursuant to section 3.922, subdivision 8, in the development of programs pursuant to this subdivision.\nIt may establish cooperative relationships with municipal housing and redevelopment authorities and municipalities to develop priorities for the use of agency resources and assistance within municipalities, and to consider municipal housing plans and programs in the process of setting the priorities.\nIt shall provide meaningful access to agency programs and services for individuals who have limited English proficiency. This may include providing, at the individual's request, interpretation or translation services in the individual's preferred language. The agency will continue to follow all federal and state laws, regulations, and guidance regarding limited English proficiency.\nNotwithstanding any law to the contrary, to promote efficiency in program administration, underwriting, and compliance, the commissioner may adjust income or rent limits for any multifamily capital funding program authorized under state law to align with federal rent or income limits in sections 42 and 142 of the Internal Revenue Code of 1986, as amended. Adjustments made under this subdivision are exempt from the rulemaking requirements of chapter 14.\n(a) By February 15 each year, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees having jurisdiction over housing finance and policy containing the following information:\n(1) the total number of applications for funding;\n(2) the amount of funding requested;\n(3) the amounts of funding awarded; and\n(4) the number of housing units that are affected by funding awards, including the number of:\n(i) newly constructed owner-occupied units;\n(ii) renovated owner-occupied units;\n(iii) newly constructed rental units; and\n(iv) renovated rental units.\n(b) This reporting requirement applies to appropriations for competitive development programs made in Laws 2023 and in subsequent laws.\nThe agency may determine that a household or project unit meets the rent or income requirements for a program if the household or unit receives or participates in income-based state or federal public assistance benefits, including but not limited to:\n(1) child care assistance programs under chapter 119B;\n(2) general assistance, Minnesota supplemental aid, or food support under chapter 256D;\n(3) housing support under chapter 256I;\n(4) Minnesota family investment program and diversionary work program under chapter 256J; and\n(5) economic assistance programs under chapter 256P.",
	"repealed": false
}