{
	"id": "356.637",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.637",
	"title": "356.637 CORRECTION OF ERRONEOUS DEFINED BENEFIT PLAN COVERAGE.",
	"text": "(a) For purposes of this section, the terms in paragraphs (b) to (e) have the meanings given them.\n(b) \"Chief administrative officer\" means the person selected or elected by the governing board of a covered pension plan with primary responsibility to administer the covered pension plan, or that person's designee or representative.\n(c) \"Covered pension plan\" means a plan enumerated in section 356.30, subdivision 3, except clauses (3) and (5).\n(d) \"Governing board\" means the governing board of the Minnesota State Retirement System, the Public Employees Retirement Association, the Teachers Retirement Association, or the St. Paul Teachers Retirement Fund Association.\n(e) \"Member\" means an active plan member in a covered pension plan.\nAny person who terminated the erroneously covered service before a chief administrative officer determined the covered pension plan coverage was in error retains the coverage with the plan that originally credited the service.\nUpon determination by a chief administrative officer that a member is covered by the wrong pension plan, the employer must stop remitting the erroneous employee deductions and employer contributions and report the employee to the correct covered pension plan for all subsequent service.\nAny plan member, with past service credited in an erroneous plan, retains the coverage for that past service with the plan that originally credited that service if the reporting error began earlier than two fiscal years prior to the current fiscal year in which the error was determined by the chief administrative officer. If the reporting error began within two fiscal years prior to the current fiscal year, the pension plan coverage for that past service must be corrected as provided in subdivision 5.\n(a) For cases under subdivision 4 requiring correction of prior service coverage, on behalf of the applicable member the chief administrative officer of the covered pension plan fund that has received erroneous employee deductions and employer contributions must transfer to the appropriate covered retirement plan fund an amount which is the lesser of all contributions made by or on behalf of the member for the period of erroneous membership, or the specific amount requested by the chief administrative officer of the other covered pension plan which represents the employee deductions and employer contributions that would have been made had the member been properly reported.\n(b) If excess employee deductions remain in the member's account after the transfer of funds, the remaining erroneous amount must be refunded to the person with interest at the rate provided under the general refund law of the applicable covered pension plan. The chief administrative officer must also return any remaining excess employer contributions by providing to the employer a credit against future contributions payable by that employer.\n(c) If the contributions transferred to the correct covered pension plan fund are less than the amounts required for the period being corrected, the chief administrative officer of the correct covered pension plan fund must collect the remaining employee deductions and employer contributions from the employer under laws for recovering deficient contributions applicable to the correct covered pension plan, except that no interest is chargeable if the additional amounts due under this paragraph are received by the chief administrative officer within 30 days of notifying the employer of the amount due.\n(d) A potential transfer under this section that would cause a plan to fail to be a qualified plan under section 401(a) of the Internal Revenue Code, as amended, must not be made. Within 30 days after being notified by a chief administrative officer of an unmade potential transfer under this section, the employer of the member must transmit an amount representing the applicable salary deductions and employer contributions, without interest, to the fund of the appropriate covered pension plan. The chief administrative officer of the covered pension plan which erroneously provided coverage must provide to the employer a credit for the amount of the erroneous salary deductions and employer contributions against future contributions from that employer.\n(e) Upon transfer of the required assets, or payment from the employer under paragraph (d), whichever is applicable, allowable service and salary credit for the period being transferred is forfeited in the erroneous plan and is granted in the correct plan.",
	"repealed": false
}