{
	"id": "352.113",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.113",
	"title": "352.113 PERMANENT DISABILITY BENEFITS.",
	"text": "(a) An employee covered by the system, who has satisfied the applicable allowable service credit requirement under section 352.115, subdivision 1, has not reached normal retirement age, and becomes totally and permanently disabled is entitled to a disability benefit in an amount provided in subdivision 3.\n(b) If the disabled employee's state service has terminated at any time, the employee must have at least two years of allowable service after last becoming a state employee covered by the system.\n(c) Refunds may be repaid under section 352.23 before the effective accrual date of the disability benefit under subdivision 2.\n(a) An employee making claim for a total and permanent disability benefit, or someone acting on behalf of the employee upon proof of authority satisfactory to the director, shall file a written application for benefits in an office of the system or with a person authorized by the director.\n(b) The application must be in a form and manner prescribed by the director. The completed application form and supporting documents must be received in an office of the system or by an authorized person before the expiration of the period specified in subdivision 4, paragraph (g). In this paragraph, \"supporting documents\" means:\n(1) two medical reports as required by subdivision 4, paragraph (b); and\n(2) a written certification by the employing entity as required by subdivision 4, paragraph (e).\nSupporting documents are not required to be original documents except as determined by the director.\n(c) The benefit shall begin to accrue the day following the start of disability or the day following the last day paid, whichever is later, but not earlier than 180 days before the date the application and supporting documents are filed in an office of the system or with an authorized person.\nThe total and permanent disability benefit must be computed in the manner provided in section 352.115. The disability benefit shall be the normal annuity without reduction for each month the employee is under normal retirement age at the time of becoming disabled. A disabled employee may choose to receive the normal disability benefit or an optional annuity as provided in section 352.116, subdivision 3. This choice must be made before the start of payment of the disability benefit and is effective the date on which the disability begins to accrue as provided in subdivision 2.\n(a) Any physician, psychologist, chiropractor, physician assistant, podiatrist, or APRN providing any service specified in this section must be licensed.\n(b) An applicant shall provide a detailed report signed by a physician, and at least one additional report signed by a physician, psychologist, chiropractor, physician assistant, podiatrist, or an APRN with evidence to support an application for total and permanent disability. The reports must include an expert opinion regarding whether the employee is permanently and totally disabled within the meaning of section 352.01, subdivision 17, and that the disability arose before the employee was placed on any paid or unpaid leave of absence or terminated public service.\n(c) If there is medical evidence that supports the expectation that at some point the person applying for the disability benefit will no longer be disabled, the decision granting the disability benefit may provide for a termination date upon which the total and permanent disability can be expected to no longer exist. When a termination date is part of the decision granting benefits, prior to the benefit termination the executive director shall review any evidence provided by the disabled employee to show that the disabling condition for which benefits were initially granted continues. If the benefits cease, the disabled employee may follow the appeal procedures described in section 356.96 or may reapply for disability benefits using the process described in this subdivision.\n(d) Any claim to disability must be supported by a report from the employer indicating that there is no available work that the employee can perform with the disabling condition and that all reasonable accommodations have been considered. Upon request of the executive director, an employer shall provide evidence of the steps the employer has taken to attempt to provide reasonable accommodations and continued employment to the claimant.\n(e) The director shall also obtain written certification from the employer stating whether the employment has ceased or whether the employee is on sick leave of absence because of a disability that will prevent further service to the employer and that the employee is not entitled to compensation from the employer.\n(f) The medical adviser shall consider the reports of the physician, psychologist, chiropractor, physician assistant, podiatrist, or APRN and any other evidence supplied by the employee or other interested parties. If the medical adviser finds the employee totally and permanently disabled, the adviser shall make appropriate recommendation to the director in writing together with the date from which the employee has been totally disabled. The director shall then determine if the disability occurred while still in the employment of the state and constitutes a total and permanent disability as defined in section 352.01, subdivision 17.\n(g) A terminated employee may apply for a disability benefit within 18 months of termination as long as the disability occurred while in the employment of the state. The fact that an employee is placed on leave of absence without compensation because of disability does not bar that employee from receiving a disability benefit.\n(h) Upon appeal, the board of directors may extend the disability benefit application deadline in paragraph (g) by an additional 18 months if the terminated employee is determined by the board of directors to have a cognitive impairment that made it unlikely that the terminated employee understood that there was an application deadline or that the terminated employee was able to meet the application deadline.\n(i) Unless the payment of a disability benefit has terminated because the employee is no longer totally disabled, or because the employee has reached normal retirement age as provided in this section, the disability benefit must cease with the last payment received by the disabled employee or which had accrued during the lifetime of the employee unless there is a spouse surviving. In that event, the surviving spouse is entitled to the disability benefit for the calendar month in which the disabled employee died.\nAny individual applying for or receiving disability benefits shall submit to an independent medical examination or an assessment by a certified rehabilitation counselor if requested by the executive director or designee. The examination must be paid for by the system.\n[Repealed, 1Sp1985 c 7 s 36]\nAt least once each year during the first five years following the allowance of a disability benefit to any employee, and at least once in every three-year period thereafter, the director may require any disabled employee to provide medical, chiropractic, or psychological evidence to support the continuation of the total and permanent disability. The evidence must be in a form and manner prescribed by the executive director for review by an expert or experts designated by the medical adviser and engaged by the director. If the medical information provided to the medical adviser indicates that the employee is no longer permanently and totally disabled, or is engaged in or can engage in a gainful occupation, payments of the disability benefit by the fund must be discontinued. The payments must be discontinued as soon as the employee is reinstated to the payroll following a sick leave of absence, but in no case may payment be made for more than 60 days after the medical adviser finds that the employee is no longer permanently and totally disabled.\nIf the disabled employee resumes a gainful occupation from which earnings are less than the employee's salary at the date of disability or the salary currently paid for similar positions, the director shall continue the disability benefit in an amount which when added to earnings does not exceed the salary at the date of disability, provided the disability benefit in this case does not exceed the disability benefit originally allowed. Deductions for the retirement fund must not be taken from the salary of a disabled employee who is receiving a disability benefit as provided in this subdivision.\n(a) A reduction in benefits under subdivision 7, or a termination of benefits due to the disabled employee resuming a gainful occupation from which earnings are equal to or more than the employee's salary at the date of disability or the salary currently paid for similar positions does not apply until six months after the individual returns to a gainful occupation.\n(b) No deductions for the retirement fund may be taken from the salary of a disabled person who is attempting to return to work under this provision unless the member waives further disability benefits.\n(c) A member may return to employment and continue disability benefit payments under this subdivision only once while receiving disability benefits from a retirement plan administered by the Minnesota State Retirement System.\nIf a person applying for a disability benefit refuses to submit to a medical or psychological examination, the disability application shall be rejected. If a disability benefit recipient refuses to submit to a medical or psychological examination as required, payments by the fund must be discontinued and the director shall revoke all rights of the employee in any disability benefit.\nAny employee receiving a disability benefit who is restored to active state service except employees receiving benefits as provided in subdivision 7, shall have deductions taken for the retirement fund and upon retirement have the payable retirement annuity based upon all allowable service including that upon which the disability benefits were based. No employee is entitled to receive disability benefits and a retirement annuity at the same time.\nIf a disabled employee resumes gainful employment with the state and is not entitled to continued payment of a disability benefit as provided in subdivision 7, the right to a disability benefit ends when the employee has been employed for one year thereafter. If the employee again becomes totally and permanently disabled before reaching normal retirement age, application for a disability benefit may again be made. If the employee is entitled to a disability benefit it must be computed as provided in subdivision 9.\nIf an employee who has resumed employment as provided in subdivision 10 is reemployed for more than three months, but cannot continue for one year, the disability benefit must be recomputed allowing additional service credit for the period of reemployment. If the period of reemployment does not exceed three months, the deductions taken from salary after resuming employment must be returned to the employee. The employee is not entitled to service credit for the period covered by the returned deductions.\nThe disability benefit paid to a disabled employee under this section ends when the employee reaches normal retirement age. If the disabled employee is still totally and permanently disabled when the employee reaches normal retirement age, the employee shall be considered to be a retired employee. If the employee had chosen an optional annuity under subdivision 3, the employee shall receive an annuity in accordance with the terms of the optional annuity previously chosen. If the employee had not chosen an optional annuity pursuant to subdivision 3, the employee may then choose to receive either a normal retirement annuity equal in amount to the disability benefit paid before the employee reached normal retirement age or an optional annuity as provided in section 352.116, subdivision 3. The choice of an optional annuity must be made before reaching normal retirement age. If an optional annuity is chosen, the choice is effective on the date the employee attains normal retirement age and the optional annuity shall begin to accrue the first of the month following the month in which the employee attains this age.\nA disability benefit under this section is eligible for postretirement adjustments under section 356.415.\nDisability benefit recipients must report all earnings from reemployment and income from workers' compensation to the system annually by May 15 in a format prescribed by the executive director. The executive director may waive the earnings report requirement for any disabled employee who is not required to undergo regular medical or psychological examinations under subdivision 6. If the form is not submitted by June 15, benefits must be suspended effective July 1. If the form deemed acceptable by the executive director is received after the June 15 deadline, benefits shall be reinstated retroactive to July 1.",
	"repealed": false
}