{
	"id": "174.636",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.636",
	"title": "174.636 PASSENGER RAIL; EXERCISE OF POWER.",
	"text": "The commissioner has all powers necessary to carry out the duties specified in section 174.632. In the exercise of those powers, the commissioner may:\n(1) acquire by purchase, gift, or by eminent domain proceedings as provided by law, all land and property necessary to preserve future passenger rail corridors or to construct, maintain, and improve passenger rail corridors;\n(2) conduct and engage in promotional and marketing research, campaigns, outreach, and other activities to increase awareness, education, and ridership of passenger rail in Minnesota;\n(3) let all necessary contracts as provided by law; and\n(4) make agreements with and cooperate with any public or private entity, including Amtrak, to carry out statutory duties related to passenger rail.\nThe commissioner shall consult with metropolitan planning organizations and regional rail authorities in areas where passenger rail corridors are under consideration to ensure that passenger rail services are integrated with existing rail and transit services and other transportation facilities to provide as nearly as possible connected, efficient, and integrated services.\n(a) The commissioner, or a public entity contracting with the commissioner, may contract with a railroad as defined in Code of Federal Regulations, title 49, section 200.3(i), for the joint or shared use of the railroad's right-of-way or the construction, operation, or maintenance of rail track, facilities, or services for passenger rail purposes. Notwithstanding section 3.732, subdivision 1, clause (2), or 466.01, subdivision 6, sections 466.04 and 466.06 govern the liability of a Class I railroad and its employees arising from the joint or shared use of the railroad right-of-way or the provision of passenger rail construction, operation, or maintenance services pursuant to the contract. Notwithstanding any law to the contrary, a contract with a Class I railroad for any passenger rail service, or joint or shared use of the railroad's right-of-way, may also provide for the allocation of financial responsibility, indemnification, and the procurement of insurance for the parties for all types of claims or damages.\n(b) State passenger rail operations or a contract entered into under this section shall be subject to the Federal Employers Liability Act, United States Code, title 45, section 51 et seq.; federal railroad safety laws under United States Code, title 49, section 20101 et seq.; the Railway Labor Act, United States Code, title 45, section 151 et seq.; and the Railroad Retirement Act, United States Code, title 45, section 231 et seq.\nThe commissioner shall hold public hearings as required by federal requirements.",
	"repealed": false
}