{
	"id": "116J.994",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.994",
	"title": "116J.994 REGULATING LOCAL AND STATE BUSINESS SUBSIDIES.",
	"text": "A business subsidy must meet a public purpose which may include, but may not be limited to, increasing the tax base. Job retention may only be used as a public purpose in cases where job loss is specific and demonstrable.\nA business subsidy may not be granted until the grantor has adopted criteria after a public hearing for awarding business subsidies that comply with this section. The criteria may not be adopted on a case-by-case basis. The criteria must set specific minimum requirements that recipients must meet in order to be eligible to receive business subsidies. The criteria must include a specific wage floor for the wages to be paid for the jobs created. The wage floor may be stated as a specific dollar amount or may be stated as a formula that will generate a specific dollar amount. A grantor may deviate from its criteria by documenting in writing the reason for the deviation and attaching a copy of the document to its next annual report to the department. The commissioner of employment and economic development may assist local government agencies in developing criteria. A copy of the criteria must be submitted to the Department of Employment and Economic Development along with the first annual report following May 15, 2000, or with the first annual report after it has adopted criteria, whichever is earlier. Notwithstanding section 116J.993, subdivision 3, clauses (1) and (21), for the purpose of this subdivision, \"business subsidies\" as defined under section 116J.993 includes the following forms of financial assistance:\n(1) a business subsidy of $25,000 or more; and\n(2) business loans and guarantees of $75,000 or more.\n(a) A recipient must enter into a subsidy agreement with the grantor of the subsidy that includes:\n(1) a description of the subsidy, including the amount and type of subsidy, and type of district if the subsidy is tax increment financing;\n(2) a statement of the public purposes for the subsidy;\n(3) measurable, specific, and tangible goals for the subsidy;\n(4) a description of the financial obligation of the recipient if the goals are not met;\n(5) a statement of why the subsidy is needed;\n(6) a commitment to continue operations in the jurisdiction where the subsidy is used for at least five years after the benefit date;\n(7) the name and address of the parent corporation of the recipient, if any; and\n(8) a list of all financial assistance by all grantors for the project.\n(b) Business subsidies in the form of grants must be structured as forgivable loans and are subject to the financial review under section 16B.981. For other types of business subsidies, the agreement must state the fair market value of the subsidy to the recipient, including the value of conveying property at less than a fair market price, or other in-kind benefits to the recipient.\n(c) If a business subsidy benefits more than one recipient, the grantor must assign a proportion of the business subsidy to each recipient that signs a subsidy agreement. The proportion assessed to each recipient must reflect a reasonable estimate of the recipient's share of the total benefits of the project.\n(d) The state or local government agency and the recipient must both sign the subsidy agreement and, if the grantor is a local government agency, the agreement must be approved by the local elected governing body, except for the St. Paul Port Authority and a seaway port authority.\n(e) Notwithstanding the provision in paragraph (a), clause (6), a recipient may be authorized to move from the jurisdiction where the subsidy is used within the five-year period after the benefit date if, after a public hearing, the grantor approves the recipient's request to move. For the purpose of this paragraph, if the grantor is a state government agency other than the Department of Iron Range Resources and Rehabilitation, \"jurisdiction\" means a city or township.\nThe subsidy agreement, in addition to any other goals, must include: (1) goals for the number of jobs created, which may include separate goals for the number of part-time or full-time jobs, or, in cases where job loss is specific and demonstrable, goals for the number of jobs retained; (2) wage goals for any jobs created or retained; and (3) wage goals for any jobs to be enhanced through increased wages. After a public hearing, if the creation or retention of jobs is determined not to be a goal, the wage and job goals may be set at zero. The goals for the number of jobs to be created or retained must result in job creation or retention by the recipient within the granting jurisdiction overall.\nIn addition to other specific goal time frames, the wage and job goals must contain specific goals to be attained within two years of the benefit date.\n(a) Before granting a business subsidy that exceeds $500,000 for a state government grantor and $150,000 for a local government grantor, the grantor must provide public notice and a hearing on the subsidy. A public hearing and notice under this subdivision is not required if a hearing and notice on the subsidy is otherwise required by law.\n(b) Public notice of a proposed business subsidy under this subdivision by a state government grantor, other than the commissioner of Iron Range resources and rehabilitation, must be published in the State Register. Public notice of a proposed business subsidy under this subdivision by a local government grantor or the commissioner of Iron Range resources and rehabilitation must be published in a local newspaper of general circulation. The public notice must identify the location at which information about the business subsidy, including a summary of the terms of the subsidy, is available. Published notice should be sufficiently conspicuous in size and placement to distinguish the notice from the surrounding text. The grantor must make the information available in printed paper copies and, if possible, on the Internet. The government agency must provide at least a ten-day notice for the public hearing.\n(c) The public notice must include the date, time, and place of the hearing.\n(d) The public hearing by a state government grantor other than the commissioner of Iron Range resources and rehabilitation must be held in St. Paul.\n(e) If more than one nonstate grantor provides a business subsidy to the same recipient, the nonstate grantors may designate one nonstate grantor to hold a single public hearing regarding the business subsidies provided by all nonstate grantors. For the purposes of this paragraph, \"nonstate grantor\" includes the commissioner of Iron Range resources and rehabilitation.\n(f) The public notice of any public meeting about a business subsidy agreement, including those required by this subdivision and by subdivision 4, must include notice that a person with residence in or the owner of taxable property in the granting jurisdiction may file a written complaint with the grantor if the grantor fails to comply with sections 116J.993 to 116J.995, and that no action may be filed against the grantor for the failure to comply unless a written complaint is filed.\n(a) The subsidy agreement must specify the recipient's obligation if the recipient does not fulfill the agreement. At a minimum, the agreement must require a recipient failing to meet subsidy agreement goals to pay back the assistance plus interest to the grantor or, at the grantor's option, to the account created under section 116J.551 provided that repayment may be prorated to reflect partial fulfillment of goals. The interest rate must be set at no less than the implicit price deflator for government consumption expenditures and gross investment for state and local governments prepared by the Bureau of Economic Analysis of the United States Department of Commerce for the 12-month period ending March 31 of the previous year. The grantor, after a public hearing, may extend for up to one year the period for meeting the wage and job goals under subdivision 4 provided in a subsidy agreement. A grantor may extend the period for meeting other goals under subdivision 3, paragraph (a), clause (3), by documenting in writing the reason for the extension and attaching a copy of the document to its next annual report to the department.\n(b) A recipient that fails to meet the terms of a subsidy agreement may not receive a business subsidy from any grantor for a period of five years from the date of failure or until a recipient satisfies its repayment obligation under this subdivision, whichever occurs first.\n(c) Before a grantor signs a business subsidy agreement, the grantor must check with the compilation and summary report required by this section to determine if the recipient is eligible to receive a business subsidy.\n(a) A business subsidy grantor must monitor the progress by the recipient in achieving agreement goals.\n(b) A recipient must provide information regarding goals and results for two years after the benefit date or until the goals are met, whichever is later. If the goals are not met, the recipient must continue to provide information on the subsidy until the subsidy is repaid. The information must be filed on forms developed by the commissioner in cooperation with representatives of local government. Copies of the completed forms must be sent to the local government agency that provided the subsidy or to the commissioner if the grantor is a state agency. If the commissioner of Iron Range resources and rehabilitation is the grantor, the copies must be sent to the commissioner of Iron Range resources and rehabilitation. The report must include:\n(1) the type, public purpose, and amount of subsidies and type of district, if the subsidy is tax increment financing;\n(2) the hourly wage of each job created with separate bands of wages;\n(3) the sum of the hourly wages and cost of health insurance provided by the employer with separate bands of wages;\n(4) the date the job and wage goals will be reached;\n(5) a statement of goals identified in the subsidy agreement and an update on achievement of those goals;\n(6) the location of the recipient prior to receiving the business subsidy;\n(7) the number of employees who ceased to be employed by the recipient when the recipient relocated to become eligible for the business subsidy;\n(8) why the recipient did not complete the project outlined in the subsidy agreement at their previous location, if the recipient was previously located at another site in Minnesota;\n(9) the name and address of the parent corporation of the recipient, if any;\n(10) a list of all financial assistance by all grantors for the project; and\n(11) other information the commissioner may request.\nA report must be filed no later than March 1 of each year for the previous year. The local agency and the commissioner of Iron Range resources and rehabilitation must forward copies of the reports received by recipients to the commissioner by April 1.\n(c) Financial assistance that is excluded from the definition of \"business subsidy\" by section 116J.993, subdivision 3, clauses (4), (5), (8), and (16), is subject to the reporting requirements of this subdivision, except that the report of the recipient must include instead:\n(1) the type, public purpose, and amount of the financial assistance, and type of district if the assistance is tax increment financing;\n(2) progress towards meeting goals stated in the assistance agreement and the public purpose of the assistance;\n(3) if the agreement includes job creation, the hourly wage of each job created with separate bands of wages;\n(4) if the agreement includes job creation, the sum of the hourly wages and cost of health insurance provided by the employer with separate bands of wages;\n(5) the location of the recipient prior to receiving the assistance; and\n(6) other information the grantor requests.\n(d) If the recipient does not submit its report, the local government agency must mail the recipient a warning within one week of the required filing date. If, after 14 days of the postmarked date of the warning, the recipient fails to provide a report, the recipient must pay to the grantor a penalty of $100 for each subsequent day until the report is filed. The maximum penalty shall not exceed $1,000.\n(a) Local government agencies of a local government with a population of more than 2,500 and state government agencies, regardless of whether or not they have awarded any business subsidies, must file a report by April 1 of each year with the commissioner. Local government agencies of a local government with a population of 2,500 or less are exempt from filing this report if they have not awarded a business subsidy in the past five years. The report must include a list of recipients that did not complete the recipient report required under subdivision 7 and a list of recipients that have not met their job and wage goals within two years and the steps being taken to bring them into compliance or to recoup the subsidy.\nIf the commissioner has not received the report by April 1 from an entity required to report, the commissioner shall issue a warning to the government agency. If the commissioner has still not received the report by June 1 of that same year from an entity required to report, then that government agency may not award any business subsidies until the report has been filed.\n(b) The report required under paragraph (a) is also required for financial assistance of $25,000 and greater that is excluded from the definition of \"business subsidy\" by section 116J.993, subdivision 3, clause (1), and of $75,000 and greater that is excluded from the definition of \"business subsidy\" by section 116J.993, subdivision 3, clause (21). The report for the financial assistance under this paragraph must be completed within one year of the granting of the financial assistance. The report required for financial assistance under this paragraph must include:\n(1) the name of the recipient, its organizational structure, its address and contact information, and its industry sector;\n(2) a description of the amount and use of the financial assistance and the total project budget, including a list of all financial assistance by all grantors for the project and the private sources of financial assistance;\n(3) the public purpose of the financial assistance, the job goals associated with both the financial assistance and the total project in which the financial assistance is included, the hourly wage of each job created, and the cost of health insurance provided by the employer;\n(4) the date the project will be completed;\n(5) the name and address of the parent corporation of the recipient, if any; and\n(6) any other information the commissioner may request.\n(c) Within one year of completing a report under paragraph (b), the local government agency must report to the commissioner on progress in achieving the purposes and goals under paragraph (b), clause (3).\n(d) The commissioner of employment and economic development must provide information on reporting requirements to state and local government agencies.\nThe Department of Employment and Economic Development must publish a compilation and summary of the results of the reports for the previous two calendar years by December 1 of 2004 and every other year thereafter. The reports of the government agencies to the department and the compilation and summary report of the department must be made available to the public. The commissioner must make copies of all business subsidy reports submitted by local and state granting agencies available on the department's website by October 1 of the year in which they were submitted.\nThe commissioner must coordinate the production of reports so that useful comparisons across time periods and across grantors can be made. The commissioner may add other information to the report as the commissioner deems necessary to evaluate business subsidies. Among the information in the summary and compilation report, the commissioner must include:\n(1) total amount of subsidies awarded in each development region of the state;\n(2) distribution of business subsidy amounts by size of the business subsidy;\n(3) distribution of business subsidy amounts by time category;\n(4) distribution of subsidies by type and by public purpose;\n(5) percent of all business subsidies that reached their goals;\n(6) percent of business subsidies that did not reach their goals by two years from the benefit date;\n(7) total dollar amount of business subsidies that did not meet their goals after two years from the benefit date;\n(8) percent of subsidies that did not meet their goals and that did not receive repayment;\n(9) list of recipients that have failed to meet the terms of a subsidy agreement in the past five years and have not satisfied their repayment obligations;\n(10) number of part-time and full-time jobs within separate bands of wages for the entire state and for each development region of the state;\n(11) benefits paid within separate bands of wages for the entire state and for each development region of the state; and\n(12) number of employees in the entire state and in each development region of the state who ceased to be employed because their employers relocated to become eligible for a business subsidy.\nThe Department of Employment and Economic Development must publish a compilation of granting agencies' criteria policies adopted in the previous two calendar years by December 1 of 2004 and every other year thereafter.\n(a) A person with residence in or an owner of taxable property located in the jurisdiction of the grantor may bring an action for equitable relief arising out of the failure of the grantor to comply with sections 116J.993 to 116J.995. The court may award a prevailing party in an action under this subdivision costs and reasonable attorney fees.\n(b) Prior to bringing an action, the party must file a written complaint with the grantor stating the alleged violation and proposing a remedy. The grantor has up to 30 days to reply to the complaint in writing and may take action to comply with sections 116J.993 to 116J.995.\n(c) The written complaint under this subdivision for failure to comply with subdivisions 1 to 5, must be filed with the grantor within 180 days after approval of the subsidy agreement under subdivision 3, paragraph (d). An action under this subdivision must be commenced within 30 days following receipt of the grantor's reply, or within 180 days after approval of the subsidy agreement under subdivision 3, paragraph (d), whichever is later.",
	"repealed": false
}