{
	"id": "469.116",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.116",
	"title": "469.116 BOND ISSUE FOR REDEVELOPMENT PURPOSES.",
	"text": "A local agency may issue bonds for any of its corporate purposes. Subject to the limitations of this section, the bonds may be of the type it determines, including bonds on which the principal and interest are payable exclusively from the income and revenues of the project financed with the proceeds of the bonds, or exclusively from the income and revenues of certain designated projects, whether or not they are financed in whole or in part with the proceeds of the bonds. The bonds may be additionally secured by a pledge of any grant or contribution from the federal government or other sources, or a pledge of any income or revenues of the agency, from the redevelopment project for which the proceeds of the bonds are to be used, or a mortgage of any project or other property of the agency. Neither the commissioners of any agency nor any person executing the bonds shall be liable personally on the bonds.\nThe bonds and other obligations of a local agency shall not be a debt of any municipality, the state, or any political subdivision thereof. Neither a municipality nor the state or any political subdivision thereof shall be liable on the bonds, nor shall the bonds or obligations be payable out of any funds or properties other than those of the agency.\nThe bonds shall not constitute an indebtedness within the meaning of any constitutional or statutory debt limitation or restriction.\nThe bonds of a local agency are declared to be issued for an essential public and governmental purpose and to be public instrumentalities. The provisions of these sections exempting from taxation redevelopment agencies, their properties and income, shall be considered additional security for the repayment of bonds and shall constitute a contract between the bondholders, including transferees, and the local agencies issuing the bonds. A local agency may confer upon the holder of the bonds the rights and remedies it deems necessary or advisable, including the right in the event of default to have a receiver appointed to take possession of and operate the redevelopment project.\nNothing in these sections shall be construed to exempt from taxation any property which any local agency sells, leases, conveys, or otherwise transfers to private individuals or corporations for development, use, or operation in connection with a redevelopment project. The property, real or personal, shall have the same tax status as if it were owned by private individuals or corporations.\nThe bonds of a local agency shall be authorized by its resolution and may be issued in one or more series. They shall bear the date or dates, mature at the time or times, bear interest at the rate or rates, not exceeding six percent per annum, be in the denomination or denominations, be in the form, either coupon or registered, carry the conversion or registration privileges, have the priority, and be subject to the terms of redemption as the resolution, its trust indenture or mortgage may provide. The bonds may be sold at public or private sale at not less than par.\nSubject to the approval of the state agency, the bonds of a local agency may be declared securities in which all public officers and bodies of the state and of its municipal subdivisions, all insurance companies and associations, all savings banks and savings institutions, including savings associations, executors, administrators, guardians, trustees, and all other fiduciaries in the state may properly and legally invest the funds within their control. Each mortgage or issue of bonds shall relate only to a single specified project, and those bonds shall be secured by a mortgage upon all the real property of which the projects consist and shall be first lien bonds, secured by a mortgage not exceeding 80 percent of the estimated cost prior to the completion of the project, or 80 percent of the appraised value or actual cost, but in no event in excess of 80 percent of the actual cost, after that completion, as certified by the department.\nSections 474A.01 to 474A.21 apply to any issuance of obligations under this section which are subject to limitation under a federal tax law as defined in section 474A.02, subdivision 8.",
	"repealed": false
}