{
	"id": "115B.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.52",
	"title": "115B.52 WATER QUALITY AND SUSTAINABILITY ACCOUNT.",
	"text": "(a) For purposes of this section and section 115B.53, the following terms have the meanings given.\n(b) \"East metropolitan area\" includes but is not limited to the cities of Woodbury, Oakdale, Lake Elmo, Cottage Grove, St. Paul Park, Afton, and Newport and the townships of West Lakeland and Grey Cloud Island.\n(c) \"Settlement\" means the agreement and order entered on February 20, 2018, settling litigation commenced by the state against the 3M Company under section 115B.17, subdivision 7.\nThe water quality and sustainability account is established as an account in the remediation fund. The account consists of revenue deposited in the account under the terms of the settlement and earnings on the investment of money in the account. Money in the account may be invested through the State Board of Investment.\nMoney in the account is appropriated to the commissioner of the Pollution Control Agency and to the commissioner of natural resources for the purposes authorized under the settlement.\nThe commissioner of the Pollution Control Agency and the commissioner of natural resources must jointly submit:\n(1) by April 1, 2019, an implementation plan detailing how the commissioners will:\n(i) determine how the priorities in the settlement will be met and how the spending will move from the first priority to the second priority and the second priority to the third priority outlined in the settlement; and\n(ii) evaluate and determine what projects receive funding;\n(2) by October 1 each year, a report to the chairs and ranking minority members of the legislative policy and finance committees with jurisdiction over environment and natural resources on expenditures from the water quality and sustainability account during the previous fiscal year; and\n(3) by October 1, 2023, and each year thereafter, a report to the legislature on expenditures from the water quality and sustainability account during the previous fiscal year and a spending plan for anticipated expenditures from the account during the current fiscal year.\nThe commissioner of the Pollution Control Agency or commissioner of natural resources must receive approval from the local unit of government prior to assuming control or otherwise operating an existing municipal water supply operation in the east metropolitan area.",
	"repealed": false
}