{
	"id": "121A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.30",
	"title": "121A.30 PESTICIDE APPLICATION AT SCHOOLS.",
	"text": "Subdivisions 2 to 14 may be cited as the Janet B. Johnson Parents' Right-to-Know Act of 2000.\nA school that plans to apply a pesticide which is a toxicity category I, II, or III pesticide product, as classified by the United States Environmental Protection Agency, or a restricted use pesticide, as designated under the Federal Insecticide, Fungicide, and Rodenticide Act, on school property, must provide a notice to parents and employees that it applies such pesticides. The notice required under subdivision 3 must:\n(1) provide that an estimated schedule of the pesticide applications is available for review or copying at the school offices where such pesticides are applied;\n(2) state that long-term health effects on children from the application of such pesticides or the class of chemicals to which they belong may not be fully understood;\n(3) inform parents that a parent may request to be notified by the school in the manner specified in subdivision 6 before any application of a pesticide listed in this subdivision.\nThe notice must be provided no later than September 15 of each school year during which pesticides listed in subdivision 2 are planned to be applied. The notice may be included with other notices provided by the school, but must be separately identified and clearly visible to the reader.\nIn addition to the notice provided according to subdivision 3, a school that is required to provide notice under this section shall include in an official school handbook or official school policy guide of a general nature a section informing parents that an estimated schedule of applications of pesticides listed in subdivision 2 is available for review or copying at the school offices, and that a parent may receive prior notice of each application if specifically requested.\nA school that uses a pesticide listed in subdivision 2 must keep a copy of all notifications required under subdivisions 2 and 3 for at least six years in a manner available to the public.\nA parent of a student at a school may request that the school principal or other person having general control and supervision of the school notify the parent prior to the application of any pesticides listed in subdivision 2 at the school on a day different from the days specified in the notice under subdivision 3. The school principal or other person having general control and supervision of the school must provide reasonable notice to a parent who has requested such notification prior to applying such pesticides. The notice may be waived for emergency applications required only by appropriate state or local health officials. The notice must include the pesticide to be applied, the time of the planned application, and the location at the school of the planned application. A school may request reimbursement for the school's reasonable costs of providing notice under this subdivision, including any costs of mailing, from individuals requesting notification under this subdivision.\nThe Department of Health, in consultation with the Department of Education, the Pollution Control Agency, and University of Minnesota Extension Service, shall develop and make available to schools by August 1, 2000, a model notice in a form that can be used by a school if it chooses to do so. The model notice must include the information required by this section. The Department of Health must provide an opportunity for environmental groups, interested parents, public health organizations, and other parties to work with the department in developing the model notice.\nA school is not required to adopt an integrated pest management plan. A school board may only notify students, parents, or employees that it has adopted an integrated pest management plan if the plan is a managed pest control program designed to minimize the risk to human health and the environment and to reduce the use of chemical pesticides, and which ranks the district's response to pests in the following manner:\n(1) identifying pests which need to be controlled;\n(2) establishing tolerable limits of each identified pest;\n(3) designing future buildings and landscapes to prevent identified pests;\n(4) excluding identified pests from sites and buildings using maintenance practices;\n(5) adapting cleaning activities and best management practices to minimize the number of pests;\n(6) using mechanical methods of controlling identified pests; and\n(7) controlling identified pests using the least toxic pesticides with the least exposure to persons as is practicable.\nFor purposes of this section, the term \"pesticide\" has the meaning given it in section 18B.01, subdivision 18, except that it does not include any disinfectants, sanitizers, deodorizers, or antimicrobial agents used for general cleaning purposes.\nFor purposes of this section, the term \"pest\" has the meaning given it in section 18B.01, subdivision 17.\nFor the purposes of this section, \"school\" means a school as defined in section 120A.22, subdivision 4, excluding home schools.\nNo cause of action may be brought against a school district, a school, or the districts or school's employees or agents for any failure to comply with the requirements under this section.\nA failure to comply with the requirements of this section may not be presented as evidence in any lawsuit based upon physical injury resulting from exposure to pesticides applied at a school.\nNothing in this section affects the duty of a parent or a student to comply with the compulsory attendance law or the duty of a school employee to comply with the provisions of an applicable employment contract or policy.",
	"repealed": false
}