{
	"id": "145C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/145C.01",
	"title": "145C.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Act in good faith\" means to act consistently with a legally sufficient health care directive of the principal, a living will executed under chapter 145B, a declaration regarding intrusive mental health treatment executed under section 253B.03, subdivision 6d, or information otherwise made known by the principal, unless the actor has actual knowledge of the modification or revocation of the information expressed. If these sources of information do not provide adequate guidance to the actor, \"act in good faith\" means acting in the best interests of the principal, considering the principal's overall general health condition and prognosis and the principal's personal values to the extent known. Notwithstanding any instruction of the principal, a health care agent, health care provider, or any other person is not acting in good faith if the person violates the provisions of section 609.215 prohibiting assisted suicide.\n\"Decision-making capacity\" means the ability to understand the significant benefits, risks, and alternatives to proposed health care and to make and communicate a health care decision.\n\"Health care agent\" means an individual age 18 or older who is appointed by a principal in a health care power of attorney to make health care decisions on behalf of the principal. \"Health care agent\" may also be referred to as \"agent.\"\n\"Health care power of attorney\" means an instrument appointing one or more health care agents to make health care decisions for the principal.\n\"Health care\" means any care, treatment, service, or procedure to maintain, diagnose, or otherwise affect a person's physical or mental condition. \"Health care\" includes the provision of nutrition or hydration parenterally or through intubation but does not include any treatment, service, or procedure that violates the provisions of section 609.215 prohibiting assisted suicide. \"Health care\" also includes the establishment of a person's abode within or without the state and personal security safeguards for a person, to the extent decisions on these matters relate to the health care needs of the person.\n\"Health care decision\" means the consent, refusal of consent, or withdrawal of consent to health care.\n\"Health care directive\" means a written instrument that complies with section 145C.03 and includes one or more health care instructions, a health care power of attorney, or both; or a durable power of attorney for health care executed under this chapter before August 1, 1998.\n\"Health care provider\" means a person, health care facility, organization, or corporation licensed, certified, or otherwise authorized or permitted by the laws of this state to administer health care directly or through an arrangement with other health care providers, including health maintenance organizations licensed under chapter 62D.\n\"Health care facility\" means a hospital or other entity licensed under sections 144.50 to 144.58, a nursing home licensed to serve adults under section 144A.02, a home care provider licensed under sections 144A.43 to 144A.47, an adult foster care provider licensed under chapter 245A and Minnesota Rules, parts 9555.5105 to 9555.6265, a community residential setting licensed under chapter 245D, or a hospice provider licensed under sections 144A.75 to 144A.755.\n\"Health care instruction\" means a written statement of the principal's values, preferences, guidelines, or directions regarding health care.\n\"Principal\" means an individual age 18 or older who has executed a health care directive.\n\"Reasonably available\" means able to be contacted and willing and able to act in a timely manner considering the urgency of the principal's health care needs.",
	"repealed": false
}