{
	"id": "62J.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.04",
	"title": "62J.04 MONITORING THE RATE OF GROWTH OF HEALTH CARE SPENDING.",
	"text": "(a) The commissioner of health shall set annual cost containment goals for public and private spending on health care services for Minnesota residents, as provided in paragraph (b). The cost containment goals must be set at levels the commissioner determines to be realistic and achievable but that will reduce the rate of growth in health care spending by at least ten percent per year for the next five years. The commissioner shall set cost containment goals based on available data on spending and growth trends, including data from group purchasers, national data on public and private sector health care spending and cost trends, and trend information from other states.\n(b) The commissioner shall set the following annual cost containment goals for public and private spending on health care services for Minnesota residents:\n(1) for calendar year 1994, the cost containment goal must not exceed the change in the regional Consumer Price Index for urban consumers for calendar year 1993 plus 6.5 percentage points;\n(2) for calendar year 1995, the cost containment goal must not exceed the change in the regional Consumer Price Index for urban consumers for calendar year 1994 plus 5.3 percentage points;\n(3) for calendar year 1996, the cost containment goal must not exceed the change in the regional Consumer Price Index for urban consumers for calendar year 1995 plus 4.3 percentage points;\n(4) for calendar year 1997, the cost containment goal must not exceed the change in the regional Consumer Price Index for urban consumers for calendar year 1996 plus 3.4 percentage points; and\n(5) for calendar year 1998, the cost containment goal must not exceed the change in the regional Consumer Price Index for urban consumers for calendar year 1997 plus 2.6 percentage points.\nThe commissioner shall adjust the cost containment goal set for calendar year 1995 to recover savings in health care spending required for the period July 1, 1993, to December 31, 1993.\n(c) The commissioner shall publish:\n(1) the projected cost containment goal in the State Register by April 15 of the year immediately preceding the year in which the cost containment goal will be effective except for the year 1993, in which the cost containment goal shall be published by July 1, 1993;\n(2) the quarterly change in the regional Consumer Price Index for urban consumers; and\n(3) the Centers for Medicare and Medicaid Services forecast for total growth in the national health care expenditures.\nThe commissioner shall publish the final adjusted cost containment goal in the State Register by January 31 of the year that the cost containment goal is to be in effect. The adjusted cost containment goal must reflect the actual regional Consumer Price Index for urban consumers for the previous calendar year, and may deviate from the previously published projected cost containment goal to reflect differences between the actual regional Consumer Price Index for urban consumers and the projected Consumer Price Index for urban consumers. The commissioner shall report to the legislature by February 15 of each year on the implementation of the cost containment goal. This annual report shall describe the differences between the projected increase in health care expenditures, the actual expenditures based on data collected, and the impact and validity of cost containment goals within the overall health care reform strategy.\n[Renumbered 62J.35, subdivision 1]\n[Renumbered 62J.35, subd 2]\n[Renumbered 62J.35, subd 3]\nThe commissioner shall:\n(1) establish statewide and regional cost containment goals for total health care spending under this section and collect data as described in sections 62J.38 and 62J.40 to monitor statewide achievement of the cost containment goals;\n(2) divide the state into no fewer than four regions, with one of those regions being the Minneapolis/St. Paul metropolitan statistical area but excluding Chisago, Isanti, Wright, and Sherburne Counties, for purposes of fostering the development of regional health planning and coordination of health care delivery among regional health care systems and working to achieve the cost containment goals;\n(3) monitor the quality of health care throughout the state and take action as necessary to ensure an appropriate level of quality;\n(4) issue recommendations regarding uniform billing forms, uniform electronic billing procedures and data interchanges, patient identification cards, and other uniform claims and administrative procedures for health care providers and private and public sector payers. In developing the recommendations, the commissioner shall review the work of the work group on electronic data interchange (WEDI) and the American National Standards Institute (ANSI) at the national level, and the work being done at the state and local level. The commissioner may adopt rules requiring the use of the Uniform Bill 82/92 form, the National Council of Prescription Drug Providers (NCPDP) 3.2 electronic version, the Centers for Medicare and Medicaid Services 1500 form, or other standardized forms or procedures;\n(5) undertake health planning responsibilities;\n(6) authorize, fund, or promote research and experimentation on new technologies and health care procedures;\n(7) within the limits of appropriations for these purposes, administer or contract for statewide consumer education and wellness programs that will improve the health of Minnesotans and increase individual responsibility relating to personal health and the delivery of health care services, undertake prevention programs including initiatives to improve birth outcomes, expand childhood immunization efforts, and provide start-up grants for worksite wellness programs;\n(8) undertake other activities to monitor and oversee the delivery of health care services in Minnesota with the goal of improving affordability, quality, and accessibility of health care for all Minnesotans; and\n(9) make the cost containment goal data available to the public in a consumer-oriented manner.\n[Repealed, 1997 c 225 art 2 s 63]\nA person aggrieved may appeal a decision made under this chapter through a contested case proceeding governed under chapter 14. The notice of appeal must be served on the commissioner within 30 days of receiving notice of the decision. The commissioner shall decide the contested case.\nThe commissioner shall adopt rules under chapter 14 to implement this chapter.\n[Repealed, 1997 c 225 art 2 s 63]\n[Repealed, 1994 c 625 art 8 s 74]\nThe commissioners of health and human services shall establish a rate methodology for Medicare and Medicaid risk-based contracting with health plan companies that is consistent with statewide growth limits.",
	"repealed": false
}