{
	"id": "379.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/379.02",
	"title": "379.02 TOWNS, CHANGE OF BOUNDARIES AND NAMES.",
	"text": "The county board may alter the boundaries of towns, or partition any town among other towns within the county by attaching a part of one town to another, or by dividing one town and attaching the parts to other towns, or by forming a new town from the territory of one or more towns, or from territory not before included in a town, whenever it is made to appear necessary or expedient, by a petition for that purpose signed by not less than 20 legal voters residing within the territory to be affected. The county board may, upon notice as provided in section 379.03, alter the boundaries or change the name of any town within the county by attaching thereto unorganized territory abutting thereon within the county, after a petition for that purpose, signed by not less than 20 legal voters residing within the unorganized territory proposed to be attached, is approved by the town board of the town to which the territory is proposed to be attached. No town shall be so formed, having less than 36 square miles, nor have its boundaries so changed as to reduce its territory below that area, unless after such division it shall have at least 25 qualified voters therein, and real estate valued at the last preceding assessment at $30,000 or more; and no town shall be divided or have any part detached therefrom so as to make its area less than 36 square miles, except upon the petition of at least two-thirds of the legal voters residing in one or both subdivisions or parts. The county auditor must notify the state demographer of any boundary or name changes. The county shall prepare an estimate of the population and the number of households in the attached or detached area. The estimate must be certified by the state demographer. The estimate must estimate the population as of the effective date of the county board's resolution and must be so dated.",
	"repealed": false
}