{
	"id": "319B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.09",
	"title": "319B.09 GOVERNANCE.",
	"text": "(a) Except as stated in paragraph (b), a professional firm's governance authority must rest with:\n(1) one or more professionals, each of whom is licensed to furnish at least one category of the pertinent professional services; or\n(2) a surviving spouse of a deceased professional who was the sole owner of the professional firm, while the surviving spouse owns and controls the firm, but only during the period of time ending one year after the death of the professional.\n(b) In a Minnesota professional firm organized under chapter 317A and in a foreign professional firm organized under the nonprofit corporation statute of another state, at least one individual possessing governance authority must be a professional licensed to furnish at least one category of the pertinent professional services.\n(c) Individuals who possess governance authority within a professional firm may delegate administrative and operational matters to others. No decision entailing the exercise of professional judgment may be delegated or assigned to anyone who is not a professional licensed to practice the professional services involved in the decision.\n(d) An individual whose license to practice any pertinent professional services is revoked or suspended may not, during the time the revocation or suspension is in effect, possess or exercise governance authority, hold a position with governance authority, or take part in any decision or other action constituting an exercise of governance authority. Nothing in this chapter prevents a board from further terminating, restricting, limiting, qualifying, or imposing conditions on an individual's governance role as board disciplinary action.\n(e) A professional firm owned and controlled by a surviving spouse must comply with all requirements of this chapter, except those clearly inapplicable to a firm owned and governed by a surviving spouse who is not a professional of the same type as the surviving spouse's decedent.\n(a) The restrictions stated in section 319B.07 apply to the holding and exercise of:\n(1) any proxy relating to the voting right of any ownership interest in a professional firm; and\n(2) any other right to vote or participate in the management of a professional firm where the right derives from or is on account of an ownership interest in the professional firm.\nExcept as stated in paragraphs (b) and (c), this paragraph applies to rights a representative of a deceased or incompetent owner might otherwise have.\n(b) If a Minnesota professional firm is deciding whether to rescind its election under section 319B.03, subdivision 3, the representative of a deceased or incompetent owner has authority to vote the deceased or incompetent owner's ownership interest on that issue to the same extent the owner would have had the right to vote but for the death or incompetency.\n(c) If a foreign professional firm is deciding whether to rescind its election under section 319B.04, subdivision 3, and the foreign professional firm's generally applicable governing law provides the representative of a deceased or incompetent owner authority to vote the deceased or incompetent owner's ownership interest on that issue, nothing in sections 319B.01 to 319B.12 limits the representative's authority.",
	"repealed": false
}