{
	"id": "60A.1295",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.1295",
	"title": "60A.1295 ACTUARIAL OPINION OF RESERVES AND SUPPORTING DOCUMENTATION.",
	"text": "Every property and casualty insurance company doing business in this state, unless otherwise exempted by the domiciliary commissioner, shall annually submit the opinion of an appointed actuary entitled \"Statement of Actuarial Opinion.\" This opinion must be filed in accordance with the appropriate National Association of Insurance Commissioners (NAIC) Property and Casualty Annual Statement Instructions.\n(a) Every property and casualty insurance company domiciled in this state that is required to submit a statement of actuarial opinion shall annually submit an actuarial opinion summary, written by the company's appointed actuary. This actuarial opinion summary must be filed in accordance with the appropriate NAIC Property and Casualty Annual Statement Instructions and must be considered as a document supporting the actuarial opinion required in subdivision 1.\n(b) A company licensed but not domiciled in this state shall provide the actuarial opinion summary upon request.\n(a) An actuarial report and its underlying workpapers as required by the appropriate NAIC Property and Casualty Annual Statement Instructions must be prepared to support each actuarial opinion.\n(b) If the insurance company fails to provide a supporting actuarial report and/or workpapers at the request of the commissioner or the commissioner determines that the supporting actuarial report or workpapers provided by the insurance company are otherwise unacceptable to the commissioner, the commissioner may engage a qualified actuary at the expense of the company to review the opinion and the basis for the opinion and prepare the supporting actuarial report or workpapers.\nThe appointed actuary shall not be liable for damages to any person, other than the insurance company and the commissioner, for any act, error, omission, decision, or conduct with respect to the actuary's opinion, except in cases of fraud or willful misconduct on the part of the appointed actuary.",
	"repealed": false
}