{
	"id": "473.165",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.165",
	"title": "473.165 COUNCIL REVIEW; INDEPENDENT COMMISSION, BOARD, AGENCY.",
	"text": "(1) The Metropolitan Council shall review all long-term comprehensive plans of each independent commission, board, or agency prepared for its operation and development within the metropolitan area but only if such plan is determined by the council to have an areawide effect, a multicommunity effect, or to have a substantial effect on metropolitan development. Each plan shall be submitted to the council before any action is taken to place the plan or any part thereof, into effect.\n(2) No action shall be taken to place any plan or any part thereof, into effect until 60 days have lapsed after the date of its submission to the council, or until the council finds and notifies the submitting commission, board, or agency that the plan is consistent with its comprehensive guide for the metropolitan area and the orderly and economic development of the metropolitan area, whichever first occurs. If, within 60 days after the date of submission, the council finds that a plan, or any part thereof, is inconsistent with its comprehensive guide for the metropolitan area or detrimental to the orderly and economic development of the metropolitan area, or any part thereof, it may direct that the operation of the plan, or such part thereof, be indefinitely suspended; provided that the council shall not direct the suspension of any plan or part thereof of any sanitary sewer district operating within the metropolitan area which pertains to the location and construction of a regional sewer plant or plants or the expansion or improvement of the present Minneapolis-St. Paul sanitary district treatment plant. An affected commission, board, or agency may appeal the decision of the Metropolitan Council suspending a plan, or part thereof, to the entire membership of the Metropolitan Council for public hearing. If the Metropolitan Council and the affected commission, board, or agency are unable to agree as to an adjustment of the plan, so that it may receive the council's approval, then a record of the disagreeing positions of the Metropolitan Council and the affected commission, board, or agency shall be made and the Metropolitan Council shall prepare a recommendation in connection therewith for consideration and disposition by the next regular session of the legislature.",
	"repealed": false
}