{
	"id": "103F.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.321",
	"title": "103F.321 ADMINISTRATION AND RULES.",
	"text": "The commissioner shall administer the wild and scenic rivers system. The commissioner shall conduct studies, develop criteria for classification and designation of rivers, designate rivers for inclusion within the system, manage the components of the system, and adopt rules to manage and administer the system.\n(a) The commissioner shall adopt statewide minimum standards and criteria for the preservation and protection of shorelands within the boundaries of wild, scenic, and recreational rivers.\n(b) The standards and criteria may include:\n(1) the matters covered in the commissioner's standards and criteria for shoreland areas, as provided in sections 103F.201 to 103F.221, except that the distance limitations contained in sections 103F.201 to 103F.221 do not apply to standards and criteria for wild, scenic, and recreational rivers;\n(2) furtherance of the purposes of sections 103F.301 to 103F.345 and of the classifications of rivers; and\n(3) application to the local governments as specified in sections 103F.201 to 103F.221.\nA local unit of government may issue a conditional use permit in a wild and scenic river district designated pursuant to sections 103F.301 to 103F.351 to a home-based business that:\n(1) is located on property that includes the primary residence of the business owner;\n(2) is conducted within the primary residence or residential accessory structure and the residence and accessory structures were constructed prior to May 23, 2009;\n(3) does not necessitate creation of additional impervious surface for vehicular parking on the property;\n(4) satisfies all other requirements in a conditional use permit issued by the local unit of government; and\n(5) satisfies all other state and local requirements applicable to the type of business.\nThe removal of logs and dead trees and branches from the shoreland is exempt from any permit requirements when the logs or dead trees and branches present safety hazards, unless required by a local government unit. Before a person removes logs or dead trees and branches from publicly owned land or land owned by another, the person must obtain permission from the landowner or manager. Public entities are encouraged to allow for the removal of logs and dead trees and branches that present a safety hazard on land managed by the public entity.",
	"repealed": false
}