{
	"id": "245.483",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.483",
	"title": "245.483 TERMINATION OR RETURN OF AN ALLOCATION.",
	"text": "If the commissioner determines that a county is not meeting the requirements of sections 245.461 to 245.486 and 245.487 to 245.4889, or that funds are not being used according to the approved mental health plan, all or part of the mental health funds may be terminated upon 30 days' notice to the county board. The commissioner may require repayment of any funds not used according to the approved mental health plan. If the commissioner receives a written appeal from the county board within the 30-day period, opportunity for a hearing under the Minnesota Administrative Procedure Act, chapter 14, must be provided before the allocation is terminated or is required to be repaid. The 30-day period begins when the county board receives the commissioner's notice by certified mail.\nThe commissioner may reallocate the funds returned.\nIf the commissioner finds that a county board or its contractors are not in compliance with the approved mental health plan or sections 245.461 to 245.486 and 245.487 to 245.4889, the commissioner may delay payment of all or part of the quarterly mental health funds until the county board and its contractors meet the requirements. The commissioner shall not delay a payment longer than three months without first issuing a notice under subdivision 2 that all or part of the allocation will be terminated or required to be repaid. After this notice is issued, the commissioner may continue to delay the payment until completion of the hearing in subdivision 2.\nIf the commissioner determines that services required by sections 245.461 to 245.486 and 245.487 to 245.4889 will not be provided by the county board in the manner or to the extent required by sections 245.461 to 245.486 and 245.487 to 245.4889, the commissioner shall contract directly with providers to ensure that clients receive appropriate services. In this case, the commissioner shall use the county's mental health funds to the extent necessary to carry out the county's responsibilities under sections 245.461 to 245.486 and 245.487 to 245.4889. The commissioner shall work with the county board to allow for a return of authority and responsibility to the county board as soon as compliance with sections 245.461 to 245.486 and 245.487 to 245.4889 can be assured.",
	"repealed": false
}