{
	"id": "216G.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/216G.03",
	"title": "216G.03 PIPELINE PROPOSAL; EASEMENT ACQUISITION.",
	"text": "Any person proposing to construct or operate a pipeline shall comply with the provisions of this section before negotiating or acquiring any easement or right-of-way agreement for that purpose. Any person who negotiates or acquires an easement without complying with the provisions of this section is guilty of a gross misdemeanor.\nAny person proposing to construct or operate a pipeline for which a pipeline routing permit is not required under section 216G.02, shall so notify the Public Utilities Commission and the county board of each county through which the pipeline will be constructed. The notice shall include a description of the route on which the pipeline is proposed to be located, the size and type of pipeline to be constructed, the types of commodities to be carried and the construction and operational characteristics of the pipeline. The proposed route shall be described in sufficient detail so that the owners or lessees of property on which the route is located can be identified. Notice to the Public Utilities Commission shall be accompanied by a fee of $25,000 for preparation of an information book as provided in section 216G.04 and for expenses incurred by state agencies to participate in public meetings as provided in section 216G.05. All fees received are appropriated to the Public Utilities Commission for its own use and for distribution to state agencies for these purposes. The Public Utilities Commission shall refund any amount that exceeds the actual cost to the commission of preparing the information book, including necessary revisions, and to state agencies for participating in the public meetings.\nIf the pipeline route described in the notice is changed to the extent that, in any county, 20 percent or more of the owners or lessees of property on which the new route is located were not owners or lessees of property on which the other route was located, the person proposing to construct and operate the pipeline shall notify the Public Utilities Commission and the county board of that county of the change in the proposed route. No additional fee shall be required for a notice of change of a proposed route.\n(a) If a pipeline routing permit is not required for construction of a pipeline under section 216G.02, a person may not negotiate or acquire an easement or right-of-way agreement for the purpose of constructing and operating a pipeline until 30 days after:\n(1) a public meeting has been held as provided in section 216G.05 in the county in which the right-of-way in question is located; and\n(2) that person has provided to the owner or lessee from whom the easement or agreement is acquired a copy of the information book prepared pursuant to section 216G.04.\n(b) If the original information book is revised pursuant to section 216G.04, each owner or lessee of property which the original route did not affect shall be provided with a copy of the revised book.",
	"repealed": false
}