{
	"id": "214.077",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.077",
	"title": "214.077 TEMPORARY LICENSE SUSPENSION; IMMINENT RISK OF SERIOUS HARM.",
	"text": "(a) Notwithstanding any provision of a health-related professional practice act, when a health-related licensing board receives a complaint regarding a regulated person and has probable cause to believe that the regulated person has violated a statute or rule that the health-related licensing board is empowered to enforce, and continued practice by the regulated person presents an imminent risk of serious harm, the health-related licensing board shall issue an order temporarily suspending the regulated person's authority to practice. The temporary suspension order shall specify the reason for the suspension, including the statute or rule alleged to have been violated. The temporary suspension order shall take effect upon personal service on the regulated person or the regulated person's attorney, or upon the third calendar day after the order is served by first class mail to the most recent address provided to the health-related licensing board for the regulated person or the regulated person's attorney.\n(b) The temporary suspension shall remain in effect until the health-related licensing board or the commissioner completes an investigation, holds a contested case hearing pursuant to the Administrative Procedure Act, and issues a final order in the matter as provided for in this section.\n(c) At the time it issues the temporary suspension order, the health-related licensing board shall schedule a contested case hearing, on the merits of whether discipline is warranted, to be held pursuant to the Administrative Procedure Act. The regulated person shall be provided with at least ten days' notice of any contested case hearing held pursuant to this section. The contested case hearing shall be scheduled to begin no later than 30 days after the effective service of the temporary suspension order.\n(d) The administrative law judge presiding over the contested case hearing shall issue a report and recommendation to the health-related licensing board no later than 30 days after the final day of the contested case hearing. If the administrative law judge's report and recommendations are for no action, the health-related licensing board shall issue a final order pursuant to sections 14.61 and 14.62 within 30 days of receipt of the administrative law judge's report and recommendations. If the administrative law judge's report and recommendations are for action, the health-related licensing board shall issue a final order pursuant to sections 14.61 and 14.62 within 60 days of receipt of the administrative law judge's report and recommendations. Except as provided in paragraph (e), if the health-related licensing board has not issued a final order pursuant to sections 14.61 and 14.62 within 30 days of receipt of the administrative law judge's report and recommendations for no action or within 60 days of receipt of the administrative law judge's report and recommendations for action, the temporary suspension shall be lifted.\n(e) If the regulated person requests a delay in the contested case proceedings provided for in paragraphs (c) and (d) for any reason, the temporary suspension shall remain in effect until the health-related licensing board issues a final order pursuant to sections 14.61 and 14.62.\n(f) This section shall not apply to the Office of Unlicensed Complementary and Alternative Health Practice established under section 146A.02. The commissioner of health shall conduct temporary suspensions for complementary and alternative health care practitioners in accordance with section 146A.09.",
	"repealed": false
}