{
	"id": "518B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/518B.02",
	"title": "518B.02 DOMESTIC ABUSE COUNSELING PROGRAM OR EDUCATIONAL PROGRAM REQUIRED.",
	"text": "If the court stays imposition or execution of a sentence for a domestic abuse offense and places the offender on probation, the court shall order that, as a condition of the stayed sentence, the offender participate in and successfully complete a domestic abuse counseling program or educational program.\n(a) Domestic abuse counseling or educational programs that provide group or class sessions for court-ordered domestic abuse offenders must provide documentation to the probation department or the court on program policies and how the program meets the criteria contained in paragraphs (b) to (l).\n(b) Programs shall require offenders and abusing parties to attend a minimum of 24 sessions or 36 hours of programming, unless a probation agent has recommended fewer sessions. The documentation provided to the probation department or the court must specify the length of the program that offenders are required to complete.\n(c) Programs must have a written policy requiring that counselors and facilitators report to the court and to the offender's probation or corrections officer any threats of violence made by the offender or abusing party, acts of violence by the offender or abusing party, violation of court orders by the offender or abusing party, and violation of program rules that resulted in the offender's or abusing party's termination from the program. Programs shall have written policies requiring that counselors and facilitators hold offenders and abusing parties solely responsible for their behavior.\nPrograms shall have written policies requiring that counselors and facilitators be violence free in their own lives.\n(d) Each program shall conduct an intake process with each offender or abusing party. This intake process shall look for chemical dependency problems and possible risks the offender or abusing party might pose to self or others. The program must have policies regarding referral of a chemically dependent offender or abusing party to a chemical dependency treatment center. If the offender or abusing party poses a risk to self or others, the program shall report this information to the court, the probation or corrections officer, and the victim.\n(e) If the offender or abusing party is reported back to the court or is terminated from the program, the program shall notify the victim of the circumstances unless the victim requests otherwise.\n(f) Programs shall require court-ordered offenders and abusing parties to sign a release of information authorizing communication regarding the offender's or abusing party's progress in the program to the court, the offender's probation or corrections officer, other providers, and the victim. The offender or abusing party may not enter the program if the offender does not sign a release.\n(g) If a counselor or facilitator contacts the victim, the counselor or facilitator must not elicit any information that the victim does not want to provide. A counselor or facilitator who contacts a victim shall (1) notify the victim of the right not to provide any information, (2) notify the victim of how any information provided will be used and with whom it will be shared, and (3) obtain the victim's permission before eliciting information from the victim or sharing information with anyone other than staff of the counseling program.\nPrograms shall have written policies requiring that counselors and facilitators inform victims of the confidentiality of information as provided by this subdivision. Programs must maintain separate files for information pertaining to the offender or abusing party and to the victim.\nIf a counselor or facilitator contacts a victim, the counselor or facilitator shall provide the victim with referral information for support services.\n(h) Programs shall have written policies forbidding program staff from disclosing any confidential communication made by the offender or abusing party without the consent of the offender or abusing party, except that programs must warn a potential victim of imminent danger based upon information provided by an offender or abusing party.\n(i) The counseling program or educational program must provide services in a group setting, unless the offender or abusing party would be inappropriate in a group setting.\nPrograms must provide separate sessions for male and female offenders and abusing parties.\n(j) Programs shall have written policies forbidding program staff from offering or referring marriage or couples counseling until the offender or abusing party has completed a domestic abuse counseling program or educational program for the minimum number of court-ordered sessions and the counselor or facilitator reasonably believes that the violence, intimidation, and coercion has ceased and the victim feels safe to participate.\n(k) Programs must have written policies requiring that the counselor or facilitator report when the court-ordered offender or abusing party has completed the program to the court and the offender's probation or corrections officer.\n(l) Programs must have written policies to coordinate with the court, probation and corrections officers, battered women's and domestic abuse programs, child protection services, and other providers on promotion of victim safety and offender accountability.\nMS 2022 [Repealed, 2023 c 52 art 5 s 80]",
	"repealed": false
}