{
	"id": "343.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/343.22",
	"title": "343.22 INVESTIGATION OF CRUELTY COMPLAINTS.",
	"text": "Any person who has reason to believe that a violation of this chapter has taken place or is taking place may apply to any court having jurisdiction over actions alleging violation of that section for a warrant and for investigation. The court shall examine under oath the person so applying and any witnesses the applicant produces and the court shall take their affidavits in writing. The affidavits must set forth facts tending to establish the grounds for believing a violation of this chapter has occurred or is occurring, or probable cause to believe that a violation exists. If the court is satisfied of the existence of the grounds of the application, or that there is probable cause to believe a violation exists, it shall issue a signed search warrant and order for investigation to a peace officer in the county. The order shall command the officer to proceed promptly to the location of the alleged violation. The order may command that a doctor of veterinary medicine accompany the officer.\nThe peace officer shall search the place designated in the warrant and, together with the veterinary doctor, shall conduct an investigation of the facts surrounding the alleged violation. The peace officer may retain in custody, subject to the order of the court, any property or things which are specified in the warrant, including any animal if the warrant so specifies. The warrant shall contain the names of the persons presenting affidavits in support of the application and the grounds for its issuance. Service shall be made in accordance with the provisions of sections 626.13, 626.14, and 626.16. The warrant must be executed and returned to the court which issued the warrant within ten days after its date; after the expiration of that time the warrant, unless executed, is void. The officer executing the warrant shall promptly return the warrant to the court, and deliver to it a written inventory of the property or things taken, verified by the certificate of the officer. The warrant and order for investigation issued pursuant to this section and section 343.23 shall have the same force as a warrant issued pursuant to chapter 626.\nUpon a proper determination by a licensed doctor of veterinary medicine, any animal taken into custody pursuant to this section may be immediately disposed of when the animal is suffering and is beyond cure through reasonable care and treatment. All other animals shall be disposed of as provided in section 343.235. The authority taking custody of the animals may recover all costs incurred under this section.",
	"repealed": false
}