{
	"id": "61A.276",
	"url": "https://www.revisor.mn.gov/statutes/cite/61A.276",
	"title": "61A.276 FUNDING AGREEMENTS.",
	"text": "An insurer authorized to deliver or issue for delivery annuity contracts in this state may deliver or issue for delivery one or more funding agreements. The issuance or delivery of these funding agreements shall not be deemed to be doing a kind of business specifically authorized by section 60A.06. Notwithstanding the definition of contracts of life and endowment insurance or of annuities under section 60A.06, subdivision 1, clause (4) or the definition of life insurance company under section 61A.01, the issuance or delivery of a funding agreement by an insurer in this state constitutes doing an insurance business in the state.\nThe funding agreements may be issued to: (1) individuals; or (2) persons authorized by a state or foreign country to engage in an insurance business or subsidiaries or affiliates of these persons; or (3) entities other than individuals and other than persons authorized to engage in an insurance business, and subsidiaries and affiliates of these persons, for the following purposes: (i) to fund benefits under any employee benefit plan as defined in the Employee Retirement Income Security Act of 1974, as now or hereafter amended, maintained in the United States or in a foreign country; (ii) to fund the activities of any organization exempt from taxation under section 501(c) of the Internal Revenue Code of 1986, as amended through December 31, 1992, or of any similar organization in any foreign country; (iii) to fund any program of any state, foreign country or political subdivision thereof, or any agency or instrumentality thereof; (iv) to fund any agreement providing for periodic payments in satisfaction of a claim; or (v) to fund a program of an institution that has assets in excess of $25,000,000. No funding agreement shall be issued in an amount less than $1,000,000.\nNo amounts shall be guaranteed or credited under a funding agreement except upon reasonable assumptions as to investment income and expenses and on a basis equitable to all holders of funding agreements of a given class. The funding agreements shall not provide for payments to or by the insurer based on mortality or morbidity contingencies.\n[Repealed, 2011 c 61 s 9]\nThe commissioner may adopt rules relating to (1) the standards to be followed in the approval of forms of the funding agreements, (2) the reserves to be maintained by insurers issuing the funding agreements, (3) the accounting and reporting of funds credited under the funding agreements, (4) the disclosure of information to be given to holders and prospective holders of the funding agreements, and (5) the qualification and compensation of persons selling the funding agreements on behalf of insurers. Notwithstanding any other provision of law, the commissioner has sole authority to regulate the issuance and sale of the funding agreements, including the persons selling the funding agreements on behalf of insurers.",
	"repealed": false
}