{
	"id": "13D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/13D.03",
	"title": "13D.03 CLOSED MEETINGS FOR LABOR NEGOTIATIONS STRATEGY.",
	"text": "(a) Section 13D.01, subdivisions 1, 2, 4, 5, and section 13D.02 do not apply to a meeting held pursuant to the procedure in this section.\n(b) The governing body of a public employer may by a majority vote in a public meeting decide to hold a closed meeting to consider strategy for labor negotiations, including negotiation strategies or developments or discussion and review of labor negotiation proposals, conducted pursuant to sections 179A.01 to 179A.25.\n(c) The time of commencement and place of the closed meeting shall be announced at the public meeting.\n(d) A written roll of members and all other persons present at the closed meeting shall be made available to the public after the closed meeting.\n(a) The proceedings of a closed meeting to discuss negotiation strategies shall be tape-recorded at the expense of the governing body.\n(b) The recording shall be preserved for two years after the contract is signed and shall be made available to the public after all labor contracts are signed by the governing body for the current budget period.\n(a) If an action is brought claiming that public business other than discussions of labor negotiation strategies or developments or discussion and review of labor negotiation proposals was transacted at a closed meeting held pursuant to this section during the time when the tape is not available to the public, the court shall review the recording of the meeting in camera.\n(b) If the court finds that this section was not violated, the action shall be dismissed and the recording shall be sealed and preserved in the records of the court until otherwise made available to the public pursuant to this section.\n(c) If the court finds that this section was violated, the recording may be introduced at trial in its entirety subject to any protective orders as requested by either party and deemed appropriate by the court.",
	"repealed": false
}