{
	"id": "321.0407",
	"url": "https://www.revisor.mn.gov/statutes/cite/321.0407",
	"title": "321.0407 RIGHT OF GENERAL PARTNER AND FORMER GENERAL PARTNER TO INFORMATION.",
	"text": "(a) A general partner, without having any particular purpose for seeking the information, may inspect and copy during regular business hours:\n(1) in the limited partnership's designated office, required information; and\n(2) at a reasonable location specified by the limited partnership, any other records maintained by the limited partnership regarding the limited partnership's activities and financial condition.\n(b) Each general partner and the limited partnership shall furnish to a general partner:\n(1) without demand, any information concerning the limited partnership's activities and financial condition reasonably required for the proper exercise of the general partner's rights and duties under the partnership agreement or this chapter; and\n(2) on demand, any other information concerning the limited partnership's activities, except to the extent the demand or the information demanded is unreasonable or otherwise improper under the circumstances.\n(c) Subject to subsection (e), on ten days' demand made in a record received by the limited partnership, a person dissociated as a general partner may have access to the information and records described in subsection (a) at the location specified in subsection (a) if:\n(1) the information or record pertains to the period during which the person was a general partner;\n(2) the person seeks the information or record in good faith; and\n(3) the person satisfies the requirements imposed on a limited partner by section 321.0304(b).\n(d) The limited partnership shall respond to a demand made pursuant to subsection (c) in the same manner as provided in section 321.0304(c).\n(e) If a general partner dies, section 321.0704 applies.\n(f) The limited partnership may impose reasonable restrictions on the use of information under this section. In any dispute concerning the reasonableness of a restriction under this subsection, the limited partnership has the burden of proving reasonableness.\n(g) A limited partnership may charge a person dissociated as a general partner that makes a demand under this section reasonable costs of copying, limited to the costs of labor and material.\n(h) A general partner or person dissociated as a general partner may exercise the rights under this section through an attorney or other agent. Any restriction imposed under subsection (f) or by the partnership agreement applies both to the attorney or other agent and to the general partner or person dissociated as a general partner.\n(i) The rights under this section do not extend to a person as transferee, but the rights under subsection (c) of a person dissociated as a general may be exercised by the legal representative of an individual who dissociated as a general partner under section 321.0603(7)(B) or (C).",
	"repealed": false
}