{
	"id": "241.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.27",
	"title": "241.27 VOCATIONAL TRAINING OF INMATES; MINNESOTA CORRECTIONAL INDUSTRIES; REVOLVING ACCOUNTS.",
	"text": "For the purpose of providing adequate, regular and suitable employment, educational training, and to aid the inmates of state correctional facilities, the commissioner of corrections may establish, equip, maintain and operate at any correctional facility under the commissioner's control such industrial and commercial activities as may be deemed necessary and suitable to the profitable employment, educational training and development of proper work habits of the inmates of state correctional facilities. The industrial and commercial activities authorized by this section are designated MINNCOR industries and shall be for the primary purpose of sustaining and ensuring MINNCOR industries' self-sufficiency, providing educational training, meaningful employment and the teaching of proper work habits to the inmates of correctional facilities under the control of the commissioner of corrections, and not solely as competitive business ventures. The net profits from these activities shall be used for the benefit of the inmates as it relates to education, self-sufficiency skills, and transition services and not to fund non-inmate-related activities or mandates. Prior to the establishment of any industrial and commercial activity, the commissioner of corrections may consult with representatives of business, industry, organized labor, the state Department of Education, the state Apprenticeship Council, the state Department of Labor and Industry, the Department of Employment and Economic Development, the Department of Administration, and such other persons and bodies as the commissioner may feel are qualified to determine the quantity and nature of the goods, wares, merchandise and services to be made or provided, and the types of processes to be used in their manufacture, processing, repair, and production consistent with the greatest opportunity for the reform and educational training of the inmates, and with the best interests of the state, business, industry and labor.\nThe commissioner of corrections shall, at all times in the conduct of any industrial or commercial activity authorized by this section, utilize inmate labor to the greatest extent feasible, provided, however, that the commissioner may employ all administrative, supervisory and other skilled workers necessary to the proper instruction of the inmates and the profitable and efficient operation of the industrial and commercial activities authorized by this section.\nAdditionally, the commissioner of corrections may authorize the director of any correctional facility under the commissioner's control to accept work projects from outside sources for processing, fabrication or repair, provided that preference shall be given to the performance of such work projects for state departments and agencies.\nThe commissioner of corrections shall develop, implement, and maintain a formal marketing plan to attract private sector businesses and industries and state and local government agencies to employ incarcerated offenders through MINNCOR industries. The plan shall be reviewed and updated annually by the commissioner of corrections.\nThere is established in the Department of Corrections under the control of the commissioner of corrections the Minnesota correctional industries revolving fund to which shall be transferred the revolving funds authorized in Minnesota Statutes 1978, sections 243.41 and 243.85, clause (f), and any other industrial revolving funds heretofore established at any state correctional facility under the control of the commissioner of corrections. The revolving fund established shall be used for the conduct of the industrial and commercial activities now or hereafter established at any state correctional facility, including but not limited to the purchase of equipment, raw materials, the payment of salaries, wages and other expenses necessary and incident thereto. The purchase of services, materials, and commodities used in and held for resale are not subject to the competitive bidding procedures of section 16C.06, but are subject to all other provisions of chapters 16B and 16C. When practical, purchases must be made from small targeted group businesses designated under section 16C.16. Additionally, the expenses of inmate educational training, self-sufficiency skills, transition services, and the inmate release fund may be financed from the correctional industries revolving fund in an amount to be determined by the commissioner or the MINNCOR chief executive officer as duly appointed by the commissioner. The proceeds and income from all industrial and commercial activities conducted at state correctional facilities shall be deposited in the correctional industries revolving fund subject to disbursement as hereinabove provided. The commissioner of corrections may request that money in the fund be invested pursuant to section 11A.25; the proceeds from the investment not currently needed shall be accounted for separately and credited to the fund.\nThe correctional industries revolving fund shall be deposited in the state treasury and paid out only on proper vouchers as may be authorized and approved by the commissioner of corrections, and in the same manner and under the same restrictions as are now provided by law for the disbursement of funds by the commissioner. An amount deposited in the state treasury equal to six months of net operating cash as determined by the prior 12 months of revenue and cash flow statements, shall be restricted for use only by correctional industries as described under subdivision 2. For purposes of this subdivision, \"net operating cash\" means net income minus sales plus cost of goods sold. Cost of goods sold include all direct costs of correctional industry products attributable to their production. The commissioner of corrections is authorized to keep and maintain at any correctional facility under the commissioner's control a contingent fund, as provided in section 241.13; but the contingent fund shall at all times be covered and protected by a proper and sufficient bond to be duly approved as by law now provided.\nThe commissioner of corrections is authorized, when in the commissioner's judgment it becomes necessary in order to meet current demands on the correctional industries revolving fund, to borrow sums of money as may be necessary. The sums so borrowed shall not exceed, in any one year, six months of net operating cash as determined by the previous 12 months of the correctional industries' revenue and cash flow statements.\nWhen the commissioner of corrections shall certify to the commissioner of management and budget that, in the commissioner's judgment, it is necessary to borrow a specified sum of money in order to meet the current demands on the correctional industries revolving fund, and the commissioner of management and budget may, in the commissioner's discretion, transfer and credit to the correctional industries revolving fund, from any moneys in the state treasury not required for immediate disbursement, the whole or such part of the amount so certified as they deem advisable, which sum so transferred shall be repaid by the commissioner from the revolving fund to the fund from which transferred, at such time as shall be specified by the commissioner of management and budget, together with interest thereon at such rate as shall be specified by the commissioner of management and budget, not exceeding four percent per annum. When any transfer shall so have been made to the correctional industries revolving fund, the commissioner of management and budget shall notify the commissioner of corrections of the amount so transferred to the credit of the correctional industries revolving fund, the date when the same is to be repaid, and the rate of interest so to be paid.\nGrants received from the federal government for any vocational training program or for administration under the jurisdiction of the commissioner of corrections shall, in the first instance, be credited to a federal grant fund and shall be transferred therefrom to the credit of the commissioner of corrections in the appropriate account upon certification of the commissioner of corrections that the amounts so requested to be transferred have been earned or are required for the purposes and program intended. Moneys received by the federal grant fund need not be budgeted as such provided transfers from the fund are budgeted for allotment purposes in the appropriate appropriation.\nMINNCOR shall include its full costs for inmate wages and the money it receives from the department for inmate confinement costs in its annual financial statements and reports. In addition, MINNCOR shall disclose in its annual report how the money it receives from the department for inmate confinement costs affects its profitability.\n(a) MINNCOR shall use revenue contracts or purchase orders on forms approved by the Department of Administration whenever it allows private businesses to use inmate labor. MINNCOR shall determine whether to use a revenue contract or a purchase order according to criteria that the Department of Corrections has approved having taken into account the recommendations of the legislative auditor contained in its 2009 report on MINNCOR.\n(b) MINNCOR shall develop a uniform method to report sales and expenditure data related to individual labor arrangements with private businesses. MINNCOR shall review the data annually to assess how the arrangements, both individually and collectively, affect MINNCOR achieving its goals of high inmate participation in industry and profitability.\nMINNCOR may not begin work on a project until a contract or purchase order has been signed and may not continue work on a project after a contract or purchase order has expired.",
	"repealed": false
}