{
	"id": "412.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/412.091",
	"title": "412.091 DISSOLUTION; PETITION; VOTE.",
	"text": "Whenever a number of voters equal to one-third of those voting at the last preceding city election petition the chief administrative law judge of the state Office of Administrative Hearings to dissolve the city, a special election shall be called to vote upon the question. Before the election, the chief administrative law judge shall designate a time and place for a hearing in accordance with section 414.09. After the hearing, the chief administrative law judge shall issue an order which shall include a date for the election, a determination of what town or towns the territory of the city shall belong to if the voters favor dissolution, and other necessary provisions. The ballots used at such election shall be substantially in the following form: \"Shall the city of ... be dissolved?\" If a majority of those voting on the question favor dissolution, the clerk shall file a certificate of the result with the chief administrative law judge, the secretary of state, and the county auditor of the county in which the city is situated. Six months after the date of such election, the city shall cease to exist. Within such six months, the council shall audit all claims against the city, settle with the treasurer, and other city officers, and apply the assets of the city to the payment of its debts. If any debts remain unpaid, other than bonds, the city clerk shall file a schedule of such debts with the county treasurer and the council shall levy a tax sufficient for their payment, the proceeds of which, when collected, shall be paid by the county treasurer to the creditors in proportion to their several claims until all are discharged. The principal and interest on outstanding bonds shall be paid when due by the county treasurer from a tax annually spread by the county auditor against property formerly included within the city until the bonds are fully paid. All city property and all rights of the city shall, upon dissolution, inure in the town or towns designated as the legal successor to the city. If the city territory goes to more than one town, surplus cash assets and unsold city property shall be distributed as provided by the order for the election.",
	"repealed": false
}