{
	"id": "465.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/465.82",
	"title": "465.82 COOPERATION AND COMBINATION PLAN.",
	"text": "Each governing body that proposes to take part in a combination under sections 465.81 to 465.86 must by resolution adopt a plan for cooperation and combination. The plan must address each item in this section. The plan must be specific for any item that will occur within three years and may be general or set forth alternative proposals for an item that will occur more than three years in the future. For a metropolitan area local government unit, the plan must be submitted to the Metropolitan Council for review and comment. The council may point out any resources or technical assistance it may be able to provide a governing body submitting a plan under this subdivision. Significant modifications and specific resolutions of items must be submitted to the council, if appropriate, for review and comment. In the official newspaper of each local government unit proposing to take part in the combination, the governing body shall publish at least a summary of the adopted plans, each significant modification and resolution of items, and, if appropriate, the results of each council review and comment. If a territory of a unit is to be apportioned between or among two or more units contiguous to the unit that is to be apportioned, the plan must specify the area that will become a part of each remaining unit.\nThe plan must state:\n(1) the specific cooperative activities the units will engage in during the first two years of the venture;\n(2) the steps to be taken to effect the merger of the governmental units, with completion no later than four years after the process begins;\n(3) the steps by which a single governing body will be created or, when the entire territory of a unit will be apportioned between or among two or more units contiguous to the unit that is to be apportioned, the steps to be taken by the governing bodies of the remaining units to provide for representation of the residents of the apportioned unit;\n(4) changes in services provided, facilities used, and administrative operations and staffing required to effect the preliminary cooperative activities and the final merger, and a two-, five-, and ten-year projection of expenditures for each unit if it combined and if it remained separate;\n(5) treatment of employees of the merging governmental units, specifically including provisions for reassigning employees, dealing with exclusive representatives, and providing financial incentives to encourage early retirements;\n(6) financial arrangements for the merger, specifically including responsibility for debt service on outstanding obligations of the merging units;\n(7) one- and two-year impact analyses, prepared by the granting state agency at the request of the local government unit, of major state aid revenues received for each unit if it combined and if it remained separate, including an impact analysis, prepared by the Department of Revenue, of any property tax revenue implications associated with tax increment financing districts and fiscal disparities under chapter 276A or 473F resulting from the merger;\n(8) procedures for a referendum to be held before the proposed combination to approve combining the local government units, specifically stating whether a majority of those voting in each district proposed for combination or a majority of those voting on the question in the entire area proposed for combination is needed to pass the referendum; and\n(9) a time schedule for implementation.\nNotwithstanding clause (3) or any other law to the contrary, all current members of the governing bodies of the local government units that propose to combine under sections 465.81 to 465.86 may serve on the initial governing body of the combined unit until a gradual reduction in membership is achieved by foregoing election of new members when terms expire until the number permitted by other law is reached.\nThe plan for cooperation and combination adopted in accordance with subdivision 1 may establish an interim governing body to act on behalf of the new local government unit before the effective date of the combination. If established, the interim governing body must consist of at least a majority of the elected officials from each local government unit taking part in the combination. If the plan establishes an interim governing body, the governing body of each unit taking part in the combination shall appoint its representatives to serve on the interim governing body. An interim governing body may not take any official action on behalf of the new local government unit before approval of the combination through the referendum required by section 465.84. After approval of the combination through the referendum, and before the effective date of the combination, an interim governing body may exercise all statutory authority of the governing body of the new local government unit, including the authority to enter into contracts and adopt policies and local ordinances.\nThe plan for cooperation and combination adopted in accordance with subdivision 1 may establish that the tax rate of the local government unit with the lesser tax rate prior to the effective date of combination shall be increased in substantially equal proportions over not more than six years to equality with the tax rate on the property already within the borders of the local unit of government with the higher tax rate. The appropriate period of time, if any, for transition to the higher tax rate shall be based on the time reasonably required to effectively provide equal municipal services to the residents of the local unit of government with the lower tax rate.",
	"repealed": false
}