{
	"id": "256.4772",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.4772",
	"title": "256.4772 MINNESOTA INCLUSION INITIATIVE GRANT.",
	"text": "The commissioner of human services shall establish the Minnesota inclusion initiative grant program to encourage self-advocacy groups of persons with intellectual and developmental disabilities to develop and organize projects that increase the inclusion of persons with intellectual and developmental disabilities in the community, improve community integration outcomes, educate decision-makers and the public about persons with intellectual and developmental disabilities, including the systemic barriers that prevent them from being included in the community, and to advocate for changes that increase access to formal and informal supports and services necessary for greater inclusion of persons with intellectual and developmental disabilities in the community.\nThe commissioner of human services, as authorized by section 256.01, subdivision 2, paragraph (a), clause (6), shall issue a request for proposals to contract with a public or private entity to (1) serve as a fiscal host for the money appropriated for the purposes described in this section, and (2) develop guidelines, criteria, and procedures for awarding grants. The fiscal host shall establish an advisory committee consisting of self-advocates, nonprofit advocacy organizations, and Department of Human Services staff to review applications and award grants under this section.\n(a) Entities seeking grants under this section shall apply to the advisory committee of the fiscal host under contract with the commissioner. The grant applicant must include a description of the project that the applicant is proposing, the amount of money that the applicant is seeking, and a proposed budget describing how the applicant will spend the grant money.\n(b) The advisory committee may award grants to applicants only for projects that meet the requirements of subdivision 4.\nProjects funded by grant money must have person-centered goals, call attention to issues that limit inclusion of persons with intellectual and developmental disabilities, address barriers to inclusion that persons with intellectual and developmental disabilities face in their communities, or increase the inclusion of persons with intellectual and developmental disabilities in their communities. Applicants may propose strategies to increase inclusion of persons with intellectual and developmental disabilities in their communities by:\n(1) decreasing barriers to workforce participation experienced by persons with intellectual and developmental disabilities;\n(2) overcoming barriers to accessible and reliable transportation options for persons with intellectual and developmental disabilities;\n(3) identifying and addressing barriers to voting experienced by persons with intellectual and developmental disabilities;\n(4) advocating for increased accessible housing for persons with intellectual and developmental disabilities;\n(5) working with governmental agencies or businesses on accessibility issues under the Americans with Disabilities Act;\n(6) increasing collaboration between self-advocacy groups and other organizations to effectively address systemic issues that impact persons with intellectual and developmental disabilities;\n(7) increasing capacity for inclusion in a community; or\n(8) providing public education and awareness of the civil and human rights of persons with intellectual and developmental disabilities.\n(a) Grant recipients shall provide the advisory committee with a report about the activities funded by the grant program in a format and at a time specified by the advisory committee. The advisory committee shall require grant recipients to include in the grant recipient's report at least the information necessary for the advisory committee to meet the advisory committee's obligation under paragraph (b).\n(b) The advisory committee shall provide the commissioner with a report that describes all of the activities and outcomes of projects funded by the grant program in a format and at a time determined by the commissioner.",
	"repealed": false
}