{
	"id": "473.1565",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.1565",
	"title": "473.1565 METROPOLITAN AREA WATER SUPPLY PLANNING ACTIVITIES; ADVISORY COMMITTEES.",
	"text": "(a) The Metropolitan Council must carry out planning activities addressing the water supply needs of the metropolitan area as defined in section 473.121, subdivision 2. The planning activities must include, at a minimum:\n(1) development and maintenance of a base of technical information needed for sound water supply decisions including surface and groundwater availability analyses, water demand projections, water withdrawal and use impact analyses, modeling, and similar studies;\n(2) development and periodic update of a metropolitan area master water supply plan, prepared in cooperation with and subject to the approval of the policy advisory committee established in this section, that:\n(i) provides guidance for local water supply systems and future regional investments;\n(ii) emphasizes conservation, interjurisdictional cooperation, and long-term sustainability; and\n(iii) addresses the reliability, security, and cost-effectiveness of the metropolitan area water supply system and its local and subregional components;\n(3) recommendations for clarifying the appropriate roles and responsibilities of local, regional, and state government in metropolitan area water supply;\n(4) recommendations for streamlining and consolidating metropolitan area water supply decision-making and approval processes; and\n(5) recommendations for the ongoing and long-term funding of metropolitan area water supply planning activities and capital investments.\n(b) The council must carry out the planning activities in this subdivision in consultation with the Metropolitan Area Water Supply Policy and Technical Advisory Committees established in this section.\n(a) A Metropolitan Area Water Supply Policy Advisory Committee is established to assist the council in its planning activities in subdivision 1. The policy advisory committee has the following membership:\n(1) the commissioner of agriculture or the commissioner's designee;\n(2) the commissioner of health or the commissioner's designee;\n(3) the commissioner of natural resources or the commissioner's designee;\n(4) the commissioner of the Pollution Control Agency or the commissioner's designee;\n(5) two officials of counties that are located in the metropolitan area, appointed by the governor, in consultation with the Association of Minnesota Counties;\n(6) five officials of noncounty local governmental units that are located in the metropolitan area, appointed by the governor, in consultation with the Association of Metropolitan Municipalities;\n(7) the chair of the Metropolitan Council or the chair's designee, who is chair of the advisory committee;\n(8) one official each from the counties of Chisago, Isanti, Sherburne, and Wright, appointed by the governor, in consultation with the Association of Minnesota Counties and the League of Minnesota Cities; and\n(9) a representative of the Saint Paul Regional Water Services, appointed by and serving at the pleasure of the Saint Paul Regional Water Services, and a representative of the Minneapolis Water Department, appointed by and serving at the pleasure of the mayor of the city of Minneapolis.\nA local government unit in each of the seven counties in the metropolitan area and Chisago, Isanti, Sherburne, and Wright Counties must be represented in the 11 appointments made under clauses (5), (6), and (8).\n(b) Members of the advisory committee appointed by the governor serve at the pleasure of the governor. Members of the advisory committee serve without compensation but may be reimbursed for their reasonable expenses as determined by the Metropolitan Council.\n(c) The council must consider the work and recommendations of the policy advisory committee when the council is preparing its regional development framework.\nA Metropolitan Area Water Supply Technical Advisory Committee is established to inform the policy advisory committee's work by providing scientific and engineering expertise necessary to provide the region an adequate and sustainable water supply. The technical advisory committee consists of 15 members appointed by the policy advisory committee, with the majority of members representing single-city and multicity public water supply systems in the metropolitan area and including experts in:\n(1) water resources analysis and modeling;\n(2) hydrology; and\n(3) the engineering, planning, design, and construction of water systems or water systems finance.\nMembers of the technical advisory committee serve at the pleasure of the policy advisory committee, without compensation, but may be reimbursed for their reasonable expenses as determined by the council.\n(a) The council must submit reports to the legislature regarding its findings, recommendations, and continuing planning activities under subdivision 1. These reports shall be included in the \"Minnesota Water Plan\" required in section 103B.151, and five-year interim reports may be provided as necessary.\n(b) By February 15, 2017, and at least every five years thereafter, the policy advisory committee shall report to the council, the Legislative Water Commission, and the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over environment and natural resources with the information required under this section. The policy advisory committee's report and recommendations must include information provided by the technical advisory committee.",
	"repealed": false
}