{
	"id": "484.702",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.702",
	"title": "484.702 EXPEDITED CHILD SUPPORT HEARING PROCESS.",
	"text": "(a) The supreme court shall create an expedited child support hearing process to establish, modify, and enforce child support; and enforce maintenance, if combined with child support. The process must be designed to handle child support and paternity matters in compliance with federal law.\n(b) All proceedings establishing, modifying, or enforcing support orders; and enforcing maintenance orders, if combined with a support proceeding, must be conducted in the expedited process if the case is a IV-D case. Cases that are not IV-D cases may not be conducted in the expedited process.\n(c) This section does not prevent a party, upon timely notice to the public authority, from commencing an action or bringing a motion in district court for the establishment, modification, or enforcement of support, or enforcement of maintenance orders if combined with a support proceeding, where additional issues involving domestic abuse, establishment or modification of custody or visitation, or property issues exist as noticed by the complaint, motion, counter motion, or counter action.\n(d) At the option of the county, the expedited process may include contempt actions or actions to establish parentage.\n(e) The expedited process should meet the following goals:\n(1) be streamlined and uniform statewide and result in timely and consistent issuance of orders;\n(2) be accessible to the parties without the need for an attorney and minimize litigation;\n(3) be a cost-effective use of limited financial resources; and\n(4) comply with applicable federal law.\n(f) For purposes of this section, \"IV-D case\" has the meaning given in section 518A.26, subdivision 10.\n(a) The state court administrator shall provide for the administration of the expedited child support hearing process in each judicial district.\n(b) Until June 30, 2000, the Office of Administrative Hearings and the state court administrator may enter into contracts to provide one or more administrative law judges to serve as child support magistrates and for administrative and case management support. The title to all personal property used in the administrative child support process mutually agreed upon by the Office of Administrative Hearings and the Office of the State Court Administrator must be transferred to the state court administrator for use in the expedited child support process.\nThe chief judge of each judicial district may appoint one or more suitable persons to act as child support magistrates for the expedited child support hearing process, with the confirmation of the supreme court. A child support magistrate appointed to serve in the expedited child support process, whether hired on a full-time, part-time, or contract basis, is a judicial officer under section 43A.02, subdivision 25, and is an employee of the state under section 3.732 for purposes of section 3.736 only.\nThe supreme court may:\n(1) provide training for individuals who serve as child support magistrates for the expedited child support hearing process;\n(2) establish minimum qualifications for child support magistrates; and\n(3) establish a policy for evaluating and removing child support magistrates.\nThe supreme court shall adopt rules to implement the expedited child support hearing process under this section.\nHearings and proceedings conducted in the expedited child support process under this section may be reported by use of electronic recording equipment provided that the equipment meets the minimum standards established by the state court administrator. Electronic recording equipment must be operated and monitored by a person who meets the minimum qualifications established by the state court administrator.",
	"repealed": false
}