{
	"id": "16E.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.016",
	"title": "16E.016 RESPONSIBILITY FOR INFORMATION TECHNOLOGY SERVICES AND EQUIPMENT.",
	"text": "(a) The chief information officer is responsible for providing or entering into managed services contracts for the provision, improvement, development, and lifecycle management of the following information technology systems and services to state agencies:\n(1) state data centers;\n(2) mainframes including system software;\n(3) servers including system software;\n(4) desktops including system software;\n(5) laptop computers including system software;\n(6) a data network including system software;\n(7) database, electronic mail, office systems, reporting, and other standard software tools;\n(8) business application software and related technical support services;\n(9) help desk for the components listed in clauses (1) to (8);\n(10) maintenance, problem resolution, and break-fix for the components listed in clauses (1) to (8);\n(11) regular upgrades, replacement, and lifecycle management for the components listed in clauses (1) to (8); and\n(12) network-connected output devices.\n(b) All state agency employees whose work primarily involves functions specified in paragraph (a) are employees of the Department of Information Technology Services. This includes employees who directly perform the functions in paragraph (a), as well as employees whose work primarily involves managing, supervising, or providing administrative services or support services to employees who directly perform these functions. The chief information officer may assign employees of the department to perform work exclusively for another state agency.\n(c) Subject to sections 16C.08 and 16C.09, the chief information officer may allow a state agency to obtain services specified in paragraph (a) through a contract with an outside vendor when the chief information officer and the agency head agree that a contract would provide best value, as defined in section 16C.02, under the service-level agreement. The chief information officer must require that agency contracts with outside vendors ensure that systems and services are compatible with standards established by the Department of Information Technology Services.\n(d) The Minnesota State Retirement System, the Public Employees Retirement Association, the Teachers Retirement Association, the State Board of Investment, the Campaign Finance and Public Disclosure Board, the State Lottery, and the Statewide Radio Board are not state agencies for purposes of this section.",
	"repealed": false
}