{
	"id": "302A.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.135",
	"title": "302A.135 PROCEDURE FOR AMENDMENT AFTER ISSUANCE OF SHARES.",
	"text": "Except as otherwise set forth in section 302A.133, after the issuance of shares by the corporation, the articles may be amended in the manner set forth in this section.\nA resolution approved by the affirmative vote of a majority of the directors present, or proposed by a shareholder or shareholders holding three percent or more of the voting power of the shares entitled to vote, that sets forth the proposed amendment shall be submitted to a vote at the next regular or special meeting of the shareholders of which notice has not yet been given but still can be timely given. Any number of amendments may be submitted to the shareholders and voted upon at one meeting, but the same or substantially the same amendment proposed by a shareholder or shareholders need not be submitted to the shareholders or be voted upon at more than one meeting during a 15-month period, except that if a corporation is registered or reporting under the federal securities laws, the provisions of this sentence do not apply to the extent that those provisions are in conflict with the federal securities laws or rules adopted under those laws. The resolution may amend the articles in their entirety to restate and supersede the original articles and all amendments to them.\nWritten notice of the shareholders' meeting setting forth the substance of the proposed amendment shall be given to each shareholder entitled to vote in the manner provided in section 302A.435 for the giving of notice of meetings of shareholders.\n(a) The proposed amendment is adopted when approved by the affirmative vote of the shareholders required by section 302A.437, except as provided in paragraphs (b) and (c) and subdivision 5.\n(b) For a closely held corporation, if the articles provide for a specified proportion or number equal to or larger than the majority necessary to transact a specified type of business at a meeting, or if it is proposed to amend the articles to provide for a specified proportion or number equal to or larger than the majority necessary to transact a specified type of business at a meeting, the affirmative vote necessary to add the provision to, or to amend an existing provision in, the articles is the larger of:\n(1) the specified proportion or number or, in the absence of a specific provision, the affirmative vote necessary to transact the type of business described in the proposed amendment at a meeting immediately before the effectiveness of the proposed amendment; or\n(2) the specified proportion or number that would, upon effectiveness of the proposed amendment, be necessary to transact the specified type of business at a meeting.\n(c) For corporations other than closely held corporations, if the articles provide for a larger proportion or number to transact a specified type of business at a meeting, the affirmative vote of that larger proportion or number is necessary to amend the articles to decrease the proportion or number necessary to transact the business.\nAn amendment that merely restates the existing articles, as amended, may be authorized by a resolution approved by the board and may, but need not, be submitted to and approved by the shareholders as provided in subdivisions 2, 3, and 4.\nNotwithstanding any contrary provision of this chapter, the board of directors of a corporation that is registered as an open-end management investment company under the Investment Company Act of 1940 may, without shareholder approval, increase or decrease, but not below the then-outstanding shares, the aggregate number of shares the corporation has authority to issue, including shares of any class or series, unless a provision has been included in the corporation's articles prohibiting the board from increasing or decreasing the aggregate number of shares, or any class or series of shares, as applicable, that the corporation has authority to issue.\nAn amendment that only changes a corporation's corporate name may be authorized by a resolution approved by the board and may, but need not, be submitted to and approved by the shareholders as provided in subdivisions 2, 3, and 4.",
	"repealed": false
}