{
	"id": "518A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.28",
	"title": "518A.28 PROVIDING INCOME INFORMATION.",
	"text": "(a) In any case where the parties have joint children for which a child support order must be determined, the parties shall serve and file with their initial pleadings or motion documents, a financial affidavit, disclosing all sources of gross income for purposes of section 518A.29. The financial affidavit shall include relevant supporting documentation necessary to calculate the parental income for child support under section 518A.26, subdivision 15, including, but not limited to, pay stubs for the most recent three months, employer statements, or statements of receipts and expenses if self-employed. Documentation of earnings and income also include relevant copies of each parent's most recent federal tax returns, including W-2 forms, 1099 forms, unemployment benefit statements, workers' compensation statements, and all other documents evidencing earnings or income as received that provide verification for the financial affidavit. The state court administrator shall prepare a financial affidavit form that may be used by the parties for disclosing information under this section. The parties may provide the information required under this section in a substantially similar affidavit form.\n(b) In addition to the requirements of paragraph (a), at any time after an action seeking child support has been commenced or when a child support order is in effect, a party or the public authority may require the other party to give them a copy of:\n(1) the party's complete federal tax returns for the preceding year that were filed with the Internal Revenue Service; or\n(2) if the party's federal tax returns have not been filed for that year, one or more of the following:\n(i) the party's 1099 form;\n(ii) the party's W-2 form; or\n(iii) the party's K-1 form.\nThe party shall provide a copy of the tax returns or forms within 30 days of receipt of the request unless the request is not made in good faith. A request under this paragraph may not be made more than once every two years, in the absence of good cause.\n(c) If a parent under the jurisdiction of the court does not serve and file the financial affidavit with the parent's initial pleading or motion documents, the court shall set income for that parent based on credible evidence before the court or in accordance with section 518A.32. Credible evidence may include documentation of current or recent income, testimony of the other parent concerning recent earnings and income levels, and the parent's wage reports filed with the Minnesota Department of Employment and Economic Development under section 268.044. The court may consider credible evidence from one party that the financial affidavit submitted by the other party is false or inaccurate.\n(d) If the court determines that a party does not have access to documents that are required to be disclosed under this section, the court may consider the testimony of that party as credible evidence of that party's income.\n(e) If the court finds that a party has violated a court order or statute requiring the party to disclose income or employment information and any changes to that information, the court may issue an order requiring compensation and cost and reasonable attorney fees to the party who was wrongfully deprived of the information, but in no event later than three years from the date the information should have been provided. A party who brings a meritless motion for such relief may be ordered to pay costs and reasonable attorney fees to the other party.",
	"repealed": false
}