{
	"id": "60D.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/60D.55",
	"title": "60D.55 EXEMPTION.",
	"text": "An insurer is exempt from the requirements of sections 60D.50 to 60D.58 if:\n(1) the insurer has annual direct written and unaffiliated assumed premium, including international direct and assumed premium but excluding premiums reinsured with the Federal Crop Insurance Corporation and Federal Flood Program, less than $500,000,000; and\n(2) the insurance group of which the insurer is a member has annual direct written and unaffiliated assumed premium, including international direct and assumed premium but excluding premiums reinsured with the Federal Crop Insurance Corporation and Federal Flood Program, less than $1,000,000,000.\n(a) If an insurer qualifies for exemption pursuant to subdivision 1, clause (1), but the insurance group of which the insurer is a member does not qualify for exemption pursuant to subdivision 1, clause (2), then the ORSA Summary Report that may be required pursuant to section 60D.54 must include every insurer within the insurance group. This requirement may be satisfied by the submission of more than one ORSA Summary Report for any combination of insurers, provided any combination of reports includes every insurer within the insurance group.\n(b) If an insurer does not qualify for exemption pursuant to subdivision 1, clause (1), but the insurance group of which it is a member qualifies for exemption pursuant to subdivision 1, clause (2), then the only ORSA Summary Report that may be required pursuant to section 60D.54 is the report applicable to that insurer.\nAn insurer that does not qualify for exemption pursuant to subdivision 1 may apply to the commissioner for a waiver from the requirements of sections 60D.50 to 60D.58 based on unique circumstances. In deciding whether to grant the insurer's request for waiver, the commissioner may consider the type and volume of business written, ownership and organizational structure, and any other factor the commissioner considers relevant to the insurer or insurance group of which the insurer is a member. If the insurer is part of an insurance group with insurers domiciled in more than one state, the commissioner shall coordinate with the lead state commissioner and with the other domiciliary commissioners in considering whether to grant the insurer's request for a waiver.\nNotwithstanding the exemptions in this section, the commissioner may require that an insurer maintain a risk management framework, conduct an ORSA, and file an ORSA Summary Report:\n(1) based on unique circumstances including, but not limited to, the type and volume of business written, ownership and organizational structure, federal agency requests, and international supervisor requests; and\n(2) if the insurer has risk-based capital for a company action level event as set forth in section 60A.52 or 60A.62, meets one or more of the standards of an insurer deemed to be in a hazardous financial condition pursuant to section 60G.20, or otherwise exhibits qualities of a troubled insurer as determined by the commissioner.\nIf an insurer that qualifies for an exemption pursuant to subdivision 1 subsequently no longer qualifies for that exemption due to changes in premium as reflected in the insurer's most recent annual statement or in the most recent annual statements of the insurers within the insurance group of which the insurer is a member, the insurer has one year following the year the threshold is exceeded to comply with sections 60D.50 to 60D.58.",
	"repealed": false
}