{
	"id": "327C.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.095",
	"title": "327C.095 PARK CLOSINGS.",
	"text": "(a) At least 12 months before the conversion of all or a portion of a manufactured home park to another use, or before closure of a manufactured home park or cessation of use of the land as a manufactured home park, the park owner must prepare a closure statement and provide a copy to the commissioners of health and the housing finance agency, the local planning agency, and a resident of each manufactured home where the residential use is being converted. The closure statement must include the following language in a font no smaller than 14 point: \"YOU MAY BE ENTITLED TO COMPENSATION FROM THE MINNESOTA MANUFACTURED HOME RELOCATION TRUST FUND ADMINISTERED BY THE MINNESOTA HOUSING FINANCE AGENCY.\" A resident may not be required to vacate until 90 days after the conclusion of the public hearing required under subdivision 4. If a lot is available in another section of the park that will continue to be operated as a park, the park owner must allow the resident to relocate the home to that lot unless the home, because of its size or local ordinance, is not compatible with that lot.\n(b) Closure statements issued more than 24 months prior to the park closure must contain a closure date. If the closure does not take place within 24 months and the original statement does not contain a closure date, the statement must be reissued to the commissioners of health and the Housing Finance Agency, the local planning agency, and a resident of each manufactured home where the residential use is being converted.\nIf the planned conversion or cessation of operation requires a variance or zoning change, the local government authority must mail a notice at least ten days before the hearing to a resident of each manufactured home in the park stating the time, place, and purpose of the public hearing. The park owner shall provide the local government authority with a list of the names and addresses of at least one resident of each manufactured home in the park at the time application is made for a variance or zoning change.\nUpon receipt of the closure statement from the park owner, the local planning agency shall submit the closure statement to the governing body of the local government authority and request the governing body to schedule a public hearing. The local government authority must mail a notice at least ten days before the hearing to a resident of each manufactured home in the park stating the time, place, and purpose of the public hearing. The park owner shall provide the local government authority with a list of the names and addresses of at least one resident of each manufactured home in the park at the time the closure statement is submitted to the local planning agency.\n(a) Within 90 days after receiving notice of a closure statement, the governing body of the affected local government authority shall hold a public hearing to review the closure statement and any impact that the park closing may have on the displaced residents and the park owner. At the time of, and in the notice for, the public hearing, displaced residents must be informed that they may be eligible for payments from the Minnesota manufactured home relocation trust fund under section 462A.35 as compensation for reasonable relocation costs under subdivision 13, paragraphs (a) and (e).\n(b) The governing body of the local government authority may also require that other parties, including the local government authority, but excluding the park owner or its purchaser, involved in the park closing provide additional compensation to residents to mitigate the adverse financial impact of the park closing upon the residents.\n(c) At the public hearing, the local government authority shall appoint a qualified neutral third party, to be agreed upon by both the manufactured home park owner and manufactured home owners, whose hourly cost must be reasonable and paid from the Minnesota manufactured home relocation trust fund. The neutral third party shall act as a paymaster and arbitrator, with decision-making authority to resolve any questions or disputes regarding any contributions or disbursements to and from the Minnesota manufactured home relocation trust fund by either the manufactured home park owner or the manufactured home owners. If the parties cannot agree on a neutral third party, the local government authority shall determine who shall act as the neutral third party.\n(d) The qualified neutral third party shall be familiar with manufactured housing and the requirements of this section. The neutral third party shall keep an overall receipts and cost summary together with a detailed accounting, for each manufactured lot, of the payments received by the manufactured home park owner, and expenses approved and payments disbursed to the manufactured home owners, pursuant to subdivisions 12 and 13, as well as a record of all services and hours it provided and at what hourly rate it charged to the Minnesota manufactured home trust fund. This detailed accounting shall be provided to the manufactured home park owner, the municipality, and the Minnesota Housing Finance Agency to be included in its yearly October 15 report as required in subdivision 13, paragraph (h), not later than 30 days after the expiration of the 12-month notice provided in the closure statement.\n(e) At the public hearing, the governing body of the local government authority shall determine if any ordinance was in effect on May 26, 2007, that would provide compensation to displaced residents and provide this information to the third party neutral to determine the applicable amount of compensation under subdivision 13, paragraph (f).\nIf the planned cessation of operation is for the purpose of converting the part of the park occupied by the resident to a common interest community pursuant to chapter 515B, the provisions of section 515B.4-111, except subsection (a), shall apply. The nine-month notice required by this section shall state that the cessation is for the purpose of conversion and shall set forth the rights conferred by this subdivision and section 515B.4-111, subsection (b). Not less than 120 days before the end of the nine months, the park owner shall serve upon the resident a form of purchase agreement setting forth the terms of sale contemplated by section 515B.4-111, subsection (d). Service of that form shall operate as the notice described by section 515B.4-111, subsection (a). This subdivision does not apply to the conversion of a manufactured home park to a common interest community:\n(1) that is a cooperative incorporated under chapter 308A, 308B, or 308C;\n(2) in which at least 90 percent of the cooperative's members are residents of the park at the time of the conversion; and\n(3) that does not require persons who are residents of the park at the time of the conversion to become members of the cooperative.\n[See Note.]\n(a) Before the execution of an agreement to purchase a manufactured home park, the purchaser must notify the park owner, in writing, if the purchaser intends to close the manufactured home park or convert it to another use within one year of the execution of the agreement. If so, the park owner shall provide a resident of each manufactured home with a 45-day written notice of the purchaser's intent to close the park or convert it to another use and may not enter into a purchase agreement for the sale of the park other than with a representative acting on behalf of residents, until the 45 days have expired. The notice must state that the park owner will promptly provide information on the cash price and the terms and conditions of the purchaser's offer to residents requesting the information. The notice must be sent by first class mail to a resident of each manufactured home in the park and made available in alternative formats or translations if requested by a resident and the request is a reasonable accommodation due to a disability of an adult resident or because there is not an adult resident who is able to speak the language the notice is provided in. The notice period begins on the postmark date affixed to the notice and ends 45 days after it begins. During the notice period required in this subdivision, a representative acting on behalf of residents shall have the right to make an offer to meet the cash price and to agree to material terms and conditions set forth in the purchaser's offer and to execute an agreement to purchase the park for the purposes of keeping the park as a manufactured housing community. The park owner must in good faith negotiate a purchase agreement meeting the cash price and the same terms and conditions set forth in the purchaser's offer except that the seller is not obligated to provide owner financing. For purposes of this section, cash price means the cash price offer or equivalent cash offer as defined in section 500.245, subdivision 1, paragraph (d). The purchase agreement must permit the representative a commercially reasonable due diligence period with access by the representative to all information reasonably necessary to make an informed decision regarding the purchase. The representative may be required to enter into a confidentiality agreement regarding the information.\n(b) A representative acting on behalf of residents must provide ten percent of the offer price as earnest money upon gaining the required number of signatures to represent the residents in the purchase of a manufactured home park. The earnest money is refundable after six months; however, the earnest money may become nonrefundable if the representative acting on behalf of residents is unable to complete the purchase, and the original purchaser withdraws the offer during the 45-day period in paragraph (a), and the manufactured home park is sold to another purchaser for a lower price within six months of the notice to residents in paragraph (a), then the park owner will be compensated from the earnest money for the difference between the offer made by the original purchaser and the actual lower purchase price.\n(c) In the event of a sale to a representative acting on behalf of residents, the representative must certify to the commissioner of commerce that the property will be preserved as a manufactured home park for ten years from the date of the sale.\nIf the residents of a manufactured home park have not been provided the written notice of intent to close the park required by subdivision 6, the purchaser may not provide residents with the notice required by subdivision 1 until 12 months after the date of purchase. For purposes of this subdivision, the date of purchase is the date of the transfer of the title to the purchaser.\nMS 2018 [Repealed, 1Sp2019 c 1 art 6 s 61]\nIf a manufactured home park is finally sold or converted to another use in violation of subdivision 6 or 7, the residents have a right to any remedy provided in section 8.31.\nSubdivisions 6 and 7 do not apply to:\n(1) a conveyance of an interest in a manufactured home park incidental to the financing of the manufactured home park;\n(2) a conveyance by a mortgagee subsequent to foreclosure of a mortgage or a deed given in lieu of a foreclosure; or\n(3) a purchase of a manufactured home park by a governmental entity under its power of eminent domain.\nAfter a park is sold, a bona fide purchaser acting in good faith may record an affidavit with the county recorder or registrar of titles in the county in which the park is located certifying compliance with subdivision 6 or that subdivision 6 is not applicable. The affidavit may be used as presumptive evidence of compliance.\n(a) If a manufactured home owner is required to move due to the conversion of all or a portion of a manufactured home park to another use, the closure of a park, or cessation of use of the land as a manufactured home park, the manufactured park owner shall, upon the change in use, pay to the Minnesota Housing Finance Agency for deposit in the Minnesota manufactured home relocation trust fund under section 462A.35, the lesser amount of the actual costs of moving or purchasing the manufactured home approved by the neutral third party and paid by the Minnesota Housing Finance Agency under subdivision 13, paragraph (a) or (e), or $3,250 for each single section manufactured home, and $6,000 for each multisection manufactured home, for which a manufactured home owner has made application for payment of relocation costs under subdivision 13, paragraph (c). The manufactured home park owner shall make payments required under this section to the Minnesota manufactured home relocation trust fund within 60 days of receipt of invoice from the neutral third party.\n(b) A manufactured home park owner is not required to make the payment prescribed under paragraph (a), nor is a manufactured home owner entitled to compensation under subdivision 13, paragraph (a) or (e), if:\n(1) the manufactured home park owner relocates the manufactured home owner to another space in the manufactured home park or to another manufactured home park at the park owner's expense;\n(2) the manufactured home owner is vacating the premises and has informed the manufactured home park owner or manager of this prior to the mailing date of the closure statement under subdivision 1;\n(3) a manufactured home owner has abandoned the manufactured home, or the manufactured home owner is not current on the monthly lot rental, personal property taxes;\n(4) the manufactured home owner has a pending eviction action for nonpayment of lot rental amount under section 327C.09, which was filed against the manufactured home owner prior to the mailing date of the closure statement under subdivision 1, and the writ of recovery has been ordered by the district court;\n(5) the conversion of all or a portion of a manufactured home park to another use, the closure of a park, or cessation of use of the land as a manufactured home park is the result of a taking or exercise of the power of eminent domain by a governmental entity or public utility; or\n(6) the owner of the manufactured home is not a resident of the manufactured home park, as defined in section 327C.015, subdivision 14; the owner of the manufactured home is a resident, but came to reside in the manufactured home park after the mailing date of the closure statement under subdivision 1; or the owner of the manufactured home has not paid the $15 assessment when due under paragraph (c).\n(c) If the unencumbered fund balance in the manufactured home relocation trust fund is less than $2,000,000 as of June 30 of each year, the Minnesota Housing Finance Agency shall assess each manufactured home park owner by mail the total amount of $15 for each licensed lot in their park, payable on or before December 15 of that year. Failure to notify and timely assess the manufactured home park owner by July 31 of any year shall waive the assessment and payment obligations of the manufactured home park owner for that year. Together with said assessment notice, each year the Minnesota Housing Finance Agency shall prepare and distribute to park owners a letter explaining whether funds are being collected for that year, information about the collection, an invoice for all licensed lots, a notice for distribution to the residents, and a sample form for the park owners to collect information on which park residents and lots have been accounted for. In a font no smaller than 14-point, the notice provided by the Minnesota Housing Finance Agency for distribution to residents by the park owner will include the payment deadline of October 31 and the following language: \"THIS IS NOT AN OPTIONAL FEE. IF YOU OWN A MANUFACTURED HOME ON A LOT YOU RENT IN A MANUFACTURED HOME PARK, AND YOU RESIDE IN THAT HOME, YOU MUST PAY WHEN PROVIDED NOTICE.\" If assessed under this paragraph, the park owner may recoup the cost of the $15 assessment as a lump sum or as a monthly fee of no more than $1.25 collected from park residents together with monthly lot rent as provided in section 327C.03, subdivision 6. If, by September 15, a park owner provides the notice to residents for the $15 lump sum, a park owner may adjust payment for lots in their park that are vacant or otherwise not eligible for contribution to the trust fund under section 327C.095, subdivision 12, paragraph (b), and for park residents who have not paid the $15 assessment when due to the park owner by October 31, and deduct from the assessment accordingly. The Minnesota Housing Finance Agency shall deposit any payments in the Minnesota manufactured home relocation trust fund and maintain an annual record for each manufactured home park of the amount received for that park and the number of deductions made for each of the following reasons: vacant lots, ineligible lots, and uncollected fees.\n(d) This subdivision and subdivision 13, paragraph (c), clause (5), are enforceable by the neutral third party, on behalf of the Minnesota Housing Finance Agency, or by action in a court of appropriate jurisdiction. The court may award a prevailing party reasonable attorney fees, court costs, and disbursements.\n(a) If a manufactured home owner is required to relocate due to the conversion of all or a portion of a manufactured home park to another use, the closure of a manufactured home park, or cessation of use of the land as a manufactured home park under subdivision 1, and the manufactured home owner complies with the requirements of this section, the manufactured home owner is entitled to payment from the Minnesota manufactured home relocation trust fund equal to the manufactured home owner's actual relocation costs for relocating the manufactured home to a new location within a 50-mile radius of the park that is being closed, up to a maximum of $7,000 for a single-section and $12,500 for a multisection manufactured home. The actual relocation costs must include the reasonable cost of taking down, moving, and setting up the manufactured home, including equipment rental, utility connection and disconnection charges, minor repairs, modifications necessary for transportation of the home, necessary moving permits and insurance, moving costs for any appurtenances, which meet applicable local, state, and federal building and construction codes.\n(b) A manufactured home owner is not entitled to compensation under paragraph (a) if the manufactured home park owner is not required to make a payment to the Minnesota manufactured home relocation trust fund under subdivision 12, paragraph (b).\n(c) Except as provided in paragraph (e), in order to obtain payment from the Minnesota manufactured home relocation trust fund, the manufactured home owner shall submit to the neutral third party and the Minnesota Housing Finance Agency, with a copy to the park owner, an application for payment, which includes:\n(1) a copy of the closure statement under subdivision 1;\n(2) a copy of the contract with a moving or towing contractor, which includes the relocation costs for relocating the manufactured home;\n(3) a statement with supporting materials of any additional relocation costs as outlined in subdivision 1;\n(4) a statement certifying that none of the exceptions to receipt of compensation under subdivision 12, paragraph (b), apply to the manufactured home owner;\n(5) a statement from the manufactured park owner that the lot rental is current and that the annual $15 payment to the Minnesota manufactured home relocation trust fund has been paid when due; and\n(6) a statement from the county where the manufactured home is located certifying that personal property taxes for the manufactured home are paid through the end of that year.\n(d) The neutral third party shall promptly process all payments for completed applications within 14 days. If the neutral third party has acted reasonably and does not approve or deny payment within 45 days after receipt of the information set forth in paragraph (c), the payment is deemed approved. Upon approval and request by the neutral third party, the Minnesota Housing Finance Agency shall issue two checks in equal amount for 50 percent of the contract price payable to the mover and towing contractor for relocating the manufactured home in the amount of the actual relocation cost, plus a check to the home owner for additional certified costs associated with third-party vendors, that were necessary in relocating the manufactured home. The moving or towing contractor shall receive 50 percent upon execution of the contract and 50 percent upon completion of the relocation and approval by the manufactured home owner. The moving or towing contractor may not apply the funds to any other purpose other than relocation of the manufactured home as provided in the contract. A copy of the approval must be forwarded by the neutral third party to the park owner with an invoice for payment of the amount specified in subdivision 12, paragraph (a).\n(e) In lieu of collecting a relocation payment from the Minnesota manufactured home relocation trust fund under paragraph (a), the manufactured home owner may collect an amount from the fund after reasonable efforts to relocate the manufactured home have failed due to the age or condition of the manufactured home, or because there are no manufactured home parks willing or able to accept the manufactured home within a 25-mile radius. A manufactured home owner may tender title of the manufactured home in the manufactured home park to the manufactured home park owner, and collect an amount to be determined by an independent appraisal. The appraiser must be agreed to by both the manufactured home park owner and the manufactured home owner. If the appraised market value cannot be determined, the tax market value, averaged over a period of five years, can be used as a substitute. The maximum amount that may be reimbursed under the fund is $8,000 for a single-section and $14,500 for a multisection manufactured home. The minimum amount that may be reimbursed under the fund is $2,000 for a single section and $4,000 for a multisection manufactured home. The manufactured home owner shall deliver to the manufactured home park owner the current certificate of title to the manufactured home duly endorsed by the owner of record, and valid releases of all liens shown on the certificate of title, and a statement from the county where the manufactured home is located evidencing that the personal property taxes have been paid. The manufactured home owner's application for funds under this paragraph must include a document certifying that the manufactured home cannot be relocated, that the lot rental is current, that the annual $15 payments to the Minnesota manufactured home relocation trust fund have been paid when due, that the manufactured home owner has chosen to tender title under this section, and that the park owner agrees to make a payment to the Minnesota Housing Finance Agency in the amount established in subdivision 12, paragraph (a), less any documented costs submitted to the neutral third party, required for demolition and removal of the home, and any debris or refuse left on the lot, not to exceed $1,500. The manufactured home owner must also provide a copy of the certificate of title endorsed by the owner of record, and certify to the neutral third party, with a copy to the park owner, that none of the exceptions to receipt of compensation under subdivision 12, paragraph (b), clauses (1) to (6), apply to the manufactured home owner, and that the home owner will vacate the home within 60 days after receipt of payment or the date of park closure, whichever is earlier, provided that the monthly lot rent is kept current.\n(f) Notwithstanding paragraph (a), the manufactured home owner's compensation for relocation costs from the fund under section 462A.35, is the greater of the amount provided under this subdivision, or the amount under the local ordinance in effect on May 26, 2007, that is applicable to the manufactured home owner. Nothing in this paragraph is intended to increase the liability of the park owner.\n(g) Neither the neutral third party nor the Minnesota Housing Finance Agency shall be liable to any person for recovery if the funds in the Minnesota manufactured home relocation trust fund are insufficient to pay the amounts claimed. The Minnesota Housing Finance Agency shall keep a record of the time and date of its approval of payment to a claimant.\n(h)(1) By October 15, 2019, the Minnesota Housing Finance Agency shall post on its website and report to the chairs of the senate Finance Committee and house of representatives Ways and Means Committee on the Minnesota manufactured home relocation trust fund, including the account balance, payments to claimants, the amount of any advances to the fund, the amount of any insufficiencies encountered during the previous calendar year, and any itemized administrative charges or expenses deducted from the trust fund balance. If sufficient funds become available, the Minnesota Housing Finance Agency shall pay the manufactured home owner whose unpaid claim is the earliest by time and date of approval.\n(2) Beginning in 2019, the Minnesota Housing Finance Agency shall post on its website and report to the chairs of the senate Finance Committee and house of representatives Ways and Means Committee by October 15 of each year on the Minnesota manufactured home relocation trust fund, including the aggregate account balance, the aggregate assessment payments received, summary information regarding each closed park including the total payments to claimants and payments received from each closed park, the amount of any advances to the fund, the amount of any insufficiencies encountered during the previous fiscal year, reports of neutral third parties provided pursuant to subdivision 4, and any itemized administrative charges or expenses deducted from the trust fund balance, all of which should be reconciled to the previous year's trust fund balance. If sufficient funds become available, the Minnesota Housing Finance Agency shall pay the manufactured home owner whose unpaid claim is the earliest by time and date of approval.\nThe total contribution to the fund under section 462A.35 paid by the park owner under subdivision 12, paragraph (a), must not exceed 20 percent of the sale price, or if no sale price is available, the assessed value of the manufactured home park, except that if the sale price, or, if there is no sale price, the assessed value, is:\n(1) less than $100,000, the manufactured home park owner's contribution to the fund must not exceed five percent of the sale price of the manufactured home park;\n(2) less than $200,000, the owner's contribution to the fund must not exceed eight percent of the sale price of the manufactured home park;\n(3) less than $300,000, the owner's contribution to the fund must not exceed ten percent of the sale price of the manufactured home park; and\n(4) less than $500,000, the owner's contribution to the fund must not exceed 15 percent of the sale price of the manufactured home park.\nSections 327C.095, subdivisions 1, 4, and 12 to 16; 462A.21, subdivision 31; and 462A.35 preempt and supersede a township, county, or statutory or home rule charter city ordinance relating to the relocation or buyout payments paid due to a change of use or closure of manufactured home communities. A township, county, or statutory or home rule charter city must not adopt an ordinance requiring more compensation by the manufactured home park owners or its purchaser than what is provided for in this statute.\nThe Department of Health or, if applicable, local units of government that have entered into a delegation of authority agreement with the Department of Health as provided in section 145A.07 shall provide, by March 31 of each year, a list of names and addresses of the manufactured home parks licensed in the previous year, and for each manufactured home park, the current licensed owner, the owner's address, the number of licensed manufactured home lots, and other data as they may request for the Minnesota Housing Finance Agency to invoice each licensed manufactured home park in Minnesota.",
	"repealed": false
}