{
	"id": "115B.177",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.177",
	"title": "115B.177 OWNER OF REAL PROPERTY AFFECTED BY OFF-SITE RELEASE.",
	"text": "(a) The commissioner may issue a written determination or enter into an agreement to take no action under sections 115B.01 to 115B.18 against a person who owns real property subject to a release of a hazardous substance, or pollutant or contaminant, if the commissioner finds that the release originates from a source on adjacent or nearby real property and that the person is not otherwise responsible for the release.\n(b) A determination issued or agreement entered into under this section must be conditioned upon the following:\n(1) agreement by the person to allow entry upon the property to the commissioner and the authorized representatives of the commissioner to take response actions to address the release, including in appropriate cases an agreement to grant easements to the state for that purpose;\n(2) agreement by the person to avoid any interference with the response actions to address the release taken by or at the direction of the agency or the commissioner, and to avoid actions that contribute to the release;\n(3) invalidation of the determination or agreement if the commissioner receives new information indicating that the property owned by the person is a source of the release or that the person is otherwise responsible for the release; and\n(4) any other condition that the commissioner deems reasonable and necessary to ensure that the agency and commissioner can adequately respond to the release.\n(a) A determination issued or agreement entered into under this section may extend to the successors and assigns of the person to whom it originally applies, if the successors and assigns are not otherwise responsible for the release and are bound by the conditions in the determination or agreement.\n(b) Issuance of a determination or execution of an agreement under this section does not affect the authority of the agency or commissioner to take any response action under sections 115B.01 to 115B.18 with respect to the release subject to the determination or agreement, or to take administrative or judicial action under those sections with respect to persons not bound by the determination or agreement.",
	"repealed": false
}