{
	"id": "473.195",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.195",
	"title": "473.195 HOUSING AND REDEVELOPMENT AUTHORITY POWERS.",
	"text": "In addition to, and not in limitation of, all other powers invested in it by law, the council, and the members thereof, shall have, throughout the metropolitan area, the same functions, rights, powers, duties, privileges, immunities and limitations as are provided for housing and redevelopment authorities created for municipalities, and for the commissioners of such authorities. The provisions of sections 469.001 to 469.047 and of all other laws relating to housing and redevelopment authorities shall be applicable to the council when functioning as an authority, except as herein provided or as clearly indicated otherwise from the context of such laws. Section 469.003 shall have no application to the council nor to any municipality or county within which the council undertakes a project. Any municipality or county, and the governing bodies of any municipality or county, within and for which the council undertakes a project shall have all the powers, authority and obligations granted to municipalities and counties by the provisions of sections 469.001 to 469.047 and all other laws relating to housing and redevelopment authorities. The council may plan and propose projects within the boundaries of any municipality, and may otherwise exercise the powers of an authority at any time; provided, however, that the council shall not implement any housing project, housing development project, redevelopment project or urban renewal project within the boundaries of any municipality or county without the prior approval of the governing body of the municipality or county in which any such project is to be located; and provided further that the council shall not propose any project to the governing body of a municipality or county having an active authority created pursuant to section 469.003, or pursuant to special legislation, without first submitting the proposed project to the municipal or county authority for its review and recommendations; and provided further that as to any project proposed by the council and approved by the municipality or county, the council shall not undertake the project if within 60 days after it has been proposed, the municipality or county agrees to undertake the project. Notwithstanding section 469.012, subdivision 3, the council may plan and administer a Section 8 program in the metropolitan area without the approval of the governing body of the local governmental unit or housing and redevelopment authority in whose jurisdiction the program is operated. The council shall not operate a Section 8 program in the jurisdiction of a local governmental unit or housing and redevelopment authority in the metropolitan area which was operating its own Section 8 program under a separate annual contributions contract with the Department of Housing and Urban Development on January 1, 1990, provided that the council may operate or administer a Section 8 program within such jurisdictions under the provisions of section 471.59, or any other appropriate law providing for joint or cooperative action between governmental units. For purposes of this subdivision, \"Section 8 program\" has the meaning given it in section 469.002, subdivision 24. For the purposes of this subdivision, \"annual contributions contract\" has the meaning given it in United States Code, title 42, section 1437f, and implementing federal regulations. All plans and projects of the council shall be consistent with the comprehensive development guide.\nThe council may provide technical assistance to existing municipal or county housing and redevelopment authorities at the request of such authorities.\nThe council may cooperate with or act as agent for the federal government, the state government, or any agencies or instrumentalities thereof, in carrying out the provisions of any federal or state legislation relating to the general purposes of the Municipal Housing and Redevelopment Act.\nThe council shall, as part of any project proposal to a municipality, propose a means for citizens substantially affected by the proposed project to participate in the formulation and carrying out of projects undertaken by the council pursuant to the terms of sections 473.194 to 473.201.\n(a) For the purposes of exercising the authority granted to it under this section, the council may, at its sole discretion, establish within the council's existing organizational structure a separate governing body to which the council may delegate any or all of the authority granted to the council under this section.\n(b) The resolution establishing the separate governing body must:\n(1) set out the powers and duties delegated to the separate governing body;\n(2) prescribe the number, qualifications, and terms of its members; and\n(3) provide for any other terms and conditions that are deemed appropriate by the council.\n(c) The council shall appoint the members of the separate governing body in accordance with a process established by the council. No fewer than 75 percent of the members of the separate governing body must be council members.\n(d) For purposes of compliance with United States Code, title 42, section 1437(b), and implementing federal regulations, at least one member of the separate governing body members must be a resident directly assisted by the council.\n(e) Members are entitled to reimbursement for all actual and necessary expenses incurred in the performance of governing body business, and a member other than a council member is entitled to payment of $50 for each day the member attends one or more meetings of the separate governing body or performs other services authorized by the body.\n(f) The council shall provide administrative and staff support to the separate governing body.\n(g) The council may, at its sole discretion, abolish the separate governing body or limit or expand its delegated authority.\nNothing in this section impairs existing contracts to which the council is a party or limits the council's ability to enter into contracts when the council exercises any of the functions, rights, powers, duties, privileges, immunities, and limitations granted to the council by this section.",
	"repealed": false
}