{
	"id": "393.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/393.08",
	"title": "393.08 ESTIMATES TO COUNTY BOARD; REQUIREMENTS.",
	"text": "As scheduled by the county board of commissioners each year, the local social services agency, except any such board referred to in section 393.01, subdivision 3, shall submit to the county board of commissioners an estimate of the amount needed by it to perform its duties, including expenses of administration, and the county board of commissioners shall consider the estimates so submitted and, if approved, shall levy a tax as provided by law for the purposes. In the event the estimate is not approved, the county board of commissioners shall confer with the local social services agency and adjust a budget in accordance with the facts and levy a tax for the amount required.\nIn counties referred to in section 393.01, subdivision 3, the estimate required shall not include institutional requirements in any city of the first class located therein. The tax levy by the county board of commissioners in such counties shall be such as is required for public assistance, poor relief and categories of aid under the federal Social Security Act, and shall be separate and distinct from other levies made by it. The governing body of any such city of the first class may annually levy a tax for institutional requirements as authorized by such home rule charter, on the real and personal property within the corporate limits of such city. Such tax levy and the proceeds thereof shall be subject to the same control and supervision as is imposed on any existing public welfare tax levy.\nIn counties referred to in section 393.01, subdivision 7, the estimate required to fund the public welfare programs of the single local social services agency, including expense of administration, shall be submitted to the boards of county commissioners who are parties to the agreement. Each board of county commissioners shall consider the estimate so submitted and shall confer with the board of county commissioners from the other counties who are a party to the agreement in determining the amount of funds to be assessed against each county for purposes of funding the welfare program.\nThis section does not apply to Ramsey County.\nMS 1971 [Repealed, 1973 c 380 s 18; 1973 c 650 art 21 s 33]",
	"repealed": false
}