{
	"id": "354C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/354C.12",
	"title": "354C.12 SALARY DEDUCTIONS AND MATCHING EMPLOYER CONTRIBUTIONS.",
	"text": "(a) The employer of personnel covered by the supplemental retirement plan as provided in section 354C.11 shall deduct a sum equal to five percent of the annual salary of the person between $6,000 and $15,000. The employer may accomplish this deduction by making equal deductions each payroll period, based on anticipated annual salary. The employer may adjust these deductions as necessary to deduct the correct amount annually. Deductions cease upon termination of employment covered by the supplemental retirement plan.\n(b) The basic contribution deduction must be made in the same manner as other retirement deductions are made from the salary of the person under section 352.04, subdivision 4; 352D.04, subdivision 2; 354.42, subdivision 2; or 354A.12, whichever applies.\n(c) The employer shall also make a contribution to the supplemental retirement plan on behalf of covered personnel equal to the salary deduction made under paragraph (a).\nWhen contributions to the plan exceed limits imposed by federal law or regulation, the excess employee contributions must be returned to the employee and the excess employer contributions must be reallocated in accordance with section 415 of the federal Internal Revenue Code, as amended, and the applicable federal regulations and revenue rulings.\nIf the employer of personnel covered by the supplemental retirement plan as provided in section 354C.11 fails to deduct the member basic contribution from the covered employee's salary and a period of less than 60 days from the date on which the deduction should have been made has elapsed, the employer must obtain the omitted member deduction by an additional payroll deduction during the pay period next following the discovery of the omission. If the employer fails to deduct the member basic contribution from the covered employee's salary and that omission continues for at least 60 days from the date on which the member basic contribution deduction should have been made, the employer must pay the amount representing the omitted member basic contribution, and the full required omitted employer basic contribution, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 4, compounded annually. The contributions must be made within one year of the date on which the omission was discovered.\nIf an agreement is made under section 356.24 for an additional employee deduction and an additional matching employer contribution, an amount equal to the additional employee contribution must be deducted from the employee's salary above $15,000. The employer must match the additional employee contribution deduction.\n(a) The Board of Trustees of the Minnesota State Colleges and Universities is authorized to pay the necessary and reasonable administrative expenses of the supplemental retirement plan and may bill participants to recover these expenses. The administrative fees or charges may be charged to participants as an annual fee, an asset-based fee, a percentage of contributions to the plan, or a contribution thereof. This amount shall be offset by interest earned on both the plan reserves and unclaimed funds account.\n(b) Any recovered or assessed amounts that are not needed for the necessary and reasonable administrative expenses of the plan must be refunded to member accounts.\n(c) The Board of Trustees shall report annually, before October 1, to the legislature on administrative expenses of the plan. The report must include a detailed accounting of charges for administrative expenses collected from plan participants and expenditure of the administrative expense charges. The administrative expense charges collected from plan participants must be kept in a separate account from any other funds under control of the Board of Trustees and may be used only for the necessary and reasonable administrative expenses of the plan.",
	"repealed": false
}