{
	"id": "277.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/277.20",
	"title": "277.20 LIEN FOR PERSONAL PROPERTY TAX.",
	"text": "Except for property exempt under subdivision 3, the tax assessed on personal property or manufactured homes and collectible under this chapter is a lien on all the real and personal property within this state of the person liable for the payment of the tax. The lien arises on January 2 of the year in which the tax is assessed and continues until the tax is paid. For purposes of this section and section 277.21, \"tax\" also includes penalty, interest, recording fees, sheriff fees, and court costs that may accrue on the unpaid tax.\nThe lien imposed by subdivision 1 is not enforceable against any purchaser, mortgagee, pledgee, holder of a Uniform Commercial Code security interest, mechanic's lienor, or judgment lien creditor until a notice of lien has been filed by the county treasurer in the office of the county recorder of the county in which the property is situated, or, in the case of personal property, in the office of the secretary of state. Priority of a lien created under Laws 1991, chapter 291, article 15, shall be determined in accordance with the provisions of section 507.34. Liens filed in the office of the county recorder shall be filed with the state tax liens filed pursuant to section 270C.63, and the index shall indicate the name of the county for which the lien was filed. If the land is registered, the notice of lien shall be filed in the office of the registrar of titles of the county in which the property is registered. Notwithstanding any other law to the contrary, the county treasurer is exempt from the payment of fees when the lien is offered for filing or recording; the fee for filing or recording the lien must be paid at the time the release of lien is offered for filing or recording. Notwithstanding any law to the contrary, the fee for filing or recording the lien or the release of lien is $15.\nThe lien imposed on personal property by this section, even though properly filed, is not enforceable against the personal property listed as exempt in sections 550.37, 550.38, and 550.39, but manufactured homes otherwise exempt under section 550.37, subdivision 12, are subject to lien under this section.\nNotwithstanding any other law to the contrary, the lien imposed by this section is enforceable from the time the lien arises and for ten years from the date of filing the notice of lien. The notice of lien must be filed by the county treasurer within five years after the date of assessment of the tax. A notice of lien filed in one county may be transcribed to any other county within ten years after the date of its filing, but the transcription does not extend the period during which the lien is enforceable. A notice of lien may be renewed by the county treasurer before the expiration of the ten-year period for an additional ten years. The taxpayer must receive written notice of the renewal.\nThe lien imposed by this section is enforceable by levy as authorized in section 277.21, or by judgment lien foreclosure as authorized in chapter 550.\nIf a lien has been filed by the county treasurer against real property under this section, and, after the recording of the lien, a mortgage foreclosure upon the real property is commenced under chapter 580, or a termination of contract of sale of the real property is commenced under section 559.21, notice of the mortgage foreclosure or termination of contract of sale must be mailed to the county treasurer at least 25 days before the foreclosure, sale, or date of termination. Notice need not be given under this subdivision if the lien has been filed within 30 days or less before the foreclosure, sale, or date of termination. The notice must contain the following information:\n(1) the name and address of the taxpayer;\n(2) a copy of the notice of mortgage foreclosure or contract for deed cancellation;\n(3) a copy of the lien filed by the county treasurer;\n(4) the total unpaid balance of the mortgage or contract for deed; and\n(5) a legal description of the property.\nUpon a request of a party providing notice under this subdivision, the county treasurer shall send to the party within one business day of receiving the notice a receipt for the notice.\nExecution of notices of liens or of other notices affecting personal property tax liens by the county treasurer or a delegate entitles them to be filed, and no other attestation, certification, or acknowledgment is necessary.\nUpon request of a person, the filing officer shall issue a certificate showing whether there is on file, on the date and hour stated in the certificate, any notice of lien or certificate or notice affecting any lien filed after December 31, 1991, naming a particular person, and giving the date and hour of filing of each notice or certificate naming the person. The fee for a certificate is as provided by section 336.9-525 or 357.18, subdivision 1, clause (3). Upon request, the filing officer shall furnish a copy of any notice of lien, or notice or certificate affecting a lien, for a fee of $1 per page.",
	"repealed": false
}