{
	"id": "319B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.11",
	"title": "319B.11 PROFESSIONAL REGULATION.",
	"text": "Each board may make whatever rules are necessary to carry out sections 319B.01 to 319B.12. Except as stated in this section, nothing in sections 319B.01 to 319B.12 restricts or limits in any manner the authority or duty of a board with respect to persons furnishing professional services within the jurisdiction of the board, even if the person is an owner, director, governor, officer, manager, employee, agent, or independent contractor of a professional firm and furnishes professional services through that firm.\n(a) Except as stated in paragraph (b), no board may directly or indirectly require a person providing professional services through a professional firm to assume greater liability for the firm's debts and obligations than is contemplated by section 319B.06, subdivision 3.\n(b) Paragraph (a) does not prevent the board from requiring a professional to assume personal liability for specified obligations or categories of obligations as a term or requirement of board disciplinary or corrective action concerning the professional.\n(a) No professional firm may furnish professional services within Minnesota until the firm files with each board having jurisdiction over the pertinent professional services:\n(1) a copy of the firm's organizational document, certificate of authority, or statement of foreign qualification;\n(2) a report containing the same information as required by subdivision 4; and\n(3) except as stated in paragraph (b), a fee of $100.\n(b) If a firm has previously been organized under sections 319A.01 to 319A.22, that firm is not required to pay the filing fee under paragraph (a).\n(a) Every professional firm must file annually on or before January 1 with the board or boards having jurisdiction over the pertinent professional services a report containing the following:\n(1) the name and address of the professional firm;\n(2) the contents of any amendment made to the firm's organizational document, certificate of authority, or statement of foreign qualification since the filing of the most recent report under subdivision 3 or this subdivision;\n(3) a designation of the position or positions within the firm that have governance authority;\n(4) the name and address of each owner of an ownership interest and each person occupying a position with governance authority;\n(5) a statement as to whether all employees, agents, and independent contractors furnishing professional services within Minnesota on behalf of the professional firm are professionals authorized to furnish at least one category of the pertinent professional services;\n(6) except in the case of a professional firm that is organized under chapter 317A or the nonprofit corporation statute of another state, a statement as to whether all owners and persons occupying a position with governance authority are professionals authorized to furnish at least one category of the pertinent professional services;\n(7) in the case of a professional firm that is organized under chapter 317A or the nonprofit corporation statute of another state, a statement as to whether at least one person occupying a position with governance authority is a professional authorized to furnish at least one category of the pertinent professional services; and\n(8) any additional information as the board may by rule prescribe as appropriate to assist in determining whether a professional firm is complying with sections 319B.01 to 319B.12.\nThe statement required by clauses (5), (6), and (7) must be made and signed under oath by a professional who is an owner or employee of the professional firm, licensed in at least one category of the pertinent professional services and duly authorized to make the statement on behalf of the professional firm.\n(b) For filing each annual report under paragraph (a), each firm must pay a fee of $25 to each board with which the report is filed.\n(a) Except as stated in paragraph (b), within 30 days after the death or disqualification of an owner, the professional firm must report the death or disqualification to each board having jurisdiction over any of the pertinent professional services.\n(b) A professional firm need not report a disqualification to a board which took the action that caused the disqualification.\n(a) A board, or an employee or agent designated by a board, may inspect at all reasonable times all books and records of a professional firm and may summon and examine under oath the owners, directors, governors, officers, managers, persons occupying a position with governance authority, and employees of the firm in all matters concerning the operations of the professional firm that are governed by sections 319B.01 to 319B.12, the rules of the board, or the professional firm's generally applicable governing law. This subdivision does not authorize anyone to have access to or to compel anyone to testify with respect to books, records, or information of any type subject to a privilege recognized by law.\n(b) Any information obtained by a board as a result of an examination authorized by paragraph (a) is confidential, immune from subpoena, and inadmissible as evidence at a trial, hearing, or proceeding before a court, board, or commissioner except a proceeding under subdivision 8.\n(c) A professional firm subject to an examination under paragraph (a) may request in writing that the board under whose authority the examination is being or has been conducted provide the professional firm with a copy of all or any specified parts of the sworn testimony taken or received during the examination as well as all or any specified exhibits provided as part of that testimony. The board must comply promptly with the request and may charge the requesting firm the reasonable cost of making and providing the copies.\nExcept as stated in subdivision 6, information filed by a professional firm under this section is public data under chapter 13.\nA board, through the attorney general, may institute proceedings in a district court of this state or a contested case proceeding under chapter 14 to involuntarily rescind a professional firm's election under section 319B.03, subdivision 2, or 319B.04, subdivision 2, to impose restrictions or conditions on that election or to reprimand the professional firm due to a violation of sections 319B.01 to 319B.12, the relevant licensing statute as listed in section 319B.02, subdivision 19, or the rules of the board. A board, through the attorney general, may institute proceedings in a district court of this state to have a Minnesota professional firm involuntarily dissolved, or a foreign professional firm's certificate of authority or statement of foreign qualification revoked on those grounds, as well as on any other grounds provided by Minnesota law. A board may seek reprimands, restrictions, conditions, involuntary rescission, and, as appropriate, dissolution or revocation within a single proceeding in a district court of this state. After a court enters a decree imposing rescission, dissolution, or revocation upon a professional firm, a board shall cause a certified copy of the decree to be filed with the secretary of state. The secretary of state shall not charge a fee for filing the decree. A board's claim against a professional firm for involuntary dissolution or revocation does not abate simply because the professional firm has rescinded its election under section 319B.03, subdivision 2, or 319B.04, subdivision 2. A voluntary rescission does abate a board's claim to obtain reprimands, restrictions, conditions, or involuntary rescission.\nAll fees paid under this section are for the board to which they are due.",
	"repealed": false
}