{
	"id": "268.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.095",
	"title": "268.095 INELIGIBILITY BECAUSE OF QUIT OR DISCHARGE.",
	"text": "An applicant who quit employment is ineligible for all unemployment benefits according to subdivision 10 except when:\n(1) the applicant quit the employment because of a good reason caused by the employer as defined in subdivision 3;\n(2) the applicant quit the employment to accept other covered employment that provided equal to or better terms and conditions of employment, but the applicant did not work long enough at the second employment to have sufficient subsequent wages paid to satisfy the period of ineligibility that would otherwise be imposed under subdivision 10 for quitting the first employment;\n(3) the applicant quit the employment within 30 calendar days of beginning the employment and the employment was unsuitable;\n(4) the employment was unsuitable and the applicant quit to enter reemployment assistance training;\n(5) the employment was part time and the applicant also had full-time employment in the base period, from which full-time employment the applicant separated because of reasons for which the applicant would not be ineligible, and the wage credits from the full-time employment are sufficient to meet the minimum requirements to establish a benefit account under section 268.07;\n(6) the applicant quit because the employer notified the applicant that the applicant was going to be laid off because of lack of work within 30 calendar days. An applicant who quit employment within 30 calendar days of a notified date of layoff because of lack of work is ineligible for unemployment benefits through the end of the week that includes the scheduled date of layoff;\n(7) the applicant quit the employment (i) because the applicant's serious illness or injury made it medically necessary that the applicant quit; or (ii) in order to provide necessary care because of the illness, injury, or disability of an immediate family member of the applicant. This exception only applies if the applicant informs the employer of the medical problem and requests accommodation and no reasonable accommodation is made available.\nIf the applicant's serious illness is substance use disorder, this exception does not apply if the applicant was previously diagnosed with substance use disorder or had treatment for substance use disorder, and since that diagnosis or treatment has failed to make consistent efforts to control the substance use disorder.\nThis exception raises an issue of the applicant's being available for suitable employment under section 268.085, subdivision 1, that the commissioner must determine;\n(8) the applicant's loss of child care for the applicant's minor child caused the applicant to quit the employment, provided the applicant made reasonable effort to obtain other child care and requested time off or other accommodation from the employer and no reasonable accommodation is available.\nThis exception raises an issue of the applicant's being available for suitable employment under section 268.085, subdivision 1, that the commissioner must determine;\n(9) the applicant quit because domestic abuse, sexual assault, or harassment or stalking of the applicant or an immediate family member of the applicant, necessitated the applicant's quitting the employment.\nFor purposes of this subdivision:\n(i) \"domestic abuse\" has the meaning given in section 518B.01;\n(ii) \"sexual assault\" means an act that would constitute a violation of sections 609.342 to 609.3453 or 609.352; and\n(iii) \"harassment\" or \"stalking\" means an act that would constitute a violation of section 609.749; or\n(10) the applicant quit in order to relocate to accompany a spouse:\n(i) who is in the military; or\n(ii) whose job was transferred by the spouse's employer to a new location making it impractical for the applicant to commute.\n(a) A quit from employment occurs when the decision to end the employment was, at the time the employment ended, the employee's.\n(b) When determining if an applicant quit, the theory of a constructive quit does not apply.\n(c) An employee who has been notified that the employee will be discharged in the future, who chooses to end the employment while employment in any capacity is still available, has quit the employment.\n(d) A notice of quitting in the future does not constitute a quit at the time the notice is given. An employee who seeks to withdraw a previously submitted notice of quitting in the future has quit the employment, as of the intended date of quitting, if the employer does not agree that the notice may be withdrawn.\n(e) An applicant has quit employment with a staffing service if, within five calendar days after completion of a suitable job assignment from a staffing service, the applicant:\n(1) fails without good cause to affirmatively request an additional suitable job assignment;\n(2) refuses without good cause an additional suitable job assignment offered; or\n(3) accepts employment with the client of the staffing service. Accepting employment with the client of the staffing service meets the requirements of the exception to ineligibility under subdivision 1, clause (2).\nThis paragraph applies only if, at the time of beginning of employment with the staffing service, the applicant signed and was provided a copy of a separate document written in clear and concise language that informed the applicant of this paragraph and that unemployment benefits may be affected.\nFor purposes of this paragraph, \"good cause\" is a reason that would compel an average, reasonable worker, who would otherwise want an additional suitable job assignment with the staffing service (1) to fail to contact the staffing service, or (2) to refuse an offered assignment.\n(a) A good reason caused by the employer for quitting is a reason:\n(1) that is directly related to the employment and for which the employer is responsible;\n(2) that is adverse to the worker; and\n(3) that would compel an average, reasonable worker to quit and become unemployed rather than remaining in the employment.\n(b) The analysis required in paragraph (a) must be applied to the specific facts of each case.\n(c) If an applicant was subjected to adverse working conditions by the employer, the applicant must complain to the employer and give the employer a reasonable opportunity to correct the adverse working conditions before that may be a good reason caused by the employer for quitting.\n(d) A reason for quitting employment is not a good reason caused by the employer for quitting if the reason for quitting occurred because of the applicant's employment misconduct.\n(e) Notification of discharge in the future, including a layoff because of lack of work, is not a good reason caused by the employer for quitting.\n(f) An applicant has a good reason caused by the employer for quitting if it results from sexual harassment of which the employer was aware, or should have been aware, and the employer failed to take timely and appropriate action. Sexual harassment means unwelcome sexual advances, requests for sexual favors, sexually motivated physical contact or other conduct or communication of a sexual nature when:\n(1) the applicant's submission to the conduct or communication is made a term or condition of the employment;\n(2) the applicant's submission to or rejection of the conduct or communication is the basis for decisions affecting employment; or\n(3) the conduct or communication has the purpose or effect of substantially interfering with an applicant's work performance or creating an intimidating, hostile, or offensive working environment.\n(g) The definition of a good reason caused by the employer for quitting employment provided by this subdivision is exclusive and no other definition applies.\nAn applicant who was discharged from employment by an employer is ineligible for all unemployment benefits according to subdivision 10 only if:\n(1) the applicant was discharged because of employment misconduct as defined in subdivision 6; or\n(2) the applicant was discharged because of aggravated employment misconduct as defined in subdivision 6a.\n[Renumbered subd 6a]\n(a) A discharge from employment occurs when any words or actions by an employer would lead a reasonable employee to believe that the employer will no longer allow the employee to work for the employer in any capacity. A layoff because of lack of work is a discharge.\n(b) A suspension from employment without pay that is of an indefinite duration or is for more than 30 calendar days is considered a discharge at the time the suspension begins.\n(c) When determining if an applicant was discharged, the theory of a constructive discharge does not apply.\n(d) An employee who gives notice of intention to quit the employment and is not allowed by the employer to work the entire notice period is discharged from the employment as of the date the employer will no longer allow the employee to work. If the discharge occurs within 30 calendar days before the intended date of quitting, then, as of the intended date of quitting, the separation from employment is a quit from employment subject to subdivision 1.\n(e) The end of a job assignment with the client of a staffing service is a discharge from employment with the staffing service unless subdivision 2, paragraph (e), applies.\n(a) Employment misconduct means any intentional, negligent, or indifferent conduct, on the job or off the job, that is a serious violation of the standards of behavior the employer has the right to reasonably expect of the employee.\n(b) Regardless of paragraph (a), the following is not employment misconduct:\n(1) conduct that was a consequence of the applicant's mental illness or impairment;\n(2) conduct that was a consequence of the applicant's inefficiency or inadvertence;\n(3) simple unsatisfactory conduct;\n(4) conduct an average reasonable employee would have engaged in under the circumstances;\n(5) conduct that was a consequence of the applicant's inability or incapacity;\n(6) good faith errors in judgment if judgment was required;\n(7) absence because of illness or injury of the applicant, with proper notice to the employer;\n(8) absence, with proper notice to the employer, in order to provide necessary care because of the illness, injury, or disability of an immediate family member of the applicant;\n(9) conduct that was a consequence of the applicant's substance use disorder, unless the applicant was previously diagnosed with substance use disorder or had treatment for substance use disorder, and since that diagnosis or treatment has failed to make consistent efforts to control the substance use disorder; or\n(10) conduct that was a consequence of the applicant, or an immediate family member of the applicant, being a victim of domestic abuse, sexual assault, or harassment or stalking. For the purposes of this subdivision, \"domestic abuse,\" \"sexual assault,\" and \"harassment\" or \"stalking\" have the meanings given them in subdivision 1.\n(c) Regardless of paragraph (b), clause (9), conduct in violation of sections 169A.20, 169A.31, 169A.50 to 169A.53, or 171.177 that adversely affects the employment is employment misconduct.\n(d) If the conduct for which the applicant was discharged involved only a single incident, that is an important fact that must be considered in deciding whether the conduct rises to the level of employment misconduct under paragraph (a). This paragraph does not require that a determination under section 268.101 or decision under section 268.105 contain a specific acknowledgment or explanation that this paragraph was considered.\n(e) The definition of employment misconduct provided by this subdivision is exclusive and no other definition applies.\n(a) The commission of any act, on the job or off the job, that would amount to a gross misdemeanor or felony is aggravated employment misconduct if the act had a significant adverse effect on the employment.\nA criminal charge or conviction is not necessary to determine aggravated employment misconduct under this paragraph. If an applicant is convicted of a gross misdemeanor or felony, the applicant is presumed to have committed the act.\n(b) For an employee of a facility as defined in section 626.5572, aggravated employment misconduct includes an act of patient or resident abuse, financial exploitation, or recurring or serious neglect, as defined in section 626.5572 and applicable rules.\n(c) The definition of aggravated employment misconduct provided by this subdivision is exclusive and no other definition applies.\nAn applicant may not be held ineligible for unemployment benefits under this section for any acts or omissions occurring after the applicant's separation from employment with the employer. A layoff because of lack of work is considered a separation from employment.\n[Renumbered 268.085, subd 13c]\n[Renumbered 268.035, subd 23a]\n(a) Ineligibility from the payment of all unemployment benefits under subdivisions 1 and 4 is for the duration of the applicant's unemployment and until the end of the calendar week that the applicant had total wages paid for actual work performed in subsequent covered employment sufficient to meet one-half of the requirements of section 268.07, subdivision 2, paragraph (a).\n(b) Ineligibility imposed under subdivisions 1 and 4 begins on the Sunday of the week that the applicant became separated from employment.\n(c) In addition to paragraph (a), if the applicant was discharged from employment because of aggravated employment misconduct, wage credits from that employment are canceled and cannot be used for purposes of a benefit account under section 268.07, subdivision 2.\n(a) This section and section 268.085, subdivision 13c, apply to all covered employment, full time or part time, temporary or of limited duration, permanent or of indefinite duration, that occurred in Minnesota during the base period, the period between the end of the base period and the effective date of the benefit account, or the benefit year.\n(b) Paragraph (a) also applies to employment covered under an unemployment insurance program of any other state or established by an act of Congress.\n[Renumbered 268.085, subd 13b]",
	"repealed": false
}