{
	"id": "297A.669",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.669",
	"title": "297A.669 TELECOMMUNICATION AND RELATED SERVICES SOURCING.",
	"text": "Except for the defined telecommunication services in subdivision 3, the sale of telecommunication service sold on a call-by-call basis shall be sourced to (1) each level of taxing jurisdiction where the call originates and terminates in that jurisdiction; or (2) each level of taxing jurisdiction where the call either originates or terminates and in which the service address is also located.\nExcept for the defined telecommunication services in subdivision 3, a sale of telecommunications services sold on a basis other than a call-by-call basis is sourced to the customer's place of primary use.\nThe sale of the following telecommunication services shall be sourced to each level of taxing jurisdiction in paragraphs (a) to (d).\n(a) A sale of mobile telecommunications services, other than air-to-ground radiotelephone service and prepaid calling service, is sourced to the customer's place of primary use as required by the Mobile Telecommunications Sourcing Act.\n(b) A sale of postpaid calling service is sourced to the origination point of the telecommunications signal as first identified by either:\n(1) the seller's telecommunications system; or\n(2) information received by the seller from its service provider, where the system used to transport such signals is not that of the seller.\n(c) A sale of prepaid calling service or prepaid wireless calling service is sourced in accordance with section 297A.668, subdivision 2. However, in the case of a sale of a prepaid wireless calling service, the rule provided in section 297A.668, subdivision 2, paragraph (f), shall include as an option the location associated with the mobile telephone number.\n(d) A sale of a private communication service is sourced as follows:\n(1) service for a separate charge related to a customer channel termination point is sourced to each level of jurisdiction in which the customer channel termination point is located;\n(2) service where all customer termination points are located entirely within one jurisdiction or levels of jurisdiction is sourced in such jurisdiction in which the customer channel termination points are located;\n(3) service for segments of a channel between two customer channel termination points located in different jurisdictions and which segment of channel are separately charged is sourced 50 percent in each level of jurisdiction in which the customer channel termination points are located; and\n(4) service for segments of a channel located in more than one jurisdiction or levels of jurisdiction and which segments are not separately billed is sourced in each jurisdiction based on the percentage determined by dividing the number of customer channel termination points in the jurisdiction by the total number of customer channel termination points.\n\"Air-to-ground radiotelephone service,\" for purposes of this section, means a radio service, as that term is defined in Code of Federal Regulations, title 47, section 22.99, in which common carriers are authorized to offer and provide radio telecommunications service for hire to subscribers in aircraft.\n\"Call-by-call basis,\" for purposes of this section, means any method of charging for telecommunications services where the price is measured by individual calls.\n\"Communications channel,\" for purposes of this section, means a physical or virtual path of communications over which signals are transmitted between or among customer channel termination points.\n\"Customer,\" for purposes of this section, means the person or entity that contracts with the seller of telecommunications services. If the end user of telecommunications services is not the contracting party, the end user of the telecommunications service is the customer of the telecommunication service, but this sentence applies only for the purpose of sourcing sales of telecommunications services under this section. Customer does not include a reseller of telecommunications service or for mobile telecommunications service of a serving carrier under an agreement to serve the customer outside the home service provider's licensed service area.\n\"Customer channel termination point,\" for purposes of this section, means the location where the customer either inputs or receives the communications.\n\"End user,\" for purposes of this section, means the person who utilizes the telecommunication service. In the case of an entity, end user means the individual who utilizes the service on behalf of the entity.\n\"Home service provider,\" for purposes of this section, means the same as that term is defined in Section 124(5) of Public Law 106-252 (Mobile Telecommunications Sourcing Act).\n\"Mobile telecommunications service,\" for purposes of this section, means the same as that term is defined in Section 124(7) of Public Law 106-252 (Mobile Telecommunications Sourcing Act).\n\"Place of primary use,\" for purposes of this section, means the street address representative of where the customer's use of the telecommunications service primarily occurs, which must be the residential street address or the primary business street address of the customer. In the case of mobile telecommunications services, place of primary use must be within the licensed service area of the home service provider.\n\"Postpaid calling service,\" for purposes of this section, means the telecommunications service obtained by making a payment on a call-by-call basis either through the use of a credit card or payment mechanism such as a bank card, travel card, credit card, or debit card, or by a charge made to a telephone number that is not associated with the origination or termination of the telecommunications service. A postpaid calling service includes a telecommunications service, except a prepaid wireless calling service, that would be a prepaid calling service except it is not exclusively a telecommunication service.\n\"Prepaid calling service,\" for purposes of this section, means a telecommunications service that:\n(1) provides the right to access exclusively telecommunications services;\n(2) must be paid for in advance;\n(3) enables the origination of calls using an access number or authorization code, whether manually or electronically dialed; and\n(4) is sold in predetermined units or dollars of which the number declines with use in a known amount.\n\"Prepaid wireless calling service,\" for purposes of this section, means a telecommunications service that:\n(1) provides the right to utilize mobile wireless service as well as other nontelecommunications services, including the download of digital products delivered electronically, content, and ancillary services;\n(2) must be paid for in advance; and\n(3) is sold in predetermined units or dollars of which the number declines with use in a known amount.\n\"Private communication services,\" for purposes of this section, means the same as that term is defined in section 297A.61, subdivision 26.\n\"Service address,\" for purposes of this section, means:\n(1) the location of the telecommunications equipment to which a customer's call is charged and from which the call originates or terminates, regardless of where the call is billed or paid;\n(2) if the location in clause (1) is not known, service address means the origination point of the signal of the telecommunications services first identified by either the seller's telecommunications system or in information received by the seller from its service provider, where the system used to transport the signals is not that of the seller; or\n(3) if the location in clauses (1) and (2) is not known, the service address means the location of the customer's place of primary use.\nThe sale of an ancillary service is sourced to the customer's place of primary use.",
	"repealed": false
}