{
	"id": "142D.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.12",
	"title": "142D.12 HEAD START PROGRAM.",
	"text": "The Department of Children, Youth, and Families is the state agency responsible for administering the Head Start program. The commissioner of children, youth, and families shall allocate funds according to the formula in section 119A.52 to public or private nonprofit agencies for the purpose of providing supplemental funds for the federal Head Start program.\nData collected on individuals from which the identity of any individual receiving services may be determined are private data on individuals as defined in section 13.02.\n(a) A research-based early childhood literacy program premised on actively involved parents, ongoing professional staff development, and high quality early literacy program standards is established to increase the literacy skills of children participating in Head Start to prepare them to be successful readers and to increase families' participation in providing early literacy experiences to their children. Program providers must:\n(1) work to prepare children to be successful learners;\n(2) work to close the achievement gap for at-risk children;\n(3) use a culturally relevant integrated approach to early literacy that daily offers a literacy-rich classroom learning environment composed of books, writing materials, writing centers, labels, rhyming, and other related literacy materials and opportunities;\n(4) support children's home language while helping the children master English and use multiple literacy strategies to provide a cultural bridge between home and school;\n(5) use literacy mentors, ongoing literacy groups, and other teachers and staff to provide appropriate, extensive professional development opportunities in early literacy and classroom strategies for preschool teachers and other preschool staff;\n(6) use ongoing data-based assessments that enable preschool teachers to understand, plan, and implement literacy strategies, activities, and curriculum that meet children's literacy needs and continuously improve children's literacy;\n(7) foster participation by parents, community stakeholders, literacy advisors, and evaluation specialists; and\n(8) provide parents of English learners with oral and written information to monitor the program's impact on their children's English language development, to know whether their children are progressing in developing their English proficiency and, where practicable, their native language proficiency, and to actively engage with their children in developing their English and native language proficiency.\nProgram providers are encouraged to collaborate with qualified, community-based early childhood providers in implementing this program and to seek nonstate funds to supplement the program.\n(b) Program providers under paragraph (a) interested in extending literacy programs to children in kindergarten through grade 3 may elect to form a partnership with an eligible organization under section 124D.38, subdivision 2, or 124D.42, subdivision 8, schools enrolling children in kindergarten through grade 3, and other interested and qualified community-based entities to provide ongoing literacy programs that offer seamless literacy instruction focused on closing the literacy achievement gap. To close the literacy achievement gap by the end of third grade, partnership members must agree to use best efforts and practices and to work collaboratively to implement a seamless literacy model from age three to grade 3, consistent with paragraph (a). Literacy programs under this paragraph must collect and use literacy data to:\n(1) evaluate children's literacy skills;\n(2) monitor the progress and provide reading instruction appropriate to the specific needs of English learners; and\n(3) formulate specific intervention strategies to provide reading instruction to children premised on the outcomes of formative and summative assessments and research-based indicators of literacy development.\nThe literacy programs under this paragraph also must train teachers and other providers working with children to use the assessment outcomes under clause (3) to develop and use effective, long-term literacy coaching models that are specific to the program providers.",
	"repealed": false
}