{
	"id": "322C.1101",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.1101",
	"title": "322C.1101 NONPROFIT LIMITED LIABILITY COMPANIES.",
	"text": "A limited liability company is a nonprofit limited liability company if it is organized under or governed by this chapter and its articles of organization state that it is a nonprofit limited liability company governed by this section. The status of a nonprofit limited liability company under this chapter is not determinative of its tax treatment.\nA nonprofit limited liability company may not:\n(1) be formed for a purpose involving pecuniary gain to its members, other than to members that are nonprofit organizations or subdivisions, units, or agencies of the United States or a state or local government; or\n(2) pay dividends, make distributions, or pay other pecuniary remuneration, directly or indirectly, to its members, other than to members that are nonprofit organizations or subdivisions, units, or agencies of the United States or a state or local government.\nA natural person may not be a member of, or own any transferable interest in, a nonprofit limited liability company.\n(a) Subject to subdivision 2:\n(1) a nonprofit limited liability company may be organized under this chapter for any lawful purpose, unless another statute requires incorporation or organization for a purpose under a different law; and\n(2) a nonprofit limited liability company has a general purpose of engaging in any lawful activity unless otherwise limited in its articles of organization.\n(b) A nonprofit limited liability company engaging in conduct that is regulated by another statute is subject to the limitations of the other statute.\n(a) A nonprofit limited liability company must be board-managed. The business and affairs of a nonprofit limited liability company must be managed by or under the direction of a board of governors, which will have such powers as are usually exercised by the board of directors of a nonprofit corporation governed by chapter 317A. All governors will be entitled to vote and have equal rights and preferences except as otherwise provided in the articles of organization or operating agreement. The members of the first board may be named in the articles of organization, designated, or appointed pursuant to the articles of organization, or elected by the organizer.\n(b) A nonprofit limited liability company must have one or more natural persons acting as officers and exercising the functions of the offices of president and treasurer, however designated. The officers have such powers as are usually exercised by similar officers of a nonprofit corporation governed by chapter 317A. The board shall elect or appoint officers, except to the extent that the articles of organization or operating agreement provide that the members may elect or appoint officers.\n(c) Section 317A.161, subdivision 11, applies to a nonprofit limited liability company as if it were a nonprofit corporation governed by chapter 317A. Section 317A.251 applies to a governor of a nonprofit limited liability company as if the governor were a director of a nonprofit corporation, and section 322C.0409 does not apply.\n(d) Section 317A.255 applies to, and with regard to, a governor of a nonprofit limited liability company as if the governor were a director of a nonprofit corporation.\n(e) Section 317A.257 applies to a person who serves without compensation as a governor of a nonprofit limited liability company, manager, member, or agent of a nonprofit limited liability company as if such person were serving without compensation as a director, officer, member, or agent of a nonprofit corporation.\n(f) Section 317A.671 regarding the diversion of certain assets applies to a nonprofit limited liability company as if it were a nonprofit corporation governed by chapter 317A.\n(g) Section 317A.735 regarding the distribution of assets on dissolution applies to a nonprofit limited liability company as if it were a nonprofit corporation governed by chapter 317A.\n(h) Section 317A.751 regarding judicial intervention applies to a nonprofit limited liability company as if it were a nonprofit corporation governed by chapter 317A.\nThe attorney general has the same authority and powers with regard to a nonprofit limited liability company as the attorney general has with regard to a corporation governed by chapter 317A, including but not limited to sections 317A.811 and 317A.813.",
	"repealed": false
}