{
	"id": "241.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.26",
	"title": "241.26 PRIVATE EMPLOYMENT OF INMATES OF STATE CORRECTIONAL INSTITUTIONS IN COMMUNITY.",
	"text": "When consistent with the public interest and the public safety, the commissioner of corrections may conditionally release an inmate who is eligible and being considered for release under section 243.05, to work at paid employment, seek employment, or participate in a vocational training or educational program. Release under this subdivision is an extension of the limits of confinement and each inmate so released shall be confined in the correctional facility from which released or in some other suitable place of confinement designated by the commissioner of corrections during the hours the inmate is not employed, seeking employment, or engaged in a vocational training or educational program, or, if employed, seeking employment, or engaged in a vocational training or educational program, between the hours of such activity. A reasonable allowance for travel time and meals shall be permitted.\nThe commissioner of corrections shall designate state correctional institutions for participation in the program authorized in subdivision 1 and shall adapt facilities of such institutions to provide housing and supervision of inmates participating in such program. The commissioner of corrections may also enter into contractual agreements with appropriate city and county authorities for the confinement of and provision of other correctional services to such inmates whose employment, educational or vocational training programs so require, and such city and county authorities are hereby authorized to make and enter such contracts and agreements. When the commissioner determines that the circumstances of a participant in the program authorized by subdivision 1 do not require the security of a public detention facility, the commissioner may contract with public and private agencies for the custody and separate care of such participant or house the participant in a community correction center or under house arrest and monitored by electronic surveillance in an approved residence.\nThe commissioner of corrections shall establish rules for placement and supervision of such inmates and for administration of programs authorized by this section. When consistent with the public interest the commissioner may grant furloughs to those inmates participating in the programs authorized by this section who have spent at least 30 days in a residential work release center operated by or under the control of the commissioner for a period of time not to exceed their supervised release date.\nThe willful failure of an inmate to report to or return from planned employment, seeking employment, educational or vocational training, or furlough as provided in subdivision 3 shall be considered an escape under section 609.485. If an inmate violates any of the rules provided for in subdivision 3, the inmate's work placement, educational, or vocational training privileges may be withdrawn by the commissioner.\nThe net earnings of each inmate participating in the work release program provided by this section may be collected by or forwarded to the commissioner of corrections for deposit to the account of the inmate in the work release account in the state treasury, or the inmate may be permitted to collect, retain, and expend the net earnings from the inmate's employment under rules established by the commissioner of corrections. The money collected by or forwarded to the commissioner under the rules shall remain under the control of the commissioner for the sole benefit of the inmate. After making deductions for the payment of state and local taxes, if necessary, and for repayment of advances and gate money as provided in section 243.24, wages under the control of the commissioner and wages retained by the inmate may be disbursed by the commissioner or expended by the inmate for the following purposes and in the following order:\n(1) the cost of the inmate's keep as determined by subdivision 7, which money shall be deposited in the general fund of the state treasury if the inmate is housed in a state correctional facility, or shall be paid directly to the place of confinement as designated by the commissioner pursuant to subdivision 1;\n(2) necessary travel expense to and from work and other incidental expenses of the inmate;\n(3) support of inmate's dependents, if any;\n(4) court-ordered restitution, if any;\n(5) fines, surcharges, or other fees assessed or ordered by the court;\n(6) contribution to any programs established by law to aid victims of crime, provided that the contribution must not be more than 20 percent of the inmate's gross wages;\n(7) restitution to the commissioner of corrections ordered by a prison disciplinary hearing officer for damage to property caused by an inmate's conduct;\n(8) restitution to staff ordered by a prison disciplinary hearing officer for damage to property caused by an inmate's conduct;\n(9) restitution to another inmate ordered by a prison disciplinary hearing officer for personal injury to another caused by an inmate's conduct;\n(10) after the above expenditures, the inmate shall have discretion to direct payment of the balance, if any, upon proper proof of personal legal debts;\n(11) the balance, if any, shall be disbursed to the inmate as provided in section 243.24, subdivision 1.\nThe commissioner may authorize the payment of court-ordered restitution from an inmate's wages when the restitution was court ordered as a sanction for the conviction of an offense which is not the offense of commitment, including offenses which occurred prior to the offense for which the inmate was committed to the commissioner. All money in the work release account are appropriated annually to the commissioner of corrections for the purposes of the work release program.\nWages or salaries of work placement inmates shall not be subject to garnishment, attachment, or execution in the hands of either the employer or a state agent authorized to hold such funds.\nThe commissioner shall determine the amount to be paid for board and room by such work placement inmate. When special circumstances warrant or for just and reasonable cause, the commissioner may waive the payment by the inmate of board and room charges.\nWhere a work placement inmate is housed in a jail or workhouse, such board and room revenue shall be paid over to such city or county official as provided for in subdivision 2, provided however, that when payment of board and room has been waived, the commissioner shall make such payments from funds appropriated for that purpose.",
	"repealed": false
}