{
	"id": "354.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.47",
	"title": "354.47 PAYMENT AFTER DEATH.",
	"text": "(a) If a member dies before retirement and is covered under section 354.44, subdivision 2, and neither an optional annuity, nor a reversionary annuity, nor a benefit under section 354.46, subdivision 1, is payable to the survivors if the member was a basic member, then the surviving spouse, or if there is no surviving spouse, the designated beneficiary is entitled to an amount equal to the member's accumulated deductions with interest credited to the account of the member to the date of death of the member. If the designated beneficiary is a minor, interest must be credited to the date the beneficiary reaches legal age, or the date of receipt, whichever is earlier.\n(b) If a member dies before retirement and is covered under section 354.44, subdivision 6, and neither an optional annuity, nor reversionary annuity, nor the benefit described in section 354.46, subdivision 1, is payable to the survivors if the member was a basic member, then the surviving spouse, or if there is no surviving spouse, then the designated beneficiary is entitled to a refund equal to the accumulated deductions credited to the member's account plus interest compounded annually until the member's date of death using the following interest rates:\n(1) before July 1, 1957, no interest accrues;\n(2) July 1, 1957, to June 30, 2011, six percent; and\n(3) after June 30, 2011, four percent.\n(c) If the designated beneficiary under paragraph (b) is a minor, any interest credited under that paragraph must be credited to the date the beneficiary reaches legal age, or the date of receipt, whichever is earlier.\n(d) The amount of any refund payable under this subdivision must be reduced by any permanent disability payment under section 354.48 received by the member.\nUncashed annuity or benefit warrants issued before the recipient's death are payable to the designated beneficiary, and if none, to the recipient's estate.\nIf a member or a former member dies without having a surviving designated beneficiary and the amount to the credit of the decedent is $1,500 or less, the board of trustees may 90 days after the date of death, in the absence of probate proceedings, make payment to the surviving spouse of the decedent. This payment is a bar to recovery of this payment from the association by any other person or persons. Any accrued retirement annuity, disability, or survivor benefit may be paid in the same manner.\n[Repealed, 1974 c 289 s 59]",
	"repealed": false
}