{
	"id": "268.103",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.103",
	"title": "268.103 APPEALS BY ELECTRONIC TRANSMISSION.",
	"text": "(a) The commissioner may allow an appeal to be filed by electronic transmission. If the commissioner allows an appeal to be filed by electronic transmission, that must be clearly set out on the determination or decision subject to appeal.\n(b) The commissioner may restrict the manner and format under which an appeal by electronic transmission may be filed. Restrictions to a specific facsimile transmission number or electronic address must be clearly set out on the determination or decision subject to appeal.\n(c) All information requested by the commissioner when an appeal is filed by electronic transmission must be supplied or the communication does not constitute an appeal.\n(d) Subject to subdivision 2, this section applies to requests for reconsideration under section 268.105, subdivision 2.\n(a) The commissioner must allow an applicant to file an appeal by mail even if an appeal by electronic transmission is allowed.\n(b) A written statement delivered or mailed to the department that could reasonably be interpreted to mean that an involved applicant is in disagreement with a specific determination or decision is considered an appeal. No specific words need be used for the written statement to be considered an appeal.\n(a) If an agent files an appeal on behalf of an employer, the appeal must be filed online. The appeal must be filed through the electronic address provided on the determination being appealed. Use of another method of filing does not constitute an appeal. This paragraph does not apply to:\n(1) an employee filing an appeal on behalf of an employer; or\n(2) an attorney licensed to practice law who is directly representing the employer on appeal.\n(b) All information requested when the appeal is filed must be supplied or the communication does not constitute an appeal.\n[Repealed by amendment, 2004 c 183 s 70]\n[Repealed, 2007 c 128 art 1 s 23]",
	"repealed": false
}