{
	"id": "147D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/147D.07",
	"title": "147D.07 INFORMED CONSENT.",
	"text": "Before providing any services to a client, a licensed traditional midwife must:\n(1) advise the client of the information contained in the informed consent form;\n(2) provide the client with an informed consent form; and\n(3) have the form returned with the client's signature attesting that the client understands the consent form and the information contained in the form.\nThe informed consent form must be written in language understandable to the client and, at a minimum, must contain the following:\n(1) name, address, telephone number, and license number of the licensed traditional midwife;\n(2) a description of the licensed traditional midwife's education, training, and experience in traditional midwifery;\n(3) the licensed traditional midwife's fees and method of billing;\n(4) the right of the client to file a complaint with the board and the procedures for filing a complaint;\n(5) a description of the licensed traditional midwife's medical consultation plan and the antepartum, intrapartum, and postpartum conditions requiring consultation, transfer of care, or transport to a hospital;\n(6) the scope of care and services to be provided to the client by the licensed traditional midwife;\n(7) the available alternatives to traditional midwifery care;\n(8) a statement indicating that the client's records and any transaction with the licensed traditional midwife are confidential;\n(9) a notice that reads: \"We realize that there are risks associated with birth, including the risk of death or disability of either mother or child. We understand that a situation may arise, which requires emergency medical care and that it may not be possible to transport the mother and/or baby to the hospital in time to benefit from such care. We fully accept the outcome and consequences of our decision to have a licensed traditional midwife attend us during pregnancy and at our birth. We realize that our licensed traditional midwife is not licensed to practice medicine. We are not seeking a licensed physician or certified nurse midwife as the primary caregiver for this pregnancy, and we understand that our licensed traditional midwife shall inform us of any observed signs or symptoms of disease, which may require evaluation, care, or treatment by a medical practitioner. We agree that we are totally responsible for obtaining qualified medical assistance for the care of any disease or pathological condition.\";\n(10) the right of a client to refuse services unless otherwise provided by law;\n(11) a disclosure of whether the licensed traditional midwife carries malpractice or liability insurance; and\n(12) the client's and licensed traditional midwife's signatures and date of signing.\nThe licensed traditional midwife must have a signed informed consent form on file for each client. Upon request, the licensed traditional midwife must provide a copy of the informed consent form to the board.",
	"repealed": false
}