{
	"id": "152.027",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.027",
	"title": "152.027 OTHER CONTROLLED SUBSTANCE OFFENSES.",
	"text": "Except as provided in section 152.02, subdivision 6, a person who unlawfully sells one or more mixtures containing a controlled substance classified in Schedule V may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\nExcept as provided in section 152.02, subdivision 6, a person who unlawfully possesses one or more mixtures containing a controlled substance classified in Schedule V may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both. The court may order that a person who is convicted under this subdivision and placed on probation be required to take part in a drug education program as specified by the court.\nMS 2022 [Repealed, 2023 c 63 art 6 s 73]\nMS 2022 [Repealed, 2023 c 63 art 6 s 73]\n(a) A person who unlawfully sells any amount of salvia divinorum or salvinorin A is guilty of a gross misdemeanor.\n(b) A person who unlawfully possesses any amount of salvia divinorum or salvinorin A is guilty of a misdemeanor.\n(a) As used in this subdivision, \"synthetic cannabinoid\" includes any substance included in section 152.02, subdivision 2, paragraph (h), clause (3).\n(b) A person who unlawfully sells a synthetic cannabinoid for no remuneration is guilty of a gross misdemeanor.\n(c) A person who unlawfully sells a synthetic cannabinoid is guilty of a felony and if convicted may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\n(d) A person who unlawfully possesses any amount of a synthetic cannabinoid is guilty of a misdemeanor.\n(e) Notwithstanding any contrary provision in sections 152.021 to 152.025, this subdivision describes the exclusive penalties for the sale and possession of synthetic cannabinoid.\n(a) A person who unlawfully sells any amount of kratom or a substance that contains mitragynine or 7-hydroxymitragynine to a person under the age of 18 is guilty of a gross misdemeanor.\n(b) A person under the age of 18 who unlawfully possesses any amount of kratom or a substance that contains mitragynine or 7-hydroxymitragynine is guilty of a misdemeanor.",
	"repealed": false
}