{
	"id": "145.682",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.682",
	"title": "145.682 CERTIFICATION OF EXPERT REVIEW; AFFIDAVIT.",
	"text": "For purposes of this section, \"health care provider\" means a physician, surgeon, dentist, or other health care professional or hospital, including all persons or entities providing health care as defined in section 145.61, subdivisions 2 and 4, or a certified health care professional employed by or providing services as an independent contractor in a hospital.\nIn an action alleging malpractice, error, mistake, or failure to cure, whether based on contract or tort, against a health care provider which includes a cause of action as to which expert testimony is necessary to establish a prima facie case, the plaintiff must: (1) unless otherwise provided in subdivision 3, clause (2), serve upon defendant with the summons and complaint an affidavit as provided in subdivision 3; and (2) serve upon defendant within 180 days after commencement of discovery under the Rules of Civil Procedure, rule 26.04(a) an affidavit as provided by subdivision 4.\nThe affidavit required by subdivision 2, clause (1), must be by the plaintiff's attorney and state that:\n(1) the facts of the case have been reviewed by the plaintiff's attorney with an expert whose qualifications provide a reasonable expectation that the expert's opinions could be admissible at trial and that, in the opinion of this expert, one or more defendants deviated from the applicable standard of care and by that action caused injury to the plaintiff; or\n(2) the expert review required by clause (1) could not reasonably be obtained before the action was commenced because of the applicable statute of limitations. If an affidavit is executed pursuant to this paragraph, the affidavit in clause (1) must be served on defendant or the defendant's counsel within 90 days after service of the summons and complaint.\n(a) The affidavit required by subdivision 2, clause (2), must be signed by each expert listed in the affidavit and by the plaintiff's attorney and state the identity of each person whom plaintiff expects to call as an expert witness at trial to testify with respect to the issues of malpractice or causation, the substance of the facts and opinions to which the expert is expected to testify, and a summary of the grounds for each opinion. Answers to interrogatories that state the information required by this subdivision satisfy the requirements of this subdivision if they are signed by the plaintiff's attorney and by each expert listed in the answers to interrogatories and served upon the defendant within 180 days after commencement of discovery under the Rules of Civil Procedure, rule 26.04(a).\n(b) The parties or the court for good cause shown, may by agreement, provide for extensions of the time limits specified in subdivision 2, 3, or this subdivision. Nothing in this subdivision may be construed to prevent either party from calling additional expert witnesses or substituting other expert witnesses.\n(c) In any action alleging medical malpractice, all expert interrogatory answers must be signed by the attorney for the party responding to the interrogatory and by each expert listed in the answers. The court shall include in a scheduling order a deadline prior to the close of discovery for all parties to answer expert interrogatories for all experts to be called at trial. No additional experts may be called by any party without agreement of the parties or by leave of the court for good cause shown.\nIf the plaintiff is acting pro se, the plaintiff shall sign the affidavit or answers to interrogatories referred to in this section and is bound by those provisions as if represented by an attorney.\n(a) Failure to comply with subdivision 2, clause (1), within 60 days after demand for the affidavit results, upon motion, in mandatory dismissal with prejudice of each cause of action as to which expert testimony is necessary to establish a prima facie case.\n(b) Failure to comply with subdivision 2, clause (2), results, upon motion, in mandatory dismissal with prejudice of each cause of action as to which expert testimony is necessary to establish a prima facie case.\n(c) Failure to comply with subdivision 4 because of deficiencies in the affidavit or answers to interrogatories results, upon motion, in mandatory dismissal with prejudice of each action as to which expert testimony is necessary to establish a prima facie case, provided that:\n(1) the motion to dismiss the action identifies the claimed deficiencies in the affidavit or answers to interrogatories;\n(2) the time for hearing the motion is at least 45 days from the date of service of the motion; and\n(3) before the hearing on the motion, the plaintiff does not serve upon the defendant an amended affidavit or answers to interrogatories that correct the claimed deficiencies.\nThe signature of the plaintiff or the plaintiff's attorney constitutes a certification that the person has read the affidavit or answers to interrogatories, and that to the best of the person's knowledge, information, and belief formed after a reasonable inquiry, it is true, accurate, and made in good faith. A certification made in violation of this subdivision subjects the attorney or plaintiff responsible for such conduct to reasonable attorney's fees, costs, and disbursements.",
	"repealed": false
}