{
	"id": "162.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.145",
	"title": "162.145 SMALL CITIES ASSISTANCE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Eligible city\" means a statutory or home rule charter city that does not receive municipal state aid under sections 162.09 to 162.14 in the calendar year in which funds are distributed under this section.\n(c) \"Maximum aid\" means 3.5 multiplied by the unweighted average amount of assistance to a city in a fiscal year.\n(d) \"Population\" means the most recent population estimated or established as of 30 days before the date of an allocation under subdivision 4, of (i) the most recent federal census, (ii) a special census conducted under contract with the United States Bureau of the Census, (iii) a population estimate made by the Metropolitan Council pursuant to section 473.24, or (iv) a population estimate of the state demographer made pursuant to section 4A.02.\n(e) \"State-aid adjustment factor\" means the greater of zero, or:\n(1) 0.005; minus\n(2) the number of lane miles of county state-aid highway in a city, divided by the total number of lane miles of county state-aid highway in all eligible cities.\n(f) \"Total population\" means the sum of populations of all eligible cities.\nA small cities assistance account is created in the special revenue fund. The account consists of money donated, allotted, transferred, or otherwise provided to the account. Money in the account is annually appropriated to the commissioner of transportation and may only be expended as provided under this section.\n(a) The commissioner must allocate all funds in the small cities assistance account as provided in subdivision 4 and must, by June 1, certify to the commissioner of revenue the amounts to be paid.\n(b) Following certification from the commissioner, the commissioner of revenue must distribute the specified funds to cities in the same manner as local government aid under chapter 477A. An appropriation to the commissioner under this section is available to the commissioner of revenue for the purposes specified in this paragraph.\n(c) Notwithstanding other law to the contrary, in order to receive distributions under this section, a city must conform to the standards in section 477A.017, subdivision 2. A city that receives funds under this section must make and preserve records necessary to show that the funds are spent in compliance with subdivision 5.\n(a) The preliminary aid to each city is calculated as follows:\n(1) five percent of funds allocated equally among all eligible cities;\n(2) 35 percent of funds allocated proportionally based on each city's share of lane miles of municipal streets compared to total lane miles of municipal streets of all eligible cities;\n(3) 35 percent of funds allocated proportionally based on each city's share of population compared to total population of all eligible cities; and\n(4) 25 percent of funds allocated proportionally based on each city's share of state-aid adjustment factor compared to the sum of state-aid adjustment factors of all eligible cities.\n(b) The final aid to each city is calculated as the lesser of:\n(1) the preliminary aid to the city multiplied by an aid factor; or\n(2) the maximum aid.\n(c) The commissioner shall set the aid factor under paragraph (b), which must be the same for all eligible cities, so that the total funds allocated under this subdivision equals the total amount available for the fiscal year.\n(a) Funds distributed under this section are available only for construction and maintenance of roads located within the city, including:\n(1) land acquisition, environmental analysis, design, engineering, construction, reconstruction, and maintenance;\n(2) road projects partially located within the city;\n(3) projects on county state-aid highways located within the city;\n(4) cost participation on road projects under the jurisdiction of another unit of government; and\n(5) debt service for obligations issued by the city in accordance with chapter 475, provided that the obligations are issued for a use allowable under this section.\n(b) Except for projects under paragraph (a), clause (3), funds distributed under this section are not subject to state-aid requirements under this chapter, including but not limited to engineering standards adopted by the commissioner in rules.",
	"repealed": false
}