{
	"id": "490.123",
	"url": "https://www.revisor.mn.gov/statutes/cite/490.123",
	"title": "490.123 JUDGES' RETIREMENT FUND.",
	"text": "(a) There is created a special fund to be known as the \"judges' retirement fund.\"\n(b) The judges' retirement fund must be credited with all contributions; all interest, dividends, and other investment proceeds; and all other income authorized by this chapter or other applicable law.\n(c) From this fund there are appropriated the payments authorized by this chapter, in the amounts and at the times provided, including the necessary and reasonable expenses of the Minnesota State Retirement System in administering the fund.\n(a) A judge in the tier I program whose service does not exceed the service credit limit in section 490.121, subdivision 22, shall contribute to the fund from each salary payment a sum equal to 9.00 percent of salary.\n(b) A judge in the tier II program shall contribute to the fund from each salary payment a sum equal to 7.00 percent of salary.\n(c) Contributions under this subdivision are payable by salary deduction. The deduction must be made by the state court administrator under section 352.04, subdivisions 4, 5, and 8.\n(a) The employer contribution rate to the fund on behalf of a judge is 22.5 percent of salary. The employer obligation continues after a judge exceeds the service credit limit in section 490.121, subdivision 22.\n(b) The employer contribution must be paid by the state court administrator. The employer contribution is payable at the same time as member contributions are made under subdivision 1a or as employee contributions are made to the unclassified program governed by chapter 352D for judges whose service exceeds the limit in section 490.121, subdivision 22, are remitted.\n[Repealed, 2009 c 169 art 1 s 77]\n[Repealed, 2002 c 220 art 10 s 40]\n[Repealed, 2009 c 169 art 1 s 77]\nThe commissioner of management and budget is the ex officio treasurer of the judges' retirement fund. The commissioner's general bond to the state must be conditioned to cover all liability for acting as the treasurer of the fund. All money received by the commissioner under this section must be set aside in the state treasury to the credit of the judges' retirement fund.\n(a) The executive director of the Minnesota State Retirement System shall, from time to time, certify to the State Board of Investment such portions of the judges' retirement fund as in the director's judgment may not be required for immediate use.\n(b) The State Board of Investment shall thereupon invest and reinvest sums so certified in such securities as are duly authorized legal investments for such purposes under section 11A.24 in compliance with sections 356A.04 and 356A.06.\n(a) If erroneous employee deductions and employer contributions are caused by an error in plan coverage involving the judges retirement plan and any other plan specified in section 356.637, that section applies.\n(b) The provisions of section 352.04, subdivisions 8 and 9, apply to the judges' retirement plan, except that if employee deductions or contributions are erroneously transmitted to the judges' retirement fund for service rendered after the service credit limit under section 490.121, subdivision 22, has been attained, consistent with section 352D.04, subdivision 2, no employer contributions may be transferred.\n(a) The state shall pay $6,000,000 annually to the judges' retirement fund. The aid is payable each July 1. The amount required is annually appropriated from the general fund to the judges' retirement fund.\n(b) The aid under paragraph (a) continues until the earlier of:\n(1) the first day of the fiscal year following three consecutive fiscal years in which the actuarial value of assets of the fund equals or exceeds 100 percent of the actuarial accrued liabilities as reported by the actuary retained under section 356.214 in the annual actuarial valuation prepared under section 356.215; or\n(2) July 1, 2048.",
	"repealed": false
}