{
	"id": "51A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.28",
	"title": "51A.28 ACCOUNTS OF ADMINISTRATORS, EXECUTORS, GUARDIANS, CUSTODIANS, TRUSTEES, AND OTHER FIDUCIARIES.",
	"text": "Any association may accept deposit accounts in the name of any administrator, executor, custodian, conservator, guardian, trustee, or other fiduciary for a named beneficiary or beneficiaries. Any such fiduciary shall have power to vote as a member in a mutual association as if the membership were held absolutely, to open and to make additions to, and to withdraw any such account in whole or in part. The withdrawal value of any such account, and earnings thereon, or other rights relating thereto may be paid or delivered, in whole or in part, to such fiduciary without regard to any notice to the contrary as long as such fiduciary is living. The payment or delivery to any such fiduciary or a receipt or acquittance signed by any such fiduciary to whom any such payment or any such delivery of rights is made shall be a valid and sufficient release and discharge of an association for the payment or delivery so made. Whenever a person holding an account in a fiduciary capacity dies and no written notice of the revocation or termination of the fiduciary relationship shall have been given to an association and the association has no written notice of any other disposition of the beneficial estate, the withdrawal value of such account, and earnings thereon, or other rights relating thereto may, at the option of an association, be paid or delivered, in whole or in part, to the beneficiary or beneficiaries. The payment or delivery to any such beneficiary, beneficiaries, or designated person, or a receipt or acquittance signed by any such beneficiary, beneficiaries, or designated person for any such payment or delivery shall be a valid and sufficient release and discharge of an association for the payment or delivery so made. This section does not apply to a P.O.D. account under chapter 528.",
	"repealed": false
}