{
	"id": "203B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.08",
	"title": "203B.08 MARKING AND RETURN OF ABSENTEE BALLOTS.",
	"text": "(a) An eligible voter who receives absentee ballots as provided in this chapter shall mark them in the manner specified in the directions for casting the absentee ballots. The return envelope containing marked ballots may be mailed as provided in the directions for casting the absentee ballots, may be left with the county auditor or municipal clerk who transmitted the absentee ballots to the voter, or may be left in a drop box as provided in section 203B.082. If delivered in person, the return envelope must be submitted to the county auditor or municipal clerk by 8:00 p.m. on election day.\n(b) The voter may designate an agent to deliver in person the sealed absentee ballot return envelope to the county auditor or municipal clerk or to deposit the return envelope in the mail. An agent may deliver or mail the return envelopes of not more than three voters in any election. Any person designated as an agent who tampers with either the return envelope or the voted ballots or does not immediately mail or deliver the return envelope to the county auditor or municipal clerk is guilty of a misdemeanor.\n[Repealed, 1999 c 132 s 46]\nThe county auditor or municipal clerk shall address return envelopes to allow direct mailing of the absentee ballots to the county auditor or municipal clerk who has the responsibility to accept and reject the absentee ballots.\nWhen absentee ballots are returned to a county auditor or municipal clerk, that official shall stamp or initial and date the return envelope and place it in a locked ballot container or other secured and locked space with other return envelopes received by that office. Within five days after receipt, the county auditor or municipal clerk shall deliver to the ballot board all ballots received, except that during the 14 days immediately preceding an election, the county auditor or municipal clerk shall deliver all ballots received to the ballot board within three days. Ballots received on election day after 8:00 p.m. shall be marked as received late by the county auditor or municipal clerk, and must not be delivered to the ballot board.\n[Repealed, 1999 c 132 s 46]\nThe secretary of state shall adopt rules establishing procedures to be followed by county auditors and municipal clerks to assure accurate and timely return of absentee ballots. The rules of the secretary of state may authorize procedures and methods of return in addition to those specified in this section.",
	"repealed": false
}