{
	"id": "148F.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.025",
	"title": "148F.025 REQUIREMENTS FOR LICENSURE.",
	"text": "Individuals seeking licensure as a licensed alcohol and drug counselor shall fully complete and submit a notarized written application on forms provided by the board together with the appropriate fee in the amount set under section 148F.115. No portion of the fee is refundable.\nAn applicant for licensure must submit evidence satisfactory to the board that the applicant has:\n(1) received a bachelor's or master's degree from an accredited school or educational program; and\n(2) received 18 semester credits or 270 clock hours of academic course work and 880 clock hours of supervised alcohol and drug counseling practicum from an accredited school or education program. The course work and practicum do not have to be part of the bachelor's degree earned under clause (1). The academic course work must be in the following areas:\n(i) an overview of the transdisciplinary foundations of alcohol and drug counseling, including theories of chemical dependency, the continuum of care, and the process of change;\n(ii) pharmacology of substance abuse disorders and the dynamics of addiction, including substance use disorder treatment with medications for opioid use disorder;\n(iii) professional and ethical responsibilities;\n(iv) multicultural aspects of chemical dependency;\n(v) co-occurring disorders; and\n(vi) the core functions defined in section 148F.01, subdivision 10.\nTo be eligible for licensure, the applicant must:\n(1) satisfactorily pass the International Certification and Reciprocity Consortium Alcohol and Other Drug Abuse Counselor (IC&RC AODA) written examination adopted June 2008, or other equivalent examination as determined by the board; or\n(2) satisfactorily pass a written examination for licensure as an alcohol and drug counselor, as determined by the board, and one of the following:\n(i) complete a written case presentation and pass an oral examination that demonstrates competence in the core functions as defined in section 148F.01, subdivision 10; or\n(ii) complete 2,000 hours of postdegree supervised professional practice under section 148F.04.\nThe applicant must sign a release authorizing the board to obtain information from the Bureau of Criminal Apprehension, the Department of Human Services, the Office of Health Facilities Complaints, and other agencies specified by the board. After the board has given written notice to an individual who is the subject of a background investigation, the agencies shall assist the board with the investigation by giving the board criminal conviction data, reports about substantiated maltreatment of minors and vulnerable adults, and other information. The board may contract with the commissioner of human services to obtain criminal history data from the Bureau of Criminal Apprehension. Information obtained under this subdivision is private data on individuals as defined in section 13.02, subdivision 12.\n(a) Applicants seeking licensure according to this subdivision must be:\n(1) an active duty military member;\n(2) the spouse of an active duty military member; or\n(3) a veteran who has left service in the two years preceding the date of license application, and has confirmation of an honorable or general discharge status.\n(b) Applicants are required to comply with subdivisions 1 and 4.\n(c) A qualified applicant under paragraph (a) must provide evidence of:\n(1) a current valid license, certificate, or permit in another state without history of disciplinary action by a regulatory authority in the other state; and\n(2) a current criminal background study without a criminal conviction that is determined by the board to adversely affect the applicant's ability to become licensed.\n(d) A temporary license issued under this subdivision is effective for two years from the initial licensure date.\n(e) During the temporary license period, the individual shall complete the application for licensure required in subdivision 1.\n(f) In order to remain licensed after the expiration of the temporary license, an individual must meet the requirements in subdivisions 2 and 3.",
	"repealed": false
}