{
	"id": "245C.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.22",
	"title": "245C.22 REVIEW AND ACTION ON A RECONSIDERATION REQUEST.",
	"text": "(a) The commissioner shall respond in writing or by electronic transmission to all reconsideration requests for which the basis for the request is that the information the commissioner relied upon to disqualify is incorrect or inaccurate within 30 working days of receipt of a complete request and all required relevant information.\n(b) If the basis for a disqualified individual's reconsideration request is that the individual does not pose a risk of harm, the commissioner shall respond to the request within 15 working days after receiving a complete request for reconsideration and all required relevant information.\n(c) If the disqualified individual's reconsideration request is based on both the correctness or accuracy of the information the commissioner relied upon to disqualify the individual and the individual's risk of harm, the commissioner shall respond to the request within 45 working days after receiving a complete request for reconsideration and all required relevant information.\nThe commissioner shall rescind the disqualification if the commissioner finds that the information relied upon to disqualify the subject is incorrect.\nIn reviewing a request for reconsideration of a disqualification, the commissioner shall give preeminent weight to the safety of each person served by the license holder, applicant, or other entities as provided in this chapter over the interests of the disqualified individual, license holder, applicant, or other entity as provided in this chapter, and any single factor under subdivision 4, paragraph (b), may be determinative of the commissioner's decision whether to set aside the individual's disqualification.\n(a) The commissioner may set aside the disqualification if the commissioner finds that the individual has submitted sufficient information to demonstrate that the individual does not pose a risk of harm to any person served by the applicant, license holder, or other entities as provided in this chapter.\n(b) In determining whether the individual has met the burden of proof by demonstrating the individual does not pose a risk of harm, the commissioner shall consider:\n(1) the nature, severity, and consequences of the event or events that led to the disqualification;\n(2) whether there is more than one disqualifying event;\n(3) the age and vulnerability of the victim at the time of the event;\n(4) the harm suffered by the victim;\n(5) vulnerability of persons served by the program;\n(6) the similarity between the victim and persons served by the program;\n(7) the time elapsed without a repeat of the same or similar event;\n(8) documentation of successful completion by the individual studied of training or rehabilitation pertinent to the event; and\n(9) any other information relevant to reconsideration.\n(c) For an individual seeking a child foster care license who is a relative of the child, the commissioner shall consider the importance of maintaining the child's relationship with relatives as an additional significant factor in determining whether a background study disqualification should be set aside.\n(d) If the individual requested reconsideration on the basis that the information relied upon to disqualify the individual was incorrect or inaccurate and the commissioner determines that the information relied upon to disqualify the individual is correct, the commissioner must also determine if the individual poses a risk of harm to persons receiving services in accordance with paragraph (b).\n(e) For an individual seeking employment in the substance use disorder treatment field, the commissioner shall set aside the disqualification if the following criteria are met:\n(1) the individual is not disqualified for a crime of violence as listed under section 624.712, subdivision 5, except for the following crimes: crimes listed under section 152.021, subdivision 2 or 2a; 152.022, subdivision 2; 152.023, subdivision 2; 152.024; or 152.025;\n(2) the individual is not disqualified under section 245C.15, subdivision 1;\n(3) the individual is not disqualified under section 245C.15, subdivision 4, paragraph (b);\n(4) the individual provided documentation of successful completion of treatment, at least one year prior to the date of the request for reconsideration, at a program licensed under chapter 245G, and has had no disqualifying crimes or conduct under section 245C.15 after the successful completion of treatment;\n(5) the individual provided documentation demonstrating abstinence from controlled substances, as defined in section 152.01, subdivision 4, for the period of one year prior to the date of the request for reconsideration; and\n(6) the individual is seeking employment in the substance use disorder treatment field.\n(a) If the commissioner sets aside a disqualification under this section, the disqualified individual remains disqualified, but may hold a license and have direct contact with or access to persons receiving services. Except as provided in paragraph (b), the commissioner's set-aside of a disqualification is limited solely to the licensed program, applicant, or agency specified in the set aside notice under section 245C.23. For personal care provider organizations, the commissioner's set-aside may further be limited to a specific individual who is receiving services. For new background studies required under section 245C.04, subdivision 1, paragraph (h), if an individual's disqualification was previously set aside for the license holder's program and the new background study results in no new information that indicates the individual may pose a risk of harm to persons receiving services from the license holder, the previous set-aside shall remain in effect.\n(b) If the commissioner has previously set aside an individual's disqualification for one or more programs or agencies, and the individual is the subject of a subsequent background study for a different program or agency, the commissioner shall determine whether the disqualification is set aside for the program or agency that initiated the subsequent background study. A notice of a set-aside under paragraph (c) shall be issued within 15 working days if all of the following criteria are met:\n(1) the subsequent background study was initiated in connection with a program licensed or regulated under the same provisions of law and rule for at least one program for which the individual's disqualification was previously set aside by the commissioner;\n(2) the individual is not disqualified for an offense specified in section 245C.15, subdivision 1 or 2;\n(3) the commissioner has received no new information to indicate that the individual may pose a risk of harm to any person served by the program; and\n(4) the previous set-aside was not limited to a specific person receiving services.\n(c) Notwithstanding paragraph (b), clause (2), for an individual who is employed in the substance use disorder field, if the commissioner has previously set aside an individual's disqualification for one or more programs or agencies in the substance use disorder treatment field, and the individual is the subject of a subsequent background study for a different program or agency in the substance use disorder treatment field, the commissioner shall set aside the disqualification for the program or agency in the substance use disorder treatment field that initiated the subsequent background study when the criteria under paragraph (b), clauses (1), (3), and (4), are met and the individual is not disqualified for an offense specified in section 245C.15, subdivision 1. A notice of a set-aside under paragraph (d) shall be issued within 15 working days.\n(d) When a disqualification is set aside under paragraph (b), the notice of background study results issued under section 245C.17, in addition to the requirements under section 245C.17, shall state that the disqualification is set aside for the program or agency that initiated the subsequent background study. The notice must inform the individual that the individual may request reconsideration of the disqualification under section 245C.21 on the basis that the information used to disqualify the individual is incorrect.\nThe commissioner may rescind a previous set aside of a disqualification under this section based on new information that indicates the individual may pose a risk of harm to persons served by the applicant, license holder, or other entities as provided in this chapter. If the commissioner rescinds a set-aside of a disqualification under this subdivision, the appeal rights under sections 245C.21, 245C.27, subdivision 1, and 245C.28, subdivision 3, shall apply.\n(a) Notwithstanding section 13.46, except as provided in paragraph (e), upon setting aside a disqualification under this section, the identity of the disqualified individual who received the set-aside and the individual's disqualifying characteristics are private data on individuals, as defined in section 13.02, subdivision 12.\n(b) Notwithstanding section 13.46, upon granting a variance to a license holder under section 245C.30, the identity of the disqualified individual who is the subject of the variance, the individual's disqualifying characteristics under section 245C.15, and the terms of the variance are private data on individuals, as defined in section 13.02, subdivision 12.\n(c) The identity of a disqualified individual and the reason for disqualification remain private data when:\n(1) a disqualification is not set aside and no variance is granted, except as provided under section 13.46, subdivision 4;\n(2) the data are not public under paragraph (a) or (b);\n(3) the disqualification is rescinded because the information relied upon to disqualify the individual is incorrect;\n(4) the disqualification relates to a license to provide relative child foster care. As used in this clause, \"relative\" has the meaning given it under section 260C.007, subdivision 26b or 27;\n(5) the disqualified individual is a household member of a licensed foster care provider and:\n(i) the disqualified individual previously received foster care services from this licensed foster care provider;\n(ii) the disqualified individual was subsequently adopted by this licensed foster care provider; and\n(iii) the disqualifying act occurred before the adoption; or\n(6) a variance is granted to a child care center or family child care license holder for an individual's disqualification that is based on a felony-level conviction for a drug-related offense that occurred within the past five years.\n(d) Notwithstanding paragraphs (a) and (b), the identity of household members who are the subject of a disqualification related set-aside or variance is not public data if:\n(1) the household member resides in the residence where the family child care is provided;\n(2) the subject of the set-aside or variance is under the age of 18 years; and\n(3) the set-aside or variance only relates to a disqualification under section 245C.15, subdivision 4, for a misdemeanor-level theft crime as defined in section 609.52.\n(e) When the commissioner has reason to know that a disqualified individual has received an order for expungement for the disqualifying record that does not limit the commissioner's access to the record, and the record was opened or exchanged with the commissioner for purposes of a background study under this chapter, the data that would otherwise become public under paragraph (a) or (b) remain private data.\n(a) The following commissioners shall be responsible for conducting reconsiderations and appeals of background studies for programs under their jurisdictions:\n(1) the commissioner of human services for programs under section 245C.03, subdivision 1;\n(2) the commissioner of health for programs under section 245C.03, subdivision 5a;\n(3) the commissioner of corrections for programs under section 245C.03, subdivision 5b; and\n(4) the commissioner of the children, youth, and families for programs under section 245C.03, subdivision 5c.\n(b) The commissioner of human services shall share all relevant background study data to allow the commissioners specified in paragraph (a) to complete reconsiderations and appeals for programs licensed or regulated by their agencies.",
	"repealed": false
}