{
	"id": "340A.414",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.414",
	"title": "340A.414 CONSUMPTION AND DISPLAY PERMITS.",
	"text": "No business establishment or club which does not hold an on-sale intoxicating liquor license may directly or indirectly allow the consumption and display of alcoholic beverages or knowingly serve any liquid for the purpose of mixing with intoxicating liquor without first having obtained a permit from the commissioner. Rental of a public facility does not make a subdivision or the facility a \"business establishment\" for the purposes of this chapter.\nA holder of a consumption and display permit under this section who wishes to allow the consumption and display of intoxicating liquor between the hours of 1:00 a.m. and 2:00 a.m. must obtain authorization to do so from the commissioner. The authorization may be provided in a document issued to the permit holder by the commissioner, or by a notation on the permit holder's permit. Authorizations are valid for one year from the date of issuance. The annual fee for obtaining authorization is $200. The commissioner shall deposit all fees received under this subdivision in the alcohol enforcement account in the special revenue fund. A person who holds a consumption and display permit and who also holds a license to sell alcoholic beverages at on-sale at the same location is not required to obtain an authorization under this subdivision.\n(a) The commissioner may issue a permit under this section only to:\n(1) an applicant who has not, within five years prior to the application, been convicted of a felony or of violating any provision of this chapter or rule adopted under this chapter;\n(2) a restaurant;\n(3) a hotel;\n(4) an establishment licensed for the sale of 3.2 percent malt liquor;\n(5) a resort as defined in section 157.15;\n(6) a club as defined in section 340A.101, subdivision 7, or an unincorporated club otherwise meeting that definition; and\n(7) a bed and breakfast facility as defined in section 340A.4011, subdivision 1.\n(b) The commissioner may not issue a permit to a club holding an on-sale intoxicating liquor license.\nA permit issued under this section authorizes the establishment to permit the consumption and display of intoxicating liquor on the premises. The permit does not authorize the sale of intoxicating liquor.\nAll permits issued under this section expire on March 31 of each year.\nA permit issued under this section is not effective until approved by the governing body of the city or county where the establishment is located.\nThe annual fee for issuance of a permit under this section is $250. The governing body of a city or county where the establishment is located may impose an additional fee of not more than $300.\nAn establishment holding a permit under this section is open for inspection by the commissioner and the commissioner's representative and by peace officers, who may enter and inspect during reasonable hours. Intoxicating liquor sold, served, or displayed in violation of law may be seized and may be disposed of under section 297G.20.\nA club issued a permit under this section may allow members to bring and keep a personal supply of intoxicating liquor in lockers on the club's premises. All bottles kept on the premises must have attached to it a label signed by the member. No person under 21 years of age may keep a supply of intoxicating liquor on club premises.\nA city may issue a one-day permit for the consumption and display of intoxicating liquor under this section to a nonprofit organization in conjunction with a social activity in the city sponsored by the organization. The permit must be approved by the commissioner and is valid only for the day indicated on the permit. The fee for the permit may not exceed $25. A city may not issue more than ten permits under this section in any one year.",
	"repealed": false
}