{
	"id": "18C.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.211",
	"title": "18C.211 GUARANTEED ANALYSIS.",
	"text": "(a) Until the commissioner prescribes the alternative form of guaranteed analysis, it must be stated as provided in this subdivision.\n(b) A guaranteed analysis must state the percentage of plant nutrient content, if claimed, in the following form:\n(c) For unacidulated mineral phosphatic materials and basic slag, bone, tankage, and other organic phosphate materials, the total phosphate or degree of fineness may also be stated.\n(a) A person may guarantee plant nutrients other than nitrogen, phosphorus, and potassium only if allowed or required by commissioner's rule.\n(b) The guarantees for the plant nutrients must be expressed in the elemental form.\n(c) The sources of other elements, oxides, salt, and chelates, may be required to be stated on the application for registration and may be included as a parenthetical statement on the label. Other beneficial substances or compounds, determinable by laboratory methods, also may be guaranteed by permission of the commissioner and with the advice of the director of the agricultural experiment station.\n(d) If plant nutrients or other substances or compounds are guaranteed, the plant nutrients are subject to inspection and analyses in accord with the methods and rules prescribed by the commissioner.\n(e) The commissioner may, by rule, require the potential basicity or acidity expressed in terms of calcium carbonate equivalent in multiples of 100 pounds per ton.\n(f) The plant nutrients in a specialty fertilizer must not be below or exceed the guaranteed analysis by more than the investigational allowances established by rule.\n[Repealed, 1993 c 367 s 41]\nThe guaranteed analysis of a soil amendment or plant amendment must be an accurate statement of composition including the percentages of each ingredient. If the product is a microbiological product, the number of viable microorganisms per milliliter for a liquid or the number of viable microorganisms per gram for a dry product must also be listed.",
	"repealed": false
}