{
	"id": "18B.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.055",
	"title": "18B.055 COMPENSATION FOR BEES KILLED BY PESTICIDE; APPROPRIATION.",
	"text": "(a) The commissioner must compensate a bee owner for an acute pesticide poisoning resulting in the death of bees or loss of bee colonies owned by the bee owner.\n(b) Except as provided in this section, the bee owner is entitled to the fair market value of the dead bees and bee colonies losses as determined by the commissioner upon recommendation by academic experts and bee keepers. A bee owner must not be compensated for a claim that is less than $100 or compensated more than $10,000 for a bee kill incident. A bee owner may only make one claim for a single bee kill incident.\n(c) A bee owner must not be compensated more than $20,000 in a fiscal year for bee kill incidents.\n(d) To be eligible for compensation under this section, the bee owner and the affected apiary must be registered prior to the bee kill incident with a commonly utilized pesticide registry program, as designated by the commissioner.\nMS 2022 [Repealed by amendment, 2023 c 43 art 2 s 25]\nWithin three months of the commissioner making a determination of whether the death of bees or loss of bee colonies was caused by acute pesticide poisoning, the bee owner must file a claim on forms provided by the commissioner and available on the Department of Agriculture's website.\nThe commissioner must determine whether the death of the bees or loss of bee colonies was caused by an acute pesticide poisoning, whether the pesticide applicator can be determined, and whether the pesticide applicator applied the pesticide product in a manner consistent with the pesticide product's label or labeling.\n(a) If the commissioner denies compensation claimed by a bee owner under this section, the commissioner must issue a written decision based upon the available evidence. The decision must include specification of the facts upon which the decision is based and the conclusions on the material issues of the claim. The commissioner must mail a copy of the decision to the bee owner.\n(b) A decision to deny compensation claimed under this section is not subject to the contested case review procedures of chapter 14, but may be reviewed upon a trial de novo in a court in the county where the loss occurred. The decision of the court may be appealed as in other civil cases. Review in court may be obtained by filing a petition for review with the administrator of the court within 60 days following receipt of a decision under this section. Upon the filing of a petition, the administrator must mail a copy to the commissioner and set a time for hearing within 90 days of the filing.\nThe commissioner must reduce payments made under this section by any compensation received by the bee owner for dead bees and bee colonies losses as proceeds from an insurance policy or from another source.\nIf the commissioner determines that a bee death or loss of bee colony was caused by acute pesticide poisoning, is able to determine the pesticide applicator that was responsible, and determines that the applicator applied the pesticide in a manner inconsistent with the product's label or labeling, the commissioner may add the amount that the bee owner received from the bee owner's claim to any penalty amount assessed by the commissioner under any penalty actions against the pesticide applicator under section 18D.315 or 18D.325.\nThe amount necessary to pay claims under this section, not to exceed $150,000 per fiscal year, is appropriated from the pesticide regulatory account in section 18B.05.",
	"repealed": false
}