{
	"id": "383B.751",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.751",
	"title": "383B.751 CARE AND CONTROL OF BUILDING.",
	"text": "The commission hereby created shall have the entire care and control of all of said courthouse and city hall building. It shall have power to assign unassigned rooms and space in any part of said building with entire control of any room or rooms in said building, and of all halls and corridors and of all boiler and machinery rooms. The commission in its discretion may reassign and reallocate occupied rooms or space therein provided that space already occupied may not be reassigned except after a hearing before said commission on written notice to the occupant or person in charge of such space; and the vote of three members of said commission shall govern as its final action after such hearing; provided further that any interested party may appeal from an adverse ruling of said commission to the district court, which court shall summarily decide the matter after a hearing thereon in the same manner as a civil case, and the determination of said matter by said court shall be final, provided that if the space in controversy is occupied or sought to be occupied by a district court judge or other district court official, that said final determination be made by a judge of the district court from a district other than that comprising Hennepin County, which other judge shall be selected by the governor upon request of the commission. When so determined and after being served with the court order the occupant or person in charge of such space or room shall remove therefrom in accordance with the terms of the order, and failing to do so, shall be deemed in contempt of court.\nThe commission shall also have the care and control of all engines, boilers, machinery, elevators and all mechanical and electrical appliances of every nature in said building. It shall cause all of the occupied portions of said building to be properly heated, lighted, cleaned and kept in repair for public use, with full authority to appoint any and all employees necessary to properly perform the duties hereby devolved upon such commission, with authority to fix the compensation of such employees. Persons employed by the municipal building commission on or before August 1, 1977, or thereafter, and having at least six months service, shall have tenure based on length of service. Promotions shall be filled from the eligible lists established and maintained by the Minneapolis civil service commission. No employee after six months continuous employment shall be removed or discharged except upon a majority vote of the members of the municipal building commission for cause, upon written charges and after an opportunity to be heard at a hearing conducted by the municipal building commission. The Minneapolis civil service rules relating to cause for removal shall govern. An employee removed for cause may appeal to district court, which decision shall be final.\nNothing herein contained shall be construed to interfere in any manner with the powers and duties of the courthouse and city hall commission engaged in completing and furnishing said building.",
	"repealed": false
}