{
	"id": "144.054",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.054",
	"title": "144.054 SUBPOENA POWER.",
	"text": "The commissioner may, as part of an investigation to determine whether a serious health threat exists or to locate persons who may have been exposed to an agent which can seriously affect their health, issue subpoenas to require the attendance and testimony of witnesses and production of books, records, correspondence, and other information relevant to any matter involved in the investigation. The commissioner or the commissioner's designee may administer oaths to witnesses or take their affirmation. The subpoenas may be served upon any person named therein anywhere in the state by any person authorized to serve subpoenas or other processes in civil actions of the district courts. If a person to whom a subpoena is issued does not comply with the subpoena, the commissioner may apply to the district court in any district and the court shall order the person to comply with the subpoena. Failure to obey the order of the court may be punished by the court as contempt of court. Except as provided in subdivision 2, no person may be compelled to disclose privileged information as described in section 595.02, subdivision 1. All information pertaining to individual medical records obtained under this section shall be considered health data under section 13.3805, subdivision 1. The fees for the service of a subpoena must be paid in the same manner as prescribed by law for a service of process issued out of a district court. Witnesses must receive the same fees and mileage as in civil actions.\nThe commissioner may subpoena privileged medical information of patients who may have been exposed by a licensed dental hygienist, dentist, physician, nurse, podiatrist, a registered dental assistant, or a physician assistant who is infected with the human immunodeficiency virus (HIV) or hepatitis B virus (HBV) when the commissioner has determined that it may be necessary to notify those patients that they may have been exposed to HIV or HBV.",
	"repealed": false
}