{
	"id": "352.272",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.272",
	"title": "352.272 STATE-AUTHORIZED PURCHASE OF SERVICE CREDIT FOR PERIODS OF MILITARY SERVICE.",
	"text": "(a) Unless prohibited under paragraph (b), an employee is eligible to purchase service credit, not to exceed five cumulative years of service credit, for one or more periods of service in the uniformed services, as defined in United States Code, title 38, section 4303(13), if:\n(1) the employee has at least three years of service credit with the general state employees retirement plan or the correctional state employees retirement plan under this chapter;\n(2) the duration of the employee's current period of employment is at least six months; and\n(3) one of the following applies:\n(i) the employee's service in the uniformed services occurred before becoming a state employee as defined in section 352.01, subdivision 2; or\n(ii) the employee did not obtain service credit for a period of military service under section 352.27.\n(b) A service credit purchase is prohibited if:\n(1) the employee separated from uniformed service with a dishonorable or bad conduct discharge or under other than honorable conditions; or\n(2) the employee has purchased or otherwise received service credit from any Minnesota public employee pension plan for the same period of service in the uniformed services.\n(c) When purchasing a period of service, if the period of service in the uniformed services is one year or less, then the employee must purchase the full period of service. If the period of service in the uniformed services is longer than one year, the employee may purchase the full period, not to exceed five cumulative years, or may purchase a portion of the period of service. If the employee purchases a portion of the period of service in the uniformed services, the portion must:\n(1) not be less than one year; and\n(2) be in increments of six months of service.\nTo purchase service credit under subdivision 1, an employee must apply to the executive director to make the purchase. The application must include all necessary documentation of the employee's qualifications to make the purchase, signed written permission to allow the executive director to request and receive necessary verification of applicable facts and eligibility requirements, and any other relevant information that the executive director may require. The employee must submit with the application payment of the administrative fee in the amount of $250 to cover the costs of calculating the purchase payment amount under section 356.551. If the employee proceeds with the purchase, the administrative fee will be credited toward the purchase payment amount.\n(a) The purchase payment amount is the amount determined under section 356.551 for the period or periods of service requested, except that, for purposes of calculating the purchase payment amount to purchase service credit for service in the uniformed services that occurred before becoming a state employee or between periods of employment as a state employee, section 356.551, subdivision 2, paragraph (c), does not apply.\n(b) Service credit must be granted by the applicable plan to the purchasing employee upon the executive director's receipt of the purchase payment amount. The service credit purchased under this section may not be used for the purpose of determining a disability benefit under section 352.113 or 352.95.\n(c) Payment must be made before the effective date of the employee's retirement.",
	"repealed": false
}