{
	"id": "256.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.01",
	"title": "256.01 COMMISSIONER OF HUMAN SERVICES; POWERS, DUTIES.",
	"text": "All the powers and duties now vested in or imposed upon the State Board of Control by the laws of this state or by any law of the United States are hereby transferred to, vested in, and imposed upon the commissioner of human services, except the powers and duties otherwise specifically transferred by Laws 1939, chapter 431, to other agencies. The commissioner of human services is hereby constituted the \"state agency\" as defined by the Social Security Act of the United States and the laws of this state, except for the purposes of Title IV of the Social Security Act.\nSubject to the provisions of section 241.021, subdivision 2, the commissioner of human services shall carry out the specific duties in paragraphs (a) through (bb):\n(a) Administer and supervise the forms of public assistance provided for by state law and other welfare activities or services that are vested in the commissioner. Administration and supervision of human services activities or services includes, but is not limited to, assuring timely and accurate distribution of benefits, completeness of service, and quality program management. In addition to administering and supervising human services activities vested by law in the department, the commissioner shall have the authority to:\n(1) require county agency participation in training and technical assistance programs to promote compliance with statutes, rules, federal laws, regulations, and policies governing human services;\n(2) monitor, on an ongoing basis, the performance of county agencies in the operation and administration of human services, enforce compliance with statutes, rules, federal laws, regulations, and policies governing welfare services and promote excellence of administration and program operation;\n(3) develop a quality control program or other monitoring program to review county performance and accuracy of benefit determinations;\n(4) require county agencies to make an adjustment to the public assistance benefits issued to any individual consistent with federal law and regulation and state law and rule and to issue or recover benefits as appropriate;\n(5) delay or deny payment of all or part of the state and federal share of benefits and administrative reimbursement according to the procedures set forth in section 256.017;\n(6) make contracts with and grants to public and private agencies and organizations, both profit and nonprofit, and individuals, using appropriated funds; and\n(7) enter into contractual agreements with federally recognized Indian Tribes with a reservation in Minnesota to the extent necessary for the Tribe to operate a federally approved family assistance program or any other program under the supervision of the commissioner. The commissioner shall consult with the affected county or counties in the contractual agreement negotiations, if the county or counties wish to be included, in order to avoid the duplication of county and Tribal assistance program services. The commissioner may establish necessary accounts for the purposes of receiving and disbursing funds as necessary for the operation of the programs.\nThe commissioner shall work in conjunction with the commissioner of children, youth, and families to carry out the duties of this paragraph when necessary and feasible.\n(b) Inform county agencies, on a timely basis, of changes in statute, rule, federal law, regulation, and policy necessary to county agency administration of the programs.\n(c) Administer and supervise all noninstitutional service to persons with disabilities, including persons who have vision impairments, and persons who are deaf, deafblind, and hard-of-hearing or with other disabilities. The commissioner may provide and contract for the care and treatment of qualified indigent children in facilities other than those located and available at state hospitals when it is not feasible to provide the service in state hospitals.\n(d) Assist and actively cooperate with other departments, agencies and institutions, local, state, and federal, by performing services in conformity with the purposes of Laws 1939, chapter 431.\n(e) Act as the agent of and cooperate with the federal government in matters of mutual concern relative to and in conformity with the provisions of Laws 1939, chapter 431, including the administration of any federal funds granted to the state to aid in the performance of any functions of the commissioner as specified in Laws 1939, chapter 431, and including the promulgation of rules making uniformly available medical care benefits to all recipients of public assistance, at such times as the federal government increases its participation in assistance expenditures for medical care to recipients of public assistance, the cost thereof to be borne in the same proportion as are grants of aid to said recipients.\n(f) Establish and maintain any administrative units reasonably necessary for the performance of administrative functions common to all divisions of the department.\n(g) Act as designated guardian of both the estate and the person of all the wards of the state of Minnesota, whether by operation of law or by an order of court, without any further act or proceeding whatever, except as to persons committed as developmentally disabled.\n(h) Act as coordinating referral and informational center on requests for service for newly arrived immigrants coming to Minnesota.\n(i) The specific enumeration of powers and duties as hereinabove set forth shall in no way be construed to be a limitation upon the general transfer of powers herein contained.\n(j) Establish county, regional, or statewide schedules of maximum fees and charges which may be paid by county agencies for medical, dental, surgical, hospital, nursing and nursing home care and medicine and medical supplies under all programs of medical care provided by the state and for congregate living care under the income maintenance programs.\n(k) Have the authority to conduct and administer experimental projects to test methods and procedures of administering assistance and services to recipients or potential recipients of public welfare. To carry out such experimental projects, it is further provided that the commissioner of human services is authorized to waive the enforcement of existing specific statutory program requirements, rules, and standards in one or more counties. The order establishing the waiver shall provide alternative methods and procedures of administration, shall not be in conflict with the basic purposes, coverage, or benefits provided by law, and in no event shall the duration of a project exceed four years. It is further provided that no order establishing an experimental project as authorized by the provisions of this section shall become effective until the following conditions have been met:\n(1) the United States Secretary of Health and Human Services has agreed, for the same project, to waive state plan requirements relative to statewide uniformity; and\n(2) a comprehensive plan, including estimated project costs, shall be approved by the Legislative Advisory Commission and filed with the commissioner of administration.\n(l) According to federal requirements and in coordination with the commissioner of children, youth, and families, establish procedures to be followed by local welfare boards in creating citizen advisory committees, including procedures for selection of committee members.\n(m) Allocate federal fiscal disallowances or sanctions which are based on quality control error rates for medical assistance in the following manner:\n(1) one-half of the total amount of the disallowance shall be borne by the county boards responsible for administering the programs. Disallowances shall be shared by each county board in the same proportion as that county's expenditures for the sanctioned program are to the total of all counties' expenditures for medical assistance. Each county shall pay its share of the disallowance to the state of Minnesota. When a county fails to pay the amount due hereunder, the commissioner may deduct the amount from reimbursement otherwise due the county, or the attorney general, upon the request of the commissioner, may institute civil action to recover the amount due; and\n(2) notwithstanding the provisions of clause (1), if the disallowance results from knowing noncompliance by one or more counties with a specific program instruction, and that knowing noncompliance is a matter of official county board record, the commissioner may require payment or recover from the county or counties, in the manner prescribed in clause (1), an amount equal to the portion of the total disallowance which resulted from the noncompliance, and may distribute the balance of the disallowance according to clause (1).\n(n) Develop and implement special projects that maximize reimbursements and result in the recovery of money to the state. For the purpose of recovering state money, the commissioner may enter into contracts with third parties. Any recoveries that result from projects or contracts entered into under this paragraph shall be deposited in the state treasury and credited to a special account until the balance in the account reaches $1,000,000. When the balance in the account exceeds $1,000,000, the excess shall be transferred and credited to the general fund. All money in the account is appropriated to the commissioner for the purposes of this paragraph.\n(o) Have the authority to establish and enforce the following county reporting requirements:\n(1) the commissioner shall establish fiscal and statistical reporting requirements necessary to account for the expenditure of funds allocated to counties for human services programs. When establishing financial and statistical reporting requirements, the commissioner shall evaluate all reports, in consultation with the counties, to determine if the reports can be simplified or the number of reports can be reduced;\n(2) the county board shall submit monthly or quarterly reports to the department as required by the commissioner. Monthly reports are due no later than 15 working days after the end of the month. Quarterly reports are due no later than 30 calendar days after the end of the quarter, unless the commissioner determines that the deadline must be shortened to 20 calendar days to avoid jeopardizing compliance with federal deadlines or risking a loss of federal funding. Only reports that are complete, legible, and in the required format shall be accepted by the commissioner;\n(3) if the required reports are not received by the deadlines established in clause (2), the commissioner may delay payments and withhold funds from the county board until the next reporting period. When the report is needed to account for the use of federal funds and the late report results in a reduction in federal funding, the commissioner shall withhold from the county boards with late reports an amount equal to the reduction in federal funding until full federal funding is received;\n(4) a county board that submits reports that are late, illegible, incomplete, or not in the required format for two out of three consecutive reporting periods is considered noncompliant. When a county board is found to be noncompliant, the commissioner shall notify the county board of the reason the county board is considered noncompliant and request that the county board develop a corrective action plan stating how the county board plans to correct the problem. The corrective action plan must be submitted to the commissioner within 45 days after the date the county board received notice of noncompliance;\n(5) the final deadline for fiscal reports or amendments to fiscal reports is one year after the date the report was originally due. If the commissioner does not receive a report by the final deadline, the county board forfeits the funding associated with the report for that reporting period and the county board must repay any funds associated with the report received for that reporting period;\n(6) the commissioner may not delay payments, withhold funds, or require repayment under clause (3) or (5) if the county demonstrates that the commissioner failed to provide appropriate forms, guidelines, and technical assistance to enable the county to comply with the requirements. If the county board disagrees with an action taken by the commissioner under clause (3) or (5), the county board may appeal the action according to sections 14.57 to 14.69; and\n(7) counties subject to withholding of funds under clause (3) or forfeiture or repayment of funds under clause (5) shall not reduce or withhold benefits or services to clients to cover costs incurred due to actions taken by the commissioner under clause (3) or (5).\n(p) Allocate federal fiscal disallowances or sanctions for audit exceptions when federal fiscal disallowances or sanctions are based on a statewide random sample in direct proportion to each county's claim for that period.\n(q) Be responsible for ensuring the detection, prevention, investigation, and resolution of fraudulent activities or behavior by applicants, recipients, and other participants in the human services programs administered by the department.\n(r) Require county agencies to identify overpayments, establish claims, and utilize all available and cost-beneficial methodologies to collect and recover these overpayments in the human services programs administered by the department.\n(s) Have the authority to administer the federal drug rebate program for drugs purchased under the medical assistance program as allowed by section 1927 of title XIX of the Social Security Act and according to the terms and conditions of section 1927. Rebates shall be collected for all drugs that have been dispensed or administered in an outpatient setting and that are from manufacturers who have signed a rebate agreement with the United States Department of Health and Human Services.\n(t) Have the authority to administer a supplemental drug rebate program for drugs purchased under the medical assistance program. The commissioner may enter into supplemental rebate contracts with pharmaceutical manufacturers and may require prior authorization for drugs that are from manufacturers that have not signed a supplemental rebate contract. Prior authorization of drugs shall be subject to the provisions of section 256B.0625, subdivision 13.\n(u) Operate the department's communication systems account established in Laws 1993, First Special Session chapter 1, article 1, section 2, subdivision 2, to manage shared communication costs necessary for the operation of the programs the commissioner supervises. Each account must be used to manage shared communication costs necessary for the operations of the programs the commissioner supervises. The commissioner may distribute the costs of operating and maintaining communication systems to participants in a manner that reflects actual usage. Costs may include acquisition, licensing, insurance, maintenance, repair, staff time and other costs as determined by the commissioner. Nonprofit organizations and state, county, and local government agencies involved in the operation of programs the commissioner supervises may participate in the use of the department's communications technology and share in the cost of operation. The commissioner may accept on behalf of the state any gift, bequest, devise or personal property of any kind, or money tendered to the state for any lawful purpose pertaining to the communication activities of the department. Any money received for this purpose must be deposited in the department's communication systems accounts. Money collected by the commissioner for the use of communication systems must be deposited in the state communication systems account and is appropriated to the commissioner for purposes of this section.\n(v) Receive any federal matching money that is made available through the medical assistance program for the consumer satisfaction survey. Any federal money received for the survey is appropriated to the commissioner for this purpose. The commissioner may expend the federal money received for the consumer satisfaction survey in either year of the biennium.\n(w) Designate community information and referral call centers and incorporate cost reimbursement claims from the designated community information and referral call centers into the federal cost reimbursement claiming processes of the department according to federal law, rule, and regulations. Existing information and referral centers provided by Greater Twin Cities United Way or existing call centers for which Greater Twin Cities United Way has legal authority to represent, shall be included in these designations upon review by the commissioner and assurance that these services are accredited and in compliance with national standards. Any reimbursement is appropriated to the commissioner and all designated information and referral centers shall receive payments according to normal department schedules established by the commissioner upon final approval of allocation methodologies from the United States Department of Health and Human Services Division of Cost Allocation or other appropriate authorities.\n(x) Develop recommended standards for adult foster care homes that address the components of specialized therapeutic services to be provided by adult foster care homes with those services.\n(y) Authorize the method of payment to or from the department as part of the human services programs administered by the department. This authorization includes the receipt or disbursement of funds held by the department in a fiduciary capacity as part of the human services programs administered by the department.\n(z) Designate the agencies that operate the Senior LinkAge Line under section 256.975, subdivision 7, and the Disability Hub under subdivision 24 as the state of Minnesota Aging and Disability Resource Center under United States Code, title 42, section 3001, the Older Americans Act Amendments of 2006, and incorporate cost reimbursement claims from the designated centers into the federal cost reimbursement claiming processes of the department according to federal law, rule, and regulations. Any reimbursement must be appropriated to the commissioner and treated consistent with section 256.011. All Aging and Disability Resource Center designated agencies shall receive payments of grant funding that supports the activity and generates the federal financial participation according to Board on Aging administrative granting mechanisms.\n[Repealed, 2013 c 107 art 4 s 22]\nThe commissioner shall develop and implement a pay-for-performance system to provide performance payments to eligible medical groups and clinics that demonstrate optimum care in serving individuals with chronic diseases who are enrolled in health care programs administered by the commissioner under chapters 256B and 256L. The commissioner may receive any federal matching money that is made available through the medical assistance program for managed care oversight contracted through vendors, including consumer surveys, studies, and external quality reviews as required by the federal Balanced Budget Act of 1997, Code of Federal Regulations, title 42, part 438-managed care, subpart E-external quality review. Any federal money received for managed care oversight is appropriated to the commissioner for this purpose. The commissioner may expend the federal money received in either year of the biennium.\nThe commissioner must consult with the commissioner of management and budget to create, review, and revise grant program performance measures and to evaluate grant programs administered by the commissioner in accordance with section 16A.055, subdivisions 1a and 1b.\n[Repealed, 2014 c 262 art 1 s 12]\n(a) The state agency shall:\n(1) in coordination with the commissioner of children, youth, and families, prescribe the form of and print and supply to the county agencies blanks for applications, reports, affidavits, and such other forms as it may deem necessary and advisable;\n(2) on or before October 1 in each even-numbered year make a biennial report to the governor concerning the activities of the agency;\n(3) enter into agreements with other departments of the state as necessary to meet all requirements of the federal government; and\n(4) require that the county or Tribal case manager for any person who is notified that their services will be terminated under section 245D.10, subdivision 3a, from residential supports and services as defined in section 245D.03, subdivision 1, paragraph (c), clause (3), develop an initial action plan within five business days of being notified of the termination; request technical assistance from the state agency; and proceed to promptly work to resolve the issues that led to the termination or arrange for alternative services as expeditiously as possible within the 60-day notice period.\n(b) The state agency may:\n(1) subpoena witnesses and administer oaths, make rules, and take such action as may be necessary or desirable for carrying out the provisions of Laws 1937, chapter 438. All rules made by the state agency shall be binding on the counties and shall be complied with by the respective county agencies; and\n(2) administer oaths and affirmations, take depositions, certify to official acts, and issue subpoenas to compel the attendance of individuals and the production of documents and other personal property necessary in connection with the administration of programs administered by, or for the purpose of any investigation, hearing, proceeding, or inquiry related to the duties and responsibilities of, the Department of Human Services.\n(c) The fees for service of a subpoena in paragraph (b), clause (2), must be paid in the same manner as prescribed by law for a service of process issued by a district court. Witnesses must receive the same fees and mileage as in civil actions.\n(d) The subpoena in paragraph (b), clause (2), shall be enforceable through the district court in the district where the subpoena is issued.\n(e) A subpoena issued under this subdivision must state that the person to whom the subpoena is directed may not disclose the fact that the subpoena was issued or the fact that the requested records have been given to law enforcement personnel or agents of the commissioner except:\n(1) insofar as the disclosure is necessary and agreed upon by the commissioner, to find and disclose the records; or\n(2) pursuant to court order.\nThe state agency shall provide appropriate technical assistance to county agencies to develop methods to have county financial workers remind and encourage recipients of aid to families with dependent children, Minnesota family investment program, the Minnesota family investment plan, medical assistance, family general assistance, or SNAP benefits whose assistance unit includes at least one child under the age of five to have each young child immunized against childhood diseases. The state agency must examine the feasibility of utilizing the capacity of a statewide computer system to assist county agency financial workers in performing this function at appropriate intervals.\nThe commissioner may receive and accept on behalf of patients and residents at the several state hospitals for persons with mental illness or developmental disabilities during the period of their hospitalization and while on provisional discharge therefrom, money due and payable to them as old age and survivors insurance benefits, veterans benefits, pensions or other such monetary benefits. Such gifts, contributions, pensions and benefits shall be deposited in and disbursed from the social welfare fund provided for in sections 256.88 to 256.92.\nThe commissioner may appoint advisory task forces to provide consultation on any of the programs under the commissioner's administration and supervision. A task force shall expire and the compensation, terms of office and removal of members shall be as provided in section 15.059. Notwithstanding section 15.059, the commissioner may pay a per diem of $35 to consumers and family members whose participation is needed in legislatively authorized state-level task forces, and whose participation on the task force is not as a paid representative of any agency, organization, or association.\nThe commissioner of human services may appoint a special consultant on aging in the classified service. Within the limits of appropriations available therefor, the commissioner may appoint such other employees in the classified service as the commissioner deems necessary to carry out the purposes of Laws 1961, chapter 466. Such special consultant and staff shall encourage cooperation among agencies, both public and private, including the departments of the state government, in providing services for the aging. They shall provide consultation to local social services agencies in developing local services for the aging, shall promote volunteer services programs and stimulate public interest in the problem of the aging.\nAny county or group of counties acting through its or their local social services agency or agencies may designate a county services coordinator who shall coordinate services and activities, both public and private, that may further the well being of the aging and meet their social, psychological, physical and economic needs. The coordinator shall perform such other duties as the agency may direct to stimulate, demonstrate, initiate, and coordinate local public, private, and voluntary services within the county dedicated to providing the maximum opportunities for self help, independence, and productivity of individuals concerned. The agency may appoint a citizens advisory committee which shall advise the coordinator and the agency on the development of services and perform such other functions at the county level as are prescribed for the Minnesota Board on Aging at the state level. The members shall serve without compensation. Members of citizens advisory committees required by federal law for programs for the aging who receive federal money in payment for a portion of their actual expenses incurred in performance of their duties may receive the remaining portion from state money appropriated for programs for the aging.\nThe board shall be provided staff assistance from the Department of Human Services through the special consultant on aging, who shall serve as the executive secretary to the board and its committees.\nThe Minnesota Board on Aging is authorized to accept through the Department of Human Services grants, gifts, and bequests from public or private sources for implementing programs and services on behalf of the aging, and to disburse funds to public and private agencies for the purpose of research, demonstration, planning, training, and service projects pertaining to the state's aging citizens.\nThe state agency may establish a system for the centralized disbursement of food coupons, assistance payments, and related documents. Benefits shall be issued by the state or county subject to section 256.017.\nThe state agency may contract with banks or other financial institutions to provide services associated with the processing of public assistance checks and may pay a service fee for these services, provided the fee charged does not exceed the fee charged to other customers of the institution for similar services.\n[Renumbered 142A.03, subd 7]\n[Renumbered 142A.03, subd 8]\n(a) The commissioner may establish a Department of Human Services systemic critical incident review team to review critical incidents reported as required under section 626.557 for which the Department of Human Services is responsible under section 626.5572, subdivision 13; chapter 245D; or Minnesota Rules, chapter 9544; or child fatalities and near fatalities that occur in licensed facilities and are not due to natural causes. When reviewing a critical incident, the systemic critical incident review team shall identify systemic influences to the incident rather than determine the culpability of any actors involved in the incident. The systemic critical incident review may assess the entire critical incident process from the point of an entity reporting the critical incident through the ongoing case management process. Department staff shall lead and conduct the reviews and may utilize county staff as reviewers. The systemic critical incident review process may include but is not limited to:\n(1) data collection about the incident and actors involved. Data may include the relevant critical services; the service provider's policies and procedures applicable to the incident; the community support plan as defined in section 245D.02, subdivision 4b, for the person receiving services; or an interview of an actor involved in the critical incident or the review of the critical incident. Actors may include:\n(i) staff of the provider agency;\n(ii) lead agency staff administering home and community-based services delivered by the provider;\n(iii) Department of Human Services staff with oversight of home and community-based services;\n(iv) Department of Health staff with oversight of home and community-based services;\n(v) members of the community including advocates, legal representatives, health care providers, pharmacy staff, or others with knowledge of the incident or the actors in the incident; and\n(vi) staff from the Office of the Ombudsman for Mental Health and Developmental Disabilities and the Office of Ombudsman for Long-Term Care;\n(2) systemic mapping of the critical incident. The team conducting the systemic mapping of the incident may include any actors identified in clause (1), designated representatives of other provider agencies, regional teams, and representatives of the local regional quality council identified in section 256B.097; and\n(3) analysis of the case for systemic influences.\nData collected by the critical incident review team shall be aggregated and provided to regional teams, participating regional quality councils, and the commissioner. The regional teams and quality councils shall analyze the data and make recommendations to the commissioner regarding systemic changes that would decrease the number and severity of critical incidents in the future or improve the quality of the home and community-based service system.\n(b) Cases selected for the systemic critical incident review process shall be selected by a selection committee among the following critical incident categories:\n(1) cases of caregiver neglect identified in section 626.5572, subdivision 17;\n(2) cases involving financial exploitation identified in section 626.5572, subdivision 9;\n(3) incidents identified in section 245D.02, subdivision 11;\n(4) behavior interventions identified in Minnesota Rules, part 9544.0110;\n(5) service terminations reported to the department in accordance with section 245D.10, subdivision 3a; and\n(6) other incidents determined by the commissioner.\n(c) The systemic critical incident review under this section shall not replace the process for screening or investigating cases of alleged maltreatment of an adult under section 626.557 or of a child under chapter 260E. The department may select cases for systemic critical incident review, under the jurisdiction of the commissioner, reported for suspected maltreatment and closed following initial or final disposition.\n(d) The proceedings and records of the review team are confidential data on individuals or protected nonpublic data as defined in section 13.02, subdivisions 3 and 13. Data that document a person's opinions formed as a result of the review are not subject to discovery or introduction into evidence in a civil or criminal action against a professional, the state, or a county agency arising out of the matters that the team is reviewing. Information, documents, and records otherwise available from other sources are not immune from discovery or use in a civil or criminal action solely because the information, documents, and records were assessed or presented during proceedings of the review team. A person who presented information before the systemic critical incident review team or who is a member of the team shall not be prevented from testifying about matters within the person's knowledge. In a civil or criminal proceeding, a person shall not be questioned about opinions formed by the person as a result of the review.\n(e) By October 1 of each year, the commissioner shall prepare an annual public report containing the following information:\n(1) the number of cases reviewed under each critical incident category identified in paragraph (b) and a geographical description of where cases under each category originated;\n(2) an aggregate summary of the systemic themes from the critical incidents examined by the critical incident review team during the previous year;\n(3) a synopsis of the conclusions, incident analyses, or exploratory activities taken in regard to the critical incidents examined by the critical incident review team; and\n(4) recommendations made to the commissioner regarding systemic changes that could decrease the number and severity of critical incidents in the future or improve the quality of the home and community-based service system.\n[See Note.]\n[Repealed, 2013 c 107 art 4 s 22]\n[Repealed, 2014 c 262 art 1 s 12]\n[Repealed, 2014 c 262 art 1 s 12]\n(a) The commissioner of human services may authorize projects to initiate tribal delivery of child welfare services to American Indian children and their parents and custodians living on the reservation. The commissioner has authority to solicit and determine which tribes may participate in a project. Grants may be issued to Minnesota Indian tribes to support the projects. The commissioner may waive existing state rules as needed to accomplish the projects. The commissioner may authorize projects to use alternative methods of (1) screening, investigating, and assessing reports of child maltreatment, and (2) administrative reconsideration, administrative appeal, and judicial appeal of maltreatment determinations, provided the alternative methods used by the projects comply with the provisions of section 256.045 and chapter 260E that deal with the rights of individuals who are the subjects of reports or investigations, including notice and appeal rights and data practices requirements. The commissioner shall only authorize alternative methods that comply with the public policy under section 260E.01. The commissioner may seek any federal approval necessary to carry out the projects as well as seek and use any funds available to the commissioner, including use of federal funds, foundation funds, existing grant funds, and other funds. The commissioner is authorized to advance state funds as necessary to operate the projects. Federal reimbursement applicable to the projects is appropriated to the commissioner for the purposes of the projects. The projects must be required to address responsibility for safety, permanency, and well-being of children.\n(b) For the purposes of this section, \"American Indian child\" means a person under 21 years old and who is a tribal member or eligible for membership in one of the tribes chosen for a project under this subdivision and who is residing on the reservation of that tribe.\n(c) In order to qualify for an American Indian child welfare project, a tribe must:\n(1) be one of the existing tribes with reservation land in Minnesota;\n(2) have a tribal court with jurisdiction over child custody proceedings;\n(3) have a substantial number of children for whom determinations of maltreatment have occurred;\n(4)(i) have capacity to respond to reports of abuse and neglect under chapter 260E; or (ii) have codified the tribe's screening, investigation, and assessment of reports of child maltreatment procedures, if authorized to use an alternative method by the commissioner under paragraph (a);\n(5) provide a wide range of services to families in need of child welfare services;\n(6) have a tribal-state title IV-E agreement in effect; and\n(7) enter into host Tribal contracts pursuant to section 256.0112, subdivision 6.\n(d) Grants awarded under this section may be used for the nonfederal costs of providing child welfare services to American Indian children on the tribe's reservation, including costs associated with:\n(1) assessment and prevention of child abuse and neglect;\n(2) family preservation;\n(3) facilitative, supportive, and reunification services;\n(4) out-of-home placement for children removed from the home for child protective purposes; and\n(5) other activities and services approved by the commissioner that further the goals of providing safety, permanency, and well-being of American Indian children.\n(e) When a tribe has initiated a project and has been approved by the commissioner to assume child welfare responsibilities for American Indian children of that tribe under this section, the affected county social service agency is relieved of responsibility for responding to reports of abuse and neglect under chapter 260E for those children during the time within which the tribal project is in effect and funded. The commissioner shall work with tribes and affected counties to develop procedures for data collection, evaluation, and clarification of ongoing role and financial responsibilities of the county and tribe for child welfare services prior to initiation of the project. Children who have not been identified by the tribe as participating in the project shall remain the responsibility of the county. Nothing in this section shall alter responsibilities of the county for law enforcement or court services.\n(f) Participating tribes may conduct children's mental health screenings under section 245.4874, subdivision 1, paragraph (a), clause (12), for children who are eligible for the initiative and living on the reservation and who meet one of the following criteria:\n(1) the child must be receiving child protective services;\n(2) the child must be in foster care; or\n(3) the child's parents must have had parental rights suspended or terminated.\nTribes may access reimbursement from available state funds for conducting the screenings. Nothing in this section shall alter responsibilities of the county for providing services under section 245.487.\n(g) Participating tribes may establish a local child mortality review panel. In establishing a local child mortality review panel, the tribe agrees to conduct local child mortality reviews for child deaths or near-fatalities occurring on the reservation under section 142A.03, subdivision 7. Tribes with established child mortality review panels shall have access to nonpublic data and shall protect nonpublic data under section 142A.03, subdivision 7, paragraphs (c) to (e). The tribe shall provide written notice to the commissioner and affected counties when a local child mortality review panel has been established and shall provide data upon request of the commissioner for purposes of sharing nonpublic data with members of the state child mortality review panel in connection to an individual case.\n(h) The commissioner shall collect information on outcomes relating to child safety, permanency, and well-being of American Indian children who are served in the projects. Participating tribes must provide information to the state in a format and completeness deemed acceptable by the state to meet state and federal reporting requirements.\n(i) In consultation with the White Earth Band, the commissioner shall develop and submit to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services a plan to transfer legal responsibility for providing child protective services to White Earth Band member children residing in Hennepin County to the White Earth Band. The plan shall include a financing proposal, definitions of key terms, statutory amendments required, and other provisions required to implement the plan. The commissioner shall submit the plan by January 15, 2012.\n[Renumbered 142A.03, subd 10]\nThe commissioner shall implement a procedure for public assistance applicants and recipients to identify a language preference other than English in order to receive information pertaining to the public assistance programs in that preferred language.\nWhen the commissioner transfers operational money between programs under section 16A.285, in addition to the requirements of that section the commissioner must provide the chairs of the legislative committees that have jurisdiction over the agency's budget with sufficient detail to identify the account to which the money was originally appropriated, and the account to which the money is being transferred.\n(a) Notwithstanding any waiver of this requirement by the secretary of the United States Department of Health and Human Services, the commissioner shall utilize the Systematic Alien Verification for Entitlements (SAVE) program to conduct immigration status verifications:\n(1) as required under United States Code, title 8, section 1642; and\n(2) for all applicants for general assistance, Minnesota supplemental aid, MinnesotaCare, or housing support under chapter 256I, when the benefits provided by these programs would fall under the definition of \"federal public benefit\" under United States Code, title 8, section 1642, if federal funds were used to pay for all or part of the benefits.\n(b) The commissioner shall comply with the reporting requirements under United States Code, title 42, section 611a, and any federal regulation or guidance adopted under that law.\n(a) The commissioner shall comply with the federal requirements in Public Law 110-379 in implementing the Public Assistance Reporting Information System (PARIS) to determine eligibility for all individuals applying for:\n(1) health care benefits under chapters 256B and 256L; and\n(2) public benefits under chapters 256D and 256I.\n(b) The commissioner shall determine eligibility under paragraph (a) by performing data matches, including matching with medical assistance, cash, child care, and supplemental assistance programs operated by other states.\n[Repealed, 2012 c 216 art 13 s 20]\n(a) The state court administrator shall provide a report every six months by electronic means to the commissioner of human services, including the name, address, date of birth, and, if available, driver's license or state identification card number, date of the sentence, effective date of the sentence, and county in which the conviction occurred, of each person convicted of a felony under chapter 152, except for convictions under section 152.0263 or 152.0264, during the previous six months.\n(b) The commissioner shall determine whether the individuals who are the subject of the data reported under paragraph (a) are receiving public assistance under chapter 142G or 256D, and if an individual is receiving assistance under chapter 142G or 256D, the commissioner shall instruct the county to proceed under section 142G.18 or 256D.024, whichever is applicable, for this individual.\n(c) The commissioner shall not retain any data received under paragraph (a) that does not relate to an individual receiving publicly funded assistance under chapter 142G or 256D.\n(a) The commissioner of public safety shall, on a monthly basis, provide the commissioner of human services with the first, middle, and last name, the address, date of birth, driver's license or state identification card number, and all photographs or electronically produced images of all applicants and holders whose drivers' licenses and state identification cards have been canceled under section 171.14, paragraph (a), clause (2) or (3), by the commissioner of public safety. After the initial data report has been provided by the commissioner of public safety to the commissioner of human services under this paragraph, subsequent reports shall only include cancellations that occurred after the end date of the cancellations represented in the previous data report.\n(b) The commissioner of human services shall compare the information provided under paragraph (a) with the commissioner's data regarding recipients of all public assistance programs managed by the Department of Human Services to determine whether any individual with multiple identification cards issued by the Department of Public Safety has illegally or improperly enrolled in any public assistance program managed by the Department of Human Services.\n(c) If the commissioner of human services determines that an applicant or recipient has illegally or improperly enrolled in any public assistance program, the commissioner shall provide all due process protections to the individual before terminating the individual from the program according to applicable statute and notifying the county attorney.\n(a) The commissioner of public safety shall, on a monthly basis, provide the commissioner of human services with the first, middle, and last name, and address, date of birth, and driver's license or state identification card number of all applicants and holders of drivers' licenses and state identification cards whose temporary legal presence date has expired and as a result the driver's license or identification card has been accordingly canceled under section 171.14 by the commissioner of public safety.\n(b) The commissioner of human services shall use the information provided under paragraph (a) to determine whether the eligibility of any recipients of public assistance programs managed by the Department of Human Services has changed as a result of the status change in the Department of Public Safety data.\n(c) If the commissioner of human services determines that a recipient has illegally or improperly received benefits from any public assistance program, the commissioner shall provide all due process protections to the individual before terminating the individual from the program according to applicable statute and notifying the county attorney.\nThe commissioner shall implement the Asset Verification System (AVS) according to Public Law 110-252, title VII, section 7001(d), to verify assets for an individual applying for or renewing health care benefits under section 256B.055, subdivision 7.\nThe commissioner may award grants to eligible vendors for the development, implementation, and evaluation of supportive services for individuals infected with the human immunodeficiency virus. HIV/AIDS supportive services will be provided to increase access to cost effective health care services, to reduce the risk of HIV transmission, to ensure that basic client needs are met, and to increase client access to needed community supports or services.\n(a) The commissioner shall act as the designated state agent for carrying out responsibilities required under Title II of the federal Ryan White Comprehensive AIDS Resources Emergency (CARE) Act. These responsibilities include:\n(1) coordinating statewide HIV/AIDS needs assessment activities;\n(2) developing the state's plan to meet identified health and support service needs of people living with HIV/AIDS;\n(3) administering federal funds designed to provide comprehensive health and support services to persons living with HIV/AIDS;\n(4) administering federal funds designated for the AIDS drug assistance program (ADAP);\n(5) collecting rebates from pharmaceutical manufacturers on drugs purchased with federal ADAP funds; and\n(6) utilizing ADAP rebate funds in accordance with guidelines of the federal Health Resources and Services Administration.\n(b) Rebates collected under this subdivision shall be deposited into the ADAP account in the special revenue fund and are appropriated to the commissioner for purposes of this subdivision.\nThe commissioner of human services shall amend the interagency agreement with the commissioner of health to certify nursing facilities for participation in the medical assistance program, to require the commissioner of health, as a condition of the agreement, to comply beginning July 1, 2005, with action plans included in the annual survey and certification quality improvement report required under section 144A.10, subdivision 17.\nThe commissioner of human services may contract directly with nonprofit organizations providing homeless services in two or more counties.\nMS 2010 [Expired, 2007 c 147 art 2 s 16; 2008 c 277 art 1 s 32]\n[Repealed, 2013 c 107 art 4 s 22]\nThe commissioner shall establish the Disability Hub, which shall serve people with disabilities as the designated Aging and Disability Resource Center under United States Code, title 42, section 3001, the Older Americans Act Amendments of 2006, in partnership with the Senior LinkAge Line and shall serve as Minnesota's neutral access point for statewide disability information and assistance and must be available during business hours through a statewide toll-free number and the Internet. The Disability Hub shall:\n(1) deliver information and assistance based on national and state standards;\n(2) provide information about state and federal eligibility requirements, benefits, and service options;\n(3) provide benefits and options counseling;\n(4) make referrals to appropriate support entities;\n(5) educate people on their options so they can make well-informed choices and link them to quality profiles;\n(6) help support the timely resolution of service access and benefit issues;\n(7) inform people of their long-term community services and supports;\n(8) provide necessary resources and supports that can lead to employment and increased economic stability of people with disabilities; and\n(9) serve as the technical assistance and help center for the web-based tool, Minnesota's Disability Benefits 101.org.\nNotwithstanding sections 16A.013 to 16A.016, the commissioner may accept, on behalf of the state, additional funding from sources other than state funds for the purpose of financing the cost of assistance program grants or nongrant administration. All additional funding is appropriated to the commissioner for use as designated by the grantor of funding.\nIn the event of disruption of technical systems or computer operations, the commissioner may use available grant appropriations to ensure continuity of payments for maintaining the health, safety, and well-being of clients served by programs administered by the Department of Human Services. Grant funds must be used in a manner consistent with the original intent of the appropriation.\nThe commissioner shall make state health care program applications and renewals available on the department's website in the most common foreign languages.\n(a) The commissioner has the authority to join and participate as a member in a legal entity developing and operating a statewide health information exchange or to develop and operate an encounter alerting service that shall meet the following criteria:\n(1) the legal entity must meet all constitutional and statutory requirements to allow the commissioner to participate; and\n(2) the commissioner or the commissioner's designated representative must have the right to participate in the governance of the legal entity under the same terms and conditions and subject to the same requirements as any other member in the legal entity and in that role shall act to advance state interests and lessen the burdens of government.\n(b) Notwithstanding chapter 16C, the commissioner may pay the state's prorated share of development-related expenses of the legal entity retroactively from October 29, 2007, regardless of the date the commissioner joins the legal entity as a member.\n(a) To ensure the timely processing of determinations of disability by the commissioner's state medical review team under sections 256B.055, subdivisions 7, paragraph (b), and 12, and 256B.057, subdivision 9, the commissioner shall review all medical evidence and seek information from providers, applicants, and enrollees to support the determination of disability where necessary. Disability shall be determined according to the rules of title XVI and title XIX of the Social Security Act and pertinent rules and policies of the Social Security Administration.\n(b) Prior to a denial or withdrawal of a requested determination of disability due to insufficient evidence, the commissioner shall (1) ensure that the missing evidence is necessary and appropriate to a determination of disability, and (2) assist applicants and enrollees to obtain the evidence, including, but not limited to, medical examinations and electronic medical records.\n(c) Any appeal made under section 256.045, subdivision 3, of a disability determination made by the state medical review team must be decided according to the timelines under section 256.0451, subdivision 22, paragraph (a). If a written decision is not issued within the timelines under section 256.0451, subdivision 22, paragraph (a), the appeal must be immediately reviewed by the chief human services judge.\nMS 2022 [Repealed, 2024 c 80 art 1 s 97]\nMS 2020 [Repealed, 2022 c 98 art 14 s 33]\n[Repealed, 2014 c 291 art 10 s 14]\n(a) When the commissioner enters into a contingency-based contract for the purpose of recovering medical assistance or MinnesotaCare funds, the commissioner may retain that portion of the recovered funds equal to the amount of the contingency fee.\n(b) Amounts attributed to new recoveries under this subdivision are appropriated to the commissioner to the extent they fulfill the payment terms of the contract with the vendor and shall be deposited into an account in a fund other than the general fund for purposes of fulfilling the terms of the vendor contract.\nFederal administrative reimbursement resulting from the following activities is appropriated to the commissioner for the designated purposes:\n(1) reimbursement for the Minnesota senior health options project; and\n(2) reimbursement related to prior authorization, review of medical necessity, and inpatient admission certification by a professional review organization. A portion of these funds must be used for activities to decrease unnecessary pharmaceutical costs in medical assistance.\n[Repealed, 2015 c 71 art 11 s 65]\n[Renumbered 142A.03, subd 22]\nThe commissioner may transfer appropriations to, and account for DHS receipt center operations in, the special revenue fund.\nThe commissioner may enter into a contract with a national organization to match recipient third-party liability information and provide coverage and insurance primacy information to the department at no charge to providers and the clearinghouses.\nMS 2022 [Repealed, 2024 c 108 art 6 s 6]\nThe nonfederal share of activities for which federal administrative reimbursement is appropriated to the commissioner may be transferred to the special revenue fund.\n(a) Beginning October 31, 2024, and annually thereafter, the commissioner of human services shall provide a report to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance on:\n(1) interagency agreements or service-level agreements and any renewals or extensions of existing interagency or service-level agreements with a state department under section 15.01, state agency under section 15.012, or the Department of Information Technology Services, with a value of more than $100,000, or related agreements with the same department or agency with a cumulative value of more than $100,000; and\n(2) transfers of appropriations of more than $100,000 between accounts within or between agencies.\nThe report must include the statutory citation authorizing the agreement, transfer or dollar amount, purpose, and effective date of the agreement, the duration of the agreement, and a copy of the agreement.\n(b) This subdivision expires December 31, 2034.\n(a) If the submission of a report by the commissioner of human services to the legislature is mandated by statute and the enabling legislation does not include a date for the submission of a final report or an expiration date, the mandate to submit the report shall expire in accordance with this section.\n(b) If the mandate requires the submission of an annual or more frequent report and the mandate was enacted before January 1, 2021, the mandate shall expire on January 1, 2023. If the mandate requires the submission of a biennial or less frequent report and the mandate was enacted before January 1, 2021, the mandate shall expire on January 1, 2024.\n(c) Any reporting mandate enacted on or after January 1, 2021, shall expire three years after the date of enactment if the mandate requires the submission of an annual or more frequent report and shall expire five years after the date of enactment if the mandate requires the submission of a biennial or less frequent report unless the enacting legislation provides for a different expiration date.\n(d) By January 15 of each year, the commissioner shall submit a list of all reports set to expire during the following calendar year to the chairs and ranking minority members of the legislative committees with jurisdiction over human services. Notwithstanding paragraph (c), this paragraph does not expire.\nThe commissioner shall require hospitals and primary care providers serving medical assistance and MinnesotaCare enrollees to develop and implement protocols to provide enrollees, when appropriate, with comprehensive and scientifically accurate information on the full range of contraceptive options, in a medically ethical, culturally competent, and noncoercive manner. The information provided must be designed to assist enrollees in identifying the contraceptive method that best meets their needs and the needs of their families. The protocol must specify the enrollee categories to which this requirement will be applied, the process to be used, and the information and resources to be provided. Hospitals and providers must make this protocol available to the commissioner upon request.",
	"repealed": false
}