{
	"id": "13.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.43",
	"title": "13.43 PERSONNEL DATA.",
	"text": "As used in this section, \"personnel data\" means government data on individuals maintained because the individual is or was an employee of or an applicant for employment by, performs services on a voluntary basis for, or acts as an independent contractor with a government entity.\n(a) Except for employees described in subdivision 5 and subject to the limitations described in subdivision 5a, the following personnel data on current and former employees, volunteers, and independent contractors of a government entity is public:\n(1) name; employee identification number, which must not be the employee's Social Security number; actual gross salary; salary range; terms and conditions of employment relationship; contract fees; actual gross pension; the value and nature of employer paid fringe benefits; and the basis for and the amount of any added remuneration, including expense reimbursement, in addition to salary;\n(2) job title and bargaining unit; job description; education and training background; and previous work experience;\n(3) date of first and last employment;\n(4) the existence and status of any complaints or charges against the employee, regardless of whether the complaint or charge resulted in a disciplinary action;\n(5) the final disposition of any disciplinary action together with the specific reasons for the action and data documenting the basis of the action, excluding data that would identify confidential sources who are employees of the public body;\n(6) the complete terms of any agreement settling any dispute arising out of an employment relationship, including a buyout agreement as defined in section 123B.143, subdivision 2, paragraph (a); except that the agreement must include specific reasons for the agreement if it involves the payment of more than $10,000 of public money;\n(7) work location; a work telephone number; badge number; work-related continuing education; and honors and awards received; and\n(8) payroll time sheets or other comparable data that are only used to account for employee's work time for payroll purposes, except to the extent that release of time sheet data would reveal the employee's reasons for the use of sick or other medical leave or other not public data.\n(b) For purposes of this subdivision, a final disposition occurs when the government entity makes its final decision about the disciplinary action, regardless of the possibility of any later proceedings or court proceedings. Final disposition includes a resignation by an individual when the resignation occurs after the final decision of the government entity, or arbitrator. In the case of arbitration proceedings arising under collective bargaining agreements, a final disposition occurs at the conclusion of the arbitration proceedings, or upon the failure of the employee to elect arbitration within the time provided by the collective bargaining agreement. A disciplinary action does not become public data if an arbitrator sustains a grievance and reverses all aspects of any disciplinary action.\n(c) The government entity may display a photograph of a current or former employee to a prospective witness as part of the government entity's investigation of any complaint or charge against the employee.\n(d) A complainant has access to a statement provided by the complainant to a government entity in connection with a complaint or charge against an employee.\n(e) Notwithstanding paragraph (a), clause (5), and subject to paragraph (f), upon completion of an investigation of a complaint or charge against a public official, or if a public official resigns or is terminated from employment while the complaint or charge is pending, all data relating to the complaint or charge are public, unless access to the data would jeopardize an active investigation or reveal confidential sources. For purposes of this paragraph, \"public official\" means:\n(1) the head of a state agency and deputy and assistant state agency heads;\n(2) members of boards or commissions required by law to be appointed by the governor or other elective officers;\n(3) executive or administrative heads of departments, bureaus, divisions, or institutions within state government; and\n(4) the following employees:\n(i) the chief administrative officer, or the individual acting in an equivalent position, in all political subdivisions;\n(ii) individuals required to be identified by a political subdivision pursuant to section 471.701;\n(iii) in a city with a population of more than 7,500 or a county with a population of more than 5,000: managers; chiefs; heads or directors of departments, divisions, bureaus, or boards; and any equivalent position; and\n(iv) in a school district: business managers; human resource directors; athletic directors whose duties include at least 50 percent of their time spent in administration, personnel, supervision, and evaluation; chief financial officers; directors; individuals defined as superintendents and principals under Minnesota Rules, part 3512.0100; and in a charter school, individuals employed in comparable positions.\n(f) Data relating to a complaint or charge against an employee identified under paragraph (e), clause (4), are public only if:\n(1) the complaint or charge results in disciplinary action or the employee resigns or is terminated from employment while the complaint or charge is pending; or\n(2) potential legal claims arising out of the conduct that is the subject of the complaint or charge are released as part of a settlement agreement.\nThis paragraph and paragraph (e) do not authorize the release of data that are made not public under other law.\nNotwithstanding any law to the contrary, with respect to data collected and maintained on members, survivors, and beneficiaries by statewide retirement systems that is classified as public data in accordance with subdivision 2, those retirement systems may be only required to disclose name, gross pension, and type of benefit awarded, except as required by sections 13.03, subdivisions 4 and 6; and 13.05, subdivisions 4 and 9.\nExcept for applicants described in subdivision 5, the following personnel data on current and former applicants for employment by a government entity is public: veteran status; relevant test scores; rank on eligible list; job history; education and training; and work availability. Names of applicants shall be private data except when certified as eligible for appointment to a vacancy or when applicants are considered by the appointing authority to be finalists for a position in public employment. For purposes of this subdivision, \"finalist\" means an individual who is selected to be interviewed by the appointing authority prior to selection.\nAll other personnel data is private data on individuals but may be released pursuant to a court order. Data pertaining to an employee's dependents are private data on individuals.\nAll personnel data maintained by a government entity relating to an individual employed as or an applicant for employment as an undercover law enforcement officer are private data on individuals. When the individual is no longer assigned to an undercover position, the data described in subdivisions 2 and 3 become public unless the law enforcement agency determines that revealing the data would threaten the personal safety of the officer or jeopardize an active investigation.\nNotwithstanding any other provision of this section, the following data relating to employees of a secure treatment facility defined in section 253B.02, subdivision 18a, employees of a state correctional facility, or employees of the Department of Corrections directly involved in supervision of offenders in the community, shall not be disclosed to facility patients, corrections inmates, or other individuals who facility or correction administrators reasonably believe will use the information to harass, intimidate, or assault any of these employees: place where previous education or training occurred; place of prior employment; and payroll timesheets or other comparable data, to the extent that disclosure of payroll timesheets or other comparable data may disclose future work assignments, home address or telephone number, the location of an employee during nonwork hours, or the location of an employee's immediate family members.\n(a) Notwithstanding classification by any other provision of this chapter upon request from an exclusive representative, personnel data must be disseminated to labor organizations and the Public Employment Relations Board to the extent necessary to conduct elections, investigate and process grievances, and implement the provisions of chapters 179 and 179A.\n(b) Personnel data shall be disseminated to labor organizations, the Public Employment Relations Board, and the Bureau of Mediation Services to the extent the dissemination is ordered or authorized by the commissioner of the Bureau of Mediation Services or the Public Employment Relations Board or its employees or agents. Employee Social Security numbers are not necessary to implement the provisions of chapters 179 and 179A.\n(c) Personnel data described under section 179A.07, subdivision 8, must be disseminated to an exclusive representative under the terms of that subdivision.\n(d) An employer who disseminates personnel data to a labor organization pursuant to this subdivision shall not be subject to liability under section 13.08. Nothing in this paragraph shall impair or limit any remedies available under section 325E.61.\n(e) The home addresses, nonemployer issued phone numbers and email addresses, dates of birth, and emails or other communications between exclusive representatives and their members, prospective members, and nonmembers are private data on individuals.\nAll data created, collected or maintained by a government entity to administer employee assistance programs similar to the one authorized by section 43A.319 are classified as private, pursuant to section 13.02, subdivision 12. This section shall not be interpreted to authorize the establishment of employee assistance programs.\nPersonnel data includes data submitted by an employee to a government entity as part of an organized self-evaluation effort by the government entity to request suggestions from all employees on ways to cut costs, make government more efficient, or improve the operation of government. An employee who is identified in a suggestion shall have access to all data in the suggestion except the identity of the employee making the suggestion.\nWhen allegations of sexual or other types of harassment are made against an employee, the employee does not have access to data that would identify the complainant or other witnesses if the responsible authority determines that the employee's access to that data would:\n(1) threaten the personal safety of the complainant or a witness; or\n(2) subject the complainant or witness to harassment.\nIf a disciplinary proceeding is initiated against the employee, data on the complainant or witness shall be available to the employee as may be necessary for the employee to prepare for the proceeding.\n(a) Data acquired by a peer support counselor when providing public safety peer counseling are governed by section 181.9731.\n(b) For purposes of this subdivision:\n(1) \"peer support counselor\" has the meaning given in section 181.9731, subdivision 1, paragraph (c); and\n(2) \"public safety peer counseling\" has the meaning given in section 181.9731, subdivision 1, paragraph (d).\n(a) Data acquired by a critical incident stress management team member when providing critical incident stress management services are governed by section 181.9732.\n(b) For purposes of this subdivision:\n(1) \"critical incident stress management services\" has the meaning given in section 181.9732, subdivision 1, paragraph (c); and\n(2) \"critical incident stress management team member\" has the meaning given in section 181.9732, subdivision 1, paragraph (e).\n(a) A government entity may not enter into an agreement settling a dispute arising out of the employment relationship with the purpose or effect of limiting access to or disclosure of personnel data or limiting the discussion of information or opinions related to personnel data. An agreement or portion of an agreement that violates this paragraph is void and unenforceable.\n(b) Paragraph (a) applies to the following, but only to the extent that the data or information could otherwise be made accessible to the public:\n(1) an agreement not to discuss, publicize, or comment on personnel data or information;\n(2) an agreement that limits the ability of the subject of personnel data to release or consent to the release of data; or\n(3) any other provision of an agreement that has the effect of limiting the disclosure or discussion of information that could otherwise be made accessible to the public, except a provision that limits the ability of an employee to release or discuss private data that identifies other employees.\n(c) Paragraph (a) also applies to a court order that contains terms or conditions prohibited by paragraph (a).\n(a) If the responsible authority or designee of a government entity reasonably determines that the release of personnel data is necessary to protect an employee from harm to self or to protect another person who may be harmed by the employee, data that are relevant to the concerns for safety may be released as provided in this subdivision.\n(b) The data may be released:\n(1) to the person who may be harmed and to an attorney representing the person when the data are relevant to obtaining a restraining order;\n(2) to a prepetition screening team conducting an investigation of the employee under section 253B.07, subdivision 1; or\n(3) to a court, law enforcement agency, or prosecuting authority.\n(c) Section 13.03, subdivision 4, paragraph (c), applies to data released under this subdivision, except to the extent that the data have a more restrictive classification in the possession of the agency or authority that receives the data. If the person who may be harmed or the person's attorney receives data under this subdivision, the data may be used or released further only to the extent necessary to protect the person from harm.\nA law enforcement agency shall share data from a background investigation done under section 626.87 with the Peace Officer Standards and Training Board or with a law enforcement agency doing an investigation of the subject of the data under section 626.87.\nPrivate personnel data must be disclosed to the Department of Employment and Economic Development for the purpose of administration of the unemployment benefits program under chapter 268.\n(a) When a report of alleged maltreatment of a student in a school facility, as defined in section 260E.03, subdivision 6, is made to the commissioner of education under chapter 260E, data that are relevant to a report of maltreatment and are collected by the school facility about the person alleged to have committed maltreatment must be provided to the commissioner of education upon request for purposes of an assessment or investigation of the maltreatment report. Data received by the commissioner of education pursuant to these assessments or investigations are classified under chapter 260E.\n(b) Personnel data may be released for purposes of providing information to a parent, legal guardian, or custodian of a child under section 260E.15.\nPrivate personnel data, or data on employees that are confidential data under section 13.39, may be disseminated to a law enforcement agency for the purpose of reporting a crime or alleged crime committed by an employee, or for the purpose of assisting law enforcement in the investigation of a crime committed or allegedly committed by an employee.\nThe superintendent of a school district or the superintendent's designee, or a person having administrative control of a charter school, must release to a requesting school district or charter school private personnel data on a current or former employee related to acts of violence toward or sexual contact with a student, if:\n(1) an investigation conducted by or on behalf of the school district or law enforcement affirmed the allegations in writing prior to release and the investigation resulted in the resignation of the subject of the data; or\n(2) the employee resigned while a complaint or charge involving the allegations was pending, the allegations involved acts of sexual contact with a student, and the employer informed the employee in writing, before the employee resigned, that if the employee resigns while the complaint or charge is still pending, the employer must release private personnel data about the employee's alleged sexual contact with a student to a school district or charter school requesting the data after the employee applies for employment with that school district or charter school and the data remain classified as provided in chapter 13.\nData that are released under this subdivision must not include data on the student.\nPersonal home contact information may be used to ensure that an employee can be reached in the event of an emergency or other disruption affecting continuity of operation of a government entity. An employee's personal home contact information may be shared with another government entity in the event of an emergency or other disruption to ensure continuity of operation of either government entity.\nPrivate personnel data of state employees must be disclosed to the Department of Administration for the purpose of administration of the workers' compensation program as provided in chapter 176.\nThe following data maintained as a result of a contractual relationship entered on or after August 1, 2012, between a government entity and a contractor or subcontractor are private: the personal telephone number, home address, and email address of a current or former employee of the contractor or subcontractor. A government entity maintaining data under this subdivision must share the data with another government entity to perform a function authorized by law. The data must be disclosed to a government entity or any person for prevailing wage purposes.",
	"repealed": false
}