{
	"id": "48.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.92",
	"title": "48.92 DEFINITIONS.",
	"text": "When used in sections 48.90 to 48.99, the terms defined in this section have the meanings given them, unless their context requires a different meaning.\n\"Control,\" with respect to a bank holding company, bank, or bank to be organized pursuant to chapters 46, 47, 48, and 300, means that term as defined in section 46.048, subdivision 1.\n\"Bank\" means any bank, or bank and trust company which is now or may hereafter be organized under the laws of this state that is an insured institution as the term is defined in section 3(h) of the Federal Deposit Insurance Act, United States Code, title 12, section 1813(h), that:\n(1) accepts deposits that the depositor has a legal right to withdraw on demand; and\n(2) engages in the business of making commercial loans.\n\"Commissioner\" means the commissioner of commerce of the state of Minnesota.\n\"Department\" means the Department of Commerce of the state of Minnesota.\n\"Home state\" means: (1) with respect to a national bank, the state in which the main office of the bank is located; (2) with respect to a state bank, the state by which the bank is chartered; and (3) with respect to a bank holding company, the state in which the total deposits of all banking subsidiaries of the company are the largest on the later of (i) July 1, 1966, or (ii) the date on which the company becomes a bank holding company under the Bank Holding Company Act of 1956, as amended, United States Code, title 12, section 1842.\n\"Host state\" is a state other than the home state of the bank holding company, in which the company controls, or seeks to control, a bank subsidiary.\n\"Out-of-state bank holding company\" means a bank holding company as defined in the Bank Holding Company Act of 1956, as amended, whose home state is a state other than Minnesota.\n\"Interstate bank holding company\" means (a) a bank holding company whose home state is Minnesota and that is engaging in interstate banking, and (b) an out-of-state bank holding company engaged in banking in this state.\n\"Equity capital\" means the sum of common stock, preferred stock, paid in surplus, reserves for loss loans and undivided profits.\n\"Out-of-state bank\" means a bank whose home state is other than Minnesota.",
	"repealed": false
}