{
	"id": "116J.659",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.659",
	"title": "116J.659 CANNABIS INDUSTRY STARTUP FINANCING GRANTS.",
	"text": "The commissioner of employment and economic development shall establish CanStartup, a program to award grants to nonprofit corporations to fund loans to new cannabis microbusinesses and to support job creation in communities where long-term residents are eligible to be social equity applicants.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Cannabis microbusiness\" means a cannabis business that meets the requirements of section 342.28.\n(c) \"Commissioner\" means the commissioner of employment and economic development.\n(d) \"Industry\" means the legal cannabis industry in the state of Minnesota.\n(e) \"New business\" means a legal cannabis business that has been in existence for three years or less.\n(f) \"Program\" means the CanStartup grant program.\n(g) \"Social equity applicant\" means a person who meets the qualification requirements in section 342.17.\n(a) The CanStartup revolving loan account is established in the special revenue fund. Money in the account, including interest, is appropriated to the commissioner to make grants under the CanStartup program.\n(b) The commissioner must award grants to nonprofit corporations through a competitive grant process.\n(c) To receive grant money, a nonprofit corporation must submit a written application to the commissioner using a form developed by the commissioner.\n(d) In awarding grants under this subdivision, the commissioner shall give weight to whether the nonprofit corporation:\n(1) has a board of directors that includes citizens experienced in business and community development, new business enterprises, and creating jobs for people facing barriers to education or employment;\n(2) has the technical skills to analyze projects;\n(3) is familiar with other available public and private funding sources and economic development programs;\n(4) can initiate and implement economic development projects;\n(5) can establish and administer a revolving loan account;\n(6) can work with job referral networks that assist people facing barriers to education or employment; and\n(7) has established relationships with communities where long-term residents are eligible to be social equity applicants.\nThe commissioner shall make grants that will assist new cannabis microbusinesses.\n(e) A nonprofit corporation that receives a grant under the program must:\n(1) establish a commissioner-certified revolving loan account for the purpose of making eligible loans; and\n(2) enter into an agreement with the commissioner that the commissioner shall fund loans that the nonprofit corporation makes to new cannabis microbusinesses. The commissioner shall review existing agreements with nonprofit corporations every five years and may renew or terminate an agreement based on that review. In making this review, the commissioner shall consider, among other criteria, the criteria in paragraph (d).\n(a) The criteria in this subdivision apply to loans made by nonprofit corporations under the program.\n(b) Loans must be used to support a new cannabis microbusiness in the legal cannabis industry. Priority must be given to loans to businesses owned by individuals who are eligible to be social equity applicants and businesses located in communities where long-term residents are eligible to be social equity applicants.\n(c) Loans must be made to cannabis microbusinesses that are not likely to undertake the project for which loans are sought without assistance from the program.\n(d) The minimum state contribution to a loan is $2,500 and the maximum is either:\n(1) $50,000; or\n(2) $150,000, if state contributions are matched by an equal or greater amount of new private investment.\n(e) Loan applications given preliminary approval by the nonprofit corporation must be forwarded to the commissioner for approval. The commissioner must give final approval for each loan made by the nonprofit corporation under the program.\n(f) A cannabis microbusiness that receives a loan may apply to renew the loan. Renewal applications must be made on an annual basis and a cannabis microbusiness may receive loans for up to six consecutive years. A nonprofit corporation may renew a loan to a cannabis microbusiness that is no longer a new business provided the business would otherwise qualify for an initial loan and is in good standing with the nonprofit corporation and the commissioner. A nonprofit corporation may adjust the amount of a renewed loan, or not renew a loan, if the nonprofit corporation determines that the cannabis microbusiness is financially stable and is substantially likely to continue the project for which the loan renewal is sought.\n(g) If a borrower has met lender criteria, including being current with all payments for a minimum of three years, the commissioner may approve either full or partial forgiveness of interest or principal amounts.\n(a) The commissioner shall establish a minimum interest rate for loans or guarantees to ensure that necessary loan administration costs are covered. The interest rate charged by a nonprofit corporation for a loan under this section must not exceed the Wall Street Journal prime rate. For a loan under this section, the nonprofit corporation may charge a loan origination fee equal to or less than one percent of the loan value. The nonprofit corporation may retain the amount of the origination fee.\n(b) Loan repayment of principal must be paid to the commissioner for deposit in the CanStartup revolving loan account. Loan interest payments must be deposited in a revolving loan account created by the nonprofit corporation originating the loan being repaid for further distribution or use, consistent with the criteria of this section.\n(c) Administrative expenses of the nonprofit corporations with whom the commissioner enters into agreements, including expenses incurred by a nonprofit corporation in providing financial, technical, managerial, and marketing assistance to a business receiving a loan under this section, are eligible program expenses the commissioner may agree to pay under the grant agreement.\nThe commissioner shall make extensive efforts to publicize this program, including through partnerships with community organizations, particularly those organizations located in areas where long-term residents are eligible to be social equity applicants.\n(a) A nonprofit corporation that receives a grant shall:\n(1) submit an annual report to the commissioner by February 1 of each year that the nonprofit corporation participates in the program that includes a description of businesses supported by the grant program, an account of loans made during the calendar year, the program's impact on business creation and job creation, particularly in communities where long-term residents are eligible to be social equity applicants, the source and amount of money collected and distributed by the program, the program's assets and liabilities, and an explanation of administrative expenses; and\n(2) provide for an independent annual audit to be performed in accordance with generally accepted accounting practices and auditing standards and submit a copy of each annual audit report to the commissioner.\n(b) By March 1, 2024, and each March 1 thereafter, the commissioner must submit a report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over economic development that details awards given through the CanStartup program and the use of grant money, including any measures of success toward financing new cannabis microbusinesses and creating jobs in communities where long-term residents are eligible to be social equity applicants.",
	"repealed": false
}