{
	"id": "115E.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/115E.01",
	"title": "115E.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter. Terms that are not defined have the meanings given in the Oil Pollution Act of 1990.\n\"Agricultural chemical\" has the meaning given in section 18D.01, subdivision 3.\n\"Commissioners\" means the commissioner of public safety and\n(1) the commissioner of agriculture, with respect to agricultural chemicals; or\n(2) the commissioner of the Pollution Control Agency, with respect to other hazardous substances and oil.\n\"Damages\" means damages of any kind for which liability may exist under the laws of this state resulting from, arising out of, or related to the discharge or threatened discharge of hazardous substances or oil.\n\"Discharge\" means an intentional or unintentional emission, other than natural seepage, and includes, but is not limited to, spilling, leaking, pumping, pouring, emitting, emptying, or dumping; and also includes release as defined in section 115B.02, subdivision 15.\n\"Facility\" means a structure, group of structures, equipment, or device, other than a vessel, that is used for one or more of the following purposes: exploring for, drilling for, producing, storing, handling, transferring, processing, or transporting oil or a hazardous substance. Facility includes a motor vehicle, rolling stock, or pipeline used for one or more of these purposes. A facility may be in, on, or under land, or in, on, or under waters of the state as defined in section 115.01, subdivision 22.\n\"Hazardous substance\" has the meaning given in section 115B.02, subdivision 8.\n\"Incident commander\" means the official at the site of a discharge who has the responsibility for operations at the site, as established following National Incident Management System guidelines.\n\"Lead agency\" means:\n(1) the Department of Agriculture, with respect to agricultural chemicals; or\n(2) the Pollution Control Agency, for other hazardous substances or oil.\n\"Listed sensitive area\" means an area or location listed as an area of special economic or environmental importance in an Area Contingency Plan or a Sub-Area Contingency Plan prepared under the federal Clean Water Act, United States Code, title 33, section 1321(j)(4).\n\"Oil\" means oil of any kind or in any form including, but not limited to, petroleum, fuel oil, sludge, oil refuse, and oil mixed with wastes other than dredged spoils; and also includes petroleum as defined in section 115C.02, subdivision 10.\n\"Oil Pollution Act of 1990\" means the Oil Pollution Act of 1990, Statutes at Large, volume 104, pages 484 to 575.\n\"Person\" has the meaning given in section 115B.02, subdivision 12.\n\"Response\" has the meaning given in section 115B.02, subdivision 18, and the meaning of corrective action given in section 115C.02, subdivision 4. Response includes restoration, rehabilitation, replacement, or acquisition of the equivalent of the natural resources affected by the discharge of hazardous substances or oil.\n\"Response area\" means the area designated by the federal on-scene coordinator, the commissioner of the Pollution Control Agency, or the commissioner of agriculture in which response to a discharge is occurring.\n\"Response costs\" means the costs of response that are incurred after a discharge of oil or hazardous substances has occurred, or, where there is a substantial threat of discharge of oil or hazardous substances, the costs to prevent, minimize, or mitigate a discharge.\n\"Responsible party\" means a responsible party as defined in section 1001 of the Oil Pollution Act of 1990.\n\"Unit train\" means a train with more than 25 tanker railcars carrying oil or hazardous substance cargo.\n\"Vessel\" means a watercraft or other artificial contrivance used, or capable of being used, as a means of transportation on water. It includes a vessel that is constructed or adapted to carry, or that carried, oil or hazardous substances in bulk as cargo or cargo residue.\n\"Worst case discharge\" means:\n(1) in the case of a vessel, sudden loss of the entire contents of the vessel in weather conditions that impede cleanup;\n(2) for each tank of a storage tank facility, sudden loss of the entire contents of the tank in weather conditions that impede cleanup;\n(3) in the case of railroad rolling stock facilities, sudden loss of the contents of the maximum expected number of the railcars containing oil or hazardous substance of a train onto land or into water in weather conditions that impede cleanup;\n(4) in the case of truck and trailer rolling stock facilities, sudden loss of the entire contents of the truck or trailer onto land or into water in weather conditions that impede cleanup;\n(5) in the case of a pipeline facility, sudden loss of the contents of the pipeline which would be expected from complete failure of the pipeline onto land or into water in weather conditions that impede cleanup;\n(6) in the case of oil or hazardous substance transfer facilities, sudden loss of the largest volume which could occur during transfer into or out of a facility; or\n(7) the worst case discharge for the facility as described by regulations under the Oil Pollution Act of 1990 if the regulations, when adopted, describe a discharge worse than one described in clauses (1) to (6).",
	"repealed": false
}