{
	"id": "237.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.16",
	"title": "237.16 LOCAL EXCHANGE COMPETITION, RULES.",
	"text": "(a) For the purpose of bringing about fair and reasonable competition for local exchange telephone services, the commission has the exclusive authority, subject to the authority of a local government unit under sections 237.162 and 237.163, to:\n(1) authorize any person to construct telephone lines or exchanges or to otherwise furnish local service to subscribers in any municipality of this state, and to prescribe the terms and conditions upon which construction or service delivery may be carried on; and\n(2) establish terms and conditions for the entry of telephone service providers so as to protect consumers from monopolistic practices and preserve the state's commitment to universal service.\n(b) No person shall provide telephone service in Minnesota without first obtaining a determination that the person possesses the technical, managerial, and financial resources to provide the proposed telephone services and a certificate of authority from the commission under terms and conditions the commission finds to be consistent with fair and reasonable competition, universal service, the provision of affordable telephone service at a quality consistent with commission rules, and the commission's rules.\n(c) The commission shall make a determination on an application for a certificate within 120 days of the filing of the application.\n[See Note.]\n[Repealed by amendment, 1995 c 156 s 5]\nEvery company authorized to provide local telephone service under this section shall file a territorial map. The map must comply with the rules prescribed by the commission.\nNo company authorized to provide local service shall provide local telephone service in any area for which it has not been certified nor shall any person acquire ownership or control of another telephone company either directly or indirectly, without first obtaining from the commission an amended certificate of authority. The applicant for an amended certificate shall file with the commission notice of the expansion or acquisition, along with a new map under subdivision 3, identifying the territory to be served. Notice of the filing shall be served on any affected municipality and local telephone company certified in that territory. If no objection is filed with the commission by any interested party or raised by the commission within 20 days of the filing, it is considered approved, except if it involves an acquisition governed by section 237.23, in which case no certificate shall be granted until approval is obtained pursuant to that section and subdivision 1. If an objection is filed, the commission shall determine whether to approve the amendment in an expedited proceeding under section 237.61. This section shall not be construed to require a telephone company operating an exchange in Minnesota to secure a certificate for an extension within any territory within which such company has heretofore filed maps or for substitute facilities within such territories, or for extensions into territories contiguous to that already occupied by such company and not receiving similar service from another company if no certificate of territorial authority has been issued to or applied for by any other company.\nAny certificate of authority may, after notice of hearing and a hearing, be revoked or temporarily suspended by the commission, in whole or in part, for: the failure of its holder to furnish reasonably adequate telephone service within the area or areas determined and defined in the certificate of authority; failure to meet the terms and conditions of its certificate; intentional violation of the commission's rules or orders; or intentional violation of any applicable state or federal law relating to the provision of telephone or telecommunications services.\nThis section does not require any telephone company providing local service in the state of Minnesota to render telephone service in any portion of any territorial area not included on the telephone company's territorial map.\nThis section does not limit the ability of telephone companies possessing certificates of territorial authority on August 1, 1995, including, but not limited to, certificates authorizing resale of local telephone service, to continue to provide telephone service within their designated territories.\n(a) The commission shall adopt rules applicable to all telephone companies and telecommunications carriers required to obtain or having obtained a certificate for provision of telephone service using any existing federal standards as minimum standards and incorporating any additional standards or requirements necessary to ensure the provision of high-quality telephone services throughout the state. The rules must, at a minimum:\n(1) define procedures for competitive entry and exit;\n(2) require the provisions of equal access and interconnection with the company's network and other features, functions, and services which the commission considers necessary to promote fair and reasonable competition;\n(3) require unbundling of network services and functions to at least the level required by existing federal standards;\n(4) prescribe, if necessary, methods of reciprocal compensation between telephone companies;\n(5) provide for local telephone number portability;\n(6) prescribe appropriate regulatory standards for new local telephone service providers, that facilitate and support the development of competitive services;\n(7) protect against cross-subsidization, unfair competition, and other practices harmful to promoting fair and reasonable competition;\n(8) prescribe methods for the preservation of universal and affordable local telephone services;\n(9) prescribe standards for quality of service;\n(10) provide for the continued provision of local emergency telephone services under chapter 403; and\n(11) protect residential and commercial customers from unauthorized changes in service providers in a competitively neutral manner.\n(b) The commission shall adopt separate rules regarding the issues described in paragraph (a), clauses (1) to (11), as may be appropriate to provision of competitive local telephone service in areas served by telephone companies with less than 50,000 subscribers.\nThe commission shall establish and require contributions to a universal service fund, to be supported by all providers of telephone services, whether or not they are telephone companies under section 237.01, including, but not limited to, local telephone companies, independent telephone companies, cooperative telephone companies, municipal telephone companies, telecommunications carriers, radio common carriers, personal communication service providers, and cellular carriers. Services that should be considered for inclusion as universal include, at a minimum, single-party service including access, usage and touch-tone capability; line quality capable of carrying facsimile and data transmissions; equal access; emergency services number capability; statewide telecommunications relay service for people with hearing loss; and blocking of long-distance toll services. The fund must be administered and distributed in accordance with rules adopted by the commission and designed to preserve the availability of universal service throughout the state. Any state universal service fund must be coordinated with any federal universal service fund and be consistent with section 254(b)(1) to (5) of the federal Telecommunications Act of 1996, Public Law 104-104.\nMS 2012 [Repealed, 2014 c 222 art 1 s 58]\nMS 2012 [Repealed, 2014 c 222 art 1 s 58]\nIn order to promote the development of competitive interexchange services and facilities, any interexchange facility that is owned by a certified telephone company, independent telephone company, telecommunications carrier or an affiliate and that is used to provide service to customers located in areas for which it has been previously certified to provide service may be extended to meet and interconnect with the facility of another telephone company, small telephone company, or telecommunications carrier, whether at a point inside or outside of its territories, without further proceeding, order, or determination of current or future public convenience and necessity, upon mutual consent with the other telephone company, small telephone company, or telecommunications carrier whose facilities will be met and interconnected. Written notice of the extension and interconnection must be provided to the Public Utilities Commission and Department of Public Safety within 30 days after completion. The written notice must be served on all incumbent local exchange companies in all areas where the facilities are located.\nMS 2012 [Repealed, 2014 c 222 art 1 s 58]",
	"repealed": false
}