{
	"id": "13B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/13B.06",
	"title": "13B.06 CHILD SUPPORT OR MAINTENANCE OBLIGOR DATA MATCHES.",
	"text": "The definitions in this subdivision apply to this section.\n(a) \"Account\" means a demand deposit account, checking or negotiable withdraw order account, savings account, time deposit account, or money market mutual fund.\n(b) \"Account information\" means the type of account, the account number, whether the account is singly or jointly owned, and in the case of jointly owned accounts the name and address of the nonobligor account owner if available.\n(c) \"Financial institution\" means any of the following that do business within the state:\n(1) federal or state commercial banks and federal or state savings banks, including savings and loan associations and cooperative banks;\n(2) federal and state chartered credit unions;\n(3) benefit associations;\n(4) life insurance companies;\n(5) safe deposit companies; and\n(6) money market mutual funds.\n(d) \"Obligor\" means an individual who is in arrears in court-ordered child support or maintenance payments, or both, in an amount equal to or greater than five times the obligor's total monthly support and maintenance payments.\n(e) \"Public authority\" means the public authority responsible for child support enforcement.\nThe commissioner of children, youth, and families shall establish a process for the comparison of account information data held by financial institutions with the public authority's database of child support obligors. The commissioner shall inform the financial industry of the requirements of this section and the means by which financial institutions can comply. The commissioner may contract for services to carry out this section.\nOn written request by a public authority, a financial institution shall provide to the public authority on a quarterly basis the name, address, Social Security number, tax identification number if known, and all account information for each obligor who maintains an account at the financial institution.\nTo comply with the requirements of this section, a financial institution may either:\n(1) provide to the public authority a list containing only the names and other necessary personal identifying information of all account holders for the public authority to compare against its list of child support obligors for the purpose of identifying which obligors maintain an account at the financial institution; the names of the obligors who maintain an account at the institution shall then be transmitted to the financial institution which shall provide the public authority with account information on those obligors; or\n(2) obtain a list of child support obligors from the public authority and compare that data to the data maintained at the financial institution to identify which of the identified obligors maintains an account at the financial institution.\nA financial institution shall elect either method in writing upon written request of the public authority, and the election remains in effect unless the public authority agrees in writing to a change.\nA financial institution may provide the required data by submitting electronic media in a compatible format, delivering, mailing, or telefaxing a copy of the data, or by other means authorized by the commissioner of children, youth, and families that will result in timely reporting.\n(a) With regard to account information on all account holders provided by a financial institution under subdivision 4, clause (1), the commissioner of children, youth, and families shall retain the reported information only until the account information is compared against the public authority's obligor database. Notwithstanding section 138.17, all account information that does not pertain to an obligor listed in the public authority's database must be immediately discarded, and no retention or publication may be made of that data by the public authority. All account information that does pertain to an obligor listed in the public authority's database must be incorporated into the public authority's database. Access to that data is governed by chapter 13. Notwithstanding section 16D.06, data collected pursuant to this chapter is available for the collection of child support debt only and is not available for other debt collection activities undertaken by the state under chapter 16D.\n(b) With regard to data on obligors provided by the public authority to a financial institution under subdivision 4, clause (2), the financial institution shall retain the reported information only until the financial institution's database is compared against the public authority's database. Data that do not pertain to an account holder at the financial institution must be immediately discarded, and no retention or publication may be made of that data by the financial institution.\nA financial institution may charge and collect a fee from the public authority for providing account information to the public authority. The commissioner may pay a financial institution up to $150 each quarter if the commissioner and the financial institution have entered into a signed agreement that complies with federal law. The commissioner shall develop procedures for the financial institutions to charge and collect the fee. Payment of the fee is limited by the amount of the appropriation for this purpose. If the appropriation is insufficient, or if fund availability in the fourth quarter would allow payments for actual costs in excess of $150, the commissioner shall prorate the available funds among the financial institutions that have submitted a claim for the fee. No financial institution shall charge or collect a fee that exceeds its actual costs of complying with this section.\nThe public authority shall send by certified mail a written notice of noncompliance to a financial institution that fails to respond to a first written request for information under this section. The notice of noncompliance must explain the requirements of this section and advise the financial institution of the penalty for noncompliance. A financial institution that receives a second notice of noncompliance is subject to a civil penalty of $1,000 for its failure to comply. A financial institution that continues to fail to comply with this section is subject to a civil penalty of $5,000 for the third and each subsequent failure to comply. These penalties may be imposed and collected by the public authority.\nA financial institution that has been served with a notice of noncompliance and incurs a second or subsequent notice of noncompliance has the right to a contested case hearing under chapter 14. A financial institution has 20 days from the date of the service of the notice of noncompliance to file a request for a contested case hearing with the commissioner. The order of the administrative law judge constitutes the final decision in the case.\nA financial institution that provides or reasonably attempts to provide information to the public authority in compliance with this section is not liable to any person for disclosing the information or for taking any other action in good faith as authorized by this section or chapter 552.\n(a) An account holder may bring a civil action in district court against a financial institution for unauthorized disclosure of data received from the public authority under subdivision 4, clause (2). A financial institution found to have violated this subdivision shall be liable as provided in paragraph (b) or (c).\n(b) Any financial institution that willfully and maliciously discloses data received from the public authority under subdivision 4 is liable to that account holder in an amount equal to the sum of:\n(1) any actual damages sustained by the account holder as a result of the disclosure; and\n(2) in the case of any successful action to enforce any liability under this section, the costs of the action taken plus reasonable attorney's fees as determined by the court.\n(c) Any financial institution that negligently discloses data received from the public authority under subdivision 4 is liable to that account holder in an amount equal to any actual damages sustained by the account holder as a result of the disclosure.\n(d) A financial institution may not be held liable in any action brought under this subdivision if the financial institution shows, by a preponderance of evidence, that the disclosure was not intentional and resulted from a bona fide error notwithstanding the maintenance of procedures reasonably adopted to avoid any error.",
	"repealed": false
}