{
	"id": "145.93",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.93",
	"title": "145.93 MINNESOTA POISON INFORMATION CENTERS; ESTABLISHMENT.",
	"text": "The legislature finds that the needs of citizens of the state for information relating to the prompt identification and appropriate home management or referral of cases of human poisoning are best served by establishment of a single integrated poison control system, consisting of one or more regional poison information centers organized to provide statewide information and education services to the public and to health professionals.\n[Repealed, 1993 c 337 s 20]\nEvery fifth year, the commissioner shall solicit applications for the poison information centers by giving reasonable public notice of the availability of money appropriated or otherwise available. The commissioner shall select from among the entities, whether profit or nonprofit, or units of government the applicants that best fulfill the criteria specified in subdivision 4. The grant shall be paid to the grantees quarterly beginning on July 1.\nIn selecting grantees under this section, the commissioner of health shall determine that the following criteria are met:\n(1) whether the applicant can demonstrate the ability to provide appropriate and adequate telephone poison information services to the general public and to health professionals 24 hours a day at no direct cost to users and in a manner that appropriately utilizes \"911\" emergency telephone services developed pursuant to chapter 403;\n(2) whether the applicant can demonstrate the ability to provide adequate medical direction as well as the toxicological and related professional and technical resources needed for poison information services;\n(3) whether the applicant can demonstrate the ability to provide appropriate public education and professional education services;\n(4) whether the applicant can demonstrate the ability to provide poison information services in a financially sound and cost-effective manner; and\n(5) whether the applicant can demonstrate the ability to cooperate with interested health professionals throughout the state to provide poison information in a coordinated fashion.\n[Repealed, 1985 c 223 s 5]\nThe grantees selected shall report quarterly to the commissioner of health, on a form provided by the commissioner, information about fiscal performance and status. Grantees shall also report annually information about programmatic status and performance. All relevant records and the performance of the grantee shall be monitored by the commissioner for purposes of assuring that the grantee continues to fulfill the criteria specified in subdivision 4. Should the commissioner at any time find that a grantee is not continuing to fulfill the criteria specified in subdivision 4, the commissioner may terminate the grant upon 30 days' notice.",
	"repealed": false
}