{
	"id": "508A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.13",
	"title": "508A.13 EXAMINER'S REPORTS.",
	"text": "After the filing of the application for a CPT, the examiner of titles shall proceed to prepare a full written report to the applicant or the applicant's attorney based upon the examiner's examination of the application, abstract of title or other evidence of title, and the public records.\nThe examiner's report shall set forth all rights, titles, estates, liens, and interests in the real property. When in the opinion of the examiner the state has any interest in or lien upon the real property, this shall be fully set forth. The report shall be mailed to the applicant or the applicant's attorney and a copy shall be retained by the examiner.\nThe proceeding shall be suspended so long as the report of the examiner is adverse to the applicant or so long as valid written objections are still outstanding. The examiner shall mail written notice of the suspension to the applicant or the applicant's attorney.\nThe applicant or the applicant's attorney shall furnish the examiner on a prescribed form a list of the names and addresses of the persons listed by the examiner as having any right, title, estate, lien, or interest in the land sought to be registered under sections 508A.01 to 508A.85. If the addresses of any of these persons cannot be ascertained after a due and diligent search, the applicant or the applicant's attorney shall certify that fact.\nThere also shall be furnished to the examiner stamped envelopes addressed to those parties listed by the examiner whose addresses can be ascertained and a copy of the notice for each of these parties in the form prescribed in subdivision 5. The examiner shall then send by mail a copy of the notice to each of these parties. The certificate of the examiner that the examiner has mailed the notice shall be conclusive proof of mailing and shall be retained as a part of the examiner's files.\nThe examiner's notice shall be substantially in the following form:\nNOTICE OF APPLICATION FOR CERTIFICATE OF\nPOSSESSORY TITLE\nNOTICE IS HEREBY GIVEN, That ............................................... has made application for the issuance of a Certificate of Possessory Title pursuant to sections 508A.01 to 508A.85 for land lying and being in the State of Minnesota, County of .........................................., described as follows:\n(Description of land)\nSubject to:\n(List encumbrances)\nNOTICE is further given that a Certificate of Possessory Title containing only the encumbrances as described above will be issued to the applicant unless a valid written objection is submitted to the Examiner of Titles within 20 days from ......................................................, ..............., the date of mailing of this notice.\nThe examiner, upon the request of the registrar, shall advise the registrar upon any act or duty pertaining to the conduct of office, and prepare the form of any memorial to be entered by the registrar.",
	"repealed": false
}