{
	"id": "171.017",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.017",
	"title": "171.017 BACKGROUND INVESTIGATIONS; DRIVER'S LICENSE AGENTS AND CERTAIN EMPLOYEES.",
	"text": "The commissioner must investigate the criminal history background of any driver's license agent and any current or prospective employees of the department or driver's license agent being considered for any position that has or will have the ability to:\n(1) create or modify records of applicants for identification cards and driver's licenses, including enhanced driver's licenses and enhanced identification cards;\n(2) issue enhanced driver's licenses or enhanced identification cards; or\n(3) administer knowledge or skills tests under section 171.13 to an applicant for a commercial driver's license.\n(a) The commissioner must request a criminal history background check from the superintendent of the Bureau of Criminal Apprehension on all individuals specified in subdivision 1. A request under this section must be accompanied by an executed criminal history consent form, including fingerprints, signed by the agent or the current or prospective employee being investigated.\n(b) After receiving a request under paragraph (a), the superintendent of the Bureau of Criminal Apprehension shall perform the background check required under subdivision 1. The superintendent shall retrieve criminal history data as defined in section 13.87, conduct a search of the national criminal records repository, and provide wants and warrant information from federal and state repositories. The superintendent is authorized to exchange fingerprints with the Federal Bureau of Investigation for purposes of the criminal history check. The superintendent shall return the results of the background checks to the commissioner to determine whether:\n(1) the agent, employee, or applicant for employment specified in subdivision 1, clause (1) or (2), has committed a disqualifying crime under Code of Federal Regulations, title 49, section 1572.103; or\n(2) the employee or applicant for employment specified in subdivision 1, clause (3), has a conviction of the type specified by Code of Federal Regulations, title 49, section 384.228(j).\n(c) The superintendent shall recover the bureau's background check cost for the person on whom the background check is performed through a fee charged to the commissioner or the driver's license agent who requested the background check.\nCriminal justice agencies, as defined by section 13.02, subdivision 3a, shall provide the commissioner with information they possess and that the commissioner requires for the purposes of determining the employment suitability of current or prospective employees subject to this section.\nConsistent with Code of Federal Regulations, title 49, section 384.228, the commissioner shall request and the superintendent shall conduct annual background checks for the department employees specified in subdivision 1, clause (3). Annual background checks under this subdivision must be performed in a manner consistent with subdivisions 2 and 3.",
	"repealed": false
}