{
	"id": "256B.766",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.766",
	"title": "256B.766 REIMBURSEMENT FOR BASIC CARE SERVICES.",
	"text": "(a) Effective for services provided on or after July 1, 2009, total payments for basic care services, shall be reduced by three percent, except that for the period July 1, 2009, through June 30, 2011, total payments shall be reduced by 4.5 percent for the medical assistance and general assistance medical care programs, prior to third-party liability and spenddown calculation. Effective July 1, 2010, the commissioner shall classify physical therapy services, occupational therapy services, and speech-language pathology and related services as basic care services. The reduction in this paragraph shall apply to physical therapy services, occupational therapy services, and speech-language pathology and related services provided on or after July 1, 2010.\n(b) Payments made to managed care plans and county-based purchasing plans shall be reduced for services provided on or after October 1, 2009, to reflect the reduction effective July 1, 2009, and payments made to the plans shall be reduced effective October 1, 2010, to reflect the reduction effective July 1, 2010.\n(c) Effective for services provided on or after September 1, 2011, through June 30, 2013, total payments for outpatient hospital facility fees shall be reduced by five percent from the rates in effect on August 31, 2011.\n(d) Effective for services provided on or after September 1, 2011, through June 30, 2013, total payments for ambulatory surgery centers facility fees, medical supplies and durable medical equipment not subject to a volume purchase contract, prosthetics and orthotics, renal dialysis services, laboratory services, public health nursing services, physical therapy services, occupational therapy services, speech therapy services, eyeglasses not subject to a volume purchase contract, hearing aids not subject to a volume purchase contract, and anesthesia services shall be reduced by three percent from the rates in effect on August 31, 2011.\n(e) Effective for services provided on or after September 1, 2014, payments for ambulatory surgery centers facility fees, hospice services, renal dialysis services, laboratory services, public health nursing services, eyeglasses not subject to a volume purchase contract, and hearing aids not subject to a volume purchase contract shall be increased by three percent and payments for outpatient hospital facility fees shall be increased by three percent. Payments made to managed care plans and county-based purchasing plans shall not be adjusted to reflect payments under this paragraph.\n(f) Payments for medical supplies and durable medical equipment not subject to a volume purchase contract, and prosthetics and orthotics, provided on or after July 1, 2014, through June 30, 2015, shall be decreased by .33 percent. Payments for medical supplies and durable medical equipment not subject to a volume purchase contract, and prosthetics and orthotics, provided on or after July 1, 2015, shall be increased by three percent from the rates as determined under paragraphs (i) and (j).\n(g) Effective for services provided on or after July 1, 2015, payments for outpatient hospital facility fees, medical supplies and durable medical equipment not subject to a volume purchase contract, prosthetics, and orthotics to a hospital meeting the criteria specified in section 62Q.19, subdivision 1, paragraph (a), clause (4), shall be increased by 90 percent from the rates in effect on June 30, 2015. Payments made to managed care plans and county-based purchasing plans shall not be adjusted to reflect payments under this paragraph.\n(h) This section does not apply to physician and professional services, inpatient hospital services, family planning services, mental health services, dental services, prescription drugs, medical transportation, federally qualified health centers, rural health centers, Indian health services, and Medicare cost-sharing.\n(i) Effective for services provided on or after July 1, 2015, the following categories of medical supplies and durable medical equipment shall be individually priced items: customized and other specialized tracheostomy tubes and supplies, electric patient lifts, and durable medical equipment repair and service. This paragraph does not apply to medical supplies and durable medical equipment subject to a volume purchase contract, products subject to the preferred diabetic testing supply program, and items provided to dually eligible recipients when Medicare is the primary payer for the item. The commissioner shall not apply any medical assistance rate reductions to durable medical equipment as a result of Medicare competitive bidding.\n(j) Effective for services provided on or after July 1, 2015, medical assistance payment rates for durable medical equipment, prosthetics, orthotics, or supplies shall be increased as follows:\n(1) payment rates for durable medical equipment, prosthetics, orthotics, or supplies that were subject to the Medicare competitive bid that took effect in January of 2009 shall be increased by 9.5 percent; and\n(2) payment rates for durable medical equipment, prosthetics, orthotics, or supplies on the medical assistance fee schedule, whether or not subject to the Medicare competitive bid that took effect in January of 2009, shall be increased by 2.94 percent, with this increase being applied after calculation of any increased payment rate under clause (1).\nThis paragraph does not apply to medical supplies and durable medical equipment subject to a volume purchase contract, products subject to the preferred diabetic testing supply program, items provided to dually eligible recipients when Medicare is the primary payer for the item, and individually priced items identified in paragraph (i). Payments made to managed care plans and county-based purchasing plans shall not be adjusted to reflect the rate increases in this paragraph.\n(k) Effective for nonpressure support ventilators provided on or after January 1, 2016, the rate shall be the lower of the submitted charge or the Medicare fee schedule rate. Effective for pressure support ventilators provided on or after January 1, 2016, the rate shall be the lower of the submitted charge or 47 percent above the Medicare fee schedule rate. For payments made in accordance with this paragraph, if, and to the extent that, the commissioner identifies that the state has received federal financial participation for ventilators in excess of the amount allowed effective January 1, 2018, under United States Code, title 42, section 1396b(i)(27), the state shall repay the excess amount to the Centers for Medicare and Medicaid Services with state funds and maintain the full payment rate under this paragraph.\n(l) Payment rates for durable medical equipment, prosthetics, orthotics or supplies, that are subject to the upper payment limit in accordance with section 1903(i)(27) of the Social Security Act, shall be paid the Medicare rate. Rate increases provided in this chapter shall not be applied to the items listed in this paragraph.\n(m) For dates of service on or after July 1, 2023, through June 30, 2025, enteral nutrition and supplies must be paid according to this paragraph. If sufficient data exists for a product or supply, payment must be based upon the 50th percentile of the usual and customary charges per product code submitted to the commissioner, using only charges submitted per unit. Increases in rates resulting from the 50th percentile payment method must not exceed 150 percent of the previous fiscal year's rate per code and product combination. Data are sufficient if: (1) the commissioner has at least 100 paid claim lines by at least ten different providers for a given product or supply; or (2) in the absence of the data in clause (1), the commissioner has at least 20 claim lines by at least five different providers for a product or supply that does not meet the requirements of clause (1). If sufficient data are not available to calculate the 50th percentile for enteral products or supplies, the payment rate must be the payment rate in effect on June 30, 2023.\n(n) For dates of service on or after July 1, 2025, enteral nutrition and supplies must be paid according to this paragraph and updated annually each January 1. If sufficient data exists for a product or supply, payment must be based upon the 50th percentile of the usual and customary charges per product code submitted to the commissioner for the previous calendar year, using only charges submitted per unit. Increases in rates resulting from the 50th percentile payment method must not exceed 150 percent of the previous year's rate per code and product combination. Data are sufficient if: (1) the commissioner has at least 100 paid claim lines by at least ten different providers for a given product or supply; or (2) in the absence of the data in clause (1), the commissioner has at least 20 claim lines by at least five different providers for a product or supply that does not meet the requirements of clause (1). If sufficient data are not available to calculate the 50th percentile for enteral products or supplies, the payment must be the manufacturer's suggested retail price of that product or supply minus 20 percent. If the manufacturer's suggested retail price is not available, payment must be the actual acquisition cost of that product or supply plus 20 percent.",
	"repealed": false
}