{
	"id": "60K.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/60K.56",
	"title": "60K.56 CONTINUING INSURANCE EDUCATION.",
	"text": "For the purposes of this section, \"course\" means a course, program of instruction, or seminar of continuing insurance education. A \"professional designation examination\" means a written, proctored, and graded examination the passage of which leads to a bona fide insurance or financial planning professional designation used by insurance producers.\nThis section applies to all natural persons licensed by this state to sell lines of insurance for which licensing examinations are required.\nThis section does not apply to persons soliciting or selling solely on behalf of companies organized and operating according to chapter 67A.\n(a) The commissioner shall make the final determination as to accreditation and assignment of credit hours for courses.\n(b) The commissioner shall adopt procedures for reporting compliance with the minimum education requirement.\n(c) The commissioner may adopt rules according to chapter 14 to carry out the purposes of this section.\n(a) The commissioner may accredit a course only to the extent it is designed to impart substantive and procedural knowledge of the insurance field. The burden of demonstrating that the course satisfies this requirement is on the individual or organization seeking accreditation. The commissioner is authorized to establish a procedure for renewal of course accreditation.\n(b) The commissioner shall approve or disapprove professional designation examinations that are recommended for approval by the advisory task force. In order for an insurance producer to receive full continuing education credit for a professional designation examination, the producer must pass the examination. A producer may not receive credit for classroom instruction preparing for the professional designation examination and also receive continuing education credit for passing the professional designation examination.\nEach person subject to this section shall complete a minimum of 24 credit hours of courses accredited by the commissioner during each licensing period. No more than one-half of the credit hours per licensing period required under this section may be credited to a person for attending courses either sponsored by, offered by, or affiliated with an insurance company or its agents. For the purposes of this subdivision, a course provided by a bona fide insurance trade association is not considered to be sponsored by, offered by, or affiliated with an insurance company or its agents regardless of the location of the course offering. A licensee must obtain three hours of the credit hours per licensing period from a class or classes in the area of ethics. Courses sponsored by, offered by, or affiliated with an insurance company or agent may restrict its students to agents of the company or agency. Courses not sponsored by an insurance company must be open to all unless an exception listed in section 45.30 applies.\nThe commissioner may grant a waiver or an extension of time up to 90 days to complete the minimum education requirement to an individual upon a showing of good cause. It is the licensed person's responsibility to request a waiver or extension on a form prescribed by the commissioner. As of the day the licensed person properly files a request for a waiver or extension, the license remains in effect until the commissioner notifies the licensed person of the commissioner's decision. The commissioner may approve a waiver or extension subject to any reasonable conditions. The person's license remains in effect during the compliance period determined by the commissioner. If the licensed person fails to comply with any reasonable conditions imposed by the commissioner, the commissioner shall terminate the license. If the request for a waiver or extension is denied by the commissioner, the licensed person shall have 30 days within which to satisfy the minimum education requirement involved in the request for a waiver or extension. If the minimum education requirement is not satisfied within the compliance period, the commissioner shall terminate the person's license.\n(a) After completing the minimum education requirement, each person subject to this section shall file or cause to be filed a compliance report in accordance with the procedures adopted by the commissioner. A producer must not claim credit for continuing education not actually completed at the date of filing the report.\n(b) An institution offering an accredited course shall comply with the procedure for reporting compliance adopted by the commissioner.\nIf a person subject to this section fails to complete the minimum education or reporting requirement or to pay the prescribed fees for any licensing period, no license may be renewed or continued in force for that person for any class of insurance beginning the day after the renewal was due and that person may not act as an insurance producer until the person has demonstrated to the satisfaction of the commissioner that all requirements of this section have been complied with or that a waiver or extension has been obtained.",
	"repealed": false
}