{
	"id": "552.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/552.04",
	"title": "552.04 GENERAL PROVISIONS.",
	"text": "Unless this chapter specifically provides otherwise, the Minnesota Rules of Civil Procedure for the district courts and chapter 518A apply in all proceedings under this chapter.\nSubject to the exemptions provided by subdivision 3 and section 550.37, and any other applicable statute, to the extent the exemptions apply in cases of child support enforcement, the service by the public authority of a notice of support judgment levy under this chapter attaches all nonexempt indebtedness or money due or belonging to the judgment debtor and owing by the third party or in the possession or under the control of the third party at the time of service of the notice of support judgment levy, whether or not the indebtedness or money has become payable. The third party shall not be compelled to pay or deliver the same before the time specified by any agreement unless the agreement was fraudulently contracted to defeat an execution levy or other collection remedy.\nThe following property is not subject to attachment by a notice of support judgment levy served under this chapter:\n(1) any indebtedness or money due to the judgment debtor, unless at the time of the service of the notice of support judgment levy the same is due absolutely or does not depend upon any contingency;\n(2) any judgment owing by the third party to the judgment debtor, if the third party or the third party's property is liable on an execution levy upon the judgment;\n(3) any debt owing by the third party to the judgment debtor for which any negotiable instrument has been issued or endorsed by the third party;\n(4) any indebtedness or money due to the judgment debtor with a cumulative value of less than $10; and\n(5) any disposable earnings, indebtedness, or money that is exempt under state or federal law to the extent the exemptions apply in cases of child support enforcement.\nWhen levying upon money owed to the judgment debtor by a third party, the public authority shall serve a copy of the notice of support judgment levy upon the third party either by registered or certified mail, by personal service, or by electronic transmission. Along with a copy of the notice of support judgment levy, the public authority shall serve upon the third party a notice of support judgment levy and disclosure form that must be substantially in the form set forth below.\nPLEASE TAKE NOTICE that pursuant to Minnesota Statutes, chapters 518 and 552, the undersigned, as representative of the public authority responsible for child support enforcement, makes demand and levies execution upon all money due and owing by you to the judgment debtor for the amount of the judgment specified below. A copy of the notice of support judgment levy is enclosed. The unpaid judgment balance is $......\nIn responding to this levy, you are to complete the attached disclosure form and mail it to the public authority, together with your check payable to the public authority, for the nonexempt amount owed by you to the judgment debtor or for which you are obligated to the judgment debtor, within the time limits in chapter 552.\nDISCLOSURE\nOn the ... day of ......, ......., the time of service of the execution levy herein, there was due and owing the judgment debtor from the third party the following:\n(1) Money. Enter on the line below any amounts due and owing the judgment debtor, except earnings, from the third party.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(2) Setoff. Enter on the line below the amount of any setoff, defense, lien, or claim which the third party claims against the amount set forth on line (1). State the facts by which the setoff, defense, lien, or claim is claimed. (Any indebtedness to you incurred by the judgment debtor within ten days prior to the receipt of the first execution levy on a debt may not be claimed as a setoff, defense, lien, or claim against the amount set forth on line (1)).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(3) Exemption. Financial institutions shall not complete this line. Enter on the line below any amounts or property claimed by the judgment debtor to be exempt from execution.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(4) Adverse Interest. Enter on the line below any amounts claimed by other persons by reason of ownership or interest in the judgment debtor's property.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(5) Enter on the line below the total of lines (2), (3), and (4).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(6) Enter on the line below the difference obtained (never less than zero when line (5) is subtracted from the amount on line (1)).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(7) Enter on the line below 100 percent of the amount of the public authority's claim which remains unpaid.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(8) Enter on the line below the lesser of line (6) and line (7). You are instructed to remit this amount only if it is $10 or more.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nAFFIRMATION\nI, .......... (person signing Affirmation), am the third party or I am authorized by the third party to complete this nonearnings disclosure, and have done so truthfully and to the best of my knowledge.\nWithin 15 days after receipt of the notice of support judgment levy, unless governed by section 552.06, the third party shall disclose and remit to the public authority as much of the amount due as the third party's own debt equals to the judgment debtor.\nBefore or after the service of a written disclosure by a third party under subdivision 5, upon a showing by affidavit upon information and belief that an oral examination of the third party would provide a complete disclosure of relevant facts, any party to the execution proceedings may obtain an ex parte order requiring the third party, or a representative of the third party designated by name or by title, to appear for oral examination before the court. Notice of the examination must be given to all parties. This subdivision does not apply to financial institutions complying with section 552.06.\nIf a third party holds property, money, earnings, or other indebtedness by a title that is void as to the judgment debtor's creditors, the property may be levied on although the judgment debtor would be barred from maintaining an action to recover the property, money, earnings, or other indebtedness. In this and all other cases where the third party denies liability, the public authority may move the court at any time before the third party is discharged, on notice to both the judgment debtor and the third party for an order making the third party a party to supplemental action and granting the public authority leave to file a supplemental complaint against the third party and the judgment debtor. The supplemental complaint shall set forth the facts upon which the public authority claims to charge the third party. If probable cause is shown, the motion shall be granted. The supplemental complaint shall be served upon the third party and the judgment debtor and any other parties. The parties served shall answer or respond pursuant to the Minnesota Rules of Civil Procedure for the district courts, and if they fail to do so, judgment by default may be entered against them.\nJudgment may be entered against a third party who has been served with a notice of support judgment levy and fails to disclose or remit the levied funds as required in this chapter. Upon order to show cause served on the third party and notice of motion supported by affidavit of facts and affidavit of service upon both the judgment debtor and third party, the court may render judgment against the third party for an amount not exceeding 100 percent of the amount claimed in the execution. Judgment against the third party under this section shall not bar the public authority from further remedies under this chapter as a result of any subsequent defaults by the third party. The court upon good cause shown may remove the default and permit the third party to disclose or remit on just terms.\nUpon expiration, the public authority making the execution may file a partial satisfaction by amount or, if applicable, shall file the total satisfaction with the court administrator without charge.\nThe third party is not liable to the judgment debtor, public authority, or other person for wrongful retention if the third party retains or remits disposable earnings, indebtedness, or money of the judgment debtor or any other person, pending the third party's disclosure or consistent with the disclosure the third party makes, if the third party has a good faith belief that the property retained or remitted is subject to the execution. In addition, the third party may, at any time before or after disclosure, proceed under Rule 67 of the Minnesota Rules of Civil Procedure to make deposit into court. No third party is liable for damages if the third party complies with the provisions of this chapter.\nIf, in a proceeding to determine a claim of exemption, the claim of exemption is not upheld, and the court finds that it was asserted in bad faith, the public authority shall be awarded actual damages, costs, reasonable attorney fees resulting from the additional proceedings, and an amount not to exceed $100. If the claim of exemption is upheld, and the court finds that the public authority disregarded the claim of exemption in bad faith, the judgment debtor shall be awarded actual damages, costs, reasonable attorney fees resulting from the additional proceedings, and an amount not to exceed $100. If the exemption claim of the judgment debtor is found to be in bad faith, the underlying judgment shall be modified to reflect assessment of damages, costs, and attorney fees. However, if the party in whose favor a penalty assessment is made is not actually indebted to that party's attorney for fees, the attorney fee award shall be made directly to the attorney, and if not paid, an appropriate judgment in favor of the attorney shall be entered. Any action by a public authority made in bad faith and in violation of this chapter renders the execution levy void and the public authority liable to the judgment debtor named in the execution levy in the amount of $100, actual damages, and reasonable attorney fees and costs.\nSubject to subdivisions 6 and 13, the third party, after disclosure, shall be discharged of any further obligation to the public authority when one of the following conditions is met:\n(a) The third party discloses that the third party is not indebted to the judgment debtor or does not possess any earnings, property, money, or indebtedness belonging to the judgment debtor that is attachable as defined in subdivision 2. The disclosure is conclusive against the public authority and discharges the third party from any further obligation to the public authority other than to retain and remit all nonexempt disposable earnings, property, indebtedness, or money of the judgment debtor which was disclosed.\n(b) The third party discloses that the third party is indebted to the judgment debtor as indicated on the execution disclosure form. The disclosure is conclusive against the public authority and discharges the third party from any further obligation to the public authority other than to retain and remit all nonexempt disposable earnings, property, indebtedness, or money of the judgment debtor that was disclosed.\n(c) The court may, upon motion of an interested person, discharge the third party as to any disposable earnings, money, property, or indebtedness in excess of the amount that may be required to satisfy the public authority's claim.\nThe third party is not discharged if:\n(a) Within 20 days of the service of the third party's disclosure, an interested person serves a motion relating to the execution levy. The hearing on the motion must be scheduled to be heard within 30 days of the service of the motion.\n(b) The public authority moves the court for leave to file a supplemental complaint against the third party, as provided for in subdivision 7, and the court upon proper showing vacates the discharge of the third party.\nIf it appears that a person, who is not a party to the action, has or claims an interest in any of the disposable earnings, other indebtedness, or money, the court shall permit that person to intervene or join in the execution proceeding under this chapter. If that person does not appear, the court may summon that person to appear or order the claim barred. The person so appearing or summoned shall be joined as a party and be bound by the judgment.\nA party to an execution proceeding aggrieved by an order or final judgment may appeal as allowed by law.\nNotwithstanding section 52.12, a levy by the public authority made under this section on a judgment debtor's funds on deposit in a financial institution located in this state has priority over any unexercised right of setoff of the financial institution to apply the levied funds toward the balance of an outstanding loan or loans owed by the judgment debtor to the financial institution. A claim by the financial institution that it exercised its right to setoff prior to the levy by the public authority must be substantiated by evidence of the date of the setoff and must be verified by the sworn statement of a responsible corporate officer of the financial institution. For purposes of determining the priority of a levy made under this section, the levy must be treated as if it were an execution made under chapter 550.",
	"repealed": false
}