{
	"id": "136A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.65",
	"title": "136A.65 APPROVAL OF DEGREES AND NAME.",
	"text": "No school subject to registration shall grant a degree unless such degree and its underlying curriculum are approved by the office, nor shall any school subject to registration use the name \"college\" or \"university\" in its name without approval by the office.\n(a) A school must not be registered unless the school has institutional accreditation by an agency recognized by the United States Department of Education for purposes of eligibility to participate in Title IV federal financial aid programs. Any registered school undergoing institutional accreditation shall inform the office of site visits by the accrediting agency and provide office staff the opportunity to attend the visits, excluding any exit interviews. The institution must provide the office with a copy of the final report upon request of the office.\n(b) A school must not be authorized to offer any degree unless the program has programmatic accreditation or the school has institutional accreditation by an agency recognized by the United States Department of Education for purposes of eligibility to participate in Title IV federal financial aid programs. Any program offered by a registered school that does not have institutional accreditation and is undergoing programmatic accreditation shall inform the office of site visits by the accrediting agency and provide office staff the opportunity to attend the visits, excluding any exit interviews. The school must provide the office with a copy of the final report by the accreditor upon request of the office.\nThe office shall establish procedures for approval, including notice and an opportunity for a hearing pursuant to chapter 14 if such approval is not granted. If a hearing is requested, no disapproval shall take effect until after such hearing.\nA school subject to registration shall be granted approval to use the term \"college\" or \"university\" in its name if it was organized, operating, and using such term in its name on or before August 1, 2007, and if it meets the other policies and standards for approval established by the office.\n(a) A school applying to be registered and to have its degree or degrees and name approved must substantially meet the following criteria:\n(1) the school has an organizational framework with administrative and teaching personnel to provide the educational programs offered;\n(2) the school has financial resources sufficient to meet the school's financial obligations, including refunding tuition and other charges consistent with its stated policy if the institution is dissolved, or if claims for refunds are made, to provide service to the students as promised, and to provide educational programs leading to degrees as offered;\n(3) the school operates in conformity with generally accepted accounting principles according to the type of school;\n(4) the school provides an educational program leading to the degree it offers;\n(5) the school provides appropriate and accessible library, laboratory, and other physical facilities to support the educational program offered;\n(6) the school has a policy on freedom or limitation of expression and inquiry for faculty and students which is published or available on request;\n(7) the school uses only publications and advertisements which are truthful and do not give any false, fraudulent, deceptive, inaccurate, or misleading impressions about the school, its personnel, programs, services, or occupational opportunities for its graduates for promotion and student recruitment;\n(8) the school's compensated recruiting agents who are operating in Minnesota identify themselves as agents of the school when talking to or corresponding with students and prospective students;\n(9) the school provides information to students and prospective students concerning:\n(i) comprehensive and accurate policies relating to student admission, evaluation, suspension, and dismissal;\n(ii) clear and accurate policies relating to granting credit for prior education, training, and experience and for courses offered by the school;\n(iii) current schedules of fees, charges for tuition, required supplies, student activities, housing, and all other standard charges;\n(iv) policies regarding refunds and adjustments for withdrawal or modification of enrollment status; and\n(v) procedures and standards used for selection of recipients and the terms of payment and repayment for any financial aid program;\n(10) the school must not withhold a student's official transcript because the student is in arrears or in default on any loan issued by the school to the student if the loan qualifies as an institutional loan under United States Code, title 11, section 523(a)(8)(b);\n(11) the school has a process to receive and act on student complaints;\n(12) the school includes a joint and several liability provision for torts and compliance with the requirements of sections 136A.61 to 136A.71 in any contract effective after July 1, 2026, with any individual, entity, or postsecondary school located in another state for the purpose of providing educational or training programs or awarding postsecondary credits or continuing education credits to Minnesota residents that may be applied to a degree program; and\n(13) the school must not use nondisclosure agreements or other contracts restricting a student's ability to disclose information in connection with school actions or conduct that would be covered under section 136A.672.\n(b) An application for degree approval must also include:\n(i) title of degree and formal recognition awarded;\n(ii) location where such degree will be offered;\n(iii) proposed implementation date of the degree;\n(iv) admissions requirements for the degree;\n(v) length of the degree;\n(vi) projected enrollment for a period of five years;\n(vii) the curriculum required for the degree, including course syllabi or outlines;\n(viii) statement of academic and administrative mechanisms planned for monitoring the quality of the proposed degree;\n(ix) statement of satisfaction of professional licensure criteria, if applicable;\n(x) documentation of the availability of clinical, internship, externship, or practicum sites, if applicable; and\n(xi) statement of how the degree fulfills the institution's mission and goals, complements existing degrees, and contributes to the school's viability.\nFor each degree and nondegree program a school offers to a student, where the student does not leave Minnesota for the major portion of the program or course leading to the degree or nondegree award, the school must have:\n(1) for degree programs:\n(i) qualified teaching personnel to provide the educational programs for each degree for which approval is sought;\n(ii) appropriate educational programs leading to each degree for which approval is sought;\n(iii) appropriate and accessible library, laboratory, and other physical facilities to support the educational program for each degree for which approval is sought; and\n(iv) a rationale showing that degree programs are consistent with the school's mission and goals; and\n(2) for nondegree programs:\n(i) qualified teaching personnel to provide the educational programs for which approval is sought;\n(ii) appropriate educational programs leading to each award for which approval is sought;\n(iii) appropriate and accessible library, laboratory, and other physical facilities to support the educational program for which approval is sought; and\n(iv) a rationale showing that programs are consistent with the school's mission and goals.\nNondegree programs that are a part of an approved degree shall not require additional review or approval; they shall be considered approved as a part of the degree approval. Any nondegree program offered by a degree-granting school that is not a part of an approved degree shall be subject to clause (2), items (i) to (iv).\nA degree-granting school may use the term \"academy\" or \"institute\" in its name without meeting any additional requirements. A school may use the term \"college\" in its name if it offers at least one program leading to an associate or higher degree. A school may use the term \"university\" in its name if it offers at least one program leading to a master's or doctorate degree.\n(a) The office may grant a school a one-year conditional approval for a degree or use of a term in its name if doing so would be in the best interests of currently enrolled students or prospective students. Conditional approval of a degree or use of a term under this paragraph must not exceed a period of three years.\n(b) The office may grant new schools with their physical location in Minnesota and programs a one-year conditional approval for degrees or use of a term in its name to allow the school the opportunity to apply for and receive accreditation as required in subdivision 1a. Conditional approval of a school or program under this paragraph must not exceed a period of five years. A new school or program granted conditional approval may be allowed to continue in order to complete an accreditation process upon terms and conditions the office determines.\n(c) The office may grant a registered school a one-year conditional approval for degrees or use of a term in its name to allow the school the opportunity to apply for and receive accreditation as required in subdivision 1a if the school's accrediting agency is no longer recognized by the United States Department of Education for purposes of eligibility to participate in Title IV federal financial aid programs. The office must not grant conditional approvals under this paragraph to a school for a period of more than five years.\n(d) The office may grant a registered school a one-year conditional approval for degrees or use of a term in its name to allow the school to change to a different accrediting agency recognized by the United States Department of Education for purposes of eligibility to participate in Title IV federal financial aid programs. The office must not grant conditional approvals under this paragraph to a school for a period of more than five years.\n(a) By giving written notice and reasons to the school, the office may:\n(1) revoke, suspend, or refuse to renew registration;\n(2) refuse approval of a school's degree; and\n(3) refuse approval of the use of a regulated term in its name.\n(b) Reasons for revocation or suspension of registration or approval may be for one or more of the following reasons:\n(1) violating the provisions of sections 136A.61 to 136A.71;\n(2) providing false, misleading, or incomplete information to the office;\n(3) presenting information about the school which is false, fraudulent, misleading, deceptive, or inaccurate in a material respect to students or prospective students;\n(4) refusing to allow reasonable inspection or to supply reasonable information after a written request by the office has been received;\n(5) failing to have enrollment within the last two years at the school;\n(6) failing to have any enrollment within two years of a program's approval, except for programs that require extensive approval processes by the United States Department of Education, or the program's institutional or programmatic accreditor; or\n(7) having been administratively determined by the commissioner or judicially determined to have committed fraud or any other material violation of law involving federal, state, or local government funds.\n(c) Any order refusing, revoking, or suspending a school's registration, approval of a school's degree, or use of a regulated term in the school's name is appealable in accordance with chapter 14. The request must be in writing and made to the office within 30 days of the date the school is notified of the action of the office. If a school has been operating and its registration has been revoked, suspended, or refused by the office, the order is not effective until the final determination of the appeal, unless immediate effect is ordered by the court.",
	"repealed": false
}