{
	"id": "16B.981",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.981",
	"title": "16B.981 FINANCIAL REVIEW OF GRANT AND BUSINESS SUBSIDY RECIPIENTS.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Grant\" means a grant of $50,000 or more as defined in section 16B.97, subdivision 1, paragraph (a); or business subsidy of $50,000 or more as defined in section 116J.994, subdivision 3, paragraph (b).\n(c) \"Grantee\" means a political subdivision, as defined in section 471.345, subdivision 1; a nonprofit, as defined in chapter 317A; or a business entity, as defined in section 5.001, subdivision 2.\nFor grants of $50,000 or more and subject to sections 16B.97 and 16B.98, before an agency awards a competitive, legislatively named, single-source, or sole-source grant, the agency must complete a preaward risk assessment to assess the risk that a potential grantee cannot or would not perform the required duties. In making this assessment, the agency must review the following information as applicable:\n(1) the potential grantee's history of performing duties similar to those required by the grant, whether the grant requires the potential grantee to perform services at a significantly increased scale, and whether the grant will require significant changes to the operation of the potential grantee's organization;\n(2) for a potential grantee that is a nonprofit organization, the potential grantee's most recent Form 990 or Form 990-EZ filed with the Internal Revenue Service. If the potential grantee has not been in existence long enough or is not required to file Form 990 or Form 990-EZ, the potential grantee must demonstrate to the agency's satisfaction that the potential grantee is exempt and must instead submit the potential grantee's most recent board-reviewed financial statements and documentation of internal controls or, if there is no such board, by the applicant's managing group;\n(3) for a potential grantee that is a for-profit business, the potential grantee's most recent federal and state tax returns, current financial statements, certification that the business is not under bankruptcy proceedings, and disclosure of any liens on its assets. If a business has not been in business long enough to have a tax return, the grantee must demonstrate to the agency's satisfaction that the grantee has appropriate internal financial controls;\n(4) evidence of good standing with the secretary of state under chapter 317A, or other applicable law;\n(5) if the potential grantee is required to complete an audit under section 309.53, subdivision 3, the potential grantee's most recent audit report performed by an independent third party in accordance with generally accepted accounting principles; and\n(6) certification, provided by the potential grantee, that none of its current principals have been convicted of a felony financial crime in the last ten years. For this section, a principal is defined as a public official, a board member, or staff with the authority to access funds provided by this agency or determine how those funds are used.\nThe agency may require additional information and may provide enhanced oversight for grantees that have not previously received state or federal grants for similar amounts or similar duties and have not yet demonstrated the ability to perform the duties required under the grant on the scale required.\n(a) If, while performing the required steps in subdivision 2 and pursuant to sections 16B.97, 16B.98, and 16B.991, the agency requires additional information to determine whether there is a substantial risk that the potential grantee cannot or would not perform the required duties of the grant agreement, the agency must give the grantee 30 business days within which the grantee can respond to the agency for the purpose of satisfying the agency's concerns or work with the agency to develop a plan to satisfy the concerns.\n(b) If, after performing the required steps in subdivision 2 and pursuant to sections 16B.97, 16B.98, and 16B.991, and after reviewing any additional requested information from the grantee, the agency still has concerns that there is a substantial risk that a potential grantee cannot or would not perform the required duties under the grant agreement, the agency must either create a plan to satisfy remaining concerns with the grantee or must not award the grant.\n(c) If, pursuant to paragraphs (a) and (b), the agency does not award a competitive, single-source, or sole-source grant, the agency must provide notification to the grantee and the commissioner of administration of the determination. The notification to the grantee must include the agency's reason for postponing or forgoing the grant, including information sufficient to explain and support the agency's decision, and notify the applicant of the process for contesting the agency's decision with the agency and the applicant's options under paragraph (d). If the applicant contests the agency's decision no later than 15 business days after receiving the notice, the agency must consider any additional written information submitted by the grantee. The agency has 15 business days to consider this information, during which the agency may reverse or modify the agency's initial decision to postpone or forgo the grant.\n(d) The final decision by an agency under paragraph (c) may be challenged as a contested case under chapter 14. The contested case proceeding must be initiated within 30 business days of the date of written notification of a final decision by the agency.\n(e) If, pursuant to paragraphs (a) and (b), the agency does not award a legislatively named grant, the agency must delay award of the grant until adjournment of the next regular or special legislative session for action from the legislature. The agency must provide notification to the potential grantee, the commissioner of administration, and the chairs and ranking minority members of the Ways and Means Committee in the house of representatives and the chairs and ranking minority members of the Finance Committee in the senate. The notification to the grantee must include the agency's reason for postponing or forgoing the grant, including information sufficient to explain and support the agency's decision and notify the applicant of the process for contesting the agency's decision. If the applicant contests the agency's decision no later than 15 business days after receiving the notice, the agency must consider any additional written information submitted by the grantee. The agency has 15 business days to consider this information, during which the agency may reverse or modify the agency's initial decision to postpone or forgo the grant. The notification to the commissioner of administration and legislators must identify the legislatively named potential grantee and the agency's reason for postponing or forgoing the grant. After hearing the concerns of the agency, the legislature may reaffirm the award of the grant or reappropriate the funds to a different legislatively named grantee. Based on the action of the legislature, the agency must award the grant to the legislatively named grantee. If the legislature does not provide direction to the agency on the disposition of the grant, the funds revert to the original appropriation source.\nAn agency that identifies an area of significant concern regarding an applicant's financial standing or management may award a grant to the applicant if the agency provides or the potential grantee otherwise obtains necessary technical assistance. If the agency cannot provide and the grantee cannot otherwise reasonably obtain necessary technical assistance, the agency may award the grant if the agency establishes additional requirements in the grant agreement. Additional requirements may include but are not limited to enhanced monitoring, additional reporting, or other reasonable requirements imposed by the agency to protect the interests of the state.\nNotwithstanding any other law, an agency may not require an Indian Tribe or band to deny its sovereignty as a requirement or condition of a grant with an agency.",
	"repealed": false
}