{
	"id": "60A.0921",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.0921",
	"title": "60A.0921 CREDIT FOR REINSURANCE; CERTIFIED REINSURERS.",
	"text": "(a) Credit for reinsurance shall be allowed from a domestic ceding insurer to an assuming insurer that has been certified as a reinsurer in this state at all times for which statutory financial statement credit for reinsurance is claimed under this section. The credit allowed shall be based upon the security held by or on behalf of the ceding insurer in accordance with a rating assigned to the certified reinsurer by the commissioner. The security shall be in a form consistent with sections 60A.092, subdivision 10, and 60A.093. The amount of security required in order for full credit to be allowed shall correspond with the following requirements:\n(b) Affiliated reinsurance transactions shall receive the same opportunity for reduced security requirements as all other reinsurance transactions.\n(c) The commissioner shall require the certified reinsurer to post 100 percent, for the benefit of the ceding insurer or its estate, security upon the entry of an order of rehabilitation, liquidation, or conservation against the ceding insurer.\n(d) In order to facilitate the prompt payment of claims, a certified reinsurer shall not be required to post security for catastrophe recoverables for a period of one year from the date of the first instance of a liability reserve entry by the ceding company as a result of a loss from a catastrophic occurrence as recognized by the commissioner. The one-year deferral period is contingent upon the certified reinsurer continuing to pay claims in a timely manner. Reinsurance recoverables for only the following lines of business as reported on the National Association of Insurance Commissioners (NAIC) annual financial statement related specifically to the catastrophic occurrence will be included in the deferral:\n(1) Line 1: Fire;\n(2) Line 2: Allied Lines;\n(3) Line 3: Farmowners multiple peril;\n(4) Line 4: Homeowners multiple peril;\n(5) Line 5: Commercial multiple peril;\n(6) Line 9: Inland Marine;\n(7) Line 12: Earthquake;\n(8) Line 21: Auto physical damage.\n(e) Credit for reinsurance under this section shall apply only to reinsurance contracts entered into or renewed on or after the effective date of the certification of the assuming insurer. Any reinsurance contract entered into prior to the effective date of the certification of the assuming insurer that is subsequently amended after the effective date of the certification of the assuming insurer, or a new reinsurance contract, covering any risk for which collateral was provided previously, shall only be subject to this section with respect to losses incurred and reserves reported from and after the effective date of the amendment or new contract.\n(f) Nothing in this section prohibits the parties to a reinsurance agreement from agreeing to provisions establishing security requirements that exceed the minimum security requirements established for certified reinsurers under this section.\n(a) The commissioner shall post notice on the department's website promptly upon receipt of any application for certification, including instructions on how members of the public may respond to the application. The commissioner may not take final action on the application until at least 30 days after posting the notice.\n(b) The commissioner shall issue written notice to an assuming insurer that has applied and been approved as a certified reinsurer. The notice must include the rating assigned the certified reinsurer in accordance with subdivision 1. The commissioner shall publish a list of all certified reinsurers and their ratings.\n(c) In order to be eligible for certification, the assuming insurer must:\n(1) be domiciled and licensed to transact insurance or reinsurance in a qualified jurisdiction, as determined by the commissioner under subdivision 3;\n(2) maintain capital and surplus, or its equivalent, of no less than $250,000,000 calculated in accordance with paragraph (d), clause (8). This requirement may also be satisfied by an association including incorporated and individual unincorporated underwriters having minimum capital and surplus equivalents net of liabilities of at least $250,000,000 and a central fund containing a balance of at least $250,000,000;\n(3) maintain financial strength ratings from two or more rating agencies acceptable to the commissioner. These ratings shall be based on interactive communication between the rating agency and the assuming insurer and shall not be based solely on publicly available information. These financial strength ratings shall be one factor used by the commissioner in determining the rating that is assigned to the assuming insurer. Acceptable rating agencies include the following:\n(i) Standard & Poor's;\n(ii) Moody's Investors Service;\n(iii) Fitch Ratings;\n(iv) A.M. Best Company; or\n(v) any other nationally recognized statistical rating organization; and\n(4) ensure that the certified reinsurer complies with any other requirements reasonably imposed by the commissioner.\n(d) Each certified reinsurer shall be rated on a legal entity basis, with due consideration being given to the group rating where appropriate, except that an association including incorporated and individual unincorporated underwriters that has been approved to do business as a single certified reinsurer may be evaluated on the basis of its group rating. Factors that may be considered as part of the evaluation process include, but are not limited to:\n(1) certified reinsurer's financial strength rating from an acceptable rating agency. The maximum rating that a certified reinsurer may be assigned will correspond to its financial strength rating as outlined in the table below. The commissioner shall use the lowest financial strength rating received from an approved rating agency in establishing the maximum rating of a certified reinsurer. A failure to obtain or maintain at least two financial strength ratings from acceptable rating agencies will result in loss of eligibility for certification;\n(2) the business practices of the certified reinsurer in dealing with its ceding insurers, including its record of compliance with reinsurance contractual terms and obligations;\n(3) for certified reinsurers domiciled in the United States, a review of the most recent applicable NAIC annual statement;\n(4) for certified reinsurers not domiciled in the United States, a review annually of such forms as may be required by the commissioner;\n(5) the reputation of the certified reinsurer for prompt payment of claims under reinsurance agreements, based on an analysis of ceding insurers' reporting of overdue reinsurance recoverables, including the proportion of obligations that are more than 90 days past due or are in dispute, with specific attention given to obligations payable to companies that are in administrative supervision or receivership;\n(6) regulatory actions against the certified reinsurer;\n(7) the report of the independent auditor on the financial statements of the insurance enterprise, on the basis described in clause (8);\n(8) for certified reinsurers not domiciled in the United States, audited financial statements (audited United States GAAP basis if available, audited IFRS basis statements are allowed, but must include an audited footnote reconciling equity and net income to a United States GAAP basis, or, with permission of the commissioner, audited IFRS statements with reconciliation to United States GAAP certified by an officer of the company). Upon the initial application for certification, the commissioner will consider audited financial statements for the last two years filed with its non-United States jurisdiction supervisor;\n(9) the liquidation priority of obligations to a ceding insurer in the certified reinsurer's domiciliary jurisdiction in the context of an insolvency proceeding;\n(10) a certified reinsurer's participation in any solvent scheme of arrangement, or similar procedure, which involves United States ceding insurers. The commissioner must receive prior notice from a certified reinsurer that proposes participation by the certified reinsurer in a solvent scheme of arrangement; and\n(11) other information as determined by the commissioner.\n(e) Based on the analysis conducted under paragraph (d), clause (5), of a certified reinsurer's reputation for prompt payment of claims, the commissioner may make appropriate adjustments in the security the certified reinsurer is required to post to protect its liabilities to United States ceding insurers, provided that the commissioner shall, at a minimum, increase the security the certified reinsurer is required to post by one rating level under paragraph (d), clause (1), if the commissioner finds that:\n(1) more than 15 percent of the certified reinsurer's ceding insurance clients have overdue reinsurance recoverables on paid losses of 90 days or more which are not in dispute and which exceed $100,000 for each cedent; or\n(2) the aggregate amount of reinsurance recoverables on paid losses which are not in dispute that are overdue by 90 days or more exceeds $50,000,000.\n(f) The assuming insurer must submit such forms as required by the commissioner as evidence of its submission to the jurisdiction of this state, appoint the commissioner as an agent for service of process in this state, and agree to provide security for 100 percent of the assuming insurer's liabilities attributable to reinsurance ceded by United States ceding insurers if it resists enforcement of a final United States judgment. The commissioner shall not certify an assuming insurer that is domiciled in a jurisdiction that the commissioner has determined does not adequately and promptly enforce final United States judgments or arbitration awards.\n(g) The certified reinsurer must agree to meet filing requirements as determined by the commissioner, both with respect to an initial application for certification and on an ongoing basis. All data submitted by certified reinsurers to the commissioner is nonpublic under section 13.02, subdivision 9. The certified reinsurer must file with the commissioner:\n(1) a notification within ten days of any regulatory actions taken against the certified reinsurer, any change in the provisions of its domiciliary license, or any change in rating by an approved rating agency, including a statement describing such changes and the reasons therefore;\n(2) an annual report regarding reinsurance assumed, in a form determined by the commissioner;\n(3) an annual report of the independent auditor on the financial statements of the insurance enterprise, on the basis described in clause (4);\n(4) an annual audited financial statement, regulatory filings, and actuarial opinion filed with the certified reinsurer's supervisor. Upon the initial certification, audited financial statements for the last two years filed with the certified reinsurer's supervisor;\n(5) at least annually, an updated list of all disputed and overdue reinsurance claims regarding reinsurance assumed from United States domestic ceding insurers;\n(6) a certification from the certified reinsurer's domestic regulator that the certified reinsurer is in good standing and maintains capital in excess of the jurisdiction's highest regulatory action level; and\n(7) any other relevant information as determined by the commissioner.\n(a) In the case of a downgrade by a rating agency or other disqualifying circumstance, the commissioner shall upon written notice assign a new rating to the certified reinsurer in accordance with the requirements of subdivision 2, paragraph (d).\n(b) The commissioner may suspend, revoke, or otherwise modify a certified reinsurer's certification at any time if the certified reinsurer fails to meet its obligations or security requirements under this section, or if other financial or operating results of the certified reinsurer, or documented significant delays in payment by the certified reinsurer, lead the commissioner to reconsider the certified reinsurer's ability or willingness to meet its contractual obligations.\n(c) If the rating of a certified reinsurer is upgraded by the commissioner, the certified reinsurer may meet the security requirements applicable to its new rating on a prospective basis, but the commissioner shall require the certified reinsurer to post security under the previously applicable security requirements as to all contracts in force on or before the effective date of the upgraded rating. If the rating of a certified reinsurer is downgraded by the commissioner, the commissioner shall require the certified reinsurer to meet the security requirements applicable to its new rating for all business it has assumed as a certified reinsurer.\n(d) Upon revocation of the certification of a certified reinsurer by the commissioner, the assuming insurer shall be required to post security in accordance with section 60A.093 in order for the ceding insurer to continue to take credit for reinsurance ceded to the assuming insurer. If funds continue to be held in trust in accordance with section 60A.092, the commissioner may allow additional credit equal to the ceding insurer's pro rata share of such funds, discounted to reflect the risk of uncollectibility and anticipated expenses of trust administration. Notwithstanding the change of a certified reinsurer's rating or revocation of its certification, a domestic insurer that has ceded reinsurance to that certified reinsurer may not be denied credit for reinsurance for a period of three months for all reinsurance ceded to that certified reinsurer, unless the reinsurance is found by the commissioner to be at high risk of uncollectibility.\n(a) If, upon conducting an evaluation under this section with respect to the reinsurance supervisory system of any non-United States assuming insurer, the commissioner determines that the jurisdiction qualifies to be recognized as a qualified jurisdiction, the commissioner shall publish notice and evidence of such recognition in an appropriate manner. The commissioner may establish a procedure to withdraw recognition of those jurisdictions that are no longer qualified.\n(b) In order to determine whether the domiciliary jurisdiction of a non-United States assuming insurer is eligible to be recognized as a qualified jurisdiction, the commissioner shall evaluate the reinsurance supervisory system of the non-United States jurisdiction, both initially and on an ongoing basis, and consider the rights, benefits, and the extent of reciprocal recognition afforded by the non-United States jurisdiction to reinsurers licensed and domiciled in the United States. The commissioner shall determine the appropriate approach for evaluating the qualifications of such jurisdictions, and create and publish a list of jurisdictions whose reinsurers may be approved by the commissioner as eligible for certification. A qualified jurisdiction must agree to share information and cooperate with the commissioner with respect to all certified reinsurers domiciled within that jurisdiction. Additional factors to be considered in determining whether to recognize a qualified jurisdiction, in the discretion of the commissioner, include but are not limited to:\n(1) the framework under which the assuming insurer is regulated;\n(2) the structure and authority of the domiciliary regulator with regard to solvency regulation requirements and financial surveillance;\n(3) the substance of financial and operating standards for assuming insurers in the domiciliary jurisdiction;\n(4) the form and substance of financial reports required to be filed or made publicly available by reinsurers in the domiciliary jurisdiction and the accounting principles used;\n(5) the domiciliary regulator's willingness to cooperate with United States regulators in general and the commissioner in particular;\n(6) the history of performance by assuming insurers in the domiciliary jurisdiction;\n(7) any documented evidence of substantial problems with the enforcement of final United States judgments in the domiciliary jurisdiction. A jurisdiction will not be considered to be a qualified jurisdiction if the commissioner has determined that it does not adequately and promptly enforce final United States judgments or arbitration awards;\n(8) any relevant international standards or guidance with respect to mutual recognition of reinsurance supervision adopted by the International Association of Insurance Supervisors or a successor organization; and\n(9) other matters as determined by the commissioner.\n(c) A list of qualified jurisdictions shall be published through the NAIC committee process. The commissioner shall consider this list in determining qualified jurisdictions. If the commissioner approves a jurisdiction as qualified that does not appear on the list of qualified jurisdictions, the commissioner shall provide thoroughly documented justification with respect to the criteria provided under paragraph (b).\n(d) United States jurisdictions that meet the requirements for accreditation under the NAIC financial standards and accreditation program shall be recognized as qualified jurisdictions.\n(a) If an applicant for certification has been certified as a reinsurer in an NAIC-accredited jurisdiction, the commissioner may defer to that jurisdiction's certification, and to the rating assigned by that jurisdiction, if the assuming insurer submits information in the form required by the commissioner. The assuming insurer shall be considered to be a certified reinsurer in this state.\n(b) Any change in the certified reinsurer's status or rating in the other jurisdiction shall apply automatically in this state as of the date it takes effect in the other jurisdiction. The certified reinsurer shall notify the commissioner of any change in its status or rating within ten days after receiving notice of the change.\n(c) The commissioner may withdraw recognition of the other jurisdiction's rating at any time and assign a new rating in accordance with subdivision 2, paragraph (d).\n(d) The commissioner may withdraw recognition of the other jurisdiction's certification at any time, with written notice to the certified reinsurer. Unless the commissioner suspends or revokes the certified reinsurer's certification in accordance with subdivision 3, the certified reinsurer's certification shall remain in good standing in this state for a period of three months, which shall be extended if additional time is necessary to consider the assuming insurer's application for certification in this state.\nIn addition to the requirements of section 60A.092, subdivision 11, reinsurance contracts entered into or renewed under this section must include a requirement that the certified reinsurer provide and maintain security in an amount sufficient to avoid the imposition of any financial statement penalty on the ceding insurer under this section for reinsurance ceded to the certified reinsurer.\nThe commissioner must comply with all reporting and notification requirements that may be established by the NAIC with respect to certified reinsurers and qualified jurisdictions.",
	"repealed": false
}