{
	"id": "152.137",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.137",
	"title": "152.137 METHAMPHETAMINE-RELATED CRIMES INVOLVING CHILDREN AND VULNERABLE ADULTS.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Chemical substance\" means a substance intended to be used as a precursor in the manufacture of methamphetamine or any other chemical intended to be used in the manufacture of methamphetamine.\n(c) \"Child\" means any person under the age of 18 years.\n(d) \"Methamphetamine paraphernalia\" means all equipment, products, and materials of any kind that are used, intended for use, or designed for use in manufacturing, injecting, ingesting, inhaling, or otherwise introducing methamphetamine into the human body.\n(e) \"Methamphetamine waste products\" means substances, chemicals, or items of any kind used in the manufacture of methamphetamine or any part of the manufacturing process, or the by-products or degradates of manufacturing methamphetamine.\n(f) \"Vulnerable adult\" has the meaning given in section 609.232, subdivision 11.\n(a) No person may knowingly engage in any of the following activities in the presence of a child or vulnerable adult; in the residence of a child or a vulnerable adult; in a building, structure, conveyance, or outdoor location where a child or vulnerable adult might reasonably be expected to be present; in a room offered to the public for overnight accommodation; or in any multiple unit residential building:\n(1) manufacturing or attempting to manufacture methamphetamine;\n(2) storing any chemical substance;\n(3) storing any methamphetamine waste products; or\n(4) storing any methamphetamine paraphernalia.\n(b) No person may knowingly cause or permit a child or vulnerable adult to inhale, be exposed to, have contact with, or ingest methamphetamine, a chemical substance, or methamphetamine paraphernalia.\nA person who violates subdivision 2 is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.\nNotwithstanding sections 609.035 and 609.04, a prosecution for or conviction under this section is not a bar to conviction of or punishment for any other crime committed by the defendant as part of the same conduct.\nA peace officer may take any child present in an area where any of the activities described in subdivision 2, paragraph (a), clauses (1) to (4), are taking place into protective custody in accordance with section 260C.175, subdivision 1, clause (2), item (ii). A child taken into protective custody under this subdivision shall be provided health screening to assess potential health concerns related to methamphetamine as provided in section 260C.188. A child not taken into protective custody under this subdivision but who is known to have been exposed to methamphetamine shall be offered health screening for potential health concerns related to methamphetamine as provided in section 260C.188.\n(a) A peace officer shall make a report of suspected maltreatment of a vulnerable adult if the vulnerable adult is present in an area where any of the activities described in subdivision 2, paragraph (a), clauses (1) to (4), are taking place, and the peace officer has reason to believe the vulnerable adult inhaled, was exposed to, had contact with, or ingested methamphetamine, a chemical substance, or methamphetamine paraphernalia. The peace officer shall immediately report to the county common entry point as described in section 626.557, subdivision 9b.\n(b) As required in section 626.557, subdivision 9b, law enforcement is the primary agency to conduct investigations of any incident when there is reason to believe a crime has been committed. Law enforcement shall initiate a response immediately. If the common entry point notified a county agency for adult protective services, law enforcement shall cooperate with that county agency when both agencies are involved and shall exchange data to the extent authorized in section 626.557, subdivision 12b, paragraph (g). County adult protection shall initiate a response immediately.\n(c) The county social services agency shall immediately respond as required in section 626.557, subdivision 10, upon receipt of a report from the common entry point staff.",
	"repealed": false
}