{
	"id": "260C.190",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.190",
	"title": "260C.190 FAMILY-FOCUSED RESIDENTIAL PLACEMENT.",
	"text": "(a) An agency with legal responsibility for a child under section 260C.178, subdivision 1, paragraph (c), or legal custody of a child under section 260C.201, subdivision 1, paragraph (a), clause (3), may colocate a child with a parent who is receiving services in a licensed residential family-based substance use disorder treatment program for up to 12 months.\n(b) During the child's placement under paragraph (a), the agency: (1) may visit the child as the agency deems necessary and appropriate; (2) shall continue to have access to information under section 260C.208; and (3) shall continue to provide appropriate services to both the parent and the child.\n(c) The agency may terminate the child's placement under paragraph (a) to protect the child's health, safety, or welfare and may remove the child to foster care without a prior court order or authorization.\n(a) Before a child may be colocated with a parent in a licensed residential family-based substance use disorder treatment program, a recommendation that the child's placement with a parent is in the child's best interests must be documented in the child's case plan. Each child must have a written case plan developed with the parent and the treatment program staff that describes the safety plan for the child and the treatment program's responsibilities if the parent leaves or is discharged without completing the program. The treatment program must be provided with a copy of the case plan that includes the recommendations and safety plan at the time the child is colocated with the parent.\n(b) An out-of-home placement plan under section 260C.212, subdivision 1, must be completed no later than 30 days from when a child is colocated with a parent in a licensed residential family-based substance use disorder treatment program. The written plan developed with parent and treatment program staff in paragraph (a) may be updated and must be incorporated into the out-of-home placement plan. The treatment program must be provided with a copy of the child's out-of-home placement plan.\n(a) For a child colocated with a parent under subdivision 1, court reviews must occur according to section 260C.202.\n(b) If a child has been in foster care for six months, a court review under section 260C.202 may be conducted in lieu of a permanency progress review hearing under section 260C.204 when the child is colocated with a parent consistent with section 260C.503, subdivision 3, paragraph (c), in a licensed residential family-based substance use disorder treatment program.\n(c) If the child is colocated with a parent in a licensed residential family-based substance use disorder treatment program 12 months after the child was placed in foster care, the agency must file a report with the court regarding the parent's progress in the treatment program and the agency's reasonable efforts to finalize the child's safe and permanent return to the care and custody of the parent consistent with section 260C.503, subdivision 3, paragraph (c), in lieu of filing a petition required under section 260C.505.\n(d) The court shall make findings regarding the reasonable efforts of the agency to finalize the child's return home as the permanency disposition order in the child's best interests. The court may continue the child's foster care placement colocated with a parent in a licensed residential family-based substance use disorder treatment program for up to 12 months. When a child has been in foster care placement for 12 months, but the duration of the colocation with a parent in a licensed residential family-based substance use disorder treatment program is less than 12 months, the court may continue the colocation with the total time spent in foster care not exceeding 15 out of the most recent 22 months. If the court finds that the agency fails to make reasonable efforts to finalize the child's return home as the permanency disposition order in the child's best interests, the court may order additional efforts to support the child remaining in the care of the parent.\n(e) If a parent leaves or is discharged from a licensed residential family-based substance use disorder treatment program without completing the program, the child's placement under this section is terminated and the agency may remove the child to foster care without a prior court order or authorization. Within three days of any termination of a child's placement, the agency shall notify the court and each party.\n(f) If a parent leaves or is discharged from a licensed residential family-based substance use disorder treatment program without completing the program and the child has been in foster care for less than six months, the court must hold a review hearing within ten days of receiving notice of a termination of a child's placement and must order an alternative disposition under section 260C.201.\n(g) If a parent leaves or is discharged from a licensed residential family-based substance use disorder treatment program without completing the program and the child is colocated with a parent and the child has been in foster care for more than six months but less than 12 months, the court must conduct a permanency progress review hearing under section 260C.204 no later than 30 days after the day the parent leaves or is discharged.\n(h) If a parent leaves or is discharged from a licensed residential family-based substance use disorder treatment program without completing the program and the child is colocated with a parent and the child has been in foster care for more than 12 months, the court shall begin permanency proceedings under sections 260C.503 to 260C.521.",
	"repealed": false
}