{
	"id": "282.007",
	"url": "https://www.revisor.mn.gov/statutes/cite/282.007",
	"title": "282.007 LAND WITHDRAWN FROM INITIAL SALE.",
	"text": "The commissioner of natural resources may withhold or withdraw from the sale required under section 282.005 any property allowed to be withheld or withdrawn from sale in section 85.012, 85.013, 282.01, subdivision 8, or 282.018. The commissioner of natural resources must condemn parcels withheld or withdrawn from sale under this section according to procedures set forth in chapter 117. Notwithstanding section 282.005, subdivision 1, any interests in iron-bearing stockpiles, minerals, or mineral interests in property withheld or withdrawn from sale under this section are not severed from the property and are not subject to section 282.005, subdivision 8.\nThe county auditor must provide notice to the commissioner of natural resources of the forfeiture of any lands eligible to be withheld or withdrawn from sale under this section. Notice must be provided within 30 days of either the filing of the certificate of forfeiture pursuant to section 281.23, subdivision 9, or the date the property is vacated by the occupant, whichever is later. Within 30 days of this notice, the commissioner of natural resources must notify the county auditor of a decision to withhold or withdraw a property from the sale under section 282.005. If no such notice is given, the county auditor must sell the property pursuant to section 282.005.\nPrior to the initiation of the condemnation proceedings of a property withheld or withdrawn from sale under this section, an interested party may repurchase the property by payment of the sum of all delinquent taxes and assessments computed under section 282.251, together with penalties, interest, and costs that accrued or would have accrued if the parcel of land had not forfeited. The county auditor must notify the commissioner of natural resources if a property is repurchased under this subdivision. A property repurchased under this subdivision is no longer subject to the requirements of this section or section 282.005. All rights and interests of all interested parties remain unaffected if a property is repurchased under this subdivision. For the purposes of this section, \"interested party\" has the meaning given in section 282.005, subdivision 2.\nNotwithstanding any law to the contrary in chapter 117, all proceeds from the condemnation proceedings of a property withheld or withdrawn from sale under this section must be transferred from the commissioner of natural resources to the county auditor. Any proceeds up to the value of the minimum bid are transferred to the county's forfeited tax sale fund. Any proceeds in excess of the minimum bid must be made available for claims pursuant to section 282.005, subdivision 6. For the purposes of this section, \"minimum bid\" has the meaning given in section 282.005, subdivision 2.",
	"repealed": false
}