{
	"id": "291.016",
	"url": "https://www.revisor.mn.gov/statutes/cite/291.016",
	"title": "291.016 MINNESOTA TAXABLE ESTATE.",
	"text": "For purposes of the tax under this chapter, the Minnesota taxable estate equals the federal taxable estate as provided under section 2051 of the Internal Revenue Code, without regard to whether the estate is subject to the federal estate tax:\n(1) increased by the value of any property in which the decedent had a qualifying income interest for life and for which an election was made under section 291.03, subdivision 1d, for Minnesota estate tax purposes, but was not made for federal estate tax purposes;\n(2) increased by the additions under subdivision 2; and\n(3) decreased by the subtraction under subdivision 3.\nThe following amounts, to the extent deducted in computing or otherwise excluded from the federal taxable estate, must be added in computing the Minnesota taxable estate:\n(1) the amount of the deduction for state death taxes allowed under section 2058 of the Internal Revenue Code;\n(2) the amount of the deduction for foreign death taxes allowed under section 2053(d) of the Internal Revenue Code; and\n(3) the aggregate amount of taxable gifts as defined in section 2503 of the Internal Revenue Code, made by the decedent within three years of the date of death. For purposes of this clause, the amount of the addition equals the value of the gift under section 2512 of the Internal Revenue Code and excludes any value of the gift included in the federal estate.\n(a) For estates of decedents dying after December 31, 2016, a subtraction is allowed in computing the Minnesota taxable estate, equal to the sum of:\n(1) the exclusion amount for the year of death under paragraph (b); and\n(2) the lesser of:\n(i) the value of qualified small business property under section 291.03, subdivision 9, and the value of qualified farm property under section 291.03, subdivision 10; or\n(ii) $5,000,000 minus the exclusion amount for the year of death under paragraph (b).\n(b) The following exclusion amounts apply for the year of death:\n(1) $2,100,000 for decedents dying in 2017;\n(2) $2,400,000 for decedents dying in 2018;\n(3) $2,700,000 for decedents dying in 2019; and\n(4) $3,000,000 for decedents dying in 2020 and thereafter.\n(c) The subtraction under this subdivision must not reduce the Minnesota taxable estate to less than zero.",
	"repealed": false
}