{
	"id": "127A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.05",
	"title": "127A.05 COMMISSIONER OF EDUCATION.",
	"text": "The department shall be under the administrative control of the commissioner of education which office is established. The governor shall appoint the commissioner under the provisions of section 15.06.\nThe commissioner shall be a person who possesses educational attainment and breadth of experience in the administration of public education and of the finances pertaining thereto commensurate with the spirit and intent of this code. Notwithstanding any other law to the contrary, the commissioner may appoint two deputy commissioners who shall serve in the unclassified service. The commissioner shall also appoint other employees as may be necessary for the organization of the department. The commissioner shall perform such duties as the law and rules may provide and be held responsible for the efficient administration and discipline of the department. The commissioner is charged with the execution of powers and duties to promote public education in the state and to safeguard the finances pertaining thereto.\nThe commissioner shall review all education-related mandates in state law or rule once every four years to determine which mandates fail to adequately promote public education in the state. The commissioner shall report the findings of the review to the education committees of the legislature by February 1 in the year following the completion of the review.\nThe commissioner of education shall adopt goals for and exercise general supervision over public schools and public educational agencies in the state, classify and standardize public elementary and secondary schools, and prepare for them outlines and suggested courses of study. The commissioner shall develop a plan to attain the adopted goals. The commissioner may recognize educational accrediting agencies for the sole purposes of sections 120A.22, 120A.24, and 120A.26.\nThe commissioner may adopt new rules or amend any existing rules only under specific authority and consistent with the requirements of chapter 14. The commissioner may repeal any existing rules adopted by the commissioner. The commissioner may grant a variance to rules adopted by the commissioner upon application by a school district for purposes of implementing experimental programs in learning or school management. This subdivision shall not prohibit the commissioner from making technical changes or corrections to rules adopted by the commissioner.\nThe commissioner shall exercise general supervision over the public evening schools, adult education programs, and summer programs.\nMS 2018 [Repealed, 2019 c 50 art 1 s 130]",
	"repealed": false
}