{
	"id": "604A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/604A.30",
	"title": "604A.30 BREATH ALCOHOL TESTING DEVICE IN LIQUOR ESTABLISHMENTS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Breath alcohol testing device\" means a device that tests for alcohol concentration by using a breath sample.\n(c) \"Licensed premises\" has the meaning given in section 340A.101, subdivision 15.\n(d) \"Liquor licensee\" means a person licensed under sections 340A.403 to 340A.407 or 340A.414, and includes an agent or employee of a licensee.\n(a) Subject to subdivision 3, a liquor licensee who administers or makes available a breath alcohol testing device in the licensed premises is immune from any liability arising out of the result of the test.\n(b) Subject to subdivision 3, a designer, manufacturer, distributor, or seller of a breath alcohol testing device is immune from any products liability or other cause of action arising out of the result of a test by the breath alcohol testing device in a licensed premises.\nSubdivision 2 applies only if:\n(1) a conspicuous notice is posted in the licensed premises:\n(i) informing patrons of the immunity provisions of subdivision 2 and notifying them that the test is made available solely for their own informal use and information; and\n(ii) informing patrons of the alcohol-related driving penalties under chapter 169A and sections 609.2112, 609.2113, and 609.2114;\n(2) the type of breath alcohol testing device is certified by the commissioner of public safety under subdivision 7; and\n(3) the breath alcohol testing device test results are indicated as follows:\n(i) the breath alcohol testing device shows a white light and gives a reading of alcohol concentration if alcohol concentration is less than .05;\n(ii) the breath alcohol testing device shows a yellow light and gives a reading of alcohol concentration if alcohol concentration is .05 or more but less than .08;\n(iii) the breath alcohol testing device shows an orange light and gives a reading of alcohol concentration if alcohol concentration is .08 or more but less than .10, and displays a message that states \"You are close to the legal limit and your driving may be impaired\"; or\n(iv) the breath alcohol testing device shows a red light if alcohol concentration is .10 or greater but does not give a reading of alcohol concentration, and displays a message that states that the person fails the test.\nEvidence regarding the result of a test by a breath alcohol testing device in a licensed premises is not admissible in any civil or criminal proceeding.\nThis section does not affect liability under section 340A.801.\nThe commissioner of public safety shall prepare and make available to liquor licensees the notices described in subdivision 3.\nThe commissioner of public safety shall adopt any rules reasonably required to implement this section, including performance and maintenance standards for breath alcohol testing devices. The commissioner shall certify breath alcohol testing devices that meet the performance standards. The costs of rulemaking and certification must be borne by the manufacturers of the breath alcohol testing devices.",
	"repealed": false
}