{
	"id": "169.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.86",
	"title": "169.86 SPECIAL PERMIT TO EXCEED HEIGHT, WIDTH, OR LOAD; FEES.",
	"text": "(a) The commissioner, with respect to highways under the commissioner's jurisdiction, and local authorities, with respect to highways under their jurisdiction, may, in their discretion, upon application in writing and good cause being shown therefor, issue a special permit, in writing, authorizing the applicant to move a vehicle or combination of vehicles of a size or weight of vehicle or load exceeding the maximum specified in this chapter, exceeding the gross weight for which the vehicle is registered under chapter 168, or otherwise not in conformity with the provisions of this chapter, upon any highway under the jurisdiction of the party granting such permit and for the maintenance of which such party is responsible.\n(b) Permits relating to over-width, over-length manufactured homes shall not be issued to persons other than manufactured home dealers or manufacturers for movement of new units owned by the manufactured home dealer or manufacturer, until the person has presented a statement from the county auditor and treasurer where the unit is presently located, stating that all personal and real property taxes have been paid. Upon payment of the most recent single year delinquent personal property or current year taxes only, the county auditor or treasurer must issue a taxes paid statement to a manufactured home dealer or a financial institution desiring to relocate a manufactured home that has been repossessed. This statement must be dated within 30 days of the contemplated move. The statement from the county auditor and treasurer where the unit is presently located, stating that all personal and real property taxes have been paid, may be made by telephone. If the statement is obtained by telephone, the permit shall contain the date and time of the telephone call and the names of the persons in the auditor's office and treasurer's office who verified that all personal and real property taxes had been paid.\n(c) The commissioner may not grant a permit authorizing the movement, in a three-vehicle combination, of a semitrailer or trailer that exceeds 28-1/2 feet, except that the commissioner (1) may renew a permit that was granted before April 16, 1984, for the movement of a semitrailer or trailer that exceeds the length limitation in section 169.81, subdivision 2, or (2) may grant a permit authorizing the transportation of empty trailers that exceed 28-1/2 feet when using a B-train hitching mechanism as defined in Code of Federal Regulations, title 23, section 658.5, from a point of manufacture in the state to the state border.\n(d) The state as to state trunk highways, a statutory or home rule charter city as to streets in the city, or a town as to roads in the town, may issue permits authorizing the transportation of combinations of vehicles exceeding the limitations in section 169.81, subdivisions 2a and 3, over highways, streets, or roads within its boundaries. Combinations of vehicles authorized by this paragraph may be restricted as to the use of state trunk highways by the commissioner, to the use of streets by the city road authority, and to the use of roads by the town road authority. Nothing in this paragraph or section 169.81, subdivisions 2a and 3, alters or changes the authority vested in local authorities under section 169.04.\nThe commissioner of transportation, upon application in writing therefor, may issue special permits annually to any hauler authorizing the hauler to move vehicles or combinations of vehicles with weights exceeding by not more than ten percent the weight limitations contained in sections 169.823 to 169.829, on interstate highways during the times and within the zones specified in sections 169.823 to 169.829.\nThe commissioner or a local authority may issue an annual permit to a person that authorizes the person to operate on any highway under the jurisdiction of the grantor of the permit, a motor vehicle bearing a snowplow blade that when deployed does not exceed ten feet in width. The permit authorizes operation of the vehicle between October 1 and April 1.\nThe application for a permit shall specifically describe in writing the vehicle or vehicles and loads to be moved and the particular highways and period of time for which a permit is requested.\nThe commissioner or local authority may issue or withhold such permit; or, if such permit is issued, limit or prescribe conditions of operation of such vehicle or vehicles, when necessary to assure against undue damage to the road foundations, surfaces or structures, and may require such undertaking or other security as may be deemed necessary to compensate for any injury or damage to any roadway or road structure, and in addition may require that the operator or owner of such vehicle or vehicles have in effect with respect to the operation of such vehicle or vehicles a policy of liability insurance or bond affording substantially the same coverage with respect to injury to persons and damage to property as is required for proof of financial responsibility under the No-Fault Automobile Insurance Act, sections 65B.14 and 65B.41 to 65B.71.\nThe commissioner or local authority may not deny a permit for the transport to a manufacturing plant of manufactured home frames not more than 15-1/2 feet in width during periods of seasonal weight restrictions unless the load exceeds the weight restrictions.\nMS 2018 [Repealed, 2020 c 100 s 30]\nA permit must be carried in the vehicle or combination of vehicles to which it refers and must be open to inspection by any peace officer or authorized agent of any authority granting the permit. A permit may be carried in electronic format if it is easily read. No person shall violate any of the terms or conditions of a special permit.\nThe commissioner, with respect to highways under the commissioner's jurisdiction, may charge a fee for each permit issued. The fee for an annual permit that expires by law on the date of the vehicle registration expiration must be based on the proportion of the year that remains until the expiration date. All fees for permits issued by the commissioner of transportation must be deposited as provided in paragraph (i) and in section 174.525. Except for those annual permits for which the permit fees are specified elsewhere in this chapter, the fees are:\n(a) $15 for each single trip permit.\n(b) $36 for each job permit. A job permit may be issued for like loads carried on a specific route for a period not to exceed two months. \"Like loads\" means loads of the same product, weight, and dimension.\n(c) $60 for an annual permit to be issued for a period not to exceed 12 consecutive months. Annual permits may be issued for:\n(1) motor vehicles used to alleviate a temporary crisis adversely affecting the safety or well-being of the public;\n(2) motor vehicles that travel on interstate highways and carry loads authorized under subdivision 1a;\n(3) motor vehicles operating with gross weights authorized under section 169.826, subdivision 1a;\n(4) special pulpwood vehicles described in section 169.863;\n(5) motor vehicles bearing snowplow blades not exceeding ten feet in width;\n(6) noncommercial transportation of a boat by the owner or user of the boat; and\n(7) motor vehicles carrying bales of agricultural products authorized under section 169.862.\n(d) $120 for an oversize annual permit to be issued for a period not to exceed 12 consecutive months. Annual permits may be issued for:\n(1) mobile cranes;\n(2) construction equipment, machinery, and supplies;\n(3) manufactured homes and manufactured storage buildings;\n(4) implements of husbandry;\n(5) double-deck buses;\n(6) commercial boat hauling and transporting waterfront structures, including, but not limited to, portable boat docks and boat lifts; and\n(7) three-vehicle combinations consisting of two empty, newly manufactured trailers for cargo, horses, or livestock, not to exceed 28-1/2 feet per trailer; provided, however, the permit allows the vehicles to be moved from a trailer manufacturer to a trailer dealer only while operating on twin-trailer routes designated under section 169.81, subdivision 3, paragraph (c).\n(e) For vehicles that have axle weights exceeding the weight limitations of sections 169.823 to 169.829, an additional cost added to the fees listed above. However, this paragraph applies to any vehicle described in section 168.013, subdivision 3, paragraph (b), but only when the vehicle exceeds its gross weight allowance set forth in that paragraph, and then the additional cost is for all weight, including the allowance weight, in excess of the permitted maximum axle weight. The additional cost is equal to the product of the distance traveled times the sum of the overweight axle group cost factors shown in the following chart:\nThe amounts added are rounded to the nearest cent for each axle or axle group. The additional cost does not apply to paragraph (c), clauses (1) and (3).\nFor a vehicle found to exceed the appropriate maximum permitted weight, a cost-per-mile fee of 22 cents per ton, or fraction of a ton, over the permitted maximum weight is imposed in addition to the normal permit fee. Miles must be calculated based on the distance already traveled in the state plus the distance from the point of detection to a transportation loading site or unloading site within the state or to the point of exit from the state.\n(f) As an alternative to paragraph (e), an annual permit may be issued for overweight, or oversize and overweight, mobile cranes; construction equipment, machinery, and supplies; implements of husbandry; and commercial boat hauling. The fees for the permit are as follows:\nIf the gross weight of the vehicle is more than 155,000 pounds the permit fee is determined under paragraph (e).\n(g) For vehicles which exceed the width limitations set forth in section 169.80 by more than 72 inches, an additional cost equal to $120 added to the amount in paragraph (a) when the permit is issued while seasonal load restrictions pursuant to section 169.87 are in effect.\n(h) $85 for an annual permit to be issued for a period not to exceed 12 months, for refuse-compactor vehicles that carry a gross weight of not more than: 22,000 pounds on a single rear axle; 38,000 pounds on a tandem rear axle; or, subject to section 169.828, subdivision 2, 46,000 pounds on a tridem rear axle. A permit issued for up to 46,000 pounds on a tridem rear axle must limit the gross vehicle weight to not more than 62,000 pounds.\n(i) $300 for a motor vehicle described in section 169.8261. The fee under this paragraph must be deposited as follows:\n(1) the first $50,000 in each fiscal year must be deposited in the trunk highway fund for costs related to administering the permit program and inspecting and posting bridges; and\n(2) all remaining money in each fiscal year must be deposited in the bridge inspection and signing account as provided under subdivision 5b.\n(j) $200 for an annual permit for a vehicle operating under authority of section 169.824, subdivision 2, clause (2).\nWhen a special permit is issued under this chapter, the commissioner shall collect in addition to the permit fee an additional tax for excessive gross weight, if the weight allowed under the permit is greater than the gross weight for which the vehicle is registered under section 168.013. The tax shall be calculated as the difference between the registration tax paid under section 168.013, subdivision 1e, and the additional tax that would be due under section 168.013, subdivision 1e, at the gross weight allowed under the permit, prorated by the number of days for which the permit is effective. Proceeds of the surcharge must be deposited in the state treasury and credited to the highway user tax distribution fund.\n(a) A bridge inspection and signing account is established in the special revenue fund. The account consists of fees for special permits as specified under this chapter, and any other money donated, allotted, transferred, or otherwise provided to the account.\n(b) The revenue in the bridge inspection and signing account under this subdivision is annually appropriated to the commissioner for:\n(1) inspection of local bridges and identification of local bridges to be posted, including contracting with a consultant for some or all of these functions; and\n(2) erection of weight-posting signs on local bridges.\nArticulated buses operated by public transit operators may exceed the length and weight limitations of this chapter, subject only to an annual permit from the commissioner for such operation, and shall not be subject to any city ordinance or to any permit from any local road authority. The application for a permit shall contain such information as may be required by the commissioner.\n(a) On behalf of the state of Minnesota, the commissioner may enter into agreements with authorized representatives of other states for the reciprocal administration and granting of permits to allow the movement of vehicles of sizes and weights that do not conform to Minnesota law. The agreement may authorize representatives of other states to issue permits to allow vehicles that do not conform to the size and weight provisions of this chapter to travel on highways under the jurisdiction of the commissioner.\n(b) An agreement entered into under paragraph (a), and all amendments to it, must be in writing and may provide for exchanging information for audit and enforcement activities, collecting fees established under this chapter, and distributing fees collected under the agreement. It must state that no permit issued under the agreement excuses a vehicle operator from compliance with a law of this state other than the laws governing size and weight of vehicles.\n(c) For purposes of paragraphs (a) and (b), \"state\" means a state, territory, or possession of the United States, the District of Columbia, a foreign country, and a state or province of a foreign country.\n(d) Fees collected under authority of the agreement must be deposited in the Minnesota state treasury and credited to the trunk highway fund.\nMS 2010 [Renumbered 168B.15]",
	"repealed": false
}