{
	"id": "62R.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/62R.09",
	"title": "62R.09 STATE OVERSIGHT AND SUPERVISION.",
	"text": "(a) The commissioner of health shall review and authorize contracts and business or financial arrangements under section 62R.06, subdivision 1, and any modification, renewal, or extension of a contract or business or financial arrangement that previously has been approved. All contracts and business or financial arrangements, modifications, renewals, or extensions must be submitted on an application for approval to the commissioner.\n(b) Within 30 days after receiving an application, the commissioner may request additional information that is necessary to complete the review required under this section. The commissioner must approve or deny an application within 60 days after receiving the application or within 60 days after receiving any additional information requested by the commissioner, whichever is later. The commissioner must not deny an application unless the commissioner determines, using the criteria in paragraph (g), that:\n(1) the anticompetitive effects of the arrangement on the marketplace exceed the procompetitive effects or efficiencies, or that any price agreements included in the arrangement are not necessary to achieve the efficiencies that are expected to result from the arrangement; or\n(2) the applicant has not provided complete or sufficient information requested by the commissioner to evaluate the impact of the proposed arrangement on the health care marketplace.\n(c) The commissioner may collect information from other persons to assist in evaluating the impact of the proposed arrangement on the health care marketplace. The commissioner shall collect information from health plan companies and health care providers operating in the same geographic area as the health care cooperative. Data collected from health plan companies and health care providers under this paragraph are nonpublic data or private data on individuals, as defined in section 13.02.\n(d) The commissioner may solicit public comment on the impact of the proposed arrangement.\n(e) The commissioner may condition approval of a proposed arrangement on a modification of all or part of the arrangement to eliminate any restriction on competition that is not reasonably related to the goals of improving health care access or quality. The commissioner may also establish conditions for approval that are reasonably necessary to protect against abuses of private economic power and to ensure that the arrangement has oversight by the state.\n(f) The commissioner shall actively monitor arrangements approved under this section to ensure that the arrangement remains in compliance with the conditions of approval. Upon request, the health care cooperative shall provide information to the commissioner regarding compliance. The commissioner may revoke an approval upon a finding that the arrangement is not in substantial compliance with the terms of the application or the conditions of approval.\n(g) In evaluating applications received under this section, the commissioner shall consider whether:\n(1) the arrangement is likely to produce significant efficiencies that benefit consumers, such as cost savings or improvements in quality of or access to care;\n(2) the arrangement is likely to have any anticompetitive effects on the marketplace; and\n(3) the potential anticompetitive effects outweigh the procompetitive efficiencies resulting from the arrangement.\n(a) Applications for approval under this section must include a detailed description of the proposed arrangement.\n(b) The application must include:\n(1) the identities of all the parties to the arrangement;\n(2) the participation rules for the cooperative, including the terms and conditions under which participating providers may be members of the cooperative;\n(3) a description of the geographic areas served by the cooperative and the products provided, and a list of competing providers that are not members of the cooperative;\n(4) a description of any restriction on participating members of the cooperative entering into other contracts with payers; and\n(5) a description of the increased efficiency, improved health care access, improved health care quality, or increased market competition that will result from the arrangement.\n(c) Data on providers collected under this section are private data on individuals or nonpublic data, as defined in section 13.02.\nWhen submitting an initial application to the commissioner, a health care cooperative shall pay a fee of $2,000 for the commissioner's cost of reviewing and monitoring the arrangement. When submitting an application for modification, renewal, or extension of a previously approved contract and business or financial arrangement, the health care cooperative shall pay a fee of $500. Revenue received by the commissioner under this section is appropriated to the commissioner for the purpose of administering this section.",
	"repealed": false
}