{
	"id": "256B.434",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.434",
	"title": "256B.434 PAYMENT RATES AND PROCEDURES; CONTRACTS AND AGREEMENTS.",
	"text": "[Renumbered 256R.03, subd 5]\n[Repealed, 2016 c 99 art 1 s 43]\n[Renumbered 256R.03, subd 6]\nEffective for the rate years beginning on and after January 1, 2019, a nursing facility's property payment rate for the second and subsequent years of a facility's contract under this section are the previous rate year's property payment rate plus an inflation adjustment. The index for the inflation adjustment must be based on the change in the Consumer Price Index-All Items (United States City average) (CPI-U) forecasted by the Reports and Forecasts Division of the Department of Human Services, as forecasted in the fourth quarter of the calendar year preceding the rate year. The inflation adjustment must be based on the 12-month period from the midpoint of the previous rate year to the midpoint of the rate year for which the rate is being determined.\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n(a) Effective October 1, 2006, facilities reimbursed under this section may receive a property rate adjustment for construction projects exceeding the threshold in section 256B.431, subdivision 16, and below the threshold in section 144A.071, subdivision 2, paragraph (c), clause (1). For these projects, capital assets purchased shall be counted as construction project costs for a rate adjustment request made by a facility if they are: (1) purchased within 24 months of the completion of the construction project; (2) purchased after the completion date of any prior construction project; and (3) are not purchased prior to July 14, 2005. Except as otherwise provided in this subdivision, the definitions, rate calculation methods, and principles in sections 144A.071 and 256B.431 and Minnesota Rules, parts 9549.0010 to 9549.0080, shall be used to calculate rate adjustments for allowable construction projects under this subdivision and section 144A.073. Facilities completing construction projects between October 1, 2005, and October 1, 2006, are eligible to have a property rate adjustment effective October 1, 2006. Facilities completing projects after October 1, 2006, are eligible for a property rate adjustment effective on the first day of the month following the completion date. Facilities completing projects after January 1, 2018, are eligible for a property rate adjustment effective on the first day of the month of January or July, whichever occurs immediately following the completion date.\n(b) Notwithstanding subdivision 18, as of July 14, 2005, facilities with rates set under section 256B.431 and Minnesota Rules, parts 9549.0010 to 9549.0080, that commenced a construction project on or after October 1, 2004, and do not have a contract under subdivision 3 by September 30, 2006, are eligible to request a rate adjustment under section 256B.431, subdivision 10, through September 30, 2006. If the request results in the commissioner determining a rate adjustment is allowable, the rate adjustment is effective on the first of the month following project completion. These facilities shall be allowed to accumulate construction project costs for the period October 1, 2004, to September 30, 2006.\n(c) Facilities shall be allowed construction project rate adjustments no sooner than 12 months after completing a previous construction project. Facilities must request the rate adjustment according to section 256B.431, subdivision 10.\n(d) Capacity days shall be computed according to Minnesota Rules, part 9549.0060, subpart 11. For rate calculations under this section, the number of licensed beds in the nursing facility shall be the number existing after the construction project is completed and the number of days in the nursing facility's reporting period shall be 365.\n(e) The value of assets to be recognized for a total replacement project as defined in section 256B.431, subdivision 17d, shall be computed as described in clause (1). The value of assets to be recognized for all other projects shall be computed as described in clause (2).\n(1) Replacement-cost-new limits under section 256B.431, subdivision 17e, and the number of beds allowed under subdivision 3a, paragraph (c), shall be used to compute the maximum amount of assets allowable in a facility's property rate calculation. If a facility's current request for a rate adjustment results from the completion of a construction project that was previously approved under section 144A.073, the assets to be used in the rate calculation cannot exceed the lesser of the amount determined under sections 144A.071, subdivision 2, and 144A.073, subdivision 3b, or the actual allowable costs of the construction project. A current request that is not the result of a project under section 144A.073 cannot exceed the limit under section 144A.071, subdivision 2, paragraph (c), clause (1). Applicable credits must be deducted from the cost of the construction project.\n(2)(i) Replacement-cost-new limits under section 256B.431, subdivision 17e, and the number of beds allowed under section 256B.431, subdivision 3a, paragraph (c), shall be used to compute the maximum amount of assets allowable in a facility's property rate calculation.\n(ii) The value of a facility's assets to be compared to the amount in item (i) begins with the total appraised value from the last rate notice a facility received when its rates were set under section 256B.431 and Minnesota Rules, parts 9549.0010 to 9549.0080. This value shall be indexed by the factor in section 256B.431, subdivision 3f, paragraph (a), for each rate year the facility received an inflation factor on its property-related rate when its rates were set under this section. The value of assets listed as previous capital additions, capital additions, and special projects on the facility's base year rate notice and the value of assets related to a construction project for which the facility received a rate adjustment when its rates were determined under this section shall be added to the indexed appraised value.\n(iii) The maximum amount of assets to be recognized in computing a facility's rate adjustment after a project is completed is the lesser of the aggregate replacement-cost-new limit computed in (i) minus the assets recognized in (ii) or the actual allowable costs of the construction project.\n(iv) If a facility's current request for a rate adjustment results from the completion of a construction project that was previously approved under section 144A.073, the assets to be added to the rate calculation cannot exceed the lesser of the amount determined under sections 144A.071, subdivision 2, and 144A.073, subdivision 3b, or the actual allowable costs of the construction project. A current request that is not the result of a project under section 144A.073 cannot exceed the limit stated in section 144A.071, subdivision 2, paragraph (c), clause (1). Assets disposed of as a result of a construction project and applicable credits must be deducted from the cost of the construction project.\n(f) For construction projects approved under section 144A.073, allowable debt may never exceed the lesser of the cost of the assets purchased, the threshold limit in section 144A.071, subdivision 2, or the replacement-cost-new limit less previously existing capital debt.\n(g) For construction projects that were not approved under section 144A.073, allowable debt is limited to the lesser of the threshold in section 144A.071, subdivision 2, for such construction projects or the applicable limit in paragraph (e), clause (1) or (2), less previously existing capital debt. Amounts of debt taken out that exceed the costs of a construction project shall not be allowed regardless of the use of the funds.\nFor all construction projects being recognized, interest expense and average debt shall be computed based on the first 12 months following project completion. \"Previously existing capital debt\" means capital debt recognized on the last rate determined under section 256B.431 and Minnesota Rules, parts 9549.0010 to 9549.0080, and the amount of debt recognized for a construction project for which the facility received a rate adjustment when its rates were determined under this section.\nFor a total replacement project as defined in section 256B.431, subdivision 17d, the value of previously existing capital debt shall be zero.\n(h) In addition to the interest expense allowed from the application of paragraph (f), the amounts allowed under section 256B.431, subdivision 17a, paragraph (a), clauses (2) and (3), will be added to interest expense.\n(i) The equity portion of the construction project shall be computed as the allowable assets in paragraph (e), less the average debt in paragraph (f). The equity portion must be multiplied by 5.66 percent and the allowable interest expense in paragraph (f) must be added. This sum must be divided by 95 percent of capacity days to compute the construction project rate adjustment.\n(j) For projects that are not a total replacement of a nursing facility, the amount in paragraph (i) is adjusted for nonreimbursable areas and then added to the current property payment rate of the facility.\n(k) For projects that are a total replacement of a nursing facility, the amount in paragraph (i) becomes the new property payment rate after being adjusted for nonreimbursable areas. Any amounts existing in a facility's rate before the effective date of the construction project for equity incentives under section 256B.431, subdivision 16; capital repairs and replacements under section 256B.431, subdivision 15; or refinancing incentives under section 256B.431, subdivision 19, shall be removed from the facility's rates.\n(l) No additional equipment allowance is allowed under Minnesota Rules, part 9549.0060, subpart 10, as the result of construction projects under this section. Allowable equipment shall be included in the construction project costs.\n(m) Capital assets purchased after the completion date of a construction project shall be counted as construction project costs for any future rate adjustment request made by a facility under section 144A.071, subdivision 2, paragraph (c), clause (1), if they are purchased within 24 months of the completion of the future construction project.\n(n) In subsequent rate years, the property payment rate for a facility that results from the application of this subdivision shall be the amount inflated in subdivision 4.\n(o) Construction projects are eligible for an equity incentive under section 256B.431, subdivision 16. When computing the equity incentive for a construction project under this subdivision, only the allowable costs and allowable debt related to the construction project shall be used. The equity incentive shall not be a part of the property payment rate and not inflated under subdivision 4. Effective October 1, 2006, all equity incentives for nursing facilities reimbursed under this section shall be allowed for a duration determined under section 256B.431, subdivision 16, paragraph (c).\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n(a) This subdivision applies to nursing facilities with at least 120 active beds as of January 1, 2015, that have projects approved in 2015 under the nursing facility moratorium exception process in section 144A.073. When each facility's moratorium exception construction project is completed, the facility must receive the rate adjustment allowed under subdivision 4f. In addition to that rate adjustment, facilities with at least 120 active beds, but not more than 149 active beds, as of January 1, 2015, must have their construction project rate adjustment increased by an additional $4; and facilities with at least 150 active beds, but not more than 160 active beds, as of January 1, 2015, must have their construction project rate adjustment increased by an additional $12.50.\n(b) Notwithstanding any other law to the contrary, money available under section 144A.073, subdivision 11, after the completion of the moratorium exception approval process in 2015 under section 144A.073, subdivision 3, shall be used to reduce the fiscal impact to the medical assistance budget for the increases allowed in this subdivision.\n(a) This subdivision applies to nursing facilities:\n(1) located in Ramsey County;\n(2) with at least 130 active beds as of September 30, 2017;\n(3) with a portion of beds dually certified for Medicare and Medicaid and a portion of beds certified for Medicaid only; and\n(4) with debt service payments that are not being covered by the existing property payment rate on September 30, 2017.\n(b) The commissioner shall increase the property rate of each facility meeting the qualifications of this subdivision by $7.55.\n(c) Notwithstanding any other law to the contrary, money available under section 144A.073, subdivision 15, after the completion of the 2018 moratorium exception approval process under section 144A.073, subdivision 3, shall be used to pay the medical assistance cost for the property rate increase in this subdivision.\n(a) A rate increase under this subdivision ends upon the effective date of the transition of the facility's property rate to a property payment rate under section 256R.26, subdivision 8, or May 31, 2026, whichever is earlier.\n(b) The commissioner shall increase the property rate of a nursing facility located in the city of St. Paul at 1415 Almond Avenue in Ramsey County by $10.65 on January 1, 2025.\n(c) The commissioner shall increase the property rate of a nursing facility located in the city of Duluth at 3111 Church Place in St. Louis County by $20.81 on January 1, 2025.\n(d) The commissioner shall increase the property rate of a nursing facility located in the city of Chatfield at 1102 Liberty Street SE in Fillmore County by $21.35 on January 1, 2025.\n(e) Effective January 1, 2025, through June 30, 2025, the commissioner shall increase the property rate of a nursing facility located in the city of Fergus Falls at 1131 South Mabelle Avenue in Ottertail County by $38.56.\n[Repealed, 1Sp2001 c 9 art 5 s 41]\nMS 2018 [Repealed, 1Sp2019 c 9 art 4 s 30]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2012 c 216 art 9 s 38]\n[Repealed, 2016 c 99 art 1 s 43]\nMS 2018 [Repealed, 1Sp2019 c 9 art 4 s 30]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2001 c 161 s 58]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 1999 c 245 art 3 s 51]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2015 c 71 art 6 s 44]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2016 c 99 art 1 s 43]",
	"repealed": false
}