{
	"id": "60D.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/60D.09",
	"title": "60D.09 PENALTIES.",
	"text": "An insurer failing, without just cause, to file a registration statement as required in section 60D.19 shall pay a penalty of $1,000 for each day's delay, to be recovered by the commissioner and paid into the general fund. The commissioner may reduce the penalty if the insurer demonstrates to the commissioner that the imposition of the penalty would constitute a financial hardship to the insurer.\nAn insurer failing, without just cause, to provide the appropriate notice and filing under section 60D.20 regarding an affiliated transaction or agreement, shall pay a penalty of $5,000, to be recovered by the commissioner and paid into the general fund.\nWhenever it appears to the commissioner that an insurer subject to sections 60D.15 to 60D.29 or a director, officer, employee, or agent of an insurer has engaged in a transaction or entered into a contract that is subject to section 60D.20 and that would have been disapproved by the commissioner, the commissioner may order the insurer to cease and desist immediately any further activity under that transaction or contract. After notice and hearing, the commissioner may also order the insurer to void any contracts and restore the status quo if the action is in the best interest of the policyholders, creditors, or the public.\nWhenever it appears to the commissioner that any insurer or any director, officer, employee or agent thereof has committed a willful violation of sections 60D.15 to 60D.29, the commissioner may cause criminal proceedings to be instituted by the district court for the county in which the principal office of the insurer is located or if such insurer has no such office in the state, then by the District Court for Ramsey County against such insurer or the responsible director, officer, employee or agent thereof. Any person who willfully violates sections 60D.15 to 60D.29 shall be guilty, for the first offense, of a misdemeanor, and for each subsequent offense, of a gross misdemeanor.",
	"repealed": false
}