{
	"id": "97A.028",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.028",
	"title": "97A.028 CROP PROTECTION ASSISTANCE.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Agricultural crops\" means annually seeded crops, legumes, fruit orchards, tree farms and nurseries, turf farms, and apiaries.\n(c) \"Parcel\" has the meaning given in section 272.03, subdivision 6.\n(d) \"Specialty crops\" means fruit orchards, vegetables, tree farms and nurseries, turf farms, and apiaries.\n(e) \"Stored forage crops\" means hay, silage, grain, or other crops that have been harvested and placed in storage for commercial livestock feeding.\nThe commissioner shall establish a statewide program to provide technical assistance to persons for the protection of agricultural crops from destruction by wild animals. As part of the program, the commissioner shall develop and identify the latest and most effective abatement techniques; acquire appropriate demonstration supplies and materials required to meet specialized needs; train property owners, field staff, public land managers, extension agents, pest control operators, and others; provide technical manuals and brochures; and provide field personnel with supplies and materials for damage abatement demonstrations and short-term assistance and for the establishment of food or lure crops where appropriate.\n(a) For the purposes of this subdivision, \"cooperative damage management agreement\" means an agreement between a landowner or tenant and the commissioner that establishes a program for addressing the problem of destruction of the landowner's or tenant's specialty crops or stored forage crops by wild animals, destruction of agricultural crops by flightless Canada geese, or destruction of agricultural crops or pasture by elk within the native elk range, as determined by the commissioner.\n(b) A landowner or tenant may apply to the commissioner for emergency deterrent materials assistance in controlling destruction of the landowner's or tenant's specialty crops or stored forage crops by wild animals, destruction of agricultural crops by flightless Canada geese, or destruction of agricultural crops or pasture by elk within the native elk range, as determined by the commissioner. Subject to the availability of money appropriated for this purpose, the commissioner shall provide suitable deterrent materials when the commissioner determines that:\n(1) immediate action is necessary to prevent significant damage from continuing; and\n(2) a cooperative damage management agreement cannot be implemented immediately.\n(c) A person may receive emergency deterrent materials assistance under this subdivision more than once, but the cumulative total value of deterrent materials provided to a person, or for use on a parcel, may not exceed $5,000 for specialty crops, $1,500 for protecting stored forage crops other than silage or grain, $3,000 for stored silage or grain, or $1,000 for agricultural crops damaged by flightless Canada geese. The value of deterrent materials provided to a person to help protect stored forage crops, agricultural crops, or pasture from damage by elk may not exceed $5,000. If a person is a co-owner or cotenant with respect to the crops for which the deterrent materials are provided, the deterrent materials are deemed to be \"provided\" to the person for the purposes of this paragraph.\n(d) As a condition of receiving emergency deterrent materials assistance under this subdivision, a landowner or tenant shall enter into a cooperative damage management agreement with the commissioner. Deterrent materials provided by the commissioner may include repellents, fencing materials, or other materials recommended in the agreement to alleviate the damage problem. If requested by a landowner or tenant, any fencing materials provided must be capable of providing long-term protection of specialty crops. A landowner or tenant who receives emergency deterrent materials assistance under this subdivision shall comply with the terms of the cooperative damage management agreement.",
	"repealed": false
}