{
	"id": "238.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.17",
	"title": "238.17 SERVICE TO EXTENSION AREA.",
	"text": "Notwithstanding the provisions of any other law to the contrary, a cable communications system may extend or provide service outside the boundaries of a core service unit if the cable communications system obtains an extension permit issued by the municipality or municipalities which have jurisdiction over the extension area.\nNotwithstanding any law to the contrary, a cable communications system with less than 50 subscribers in a municipality shall be exempt from obtaining a permit from that municipality, unless the municipality chooses to require a permit.\nAny extension permit awarded pursuant to this section shall be issued at a regular or special meeting of the governing body affording reasonable notice and reasonable opportunity to be heard. Such extension permits shall include:\n(a) A schedule of the rates to be charged to the subscribers and the procedure to be used to change subscriber rates;\n(b) A stipulation that the parties to the extension permit agree, to the extent applicable, to abide by those terms of the franchise of the core service unit which pertain to systemwide channel capacity, access channels, equipment for production and reproduction or playback of programming, two-way communications capability, standards for system installation, maintenance and operation, indemnification of the franchisor, liability insurance, abandonment of service, removal of equipment and termination or cancellation of the franchise; and\n(c) A statement to the effect that the expiration date of the extension permit shall be coincident with that of the franchise of the core service unit, provided that a change in the expiration date of the core service unit franchise, by way of either renewal or amendment of the franchise, shall automatically apply to the extension permit unless the municipality with jurisdiction over the extension area elects otherwise.\nNothing in this section shall be construed to prevent a municipality having jurisdiction over an extension area from becoming a party to the franchise of the core service unit under an agreement for the joint exercise of powers executed pursuant to section 471.59.\nNothing in this section shall be construed to prevent a municipality having jurisdiction over an extension area from prescribing extension permit requirements which are in excess of those required by this section, unless such requirements are inconsistent with this chapter.\n[Repealed, 1985 c 285 s 54]\n[Repealed, 1985 c 285 s 54]\n[Repealed, 1985 c 285 s 54]",
	"repealed": false
}