{
	"id": "177.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.42",
	"title": "177.42 DEFINITIONS.",
	"text": "As used in sections 177.41 to 177.44 the terms defined in this section have the meanings given them except where the context indicates otherwise.\n\"Project\" means demolition, erection, construction, alteration, improvement, restoration, remodeling, or repairing of a public building, structure, facility, land, or other public work, which includes any work suitable for and intended for use by the public, or for the public benefit, financed in whole or part by state funds. Project also includes demolition, erection, construction, alteration, improvement, restoration, remodeling, or repairing of a building, structure, facility, land, or public work when the acquisition of property, predesign, design, or demolition is financed in whole or part by state funds.\n\"Area\" means the county or other locality from which labor for any project is normally secured.\n\"Prevailing hours of labor\" means the hours of labor per day and per week worked within the area by a larger number of workers of the same class than are employed within the area for any other number of hours per day and per week. The prevailing hours of labor may not be more than eight hours per day or more than 40 hours per week.\n\"Hourly basic rate\" means the hourly wage paid to any employee.\n\"Prevailing wage rate\" means the hourly basic rate of pay plus the contribution paid to or for the largest number of workers engaged in the same class of labor within the area for medical or hospital care, pensions on retirement or death, compensation for injuries or illness resulting from occupational activity, or insurance to provide any of the foregoing, for unemployment benefits, life insurance, disability and sickness insurance, or accident insurance, for vacation and holiday pay, for defraying the costs of apprenticeship or other similar programs, or for other bona fide fringe benefits, but only where the contractor or subcontractor is not required by other federal, state, or local law to provide any of those benefits, the amount of:\n(1) the rate of contribution irrevocably made by a contractor or subcontractor to a trustee or to a third person under a fund, plan, or program; and\n(2) the rate of costs to the contractor or subcontractor that may be reasonably anticipated in providing benefits to laborers and mechanics pursuant to an enforceable commitment to carry out a financially responsible plan or program which was communicated in writing to the laborers and mechanics affected.\n\"Prevailing wage rate\" includes, for the purposes of section 177.44, rental rates for truck hire paid to those who own and operate the truck.\nThe prevailing wage rate may not be less than a reasonable and living wage.\n\"Employer\" means an individual, partnership, association, corporation, business trust, or other business entity that hires a laborer, worker, or mechanic.",
	"repealed": false
}