{
	"id": "245.4662",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4662",
	"title": "245.4662 MENTAL HEALTH INNOVATION GRANT PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Community partnership\" means a project involving the collaboration of two or more eligible applicants.\n(c) \"Eligible applicant\" means an eligible county, Indian tribe, mental health service provider, hospital, or community partnership. Eligible applicant does not include a state-operated direct care and treatment facility or program under chapters 246 and 246C.\n(d) \"Intensive residential treatment services\" has the meaning given in section 256B.0622.\n(e) \"Metropolitan area\" means the seven-county metropolitan area, as defined in section 473.121, subdivision 2.\nThe commissioner of human services shall, in consultation with stakeholders, award grants to eligible applicants to plan, establish, or operate programs to improve accessibility and quality of community-based, outpatient mental health services and reduce the number of clients admitted to regional treatment centers and community behavioral health hospitals. The commissioner shall award half of all grant funds to eligible applicants in the metropolitan area and half of all grant funds to eligible applicants outside the metropolitan area. An applicant may apply for and the commissioner may award grants for two-year periods. The commissioner may reallocate underspending among grantees within the same grant period. The mental health innovation account is established under section 246.18 for ongoing funding.\n(a) An application must be on a form and contain information as specified by the commissioner but at a minimum must contain:\n(1) a description of the purpose or project for which grant funds will be used;\n(2) a description of the specific problem the grant funds will address;\n(3) a letter of support from the local mental health authority;\n(4) a description of achievable objectives, a work plan, and a timeline for implementation and completion of processes or projects enabled by the grant; and\n(5) a process for documenting and evaluating results of the grant.\n(b) The commissioner shall review each application to determine whether the application is complete and whether the applicant and the project are eligible for a grant. In evaluating applications according to paragraph (c), the commissioner shall establish criteria including, but not limited to: the eligibility of the project; the applicant's thoroughness and clarity in describing the problem grant funds are intended to address; a description of the applicant's proposed project; a description of the population demographics and service area of the proposed project; the manner in which the applicant will demonstrate the effectiveness of any projects undertaken; the proposed project's longevity and demonstrated financial sustainability after the initial grant period; and evidence of efficiencies and effectiveness gained through collaborative efforts. The commissioner may also consider other relevant factors. In evaluating applications, the commissioner may request additional information regarding a proposed project, including information on project cost. An applicant's failure to provide the information requested disqualifies an applicant. The commissioner shall determine the number of grants awarded.\n(c) Eligible applicants may receive grants under this section for purposes including, but not limited to, the following:\n(1) intensive residential treatment services providing time-limited mental health services in a residential setting;\n(2) the creation of stand-alone urgent care centers for mental health and psychiatric consultation services, crisis residential services, or collaboration between crisis teams and critical access hospitals;\n(3) establishing new community mental health services or expanding the capacity of existing services, including supportive housing; and\n(4) other innovative projects that improve options for mental health services in community settings and reduce the number of clients who remain in regional treatment centers and community behavioral health hospitals beyond when discharge is determined to be clinically appropriate.\nMS 2020 [Repealed, 2022 c 55 art 1 s 187]",
	"repealed": false
}