{
	"id": "97A.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.105",
	"title": "97A.105 GAME FARMS.",
	"text": "(a) A person may breed and propagate game birds, bear, or mute swans only on privately owned or leased land and after obtaining a license. Any of the permitted animals on a game farm may be sold to other licensed game farms. \"Privately owned or leased land\" includes waters that are shallow or marshy, are not actually navigable, and are not of substantial beneficial public use. Before an application for a license is considered, the applicant must enclose the area to sufficiently confine the animals to be raised in a manner approved by the commissioner. A license may be granted only if the commissioner finds the application is made in good faith with intention to actually carry on the business described in the application and the commissioner determines that the facilities are adequate for the business.\n(b) A person may purchase live game birds or their eggs without a license if the birds or eggs, or birds hatched from the eggs, are released into the wild, consumed, or processed for consumption within one year after they were purchased or hatched. This paragraph does not apply to the purchase of migratory waterfowl or their eggs.\n(c) A person may not introduce mute swans into the wild without a permit issued by the commissioner.\n(a) A game farm license is transferable with the transfer of all or a portion of the title or leasehold of the land if:\n(1) the land transferred complies with the license requirements;\n(2) the land is used for the purposes of the license; and\n(3) a verified written report of the existing and intended land use is made to the commissioner, accompanied by a copy of deed, assignment, lease, or other instrument transferring the corresponding title or leasehold in the enclosed land.\n(b) A transfer of less than the whole interest in the license is not valid. Each bona fide partner or associate in the ownership or operation of a game farm must obtain a separate license.\nAll wild animals and their offspring, of the species identified in the license, that are within the enclosure are the property of the game farm licensee.\n[Repealed, 2003 c 128 art 1 s 176]\n[Repealed, 2003 c 128 art 1 s 176]\n(a) A sale of live animals from a licensed game farm is not valid unless the animals are delivered to the purchaser or they are identified and kept separately.\n(b) Live animals sold through auction or through a broker are considered to be sold by the game farm licensee.\n(c) The sale agreement or contract must be in writing. The licensee must notify a purchaser of the death of an animal within 30 days and of the number of increase before July 20 of each year.\nThe commissioner shall prescribe:\n(1) the manner that products of wild animals raised on game farms may be sold or transported; and\n(2) the tags or seals to be affixed to the products.\nMS 2022 [Repealed by amendment, 2024 c 116 art 6 s 2]\nMS 2022 [Repealed by amendment, 2024 c 116 art 6 s 2]\nA licensee that does not comply with a provision of this section subjects all wild animals on the game farm to confiscation.\nThe commissioner may adopt rules for:\n(1) issuing game farm licenses;\n(2) inspecting game farm facilities;\n(3) acquiring and disposing of game farm animals; and\n(4) record keeping and reporting by game farm licensees, including transactions handled by auction or broker.",
	"repealed": false
}