{
	"id": "609A.017",
	"url": "https://www.revisor.mn.gov/statutes/cite/609A.017",
	"title": "609A.017 MISTAKEN IDENTITY; AUTOMATIC EXPUNGEMENT.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Conviction\" means a plea of guilty, a verdict of guilty by a jury, or a finding of guilty by a court.\n(c) \"Mistaken identity\" means a person was incorrectly identified as being a different person:\n(1) because the person's identity had been transferred, used, or possessed in violation of section 609.527; or\n(2) as a result of misidentification by a witness or law enforcement, confusion on the part of a witness or law enforcement as to the identity of the person who committed the crime, misinformation provided to law enforcement as to the identity of the person who committed the crime, or some other mistake on the part of a witness or law enforcement as to the identity of the person who committed the crime.\nIf, before a conviction, a prosecutor determines that a defendant was issued a citation, charged, indicted, or otherwise prosecuted as the result of mistaken identity, the prosecutor must dismiss or move to dismiss the action or proceeding and must state in writing or on the record that mistaken identity is the reason for the dismissal.\n(a) The court shall issue an order of expungement without the filing of a petition when an action or proceeding is dismissed based on a determination that a defendant was issued a citation, charged, indicted, or otherwise prosecuted as the result of mistaken identity. The order shall cite this section as the basis for the order.\n(b) An order issued under this section is not subject to the considerations or standards identified in section 609A.025 or 609A.03, subdivision 5, paragraph (a), (b), or (c).\n(a) An order issued under this section is not subject to the limitations in section 609A.03, subdivision 7a or 9. The effect of the court order to seal the record of the proceedings shall be to restore the person, in the contemplation of the law, to the status the person occupied before the arrest, indictment, or information. The person shall not be guilty of perjury or otherwise of giving a false statement if the person fails to acknowledge the arrest, indictment, information, or trial in response to any inquiry made for any purpose.\n(b) A criminal justice agency may seek access to a record that was sealed under this section for purposes of determining whether the subject of the order was identified in any other action or proceeding as the result of mistaken identity or for a criminal investigation, prosecution, or sentencing involving any other person. The requesting agency must obtain an ex parte court order after stating a good-faith basis to believe that opening the record may lead to relevant information.\n(c) The court administrator must distribute and confirm receipt of an order issued under this section pursuant to section 609A.03, subdivision 8.\n(d) Data on the person whose offense has been expunged contained in a letter or other notification sent under this subdivision are private data on individuals as defined in section 13.02.",
	"repealed": false
}