{
	"id": "241.068",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.068",
	"title": "241.068 HOMELESSNESS MITIGATION PLAN; ANNUAL REPORTING ON HOMELESSNESS.",
	"text": "(a) The commissioner of corrections shall develop and implement a homelessness mitigation plan for individuals released from prison. At minimum, the plan must include:\n(1) redesigning of business practices and policies to boost efforts to prevent homelessness for all persons released from prison;\n(2) efforts to increase interagency and intergovernmental collaboration between state and local governmental units to identify and leverage shared resources; and\n(3) development of internal metrics for the agency to report on its progress toward implementing the plan and achieving the plan's goals.\n(b) The commissioner shall submit the plan to the chairs and ranking minority members of the legislative committees having jurisdiction over criminal justice policy and finance and housing finance and policy by October 31, 2022.\n(a) By February 15 of each year beginning in 2022, the commissioner shall report to the chairs and ranking minority members of the legislative committees having jurisdiction over criminal justice policy and finance and housing finance and policy the following information on adults, disaggregated by race, gender, and county of release:\n(1) the total number released to homelessness from prison;\n(2) the total number released to homelessness by each Minnesota correctional facility;\n(3) the total number released to homelessness by county of release; and\n(4) the total number under supervised, intensive supervised, or conditional release following release from prison who reported experiencing homelessness or a lack of housing stability.\n(b) Beginning with the 2024 report and continuing until the 2033 report, the commissioner shall include in the report required under paragraph (a) information detailing progress, measures, and challenges to the implementation of the homelessness mitigation plan required by subdivision 1.",
	"repealed": false
}