{
	"id": "504B.381",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.381",
	"title": "504B.381 EMERGENCY TENANT REMEDIES ACTION.",
	"text": "A person authorized to bring an action under section 504B.395, subdivision 1, may petition the court for relief:\n(1) when a unit of government has revoked a rental license, issued a condemnation order, issued a notice of intent to condemn, or otherwise deemed the property uninhabitable; or\n(2) in cases of emergency involving the following services and facilities when the landlord is responsible for providing them:\n(i) a serious infestation;\n(ii) the loss of running water;\n(iii) the loss of hot water;\n(iv) the loss of heat;\n(v) the loss of electricity;\n(vi) the loss of sanitary facilities;\n(vii) a nonfunctioning refrigerator;\n(viii) if included in the lease, a nonfunctioning air conditioner;\n(ix) if included in the lease, no functioning elevator;\n(x) any conditions, services, or facilities that pose a serious and negative impact on health or safety; or\n(xi) other essential services or facilities.\nThe venue of the action authorized by this section is the county where the residential building alleged to contain the emergency condition is located.\nThe petitioner must present a verified petition to the district court that contains:\n(1) a description of the premises and the identity of the landlord;\n(2) a statement of the facts and grounds that demonstrate the existence of an emergency caused by the loss of essential services or facilities; and\n(3) a request for relief.\nThe petitioner must attempt to notify the landlord, at least 24 hours before application to the court, of the petitioner's intent to seek emergency relief. An order may be granted without notice to the landlord if the court finds that reasonable efforts, as set forth in the petition or by separate affidavit, were made to notify the landlord but that the efforts were unsuccessful.\nProvided proof that the petitioner has given the notice required in subdivision 4 to the landlord, if the court finds based on the petitioner's emergency ex parte motion for relief, affidavit, and other evidence presented that the landlord violated subdivision 1, then the court shall order that the landlord immediately begin to remedy the violation and may order relief as provided in section 504B.425. The court and petitioner shall serve the petition and order on the landlord personally or by mail as soon as practicable. The court shall include notice of a hearing and, at the hearing, shall consider evidence of alleged violations, defenses, compliance with the order, and any additional relief available under section 504B.425. The court and petitioner shall serve the notice of hearing on the ex parte petition and emergency order personally or by mail as soon as practicable.\nThis section does not extend to emergencies that are the result of the deliberate or negligent act or omission of a residential tenant or anyone acting under the direction or control of the residential tenant.\nSection 504B.395, subdivisions 3 and 4, do not apply to a petition for emergency relief under this section.\nThe court administrator may charge a filing fee in the amount set for complaints and counterclaims in conciliation court, subject to the filing of an inability to pay affidavit.",
	"repealed": false
}