{
	"id": "469.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.46",
	"title": "469.46 COUNTY TAX AUTHORITY.",
	"text": "(a) Notwithstanding sections 297A.99, 297A.993, and 477A.016, or any other contrary provision of law, ordinance, or charter, and in addition to any taxes the county may impose under another law or statute, the Board of Commissioners of Olmsted County may, by resolution, impose a transit tax of up to one quarter of one percent on retail sales and uses taxable under chapter 297A. The provisions of section 297A.99, subdivisions 4 to 13, govern the imposition, administration, collection, and enforcement of the tax authorized under this paragraph.\n(b) The Board of Commissioners of Olmsted County may, by resolution, levy an annual wheelage tax of up to $10 on each motor vehicle kept in the county when not in operation which is subject to annual registration and taxation under chapter 168, for transportation projects within the county. The wheelage tax must not be imposed on the vehicles exempt from wheelage tax under section 163.051, subdivision 1. The board, by resolution, may provide for collection of the wheelage tax by county officials, or it may request that the tax be collected by the state registrar on behalf of the county. The provisions of section 163.051, subdivisions 2, 2a, 3, and 7, must govern the administration, collection, and enforcement of the tax authorized under this paragraph. The tax authorized under this section is in addition to any tax the county may be authorized to impose under section 163.051, but until January 1, 2018, the county tax imposed under this paragraph, in combination with any tax imposed under section 163.051, must equal the specified rate under section 163.051.\n(c) The proceeds of any taxes imposed under paragraph (a), less refunds and costs of collection, must be first used by the county to meet its local matching contributions under section 469.47, subdivision 6, for financing transit infrastructure related to the public infrastructure projects contained in the development plan and approved by the corporation, including any financing costs. Revenues collected in any calendar year in excess of the county obligation to pay for projects contained in the development plan may be retained by the county and used for funding other transportation projects, including roads and bridges, airports, and transportation improvements.\n(d) Any taxes imposed under paragraph (a) expire December 31, 2049, or at an earlier time if approved by resolution of the county board of commissioners. The taxes must not terminate before the county board of commissioners determines that revenues from these taxes and any other revenue source the county dedicates are sufficient to pay the county share of transit project costs and financing costs under the development plan.",
	"repealed": false
}