{
	"id": "204B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/204B.09",
	"title": "204B.09 TIME AND PLACE OF FILING AFFIDAVITS AND PETITIONS.",
	"text": "(a) Except as otherwise provided by this subdivision, affidavits of candidacy and nominating petitions for county, state, and federal offices filled at the state general election shall be filed not more than 84 days nor less than 70 days before the state primary. The affidavit may be prepared and signed at any time between 60 days before the filing period opens and the last day of the filing period.\n(b) Notwithstanding other law to the contrary, the affidavit of candidacy must be signed in the presence of a notarial officer or an individual authorized to administer oaths under section 358.10.\n(c) This provision does not apply to candidates for presidential elector nominated by major political parties. Major party candidates for presidential elector are certified under section 208.03. Other candidates for presidential electors may file petitions at least 77 days before the general election day pursuant to section 204B.07. Nominating petitions to fill vacancies in nominations shall be filed as provided in section 204B.13. No affidavit or petition shall be accepted later than 5:00 p.m. on the last day for filing.\n(d) Affidavits and petitions for county offices must be filed with the county auditor of that county. Affidavits and petitions for federal offices must be filed with the secretary of state. Affidavits and petitions for state offices must be filed with the secretary of state or with the county auditor of the county in which the candidate maintains residence.\n(e) Affidavits other than those filed pursuant to subdivision 1a must be submitted by mail or by hand, notwithstanding chapter 325L, or any other law to the contrary and must be received by 5:00 p.m. on the last day for filing.\n(a) A candidate for special district, county, state, or federal office who will be absent from the state during the filing period may submit a properly executed affidavit of candidacy, the appropriate filing fee, and any necessary petitions in person to the filing officer. The candidate shall state in writing the reason for being unable to submit the affidavit during the filing period. The affidavit, filing fee, if any, and petitions must be submitted to the filing officer during the seven days immediately preceding the candidate's absence from the state. Nominating petitions may be signed during the 14 days immediately preceding the date when the affidavit of candidacy is filed.\n(b) A candidate for special district, county, state, or federal office who will be absent from the state during the entire filing period or who must leave the state for the remainder of the filing period and who certifies to the secretary of state that the circumstances constitute an emergency and were unforeseen, may submit a properly executed affidavit of candidacy by facsimile device or by transmitting electronically a scanned image of the affidavit to the secretary of state during the filing period. The candidate shall state in writing the specific reason for being unable to submit the affidavit by mail or by hand during the filing period or in person prior to the start of the filing period. The affidavit of candidacy, filing fee, if any, and any necessary petitions must be received by the secretary of state by 5:00 p.m. on the last day for filing. If the candidate is filing for a special district or county office, the secretary of state shall forward the affidavit of candidacy, filing fee, if any, and any necessary petitions to the appropriate filing officer.\nAffidavits of candidacy and nominating petitions for city, town or other elective offices shall be filed during the time and with the official specified in chapter 205 or other applicable law or charter, except as provided for a special district candidate under subdivision 1a. Affidavits of candidacy and applications filed on behalf of eligible voters for school board office shall be filed during the time and with the official specified in chapter 205A or other applicable law. Affidavits of candidacy and nominating petitions filed under this subdivision must be submitted by mail or by hand, notwithstanding chapter 325L, or any other law to the contrary, and must be received by the appropriate official within the specified time for the filing of affidavits and petitions for the office.\n(a) A candidate for county, state, or federal office who wants write-in votes for the candidate to be counted must file a written request with the filing office for the office sought not more than 84 days before the primary and no later than the seventh day before the general election. The filing officer shall provide copies of the form to make the request. The filing officer shall not accept a written request later than 5:00 p.m. on the last day for filing a written request.\n(b) The governing body of a statutory or home rule charter city may adopt a resolution governing the counting of write-in votes for local elective office. The resolution may:\n(1) require the candidate to file a written request with the chief election official no later than the seventh day before the city election if the candidate wants to have the candidate's write-in votes individually recorded; or\n(2) require that write-in votes for an individual candidate only be individually recorded if the total number of write-in votes for that office is equal to or greater than the fewest number of non-write-in votes for a ballot candidate.\nIf the governing body of the statutory or home rule charter city adopts a resolution authorized by this paragraph, the resolution must be adopted and the city clerk must notify the county auditor before the first day of filing for office. A resolution adopted under this paragraph remains in effect until a subsequent resolution on the same subject is adopted by the governing body of the statutory or home rule charter city.\n(c) The governing body of a township, school district, hospital district, park district, soil and water district, or other ancillary elected district may adopt a resolution governing the counting of write-in votes for local elective office. The resolution may require that write-in votes for an individual candidate only be individually recorded if the total number of write-in votes for that office is equal to or greater than the fewest number of non-write-in votes for a ballot candidate. If a governing body adopts a resolution authorized by this paragraph, the resolution must be adopted and the clerk must notify the county auditor before the first day of filing for office. A resolution adopted under this paragraph remains in effect until a subsequent resolution on the same subject is adopted by the governing body.\n(d) A candidate for president of the United States who files a request under this subdivision must include the name of a candidate for vice president of the United States. The request must also include the name of at least one candidate for presidential elector. The total number of names of candidates for presidential elector on the request may not exceed the total number of electoral votes to be cast by Minnesota in the presidential election.\n(e) A candidate for governor who files a request under this subdivision must file jointly with another individual seeking nomination as a candidate for lieutenant governor. A candidate for lieutenant governor who files a request under this subdivision must file jointly with another individual seeking nomination as a candidate for governor.",
	"repealed": false
}