{
	"id": "352B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/352B.11",
	"title": "352B.11 RETIREES.",
	"text": "(a) A member who has not received other benefits under this chapter is entitled to a refund of payments made by salary deduction, plus interest, if the member is separated, either voluntarily or involuntarily, from the state service that entitled the member to membership.\n(b) A refund under section 352B.08, subdivision 2, paragraph (c), does not result in a forfeiture of salary credit for the allowable service credit covered by the refund.\n(c) In the event of the member's death, if there are no survivor benefits payable under this chapter, a refund plus interest is payable to the last designated beneficiary on a form filed with the director before death, or if no designation is filed, is payable to the member's estate. Interest under this subdivision must be calculated as provided in section 352.22, subdivision 2. To receive a refund, the application must be made on a form prescribed by the executive director.\n(a) Each dependent child, as defined in section 352B.011, subdivision 6, is entitled to receive a monthly annuity equal to ten percent of the average monthly salary of the deceased member.\n(b) A dependent child over 18 and under 23 years of age also may receive the monthly benefit provided in this section if the child is continuously attending an accredited school as a full-time student during the normal school year as determined by the director. If the child does not continuously attend school, but separates from full-time attendance during any part of a school year, the annuity must cease at the end of the month of separation.\n(c) In addition, a payment of $20 per month must be prorated equally to the surviving dependent children when the former member is survived by more than one dependent child.\n(d) Payments for the benefit of any dependent child must be made to the surviving spouse, or if there is none, to the legal guardian of the child.\n(e) The monthly benefit for any one family, including a surviving spouse benefit, if applicable, must not be less than 50 percent nor exceed 70 percent of the average monthly salary of the deceased member.\nAn application for benefits under this section must be filed in the office of the system in a form and manner prescribed by the executive director. The benefit shall begin to accrue the day following the date of death but shall not be retroactive for more than six months before the date the application is filed.\n(a) If an active member with three or more years of allowable service if first employed before July 1, 2013, or with at least five years of allowable service if first employed after June 30, 2013, dies before attaining age 55, the surviving spouse is entitled to a benefit for life equal to 50 percent of the average monthly salary of the deceased member. On the first of the month next following the date on which the deceased member would have attained exact age 55, in lieu of continued receipt of the prior benefit, the surviving spouse is eligible to commence receipt of the second half of a 100 percent joint and survivor annuity if this provides a larger benefit. The joint and survivor annuity must be computed assuming the exact age 55 for the deceased member and the age of the surviving spouse on the date of death.\n(b) If an active member with less than three years of allowable service if first employed before July 1, 2013, or with fewer than five years of allowable service if first employed after June 30, 2013, dies at any age, the surviving spouse is entitled to receive a benefit for life equal to 50 percent of the average monthly salary of the deceased member.\n(c) If an active member with three or more years of allowable service if first employed before July 1, 2013, or with at least five years of allowable service if first employed after June 30, 2013, dies on or after attaining exact age 55, the surviving spouse is entitled to receive a benefit for life equal to 50 percent of the average monthly salary of the deceased member, or the second half of a 100 percent joint and survivor annuity, whichever is larger. The joint and survivor annuity must be computed using the age of the deceased member on the date of death and the age of the surviving spouse on that same date.\n(d) If a disabilitant dies while receiving a disability benefit under section 352B.10 or before the benefit under that section commenced, and an optional annuity was not elected under section 352B.10, subdivision 5, the surviving spouse is entitled to receive a benefit for life equal to 50 percent of the average monthly salary of the deceased member. On the first of the month next following the date on which the deceased member would have attained exact age 55, in lieu of continued receipt of the prior benefit, the surviving spouse is eligible to commence receipt of the second half of a 100 percent joint and survivor annuity if this provides a larger benefit. The joint and survivor annuity must be computed assuming the exact age 55 for the deceased member and the age of the surviving spouse on the date of death.\n(e) If a former member with three or more years of allowable service if first employed before July 1, 2013, or with at least five years of allowable service if first employed after June 30, 2013, who terminated from service and has not received a refund or commenced receipt of any other benefit provided by this chapter, dies, the surviving spouse is entitled to receive as a benefit the second half of a 100 percent joint and survivor annuity, commencing on the first of the month next following the deceased member's date of death, or the first of the month next following the date on which the deceased member would have attained age 55, whichever is later. The joint and survivor annuity must be computed using the age of the deceased member on the date of death and the age of the surviving spouse on that same date.\n(f) If a former member with less than three years of allowable service if first employed before July 1, 2013, or with fewer than five years of allowable service if first employed after June 30, 2013, who terminated from service and has not received a refund or commenced receipt of any other benefit, if applicable, provided by this chapter, dies, the surviving spouse or, if none, the children or, if none, the deceased member's estate is entitled to a refund of the employee contributions plus interest computed as specified in subdivision 1.\n[Repealed, 2013 c 111 art 9 s 11]\nIf the deceased member died under circumstances that entitle the surviving spouse and the dependent child or children to receive benefits under workers' compensation law, the workers' compensation benefits received by the deceased member's survivor or survivors must not be deducted from the benefits payable under this section.\nA survivor benefit under subdivision 2, 2b, or 2c is eligible for postretirement adjustments under section 356.415.\nWhen any member or former member accepts a refund, all existing service credits and all rights and benefits to which the member or former member was entitled before acceptance of the refund terminate.\n(a) When a former member, who has become separated from state service that entitled the member to membership and has received a refund of retirement payments, reenters the state service in a position that entitles the member to membership, that member shall receive credit for the period of prior allowable state service if the member repays into the fund the amount of the refund, plus interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, compounded annually. Repayment must be made as provided in section 352.23, paragraph (d).\n(b) A person who has received a refund from the State Patrol retirement fund who is a member of another public retirement system included in section 356.311 may repay the refund with interest to the State Patrol retirement fund as provided in paragraph (a).\nIf a retired member who did not select an optional annuity under section 352B.08, subdivision 3, dies or if the last eligible recipient of an optional annuity under section 352B.08, subdivision 3, dies and the total amounts paid as an annuity are less than the accumulated member contributions under section 352B.02, subdivision 1a, to the credit of the retired member on the date of retirement, the surviving spouse, or if none, the former member's surviving children in equal shares, or if none, the last recipient's estate is entitled, upon application, to a refund. The refund is equal to the balance of accumulated member contributions under section 352B.02, subdivision 1a, remaining after subtracting the total amount of benefits paid to the decedent.",
	"repealed": false
}