{
	"id": "62U.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62U.10",
	"title": "62U.10 HEALTH CARE TRANSFER, SAVINGS, AND REPAYMENT.",
	"text": "On June 30, 2009, the commissioner of management and budget shall transfer $50,000,000 from the health care access fund to the general fund.\n(a) By June 1, 2009, the commissioner of health shall calculate the annual projected total private and public health care spending for residents of this state and establish a health care spending baseline, beginning for calendar year 2008 and for the next ten years based on the annual projected growth in spending.\n(b) In establishing the health care spending baseline, the commissioner shall use the Centers for Medicare and Medicaid Services forecast for total growth in national health care expenditures and adjust this forecast to reflect the demographics, health status, and other factors deemed necessary by the commissioner. The commissioner shall contract with an actuarial consultant to make recommendations for the adjustments needed to specifically reflect projected spending for residents of this state.\n(c) The commissioner may adjust the projected baseline as necessary to reflect any updated federal projections or account for unanticipated changes in federal policy.\n(d) Medicare and long-term care spending must not be included in the calculations required under this section.\nMS 2020 [Repealed, 2022 c 98 art 14 s 33]\nWhen accumulated savings accruing to state-administered health care programs, as calculated under subdivision 3, meet or exceed $50,000,000, the commissioner of health shall certify that event to the commissioner of management and budget. In the next fiscal year following the certification, the commissioner of management and budget shall transfer $50,000,000 from the general fund to the health care access fund. The amount necessary to make the transfer is appropriated from the general fund to the commissioner of management and budget.\n(a) For purposes of this section, the following definitions apply.\n(b) \"Public health care spending\" means spending for a state-administered health care program.\n(c) \"State-administered health care program\" means medical assistance, MinnesotaCare, and the state employee group insurance program.\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]\nMS 2022 [Repealed, 2023 c 70 art 4 s 113]",
	"repealed": false
}