{
	"id": "84.92",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.92",
	"title": "84.92 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 84.92 to 84.928.\n\"Agricultural zone\" means the areas in Minnesota lying south and west of a line starting at the Minnesota-North Dakota border and formed by rights-of-way of Trunk Highway No. 10, thence easterly along Trunk Highway No. 10 to Trunk Highway No. 23, thence easterly along Trunk Highway No. 23 to Trunk Highway No. 95, thence easterly along Trunk Highway No. 95 to its termination at the Minnesota-Wisconsin border.\n\"Accompanied\" means being subject to continuous direction or control.\n\"Agricultural purpose\" means used exclusively for an agricultural use as defined in subdivision 1d.\n\"Agricultural use\" means use in agriculturally related activities or harvesting of wood for commercial or firewood purposes by any person.\n\"City\" means a home rule charter or statutory city.\n\"Commissioner\" means the commissioner of natural resources.\n\"Dealer\" means a person engaged in the business of selling all-terrain vehicles at wholesale or retail.\n\"Manufacturer\" means a person engaged in the business of manufacturing all-terrain vehicles.\n\"Owner\" means a person, other than a person with a security interest, having a property interest in or title to an all-terrain vehicle and entitled to the use and possession of the vehicle.\n\"Person\" means an individual or an organization as defined in section 336.1-201 (b)(27).\n\"Public road right-of-way\" means the entire right-of-way of a public road, including the traveled portions, banks, ditches, shoulders, and medians of a roadway, that is not privately owned.\n\"Register\" means the act of assigning a registration number to an all-terrain vehicle.\n(a) \"All-terrain vehicle\" or \"vehicle\" means a motorized vehicle with: (1) not less than three, but not more than six low pressure or non-pneumatic tires; (2) a total dry weight of 2,000 pounds or less; and (3) a total width from outside of tire rim to outside of tire rim that is 65 inches or less. All-terrain vehicle includes a class 1 all-terrain vehicle and class 2 all-terrain vehicle.\n(b) All-terrain vehicle does not include an electric-assisted bicycle as defined in section 169.011, subdivision 27, golf cart, mini-truck, dune buggy, or go-cart or a vehicle designed and used specifically for lawn maintenance, agriculture, logging, or mining purposes.\n\"Class 1 all-terrain vehicle\" means an all-terrain vehicle that has a total width from outside of tire rim to outside of tire rim that is 50 inches or less.\n\"Class 2 all-terrain vehicle\" means an all-terrain vehicle that has a total width from outside of tire rim to outside of tire rim that is greater than 50 inches but not more than 65 inches.",
	"repealed": false
}