{
	"id": "354.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.41",
	"title": "354.41 TEACHERS RETIREMENT ASSOCIATION, ELIGIBILITY FOR MEMBERSHIP.",
	"text": "[Repealed, 1974 c 289 s 59]\nEvery teacher in the service of the state or one of its governmental subdivisions as a teacher, except persons specifically excluded, must become a member of the association by the acceptance of such employment.\n[Repealed, 1989 c 319 art 2 s 28]\n(a) A person who is a member on an authorized leave of absence and is employed as an employee or officer by a labor organization that is the exclusive bargaining agent or the labor organization's state affiliate representing teachers covered by this chapter or by an association of school administrators may elect to be a coordinated member of the association based on that employment, subject to the limitations set forth in subdivisions 4a and 4b. However, no person is entitled to membership under this section if the person also is a member of a teachers retirement association in a city of the first class organized under chapter 354A for the same period of service.\n(b) The election must be made within 90 days of commencing employment by the labor organization.\nThe covered salary for a labor organization employee who qualifies for membership under this section is limited to the lesser of:\n(1) the employee's actual salary as defined under section 354.05, subdivision 35; or\n(2) 75 percent of the salary of the governor as set under section 15A.082.\nThe limited covered salary determined under this subdivision must be used in determining employee, employer, and employer additional contributions under section 354.42, subdivisions 2, 3, and 5, and in determining retirement annuities and other benefits under this chapter and chapter 356.\nA retirement annuity is only payable, if the person has met any other applicable requirements, upon the termination by the person who elected coverage under subdivision 4 of employment by the labor organization. The reemployed annuitant earnings limitation set forth in section 354.44, subdivision 5, applies in the event that the person who elected coverage under subdivision 4 retires and is subsequently reemployed while an annuitant by the labor organization or by any other entity employing persons who are covered by the Minnesota Teachers Retirement Association by virtue of that employment.\nFor all members described in subdivision 4, the employee, employer and additional employer contributions shall be the obligation of the employee who elects coverage herein; provided, however, that the employer organization enumerated in subdivision 4 employing such member may pay the employer and additional employer contributions. The employer shall, in any event, deduct the necessary contributions from the employee's salary and remit all contributions to the teachers retirement association pursuant to section 354.42, except that if any such member is on leave of absence from a governmental employer unit, these contributions shall be forwarded by the employer organization to the governmental employer unit for remittance to the fund as described in this chapter.\n[Repealed, 1981 c 224 s 276]\nMembers of the association as described in subdivision 4 or 9 and employees of the teachers retirement association are not eligible for election to the board of trustees.\n[Repealed, 1981 c 224 s 276]\n[Repealed, 1Sp2001 c 10 art 12 s 3]",
	"repealed": false
}