{
	"id": "214.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.001",
	"title": "214.001 POLICY AND REGULATION.",
	"text": "The legislature finds that the interests of the people of the state are served by the regulation of certain occupations. The legislature further finds: (1) that it is desirable for boards composed primarily of members of the occupations so regulated to be charged with formulating the policies and standards governing the occupation; (2) that economical and efficient administration of the regulation activities can be achieved through the provision of administrative services by departments of state government; and (3) that procedural fairness in the disciplining of persons regulated by the boards requires a separation of the investigative and prosecutorial functions from the board's judicial responsibility.\nThe legislature declares that no regulation shall be imposed upon any occupation unless required for the safety and well being of the citizens of the state. In evaluating whether an occupation shall be regulated, the following factors shall be considered:\n(1) whether the unregulated practice of an occupation may harm or endanger the health, safety and welfare of citizens of the state and whether the potential for harm is recognizable and not remote;\n(2) whether the practice of an occupation requires specialized skill or training and whether the public needs and will benefit by assurances of initial and continuing occupational ability;\n(3) whether the citizens of this state are or may be effectively protected by other means; and\n(4) whether the overall cost effectiveness and economic impact would be positive for citizens of the state.\nIf the legislature finds after evaluation of the factors identified in subdivision 2 that it is necessary to regulate an occupation not heretofore credentialed or regulated, then regulation should be implemented consistent with the policy of this section, in modes in the following order:\n(1) creation or extension of common law or statutory causes of civil action, and the creation or extension of criminal prohibitions;\n(2) imposition of inspection requirements and the ability to enforce violations by injunctive relief in the courts;\n(3) implementation of a system of registration whereby practitioners who will be the only persons permitted to use a designated title are listed on an official roster after having met predetermined qualifications; or\n(4) implementation of a system of licensing whereby a practitioner must receive recognition by the state of having met predetermined qualifications, and persons not so licensed are prohibited from practicing.\nTwo or more of these modes may be simultaneously implemented if necessary and appropriate.\nThe chair of a standing committee in either house of the legislature may request information from the Council of Health Boards on proposals relating to the regulation of health occupations.",
	"repealed": false
}