{
	"id": "168.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.16",
	"title": "168.16 REGISTRATION TAX REFUND; APPROPRIATION.",
	"text": "(a) After the registration tax upon any vehicle has been paid for any registration period, refund must be made for errors made in computing the registration tax or fees and for the error on the part of an owner who may in error have registered a vehicle that was not before, nor at the time of registration, nor at any time thereafter during the preceding registration period, subject to registration tax in this state as provided by section 168.012.\n(b) Unless otherwise provided in this chapter, a claim for a refund of an overpayment of registration tax must be filed within 3-1/2 years from the date of payment.\n(c) The former registered owner of a transferred vehicle, by an assignment in writing endorsed upon the registration certificate and delivered to the commissioner within the time provided in this subdivision, shall assign, except for vehicles registered under section 168.187, to the new owner the right to have the tax paid by the former registered owner accredited to the new owner who duly registers the vehicle unless the registration stickers are surrendered to the commissioner before the first day of the new registration period.\n(d) Any owner is entitled to a refund of the unused portion of the registration tax paid on the owner's vehicle upon filing a claim, verified by the commissioner, if the vehicle is:\n(1) declared by an insurance company to be permanently destroyed due to accident, fire, or an Act of God as defined in section 115B.02; or\n(2) sold to the federal government, the state, or a political subdivision of the state.\n(e) The refund must be equal to the sum of the remaining registration tax attributable for the registration period after the month in which the plates and certificate of registration or title were returned to the commissioner.\n(f) There is hereby appropriated to the persons entitled to a refund, from the fund or account in the state treasury to which the money was credited, an amount sufficient to make the refund and payment.",
	"repealed": false
}