{
	"id": "11A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/11A.04",
	"title": "11A.04 DUTIES AND POWERS; APPROPRIATION.",
	"text": "The state board shall:\n(1) Act as trustees for each fund for which it invests or manages money in accordance with the standard of care set forth in section 11A.09 if state assets are involved and in accordance with chapter 356A if pension assets are involved.\n(2) Formulate policies and procedures deemed necessary and appropriate to carry out its functions. Procedures adopted by the board must allow fund beneficiaries and members of the public to become informed of proposed board actions. Procedures and policies of the board are not subject to the Administrative Procedure Act.\n(3) Employ an executive director as provided in section 11A.07.\n(4) Employ investment advisors and consultants as it deems necessary.\n(5) Prescribe policies concerning personal investments of all employees of the board to prevent conflicts of interest.\n(6) Maintain a record of its proceedings.\n(7) As it deems necessary, establish advisory committees subject to section 15.059 to assist the board in carrying out its duties.\n(8) Not permit state funds to be used for the underwriting or direct purchase of municipal securities from the issuer or the issuer's agent.\n(9) Direct the commissioner of management and budget to sell property other than money that has escheated to the state when the board determines that sale of the property is in the best interest of the state. Escheated property must be sold to the highest bidder in the manner and upon terms and conditions prescribed by the board.\n(10) Undertake any other activities necessary to implement the duties and powers set forth in this section.\n(11) Establish a formula or formulas to measure management performance and return on investment. Public pension funds in the state shall utilize the formula or formulas developed by the state board.\n(12) Except as otherwise provided in article XI, section 8, of the Constitution of the state of Minnesota, employ, at its discretion, qualified private firms to invest and manage the assets of funds over which the state board has investment management responsibility. There is annually appropriated to the state board, from the assets of the funds for which the state board utilizes a private investment manager, sums sufficient to pay the costs of employing private firms. Each year, by January 15, the board shall report to the governor and legislature on the cost and the investment performance of each investment manager employed by the board.\n(13) Adopt an investment policy statement that includes investment objectives, asset allocation, and the investment management structure for the retirement fund assets under its control. The statement may be revised at the discretion of the state board. The state board shall seek the advice of the council regarding its investment policy statement. Adoption of the statement is not subject to chapter 14.\n(14) Adopt a compensation plan setting the terms and conditions of employment for unclassified employees of the state board pursuant to section 43A.18, subdivision 3b.\n(15) Contract, as necessary, with the board of trustees of the Minnesota State Universities and Colleges System for the provision of investment review and selection services under section 354B.25, subdivision 3, and arrange for the receipt of payment for those services.\nThere is annually appropriated to the state board, from the assets of the funds for which the state board provides investment services, sums sufficient to pay the costs of all necessary expenses for the administration of the board. These sums will be deposited in the State Board of Investment operating account, which must be established by the commissioner of management and budget.",
	"repealed": false
}