{
	"id": "122A.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.59",
	"title": "122A.59 COME TEACH IN MINNESOTA HIRING BONUSES.",
	"text": "This section establishes a program to support districts and schools recruiting and offering hiring bonuses for teachers who are American Indian or a person of color from another state or country in order to meet staffing needs in shortage areas in Minnesota.\nA district or school must verify that the hiring bonus is given to persons from another state or country who:\n(1) immediately qualify for a Tier 2 or higher Minnesota license;\n(2) have moved to Minnesota; and\n(3) belong to a racial or ethnic group that is underrepresented among teachers compared to students in the district or school under section 120B.35, subdivision 3, paragraph (b), clause (2).\nA district or school may offer a hiring and retention bonus of a minimum of $4,000 and a maximum of $8,000 to a teacher who meets the eligibility requirements. A teacher who meets the eligibility requirements and meets a licensure shortage area in the economic development region of the state where the school is located may be offered a hiring bonus of a minimum of $5,000 and a maximum of $10,000. A teacher must be paid half of the bonus when starting employment and half after completing four years of service in the hiring district or school if the teacher has demonstrated teaching effectiveness and is not on a professional improvement plan under section 122A.40, subdivision 8, paragraph (b), clause (12) or (13), or section 122A.41, subdivision 5, paragraph (b), clause (12) or (13), or is not being considered for termination for a reason listed in section 122A.40, subdivision 9, including a teacher hired by a school district located in a city of the first class. A teacher who does not complete their first school year upon receiving a hiring bonus must repay the hiring bonus. A teacher must have a Tier 3 or Tier 4 Minnesota teaching license to qualify for the second half of the bonus. A district must prorate the second half of the bonus if the eligible teacher is nonrenewed due to reasons not having to do with teaching effectiveness or misconduct.\n(a) The commissioner must establish a process for districts or schools to seek reimbursement for hiring bonuses given to teachers in shortage areas moving to and working in Minnesota schools experiencing specific shortages. The commissioner must provide guidance for districts to seek repayment of a hiring bonus from a teacher who does not complete the first year of employment. The department may conduct a pilot program with a small number of teachers during the 2022-2023 biennium to establish feasibility. The department must submit a report by December 1, 2022, to the chairs and ranking minority members of the legislative committees with jurisdiction over kindergarten through grade 12 education detailing the effectiveness of the program and recommendations for improvement in future years.\n(b) The commissioner may award participating districts and schools additional funds to administer the program, including out-of-state recruiting efforts and retention activities. The commissioner may allow participating districts and schools to reserve up to five percent of Come Teach in Minnesota funding to administer the program, including for out-of-state recruiting efforts and retention activities.\n(a) An account is established in the special revenue fund known as the \"Come Teach in Minnesota Hiring Bonus program account.\"\n(b) Funds appropriated for the Come Teach in Minnesota Hiring Bonus program under this section must be transferred to the Come Teach in Minnesota Hiring Bonus program account in the special revenue fund.\n(c) Money in the account is annually appropriated to the commissioner for hiring bonuses under this section. Any returned funds are available to be regranted.\n(d) Up to $35,000 annually is appropriated to the commissioner for costs associated with developing and administering the program under this section.",
	"repealed": false
}