{
	"id": "149A.955",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.955",
	"title": "149A.955 NATURAL ORGANIC REDUCTION FACILITIES AND NATURAL ORGANIC REDUCTION.",
	"text": "This section is effective July 1, 2025. A dead human body may only undergo natural organic reduction in this state at a natural organic reduction facility licensed by the commissioner of health.\nAny building to be used as a natural organic reduction facility must comply with all applicable local and state building codes, zoning laws and ordinances, and environmental standards. A natural organic reduction facility must have on site a natural organic reduction system approved by the commissioner and a motorized mechanical device for processing the remains in natural reduction and must have in the building a refrigerated holding facility for the retention of dead human bodies awaiting natural organic reduction. The holding facility must be secure from access by anyone except the authorized personnel of the natural organic reduction facility, preserve the dignity of the remains, and protect the health and safety of the natural organic reduction facility personnel.\nA natural organic reduction facility must use as a natural organic reduction vessel a contained reduction vessel that is designed to promote aerobic reduction and that minimizes odors.\nAny room where the deceased will be prepared for natural organic reduction must be properly lit and ventilated with an exhaust fan. It must be equipped with a functional sink with hot and cold running water. It must have nonporous flooring, such that a sanitary condition is provided. The walls and ceiling of the room must run from floor to ceiling and be covered with tile, or by plaster or sheetrock painted with washable paint or other appropriate material, such that a sanitary condition is provided. The doors, walls, ceiling, and windows must be constructed to prevent odors from entering any other part of the building.\n(a) The room where a licensed mortician prepares a body must be private and must not have a general passageway through it. All windows or other openings to the outside must be treated in a manner that prevents viewing into the room where the deceased will be prepared for natural organic reduction. A viewing window for authorized family members or their designees is not a violation of this subdivision.\n(b) The room must, at all times, be secure from the entrance of unauthorized persons.\n(c) For purposes of this section, \"authorized persons\" are:\n(1) licensed morticians;\n(2) registered interns or students as described in section 149A.91, subdivision 6;\n(3) public officials or representatives in the discharge of their official duties;\n(4) trained natural organic reduction facility operators; and\n(5) the person or persons with the right to control the dead human body as defined in section 149A.80, subdivision 2, and their designees.\n(d) Each door allowing ingress or egress must carry a sign that indicates that the room is private and access is limited. All authorized persons who are present in or enter the room while a body is being prepared for final disposition must be attired according to all applicable state and federal regulations regarding the control of infectious disease and occupational and workplace health and safety.\nAny rooms or areas where the vessels reside or where any operation takes place involving the handling of the vessels or the remains must be ventilated with exhaust fans. The doors, walls, ceiling, and windows shall be constructed to prevent odors from entering any other part of the building. All windows must be treated in a manner that maintains privacy when the remains are handled. A sanitary condition must be provided. Any area where human remains are transferred, prepared, or processed must have nonpourous flooring, and the walls and ceiling of the rooms must run from floor to ceiling and be covered with tile, or by plaster, sheetrock, or concrete painted with washable paint or other appropriate material, such that a sanitary condition is provided. Access to the vessel holding area must only be granted to individuals outlined in subdivision 5 and to authorized visitors at the discretion of the licensed facility under the direct supervision of trained facility staff, provided that such access does not violate subdivision 18.\nThe natural organic reduction facility must have a functional emergency eye wash and quick drench shower.\nThe room where the deceased will be prepared for natural organic reduction, the area where the natural organic reduction vessels are located or where the natural organic reduction operations are undertaken, and all fixtures, equipment, instruments, receptacles, clothing, and other appliances or supplies stored or used in these operations must be maintained in a clean and sanitary condition at all times.\nAll applicable provisions of state and federal regulations regarding exposure to workplace hazards and accidents must be followed to protect the health and safety of all authorized persons at the natural organic reduction facility.\nA licensed natural organic reduction facility may employ unlicensed personnel, provided that all applicable provisions of this chapter are followed. It is the duty of the licensed natural organic reduction facility to provide proper training for all unlicensed personnel, and the licensed natural organic reduction facility shall be strictly accountable for compliance with this chapter and other applicable state and federal regulations regarding occupational and workplace health and safety.\nNo natural organic reduction facility shall naturally reduce or cause to be naturally reduced any dead human body or identifiable body part without receiving written authorization to do so from the person or persons who have the legal right to control disposition as described in section 149A.80 or the person's legal designee. The written authorization must include:\n(1) the name of the deceased and the date of death of the deceased;\n(2) a statement authorizing the natural organic reduction facility to naturally reduce the body;\n(3) the name, address, phone number, relationship to the deceased, and signature of the person or persons with the legal right to control final disposition or a legal designee;\n(4) directions for the disposition of any non-naturally reduced materials or items recovered from the natural organic reduction vessel;\n(5) acknowledgment that some of the remains will be mechanically reduced to a granulated appearance and returned to the natural reduction vessel with the remains for final reduction; and\n(6) directions for the ultimate disposition of the naturally reduced remains.\nThe limitations in section 149A.95, subdivision 5, apply to natural organic reduction facilities.\n(a) No dead human body shall be accepted for final disposition by natural organic reduction unless the body is:\n(1) wrapped in a container, such as a pouch, that is impermeable or leak-resistant;\n(2) accompanied by a disposition permit issued pursuant to section 149A.93, subdivision 3, including a photocopy of the complete death record or a signed release authorizing natural organic reduction received from a coroner or medical examiner; and\n(3) accompanied by a natural organic reduction authorization that complies with subdivision 5.\n(b) A natural organic reduction facility shall refuse to accept delivery of the dead human body:\n(1) where there is a known dispute concerning natural organic reduction of the body delivered;\n(2) where there is a reasonable basis for questioning any of the representations made on the written authorization to naturally reduce; or\n(3) for any other lawful reason.\n(c) When a container or pouch containing a dead human body shows evidence of leaking bodily fluid, the container or pouch and the body must be returned to the contracting funeral establishment, or the body must be transferred to a new container or pouch by a licensed mortician.\n(d) If a dead human body is delivered to a natural organic reduction facility in a container or pouch that is not suitable for placement in a natural organic reduction vessel, the transfer of the body to the vessel must be performed by a licensed mortician.\nA dead human body must be placed in the natural organic reduction vessel to initiate the natural reduction process within 24 hours after the natural organic reduction facility accepts legal and physical custody of the body.\nAll natural organic reduction facility employees handling the containers or pouches for dead human bodies shall use universal precautions and otherwise exercise all reasonable precautions to minimize the risk of transmitting any communicable disease from the body. No dead human body shall be removed from the container or pouch in which it is delivered to the natural organic reduction facility without express written authorization of the person or persons with legal right to control the disposition and only by a licensed mortician. The remains shall be considered a dead human body until after the final reduction. The person or persons with the legal right to control the body may be involved with preparation of the body pursuant to section 149A.01, subdivision 3, paragraph (c).\nAll licensed natural organic reduction facilities shall develop, implement, and maintain an identification procedure whereby dead human bodies can be identified from the time the natural organic reduction facility accepts delivery of the body until the naturally reduced remains are released to an authorized party. After natural organic reduction, an identifying disk, tab, or other permanent label shall be placed within the naturally reduced remains container or containers before the remains are released from the natural organic reduction facility. Each identification disk, tab, or label shall have a number that shall be recorded on all paperwork regarding the decedent. This procedure shall be designed to reasonably ensure that the proper body is naturally reduced and that the remains are returned to the appropriate party. Loss of all or part of the remains or the inability to individually identify the remains is a violation of this subdivision.\nA licensed natural organic reduction facility shall knowingly naturally reduce only dead human bodies or human remains in a natural organic reduction vessel.\nThe final disposition of dead human bodies by natural organic reduction shall be done in privacy. Unless there is written authorization from the person with the legal right to control the final disposition, only authorized natural organic reduction facility personnel shall be permitted in the natural organic reduction area while any human body is awaiting placement or being placed in a natural organic reduction vessel, being removed from the vessel, or being processed for placement for final reduction. This does not prohibit an in-person laying-in ceremony to honor the deceased and the transition prior to the placement.\nExcept with the express written permission of the person with the legal right to control the final disposition, no natural organic reduction facility shall naturally reduce more than one dead human body at the same time and in the same natural organic reduction vessel or introduce a second dead human body into same natural organic reduction vessel until reasonable efforts have been employed to remove all fragments of remains from the preceding natural organic reduction. This subdivision does not apply where commingling of human remains during natural organic reduction is otherwise provided by law. The fact that there is incidental and unavoidable residue in the natural organic reduction vessel used in a prior natural organic reduction is not a violation of this subdivision.\nUpon completion of the natural organic reduction process, reasonable efforts shall be made to remove from the natural organic reduction vessel all the recoverable remains. The remains shall be transported to the processing area, and any non-naturally reducible materials or items shall be separated from the remains and disposed of, in any lawful manner, by the natural organic reduction facility.\nThe remains that remain intact shall be reduced by a motorized mechanical processor to a granulated appearance. The granulated remains and the rest of the naturally reduced remains shall be returned to a natural organic reduction vessel for final reduction. The remains shall be considered a dead human body until after the final reduction.\nExcept with the express written permission of the person with the legal right to control the final deposition or otherwise provided by law, no natural organic reduction facility shall mechanically process the remains of more than one body at a time in the same mechanical processor or introduce the remains of a second body into a mechanical processor until reasonable efforts have been employed to remove all fragments of remains already in the processor. The fact that there is incidental and unavoidable residue in the mechanical processor is not a violation of this subdivision.\nA natural organic reduction facility must:\n(1) ensure that the material in the natural organic reduction vessel naturally reaches and maintains a minimum temperature of 131 degrees Fahrenheit for a minimum of 72 consecutive hours during the process of natural organic reduction;\n(2) analyze each instance of the naturally reduced remains for physical contaminants, including but not limited to intact bone, dental fillings, and medical implants, and ensure naturally reduced remains have less than 0.01 mg/kg dry weight of any physical contaminants;\n(3) collect material samples for analysis that are representative of each instance of natural organic reduction, using a sampling method such as those described in the U.S. Composting Council 2002 Test Methods for the Examination of Composting and Compost, method 02.01-A through E;\n(4) develop and use a natural organic reduction process in which the naturally reduced remains from the process do not exceed the following limits:\n(5) analyze, using a third-party laboratory, the natural organic reduction facility's material samples of naturally reduced remains according to the following schedule:\n(i) the natural organic reduction facility must analyze each of the first 20 instances of naturally reduced remains for the parameters in clause (4);\n(ii) if any of the first 20 instances of naturally reduced remains yield results exceeding the limits in clause (4), the natural organic reduction facility must conduct appropriate processes to correct the levels of the substances in clause (4) and have the resultant remains tested to ensure they fall within the identified limits;\n(iii) if any of the first 20 instances of naturally reduced remains yield results exceeding the limits in clause (4), the natural organic reduction facility must analyze each additional instance of naturally reduced remains for the parameters in clause (4) until a total of 20 samples, not including those from remains that were reprocessed as required in item (ii), have yielded results within the limits in clause (4) on initial testing;\n(iv) after 20 material samples of naturally reduced remains have met the limits in clause (4), the natural organic reduction facility must analyze at least 25 percent of the natural organic reduction facility's monthly instances of naturally reduced remains for the parameters in clause (4) until 80 total material samples of naturally reduced remains are found to meet the limits in clause (4), not including any samples that required reprocessing to meet those limits; and\n(v) after 80 material samples of naturally reduced remains are found to meet the limits in clause (4), the natural organic reduction facility must analyze at least one randomly chosen instance of naturally reduced remains each month for the parameters in clause (4). If fecal coliform or salmonella in the tested remains exceeds the limit for that substance in clause (4), the natural organic reduction facility must analyze each subsequent instance of naturally reduced remains for fecal coliform and salmonella until ten total material samples are found to meet the limits for those substances in clause (4) on initial testing, demonstrating the natural organic reduction process was effectively corrected;\n(6) comply with any testing requirements established by the commissioner for content parameters in addition to those specified in clause (4);\n(7) not release any naturally reduced remains that exceed the limits in clause (4); and\n(8) prepare, maintain, and provide to the commissioner upon request, a report for each calendar year detailing the natural organic reduction facility's activities during the previous calendar year. The report must include the following information:\n(i) the name and address of the natural organic reduction facility;\n(ii) the calendar year covered by the report;\n(iii) the annual quantity of naturally reduced remains;\n(iv) the results of any laboratory analyses of naturally reduced remains; and\n(v) any additional information required by the commissioner.\nIf the naturally reduced remains are to be separated into two or more naturally reduced remains containers according to the directives provided in the written authorization for natural organic reduction, all of the containers shall contain duplicate identification disks, tabs, or permanent labels and all paperwork regarding the given body shall include a notation of the number of and disposition of each container, as provided in the written authorization.\nEvery natural organic reduction facility shall provide for the removal and disposition of any accumulated residue from any natural organic reduction vessel, mechanical processor, or other equipment used in natural organic reduction. Disposition of accumulated residue shall be by any lawful manner deemed appropriate.\nFollowing completion of the natural organic reduction process, the inurned naturally reduced remains shall be released according to the instructions given on the written authorization for natural organic reduction. If the remains are to be shipped, they must be securely packaged and transported by a method that has an internal tracing system available and which provides a receipt signed by the person accepting delivery. Where there is a dispute over release or disposition of the naturally reduced remains, a natural organic reduction facility may deposit the naturally reduced remains in accordance with the directives of a court of competent jurisdiction pending resolution of the dispute or retain the naturally reduced remains until the person with the legal right to control disposition presents satisfactory indication that the dispute is resolved. A natural organic reduction facility must make every effort to ensure naturally reduced remains are not sold or used for commercial purposes.\nIf, after 30 calendar days following the inurnment, the naturally reduced remains are not claimed or disposed of according to the written authorization for natural organic reduction, the natural organic reduction facility shall give written notice, by certified mail, to the person with the legal right to control the final disposition or a legal designee, that the naturally reduced remains are unclaimed and requesting further release directions. Should the naturally reduced remains be unclaimed 120 calendar days following the mailing of the written notification, the natural organic reduction facility may return the remains to the earth respectfully in any lawful manner deemed appropriate.\nEvery natural organic reduction facility shall create and maintain on its premises or other business location in Minnesota an accurate record of every natural organic reduction provided. The record shall include all of the following information for each natural organic reduction:\n(1) the name of the person or funeral establishment delivering the body for natural organic reduction;\n(2) the name of the deceased and the identification number assigned to the body;\n(3) the date of acceptance of delivery;\n(4) the names of the operator of the natural organic reduction process and mechanical processor operator;\n(5) the times and dates that the body was placed in and removed from the natural organic reduction vessel;\n(6) the time and date that processing and inurnment of the naturally reduced remains was completed;\n(7) the time, date, and manner of release of the naturally reduced remains;\n(8) the name and address of the person who signed the authorization for natural organic reduction;\n(9) all supporting documentation, including any transit or disposition permits, a photocopy of the death record, and the authorization for natural organic reduction; and\n(10) the type of natural organic reduction vessel.\nRecords required under subdivision 28 shall be maintained for a period of three calendar years after the release of the naturally reduced remains. Following this period and subject to any other laws requiring retention of records, the natural organic reduction facility may then place the records in storage or reduce them to microfilm, a digital format, or any other method that can produce an accurate reproduction of the original record, for retention for a period of ten calendar years from the date of release of the naturally reduced remains. At the end of this period and subject to any other laws requiring retention of records, the natural organic reduction facility may destroy the records by shredding, incineration, or any other manner that protects the privacy of the individuals identified.",
	"repealed": false
}