{
	"id": "256B.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.051",
	"title": "256B.051 HOUSING STABILIZATION SERVICES.",
	"text": "Housing stabilization services are established to provide housing stabilization services to an individual with a disability that limits the individual's ability to obtain or maintain stable housing. The services support an individual's transition to housing in the community and increase long-term stability in housing, to avoid future periods of being at risk of homelessness or institutionalization.\n(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"At-risk of homelessness\" means (1) an individual that is faced with a set of circumstances likely to cause the individual to become homeless, or (2) an individual previously homeless, who will be discharged from a correctional, medical, mental health, or treatment center, who lacks sufficient resources to pay for housing and does not have a permanent place to live.\n(c) \"Commissioner\" means the commissioner of human services.\n(d) \"Homeless\" means an individual or family lacking a fixed, adequate nighttime residence.\n(e) \"Individual with a disability\" means:\n(1) an individual who is aged, blind, or disabled as determined by the criteria used by the title 11 program of the Social Security Act, United States Code, title 42, section 416, paragraph (i), item (1); or\n(2) an individual who meets a category of eligibility under section 256D.05, subdivision 1, paragraph (a), clause (1), (4), (5) to (8), or (13).\n(f) \"Institution\" means a setting as defined in section 256B.0621, subdivision 2, clause (3), and the Minnesota Security Hospital as defined in section 253.20.\nAn individual with a disability is eligible for housing stabilization services if the individual:\n(1) is 18 years of age or older;\n(2) is enrolled in medical assistance;\n(3) has an assessment of functional need that determines a need for services due to limitations caused by the individual's disability;\n(4) resides in or plans to transition to a community-based setting as defined in Code of Federal Regulations, title 42, section 441.301 (c); and\n(5) has housing instability evidenced by:\n(i) being homeless or at-risk of homelessness;\n(ii) being in the process of transitioning from, or having transitioned in the past six months from, an institution or licensed or registered setting;\n(iii) being eligible for waiver services under chapter 256S or section 256B.092 or 256B.49; or\n(iv) having been identified by a long-term care consultation under section 256B.0911 as at risk of institutionalization.\n(a) An individual's assessment of functional need must be conducted by one of the following methods:\n(1) an assessor according to the criteria established in section 256B.0911, subdivisions 17 to 21, 23, 24, and 29 to 31, using a format established by the commissioner;\n(2) documented need for services as verified by a professional statement of need as defined in section 256I.03, subdivision 12; or\n(3) according to the continuum of care coordinated assessment system established in Code of Federal Regulations, title 24, section 578.3, using a format established by the commissioner.\n(b) An individual must be reassessed within one year of initial assessment, and annually thereafter.\n(a) Housing stabilization services include housing transition services and housing and tenancy sustaining services.\n(b) Housing transition services are defined as:\n(1) tenant screening and housing assessment;\n(2) assistance with the housing search and application process;\n(3) identifying resources to cover onetime moving expenses;\n(4) ensuring a new living arrangement is safe and ready for move-in;\n(5) assisting in arranging for and supporting details of a move; and\n(6) developing a housing support crisis plan.\n(c) Housing and tenancy sustaining services include:\n(1) prevention and early identification of behaviors that may jeopardize continued stable housing;\n(2) education and training on roles, rights, and responsibilities of the tenant and the property manager;\n(3) coaching to develop and maintain key relationships with property managers and neighbors;\n(4) advocacy and referral to community resources to prevent eviction when housing is at risk;\n(5) assistance with housing recertification process;\n(6) coordination with the tenant to regularly review, update, and modify the housing support and crisis plan; and\n(7) continuing training on being a good tenant, lease compliance, and household management.\n(d) A housing stabilization service may include person-centered planning for people who are not eligible to receive person-centered planning through any other service, if the person-centered planning is provided by a consultation service provider that is under contract with the department and enrolled as a Minnesota health care program.\n(e) Housing transition costs are available to persons transitioning from a provider-controlled setting to the person's own home and include:\n(1) security deposits; and\n(2) essential furnishings and supplies.\nA provider eligible for reimbursement under this section shall:\n(1) enroll as a medical assistance Minnesota health care program provider and meet all applicable provider standards and requirements;\n(2) demonstrate compliance with federal and state laws and policies for housing stabilization services as determined by the commissioner;\n(3) comply with background study requirements under chapter 245C and maintain documentation of background study requests and results;\n(4) directly provide housing stabilization services and not use a subcontractor or reporting agent; and\n(5) complete annual vulnerable adult training.\nSupplemental service rates for individuals in settings according to sections 144D.025, 256I.04, subdivision 3, paragraph (a), clause (3), and 256I.05, subdivision 1g, shall be reduced by one-half over a two-year period. This reduction only applies to supplemental service rates for individuals eligible for housing stabilization services under this section.\n(a) Documentation may be collected and maintained electronically or in paper form by providers and must be produced upon request by the commissioner.\n(b) Documentation of a delivered service must be in English and must be legible according to the standard of a reasonable person.\n(c) If the service is reimbursed at an hourly or specified minute-based rate, each documentation of the provision of a service, unless otherwise specified, must include:\n(1) the date the documentation occurred;\n(2) the day, month, and year the service was provided;\n(3) the start and stop times with a.m. and p.m. designations, except for person-centered planning services described under subdivision 5, paragraph (d);\n(4) the service name or description of the service provided; and\n(5) the name, signature, and title, if any, of the provider of service. If the service is provided by multiple staff members, the provider may designate a staff member responsible for verifying services and completing the documentation required by this paragraph.",
	"repealed": false
}