{
	"id": "260D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/260D.06",
	"title": "260D.06 AGENCY REPORT TO COURT AND COURT REVIEW OF CHILD IN VOLUNTARY FOSTER CARE FOR TREATMENT DUE TO DISABILITY.",
	"text": "In the case of a child in voluntary foster care for treatment due to disability under section 260D.03, the agency shall obtain judicial review of the child's voluntary foster care placement within 165 days of the placement.\nThe agency shall obtain judicial review by reporting to the court according to the following procedures:\n(a) A written report shall be forwarded to the court within 165 days of the date of the voluntary placement agreement. The written report shall contain or have attached:\n(1) a statement of facts that necessitate the child's foster care placement;\n(2) the child's name, date of birth, race, gender, and current address;\n(3) the names, race, date of birth, residence, and post office addresses of the child's parents or legal custodian;\n(4) a statement regarding the child's eligibility for membership or enrollment in an Indian tribe and the agency's compliance with applicable provisions of sections 260.751 to 260.835;\n(5) the names and addresses of the foster parents or chief administrator of the facility in which the child is placed, if the child is not in a family foster home or group home;\n(6) a copy of the out-of-home placement plan required under section 260C.212, subdivision 1;\n(7) a written summary of the proceedings of any administrative review required under section 260C.203;\n(8) evidence as specified in section 260C.712 when a child is placed in a qualified residential treatment program as defined in section 260C.007, subdivision 26d; and\n(9) any other information the agency, parent or legal custodian, the child or the foster parent, or other residential facility wants the court to consider.\n(b) In the case of a child in placement due to emotional disturbance, the written report shall include as an attachment, the child's individual treatment plan developed by the child's treatment professional, as provided in section 245.4871, subdivision 21, or the child's standard written plan, as provided in section 125A.023, subdivision 3, paragraph (e).\n(c) In the case of a child in placement due to developmental disability or a related condition, the written report shall include as an attachment, the child's individual service plan, as provided in section 256B.092, subdivision 1b; the child's individual program plan, as provided in Minnesota Rules, part 9525.0004, subpart 11; the child's waiver care plan; or the child's standard written plan, as provided in section 125A.023, subdivision 3, paragraph (e).\n(d) The agency must inform the child, age 12 or older, the child's parent, and the foster parent or foster care facility of the reporting and court review requirements of this section and of their right to submit information to the court:\n(1) if the child or the child's parent or the foster care provider wants to send information to the court, the agency shall advise those persons of the reporting date and the date by which the agency must receive the information they want forwarded to the court so the agency is timely able submit it with the agency's report required under this subdivision;\n(2) the agency must also inform the child, age 12 or older, the child's parent, and the foster care facility that they have the right to be heard in person by the court and how to exercise that right;\n(3) the agency must also inform the child, age 12 or older, the child's parent, and the foster care provider that an in-court hearing will be held if requested by the child, the parent, or the foster care provider; and\n(4) if, at the time required for the report under this section, a child, age 12 or older, disagrees about the foster care facility or services provided under the out-of-home placement plan required under section 260C.212, subdivision 1, the agency shall include information regarding the child's disagreement, and to the extent possible, the basis for the child's disagreement in the report required under this section.\n(e) After receiving the required report, the court has jurisdiction to make the following determinations and must do so within ten days of receiving the forwarded report, whether a hearing is requested:\n(1) whether the voluntary foster care arrangement is in the child's best interests;\n(2) whether the parent and agency are appropriately planning for the child; and\n(3) in the case of a child age 12 or older, who disagrees with the foster care facility or services provided under the out-of-home placement plan, whether it is appropriate to appoint counsel and a guardian ad litem for the child using standards and procedures under section 260C.163.\n(f) Unless requested by a parent, representative of the foster care facility, or the child, no in-court hearing is required in order for the court to make findings and issue an order as required in paragraph (e).\n(g) If the court finds the voluntary foster care arrangement is in the child's best interests and that the agency and parent are appropriately planning for the child, the court shall issue an order containing explicit, individualized findings to support its determination. The individualized findings shall be based on the agency's written report and other materials submitted to the court. The court may make this determination notwithstanding the child's disagreement, if any, reported under paragraph (d).\n(h) The court shall send a copy of the order to the county attorney, the agency, parent, child, age 12 or older, and the foster parent or foster care facility.\n(i) The court shall also send the parent, the child, age 12 or older, the foster parent, or representative of the foster care facility notice of the permanency review hearing required under section 260D.07, paragraph (e).\n(j) If the court finds continuing the voluntary foster care arrangement is not in the child's best interests or that the agency or the parent are not appropriately planning for the child, the court shall notify the agency, the parent, the foster parent or foster care facility, the child, age 12 or older, and the county attorney of the court's determinations and the basis for the court's determinations. In this case, the court shall set the matter for hearing and appoint a guardian ad litem for the child under section 260C.163, subdivision 5.",
	"repealed": false
}