{
	"id": "631.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/631.40",
	"title": "631.40 JUDGMENT ON CONVICTION; JUDGMENT ROLL.",
	"text": "When judgment upon a conviction is rendered, the court administrator shall enter the judgment upon the minutes, stating briefly the offense for which the conviction was had. The court administrator shall then immediately attach together and file the papers specified in clauses (1) to (5). The judgment roll consists of the papers specified in clauses (1) to (5):\n(1) a copy of the minutes of challenge made by the defendant to the panel of the grand jury, or to an individual grand juror, and the proceedings and decisions on the challenges;\n(2) the indictment or complaint and a copy of the minutes of the plea or motion to dismiss or to grant appropriate relief;\n(3) a copy of the minutes of a challenge made to the panel of the trial jury or to an individual juror, and the proceedings and decision on the challenge;\n(4) a copy of the minutes of the trial; and\n(5) a copy of the minutes of the judgment.\nWhen a person is convicted of committing a disqualifying offense, as defined in section 171.3215, subdivision 1, a gross misdemeanor, a fourth moving violation within the previous three years, or a violation of section 169A.20, or a similar statute or ordinance from another state, the court shall determine whether the offender is a school bus driver as defined in section 171.3215, subdivision 1, whether the offender possesses a school bus driver's endorsement on the offender's driver's license and in what school districts the offender drives a school bus. If the offender is a school bus driver or possesses a school bus driver's endorsement, the court administrator shall send a certified copy of the conviction to the Department of Public Safety and to the school districts in which the offender drives a school bus within ten days after the conviction.\nWhen a person is convicted of committing a crime against a minor as defined in section 171.3215, subdivision 2a, the court shall order that the presentence investigation include information about whether the offender is a Head Start bus driver as defined in section 171.3215, subdivision 1, whether the offender possesses a passenger endorsement on the offender's driver's license, and for what Head Start agency the offender drives a Head Start bus. If the offender is a Head Start bus driver or possesses a Head Start bus driver's passenger endorsement, the court administrator shall send a certified copy of the conviction to the Department of Public Safety and to the Head Start agency for which the offender drives a Head Start bus.\nWhen a person is convicted of committing a crime against a minor as defined in section 214.10, subdivision 9, the court shall order that the presentence investigation include information about any professional or occupational license held by the offender. If the offender is a licensed person under section 214.10, subdivision 9, the court administrator shall send a certified copy of the conviction to the board having jurisdiction over the offender's license. Within 30 days of receiving notice of the conviction, the appropriate licensing board must initiate proceedings to consider revoking the offender's license.\nWhen a person who is affiliated with a program or facility governed by the Department of Human Services, Department of Children, Youth, and Families, or Department of Health is convicted of a disqualifying crime, the probation officer or corrections agent shall notify the commissioner of the conviction, as provided in chapter 245C.\nWhen a person is convicted of child abuse, as defined in section 609.185, or sexual abuse under section 609.342, 609.343, 609.344, 609.345, 609.3451, subdivision 3, or 617.23, subdivision 3, the court shall determine whether the person is licensed to teach under chapter 122A. If the offender is a licensed teacher, the court administrator shall send a certified copy of the conviction to the Professional Educator Licensing and Standards Board or the Board of School Administrators, whichever has jurisdiction over the teacher's license, within ten days after the conviction.",
	"repealed": false
}