{
	"id": "62A.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.011",
	"title": "62A.011 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms defined in this section have the meanings given.\n\"Affordable Care Act\" means the federal Patient Protection and Affordable Care Act, Public Law 111-148, as amended, including the federal Health Care and Education Reconciliation Act of 2010, Public Law 111-152, and any amendments to, and any federal guidance or regulations issued under, these acts.\n\"Grandfathered plan\" means a health plan in which an individual was enrolled on March 23, 2010, for as long as it maintains that status in accordance with the Affordable Care Act. Unless otherwise specified, grandfathered plans include both individual and group health plans.\n\"Group health plan\" means a policy or certificate issued to an employer or an employee organization that is both:\n(1) a health plan as defined in subdivision 3; and\n(2) an employee welfare benefit plan as defined in the Employee Retirement Income Security Act of 1974, United States Code, title 29, section 1002, if the plan provides payment for medical care to employees, including both current and former employees, or their dependents, directly or through insurance, reimbursement, or otherwise, including employee welfare benefit plans specifically exempt from the provisions of the Employee Retirement Income Security Act of 1974 under United States Code, title 29, section 1003.\n\"Health carrier\" means an insurance company licensed under chapter 60A to offer, sell, or issue a policy of accident and sickness insurance as defined in section 62A.01; a nonprofit health service plan corporation operating under chapter 62C; a health maintenance organization operating under chapter 62D; a fraternal benefit society operating under chapter 64B; or a joint self-insurance employee health plan operating under chapter 62H.\n\"Health plan\" means a policy or certificate of accident and sickness insurance as defined in section 62A.01 offered by an insurance company licensed under chapter 60A; a subscriber contract or certificate offered by a nonprofit health service plan corporation operating under chapter 62C; a health maintenance contract or certificate offered by a health maintenance organization operating under chapter 62D; a health benefit certificate offered by a fraternal benefit society operating under chapter 64B; or health coverage offered by a joint self-insurance employee health plan operating under chapter 62H. Health plan means individual and group coverage, unless otherwise specified. Health plan does not include coverage that is:\n(1) limited to disability or income protection coverage;\n(2) automobile medical payment coverage;\n(3) liability insurance, including general liability insurance and automobile liability insurance, or coverage issued as a supplement to liability insurance;\n(4) designed solely to provide payments on a per diem, fixed indemnity, or non-expense-incurred basis, including coverage only for a specified disease or illness or hospital indemnity or other fixed indemnity insurance, if the benefits are provided under a separate policy, certificate, or contract for insurance; there is no coordination between the provision of benefits and any exclusion of benefits under any group health plan maintained by the same plan sponsor; and the benefits are paid with respect to an event without regard to whether benefits are provided with respect to such an event under any group health plan maintained by the same plan sponsor;\n(5) credit accident and health insurance as defined in section 62B.02;\n(6) designed solely to provide hearing, dental, or vision care;\n(7) blanket accident and sickness insurance as defined in section 62A.11;\n(8) accident-only coverage;\n(9) a long-term care policy as defined in section 62A.46 or 62S.01;\n(10) issued as a supplement to Medicare, as defined in sections 62A.3099 to 62A.44, or policies, contracts, or certificates that supplement Medicare issued by health maintenance organizations or those policies, contracts, or certificates governed by section 1833 or 1876, section 1851, et seq.; or section 1860D-1, et seq., of title XVIII of the federal Social Security Act, et seq., as amended;\n(11) workers' compensation insurance;\n(12) issued solely as a companion to a health maintenance contract as described in section 62D.12, subdivision 1a, so long as the health maintenance contract meets the definition of a health plan;\n(13) coverage for on-site medical clinics; or\n(14) coverage supplemental to the coverage provided under United States Code, title 10, chapter 55, Civilian Health and Medical Program of the Uniformed Services (CHAMPUS).\n\"Individual health plan\" means a health plan as defined in subdivision 3 that is offered to individuals in the individual market as defined in subdivision 5, but does not mean short-term coverage as defined in section 62A.65, subdivision 7. For purposes of this chapter, a health carrier shall not be deemed to be offering individual health plan coverage solely because the carrier maintains a conversion policy in connection with a group health plan.\n\"Individual market\" means the market for health insurance coverage offered to individuals other than in connection with a group health plan.\n\"MNsure\" means MNsure as defined in section 62V.02.\n\"Qualified health plan\" means a health plan that meets the definition in section 1301(a) of the Affordable Care Act and has been certified by the board of MNsure in accordance with chapter 62V to be offered through MNsure.",
	"repealed": false
}