{
	"id": "241.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.88",
	"title": "241.88 RESTRAINING AN INCARCERATED PREGNANT WOMAN.",
	"text": "(a) A representative of a correctional facility may not restrain a woman known to be pregnant unless the representative makes an individualized determination that restraints are reasonably necessary for the legitimate safety and security needs of the woman, correctional staff, other inmates, or the public. If restraints are determined to be necessary, the restraints must be the least restrictive available and the most reasonable under the circumstances.\n(b) A representative of a correctional facility may not restrain a woman known to be pregnant while the woman is being transported if the restraint is through the use of waist chains or other devices that cross or otherwise touch the woman's abdomen or handcuffs or other devices that cross or otherwise touch the woman's wrists when affixed behind the woman's back. If used, wrist restraints should be applied in such a way that the pregnant woman may be able to protect herself and her fetus in the event of a forward fall.\n(c) A representative of a correctional facility may restrain a woman who is in labor or who has given birth within the preceding three days only if:\n(1) there is a substantial flight risk or some other extraordinary medical or security circumstance that dictates restraints be used to ensure the safety and security of the woman, the staff of the correctional or medical facility, other inmates, or the public;\n(2) the representative has made an individualized determination that restraints are necessary to prevent escape or injury;\n(3) there is no objection from the treating medical care provider; and\n(4) the restraints used are the least restrictive type and are used in the least restrictive manner.\n(d) Section 645.241 does not apply to this section.\nThe head of each correctional facility shall ensure that staff members of the facility who come in contact with pregnant women incarcerated in the facility are provided training on the provisions of this section.\nBy February 15 of each year, the commissioner shall report to the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice policy and funding on the use of restraints on pregnant women, women in labor, and women who have given birth in the preceding three days, who are incarcerated in state and local correctional facilities during the preceding calendar year. For reporting purposes, the use of restraints does not include use of handcuffs on the front of the body of a pregnant woman.",
	"repealed": false
}