{
	"id": "641.263",
	"url": "https://www.revisor.mn.gov/statutes/cite/641.263",
	"title": "641.263 POWERS, DUTIES OF BOARD.",
	"text": "When the regional jail board is satisfied that each cooperating county has appropriated its share of the initial expenses of the regional jail, it shall so certify to the county board of each cooperating county. The county board of each cooperating county then shall order its county treasurer to pay over the authorized initial expense funds to the regional jail fund in the manner provided in section 641.264, subdivision 3.\nThe regional jail board may lease suitable premises or acquire by gift, purchase, or condemnation proceedings instituted in the name of the counties a suitable site, and erect on the site buildings suitable for a regional jail. Condemnation proceedings shall be conducted in the manner provided in chapter 117. No premises shall be leased, site acquired, or building erected without the approval of the county board of each cooperating county and the commissioner of corrections. The regional jail board may by resolution enter into a lease agreement with any statutory or home rule charter city situated within any of the counties, in the same manner and with the same force and effect as a county acting under the provisions of section 641.24; provided that any such lease agreement, and any amendment thereto, shall be approved by the county board of each cooperating county before it is executed.\nThe regional jail board shall operate, control, manage, and maintain the jail, and set charges for the care of inmates. The regional jail board shall appoint a regional jail superintendent who serves at the pleasure of the board and receives compensation set by the board. The superintendent is the chief executive officer of the regional jail, and has the powers of a sheriff and such other powers and duties relating to the operation, management, and maintenance of the jail as the regional jail board may prescribe and as are prescribed by law. The superintendent, with the approval of the board, or as provided in subdivision 4, shall appoint additional employees necessary to operate and maintain the jail. The employees of a regional jail, including the superintendent, are public employees for the purposes of Minnesota Statutes 1961, chapter 353.\nA regional jail merit system may be established under the provisions of this subdivision and Minnesota Statutes 1961, chapter 44. Consistent with standards promulgated by the commissioner of corrections for qualifications of regional jail employees, the cooperating counties, by vote of each county board, may establish, modify, or abandon a merit system for the employment, promotion, discipline, and dismissal of all regional jail employees except the superintendent. Questions relating to the establishment, modification, or abandonment of the merit system shall not be submitted to the voters for their approval. The following words and phrases defined in Minnesota Statutes 1961, section 44.01, have the meanings given in this subdivision for the purposes of a regional jail merit system:\n(1) \"appointing authority\" means the regional jail superintendent;\n(2) \"board\" means the \"personnel board\" consisting of the chair, vice-chair, and secretary of the regional jail board;\n(3) \"council\" means the county boards of the cooperating counties.\nIf construction of the jail permits, the board may, by resolution, authorize multiple occupancy, but the superintendent must maintain strict separation of prisoners to the extent that separation is necessary to ensure prisoners' security, safety, health, and welfare.",
	"repealed": false
}