{
	"id": "168B.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/168B.011",
	"title": "168B.011 DEFINITIONS.",
	"text": "The terms used in this chapter have the meanings given them in this section.\n(a) \"Abandoned vehicle\" means a motor vehicle, as defined in section 169.011, that:\n(1) has remained illegally:\n(i) for a period of more than 48 hours on any property owned or controlled by a unit of government, or more than four hours on that property when it is properly posted; or\n(ii) on private property for a period of time, as determined under section 168B.04, subdivision 2, without the consent of the person in control of the property; and\n(2) lacks vital component parts or is in an inoperable condition such that it has no substantial potential for further use consistent with its usual functions, unless it is kept in an enclosed garage or storage building.\n(b) A classic car or pioneer car, as defined in section 168.10, is not considered an abandoned vehicle.\n(c) Vehicles on the premises of junk yards and automobile graveyards that are defined, maintained, and licensed in accordance with section 161.242, or that are licensed and maintained in accordance with local laws and zoning regulations, are not considered abandoned vehicles.\n(d) A vehicle being held for storage by agreement or being held under police authority or pursuant to a writ or court order is not considered abandoned, nor may it be processed as abandoned while the police hold, writ, or court order is in effect.\n\"Junk vehicle\" means a vehicle that:\n(1) is three years old or older;\n(2) is extensively damaged, with the damage including such things as broken or missing wheels, motor, drive train, or transmission;\n(3) is apparently inoperable;\n(4) does not have a valid, current registration plate; and\n(5) has an approximate fair market value equal only to the approximate value of the scrap in it.\n\"Unauthorized vehicle\" means a vehicle that is subject to removal and impoundment pursuant to section 168B.035 or 168B.04, subdivision 2, but is not a junk vehicle or an abandoned vehicle.\n\"Agency\" means the Minnesota Pollution Control Agency.\n\"Department\" means the Minnesota Department of Public Safety.\n\"Impound\" means to take and hold a vehicle in legal custody. There are two types of impounds, public and nonpublic.\n\"Impound lot operator\" or \"operator\" means a person who engages in impounding or storing, usually temporarily, unauthorized or abandoned vehicles. \"Operator\" includes an operator of a public or nonpublic impound lot, regardless of whether tow truck service is provided.\n\"Motor vehicle\" or \"vehicle\" has the meaning given motor vehicle in section 169.011.\n\"Motor vehicle waste\" means solid waste and liquid wastes derived in the operation of or in the recycling of a motor vehicle, including such things as tires and used motor oil, but excluding scrap metal.\n\"Nonpublic impound lot\" means an impound lot that is not a public impound lot.\n\"Public impound lot\" means an impound lot owned by or exclusively contracted solely for public use by a unit of government under section 168B.09.\n\"Tow truck\" or \"towing vehicle\" means a motor vehicle having a manufacturer's gross vehicle weight rating of 8,000 pounds or more, equipped with a crane and winch, or an attached device used exclusively to transport vehicles, and further equipped to control the movement of the towed or transported vehicle.\n\"Unit of government\" includes a state department or agency, a special purpose district, and a county, statutory or home rule charter city, or town.\n\"Vital component parts\" means those parts of a motor vehicle that are essential to the mechanical functioning of the vehicle, including such things as the motor, drive train, and wheels.",
	"repealed": false
}