{
	"id": "84D.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/84D.10",
	"title": "84D.10 WATERCRAFT AND WATER-RELATED EQUIPMENT REQUIREMENTS AND PROHIBITIONS.",
	"text": "A person may not place or attempt to place into waters of the state water-related equipment, including aquatic plant harvesting or control equipment that has aquatic macrophytes or prohibited invasive species attached except as provided in this section.\nUnless otherwise prohibited by law, a person may place into the waters of the state a watercraft or trailer with aquatic macrophytes:\n(1) that are duckweeds in the family Lemnaceae;\n(2) for purposes of shooting or observation blinds attached in or on watercraft in amounts sufficient for that purpose, if the aquatic macrophytes are emergent and cut above the waterline;\n(3) that are wild rice harvested under section 84.091; or\n(4) in the form of fragments of emergent aquatic macrophytes incidentally transported in or on watercraft or decoys used for waterfowl hunting during the waterfowl season.\n(a) A conservation officer or other licensed peace officer may order:\n(1) the removal of aquatic macrophytes or prohibited invasive species from water-related equipment, including decontamination using hot water or high pressure equipment, before the water-related equipment is transported or before it is placed into waters of the state;\n(2) confinement of the water-related equipment at a mooring, dock, or other location until the water-related equipment is removed from the water;\n(3) removal of water-related equipment from waters of the state to remove prohibited invasive species if the water has not been listed by the commissioner as being infested with that species;\n(4) a prohibition on placing water-related equipment into waters of the state when the water-related equipment has aquatic macrophytes or prohibited invasive species attached in violation of subdivision 1 or when water has not been drained or the drain plug has not been removed in violation of subdivision 4; and\n(5) decontamination of water-related equipment.\n(b) An order for removal of prohibited invasive species under paragraph (a), clause (1), or decontamination of water-related equipment under paragraph (a), clause (5), may include tagging the water-related equipment and issuing a notice that specifies a time frame for completing the removal or decontamination and reinspection of the water-related equipment.\n(c) An inspector who is not a licensed peace officer may issue orders under paragraph (a), clauses (1), (3), (4), and (5).\n(a) When leaving a water of the state, a person must drain water-related equipment holding water and live wells and bilges by removing the drain plug before transporting the water-related equipment. For the purposes of this paragraph, \"transporting\" includes moving water-related equipment over land between connected or unconnected water bodies, but does not include moving water-related equipment within the immediate area required for loading and preparing the water-related equipment for transport over land.\n(b) Drain plugs, bailers, valves, or other devices used to control the draining of water from ballast tanks, bilges, and live wells must be removed or opened while transporting water-related equipment.\n(c) Emergency response vehicles and equipment may be transported on a public road with the drain plug or other similar device replaced only after all water has been drained from the equipment upon leaving the water body.\n(d) Portable bait containers used by licensed aquatic farms, portable bait containers when fishing through the ice except on waters listed infested for viral hemorrhagic septicemia, and marine sanitary systems are exempt from this subdivision.\n(e) A person must not dispose of bait in waters of the state.\n(f) A boat lift, dock, swim raft, or associated equipment that has been removed from any water body may not be placed in another water body until a minimum of 21 days have passed.\n(g) A person who transports water that is appropriated from noninfested surface water bodies and that is transported by a commercial vehicle, excluding watercraft, or commercial trailer, which vehicle or trailer is specifically designed and used for water hauling, is exempt from paragraphs (a) and (b), provided that the person does not discharge the transported water to other surface waters or within 100 feet of a surface water body.\n(h) A person transporting water from noninfested surface water bodies for firefighting or emergencies that threaten human safety or property is exempt from paragraphs (a) and (b).",
	"repealed": false
}