{
	"id": "336B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/336B.01",
	"title": "336B.01 FINANCING STATEMENTS OF PUBLIC UTILITIES, TACONITE AND SEMITACONITE COMPANIES; DEFINITIONS.",
	"text": "When used in sections 336B.01 to 336B.03 the term \"public utility\" means persons, corporations, or other legal entities, their lessees, trustees, and receivers, operating, maintaining, or controlling in this state after June 29, 1966, equipment or facilities for the production, generation, transmission, or distribution at retail of gas, electric, or telephone service for the public and in the transmission and distribution using, or having a right to use, public roads, streets, alleys, or other public ways for the purpose of constructing, using, operating, or maintaining wires, pipes, conduits, or other facilities. No municipality producing or furnishing gas, electric, or telephone service is a public utility under this definition. No person is a public utility if it produces or furnishes its services to less than 50 persons.\nWhen used in sections 336B.01 to 336B.03 the term \"taconite company\" means a person, corporation, or other legal entity, its lessees, trustees, and receivers, engaged in or preparing to engage in the business of mining and beneficiating taconite, whether or not the taconite company may also engage in another business.\nWhen used in sections 336B.01 to 336B.03 the term \"semitaconite company\" means a person, corporation, or other legal entity, its lessees, trustees, and receivers, engaged in or preparing to engage in the business of mining and beneficiating semitaconite, as the term \"semitaconite\" is defined in section 298.34, whether or not the semitaconite company may also engage in another business.\nNotwithstanding any contrary provision in subdivision 1, the term \"public utility\" also means a cooperative association operating, maintaining or controlling in this state after May 11, 1969, equipment or facilities for the production, generation, transmission or distribution of electric services.\nNotwithstanding any contrary provision in subdivision 1, the term \"public utility\" also means a person, corporation, cooperative, or other legal entity, their lessees, trustees, and receivers who are operating, maintaining, or controlling equipment or facilities to provide water quality treatment and management services, as defined by section 115.58, subdivision 1, paragraph (e). \"Public utility\" does not include a municipality that owns or operates equipment or facilities for treating wastewater, furnishing potable water or water for geothermal heating and cooling, managing stormwater runoff or drainage, or reducing or eliminating water pollution.",
	"repealed": false
}