{
	"id": "84.992",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.992",
	"title": "84.992 MINNESOTA NATURALIST CORPS.",
	"text": "The Minnesota Naturalist Corps is established under the direct control and supervision of the commissioner of natural resources.\nThe commissioner of natural resources shall develop and implement a program for the Minnesota Naturalist Corps that supports state parks and trails in providing interpretation of the natural and cultural features of state parks and trails in order to enhance visitors' awareness, understanding, and appreciation of those features and encourages the wise and sustainable use of the environment.\nThe commissioner must develop and implement a training program that adequately prepares Minnesota Naturalist Corps members for the tasks assigned. Each corps member is assigned an interpretive naturalist as a mentor.\nUniforms worn by members of the Minnesota Naturalist Corps must have a pin that includes the name of the Minnesota Naturalist Corps and information that the program is funded by the clean water, land, and legacy amendment to the Minnesota Constitution adopted by the voters in November 2008.\nA person is eligible to enroll in the Minnesota Naturalist Corps if the person is a participant in an approved college internship program.\nMinnesota Naturalist Corps members are not eligible for unemployment benefits and are not eligible for other benefits except workers' compensation. The corps members are not employees of the state within the meaning of section 43A.02, subdivision 21.\nThe commissioner must certify that the assignment of Minnesota Naturalist Corps members will not result in the displacement of currently employed workers or workers on seasonal layoff or layoff from a substantially equivalent position, including partial displacement such as reduction in hours of nonovertime work, wages, or other employment benefits. The department may not terminate, lay off, reduce the seasonal hours of, or reduce the working hours of any employee for the purpose of using a corps member with available funds.",
	"repealed": false
}