{
	"id": "458D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.05",
	"title": "458D.05 COMPREHENSIVE PLAN.",
	"text": "The board shall prepare and by resolution adopt a comprehensive plan for the collection, treatment, and disposal of sewage in all or a designated part of the district through a system of interceptors and treatment works for such designated period as the board deems proper and reasonable; and, when adopted, such plan shall be followed in that part of the district covered in the plan, subject to the provisions of sections 458D.01 to 458D.24. The plan shall take into account the preservation and best and most economic use of water and other natural resources in the area; the preservation, use and potential for use of lands adjoining waters of the state to be used for the disposal of sewage; and the impact such a disposal system will have on present and future land use in the area affected thereby. The plan shall include the general location of needed interceptors and treatment works, a description of the area that is to be served by the various interceptors and treatment works, a long range capital improvements program and such other details as the board shall deem appropriate. In developing the plan, the board shall consult with persons designated by governing bodies of any municipal or public corporation or governmental or political subdivision or agency within the district to represent such entities for such purpose and shall consider the data, resources and input offered to the board by such entities and any planning agency acting on behalf of one or more such entities. Such plan may be revised as often as the board deems necessary.\nThe board shall prepare by January 1, 1975, and by resolution adopt a comprehensive plan for the management and disposal of solid waste in the district. The plan shall be subject to the approval of the agency. In developing the plan, the board shall consider the preservation and best and most economical use of the land and water resources in the district. The plan shall include a statement of goals and policies for solid waste disposal, criteria for solid waste disposal sites, the general location and capacities of needed disposal sites and facilities, projections of disposal capacities required, regulations for the operation of disposal sites and facilities, a description of disposal techniques which may be used, the type or types of solid waste to be disposed of at each site or facility, a long range capital improvements program and such other details as the board shall require. Criteria for solid waste disposal sites and regulations for the operation of disposal sites and facilities, included in the plan, shall be consistent with regulations adopted by the agency. The plan may provide for the continued operation or acquisition and operation of disposal sites or facilities by local government units, private persons or the board and may provide that only the board shall own, maintain and operate disposal sites and facilities within the district. In developing the plan, the board shall consult with persons designated by governing bodies of any municipal or public corporation or governmental or political subdivision or agency within the district and shall consider their data. The plan may be revised as often as the board deems necessary. A copy of the comprehensive plan and each revision thereof shall be delivered or mailed to the agency, the county auditor of each county located within the district and the clerk of each city and township in the district. Prior to the adoption by the board of its comprehensive plan, no local government unit shall acquire any solid waste disposal site or facility unless approved by the board. After the comprehensive plan is adopted local government units and persons shall acquire and operate solid waste disposal sites and facilities in accordance with the plan. The board shall hold hearings as provided in subdivision 2 and coordinate with municipal plans as provided in subdivision 3.\nBefore adopting the first or any subsequent comprehensive plan the board shall hold a public hearing on such proposed plan at such time and place in the district as it shall determine. The hearing may be continued from time to time. Not less than 45 days before the hearing, the board shall publish notice thereof in a newspaper or newspapers having general circulation in the district, stating the date, time and place of the hearing, and the place where the proposed plan may be examined by any interested person. At the hearing, all interested persons shall be permitted to present their views on the plan.\nAs soon as practicable after the adoption by the board of the first applicable comprehensive plan, and before undertaking the construction of new sewers or other disposal facilities or the substantial alteration or improvement of any existing sewers or other disposal facilities, each local government unit included in the plan shall adopt a similar comprehensive plan and program for the collection, treatment and disposal of sewage for which the local government unit is responsible, coordinated with the board's plan, and may revise the same as often as it deems necessary. Each such local plan or revision thereof shall be submitted forthwith to the board for review and shall be subject to the approval of the board as to those features of the plan affecting the board's responsibilities as determined by the board. Any such features disapproved by the board shall be modified in accordance with the board's recommendations. Once the board's plan is adopted, no such construction project involving such features shall be undertaken by the local government unit unless its governing body shall first find the project to be in accordance with the government unit's comprehensive plan and program as approved by the board. Prior to approval by the board of the comprehensive plan and program of any local government unit in the district, no such construction project shall be undertaken by such government unit unless approval of the project is first secured from the board as to those features of the project affecting the board's responsibilities as determined by the board.",
	"repealed": false
}