{
	"id": "115C.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.09",
	"title": "115C.09 REIMBURSEMENT.",
	"text": "(a) The board shall provide reimbursement to eligible applicants for reimbursable costs.\n(b) The following costs are reimbursable for purposes of this chapter:\n(1) corrective action costs incurred by the applicant and documented in a form prescribed by the board. Corrective action costs incurred by the applicant include costs for physical removal of a tank when the physical removal is part of a corrective action, regardless of whether the tank is leaking at the time of removal, and the removal is directed or approved by the commissioner;\n(2) costs that the responsible person is legally obligated to pay as damages to third parties for bodily injury, property damage, or corrective action costs incurred by a third party caused by a release where the responsible person's liability for the costs has been established by a court order or court-approved settlement; and\n(3) up to 180 days of interest costs associated with the financing of corrective action and incurred by the applicant in a written extension of credit or loan that has been signed by the applicant and executed after July 1, 2002, provided that the applicant documents that:\n(i) the interest costs are incurred as a result of an extension of credit or loan from a financial institution; and\n(ii) the board has not considered the application within the applicable time frame specified in subdivision 2a, paragraph (c).\n(c) Interest costs meeting the requirements of paragraph (b), clause (3), are eligible only when they are incurred between the date a complete initial application is received by the board, or the date a complete supplemental application is received by the board, and the date that the board first notifies the applicant of its reimbursement determination. An application is complete when the information reasonably required or requested by the board's staff from the applicant has been received by the board's staff. Interest costs are not eligible for reimbursement to the extent they exceed two percentage points above the adjusted prime rate charged by banks, as defined in section 270C.40, subdivision 5, at the time the extension of credit or loan was executed.\n(d) A cost for liability to a third party is incurred by the responsible person when an order or court-approved settlement is entered that sets forth the specific costs attributed to the liability. Except as provided in this paragraph, reimbursement may not be made for costs of liability to third parties until all eligible corrective action costs have been reimbursed. If a corrective action is expected to continue in operation for more than one year after it has been fully constructed or installed, the board may estimate the future expense of completing the corrective action and, after subtracting this estimate from the total reimbursement available under subdivision 3, reimburse the costs for liability to third parties. The total reimbursement may not exceed the limit set forth in subdivision 3.\nA responsible person who has incurred reimbursable costs after June 4, 1987, in response to a release, may apply to the board for reimbursement under subdivision 3.\n(a) Applications for reimbursement may be submitted for consideration by the board at the following stages:\n(1) after costs have been incurred, and the associated tasks completed, for excavation basin soil sampling, excavation of contaminated soil, treatment of contaminated soil, or remedial investigation tasks such as soil boring drilling, monitoring well installation, vapor risk assessment, and groundwater receptor survey; corrective action costs relating to the construction and installation of a comprehensive corrective action design system are not reimbursable at this stage; and\n(2) after costs have been incurred, and the associated tasks completed, for tasks related to the construction and installation of a comprehensive corrective action design system, but only if the commissioner has approved a comprehensive plan for corrective action that will adequately address the entire release, including groundwater contamination if necessary.\n(b) An applicant shall not submit an application for reimbursement more frequently than four times per 12-month period unless the application is for more than $2,000 in reimbursement.\n(c) The commissioner shall review a plan, and provide an approval or disapproval to the applicant and the board, within 60 days in the case of a plan submitted under paragraph (a), clause (1), and within 120 days in the case of a plan submitted under paragraph (a), clause (2), or the commissioner shall explain to the board why additional time is necessary. The board shall consider a complete initial application within 60 days of its submission, and shall consider a complete supplemental application within 120 days of its submission, or the board shall explain for the record why additional time is necessary. Board staff may review applications submitted to the board at the same time the commissioner considers the appropriateness of the corrective action, but the board may not act on the application until after the commissioner's approval is received.\n(d) A reimbursement may not be made unless the board determines that the commissioner has determined that the corrective action was appropriate in terms of protecting public health, welfare, and the environment.\n(e) A reimbursement may not be made unless the application was submitted within seven years after the corrective action services for which reimbursement has been requested were performed.\n(a) The board shall reimburse an eligible applicant from the fund for 90 percent of the total reimbursable costs incurred at the site, except that the board may reimburse an eligible applicant from the fund for greater than 90 percent of the total reimbursable costs, if the applicant previously qualified for a higher reimbursement rate. For costs associated with a release from a tank in transport, the board may reimburse a maximum of $100,000. Not more than $2,000,000 may be reimbursed for costs associated with a single release.\n(b) A reimbursement may not be made from the fund under this chapter until the board has determined that the costs for which reimbursement is requested were actually incurred and were reasonable.\n(c) When an applicant has obtained responsible competitive bids or proposals according to rules promulgated under this chapter prior to June 1, 1995, the eligible costs for the tasks, procedures, services, materials, equipment, and tests of the low bid or proposal are presumed to be reasonable by the board, unless the costs of the low bid or proposal are substantially in excess of the average costs charged for similar tasks, procedures, services, materials, equipment, and tests in the same geographical area during the same time period.\n(d) When an applicant has obtained a minimum of two responsible competitive bids or proposals on forms prescribed by the board and where the rules adopted under this chapter after June 1, 1995, designate maximum costs for specific tasks, procedures, services, materials, equipment and tests, the eligible costs of the low bid or proposal are deemed reasonable if the costs are at or below the maximums set forth in the rules.\n(e) Costs incurred for change orders executed as prescribed in rules adopted under this chapter after June 1, 1995, are presumed reasonable if the costs are at or below the maximums set forth in the rules, unless the costs in the change order are above those in the original bid or proposal or are unsubstantiated and inconsistent with the process and standards required by the rules.\n(f) A reimbursement may not be made from the fund in response to either an initial or supplemental application for costs incurred after June 4, 1987, that are payable under an applicable insurance policy, except that if the board finds that the applicant has made reasonable efforts to collect from an insurer and failed, the board shall reimburse the applicant.\n(g) If the board reimburses an applicant for costs for which the applicant has insurance coverage, the board is subrogated to the rights of the applicant with respect to that insurance coverage, to the extent of the reimbursement by the board. The board may request the attorney general to bring an action in district court against the insurer to enforce the board's subrogation rights. Acceptance by an applicant of reimbursement constitutes an assignment by the applicant to the board of any rights of the applicant with respect to any insurance coverage applicable to the costs that are reimbursed. Notwithstanding this paragraph, the board may instead request a return of the reimbursement under subdivision 5 and may employ against the applicant the remedies provided in that subdivision, except where the board has knowingly provided reimbursement because the applicant was denied coverage by the insurer.\n(h) Money in the fund is appropriated to the board to make reimbursements under this chapter. A reimbursement to a state agency must be credited to the appropriation account or accounts from which the reimbursed costs were paid.\n(i) The board may reduce the amount of reimbursement to be made under this chapter if it finds that the applicant has not complied with a provision of this chapter, a rule or order issued under this chapter, or one or more of the following requirements:\n(1) the agency was given notice of the release as required by section 115.061;\n(2) the applicant, to the extent possible, fully cooperated with the agency in responding to the release;\n(3) the state rules applicable after December 22, 1993, to operating an underground storage tank and appurtenances without leak detection;\n(4) the state rules applicable after December 22, 1998, to operating an underground storage tank and appurtenances without corrosion protection or spill and overfill protection; and\n(5) the state rule applicable after November 1, 1998, to operating an aboveground tank without a dike or other structure that would contain a spill at the aboveground tank site.\n(j) The reimbursement may be reduced as much as 100 percent for failure by the applicant to comply with the requirements in paragraph (i), clauses (1) to (5). In determining the amount of the reimbursement reduction, the board shall consider:\n(1) the reasonable determination by the agency that the noncompliance poses a threat to the environment;\n(2) whether the noncompliance was negligent, knowing, or willful;\n(3) the deterrent effect of the award reduction on other tank owners and operators;\n(4) the amount of reimbursement reduction recommended by the commissioner; and\n(5) the documentation of noncompliance provided by the commissioner.\n(k) An applicant may request that the board issue a multiparty check that includes each lender who advanced funds to pay the costs of the corrective action or to each contractor or consultant who provided corrective action services. This request must be made by filing with the board a document, in a form prescribed by the board, indicating the identity of the applicant, the identity of the lender, contractor, or consultant, the dollar amount, and the location of the corrective action. The applicant must submit a request for the issuance of a multiparty check for each application submitted to the board. Payment under this paragraph does not constitute the assignment of the applicant's right to reimbursement to the consultant, contractor, or lender. The board has no liability to an applicant for a payment issued as a multiparty check that meets the requirements of this paragraph.\n(a) A person who has taken corrective action may apply to the board for reimbursement under subdivision 3 if the board determines that:\n(1) the person took the corrective action in response to a request or order of the commissioner made under this chapter;\n(2) the commissioner has determined that the person was not a responsible person as defined in this chapter;\n(3) the board has determined the person was not a volunteer under subdivision 3b; and\n(4) the person incurs reimbursable costs on or after June 4, 1987.\n(b) Notwithstanding subdivision 3, paragraph (a), a person eligible for reimbursement under this subdivision shall receive 100 percent of total reimbursable costs up to $1,000,000.\n(a) A person may apply to the board for reimbursement under subdivision 3 if the board determines that:\n(1) the person is not a responsible person as defined in this chapter;\n(2) holds legal or equitable title to the property where a release occurred; and\n(3) incurs reimbursable costs on or after May 23, 1989.\n(b) The board may reduce the reimbursement to a person eligible under this subdivision if the person acquired legal or equitable title to the property from a responsible person who failed to comply with subdivision 3, paragraph (i), except that the board may not reduce the reimbursement under this provision to a mortgagee who acquires title to the property through foreclosure or receipt of a deed in lieu of foreclosure.\n(a) Reimbursement may not be made under this chapter for costs associated with a release:\n(1) from a tank located at a petroleum refinery; or\n(2) from a tank facility, including a pipeline terminal, with more than 1,000,000 gallons of total petroleum storage capacity at the tank facility.\n(b) Paragraph (a), clause (2), does not apply to reimbursement for costs associated with a release from a tank facility:\n(1) owned or operated by a person engaged in the business of mining iron ore or taconite;\n(2) owned by a political subdivision, a housing and redevelopment authority, an economic development authority, or a port authority that acquired the tank facility prior to May 23, 1989;\n(3) owned by a person:\n(i) who acquired the tank facility prior to May 23, 1989;\n(ii) who did not use the tank facility for the bulk storage of petroleum; and\n(iii) who is not affiliated with the party who used the tank facility for the bulk storage of petroleum; or\n(4) that is not a petroleum refinery or pipeline terminal and is owned by a person engaged in the business of storing used oil primarily for sales to end users.\n(a) A political subdivision that has taken corrective action may apply to the board for reimbursement under subdivision 3 if the board determines that:\n(1) the political subdivision is not a responsible person as defined by this chapter;\n(2) is not a volunteer under subdivision 3b; and\n(3) incurs reimbursable costs on or after April 8, 1992.\n(b) A political subdivision eligible for reimbursement under this subdivision may only apply for reimbursement if the identified responsible person has failed to take a corrective action ordered by the commissioner.\nThe Department of Transportation may apply to the board and is eligible for reimbursement of reimbursable costs associated with property that the department has acquired under section 115C.021, subdivision 3a, if corrective action pursuant to a plan reviewed and approved by the commissioner of the Pollution Control Agency in accordance with applicable rules and guidance documents was taken on the entire property so acquired. Notwithstanding subdivision 3, paragraph (a), the Department of Transportation shall receive 100 percent of total reimbursable costs associated with a single release up to $1,000,000.\n[Expired, 1997 c 246 s 12]\n[Repealed, 1Sp2001 c 2 s 162]\n(a) As used in this subdivision, \"bulk plant\" means an aboveground or underground tank facility with a storage capacity of more than 1,100 gallons but less than 1,000,000 gallons that is used to dispense petroleum into cargo tanks for transportation and sale at another location.\n(b) For corrective action at a bulk plant located on what is or was railroad right-of-way, the board shall reimburse 90 percent of total reimbursable costs on the first $40,000 of reimbursable costs and 100 percent of any remaining reimbursable costs when the applicant can document that more than one bulk plant was operated on the same section of right-of-way, as determined by the commissioner of commerce.\n(a) As used in this subdivision, \"natural disaster area\" means a geographical area that has been declared a disaster by the governor and President of the United States.\n(b) Notwithstanding subdivision 3, paragraph (a), the board may reimburse:\n(1) up to 50 percent of an applicant's pre-natural-disaster estimated building market value as recorded by the county assessor; or\n(2) if the applicant conveys title of the real estate to local or state government, up to 50 percent of the pre-natural-disaster estimated total market value, not to exceed one acre, as recorded by the county assessor.\n(c) Paragraph (b) applies only if the applicant documents that:\n(1) the natural disaster area has been declared eligible for state or federal emergency aid;\n(2) the building is declared uninhabitable by the commissioner because of damage caused by the release of petroleum from a petroleum storage tank; and\n(3) the applicant has submitted a claim under any applicable insurance policies and has been denied benefits under those policies.\n(d) In determining the percentage for reimbursement, the board shall consider the applicant's eligibility to receive other state or federal financial assistance and determine a lesser reimbursement rate to the extent that the applicant is eligible to receive financial assistance that exceeds 50 percent of the applicant's pre-natural-disaster estimated building market value or total market value.\n[Repealed, 2008 c 296 art 1 s 35]\n[Repealed, 2013 c 135 art 3 s 23]\nThe right to apply for reimbursement and the receipt of reimbursement does not limit the liability of a responsible person for damages or costs incurred by a person or the state as a result of a release.\n(a) The board may demand the complete or partial return of any reimbursement made under this chapter if the applicant for reimbursement:\n(1) misrepresents or omits a fact relevant to a determination made by the board or the commissioner under this chapter;\n(2) fails to complete corrective action that the commissioner determined at the time of the reimbursement to be necessary to adequately address the release, unless the reimbursement was made under subdivision 3a;\n(3) fails to reimburse a person for agreed-to amounts for corrective actions taken in response to a request by the applicant; or\n(4) has entered an agreement to settle or compromise any portion of the incurred costs, in which case the amount returned must be prorated in proportion to the amount of the settlement or compromise.\n(b) If a reimbursement under this chapter is not returned upon demand by the board, the board may recover the reimbursement, with administrative and legal expenses, in a civil action in district court brought by the attorney general against the applicant. If the board's demand for return of the reimbursement is based on willful actions of the applicant, the applicant shall also forfeit and pay to the state a civil penalty, in an amount to be determined by the court, of not more than the full amount of the reimbursement.\nIf a person, with intent to defraud, issues an invoice or other demand for payment with knowledge that it is false in whole or in part, and with knowledge that it is being submitted to the board for reimbursement:\n(1) that person shall be considered to have presented a false claim to a public body under section 609.465; and\n(2) the board may demand that the person return any money received as a result of a reimbursement made on the basis of the false invoice or other demand for payment. If the money is not returned upon demand by the board, the board may recover the money, with administrative and legal expenses, in a civil action in district court brought by the attorney general against the person. The person shall also forfeit and pay to the state a civil penalty, in an amount to be determined by the court, of not more than the full amount of the money received by the person on the basis of the false invoice or other demand for payment.\n(a) A person who submits an application to the board for reimbursement, or who has issued invoices or other demands for payment which are the basis of an application, shall furnish to the board copies of any financial records which the board requests and which are relevant to determining the validity of the costs listed in the application, or shall make the financial records reasonably available to the board for inspection and auditing. The board may obtain access to information required to be made available under this chapter in the manner provided in section 115C.03, subdivision 7.\n(b) After reimbursement has been granted, an agreement to settle or compromise any portion of the incurred costs must be reported to the board by the parties to the agreement.\nThe amount of the state's obligation to make reimbursement under this chapter is limited to the amount available. Notwithstanding any other provisions of this chapter, there shall be no obligation to the general fund to make a reimbursement if there are not sufficient funds in the petroleum tank fund.\nThe board may not approve an application for reimbursement if there are insufficient funds available to pay the reimbursement.\nThe board may delegate to the commissioner of commerce its powers and duties under this chapter.",
	"repealed": false
}