{
	"id": "153B.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/153B.70",
	"title": "153B.70 GROUNDS FOR DISCIPLINARY ACTION.",
	"text": "(a) The board may refuse to issue or renew a license, revoke or suspend a license, or place on probation or reprimand a licensee for one or any combination of the following:\n(1) making a material misstatement in furnishing information to the board;\n(2) violating or intentionally disregarding the requirements of this chapter;\n(3) conviction of a crime, including a finding or verdict of guilt, an admission of guilt, or a no-contest plea, in this state or elsewhere, reasonably related to the practice of the profession. Conviction, as used in this clause, includes a conviction of an offense which, if committed in this state, would be deemed a felony, gross misdemeanor, or misdemeanor, without regard to its designation elsewhere, or a criminal proceeding where a finding or verdict of guilty is made or returned but the adjudication of guilt is either withheld or not entered;\n(4) making a misrepresentation in order to obtain or renew a license;\n(5) displaying a pattern of practice or other behavior that demonstrates incapacity or incompetence to practice;\n(6) aiding or assisting another person in violating the provisions of this chapter;\n(7) failing to provide information within 60 days in response to a written request from the board, including documentation of completion of continuing education requirements;\n(8) engaging in dishonorable, unethical, or unprofessional conduct;\n(9) engaging in conduct of a character likely to deceive, defraud, or harm the public;\n(10) inability to practice due to habitual intoxication, addiction to drugs, or mental or physical illness;\n(11) being disciplined by another state or territory of the United States, the federal government, a national certification organization, or foreign nation, if at least one of the grounds for the discipline is the same or substantially equivalent to one of the grounds in this section;\n(12) directly or indirectly giving to or receiving from a person, firm, corporation, partnership, or association a fee, commission, rebate, or other form of compensation for professional services not actually or personally rendered;\n(13) incurring a finding by the board that the licensee, after the licensee has been placed on probationary status, has violated the conditions of the probation;\n(14) abandoning a patient or client;\n(15) willfully making or filing false records or reports in the course of the licensee's practice including, but not limited to, false records or reports filed with state or federal agencies;\n(16) willfully failing to report child maltreatment as required under the Maltreatment of Minors Act, chapter 260E; or\n(17) soliciting professional services using false or misleading advertising.\n(b) A license to practice is automatically suspended if (1) a guardian of a licensee is appointed by order of a court pursuant to sections 524.5-101 to 524.5-502, for reasons other than the minority of the licensee, or (2) the licensee is committed by order of a court pursuant to chapter 253B. The license remains suspended until the licensee is restored to capacity by a court and, upon petition by the licensee, the suspension is terminated by the board after a hearing. The licensee may be reinstated to practice, either with or without restrictions, by demonstrating clear and convincing evidence of rehabilitation. The regulated person is not required to prove rehabilitation if the subsequent court decision overturns previous court findings of public risk.\n(c) If the board has probable cause to believe that a licensee or applicant has violated paragraph (a), clause (10), it may direct the person to submit to a mental or physical examination. For the purpose of this section, every person is deemed to have consented to submit to a mental or physical examination when directed in writing by the board and to have waived all objections to the admissibility of the examining physician's testimony or examination report on the grounds that the testimony or report constitutes a privileged communication. Failure of a regulated person to submit to an examination when directed constitutes an admission of the allegations against the person, unless the failure was due to circumstances beyond the person's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence. A regulated person affected under this paragraph shall at reasonable intervals be given an opportunity to demonstrate that the person can resume the competent practice of the regulated profession with reasonable skill and safety to the public. In any proceeding under this paragraph, neither the record of proceedings nor the orders entered by the board shall be used against a regulated person in any other proceeding.\n(d) In addition to ordering a physical or mental examination, the board may, notwithstanding section 13.384 or 144.293, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a licensee or applicant without the person's or applicant's consent if the board has probable cause to believe that a licensee is subject to paragraph (a), clause (10). The medical data may be requested from a provider as defined in section 144.291, subdivision 2, paragraph (i), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this section and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this section, unless the information is false and the provider giving the information knew, or had reason to know, the information was false. Information obtained under this section is private data on individuals as defined in section 13.02.\n(e) If the board issues an order of immediate suspension of a license, a hearing must be held within 30 days of the suspension and completed without delay.",
	"repealed": false
}