{
	"id": "268B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.04",
	"title": "268B.04 FINANCIAL ELIGIBILITY; BENEFITS.",
	"text": "(a) An application for benefits may be filed up to 60 days before leave taken under chapter 268B in person, by mail, or by electronic transmission as the commissioner may require. The applicant must include certification supporting a request for leave under this chapter. The applicant must meet eligibility requirements and must provide all requested information in the manner required. If the applicant fails to provide all requested information within a time period to be specified by the commissioner, the application is considered closed and the division must not further act on it.\n(b) The commissioner must examine each application for benefits to determine the base period and the benefit year, and based upon all the covered employment in the base period the commissioner must determine the financial eligibility of the applicant, which includes the weekly benefit amount available, if any, and the maximum amount of benefits available, if any. The department must notify all employers from which the applicant is taking leave, either in writing or electronically, not more than five business days after a claim for benefits has been filed by an employee or former employee as provided under this section.\n(c) If a base period employer did not provide wage detail information for the applicant as required under section 268B.12, the commissioner may accept an applicant certification of wage credits, based upon the applicant's records, and determine the financial eligibility of the applicant.\n(d) The commissioner may, at any time within 12 months from the establishment of a leave, reconsider any determination of benefit account and make an amended determination if the commissioner finds that the wage credits listed in the determination were incorrect for any reason. An amended determination of benefit account must be promptly sent to the applicant and any impacted base period employers, by mail or electronic transmission. This paragraph does not apply to determinations of eligibility or determinations of ineligibility issued.\n(e) If an amended determination of benefit account reduces the weekly benefit amount or maximum amount of benefits available, any benefits that have been paid greater than the applicant was entitled is an overpayment of benefits. A determination or amended determination issued under this section that results in an overpayment of benefits must set out the amount of the overpayment and the requirement that the overpaid benefits must be repaid according to section 268B.185.\nTo establish a benefit account, an applicant must have wage credits of at least 5.3 percent of the state's average annual wage rounded down to the next lower $100.\n(a) Subject to the maximum weekly benefit amount, an applicant's weekly benefit is calculated by adding the amounts obtained by applying the following percentage to an applicant's average weekly wage during the high quarter of the base period:\n(1) 90 percent of wages that do not exceed 50 percent of the state's average weekly wage; plus\n(2) 66 percent of wages that exceed 50 percent of the state's average weekly wage but not 100 percent; plus\n(3) 55 percent of wages that exceed 100 percent of the state's average weekly wage.\n(b) For applicants that have changed employers within the base period, the weekly benefit amount is calculated based on the highest quarter of wages in the base period.\n(c) The state's average weekly wage is the average wage as calculated under section 268.035, subdivision 23, at the time a benefit amount is first determined.\n(d) The maximum weekly benefit amount is the state's average weekly wage as calculated under section 268.035, subdivision 23.\n(e) The state's maximum weekly benefit amount, computed in accordance with section 268.035, subdivision 23, applies to leaves established effective on or after the last Sunday in October. Once established, an applicant's weekly benefit amount is not affected by the last Sunday in October change in the state's maximum weekly benefit amount.\n(f) For a covered individual receiving family or medical leave, a weekly benefit amount is prorated when:\n(1) the covered individual works hours for wages;\n(2) the covered individual uses paid sick leave, paid vacation leave, or other paid time off that is not considered a supplemental benefit payment as defined in section 268B.01, subdivision 41; or\n(3) leave is taken intermittently.\nExcept as otherwise provided for in this chapter, benefits must be paid weekly.\n(a) The total number of weeks that an applicant may take benefits in a single benefit year for a serious health condition is the lesser of 12 weeks, or 12 weeks minus the number of weeks within the same benefit year that the applicant received benefits for bonding, safety leave, family care, and qualifying exigency plus eight weeks.\n(b) The total number of weeks that an applicant may take benefits in a single benefit year for bonding, safety leave, family care, and qualifying exigency is the lesser of 12 weeks, or 12 weeks minus the number of weeks within the same benefit year that the applicant received benefits for a serious health condition plus eight weeks.\nExcept for a claim for benefits for bonding leave, any claim for benefits must be based on a single qualifying event of at least seven calendar days.\nIntermittent leave must be taken in increments consistent with the established policy of the employer to account for use of other forms of leave, so long as such employer's policy permits a minimum increment of at most one calendar day of intermittent leave. An applicant is not permitted to apply for payment for benefits associated with intermittent leave until the applicant has eight hours of accumulated leave time, unless more than 30 calendar days have lapsed since the initial taking of the leave.\n[Never effective, 2024 c 127 art 73 s 14]\n[See Note.]\n(a) An application for family or medical leave benefits is effective the Sunday of the calendar week that the application was filed. An application for benefits may be backdated one calendar week before the Sunday of the week the application was actually filed if the applicant requests the backdating within seven calendar days of the effective date of application. An application may be backdated only if the applicant was eligible for the benefit during the period of the backdating. If an individual attempted to file an application for benefits, but was prevented from filing an application by the department, the application is effective the Sunday of the calendar week the individual first attempted to file an application.\n(b) If the applicant was unable to apply in a timely manner due to incapacitation or due to no fault of their own, the commissioner may backdate the claim beyond one calendar week to the effective date of leave. The commissioner may require the employee to prove the circumstances that prevented timely filing.",
	"repealed": false
}