{
	"id": "148.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.211",
	"title": "148.211 LICENSING.",
	"text": "(a) An applicant for a license to practice as a registered nurse or licensed practical nurse shall apply to the board for a license by examination on forms prescribed by the board and pay a fee in an amount determined by statute. An applicant applying for reexamination shall pay a fee in an amount determined by law. In no case may fees be refunded.\n(b) The applicant must satisfy the following requirements for licensure by examination:\n(1) present evidence the applicant has not engaged in conduct warranting disciplinary action under section 148.261;\n(2) present evidence of completion of a nursing education program approved by the board, another United States nursing board, or a Canadian province, which prepared the applicant for the type of license for which the application has been submitted; and\n(3) pass a national nurse licensure written examination. \"Written examination\" includes paper and pencil examinations and examinations administered with a computer and related technology and may include supplemental oral or practical examinations approved by the board.\n(c) An applicant who graduated from an approved nursing education program in Canada and was licensed in Canada or another United States jurisdiction, without passing the national nurse licensure examination, must also submit a verification of licensure from the original Canadian licensure authority and from the United States jurisdiction.\n(d) An applicant who graduated from a nursing program in a country other than the United States or Canada must also satisfy the following requirements:\n(1) present verification of graduation from a nursing education program which prepared the applicant for the type of license for which the application has been submitted and is determined to be equivalent to the education required in the same type of nursing education programs in the United States as evaluated by a credentials evaluation service acceptable to the board. The credentials evaluation service must submit the evaluation and verification directly to the board;\n(2) demonstrate successful completion of coursework to resolve identified nursing education deficiencies; and\n(3) pass examinations acceptable to the board that test written and spoken English, unless the applicant graduated from a nursing education program conducted in English and located in an English-speaking country. The results of the examinations must be submitted directly to the board from the testing service.\n(e) An applicant failing to pass the examination may apply for reexamination.\n(f) When the applicant has met all requirements stated in this subdivision, the board shall issue a license to the applicant. The board may issue a license with conditions and limitations if it considers it necessary to protect the public.\n(a) No advanced practice registered nurse shall practice as an advanced practice registered nurse unless the advanced practice registered nurse is licensed by the board under this section.\n(b) An applicant for a license to practice as an advanced practice registered nurse (APRN) shall apply to the board in a format prescribed by the board and pay a fee in an amount determined under section 148.243.\n(c) To be eligible for licensure an applicant:\n(1) must hold a current Minnesota professional nursing license or demonstrate eligibility for licensure as a registered nurse in this state;\n(2) must not hold an encumbered license as a registered nurse in any state or territory;\n(3)(i) must have completed a graduate level APRN program accredited by a nursing or nursing-related accrediting body that is recognized by the United States Secretary of Education or the Council for Higher Education Accreditation as acceptable to the board. The education must be in one of the four APRN roles for at least one population focus. For APRN programs completed on or after January 1, 2016, the program must include at least one graduate-level course in each of the following areas: advanced physiology and pathophysiology; advanced health assessment; and pharmacokinetics and pharmacotherapeutics of all broad categories of agents; or\n(ii) must demonstrate compliance with the advanced practice registered nursing educational requirements that were in effect in Minnesota at the time the applicant completed the advanced practice registered nursing education program;\n(4) must be currently certified by a national certifying body recognized by the board in the APRN role and population foci appropriate to educational preparation;\n(5) must report any criminal conviction, nolo contendere plea, Alford plea, or other plea arrangement in lieu of conviction; and\n(6) must not have committed any acts or omissions which are grounds for disciplinary action in another jurisdiction or, if these acts have been committed and would be grounds for disciplinary action as set forth in section 148.261, the board has found, after investigation, that sufficient restitution has been made.\n[Repealed, 2017 c 57 s 6]\nA nurse practitioner or clinical nurse specialist who qualifies for licensure as an advanced practice registered nurse must practice for at least 2,080 hours, within the context of a collaborative agreement, within a hospital or integrated clinical setting where advanced practice registered nurses and physicians work together to provide patient care. The nurse practitioner or clinical nurse specialist shall submit written evidence to the board with the application, or upon completion of the required collaborative practice experience. For purposes of this subdivision, a collaborative agreement is a mutually agreed upon plan for the overall working relationship between a nurse practitioner or clinical nurse specialist, and one or more physicians licensed under chapter 147 or in another state or United States territory, or one or more advanced practice registered nurses licensed under this section that designates the scope of collaboration necessary to manage the care of patients. The nurse practitioner or clinical nurse specialist, and one of the collaborating physicians or advanced practice registered nurses, must have experience in providing care to patients with the same or similar medical problems.\nThe board shall issue a license to practice professional nursing or practical nursing without examination to an applicant who has been duly licensed or registered as a nurse under the laws of another state, territory, or country, if in the opinion of the board the applicant has the qualifications equivalent to the qualifications required in this state as stated in subdivision 1, all other laws not inconsistent with this section, and rules promulgated by the board.\n(a) A license to practice professional or practical nursing issued by Iowa, North Dakota, South Dakota, or Wisconsin (border state) to a resident in that state must be recognized by the board as authorizing a licensure privilege to practice professional or practical nursing in Minnesota, if:\n(1) the licensure standards in the state licensed are substantially the same as Minnesota licensure standards;\n(2) the border state has not taken adverse action against the nurse license;\n(3) the nurse is not participating in an alternative or diversion program; or\n(4) the nurse has not been refused a license to practice nursing in Minnesota.\n(b) Within ten days of employment by a hospital, clinic, prepaid medical plan, or other health care institution or organization located in this state, a nurse who practices professional or practical nursing in Minnesota under the authority of a licensure privilege as provided in this subdivision shall report the employment to the board on a form provided by the board. The board shall maintain a list of the nurses practicing in Minnesota under this subdivision.\n(c) A nurse who practices professional or practical nursing in Minnesota under the authority of a licensure privilege as provided in this subdivision has the same obligations as if the nurse was licensed in Minnesota and is subject to the laws and rules of Minnesota and the regulatory authority of the board, including taking all forms of disciplinary action provided for in section 148.262, subdivision 1, and corrective action provided for in section 214.103, subdivision 6, against an individual's licensure privilege based on the grounds listed in section 148.261, subdivision 1, any other statute authorizing or requiring the board to take corrective or disciplinary action, and issuing a cease and desist order to limit or revoke a nurse's authority to practice in Minnesota. The board is authorized to recover from a nurse practicing professional or practical nursing in Minnesota under this subdivision the cost of proceedings as provided in section 148.262, subdivision 4. The board shall promptly report any such actions to the border state licensing board.\n(d) The board shall seek reciprocity of nurse licensure with Iowa, North Dakota, South Dakota, and Wisconsin. Lack of reciprocity does not limit the board's recognition of nurse licenses from border states.\n[Repealed, 1976 c 222 s 209]\nA person who has been licensed as a licensed practical nurse in another state, who has passed a licensing examination acceptable to the board, and who has had 24 months of experience as a licensed practical nurse in the five years prior to applying for a license is not required to meet any additional educational requirements.\nRefusal of an applicant to supply information necessary to determine the applicant's qualifications, failure to demonstrate qualifications, or failure to satisfy the requirements for a license contained in this section or rules of the board may result in denial of a license. The burden of proof is upon the applicant to demonstrate the qualifications and satisfaction of the requirements.",
	"repealed": false
}