{
	"id": "169.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.50",
	"title": "169.50 REAR LAMPS.",
	"text": "(a) Every motor vehicle and every vehicle that is being drawn at the end of a train of vehicles must be equipped with at least one tail lamp, exhibiting a red light plainly visible from a distance of 500 feet to the rear.\n(b) Every motor vehicle, other than a truck-tractor, and every vehicle that is being drawn at the end of a train of vehicles, registered in this state and manufactured or assembled after January 1, 1960, must be equipped with at least two tail lamps mounted on the rear and on the same level and as widely spaced laterally as practicable. When lighted, the tail lamps must comply with the provisions of this section.\n(c) An implement of husbandry being towed by a motor vehicle at a speed of not more than 30 miles per hour, displaying a slow-moving vehicle emblem, and complying with section 169.55, subdivision 2, paragraph (a), clause (4), is not subject to the requirements of this section.\nEither such rear lamp or separate lamp shall be so constructed and placed as to illuminate with a white light the rear registration plate and render it legible from a distance of 50 feet to the rear. Any rear lamp or rear lamps, together with any separate lamp for illuminating the rear registration plate, shall be so wired as to be lighted whenever the headlamps or auxiliary driving lamps are lighted.\nOn and after January 1, 1960, each new motor vehicle, trailer, or semitrailer, hereafter sold and each such vehicle hereafter operated on a highway, shall carry at the rear either as a part of the rear lamp, or separately, at least two reflectors. The reflectors shall be of a type approved by the commissioner of public safety and shall be mounted as close as is practicable to the extreme edges of the vehicle at a height not more than 60, nor less than 20 inches above the surface upon which the vehicle stands. Each such reflector shall be so designed and maintained as to be visible at night from all distances within 300 to 50 feet from the vehicle, except that on a commercial vehicle the reflectors shall be visible from all distances within 500 to 50 feet from the vehicle, when directly in front of a motor vehicle displaying lawfully lighted headlamps.",
	"repealed": false
}