{
	"id": "504B.153",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.153",
	"title": "504B.153 NEW CONSTRUCTION DELAYS; TENANT REMEDIES.",
	"text": "For purposes of this section, \"new construction\" means a new building, rehabilitation, modification, reconstruction, any physical changes altering the use or occupancy of the dwelling units, or an addition to a building.\n(a) If a landlord is informed by a builder or otherwise knows that a new construction for rental occupancy will not be available for occupancy by the move-in date established in the lease agreement, the landlord must, within seven days and prior to the move-in date, notify every tenant affected and offer the following choices to the tenant to be accepted at the tenant's option:\n(1) alternative housing provided by the landlord that is reasonably equivalent in size, amenities, and location to the unit described in the lease agreement, unless otherwise agreed upon by the tenant, until the unit may be lawfully inhabited;\n(2) payment from the landlord to the tenant, equivalent to the cost of rent established in the lease agreement, to mitigate the costs of alternative housing secured by the tenant until the unit described in the lease agreement may be lawfully inhabited; or\n(3) termination of the lease agreement and a return to the tenant of all amounts paid to the landlord, including any rent, deposit, and other payments incurred in entering the lease agreement.\n(b) If a tenant exercises options under paragraph (a), clause (1) or (2), the landlord must provide the tenant with reimbursements related to security deposits, application fees, parking fees, pet fees, and any other fees reasonably associated with securing alternative housing.\n(c) Tenants exercising options under paragraph (a), clause (1) or (2), may terminate their lease agreement under paragraph (a), clause (3), if the new construction for rental occupancy is not available for tenant occupancy within 90 days of the move-in date established in the lease agreement.\nAny provision, whether oral or written, of any lease or other agreement, whereby any provision of this section is waived by a tenant, is contrary to public policy and void.\n(a) A violation by the landlord of subdivision 2 is a violation of section 504B.375. A tenant aggrieved by a violation by the landlord of subdivision 2 may elect the following remedy:\n(1) recovery under section 504B.231; or\n(2) recover the greater of one month's rent, $1,000, or actual damages, plus reasonable attorney fees and court costs.\n(b) The remedies available under this section are in addition to any other remedies available at equity or law.",
	"repealed": false
}