{
	"id": "231.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/231.09",
	"title": "231.09 UNIFORM RECEIPT ISSUANCE.",
	"text": "A warehouse operator receiving goods in store shall issue for the goods a receipt embodying the terms of such receipts as authorized by article 7 of the Uniform Commercial Code. Receipts or records of storage in electronic form are acceptable.\nA copy of the form of receipt used by the warehouse operator must be furnished to the department with the application for license.\nReceipts must show in conspicuous type whether or not the property for which the receipt has been issued is insured for the benefit of the depositor against fire or any other casualty.\nThe property of each depositor must be specifically designated under a lot number, which must appear on the receipt for the purpose of identification.\nUnless notice is given by the depositor to the warehouse operator in writing within 30 days after the date of mailing or delivery to the depositor of the warehouse receipt stating that there are errors or omissions in the list of goods and specifying them, the operator is entitled to assume that the list of goods on the warehouse receipt is a complete and correct list of goods tendered to the operator for storage under the terms and conditions of the contract and that the depositor has accepted all terms and conditions of the contract.\nIf the depositor, subsequent to the original storing, places other goods with the warehouse operator for storage, the additional goods may come in under the same terms and conditions as if they were part of the original lot.\nNotices by the warehouse operator to the depositor pertaining to the goods, wares, or merchandise must be sent to the depositor at the address given at the time of depositing the goods, wares, or merchandise with the operator, unless written notice of a change of address is received by the operator from the depositor. Notices mailed by the operator to the last address given by the depositor constitute effective notice for all purposes.\nUnless otherwise specified by the depositor in writing, it is agreed and is prima facie proof that no piece, package, or complete article with its contents enumerated in the list of goods in the warehouse receipt of contract exceeds the sum of $50 in value. If the depositor declares in writing a higher valuation, the warehouse operator may charge a higher rate for storing the pieces, packages, or complete articles. Each operator must, upon the day of storage, clearly inform the depositor, in writing, that the depositor may declare a higher valuation.\n(a) From and after the date of storage, the warehouse operator storing household goods must, on behalf of the depositor, cause the stored goods of the depositor to be insured at least in the amount of $1.25 per pound per article against loss from any peril covered by standard fire and extended coverage policies. The depositor must pay to the operator the cost of the insurance in addition to other warehousing charges; provided, however, that the depositor may declare in writing that the value of the stored goods does not exceed 60 cents per pound per article, in which case the depositor is limited to that amount in the recovery of any damages against the warehouse operator.\n(b) Warehouse operators whose charges for storage are not based upon actual weight, and who may not have available an actual weight figure, may use a weight figure obtained by application of the constructive weight rule in effect in the operator's tariff.\n(c) Each warehouse operator must, on the day of storage, clearly inform the depositor in writing of the substance of paragraph (a). If the depositor's goods are delivered to the operator for storage by another person, the operator must inform that person of the depositor's rights and obligations under paragraph (a).\n(d) Nothing in this section imposes liability upon a warehouse operator for damages where the liability would not otherwise be imposed under the provisions of the Uniform Commercial Code, chapter 336, and specifically section 336.7-204.",
	"repealed": false
}