{
	"id": "272.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.19",
	"title": "272.19 PLATTING OF IRREGULAR TRACTS.",
	"text": "Where any tract or lot of land is divided into parcels of irregular shape, which cannot be described except by metes and bounds, the owners thereof, upon notice thereof being given by the county auditor, which notice shall be served upon such owner personally or by certified mail, shall have such land platted into lots, a survey being made when necessary, and the plat recorded, and a duplicate filed with the county auditor. If the owner fails so to do within 30 days after such notice, the county surveyor, upon the request of the county auditor, shall make such plat. Where such lands proposed to be platted are wholly within the limits of any incorporated city or statutory city, adjacent to any city of the first class, and such city maintains a licensed land surveyor, the county auditor shall direct such licensed land surveyor to make such plat. Such plat shall be made from the records of the county recorder, if practicable; but, if not practicable, the county surveyor, or if such lands are within the limits of any incorporated city or statutory city adjacent to a city of the first class, the licensed land surveyor, if one is maintained by such city, shall make and certify the necessary survey and plat, which the county auditor shall file for record with the county recorder, and a duplicate thereof shall be filed in the auditor's office. The description of the property in accordance with such recorded plats shall be valid. When the owners fail to comply with this section the costs of surveying, platting, and recording shall be paid by the county upon allowance by the county board and the amount thereof added to the next tax upon such lots and when collected, shall be credited to the county revenue fund; provided, however, that whenever the county board shall determine that it is for the best interests of the county to have any particular tract of land platted into an auditor's plat, and shall adopt a resolution so stating, it may direct the county auditor to have such work done. The county auditor may then employ any licensed land surveyor to make the necessary survey and prepare the plat. If there shall be any variation between the measurements of the tract as actually surveyed and the measurements stated in the instruments of conveyance with respect to any lot to be outlined upon such plat, the licensed land surveyor shall note such variation on the lots affected on said plat and shall state in the certificate, endorsed upon the plat, the extent of such variation and the action taken by the surveyor to reconcile such difference for the purpose of outlining such lot or lots upon the plat. The county auditor shall file such plat for record with the county recorder and a duplicate thereof shall be filed in the auditor's office. After a tract of land has once been surveyed and platted into an auditor's plat and the owner of any lot situated therein shall thereafter convey a portion of lot, which is described by metes and bounds, the county auditor may have such plat revised or amended so as to currently show thereon each parcel of land contained within said tract, by lot or revised lot number. When a plat is thus revised it shall not be necessary to make a new survey, but the licensed land surveyor employed for said purpose shall revise the existing plat, from the data contained in the instrument of conveyance, by outlining thereon a new lot, drawn according to the scale used for said plat, of the land conveyed by such instrument. The remaining portion of such lot shall retain its original number, and all new lots created by such revisions shall be progressively numbered and shall be known as \"Revised Lot Number .............\" If there shall be any variation between the measurements of said lot as shown on said plat and the measurements stated in the instrument of conveyance, the licensed land surveyor shall note such variation on the plat and shall state in the certificate, endorsed upon the plat, the extent of such variation and the action taken by the surveyor to reconcile such difference for the purpose of outlining such revised lot upon the plat. The licensed land surveyor shall make and endorse on said plat a certificate which shall read substantially as follows: \"I, ........ .............., a licensed land surveyor, do hereby certify that I have this day revised this plat by outlining thereon Revised Lot Number ......., which covers that parcel of land conveyed on the ......... day of .............., ......., by ......................, Grantor, to ...................., Grantee, as recorded in book ........... of deeds, on page .......... thereof. It conforms to the measurements of said lot as shown on the plat, except as follows: In witness whereof I have hereunto subscribed my name this ........ day of ......................., .......\nSigned............................\nLicensed Land Surveyor.\"\nSuch revision and certificate shall also be entered upon the duplicate plat on file in the office of the county auditor. Any parcel of land which is described by lot or revised lot number of an auditor's plat, made by a licensed land surveyor under authority of a resolution by the county board, as herein provided, shall be a valid description of such parcel of land for taxation purposes. Immediately after the filing of a new auditor's plat or the revision of an existing plat, as herein provided, the county auditor shall give notice by certified mail to each property owner whose land has been affected by such platting or revision, if the address of such owner can be ascertained from the tax duplicates in the office of the county treasurer. Such notice shall describe the land as the same appeared upon the tax lists of the county prior to such platting or revision and shall also give the description of the land according to the new or revised plat, and shall state that such parcel of land will thereafter be described, for taxation purposes, according to the description shown on said plat. The county auditor shall make an affidavit of mailing such notices, stating therein the name and address of each owner to whom such notice was mailed as well as the description of the land owned according to said plat. Such affidavit shall be filed in the auditor's office. Whenever any plat is made pursuant to a resolution of the county board, all expenses incurred in connection with such plattings or revisions shall be paid by the county and not by the land owners.",
	"repealed": false
}