{
	"id": "326B.438",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.438",
	"title": "326B.438 MEDICAL GAS SYSTEMS.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Medical gas\" means medical gas as defined under the National Fire Protection Association NFPA 99C Standard on Gas and Vacuum Systems.\n(c) \"Medical gas system\" means a level 1, 2, or 3 piped medical gas and vacuum system as defined under the National Fire Protection Association NFPA 99C Standard on Gas and Vacuum Systems.\nNo person shall perform or offer to perform the installation, maintenance, or repair of medical gas systems unless the person obtains a contractor license. An individual shall not engage in the installation, maintenance, or repair of a medical gas system unless the individual possesses a current Minnesota master or journeyworker plumber's license and is certified by the commissioner under rules adopted by the Minnesota Plumbing Board. The certification must be renewed biennially for as long as the certificate holder engages in the installation, maintenance, or repair of medical gas systems.\nAn individual who on August 1, 2010, possesses a valid certificate meeting the requirements of the American Society of Sanitary Engineering (ASSE) Standard 6010 and is a qualified brazer in accordance with the provisions required in the National Fire Protection Association (NFPA) 99C is exempt from the licensing requirements of subdivision 2 and may install, maintain, and repair a medical gas system. This exemption applies only if the individual maintains a valid certification in accordance with ASSE Standard 6010 and the brazer qualifications in NFPA 99C, and is certified by the commissioner under rules adopted by the Minnesota Plumbing Board.\nFor the purpose of calculating fees under section 326B.092, an initial or renewed medical gas certificate issued by the commissioner according to subdivision 2 shall be considered a journeyworker level license.",
	"repealed": false
}