{
	"id": "121A.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.041",
	"title": "121A.041 AMERICAN INDIAN MASCOTS PROHIBITED.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"American Indian\" means an individual who is:\n(1) a member of an Indian Tribe or Band, as membership is defined by the Tribe or Band, including:\n(i) any Tribe or Band terminated since 1940; and\n(ii) any Tribe or Band recognized by the state in which the Tribe or Band resides;\n(2) a descendant, in the first or second degree, of an individual described in clause (1);\n(3) considered by the Secretary of the Interior to be an Indian for any purpose;\n(4) an Inuit, Aleut, or other Alaska Native; or\n(5) a member of an organized Indian group that received a grant under the Indian Education Act of 1988 as in effect the day preceding October 20, 1994.\n(c) \"District\" means a district under section 120A.05, subdivision 8.\n(d) \"Mascot\" means any human, nonhuman animal, or object used to represent a school and its population.\n(e) \"Public school\" or \"school\" means a public school under section 120A.05, subdivisions 9, 11, 13, and 17, and a charter school under chapter 124E.\n(a) Starting September 1, 2026, a public school may not have or adopt a name, symbol, or image that depicts or refers to an American Indian Tribe, individual, custom, or tradition to be used as a mascot, nickname, logo, letterhead, or team name of the school, district, or school within the district, unless the school has obtained an exemption under subdivision 3.\n(b) The prohibition in paragraph (a) does not apply to a public school located within the reservation of a federally recognized Tribal Nation in Minnesota, where at least 95 percent of students meet the state definition of American Indian student.\n(c) A school district with a prohibited American Indian mascot according to paragraph (a), that has not received an exemption according to subdivision 3, must report to the chairs and ranking minority members of the legislative committees having jurisdiction over kindergarten through grade 12 education policy by February 14, 2025, and again by February 1, 2026, on the district's progress to comply with this section; and the district must submit copies of the reports to the Legislative Reference Library. The reports must include the following:\n(1) confirmation that the district has removed the American Indian mascot, nickname, logo, letterhead, or team name from the district website;\n(2) confirmation that the board of the district has approved a new mascot, nickname, logo, letterhead, or team name;\n(3) a summary of the district's progress on removing the American Indian mascot, nickname, logo, letterhead, or team name from uniforms, equipment, signs, elements of facilities, and other district items; and\n(4) a summary of resources necessary to comply with the prohibition in paragraph (a) and the district's plan to raise and allocate any necessary funds.\nA public school may seek an exemption to subdivision 2 by submitting a request in writing to all 11 federally recognized Tribal Nations in Minnesota and to the Tribal Nations Education Committee by September 1, 2023. The exemption is denied if any of the 11 Tribal Nations or the Tribal Nations Education Committee oppose the exemption by December 15, 2023. A public school whose request for an exemption is denied must comply with subdivision 2 by September 1, 2026.",
	"repealed": false
}