{
	"id": "376.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/376.08",
	"title": "376.08 COUNTIES OF NOT MORE THAN 50,000; HOSPITALS AND MUNICIPALLY OWNED NURSING HOMES.",
	"text": "Except as provided in subdivision 2, the board of county commissioners in any county with a population of 50,000 or less may appropriate up to $65,000 annually from the general revenue fund of the county for the acquisition of lands for hospital purposes, and the construction, improvement, alterations, equipment and maintenance of hospitals within the county, including public or nonprofit hospitals that are not county hospitals. The board may also appropriate up to $25,000 from the general revenue fund of the county for the acquisition of land and construction of municipally owned nursing homes within the county.\nA county hospital may by majority vote of its board of commissioners, or if the hospital has been leased to another entity under section 376.06, subdivision 1, or 447.47, by majority vote of the board of directors of that entity, enter into projects for the construction of an addition or remodeling to its presently existing facility or the acquisition of equipment as described in this subdivision without complying with the dollar limitation of subdivision 1. This subdivision applies to projects in which the funds for the project are derived from dedicated, restricted, or other designated accounts, from the hospital's depreciation fund, or from the issuance of bonds authorized under other law. An addition to a current hospital under this subdivision may include construction of buildings physically separate from the present hospital building, as well as additions to the present building, if the new buildings are constructed on the hospital's existing premises.\nThis subdivision does not affect the ability of the hospital board to approve funds for improvements or remodeling of a hospital facility under other law.\nSection 144.551 applies to any project authorized by subdivision 2. Subdivision 2 does not authorize an increase in the license capacity of the hospital or the licensing, relocation, or redistribution of hospital beds except as provided by section 144.551, subdivision 1, paragraph (b).",
	"repealed": false
}