{
	"id": "35.086",
	"url": "https://www.revisor.mn.gov/statutes/cite/35.086",
	"title": "35.086 BOVINE TUBERCULOSIS MANAGEMENT ZONE; RESTRICTIONS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Bovine tuberculosis management zone\" means the area within the ten-mile radius around the five presumptive tuberculosis-positive deer sampled during the fall 2006 hunter-harvested surveillance effort.\n(c) \"Located within\" means that the herd was kept in the area for at least a part of calendar year 2007.\n(a) The board shall offer a herd buyout payment to cattle owners with existing cattle that are located within the bovine tuberculosis management zone. The payment shall be $500 per bovine animal. By July 15, 2008, the cattle owner must accept or decline the offer for herd buyout payments under this subdivision. A cattle owner receiving payment under this subdivision must sign a contract with the board that provides:\n(1) all cattle that are at least one year old and located within the bovine tuberculosis management zone will be slaughtered by January 31, 2009;\n(2) all cattle that are less than one year old are either slaughtered or moved out of the bovine tuberculosis management zone, as provided in paragraph (b), by January 31, 2009;\n(3) the landowner and cattle owner will not have or allow any livestock to be located on land in the board's proposed modified accredited zone, unless authorized by the board; and\n(4) a landowner or cattle owner who violates a condition under this subdivision must repay all payments received under this section and is subject to penalties for violations under this chapter.\n(b) Cattle that are less than one year old may be moved out of the bovine tuberculosis management zone to comply with paragraph (a), clause (2), only when:\n(1) they are from a herd that received a whole herd tuberculosis test within the previous 12 months;\n(2) they are not sexually intact; and\n(3) they have had a tuberculosis test within 60 days of being moved out of the zone.\n(c) After May 6, 2008, livestock shall not be moved into the bovine tuberculosis management zone unless authorized by the board.\n(d) Before the board issues payment to a cattle owner under this subdivision, the board shall verify all cattle owned by that cattle owner and located within the bovine tuberculosis management zone have been slaughtered.\n(e) A cattle owner who signs a contract under paragraph (a) or who depopulated an infected herd and signs a contract containing the provisions of paragraph (a), clauses (1) to (3), shall receive an annual payment of $75 for each bovine animal slaughtered. The board shall make the first annual payment by June 30, 2009, and make annual payments by June 30 each year thereafter until the area receives a bovine tuberculosis-free status and the owner is authorized by the board to have cattle located within the bovine tuberculosis management zone.\nThe board shall conduct a risk assessment for cattle that remain located within the bovine tuberculosis management zone. If the board determines that cattle herds within the bovine tuberculosis management zone present a risk of interaction between cattle and deer or elk, the board shall require the owner of the cattle to keep all cattle in a manner that does not allow cattle and deer or elk interface. The board may also require that any person who stores forage crops within the bovine tuberculosis management zone, including but not limited to a person who participates in the herd buyout in subdivision 2, must keep stored forage crops in a manner that does not allow deer or elk access. The board shall offer cost-share assistance for fencing under subdivision 4 to a person who is required to:\n(1) keep cattle in a manner that does not allow cattle and deer or elk interface; or\n(2) keep stored forage crops in a manner that does not allow deer or elk access.\n(a) The board shall provide cost-share assistance to persons required to fence stored forage crops or fence cattle in areas where the board determines that there is an unacceptable risk of transmitting bovine tuberculosis to deer or elk. The cost-share payments shall be 90 percent of the cost of an approved fence up to a maximum cost-share payment of $75,000. The payments under this subdivision shall be on a reimbursement basis and paid by the board after the board determines that the fence is built to the specifications required by the board.\n(b) The board shall establish specifications for fences that qualify for cost-share assistance under this subdivision and provide cattle owners or those who store forage crops with a list of approved fencing contractors. The fencing must be constructed and maintained by an approved fencing contractor, the landowner, or the tenant.\n(c) The board shall periodically inspect fences for which cost-share assistance has been received under this subdivision. If the board determines that a fence for which cost-share assistance has been received is not being maintained or used properly, the board may:\n(1) order that the fence be repaired or used properly; or\n(2) require repayment of any cost-share assistance received by the person and, if the fence was intended to keep cattle in a manner that does not allow cattle and deer or elk interface, the board may place the herd under quarantine.",
	"repealed": false
}