{
	"id": "145A.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.131",
	"title": "145A.131 LOCAL PUBLIC HEALTH GRANT.",
	"text": "(a) Base funding for each community health board eligible for a local public health grant under section 145A.03, subdivision 7, shall be determined by each community health board's fiscal year 2003 allocations, prior to unallotment, for the following grant programs: community health services subsidy; state and federal maternal and child health special projects grants; family home visiting grants; TANF MN ENABL grants; TANF youth risk behavior grants; and available women, infants, and children grant funds in fiscal year 2003, prior to unallotment, distributed based on the proportion of WIC participants served in fiscal year 2003 within the CHS service area.\n(b) Base funding for a community health board eligible for a local public health grant under section 145A.03, subdivision 7, as determined in paragraph (a), shall be adjusted by the percentage difference between the base, as calculated in paragraph (a), and the funding available for the local public health grant.\n(c) Multicounty or multicity community health boards shall receive a local partnership base of up to $5,000 per year for each county or city in the case of a multicity community health board included in the community health board.\n(d) The State Community Health Services Advisory Committee may recommend a formula to the commissioner to use in distributing funds to community health boards.\n(e) Notwithstanding any adjustment in paragraph (b), community health boards, all or a portion of which are located outside of the counties of Anoka, Chisago, Carver, Dakota, Hennepin, Isanti, Ramsey, Scott, Sherburne, Washington, and Wright, are eligible to receive an increase equal to ten percent of the grant award to the community health board under paragraph (a) starting July 1, 2015. The increase in calendar year 2015 shall be prorated for the last six months of the year. For calendar years beginning on or after January 1, 2016, the amount distributed under this paragraph shall be adjusted each year based on available funding and the number of eligible community health boards.\n(f) Funding for foundational public health responsibilities must be distributed based on a formula determined by the commissioner in consultation with the State Community Health Services Advisory Committee. These funds must be used as described in subdivision 5.\n(a) A community health board that receives a local public health grant shall provide at least a 75 percent match for the state funds received through the local public health grant described in subdivision 1 and subject to paragraphs (b) to (f).\n(b) Eligible funds must be used to meet match requirements. Eligible funds include funds from local property taxes, reimbursements from third parties, fees, other local funds, and donations or nonfederal grants that are used for community health services described in section 145A.02, subdivision 6.\n(c) When the amount of local matching funds for a community health board is less than the amount required under paragraph (a), the local public health grant provided for that community health board under this section shall be reduced proportionally.\n(d) A city organized under the provision of sections 145A.03 to 145A.131 that levies a tax for provision of community health services is exempt from any county levy for the same services to the extent of the levy imposed by the city.\n(a) Community health boards accepting local public health grants must meet all of the requirements and perform all of the duties described in sections 145A.03 and 145A.04, to maintain eligibility to receive the local public health grant.\n(b) By January 1 of each year, the commissioner shall notify community health boards of the performance-related accountability requirements of the local public health grant for that calendar year. Performance-related accountability requirements will be comprised of a subset of the annual performance measures and will be selected in consultation with the State Community Health Services Advisory Committee.\n(c) If the commissioner determines that a community health board has not met the accountability requirements, the commissioner shall notify the community health board in writing and recommend specific actions the community health board must take over the next six months in order to maintain eligibility for the Local Public Health Act grant.\n(d) Following the written notification in paragraph (c), the commissioner shall provide administrative and program support to assist the community health board as required in section 145A.06, subdivision 3a.\n(e) The commissioner shall provide the community health board two months following the written notification to appeal the determination in writing.\n(f) If the community health board has not submitted an appeal within two months or has not taken the specific actions recommended by the commissioner within six months following written notification, the commissioner may elect to not reimburse invoices for funds submitted after the six-month compliance period and shall reduce by 1/12 the community health board's annual award allocation for every successive month of noncompliance.\n(g) The commissioner may retain the amount of funding that would have been allocated to the community health board and assume responsibility for public health activities in the geographic area served by the community health board.\nIf a community health board elects not to accept the local public health grant, the commissioner may retain the amount of funding that would have been allocated to the community health board and assume responsibility for public health activities in the geographic area served. The commissioner may elect to directly provide public health activities or contract with other units of government or with community-based organizations. If a city that is currently a community health board withdraws from a community health board or elects not to accept the local public health grant, the local public health grant funds that would have been allocated to that city shall be distributed to the county in which the city is located.\n(a) Community health boards may use the base funding of their local public health grant funds as described in subdivision 1, paragraphs (a) to (e), to address the areas of public health responsibility and local priorities developed through the community health assessment and community health improvement planning process.\n(b) Except as otherwise provided in this paragraph, funding for foundational public health responsibilities as described in subdivision 1, paragraph (f), must be used to fulfill foundational public health responsibilities as defined by the commissioner in consultation with the state community health service advisory committee. If a community health board can demonstrate foundational public health responsibilities are fulfilled, the board may use funds for local priorities developed through the community health assessment and community health improvement planning process.",
	"repealed": false
}