{
	"id": "326B.958",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.958",
	"title": "326B.958 INSPECTION AND REGISTRATION.",
	"text": "(a) Every owner, lessee, or other person having charge of boilers or pressure vessels subject to inspection under sections 326B.956 to 326B.998 shall cause them to be inspected by the department unless specifically excepted by section 326B.988 or 326B.99. Inspectors shall subject all boilers to a thorough internal and external examination according to the standards in sections 326B.964 and 326B.966.\n(b) Anyone who installs a boiler must ensure that the boiler is inspected by the department after installation is complete and before the boiler is placed in operation. Inspection fees pursuant to section 326B.986 associated with this initial inspection are the responsibility of the installer.\n(c) The owner of a boiler must ensure that the boiler is inspected at least annually after the initial inspection, except as provided in sections 326B.956 and 326B.96.\n(d) The owner of a pressure vessel not specifically excepted by section 326B.988 must ensure that the pressure vessel is inspected at least every two years.\n(e) The fees under section 326B.986 for inspections conducted by the department under paragraphs (c) and (d) shall be the responsibility of the owner of the boiler or pressure vessel.\nAfter inspecting the boiler or pressure vessel, the boiler inspector shall document the condition of the boiler or pressure vessel. If the boiler or pressure vessel meets the inspection requirements in sections 326B.964 and 326B.966, the inspector shall attach a label or sticker to the boiler or pressure vessel indicating the month and year inspected and the name of the inspection agency. This label is the inspection certificate and shall indicate that the inspected boiler or pressure vessel is found to be safe and suitable for use. The boiler inspector shall directly attach a tag to a newly installed boiler that displays a unique identification number.\nIf, upon inspecting a boiler or pressure vessel, the boiler inspector determines that the boiler or pressure vessel does not meet the requirements in sections 326B.964 and 326B.966, the inspector shall notify the owner or operator in writing of any defect in the boiler or pressure vessel. The boiler or pressure vessel shall not be operated if the inspector determines that the boiler or pressure vessel is unsafe. The boiler or pressure vessel shall not be operated until these unsafe defects have been corrected and verified by the inspector. If the boiler inspector finds that a boiler is being operated by an unlicensed or improperly licensed person, operation of the boiler shall cease until all operators are properly licensed according to section 326B.978. If circumstances warrant continued operation, the boiler inspector may, at the discretion of the boiler inspector, give approval for continuing operation of the boiler for a specific period of time, not to exceed 30 days.\nEvery owner, lessee, or other person having charge of a boiler or pressure vessel subject to inspection under sections 326B.95 to 326B.998, except historical boilers under section 326B.956, shall register the boiler or pressure vessel with the department at the time of the initial inspection described in subdivision 1. The registration shall be renewed annually for each boiler or pressure vessel on record with the department.\nThe department shall issue an electronic certificate of registration that lists the registered boilers and pressure vessels at the location, expiration date of the certificate of registration, last inspection date of each registered boiler and pressure vessel, and maximum allowable working pressure for each registered boiler and pressure vessel. This certificate shall be available to be printed by the owner, lessee, or other person having charge of the registered boiler or pressure vessel.",
	"repealed": false
}