{
	"id": "611.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.41",
	"title": "611.41 DEFINITIONS.",
	"text": "For the purposes of sections 611.40 to 611.58, the following terms have the meanings given.\n\"Alternative program\" means any mental health or substance use disorder treatment or program that is not a competency attainment program but may assist a defendant in attaining competency.\n\"Cognitive impairment\" means a condition that impairs a person's memory, perception, communication, learning, or other ability to think. Cognitive impairment may be caused by any factor including traumatic, developmental, acquired, infectious, and degenerative processes.\n\"Community-based treatment program\" means treatment and services provided at the community level, including but not limited to community support services programs as defined in section 245.462, subdivision 6; day treatment services as defined in section 245.462, subdivision 8; mental health crisis services as defined in section 245.462, subdivision 14c; outpatient services as defined in section 245.462, subdivision 21; residential treatment services as defined in section 245.462, subdivision 23; assertive community treatment services provided under section 256B.0622; adult rehabilitation mental health services provided under section 256B.0623; home and community-based waivers; and supportive housing. Community-based treatment program does not include services provided by a state-operated treatment program.\n\"Competency\" means the ability to understand criminal proceedings, consult with counsel, and participate in the defense.\n\"Competency attainment program\" means a structured program of clinical and educational services that is certified and designed to identify and address barriers to a defendant's ability to understand the criminal proceedings, consult with counsel, and participate in the defense.\n\"Competency attainment services\" means education for defendants found incompetent to proceed provided by certified individuals using the approved curriculum to address barriers to a defendant's ability to understand the criminal proceedings, consult with counsel, and participate in the defense. Competency attainment services does not include housing assistance or programs, social services, or treatment that must be provided by a licensed professional including mental health treatment, substance use disorder treatment, or co-occurring disorders treatment.\n\"Court examiner\" means a person appointed to serve the court and who is a physician or psychologist who has a doctoral degree in psychology, and is either licensed in Minnesota or who holds current authority to practice in Minnesota under an approved interstate compact.\n\"Forensic navigator\" means a person hired or contracted to facilitate competency attainment services, supervise certain defendants found to be incompetent, prepare bridge plans, and provide the other services under section 611.55, subdivision 3.\n\"Head of the program\" means the head of the competency attainment program or the head of the facility or program where the defendant is being served.\n\"Jail-based program\" means a competency attainment program that operates within a correctional facility licensed by the commissioner of corrections under section 241.021 that meets the capacity standards governing jail facilities. A jail-based program may not be granted a variance to exceed its operational capacity.\n\"Locked treatment facility\" means a community-based treatment program, treatment facility, or state-operated treatment program that is locked and is licensed by the Department of Health or Department of Human Services.\n\"Mental illness\" means an organic disorder of the brain or a clinically significant disorder of thought, mood, perception, orientation, or memory, that grossly impairs judgment, behavior, capacity to recognize reality, or to reason or understand, that is manifested by instances of grossly disturbed behavior or faulty perceptions. Mental illness does not include disorders defined as cognitive impairments in subdivision 3; epilepsy; antisocial personality disorder; brief periods of intoxication caused by alcohol, drugs, or other mind-altering substances; or repetitive or problematic patterns of using any alcohol, drugs, or other mind-altering substances.\n\"State-operated treatment program\" means any community behavioral health hospital, crisis center, residential facility, outpatient service, or other program operated by the state and under the control of the Direct Care and Treatment executive board, for a person who has mental illness, developmental disability, or substance use disorder.\n\"Suspend the criminal proceedings\" means to cease all hearings and decisions regarding the merits of criminal charges but not terminate the jurisdiction of the court or prevent hearings or decisions in any other matters, including but not limited to establishing or modifying bail, conditions of release, probation conditions, no contact orders, and appointment of counsel.\n\"Targeted misdemeanor\" has the meaning given in section 299C.10, subdivision 1, paragraph (e).\n\"Treatment facility\" means a hospital, residential treatment provider, crisis residential withdrawal management center, or corporate foster care home that is not operated by the state and is qualified to provide care and treatment for persons who have mental illness, developmental disability, or substance use disorder.",
	"repealed": false
}