{
	"id": "151.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.072",
	"title": "151.072 REPORTING OBLIGATIONS.",
	"text": "A person who has knowledge of any conduct constituting grounds for discipline under the provisions of this chapter or the rules of the board may report the violation to the board.\nA pharmacy located in this state must report to the board any discipline that is related to an incident involving conduct that would constitute grounds for discipline under the provisions of this chapter or the rules of the board, that is taken by the pharmacy or any of its administrators against a pharmacist, pharmacist intern, or pharmacy technician, including the termination of employment of the individual or the revocation, suspension, restriction, limitation, or conditioning of an individual's ability to practice or work at or on behalf of the pharmacy. The pharmacy shall also report the resignation of any pharmacist, pharmacist intern, or technician prior to the conclusion of any disciplinary proceeding, or prior to the commencement of formal charges but after the individual had knowledge that formal charges were contemplated or in preparation. Each report made under this subdivision must state the nature of the action taken and state in detail the reasons for the action. Failure to report violations as required by this subdivision is a basis for discipline pursuant to section 151.071, subdivision 2, clause (8).\nA licensee or registrant of the board shall report to the board personal knowledge of any conduct that the person reasonably believes constitutes grounds for disciplinary action under this chapter or the rules of the board by any pharmacist, pharmacist intern, pharmacy technician, or controlled substance researcher, including any conduct indicating that the person may be professionally incompetent, or may have engaged in unprofessional conduct or may be medically or physically unable to engage safely in the practice of pharmacy or to carry out the duties permitted to the person by this chapter or the rules of the board. Failure to report violations as required by this subdivision is a basis for discipline pursuant to section 151.071, subdivision 2, clause (20).\nA licensee or registrant of the board shall report to the board any personal action that would require that a report be filed with the board pursuant to subdivision 2.\nReports required by subdivisions 2 to 4 must be submitted not later than 30 days after the occurrence of the reportable event or transaction. The board may provide forms for the submission of reports required by this section, may require that reports be submitted on the forms provided, and may adopt rules necessary to assure prompt and accurate reporting.\nThe board may issue subpoenas for the production of any reports required by subdivisions 2 to 4 or any related documents.",
	"repealed": false
}