{
	"id": "297F.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.03",
	"title": "297F.03 LICENSES; CIGARETTE AND TOBACCO PRODUCTS DISTRIBUTOR AND SUBJOBBER.",
	"text": "No person shall engage in the business of a distributor or subjobber at any place of business without first having received a license from the commissioner to engage in that business at that place of business.\nEvery application for a cigarette or tobacco products license shall be made on a form prescribed by the commissioner.\nA separate application for a distributor's license shall be made for each place of business at which a distributor proposes to engage in business.\nA separate application for a subjobber's license may be made by a licensed distributor for each place of business, other than that licensed in the distributor's license, to which the distributor sells or distributes stamped cigarettes or tobacco products.\nA person outside this state who ships or transports cigarettes or tobacco products to retailers in this state, to be sold by those retailers, shall make an application for a distributor's license, be granted such a license by the commissioner, and thereafter be subject to all the provisions of this chapter.\nEach application for a cigarette distributor's license must be accompanied by a fee of $300. Each application for a cigarette subjobber's license must be accompanied by a fee of $24. A distributor or subjobber applying for a license during the second year of a two-year licensing period is required to pay only one-half of the license fee.\nEach application for a tobacco products distributor's license must be accompanied by a fee of $75. Each application for a tobacco products subjobber's license must be accompanied by a fee of $20. A distributor or subjobber applying for a license during the second year of a two-year licensing period is required to pay only one-half of the license fee.\nThe commissioner, upon receipt of the application in proper form, and payment of the license fee required by this chapter, shall, unless otherwise provided by this chapter, issue the applicant a license in the form prescribed by the commissioner. The license permits the applicant to engage in business as a distributor or subjobber at the place of business shown in the application.\nThe licensing period begins January 1 of an even-numbered year and ends on December 31 of the following year. Each license issued shall expire on December 31 of the second year of the licensing period unless sooner revoked by the commissioner or unless the business with respect to which the license was issued is transferred. In either case the holder of the license shall immediately surrender it to the commissioner.\nEach license must be prominently displayed on the premises covered by the license.\nLicenses are not transferable to any other person.",
	"repealed": false
}