{
	"id": "122A.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.18",
	"title": "122A.18 BOARD TO ISSUE LICENSES.",
	"text": "(a) The Professional Educator Licensing and Standards Board must issue the following teacher licenses to applicants who meet the qualifications prescribed by this chapter:\n(1) Tier 1 license under section 122A.181;\n(2) Tier 2 license under section 122A.182;\n(3) Tier 3 license under section 122A.183; and\n(4) Tier 4 license under section 122A.184.\n(b) The Board of School Administrators must license supervisory personnel as defined in section 122A.15, subdivision 2, except for athletic coaches.\n(c) The Professional Educator Licensing and Standards Board and the Department of Education must enter into a data sharing agreement to share:\n(1) educational data at the E-12 level for the limited purpose of program approval and improvement for teacher education programs. The program approval process must include targeted redesign of teacher preparation programs to address identified E-12 student areas of concern; and\n(2) data in the staff automated reporting system for the limited purpose of managing and processing funding to school districts and other entities. The board has authority to collect and retain nonlicensed staff data on behalf of the Department of Education. The board must share licensed and nonlicensed staff data with the department as outlined in the data sharing agreement required under section 122A.18, subdivision 1, paragraph (d). The department may access and use the data as required under federal or state law and for the purposes outlined in the data sharing agreement.\n(d) The Board of School Administrators and the Department of Education must enter into a data sharing agreement to share educational data at the E-12 level for the limited purpose of program approval and improvement for education administration programs. The program approval process must include targeted redesign of education administration preparation programs to address identified E-12 student areas of concern.\n(e) For purposes of the data sharing agreements under paragraphs (c) and (d), the Professional Educator Licensing and Standards Board, Board of School Administrators, and Department of Education may share private data, as defined in section 13.02, subdivision 12, on teachers and school administrators. The data sharing agreements must not include educational data, as defined in section 13.32, subdivision 1, but may include summary data, as defined in section 13.02, subdivision 19, derived from educational data.\nThe Professional Educator Licensing and Standards Board must issue licenses and credentials under its jurisdiction to persons the board finds to be qualified and competent for support personnel positions in accordance with section 120B.363.\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\nThe Professional Educator Licensing and Standards Board must adopt rules providing for reading teacher licensure.\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\n[Repealed by amendment, 2016 c 189 art 24 s 3]\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\n(a) The Professional Educator Licensing and Standards Board may allow a person who otherwise qualifies for a Tier 1 license in accordance with section 122A.181, subdivision 2, or is enrolled in and making satisfactory progress in a board-approved teacher program and who has successfully completed student teaching to be employed as a short-call substitute teacher.\n(b) The Professional Educator Licensing and Standards Board may issue a lifetime qualified short-call or long-call substitute teaching license to a person who:\n(1) was a qualified teacher under section 122A.16 while holding a Tier 3 or Tier 4 teaching license issued by the board, under sections 122A.183 and 122A.184, respectively, and receives a retirement annuity from the Teachers Retirement Association or the St. Paul Teachers Retirement Fund Association;\n(2) holds an out-of-state teaching license and receives a retirement annuity as a result of the person's teaching experience; or\n(3) held a Tier 3 or Tier 4 teaching license issued by the board, under sections 122A.183 and 122A.184, respectively, taught at least three school years in an accredited nonpublic school in Minnesota, and receives a retirement annuity as a result of the person's teaching experience.\nA person holding a lifetime qualified short-call or long-call substitute teaching license is not required to complete continuing education clock hours. A person holding this license may reapply to the board for either:\n(i) a Tier 3 or Tier 4 teaching license under sections 122A.183 and 122A.184, respectively, and must again complete continuing education clock hours one school year after receiving the Tier 3 or Tier 4 teaching license; or\n(ii) a Tier 1 license under section 122A.181, provided that the applicant has a bachelor's degree, an associate's degree, or an appropriate professional credential in the content area the applicant will teach, in accordance with section 122A.181, subdivision 2.\nMS 2017 Supp [Repealed, 1Sp2017 c 5 art 3 s 36]\nMS 2022 [Repealed, 2023 c 55 art 5 s 67]\n(a) The Professional Educator Licensing and Standards Board and the Board of School Administrators must initiate criminal history background studies of all first-time applicants for educator and administrator licenses under their jurisdiction. Applicants must include with their licensure applications:\n(1) an executed criminal history consent form, including fingerprints; and\n(2) payment to conduct the background study. The Professional Educator Licensing and Standards Board must deposit payments received under this subdivision in an account in the special revenue fund. Amounts in the account are annually appropriated to the Professional Educator Licensing and Standards Board to pay for the costs of background studies on applicants for licensure.\n(b) The background study for all first-time applicants for educator licenses must include a review of information from the Bureau of Criminal Apprehension, including criminal history data as defined in section 13.87, and must also include a review of the national criminal records repository. The superintendent of the Bureau of Criminal Apprehension is authorized to exchange fingerprints with the Federal Bureau of Investigation for purposes of the criminal history check.\n(c) The Professional Educator Licensing and Standards Board may initiate criminal history background studies through the commissioner of human services according to section 245C.031 to obtain background study data required under this chapter.\n[Repealed, 2012 c 239 art 2 s 21]\n(a) The Professional Educator Licensing and Standards Board must adopt rules establishing a process for an eligible applicant to obtain an initial Tier 3 license, or to add a licensure field to a Tier 3 or Tier 4 license via portfolio. The portfolio licensure application process must be consistent with the requirements in this subdivision.\n(b) An applicant for an initial Tier 3 license via portfolio must submit to the board one portfolio demonstrating pedagogical competence and one portfolio demonstrating content competence.\n(c) An applicant seeking to add a licensure field via portfolio must submit to the board one portfolio demonstrating content competence for each licensure field the applicant seeks to add.\n(d) The board must notify an applicant who submits a portfolio under paragraph (b) or (c) within 90 calendar days after the portfolio is received whether or not the portfolio is approved. If the portfolio is not approved, the board must inform the applicant how to revise the portfolio to successfully demonstrate the requisite competence. The applicant may resubmit a revised portfolio at any time and the board must approve or disapprove the revised portfolio within 60 calendar days of receiving it.\n(e) An applicant must pay a fee for a portfolio in accordance with section 122A.21, subdivision 4.\nThe Professional Educator Licensing and Standards Board shall collect data on educators' employment and assignments from all school districts and charter schools. The report may include data on educators' demographics and licensure.",
	"repealed": false
}