{
	"id": "103F.161",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.161",
	"title": "103F.161 FLOOD HAZARD MITIGATION GRANTS.",
	"text": "(a) The commissioner may make grants to local governments to:\n(1) conduct floodplain damage reduction studies to determine the most feasible, practical, and effective methods and programs for mitigating the damages due to flooding within flood-prone rural and urban areas and their watersheds; and\n(2) plan and implement flood mitigation measures.\n(b) The commissioner may cooperate with the North Dakota State Water Commission, local governmental units, and local water management organizations in this state and in North Dakota, and the United States Army Corps of Engineers to develop hydrologic models and conduct studies to evaluate the practicality and feasibility of flood control measures along the Red River from East Grand Forks to the Canadian border. The commissioner may make grants to local governmental units for these purposes. Flood control measures that may be investigated include agricultural and urban levee systems, wetland restoration, floodwater impoundments, farmstead ring-dikes, and stream maintenance activities.\n(a) A local government may apply to the commissioner for a grant on forms provided by the commissioner. The commissioner shall confer with the local government requesting the grant and may make a grant up to $150,000 based on the following considerations:\n(1) the extent and effectiveness of mitigation measures already implemented by the local government requesting the grant;\n(2) the feasibility, practicality, and effectiveness of the proposed mitigation measures and the associated nonflood related benefits and detriments;\n(3) the level of grant assistance that should be provided to the local government, based on available facts regarding the nature, extent, and severity of flood problems;\n(4) the frequency of occurrence of severe flooding that has resulted in declaration of the area as a flood disaster area by the president of the United States;\n(5) the economic, social, and environmental benefits and detriments of the proposed mitigation measures;\n(6) whether the floodplain management ordinance or regulation adopted by the local government meets the minimum standards established by the commissioner, the degree of enforcement of the ordinance or regulation, and whether the local government is complying with the ordinance or regulation;\n(7) the degree to which the grant request is consistent with local water plans developed under chapters 103B and 103D;\n(8) the financial capability of the local government to solve its flood hazard problems without financial assistance; and\n(9) the estimated cost and method of financing of the proposed mitigation measures based on local money and federal and state financial assistance.\n(b) If the amount of the grant requested is $150,000 or more, the commissioner shall determine, under the considerations in paragraph (a), whether any part of the grant should be awarded. The commissioner must submit an appropriation request to the governor and the legislature for funding consideration before each odd-numbered year, consisting of requests or parts of grant requests of $150,000 or more. The commissioner must prioritize the grant requests, under the considerations in paragraph (a), beginning with the projects the commissioner determines most deserving of financing.\n(c) A grant may not exceed one-half the total cost of the proposed mitigation measures.\n(d) After July 1, 1991, grants made under this section may be made to local governments whose grant requests are part of, or responsive to, a comprehensive local water plan prepared under chapter 103B or 103D.\nNotwithstanding subdivision 2, a grant for implementation of a flood hazard mitigation project in the Red River basin that is consistent with the 1998 mediation agreement and approved by the Red River flood damage reduction work group may be for up to 75 percent of the cost of the proposed mitigation measures.",
	"repealed": false
}