{
	"id": "122A.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.43",
	"title": "122A.43 SHORT-TERM, LIMITED CONTRACTS.",
	"text": "A school board may enter into short-term, limited contracts with classroom teachers employed by the district.\nThe board must determine the needs of its classroom teachers and the need for changes in its curriculum. In determining these needs, the school board must obtain recommendations from classroom teachers, staff responsible for curriculum, and the curriculum advisory committee. It shall consider assessment results, other test results, the need for mentor teachers, and the district improvement plan portion of the report adopted according to section 120B.11, subdivision 3. Contracts executed under this section shall relate directly to the identified needs.\nA committee of six members appointed by the board shall recommend teachers to receive contracts. Three members of the committee shall be classroom teachers. Three members shall be administrators, parents, members of the school board, or members of the community. The committee shall consider only classroom teachers who have background, knowledge, or expertise needed to perform duties in the areas of need identified by the board. Years of service in the district must not be a factor for consideration by the committee. A teacher shall not have a right to a contract under this section based on seniority or order of employment in the district. The committee shall recommend to the school board names of individual teachers. The number of individual teachers recommended shall be approximately the number designated by the board to meet the identified needs. The board may award contracts to any of the recommended teachers but not to any others. The board may request the committee to recommend additional names of teachers.\nContracts executed under this section shall provide classroom teachers any one or a combination of the following:\n(1) released time during the school day;\n(2) additional hours in a school day; or\n(3) additional days or weeks of employment during the summer.\nContracts executed under this section shall terminate within one year of the date of execution. During the term of a contract under this section a teacher may be discharged for cause from duties under this contract; a hearing shall be held on the discharge upon request of the teacher. A teacher has no rights in a subsequent year to a contract under this subdivision.\nThe provisions of section 122A.40 or 122A.41 shall not apply to initial awards, renewal, or termination of contracts under this section. The provisions of this section concerning short-term, limited contracts shall not be construed to alter any aspect of other contracts executed by a school board.\n[Repealed, 2016 c 189 art 25 s 63]",
	"repealed": false
}