{
	"id": "471.981",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.981",
	"title": "471.981 SELF-INSURANCE COVERAGE BY POLITICAL SUBDIVISION.",
	"text": "A political subdivision may by ordinance or resolution of its governing body self insure against liability of the political subdivision and its officers, employees, agents and servants under chapter 466, sections 340A.801 and 340A.802 and other law, for damages resulting from its torts including torts for which the political subdivision has immunity and those of its officers, employees, agents and servants. A political subdivision may by ordinance or resolution of its governing body extend the coverage of its self insurance to afford protection in excess of any limitations on liability established by law but unless expressly provided in the ordinance or resolution extending the coverage, the statutory limitations on liability shall not be deemed to have been waived. A political subdivision may by ordinance or resolution of its governing body provide for self insurance against risk of damage to any of its property, for any liability exposure, or against any other risk or hazard, not including health, life, accident or disability of its employees, and may, through its self insurance program, provide coverage for insuring any of its officers or employees against any risk or hazard, not including health, life, accident or disability of its employees.\nA political subdivision may establish a self insurance revolving fund. The initial amount of the fund shall be determined by the governing body. The governing body may appropriate the amounts necessary to maintain the fund at the level specified in the ordinance or resolution establishing it. Expenditures from the fund may be made for:\n(1) payment of losses;\n(2) costs of defense and investigation;\n(3) premiums and deductible amounts when commercial insurance is purchased for a risk;\n(4) debt service and debt service related expenses for bonds issued under this section;\n(5) cost of loss control activities; and\n(6) any other costs customarily borne by commercial insurers under conventional insurance policies.\nA pool may be established by agreement of any two or more political subdivisions. The pool may cover the same risks and shall be subject to the same limitations as those enumerated under subdivisions 1 and 2. The pool shall be operated under bylaws established by the political subdivisions that participate in the pool. The bylaws and the agreement establishing the pool may provide for bylaw amendment without unanimous consent of all pool members. The political subdivisions participating in the fund may establish a joint board to manage the pool with powers and duties as deemed appropriate. A political subdivision participating in the pool shall pay to the pool all amounts assessed against it pursuant to the bylaws of the pool and may withdraw only after it has reimbursed the pool for all amounts for which it is obligated under the terms of the agreement. The establishment of a pool shall not increase the liability limits of any member of the pool above the limits established by law for that governmental unit. Except as otherwise provided in this section, pools shall be governed by section 471.59.\nA political subdivision or joint self-insurance pool of counties established by the Minnesota Counties Intergovernmental Trust may create or become a member of a mutual insurance company organized under chapter 66A, and may exchange reciprocal or interinsurance contracts as authorized by chapter 71A. For purposes of this subdivision and subdivisions 4a, 4b, and 4c, \"county\" includes a joint powers entity created by counties for a special purpose. Membership in a mutual insurance company created by a joint self-insurance pool of counties shall be limited to joint self-insurance pools of counties. Notwithstanding section 66A.02, chapter 317A shall apply to a mutual insurance company created pursuant to this subdivision. Notwithstanding section 66A.08, for a mutual insurance company created under this subdivision, there shall be not less than 32 bona fide applications for policies of insurance of each kind sought to be written, signed by at least 32 members, covering at least 32 separate risks, each risk, within the maximum net single risk described in this subdivision and one year's premiums thereon paid in cash, and admitted assets of not less than $100,000, which admitted assets shall not be less than five times the maximum net single risk, as defined in this subdivision. The company shall have on deposit with the commissioner of insurance, as security for all of its policyholders, stock or bonds of this state or of the United States or bonds of any of the political subdivisions of this state, or personal obligations secured by first mortgages on real estate within this state worth, exclusive of buildings, the amount of the lien, and bearing interest of not less than three percent per annum, to an amount the actual market value of which, exclusive of interest, shall never be less than $100,000. No such company shall expose itself to any loss on any one risk or hazard, except as provided in this subdivision, in an amount exceeding ten percent of its net assets, actual and contingent. In this subdivision, \"contingent assets\" means the aggregate amount of the contingent liability of its members for the payment of loss and expenses not provided for by its cash funds. \"Contingent liability,\" in this subdivision, means an amount not to exceed one annual premium as stated in the policy. No portion of any risk or hazard which has been reinsured, as authorized by the laws of this state, shall be included in determining the limitation of risk prescribed by this subdivision.\nA political subdivision may, by resolution of its governing body, and without advertisement for bids, enter into an insurance installment purchase agreement with a self-insurance pool. Such a self-insurance pool may purchase insurance on behalf of the participating political subdivisions and may use insurance installment purchase agreements or other obligations of the participating political subdivisions to provide the participating political subdivisions with coverage against all or any part of the risks enumerated in subdivision 1 and against any risk which the political subdivision is authorized to insure under section 176.181, subdivision 1. Notwithstanding any limitations set forth under section 475.52, a political subdivision which has established a self-insurance revolving fund under subdivision 2 or self-insurance pool may fund insurance claims and reserves and finance insurance installment purchase agreements for the political subdivision, self-insurance pool, or a mutual insurance company established pursuant to subdivision 4 and fund other costs set forth in subdivision 2 by issuing revenue bonds, bonds which are general obligations of the self-insurance pool or mutual insurance company, as applicable, or other obligations secured by payments made or to be made by the political subdivisions or pool. An insurance installment purchase agreement of a participating political subdivision may require that the political subdivision make payments sufficient to produce revenue for the prompt payment of the bonds or other obligations, including all interest and premiums, if any, accruing on them. The insurance installment purchase agreements may provide for additional contributions or premiums if it is actuarially determined that the assets of the insurance installment purchase agreements available to pay claims are insufficient. The insurance installment purchase agreements may be multiyear contracts and shall not be subject to any referendum, public bidding, or net debt limitation requirement of chapter 475.\nA self-insurance pool may issue bonds which are general obligations of the self-insurance pool or revenue bonds secured by insurance installment purchase agreements of the participating political subdivisions issued pursuant to subdivision 4a. The pool, with the approval of the governing body of each participating political subdivision, shall fix the total amount needed for the procurement of insurance and shall apportion to each participating political subdivision the political subdivision's share of that amount and of the costs of operation, or of annual debt service or payments required to pay such amount with interest. Notwithstanding any limitations set forth under section 475.52, or any other general or special law or charter to the contrary, a political subdivision may issue revenue bonds or other obligations to provide funds for the purposes, including self-insurance, authorized by this section. Any other law notwithstanding, bonds or other obligations issued under this subdivision may be sold at public or private sale upon the terms and conditions the issuer determines. No election shall be required to authorize the issuance of the obligations, and the obligations shall not be subject to any limitation on net debt. Notwithstanding any limitation imposed by section 475.54, the obligations shall mature in the years the issuer determines. In addition to permitted uses described above, proceeds of obligations issued pursuant to this subdivision may be used to establish a debt service reserve for the obligations, pay costs of issuing the bonds or to refund obligations previously issued pursuant to this subdivision. An issuer of bonds authorized under this subdivision may designate a bank or trust company authorized to exercise trust powers in this state as trustee for the holders of obligations issued pursuant to this subdivision and may create funds and accounts necessary to secure payment of the obligations. Sales proceeds of bonds issued under this subdivision, except for sales proceeds used to pay costs of issuing the bonds shall be invested so that the average life of the investments exceeds the average life of the bonds. The proceeds from bonds issued under this subdivision must be held in trust and may only be paid to the self-insurer according to the schedule of payments set forth in the trust instruments.\nA qualified actuary shall certify that the amount of the scheduled payment does not exceed the amount necessary to meet the obligation of the self-insurer at the time payment is scheduled to be made.\nNotwithstanding the investment limitations imposed in chapters 118A and 475, proceeds of bonds issued pursuant to this subdivision, and debt service funds and reserves held in connection with them shall be invested solely in governmental bonds, notes, bills, and other securities, which are direct obligations or are guaranteed or insured issues of the United States, its agencies, its instrumentalities, or organizations created by act of Congress, excluding mortgage-backed securities.\nIf required by the resolution authorizing the issuance of obligations pursuant to this subdivision, the governing body of each participating political subdivision shall annually levy a tax sufficient to repay the costs of retirement of any bonds or to make payments under insurance installment purchase agreements. Taxes may be levied pursuant to this subdivision without limitation as to rate or amount.\nParticipating political subdivisions may delegate to a self-insurance pool of political subdivisions the power to determine the interest rate on insurance installment purchase agreements provided that the rate is uniform and does not exceed the net effective rate on revenue bonds or other obligations sold by or on behalf of the pool by more than one-fourth of one percent.\n(a) Notwithstanding any limitations under section 475.52, or any other general or special law or charter to the contrary, a political subdivision may issue bonds or other obligations to purchase insurance coverage for employee health benefits, all or any part of the risks enumerated in subdivision 1, and any risk which the political subdivision may insure under section 176.181, subdivision 1. The obligations must be issued under chapter 475, except that no election is required. The obligations must mature in the years and amounts determined by the governing body, not exceeding the lesser of three years or the term of the insurance contract purchased with the proceeds of the obligations.\n(b) In addition to the permitted uses described in paragraph (a), proceeds of obligations issued under this subdivision may be used to establish a debt service reserve for the obligations, to pay costs of issuing the obligations, or to refund obligations previously issued under this subdivision.\n(c) An issuer of obligations authorized under this subdivision may designate a bank or trust company authorized to exercise trust powers in this state as trustee for the holders of obligations issued pursuant to this subdivision and may create funds and accounts necessary to secure payment of the obligations.\n(d) Notwithstanding any law to the contrary, a levy to pay obligations issued under this subdivision is not a levy to pay bonded indebtedness or other debt levy that is exempt from levy limitations and the levy is subject to any otherwise applicable levy limits.\nA town may use a self-insurance revolving fund or pool to discharge the bond requirements provided by chapter 367 for the town clerk and treasurer.\nA home rule charter or statutory city may use a self-insurance revolving fund or pool to discharge the bond requirements provided by state law for officers and employees of the city.\nA political subdivision or pool may purchase environmental protection coverage from a risk retention group operating under United States Code, title 15, sections 3901 to 3906, and may purchase nonassessable stock of the group if stock ownership is a prerequisite for participation.",
	"repealed": false
}