{
	"id": "181.974",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.974",
	"title": "181.974 GENETIC TESTING IN EMPLOYMENT.",
	"text": "For the purposes of this section, the following terms have the meanings given them in this subdivision.\n(a) \"Genetic test\" means the analysis of human DNA, RNA, chromosomes, proteins, or certain metabolites in order to detect disease-related genotypes or mutations. Tests for metabolites fall within the definition of genetic test when an excess or deficiency of the metabolites indicates the presence of a mutation or mutations. Administration of metabolic tests by an employer or employment agency that are not intended to reveal the presence of a mutation does not violate this section, regardless of the results of the tests. Test results revealing a mutation are, however, subject to this section.\n(b) \"Employer\" means any person having one or more employees in Minnesota, and includes the state and any political subdivisions of the state.\n(c) \"Employee\" means a person who performs services for hire in Minnesota for an employer, but does not include independent contractors.\n(d) \"Protected genetic information\" means:\n(1) information about a person's genetic test; or\n(2) information about a genetic test of a blood relative of a person.\n(a) No employer or employment agency shall directly or indirectly:\n(1) administer a genetic test or request, require, or collect protected genetic information regarding a person as a condition of employment; or\n(2) affect the terms or conditions of employment or terminate the employment of any person based on protected genetic information.\n(b) No person shall provide or interpret for any employer or employment agency protected genetic information on a current or prospective employee.\nAny person aggrieved by a violation of this section may bring a civil action, in which the court may award:\n(1) up to three times the actual damages suffered due to the violation;\n(2) punitive damages;\n(3) reasonable costs and attorney fees; and\n(4) injunctive or other equitable relief as the court may deem appropriate.",
	"repealed": false
}