{
	"id": "120A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/120A.20",
	"title": "120A.20 ADMISSION TO PUBLIC SCHOOL.",
	"text": "(a) All schools supported in whole or in part by state funds are public schools. Admission to a public school is free to any person who: (1) resides within the district that operates the school; (2) is under 21 years of age or who meets the requirements of paragraph (c); and (3) satisfies the minimum age requirements imposed by this section. Notwithstanding the provisions of any law to the contrary, the conduct of all students under 21 years of age attending a public secondary school is governed by a single set of reasonable rules and regulations promulgated by the school board.\n(b) A person shall not be admitted to a public school (1) as a kindergarten pupil, unless the pupil is at least five years of age on September 1 of the calendar year in which the school year for which the pupil seeks admission commences; or (2) as a 1st grade student, unless the pupil is at least six years of age on September 1 of the calendar year in which the school year for which the pupil seeks admission commences or has completed kindergarten; except that any school board may establish a policy for admission of selected pupils at an earlier age under section 124D.02.\n(c) A pupil who becomes age 21 after enrollment is eligible for continued free public school enrollment until at least one of the following occurs: (1) the first September 1 after the pupil's 21st birthday; (2) the pupil's completion of the graduation requirements; (3) the pupil's withdrawal with no subsequent enrollment within 21 calendar days; (4) the end of the school year; or (5) in the case of a student with a disability as defined under section 125A.02, the pupil's 22nd birthday.\n(a) Notwithstanding subdivision 1, a district must not deny free admission to a homeless pupil solely because the district cannot determine that the pupil is a resident of the district.\n(b) The school district of residence for a homeless pupil shall be the school district in which the parent or legal guardian resides, unless: (1) parental rights have been terminated by court order; (2) the parent or guardian is not living within the state; or (3) the parent or guardian having legal custody of the child is an inmate of a Minnesota correctional facility or is a resident of a halfway house under the supervision of the commissioner of corrections. If any of clauses (1) to (3) apply, the school district of residence shall be the school district in which the pupil resided when the qualifying event occurred. If no other district of residence can be established, the school district of residence shall be the school district in which the pupil currently resides. If there is a dispute between school districts regarding residency, the district of residence is the district designated by the commissioner of education.\n(c) Except as provided in paragraph (d), the serving district is responsible for transporting a homeless pupil to and from the pupil's district of residence. The district may transport from a permanent home in another district but only through the end of the academic school year. When a pupil is enrolled in a charter school, the district or school that provides transportation for other pupils enrolled in the charter school is responsible for providing transportation. When a homeless pupil with or without an individualized education program attends a public school other than an independent or special school district or charter school, the district of residence is responsible for transportation.\n(d) For a homeless pupil with an individualized education program enrolled in a program authorized by an intermediate school district, special education cooperative, service cooperative, or education district, the serving district at the time of the pupil's enrollment in the program remains responsible for transporting that pupil for the remainder of the school year, unless the initial serving district and the current serving district mutually agree that the current serving district is responsible for transporting the homeless pupil.\n[Repealed, 2006 c 263 art 1 s 17]\nPublic schools may request documentation that verifies a pupil falls within the school's minimum and maximum age requirements for admission to publicly funded prekindergarten, preschool, kindergarten, or grades 1 through 12. Documentation may include a passport, a hospital birth record or physician's certificate, a baptismal or religious certificate, an adoption record, health records, immunization records, immigration records, previously verified school records, early childhood screening records, Minnesota Immunization Information Connection records, or an affidavit from a parent.",
	"repealed": false
}