{
	"id": "243.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.51",
	"title": "243.51 UNITED STATES PRISONERS; PRISONERS FROM OTHER STATES.",
	"text": "The commissioner of corrections is hereby authorized to contract with agencies and bureaus of the United States and with the proper officials of other states or a county of this state for the custody, care, subsistence, education, treatment and training of persons convicted of criminal offenses constituting felonies in the courts of this state, the United States, or other states of the United States. The contracts shall provide for reimbursing the state of Minnesota for all costs or other expenses involved, and, to the extent possible, require payment to the Department of Corrections of a per diem amount that is substantially equal to or greater than the per diem for the cost of housing Minnesota inmates at the same facility. This per diem cost shall be based on the assumption that the facility is at or near capacity. Funds received under the contracts shall be deposited in the state treasury and are appropriated to the commissioner of corrections for correctional purposes. Any prisoner transferred to the state of Minnesota pursuant to this subdivision shall be subject to the terms and conditions of the prisoner's original sentence as if the prisoner were serving the same within the confines of the state in which the conviction and sentence was had or in the custody of the United States. Nothing herein shall deprive the inmate of the right to parole or the rights to legal process in the courts of this state.\nThe commissioner of corrections may transfer to the custody of the United States attorney general any inmate of a Minnesota correctional facility whose presence is seriously detrimental to the internal discipline and well-being of the facility, or whose personal safety cannot be reasonably secured therein or in any other state facility, provided the attorney general of the United States accept such transfer. Such transfer shall be accomplished in the manner prescribed by United States Code, title 18, section 5003, and acts amendatory thereof, and the commissioner of corrections may execute such contracts as therein provided. The reimbursement of the federal government for all costs and expenses incurred for the care, custody, subsistence, education, treatment, and training of such transferee shall be paid from the appropriation for the operation of the Minnesota correctional facility from which the inmate was transferred.\nThe chief executive officer of the transferring facility shall attach to such contract a duly certified copy of the warrant of commitment under which such inmate is held, together with copies of such other commitment papers as are required by section 243.49, and such other data relating to the character and condition of such inmates as the officer may deem necessary or may be required by the federal prison authorities. Such copy of the warrant of commitment and accompanying papers shall constitute sufficient authority for the United States to hold such inmate on behalf of the state of Minnesota.\nAny inmate so transferred under this subdivision shall be subject to the terms and conditions of the inmate's original sentence as if the inmate were serving the same within the confines of the facility from which transferred. Nothing herein contained shall deprive such inmate of the right to parole or the rights to legal process in the courts of this state.\nThe commissioner of corrections is authorized to contract with agencies and bureaus of the United States and with the appropriate officials of any other state or county of this state for the temporary detention of any person in custody pursuant to any process issued under the authority of the United States, other states of the United States, or the district courts of this state. The contract shall provide for reimbursement to the state of Minnesota for all costs and expenses involved, and, to the extent possible, require payment to the Department of Corrections of a per diem amount that is substantially equal to or greater than the per diem for the cost of housing Minnesota inmates at the same facility. This per diem cost shall be based on the assumption that the facility is at or near capacity. Funds received under the contracts shall be deposited in the state treasury and are appropriated to the commissioner of corrections for correctional purposes.\n[Repealed, 1998 c 367 art 9 s 24]\n[Repealed, 2013 c 86 art 3 s 15]",
	"repealed": false
}