{
	"id": "384.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/384.151",
	"title": "384.151 SALARIES, FEES, BUDGET; COUNTIES UNDER 75,000; APPEALS.",
	"text": "MS 2008 [Repealed, 2009 c 152 s 25]\n(a) The county board of each of the counties of less than 75,000 population annually shall set by resolution the salary of the county auditor which shall be paid to the county auditor at such intervals as the board shall determine but not less often than once each month.\n(b) At the January meeting prior to the first date on which applicants may file for the office of county auditor the board shall set by resolution the minimum salary to be paid the county auditor for the term next following.\n(c) In the event a vacancy occurs in the office of county auditor the board may set the annual salary for the remainder of the calendar year at an amount less than was set for that year.\n(d) The salary of the county auditor shall not be reduced during the term for which the auditor was elected or appointed.\n(e) In the event that duties are assigned to the auditor which are in addition to duties as auditor, additional compensation may be provided for the additional duties. The county board by resolution shall determine the additional compensation which shall be paid and specify the duties for which the additional compensation is to be paid.\nMS 1974 [Repealed, 1975 c 301 s 16]\nMS 2008 [Repealed, 2009 c 152 s 25]\nMS 1949 [Repealed, 1951 c 327 s 6]\nThe county auditor shall charge and collect all fees as prescribed by law and all such fees collected shall be paid to the county in the manner and at the times prescribed by the county board, but not less often than once each month. The county auditor shall not retain any additional compensation, per diem or other emolument for services as county auditor, but may receive and retain mileage and expense allowances as prescribed by law.\n(a) The county board by resolution shall provide the budget for:\n(1) the salaries of deputies, clerks and other employees in the office of the county auditor;\n(2) other expenses necessary in the performance of the duties of said office; and\n(3) the payment of premiums of any bonds required of any deputy, clerk, or employee in said office\nand the board is authorized to appropriate funds therefor and for the salary of the county auditor.\n(b) Nothing in this subdivision shall limit the right of the county auditor to appoint deputies for said office as provided in Minnesota Statutes 1961, section 384.08.\nThe county auditor if dissatisfied with the action of the county board in setting the amount of the auditor's salary or the amount of the budget for the office of county auditor, may appeal to the district court on the grounds that the determination of the county board in setting such salary or budget was arbitrary, capricious, oppressive, or in unreasonable disregard for the responsibilities and duties of said office, and the auditor's experience, qualifications, and performance. The appeal shall be taken within 15 days after the date of the resolution setting such salary or budget by serving a notice of appeal on the county auditor and filing same with the court administrator of the district court. The court either in term or vacation and upon ten days' notice to the chair of the board shall hear such appeal. On the hearing of the appeal the court shall review the decision or resolution of the board in like manner as though reviewed by certiorari, except new or additional evidence may be taken. The court may order the officer appealing and the board to submit briefs or other memoranda and may dispose of the appeal on such writings. If the court shall find that the board acted in an arbitrary, capricious, oppressive or unreasonable manner it shall remand the matter to the county board for further action consistent with the court's finding.\nThe provisions of subdivisions 1 to 7 shall take effect in the respective counties specified in subdivision 1 as follows:\n(1) upon the expiration of the term of the incumbent holding the office on July 1, 1965; or\n(2) upon the occurrence prior thereto of a vacancy in the office of county auditor; or\n(3) subsequent to July 1, 1965, and upon not less than 30 days' written notice by the auditor, the county board shall make the provisions of subdivisions 1 to 7 effective on the first day of the month following the expiration of the notice period.\nAll laws relating to the salary, fees and clerk hire for the county auditor inconsistent herewith are superseded.",
	"repealed": false
}