{
	"id": "383A.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.155",
	"title": "383A.155 HOUSING IMPROVEMENT AREAS.",
	"text": "The Ramsey County Housing and Redevelopment Authority shall have the powers of a city under sections 428A.11 to 428A.21 to establish housing improvement areas in Ramsey County.\n(a) For purposes of exercising the powers in sections 428A.11 to 428A.21, references in those sections to the terms in paragraphs (b) to (e) have the meanings given them for purposes of this section.\n(b) \"Mayor\" means the chair of the Ramsey County Housing and Redevelopment Authority.\n(c) \"Council\" or \"governing body of the city\" means the Ramsey County Housing and Redevelopment Authority.\n(d) \"City clerk\" means the person designated by the Ramsey County Housing and Redevelopment Authority to carry out the duties of the city clerk under sections 428A.11 to 428A.21.\n(e) \"Enabling ordinance\" means a resolution adopted under subdivision 3 by the Ramsey County Housing and Redevelopment Authority.\nThe Ramsey County Housing and Redevelopment Authority may adopt a resolution establishing one or more housing improvement areas within the county under this section. The Ramsey County Housing and Redevelopment Authority shall send a copy of each petition for the establishment of a housing improvement area to the city in which the proposed housing improvement area is located. The public hearings under sections 428A.13 and 428A.14 may be held at the times and places determined by the Ramsey County Housing and Redevelopment Authority, except that they must be held at least 30 days after the date the applicable petition was sent to the city. If the city council adopts a resolution opposing the establishment within 30 days of the date the copy of the petition was sent to the city under this subdivision, the Ramsey County Housing and Redevelopment Authority may not establish the proposed housing improvement area.\nExcept as otherwise provided in this section, sections 428A.11 to 428A.21 apply to the establishment of a housing improvement area by the Ramsey County Housing and Redevelopment Authority.",
	"repealed": false
}