{
	"id": "260C.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.80",
	"title": "260C.80 OFFICE OF THE FOSTER YOUTH OMBUDSPERSON; BOARD.",
	"text": "The Office of the Foster Youth Ombudsperson is hereby created. The ombudsperson serves in the unclassified service, must be selected without regard to political affiliation, and must be a person highly competent and qualified to work to improve the lives of youth in the foster care system, while understanding the administration and public policy related to youth in the foster care system. The ombudsperson may be removed only for just cause. No person may serve as the foster youth ombudsperson while holding any other public office. The foster youth ombudsperson is accountable to the governor and may investigate decisions, acts, and other matters related to the health, safety, and welfare of youth in foster care to promote the highest attainable standards of competence, efficiency, and justice for youth who are in the care of the state.\nThe Board of the Foster Youth Ombudsperson is established to make recommendations to the foster youth ombudsperson and staff while continuously overseeing the foster youth ombudsperson's work. The board shall evaluate the foster youth ombudsperson's effectiveness through regular meetings with current and former youth in the foster care system and community advocates working closely with the foster care system. The board consists of:\n(1) five youth who are currently in the foster care system or who were recently in the foster care system;\n(2) four adults who were in the foster care system as youths;\n(3) one attorney who works in the juvenile court system or family court;\n(4) one guardian ad litem who is currently appointed to protect the interests of minors in cases in the juvenile court system;\n(5) one social worker who works in the juvenile justice system or family court; and\n(6) three nonprofit professionals who work at nonprofits serving foster youth.\nThe membership terms, compensation, removal of members, and filling of vacancies on the Board of the Foster Youth Ombudsperson are governed by section 15.0575. A member of the Board of the Foster Youth Ombudsperson must not have a conflict of interest with the board due to the member's employment with a county or the agency.",
	"repealed": false
}