{
	"id": "401.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.065",
	"title": "401.065 PRETRIAL DIVERSION PROGRAMS.",
	"text": "As used in this section:\n(1) a person is an \"offender\" if:\n(i) the person is charged with, or probable cause exists to arrest or charge the person with, a felony, gross misdemeanor, or misdemeanor crime, other than a crime against the person, but the person has not yet entered a plea in the proceedings;\n(ii) the person has not previously been convicted as an adult in Minnesota or any other state of any crime against the person; and\n(iii) the person has not previously participated as an adult in Minnesota in a pretrial diversion program, including a program that existed before July 1, 1994, and had charges dismissed or not filed as part of that program; and\n(2) \"pretrial diversion\" means the decision of a prosecutor to refer an offender to a diversion program on condition that the criminal charges against the offender will be dismissed after a specified period of time, or the case will not be charged, if the offender successfully completes the program.\nBy July 1, 1994, every county attorney of a county participating in the Community Corrections Act shall establish a pretrial diversion program for adult offenders. If the county attorney's county participates in the Community Corrections Act as part of a group of counties under section 401.02, the county attorney may establish a pretrial diversion program in conjunction with other county attorneys in that group of counties. The program must be designed and operated to further the following goals:\n(1) to provide eligible offenders with an alternative to confinement and a criminal conviction;\n(2) to reduce the costs and caseload burdens on district courts and the criminal justice system;\n(3) to minimize recidivism among diverted offenders;\n(4) to promote the collection of restitution to the victim of the offender's crime; and\n(5) to develop responsible alternatives to the criminal justice system for eligible offenders.\nA diversion program established under this section may:\n(1) provide screening services to the court and the prosecuting authorities to help identify likely candidates for pretrial diversion;\n(2) establish goals for diverted offenders and monitor performance of these goals;\n(3) perform chemical dependency assessments of diverted offenders where indicated, make appropriate referrals for treatment, and monitor treatment and aftercare;\n(4) provide individual, group, and family counseling services;\n(5) oversee the payment of victim restitution by diverted offenders;\n(6) assist diverted offenders in identifying and contacting appropriate community resources;\n(7) provide educational services to diverted offenders to enable them to earn a high school diploma or commissioner of education-selected high school equivalency certification; and\n(8) provide accurate information on how diverted offenders perform in the program to the court, prosecutors, defense attorneys, and probation officers.\n(a) Every county attorney who establishes a diversion program under this section shall report the following information to the Bureau of Criminal Apprehension:\n(1) the name and date of birth of each diversion program participant and any other identifying information the superintendent considers necessary;\n(2) the date on which the individual began to participate in the diversion program;\n(3) the date on which the individual is expected to complete the diversion program;\n(4) the date on which the individual successfully completed the diversion program, where applicable; and\n(5) the date on which the individual was removed from the diversion program for failure to successfully complete the individual's goals, where applicable.\nThe superintendent shall cause the information described in this subdivision to be entered into and maintained in the criminal history file as defined in section 13.87.\n(b) Effective August 1, 1997, the reporting requirements of this subdivision shall apply to misdemeanor offenses.\nBy January 1, 1995, and biennially thereafter, each county attorney shall report to the state court administrator and the legislature on the operation of a pretrial diversion program required by this section. The report shall include a description of the program, the number of offenders participating in the program, the number and characteristics of the offenders who successfully complete the program, the number and characteristics of the offenders who fail to complete the program, and an evaluation of the program's effect on the operation of the criminal justice system in the county.",
	"repealed": false
}