{
	"id": "80A.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.82",
	"title": "80A.82 SECTION 605; RULES, FORMS, ORDERS, INTERPRETATIVE OPINIONS, AND HEARINGS.",
	"text": "(a) Issuance and adoption of forms, orders, and rules. The administrator may:\n(1) issue forms and orders and, in accordance with chapter 14, may adopt and amend rules necessary or appropriate to carry out this chapter and may repeal rules, including rules and forms governing registration statements, applications, notice filings, reports, and other records;\n(2) by rule, define terms, whether or not used in this chapter, but those definitions may not be inconsistent with this chapter; and\n(3) by rule, classify securities, persons, and transactions and adopt different requirements for different classes.\n(b) Findings and cooperation. Under this chapter, a rule or form may not be adopted or amended, or an order issued or amended, unless the administrator finds that the rule, form, order, or amendment is necessary or appropriate in the public interest or for the protection of investors and is consistent with the purposes intended by this chapter. In adopting, amending, and repealing rules and forms, section 80A.85 applies in order to achieve uniformity among the states and coordination with federal laws in the form and content of registration statements, applications, reports, and other records, including the adoption of uniform rules, forms, and procedures.\n(c) Financial statements. Subject to Section 15(h) of the Securities Exchange Act and Section 222 of the Investment Advisers Act of 1940, the administrator may require that a financial statement filed under this chapter be prepared in accordance with generally accepted accounting principles in the United States and comply with other requirements specified by rule adopted or order issued under this chapter. A rule adopted or order issued under this chapter may establish:\n(1) subject to Section 15(h) of the Securities Exchange Act and Section 222 of the Investment Advisors Act of 1940, the form and content of financial statements required under this chapter;\n(2) whether unconsolidated financial statements must be filed; and\n(3) whether required financial statements must be audited by an independent certified public accountant.\n(d) Interpretative opinions. The administrator may provide interpretative opinions or issue determinations that the administrator will not institute a proceeding or an action under this chapter against a specified person for engaging in a specified act, practice, or course of business if the determination is consistent with this chapter. A rule adopted or order issued under this chapter may establish a reasonable charge for interpretative opinions or determinations that the administrator will not institute an action or a proceeding under this chapter.\n(e) Effect of compliance. A penalty under this chapter may not be imposed for, and liability does not arise from conduct that is engaged in or omitted in good faith believing it conforms to a rule, form, or order of the administrator under this chapter.\n(f) Presumption for public hearings. A hearing in an administrative proceeding under this chapter must be conducted in public unless the administrator for good cause consistent with this chapter determines that the hearing will not be so conducted.",
	"repealed": false
}