{
	"id": "299M.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/299M.01",
	"title": "299M.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the following terms have the meanings given them in this section.\n\"Apprentice sprinkler fitter\" means a person, other than a fire protection contractor or journeyman sprinkler fitter, who is regularly engaged in learning the trade under the direct supervision of a licensed fire protection contractor or journeyman sprinkler fitter and is registered with a state or federal approval agency.\n\"Commissioner\" means the commissioner of public safety.\n\"Council\" means the Minnesota Advisory Council on Fire Protection Systems.\n\"Department\" means the Department of Public Safety.\n\"Fire protection contractor\" means a person who contracts to sell, design, install, modify, alter, or inspect a fire protection system or its parts or related equipment.\n\"Fire protection system\" means a sprinkler, standpipe, hose system, or other special hazard system for fire protection purposes only, that is composed of an integrated system of underground and overhead piping connected to a water source. \"Fire protection system\" does not include the water service piping to a city water main, or piping used for potable water purposes, or piping used for heating or cooling purposes. Openings from potable water piping for fire protection systems must be made by persons properly licensed under section 326B.46. Persons properly licensed under section 326B.46 may also sell, design, install, modify or inspect a standpipe, hose system only.\n\"Journeyman sprinkler fitter\" means a person who is certified as competent to engage in installing, connecting, altering, repairing, or adding to a fire protection system for and under the supervision of a fire protection contractor.\n\"Multipurpose potable water piping system contractor\" means a person who contracts to sell, design, install, modify, or inspect a multipurpose potable water piping system, its parts, or related equipment.\n\"Multipurpose potable water piping system\" means a potable water piping system that is intended to serve both domestic and fire protection needs throughout a one- or two-family dwelling unit. No person may install a multipurpose potable water piping system unless that person is licensed pursuant to section 326B.46 and is certified pursuant to section 299M.03.\n\"Multipurpose potable water piping system installer\" means a person who is certified as competent to engage in installing, connecting, altering, repairing, or adding to a residential multipurpose potable water piping system in a one- or two-family dwelling unit.\n\"Municipality\" means a town or statutory or home rule charter city.",
	"repealed": false
}