{
	"id": "10A.322",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.322",
	"title": "10A.322 SPENDING LIMIT AGREEMENTS.",
	"text": "(a) As a condition of receiving a public subsidy, a candidate must sign and file with the board a written agreement in which the candidate agrees that the candidate will comply with sections 10A.25; 10A.27, subdivision 10; 10A.324; and 10A.38.\n(b) Before the first day of filing for office, the board must forward agreement forms to all filing officers. The board must also provide agreement forms to candidates on request at any time. The candidate must file the agreement with the board at least three weeks before the candidate's state primary. An agreement may not be filed after that date. An agreement once filed may not be rescinded.\n(c) The board must notify the commissioner of revenue of any agreement signed under this subdivision.\n(d) Notwithstanding paragraph (b), if a vacancy occurs that will be filled by means of a special election and the filing period does not coincide with the filing period for the general election, a candidate may sign and submit a spending limit agreement not later than the day after the close of the filing period for the special election for which the candidate filed.\n(e) Notwithstanding paragraphs (b) and (d), if a vacancy occurs that will be filled by means of a special election called under section 204B.13, subdivision 2, paragraph (c), a candidate may sign and submit a spending limit agreement not later than eight calendar days after the general election.\nThe agreement, insofar as it relates to the expenditure limits in section 10A.25, as adjusted by section 10A.255, and the contribution limit in section 10A.27, subdivision 10, remains effective for candidates until the dissolution of the principal campaign committee of the candidate or the end of the first election cycle completed after the agreement was filed, whichever occurs first.\n[Repealed by amendment, 1999 c 220 s 42]\n(a) The board must make available to a political party on request and to any candidate for whom an agreement under this section is effective, a supply of official refund receipt forms that state in boldface type that:\n(1) a contributor who is given a receipt form is eligible to claim a refund as provided in section 290.06, subdivision 23; and\n(2) if the contribution is to a candidate, that the candidate has signed an agreement to limit campaign expenditures as provided in this section.\nThe forms must provide duplicate copies of the receipt to be attached to the contributor's claim.\n(b) The willful issuance of an official refund receipt form or a facsimile of one to any of the candidate's contributors by a candidate or treasurer of a candidate who did not sign an agreement under this section is subject to a civil penalty of up to $3,000 imposed by the board.\n(c) The willful issuance of an official refund receipt form or a facsimile to an individual not eligible to claim a refund under section 290.06, subdivision 23, is subject to a civil penalty of up to $3,000 imposed by the board.\n(d) A violation of paragraph (b) or (c) is a misdemeanor.",
	"repealed": false
}