{
	"id": "136A.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.101",
	"title": "136A.101 DEFINITIONS.",
	"text": "For purposes of sections 136A.095 to 136A.1311, the terms defined in this section have the meanings ascribed to them.\n[Repealed, 2014 c 149 s 75]\n[Repealed, 2014 c 149 s 75]\n\"Eligible institution\" means an institution that meets the eligibility requirements under section 136A.103.\n\"Financial need\" means the demonstrated need of the applicant for financial assistance to meet the recognized costs of attending the eligible institution of choice as determined from financial information on the applicant and, if required, on the applicant's parents, by the federal need analysis.\n\"Assigned family responsibility\" means the amount of a family's contribution to a student's cost of attendance, as determined by a federal need analysis. For dependent students, the assigned family responsibility is 79 percent of the parental contribution. If the parental contribution is less than $0, the assigned family responsibility is 100 percent of the parental contribution. For independent students with dependents other than a spouse, the assigned family responsibility is 71 percent of the student contribution. For independent students without dependents other than a spouse, the assigned family responsibility is 35 percent of the student contribution. If the student contribution is less than $0, the assigned family responsibility is 100 percent of the student contribution. For a student registering for less than full time, the office shall prorate the assigned family responsibility using the ratio of the number of credits the student is enrolled in to the number of credits for full-time enrollment.\n[Repealed, 1989 c 293 s 85]\n\"Student\" means a person who is enrolled for at least one credit per term, in a program or course of study that applies to a degree, diploma, or certificate. Credit equivalencies assigned by an institution that are applicable to federal Pell grant calculations shall be counted as part of a student's credit load.\n\"Full time\" means enrollment in a minimum of 15 credits per term.\n\"Half time\" means enrollment in a minimum of six credits per term.\n\"Resident student\" means a student who meets one of the following conditions:\n(1) a student who has resided in Minnesota for purposes other than postsecondary education for at least 12 months without being enrolled at a postsecondary educational institution for more than five credits in any term;\n(2) a dependent student whose parent or legal guardian resides in Minnesota at the time the student applies;\n(3) a student who graduated from a Minnesota high school, if the student was a resident of Minnesota during the student's period of attendance at the Minnesota high school and the student is physically attending a Minnesota postsecondary educational institution;\n(4) a student who, after residing in the state for a minimum of one year, earned a high school equivalency certificate in Minnesota;\n(5) a member, spouse, or dependent of a member of the armed forces of the United States stationed in Minnesota on active federal military service as defined in section 190.05, subdivision 5c;\n(6) a spouse or dependent of a veteran, as defined in section 197.447, if the veteran is a Minnesota resident;\n(7) a person or spouse of a person who relocated to Minnesota from an area that is declared a presidential disaster area within the preceding 12 months if the disaster interrupted the person's postsecondary education;\n(8) a person defined as a refugee under United States Code, title 8, section 1101(a)(42), who, upon arrival in the United States, moved to Minnesota and has continued to reside in Minnesota;\n(9) a student eligible for resident tuition under section 135A.043; or\n(10) an active member, or a spouse or dependent of that member, of the state's National Guard who resides in Minnesota or an active member, or a spouse or dependent of that member, of the reserve component of the United States armed forces whose duty station is located in Minnesota and who resides in Minnesota.\n\"Independent student\" has the meaning given under title IV of the Higher Education Act of 1965, as amended, and applicable regulations.\n\"Satisfactory academic progress\" means satisfactory academic progress as defined under Code of Federal Regulations, title 34, sections 668.16(e), 668.32(f), and 668.34, except that a student with an intellectual disability as defined in Code of Federal Regulations, title 34, section 668.231, enrolled in an approved comprehensive transition and postsecondary program under that section is subject to the institution's published satisfactory academic process standards for that program as approved by the Office of Higher Education.\n\"Award year\" has the meaning given in the Higher Education Act of 1965, title 4, section 481.20, as amended.",
	"repealed": false
}