{
	"id": "125A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.29",
	"title": "125A.29 RESPONSIBILITIES OF COUNTY BOARDS AND SCHOOL BOARDS.",
	"text": "(a) It is the joint responsibility of county boards and school boards to coordinate, provide, and pay for appropriate services, and to facilitate payment for services from public and private sources. Appropriate services for children eligible under section 125A.02 must be determined in consultation with parents, physicians, and other educational, medical, health, and human services providers. The services provided must be in conformity with:\n(1) an IFSP for each eligible infant and toddler from birth through age two and the infant's or toddler's family including:\n(i) American Indian infants and toddlers with disabilities and their families residing on a reservation geographically located in the state;\n(ii) infants and toddlers with disabilities who are homeless children and their families; and\n(iii) infants and toddlers with disabilities who are wards of the state; or\n(2) an individualized education program (IEP) or individual service plan (ISP) for each eligible child ages three through four.\n(b) Appropriate early intervention services include services provided in conformity with an IFSP that are designed to meet the special developmental needs of an eligible child and the needs of the child's family related to enhancing the child's development and that are selected in collaboration with the parent. These services include core early intervention services and additional early intervention services listed in this section and infant and toddler intervention services defined under United States Code, title 20, sections 1431 to 1444, and Code of Federal Regulations, title 34, section 303, including service coordination under section 125A.33.\n(c) School and county boards shall coordinate early intervention services. In the absence of agreements established according to section 125A.39, service responsibilities for children birth through age two are as follows:\n(1) school boards must provide, pay for, and facilitate payment for special education and related services required under sections 125A.03 and 125A.06;\n(2) county boards must provide, pay for, and facilitate payment for noneducational services of social work, psychology, transportation and related costs, nursing, respite, and nutrition services not required under clause (1).\n(d) School and county boards may develop an interagency agreement according to section 125A.39 to establish agency responsibility that assures early intervention services are coordinated, provided, paid for, and that payment is facilitated from public and private sources.\n(e) County and school boards must jointly determine the primary agency in this cooperative effort and must notify the commissioner of the state lead agency of their decision.",
	"repealed": false
}