{
	"id": "3C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/3C.12",
	"title": "3C.12 SALE AND DISTRIBUTION OF STATUTES AND LAWS.",
	"text": "The revisor shall determine how many copies of Minnesota Statutes, supplements to Minnesota Statutes, and Laws of Minnesota are to be printed. Subject to the requirements of subdivision 2, the revisor shall determine how the copies are to be distributed and disposed of.\nThe revisor shall distribute without charge copies of each edition of Minnesota Statutes, supplements to Minnesota Statutes, and Laws of Minnesota to the persons or bodies listed in this subdivision. Before distributing the copies, the revisor shall inform these persons or bodies of the cost of the publication and the availability of statutes and session laws on the Internet, and shall ask whether their work requires the full number of copies authorized by this subdivision. Unless a smaller number is needed, the revisor shall distribute:\n(a) 30 copies to the supreme court;\n(b) 30 copies to the court of appeals;\n(c) one copy to each judge of a district court;\n(d) one copy to the court administrator of each district court for use in each courtroom of the district court;\n(e) one copy to each judge, district attorney, clerk of court of the United States, and deputy clerk of each division of the United States district court in Minnesota;\n(f) 100 copies to the Office of the Attorney General;\n(g) ten copies each to the governor's office, the Departments of Agriculture, Corrections, Education, Management and Budget, Health, Transportation, Labor and Industry, Employment and Economic Development, Natural Resources, Public Safety, Human Services, Revenue, and the Pollution Control Agency;\n(h) two copies to the lieutenant governor;\n(i) 20 copies each to the Departments of Administration and Commerce, state auditor, and legislative auditor;\n(j) one copy each to other state departments, agencies, boards, and commissions not specifically named in this subdivision;\n(k) one copy to each member of the legislature;\n(l) 150 copies for the use of the senate and 200 copies for the use of the house of representatives;\n(m) 50 copies to the revisor of statutes from which the revisor shall send the appropriate number to the Library of Congress for copyright and depository purposes;\n(n) four copies to the secretary of the senate;\n(o) four copies to the chief clerk of the house of representatives;\n(p) 100 copies to the State Law Library;\n(q) 100 copies to the Law School of the University of Minnesota;\n(r) five copies each to the Minnesota Historical Society and the secretary of state;\n(s) one copy each to the public library of the largest municipality of each county if the library is not otherwise eligible to receive a free copy under this section or section 15.18; and\n(t) one copy to each county library maintained pursuant to chapter 134, except in counties containing cities of the first class. If a county has not established a county library pursuant to chapter 134, the copy shall be provided to any public library in the county.\nCopies of Minnesota Statutes distributed to public officers, except members and officers of the legislature and officers of the United States, must be marked with the words \"State Copy\" and kept for the use of the office.\nEach county shall purchase from the revisor one copy each for the use of the county attorney, sheriff, auditor, treasurer, county recorder, and superintendent of schools.\nEach city and town shall purchase from the revisor the number of copies the city or town determines is needed for the use of each clerk of the city or town.\nA department, agency, board, commission, or other instrumentality of the state listed in this section may purchase from the revisor of statutes any additional copies which may be required.\nThe revisor shall fix a reasonable sale price of an edition of Minnesota Statutes, supplement to Minnesota Statutes, or edition of Laws of Minnesota. Revenue from the sale of the Minnesota Statutes, supplements to Minnesota Statutes, and Laws of Minnesota must be deposited in the general fund.",
	"repealed": false
}