{
	"id": "18H.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/18H.07",
	"title": "18H.07 FEE SCHEDULE.",
	"text": "The commissioner shall establish fees sufficient to allow for the administration and enforcement of this chapter and rules adopted under this chapter, including the portion of general support costs and statewide indirect costs of the agency attributable to that function, with a reserve sufficient for up to six months. The commissioner shall review the fee schedule annually in consultation with the Minnesota Nursery and Landscape Advisory Committee. For the certificate year beginning January 1, 2006, the fees are as described in this section.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n(a) A nonprofit organization or an individual may offer for sale certified nursery stock and be exempt from the requirement to pay certificate fees if the nonprofit organization or individual:\n(1) sells or distributes certified nursery stock on ten or fewer days in a calendar year;\n(2) uses the proceeds from certified nursery stock sales or distributions for nonprofit purposes; and\n(3) obtains a nursery stock certificate.\n(b) A municipality may offer for sale certified nursery stock and be exempt from the requirement to pay certificate fees if:\n(1) all nursery stock offered for sale or distributed is intended for planting by residents of the municipality on public property or public easements in the municipality;\n(2) all nursery stock purchased or procured for resale or distribution is grown in Minnesota and has been certified by the commissioner; and\n(3) the municipality obtains a live plant dealer certificate.\n(c) The commissioner may prescribe the conditions of nursery fee waivers and may conduct routine inspections of nursery stock offered for sale.\nAn entity that was not distributing certified nursery stock for the past two full calendar years is considered a new applicant for the basis of fee determination. A new live plant dealer must pay the following fees:\n(1) $50 fee for a live plant dealer certificate that allows for one retail sales location. A $50 certificate is required for each additional retail sales location; and\n(2) a live plant dealer growing nursery stock requires an inspection for certification of that nursery stock prior to sale of the nursery stock and must be assessed an additional charge of $100 plus $10 per acre up to 200 acres. Acreage to be certified should be rounded to the nearest one acre. For the basis of fee determination, \"growing nursery stock\" means the purchase of seeds, seedlings, or small plants and the cultivation of the plants in fields or containers in Minnesota for eventual sale, including cutting, splitting, and propagating plants.\n(a) A renewal certificate is for a live plant dealer that has had a certificate in at least one of the past two full calendar years. A live plant dealer must pay an annual fee based on the following criteria:\n(1) a $50 fee for a live plant dealer certificate that allows for one retail sales location. A $50 certificate is required for each additional retail sales location;\n(2) a fee of gross annual purchases of certified nursery stock as noted in the table below with the intent to resell in the same year. These are plants that are watered and maintained only for the purposes of keeping the plants alive. Gross annual purchases are calculated for nursery stock purchases from January 1 through December 31 of the most recent certificate year according to the following table:\n(3) a live plant dealer growing nursery stock requires an inspection for certification of that nursery stock prior to sale and must be assessed an additional charge of $100 plus $10 per acre up to 200 acres. Acreage to be certified should be rounded to the nearest one acre. For the basis of fee determination, \"growing nursery stock\" is the purchase of seeds, seedlings, or small plants and the cultivation of plants in fields or containers in Minnesota for eventual sale, including cutting, splitting, and propagating plants.\n(b) In addition to the fees in paragraph (a), a penalty of 25 percent of the fee due may be charged or a portion thereof, if the fee is delinquent or any application for renewal is not postmarked or electronically date stamped by December 31 of the current year.\n(c) A live plant dealer operating without a valid certificate must not offer nursery stock for sale or sell nursery stock until a certificate is issued to the live plant dealer by the commissioner and the live plant dealer has paid any applicable fees and penalties in full.\nIf an irregular inspection is required or an additional inspection is needed or requested, a fee may be assessed based on mileage and inspection time as follows:\n(1) mileage must be charged at the current United States Internal Revenue Service reimbursement rate; and\n(2) inspection time must be charged at a rate sufficient to recover all inspection costs, including the driving time to and from the location in addition to the time spent conducting the inspection.",
	"repealed": false
}