{
	"id": "103G.291",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.291",
	"title": "103G.291 PUBLIC WATER SUPPLY PLANS; APPROPRIATION DURING DEFICIENCY.",
	"text": "(a) If the governor determines and declares by executive order that there is a critical water deficiency, public water supply authorities appropriating water must adopt and enforce water conservation restrictions within their jurisdiction that are consistent with rules adopted by the commissioner.\n(b) The restrictions must limit lawn sprinkling, vehicle washing, golf course and park irrigation, and other nonessential uses, and have appropriate penalties for failure to comply with the restrictions.\nDisregard of critical water deficiency orders, even though total appropriation remains less than that permitted, is adequate grounds for immediate modification of a public water supply authority's water-use permit.\n(a) Every public water supplier serving more than 1,000 people must submit a water supply plan to the commissioner for approval by January 1, 1996. In accordance with guidelines developed by the commissioner, the plan must address projected demands, adequacy of the water supply system and planned improvements, existing and future water sources, natural resource impacts or limitations, emergency preparedness, water conservation, supply and demand reduction measures, and allocation priorities that are consistent with section 103G.261. Public water suppliers must update their plan and, upon notification, submit it to the commissioner for approval every ten years.\n(b) The water supply plan in paragraph (a) is required for all communities in the metropolitan area, as defined in section 473.121, with a municipal water supply system and is a required element of the local comprehensive plan required under section 473.859.\n(c) Public water suppliers serving more than 1,000 people must encourage water conservation by employing water use demand reduction measures, as defined in subdivision 4, paragraph (a), before requesting approval from the commissioner of health under section 144.383, paragraph (a), to construct a public water supply well or requesting an increase in the authorized volume of appropriation. The commissioner of natural resources and the water supplier shall use a collaborative process to achieve demand reduction measures as a part of a water supply plan review process.\n(d) Public water suppliers serving more than 1,000 people must submit records that indicate the number of connections and amount of use by customer category and volume of water unaccounted for with the annual report of water use required under section 103G.281, subdivision 3.\n(e) For the purposes of this section, \"public water supplier\" means an entity that owns, manages, or operates a public water supply, as defined in section 144.382, subdivision 4.\n(a) For the purposes of this section, \"demand reduction measures\" means measures that reduce water demand, water losses, peak water demands, and nonessential water uses. Demand reduction measures must include a conservation rate structure, or a uniform rate structure with a conservation program that achieves demand reduction. A \"conservation rate structure\" means a rate structure that encourages conservation and may include increasing block rates, seasonal rates, time of use rates, individualized goal rates, or excess use rates. If a conservation rate is applied to multifamily dwellings or a manufactured home park, as defined in section 327C.015, subdivision 8, the rate structure must consider each residential unit as an individual user.\n(b) To encourage conservation, a public water supplier serving more than 1,000 people must implement demand reduction measures by January 1, 2015.",
	"repealed": false
}