{
	"id": "216B.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.045",
	"title": "216B.045 REGULATION OF INTRASTATE NATURAL GAS PIPELINE.",
	"text": "For the purposes of this section \"intrastate pipeline\" means a pipeline wholly within the state of Minnesota which transports or delivers natural gas received from another person at a point inside or at the border of the state, which is delivered at a point within the state to another, provided that all the natural gas is consumed within the state. An intrastate pipeline does not include a pipeline owned or operated by a public utility, unless a public utility files a petition requesting that a pipeline or a portion of a pipeline be classified as an intrastate pipeline and the commission approves the petition.\nEvery rate and contract relating to the sale or transportation of natural gas through an intrastate pipeline shall be just and reasonable. No owner or operator of an intrastate pipeline shall provide intrastate pipeline services in a manner which unreasonably discriminates among customers receiving like or contemporaneous services.\nEvery owner or operator of an intrastate pipeline shall offer intrastate pipeline transportation services by contract on an open access, nondiscriminatory basis. To the extent the intrastate pipeline has available capacity, the owner or operator of the intrastate pipeline must provide firm and interruptible transportation on behalf of any customer. If physical facilities are needed to establish service to a customer, the customer may provide those facilities or the owner or operator of the intrastate pipeline may provide the facilities for a reasonable and compensatory charge.\nNo contract establishing the rates, terms, and conditions of service and facilities to be provided by intrastate pipelines is effective until it is filed with and approved by the commission. The commission has the authority to approve the contracts and to regulate the types and quality of services to be provided through intrastate pipelines. The approval of a contract for an intrastate pipeline to provide service to a public utility does not constitute a determination by the commission that the prices actually paid by the public utility under that contract are reasonable or prudent nor does approval constitute a determination that purchases of gas made or deliveries of gas taken by the public utility under that contract are reasonable or prudent.\nAny customer of an intrastate pipeline, any person seeking to become a customer of an intrastate pipeline, the department, or the commission on its own motion, may bring a complaint regarding the rates, contracts, terms, conditions, and types of service provided or proposed to be provided through an intrastate pipeline, including a complaint that a service which can reasonably be demanded is not offered by the owner or operator of the intrastate pipeline. If a complaint involves the question of whether or not an intrastate pipeline has capacity available, the commission shall after hearing make a determination of the available capacity but shall not impair the owner or operator of the intrastate pipeline contractual obligation to provide firm transportation service. If a complaint concerns the use of available capacity by one or more customers of an intrastate pipeline, the commission shall after hearing determine the reasonable use of the available capacity by the customers. The commission shall not require an owner or operator of an intrastate pipeline to expand its available capacity but may require the owner or operator to maintain a reasonable quality of service. The commission may dismiss any complaint without a hearing if in its opinion a hearing is not in the public interest. Complaints brought under this subdivision shall be governed by section 216B.17.\nSections 216B.10, subdivisions 1 and 4, 216B.12, 216B.13, and 216B.62, subdivisions 2, 4, and 6, shall apply to owners and operators of intrastate pipelines.\nThe commission may declare a natural gas supply emergency if it finds that a severe natural gas shortage endangering the health or safety of the citizens of the state exists or is imminent in the state. If the commission declares that a natural gas supply emergency exists, it may for the duration of the emergency order the suspension of any contract providing for the sale and transportation of natural gas through an intrastate pipeline, and may for the duration of the emergency order an owner or operator of the intrastate pipeline to furnish such transportation services as are required by the public interest. The owner or operator of the intrastate pipeline shall be compensated for its services furnished under an emergency order issued under this section, and the commission shall determine the just and reasonable compensation for the services required to be provided during the emergency.",
	"repealed": false
}