{
	"id": "256B.765",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.765",
	"title": "256B.765 PROVIDER RATE INCREASES.",
	"text": "(a) Effective July 1, 2001, within the limits of appropriations specifically for this purpose, the commissioner shall provide an annual inflation adjustment for the providers listed in paragraph (c). The index for the inflation adjustment must be based on the change in the Employment Cost Index for Private Industry Workers - Total Compensation forecasted by Data Resources, Inc., as forecasted in the fourth quarter of the calendar year preceding the fiscal year. The commissioner shall increase reimbursement or allocation rates by the percentage of this adjustment, and county boards shall adjust provider contracts as needed.\n(b) The commissioner of management and budget shall include an annual inflationary adjustment in reimbursement rates for the providers listed in paragraph (c) using the inflation factor specified in paragraph (a) as a budget change request in each biennial detailed expenditure budget submitted to the legislature under section 16A.11.\n(c) The annual adjustment under paragraph (a) shall be provided for home and community-based waiver services for persons with developmental disabilities under section 256B.501; home and community-based waiver services for the elderly under chapter 256S; waivered services under community access for disability inclusion under section 256B.49; community alternative care waivered services under section 256B.49; brain injury waivered services under section 256B.49; nursing services and home health services under section 256B.0625, subdivision 6a; personal care services and nursing supervision of personal care services under section 256B.0625, subdivision 19a; home care nursing services under section 256B.0625, subdivision 7; day training and habilitation services for adults with developmental disabilities under sections 252.41 to 252.46; physical therapy services under section 256B.0625, subdivision 8; occupational therapy services under section 256B.0625, subdivision 8a; speech-language therapy services under Minnesota Rules, part 9505.0390; respiratory therapy services under Minnesota Rules, part 9505.0295; alternative care services under section 256B.0913; adult residential program grants under section 245.73; adult and family community support grants under Minnesota Rules, parts 9535.1700 to 9535.1760; semi-independent living services under section 252.275 including SILS funding under county social services grants formerly funded under chapter 256I; and community support services for deaf and hard-of-hearing adults with mental illness who use or wish to use sign language as their primary means of communication.",
	"repealed": false
}