{
	"id": "65B.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.47",
	"title": "65B.47 PRIORITY OF APPLICABILITY OF SECURITY FOR PAYMENT OF BASIC ECONOMIC LOSS BENEFITS.",
	"text": "In case of injury to the driver or other occupant of a motor vehicle, if the accident causing the injury occurs while the vehicle is being used in the business of transporting persons or property, the security for payment of basic economic loss benefits is the security covering the vehicle or, if none, the security under which the injured person is an insured.\nSubdivision 1 does not apply to:\n(1) a commuter van;\n(2) a vehicle being used to transport children as part of a family or group family day care program;\n(3) a vehicle being used to transport children to school or to a school-sponsored activity;\n(4) a bus while it is in operation within the state of Minnesota as to any Minnesota resident who is an insured as defined in section 65B.43, subdivision 5;\n(5) a passenger in a taxi; or\n(6) a taxi driver, provided that this clause applies only to policies issued or renewed on or after September 1, 1996, and prior to September 1, 1997.\nIn case of injury to an employee, or to the employee's spouse or other relative residing in the same household, if the accident causing the injury occurs while the injured person is driving or occupying a motor vehicle other than a commuter van furnished by the employer, the security for payment of basic economic loss benefits is the security covering the vehicle or, if none, the security under which the injured person is an insured.\nIn the case of any other person whose injury arises from the maintenance or use of a motor vehicle described in subdivision 1 or 2 who is not a driver or occupant of another involved motor vehicle, the security for the payment of basic economic loss benefits is the security covering the vehicle, or if none, the security under which the injured person is an insured.\nIn all other cases, the following priorities apply:\n(a) The security for payment of basic economic loss benefits applicable to injury to an insured is the security under which the injured person is an insured.\n(b) The security for payment of basic economic loss benefits applicable to injury to the driver or other occupant of an involved motor vehicle who is not an insured is the security covering that vehicle.\n(c) The security for payment of basic economic loss benefits applicable to injury to a person not otherwise covered who is not the driver or other occupant of an involved motor vehicle is the security covering any involved motor vehicle. An unoccupied parked vehicle is not an involved motor vehicle unless it was parked so as to cause unreasonable risk of injury.\nIf two or more obligations to pay basic economic loss benefits are applicable to an injury under the priorities set out in this section, benefits are payable only once and the reparation obligor against whom a claim is asserted shall process and pay the claim as if wholly responsible, but the reparation obligor is thereafter entitled to recover contribution pro rata for the basic economic loss benefits paid and the costs of processing the claim. Where contribution is sought among reparation obligors responsible under subdivision 4, clause (c), proration shall be based on the number of involved motor vehicles.\nWhere a reparation obligor pays basic economic loss benefits which another reparation obligor is obligated to pay under the priority provided in this section, the reparation obligor that pays is subrogated to all rights of the person to whom benefits are paid.\nUnless a policyholder makes a specific election to have two or more policies added together the limit of liability for basic economic loss benefits for two or more motor vehicles may not be added together to determine the limit of insurance coverage available to an injured person for any one accident. An insurer shall notify policyholders that they may elect to have two or more policies added together.",
	"repealed": false
}