{
	"id": "253D.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.30",
	"title": "253D.30 PROVISIONAL DISCHARGE.",
	"text": "(a) A person who is committed as a sexually dangerous person or a person with a sexual psychopathic personality shall not be provisionally discharged unless the committed person is capable of making an acceptable adjustment to open society.\n(b) The following factors are to be considered in determining whether a provisional discharge shall be granted:\n(1) whether the committed person's course of treatment and present mental status indicate there is no longer a need for treatment and supervision in the committed person's current treatment setting; and\n(2) whether the conditions of the provisional discharge plan will provide a reasonable degree of protection to the public and will enable the committed person to adjust successfully to the community.\nA provisional discharge plan shall be developed, implemented, and monitored by the executive director in conjunction with the committed person and other appropriate persons. The executive director shall, at least quarterly, review the plan with the committed person and submit a written report to the county attorneys of the county of commitment and the county of financial responsibility concerning the committed person's status and compliance with each term of the plan.\nA provisional discharge pursuant to this chapter shall not automatically terminate. A full discharge shall occur only as provided in section 253D.31. The terms of a provisional discharge continue unless the committed person requests and is granted a change in the conditions of provisional discharge or unless the committed person petitions the special review board for a full discharge and the discharge is granted by the judicial appeal panel.\n(a) With the consent of the executive director, a committed person may voluntarily return to the Minnesota Sex Offender Program from provisional discharge for a period of up to 60 days.\n(b) If the committed person is not returned to provisional discharge status within 60 days of being readmitted to the Minnesota Sex Offender Program, the provisional discharge is revoked. The committed person shall immediately be notified of the revocation in writing. Within 15 days of receiving notice of the revocation, the committed person may request a review of the matter before the special review board. The special review board shall review the circumstances of the revocation and, after applying the standards in subdivision 5, paragraph (a), shall recommend to the judicial appeal panel whether or not the revocation shall be upheld. The board may recommend a return to provisional discharge status.\n(c) If the provisional discharge has not been revoked and the committed person is to be returned to provisional discharge, the Minnesota Sex Offender Program is not required to petition for a further review by the special review board unless the committed person's return to the community results in substantive change to the existing provisional discharge plan.\n(a) The executive director may revoke a provisional discharge if either of the following grounds exist:\n(1) the committed person has departed from the conditions of the provisional discharge plan; or\n(2) the committed person is exhibiting behavior which may be dangerous to self or others.\n(b) The executive director may revoke the provisional discharge and, either orally or in writing, order that the committed person be immediately returned to a secure treatment facility or other treatment program. A report documenting reasons for revocation shall be issued by the executive director within seven days after the committed person is returned to the secure treatment facility or other treatment program. Advance notice to the committed person of the revocation is not required.\n(c) The committed person must be provided a copy of the revocation report and informed, orally and in writing, of the rights of a committed person under this section. The revocation report shall be served upon the committed person, the committed person's counsel, and the county attorneys of the county of commitment and the county of financial responsibility. The report shall outline the specific reasons for the revocation, including but not limited to the specific facts upon which the revocation is based.\n(d) An individual who is revoked from provisional discharge must successfully re-petition the special review board and judicial appeal panel prior to being placed back on provisional discharge.\nAny committed person aggrieved by a revocation decision or any interested person may petition the special review board within seven days, exclusive of Saturdays, Sundays, and legal holidays, after receipt of the revocation report for a review of the revocation. The matter shall be scheduled within 30 days. The special review board shall review the circumstances leading to the revocation and shall recommend to the judicial appeal panel whether or not the revocation shall be upheld. The special review board may also recommend a new provisional discharge at the time of the revocation hearing.",
	"repealed": false
}