{
	"id": "147.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.02",
	"title": "147.02 EXAMINATION; LICENSING.",
	"text": "The board shall issue a license to practice medicine to a person not currently licensed in another state or Canada and who meets the requirements in paragraphs (a) to (i).\n(a) An applicant for a license shall file a written application on forms provided by the board, showing to the board's satisfaction that the applicant is of good moral character and satisfies the requirements of this section.\n(b) The applicant shall present evidence satisfactory to the board of being a graduate of a medical or osteopathic medical school located in the United States, its territories, or Canada, and approved by the board based upon its faculty, curriculum, facilities, accreditation by a recognized national accrediting organization approved by the board, and other relevant data, or is currently enrolled in the final year of study at the school.\n(c) The applicant must have passed an examination as described in clause (1) or (2).\n(1) The applicant must have passed a comprehensive examination for initial licensure prepared and graded by the National Board of Medical Examiners, the Federation of State Medical Boards, the Medical Council of Canada, the National Board of Osteopathic Examiners, or the appropriate state board that the board determines acceptable. The board shall by rule determine what constitutes a passing score in the examination.\n(2) The applicant taking the United States Medical Licensing Examination (USMLE) or Comprehensive Osteopathic Medical Licensing Examination (COMLEX-USA) must have passed steps or levels one, two, and three. Step or level three must be passed within five years of passing step or level two, or before the end of residency training. The applicant must pass each of steps or levels one, two, and three with passing scores as recommended by the USMLE program or National Board of Osteopathic Medical Examiners within three attempts. The applicant taking combinations of Federation of State Medical Boards, National Board of Medical Examiners, and USMLE may be accepted only if the combination is approved by the board as comparable to existing comparable examination sequences and all examinations are completed prior to the year 2000.\n(d) The applicant shall present evidence satisfactory to the board of the completion of one year of graduate, clinical medical training in a program accredited by a national accrediting organization approved by the board.\n(e) The applicant may make arrangements with the executive director to appear in person before the board or its designated representative to show that the applicant satisfies the requirements of this section. The board may establish as internal operating procedures the procedures or requirements for the applicant's personal presentation.\n(f) The applicant shall pay a nonrefundable fee established by the board. Upon application or notice of license renewal, the board must provide notice to the applicant and to the person whose license is scheduled to be issued or renewed of any additional fees, surcharges, or other costs which the person is obligated to pay as a condition of licensure. The notice must:\n(1) state the dollar amount of the additional costs; and\n(2) clearly identify to the applicant the payment schedule of additional costs.\n(g) The applicant must not be under license suspension or revocation by the licensing board of the state or jurisdiction in which the conduct that caused the suspension or revocation occurred.\n(h) The applicant must not have engaged in conduct warranting disciplinary action against a licensee, or have been subject to disciplinary action other than as specified in paragraph (g). If the applicant does not satisfy the requirements stated in this paragraph, the board may issue a license only on the applicant's showing that the public will be protected through issuance of a license with conditions and limitations the board considers appropriate.\n(i) If the examination in paragraph (c) was passed more than ten years ago, the applicant must either:\n(1) pass the special purpose examination of the Federation of State Medical Boards with a score of 75 or better within three attempts; or\n(2) have a current certification by a specialty board of the American Board of Medical Specialties, the American Osteopathic Association, the Royal College of Physicians and Surgeons of Canada, or the College of Family Physicians of Canada.\nThe board may grant an extension to the time period required to pass the United States Medical Licensing Examination (USMLE) as specified in subdivision 1, paragraph (c), clause (2), if an applicant is mobilized into active military service, as defined in section 190.05, subdivision 5, during the process of taking the USMLE, but before passage of all steps. Proof of active military service must be submitted to the board on the forms and according to the timelines of the board.\nThe board may grant an extension to the time period and to the number of attempts permitted to pass the United States Medical Licensing Examination (USMLE) as specified in subdivision 1, paragraph (c), clause (2), if an applicant has been diagnosed with a medical illness during the process of taking the USMLE but before passage of all steps, or fails to pass a step within three attempts due to the applicant's medical illness. Proof of the medical illness must be submitted to the board on forms and according to the timelines of the board.\n[Repealed, 1985 c 247 s 26]\nMS 2020 [Repealed, 2022 c 99 art 2 s 8]\n[Repealed, 1971 c 485 s 6]\n[Repealed, 1984 c 432 art 2 s 55]\nThe board shall adopt a written statement of internal operating procedures describing procedures for receiving and investigating complaints, reviewing misconduct cases, and imposing disciplinary actions.\nAt least annually, the board shall publish and release to the public a description of all disciplinary measures taken by the board. The publication must include, for each disciplinary measure taken, the name and business address of the licensee, the nature of the misconduct, and the disciplinary measure taken by the board.\nThe publication requirement does not apply to disciplinary measures by the board which are based exclusively upon grounds listed in section 147.091, subdivision 1, clause (l) or (r).\n(a) The licensee must maintain a correct mailing address with the board for receiving board communications, notices, and licensure renewal documents. Placing the license renewal application in first-class United States mail, addressed to the licensee at the licensee's last known address with postage prepaid, constitutes valid service. Failure to receive the renewal documents does not relieve a license holder of the obligation to comply with this section.\n(b) The names of licensees who do not return a complete license renewal application, the annual license fee, or the late application fee within 30 days shall be removed from the list of individuals authorized to practice medicine and surgery during the current renewal period. Upon reinstatement of licensure, the licensee's name will be placed on the list of individuals authorized to practice medicine and surgery.",
	"repealed": false
}