{
	"id": "122A.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.181",
	"title": "122A.181 TIER 1 LICENSE.",
	"text": "The Professional Educator Licensing and Standards Board must approve an application for a Tier 1 license in a specified content area if:\n(1) the application has been submitted jointly by the applicant and the district;\n(2) the application has been paid for by the district or the applicant;\n(3) the applicant meets the professional requirement in subdivision 2;\n(4) the district or charter school affirms that the applicant has the necessary skills and knowledge to teach in the specified content area;\n(5) the district or charter school demonstrates that a criminal background check under section 122A.18, subdivision 8, has been completed on the applicant; and\n(6) the district or charter school has posted the teacher position but was unable to hire an acceptable teacher with a Tier 2, 3, or 4 license for the position.\n(a) The Professional Educator Licensing and Standards Board must approve an application for a Tier 1 license in a special education field if:\n(1) the application meets all the requirements under subdivision 1;\n(2) the district or charter school affirms that the applicant will receive high-quality professional development that is sustained, intensive, and classroom focused in order to have a positive and lasting impact on classroom instruction, before and while teaching;\n(3) the district or charter school affirms that the applicant will participate in a program of intensive supervision that consists of structured guidance and regular ongoing support for teachers or a teacher mentoring program; and\n(4) the applicant demonstrates satisfactory progress toward professional licensure.\n(b) A teacher with a Tier 1 license in a special education field may assume the functions as a teacher for a period of time not to exceed three years.\nAn applicant for a Tier 1 license must have a bachelor's degree, unless the applicant meets an exemption identified in subdivision 2a.\n(a) The following applicants for a Tier 1 license are exempt from the requirement to hold a bachelor's degree in subdivision 2:\n(1) an applicant for a Tier 1 license to teach career and technical education or career pathways courses of study if the applicant has:\n(i) an associate's degree;\n(ii) a professional certification; or\n(iii) five years of relevant work experience;\n(2) an applicant for a Tier 1 license to teach world languages and culture pursuant to Minnesota Rules, part 8710.4950, if the applicant is a native speaker of the language; and\n(3) an applicant for a Tier 1 license in the performing or visual arts pursuant to Minnesota Rules, parts 8710.4300, dance and theatre; 8710.4310, dance; 8710.4320, theatre; 8710.4650, vocal music and instrumental music; and 8710.4900, visual arts, if the applicant has at least five years of relevant work experience.\n(b) The Professional Educator Licensing and Standards Board must adopt rules regarding the qualifications and determinations for applicants exempt from paragraph (a).\n(a) The Professional Educator Licensing and Standards Board must issue an initial Tier 1 license for a term of one year. A Tier 1 license may be renewed subject to paragraphs (b) and (c).\n(b) The Professional Educator Licensing and Standards Board must renew a Tier 1 license if:\n(1) the district or charter school requesting the renewal demonstrates that it has posted the teacher position but was unable to hire an acceptable teacher with a Tier 2, 3, or 4 license for the position;\n(2) the teacher holding the Tier 1 license took a content examination in accordance with section 122A.185 and submitted the examination results to the teacher's employing district or charter school within one year of the board approving the request for the initial Tier 1 license;\n(3) the teacher holding the Tier 1 license participated in cultural competency training consistent with section 120B.30, subdivision 8, within one year of the board approving the request for the initial Tier 1 license; and\n(4) the teacher holding the Tier 1 license met the mental illness training renewal requirement under section 122A.187, subdivision 6.\nThe requirement in clause (2) does not apply to a teacher that teaches a class in a career and technical education or career pathways course of study.\n(c) A Tier 1 license must not be renewed more than three times, unless the requesting district or charter school can show good cause for additional renewals. A Tier 1 license issued to teach (1) a class or course in a career and technical education or career pathway course of study, or (2) in a shortage area, as defined in section 122A.06, subdivision 6, may be renewed without limitation.\nThe Professional Educator Licensing and Standards Board must accept and review applications for a Tier 1 teaching license beginning July 1 of the school year for which the license is requested; at the board's discretion, the board may begin to accept and review applications before July 1.\n(a) A Tier 1 license is limited to the content matter indicated on the application for the initial Tier 1 license under subdivision 1, clause (4), and limited to the district or charter school that requested the initial Tier 1 license.\n(b) A Tier 1 license does not bring an individual within the definition of a teacher for purposes of section 122A.40, subdivision 1, or 122A.41, subdivision 1, clause (a).\n(a) A teacher holding a Tier 1 license must participate in the employing district or charter school's mentorship program and professional development.\n(b) A teacher holding a Tier 1 license must participate in an evaluation aligned, to the extent practicable, with the evaluation under section 122A.40, subdivision 8, or 122A.41, subdivision 5.",
	"repealed": false
}