{
	"id": "127A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.20",
	"title": "127A.20 EVIDENCE-BASED EDUCATION GRANTS.",
	"text": "The purpose of this section is to create a process to describe, measure, and report on the effectiveness of any prekindergarten through grade 12 education program funded in whole or in part through funds appropriated by the legislature to the commissioner of education for grants to organizations. The evidence-based evaluation required by this section applies to all grants awarded by the commissioner of education on or after July 1, 2022.\nEach applicant for a grant awarded by the commissioner of education must include in the grant application a statement of the goals of the education program and grant funds. To the extent practicable, the goals must be aligned to the state of Minnesota's world's best workforce and the federally required Every Student Succeeds Act accountability systems.\nEach applicant must include in the grant application a description of the strategies that will be used to meet the goals specified in the application. The applicant must also include a plan to collect data to measure the effectiveness of the strategies outlined in the grant application.\nWithin 180 days of the end of the grant period, each grant recipient must compile a report that describes the data that was collected and evaluate the effectiveness of the strategies. The evidence-based report may identify or propose alternative strategies based on the results of the data. The report must be submitted to the commissioner of education and to the chairs and ranking minority members of the legislative committees with jurisdiction over prekindergarten through grade 12 education. The report must be filed with the Legislative Reference Library according to section 3.195.\nFor purposes of this section, \"grant\" means money appropriated from the state general fund to the commissioner of education for distribution to the grant recipients.",
	"repealed": false
}