{
	"id": "336.9-317",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-317",
	"title": "336.9-317 INTERESTS THAT TAKE PRIORITY OVER OR TAKE FREE OF SECURITY INTEREST OR AGRICULTURAL LIEN.",
	"text": "(a) Conflicting security interests and rights of lien creditors. A security interest or agricultural lien is subordinate to the rights of:\n(1) a person entitled to priority under section 336.9-322; and\n(2) except as otherwise provided in subsection (e), a person that becomes a lien creditor before the earlier of the time:\n(A) the security interest or agricultural lien is perfected; or\n(B) one of the conditions specified in section 336.9-203(b)(3) is met and a financing statement covering the collateral is filed.\n(b) Buyers that receive delivery. Except as otherwise provided in subsection (e), a buyer, other than a secured party, of goods, instruments, tangible documents, or a security certificate takes free of a security interest or agricultural lien if the buyer gives value and receives delivery of the collateral without knowledge of the security interest or agricultural lien and before it is perfected.\n(c) Lessees that receive delivery. Except as otherwise provided in subsection (e), a lessee of goods takes free of a security interest or agricultural lien if the lessee gives value and receives delivery of the collateral without knowledge of the security interest or agricultural lien and before it is perfected.\n(d) Licensees and buyers of certain collateral. Subject to subsections (f) through (i), a licensee of a general intangible or a buyer, other than a secured party, of collateral other than electronic money, goods, instruments, tangible documents, or a certificated security takes free of a security interest if the licensee or buyer gives value without knowledge of the security interest and before it is perfected.\n(e) Purchase-money security interest. Except as otherwise provided in sections 336.9-320 and 336.9-321, if a person files a financing statement with respect to a purchase-money security interest before or within 20 days after the debtor receives delivery of the collateral, the security interest takes priority over the rights of a buyer, lessee, or lien creditor which arise between the time the security interest attaches and the time of filing.\n(f) Buyers of chattel paper. A buyer, other than a secured party, of chattel paper takes free of a security interest if, without knowledge of the security interest and before it is perfected, the buyer gives value and:\n(1) receives delivery of each authoritative tangible copy of the record evidencing the chattel paper; and\n(2) if each authoritative electronic copy of the record evidencing the chattel paper can be subjected to control under section 336.9-105, obtains control of each authoritative electronic copy.\n(g) Buyers of electronic documents. A buyer of an electronic document takes free of a security interest if, without knowledge of the security interest and before it is perfected, the buyer gives value and, if each authoritative electronic copy of the document can be subjected to control under section 336.7-106, obtains control of each authoritative electronic copy.\n(h) Buyers of controllable electronic records. A buyer of a controllable electronic record takes free of a security interest if, without knowledge of the security interest and before it is perfected, the buyer gives value and obtains control of the controllable electronic record.\n(i) Buyers of controllable accounts and controllable payment intangibles. A buyer, other than a secured party, of a controllable account or a controllable payment intangible takes free of a security interest if, without knowledge of the security interest and before it is perfected, the buyer gives value and obtains control of the controllable account or controllable payment intangible.",
	"repealed": false
}