{
	"id": "142A.604",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.604",
	"title": "142A.604 ELIGIBILITY FOR FOSTER CARE BENEFITS.",
	"text": "(a) A child is eligible for foster care benefits under this section if the child meets the requirements of subdivision 2 on or after January 1, 2015.\n(b) The financially responsible agency shall make a title IV-E eligibility determination for all foster children meeting the requirements of subdivision 2, provided the agency has such authority under the state title IV-E plan. To be eligible for title IV-E foster care, a child must also meet any additional criteria specified in section 472 of the Social Security Act.\n(c) Except as provided under section 142A.609, subdivision 1 or 6, the foster care benefit to the child under this section must be determined under sections 142A.607 and 142A.609 through an individual assessment. Information from this assessment must be used to determine a potential future benefit under Northstar kinship assistance or adoption assistance, if needed.\n(d) When a child is eligible for additional services, subdivisions 3 and 4 govern the co-occurrence of program eligibility.\nTo be eligible for foster care benefits under this section, the child must be in placement away from the child's legal parent, guardian, or Indian custodian as defined in section 260.755, subdivision 10, and must meet one of the criteria in clause (1) and either clause (2) or (3):\n(1) the legally responsible agency must have placement authority to place the child with: (i) a voluntary placement agreement or a court order, consistent with sections 260B.198, 260C.001, and 260D.01, or consistent with section 260C.451 for a child 18 years old or older and under age 21 who maintains eligibility for foster care; or (ii) a voluntary placement agreement or court order by a Minnesota tribe that is consistent with United States Code, title 42, section 672(a)(2); and\n(2) the child is placed with a licensed child foster parent who resides with the child; or\n(3) the child is placed in one of the following unlicensed child foster care settings:\n(i) an emergency relative placement under tribal licensing regulations or section 142B.06, with the legally responsible agency ensuring the relative completes the required child foster care application process;\n(ii) a licensed adult foster home with an approved age variance under section 245A.16 for no more than six months where the license holder resides with the child;\n(iii) for a child 18 years old or older and under age 21 who is eligible for extended foster care under section 260C.451, an unlicensed supervised independent living setting approved by the agency responsible for the child's care; or\n(iv) a preadoptive placement in a home specified in section 245A.03, subdivision 2, paragraph (a), clause (9), with an approved adoption home study and signed adoption placement agreement.\nA child who is a minor parent in placement with the minor parent's child in the same home is eligible for foster care benefits under this section. The foster care benefit is limited to the minor parent, unless the legally responsible agency has separate legal authority for placement of the minor parent's child.\nA foster child 18 years old or older and under age 21 who maintains eligibility consistent with section 260C.451 and who is placed in an unlicensed supervised independent living setting shall receive the level of benefit under section 142A.609.\nThe basic and supplemental difficulty of care payment represents costs for activities similar in nature to those expected of parents, and does not cover services rendered by the licensed or tribally approved foster parent or administrative costs or fees. The financially responsible agency may pay an additional fee for specific services provided by the licensed foster parent. A foster parent must distinguish such a service from the daily care of the child as assessed through the process under section 142A.607.\n(a) Section 142A.418 establishes the pre-Northstar Care for Children foster care program for all children residing in family foster care on December 31, 2014. Unless transitioned under paragraph (b), a child in foster care with the same caregiver receives benefits under this pre-Northstar Care for Children foster care program.\n(b) Transition from the pre-Northstar Care for Children foster care program to Northstar Care for Children takes place on or after January 1, 2015, when the child:\n(1) moves to a different foster home or unlicensed supervised independent living setting;\n(2) has permanent legal and physical custody transferred and, if applicable, meets eligibility requirements in section 142A.605;\n(3) is adopted and, if applicable, meets eligibility requirements in section 142A.606; or\n(4) re-enters foster care after reunification or a trial home visit.\n(c) Upon becoming eligible, a foster child must be assessed according to section 142A.607 and then transitioned into Northstar Care for Children according to section 142A.612.\n(a) A county or private agency conducting a background study for purposes of child foster care licensing or approval must conduct the study in accordance with chapter 245C and must meet the requirements in United States Code, title 42, section 671(a)(20).\n(b) A Minnesota tribe conducting a background study for purposes of child foster care licensing or approval must conduct the study in accordance with the requirements in United States Code, title 42, section 671(a)(20), when applicable.",
	"repealed": false
}