{
	"id": "18C.310",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.310",
	"title": "18C.310 GENETICALLY ENGINEERED FERTILIZER, GENETICALLY ENGINEERED SOIL AMENDMENT, OR GENETICALLY ENGINEERED PLANT AMENDMENT PERMIT.",
	"text": "A person may not conduct a release of a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment in any amount in the state until a permit for the release has been obtained from the commissioner under this section, a registration has been obtained under section 18C.411, or a license has been obtained under section 18C.415. A release of a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment must have a permit under this section until the commissioner determines by rule or order that the release may be subject to sections 18C.411 and 18C.415, or is otherwise exempt from this section. Each new release requires a new permit.\n(a) After reviewing a completed application, the commissioner may issue a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment permit if the commissioner determines that the applicant has adequately demonstrated that the proposed release does not have the potential for unreasonable adverse effects on the environment. The commissioner may prescribe terms and conditions including, but not limited to, the period for the genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment permit, the amount or number of genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment to be used, monitoring activities, department inspection schedules, reporting of experiment results, and experiment termination procedures. A person may not violate terms or conditions of a permit issued under this section. After a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment permit is issued, the commissioner may revoke or change the permit at any time if the commissioner finds that its terms or conditions are being violated or are inadequate to avoid unreasonable adverse effects on the environment.\n(b) The commissioner may deny issuance of a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment permit if the commissioner determines that the use to be made of the genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment under the proposed terms and conditions may cause unreasonable adverse effects on the environment.\nA person shall file an application for a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment permit with the commissioner. An application for a genetically engineered fertilizer, genetically engineered soil amendment, or genetically engineered plant amendment permit must include:\n(1) the name and address of the applicant;\n(2) any United States Environmental Protection Agency, United States Department of Agriculture, or other federal agency regulatory application or approval document, if required under federal law or rule;\n(3) the purpose or objectives of the product;\n(4) the name, address, and telephone number of cooperators or participants in this state;\n(5) the amount of material to be shipped or used in this state; and\n(6) other information requested by the commissioner.",
	"repealed": false
}