{
	"id": "135A.1581",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.1581",
	"title": "135A.1581 NAVIGATORS FOR PARENTING STUDENTS.",
	"text": "(a) This section applies to the following postsecondary institutions:\n(1) institutions governed by the Board of Trustees of the Minnesota State Colleges and Universities; and\n(2) private postsecondary institutions that offer in-person courses on a campus located in Minnesota and which are eligible institutions as defined in section 136A.103.\n(b) Institutions governed by the Board of Regents of the University of Minnesota are requested to comply with this section.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Institutions of higher education\" means an institution of higher education under subdivision 1.\n(c) \"Parenting student\" means a student enrolled at an institution of higher education who is the parent or legal guardian of or can claim as a dependent a child under the age of 18.\nAn institution of higher education must designate at least one employee of the institution to act as a college navigator for current or incoming students at the institution who are parenting students. The navigator must provide to the students information regarding support services and other resources available to the students at the institution, including:\n(1) medical and behavioral health coverage and services;\n(2) public benefit programs, including programs related to food security, affordable housing, and housing subsidies;\n(3) parenting and child care resources;\n(4) employment assistance;\n(5) transportation assistance; and\n(6) any other resources developed by the institution to assist the students, including student academic success strategies.\n(a) By June 30, 2026, an institution of higher education must establish a process for collecting the parenting status of each enrolled student. By November 30, 2026, the Office of Higher Education shall establish a process for collecting this information from institutions.\n(b) Annually, beginning January 15, 2028, the Office of Higher Education must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education and children, youth, and families. The report must include the following for parenting students:\n(1) summary demographic data;\n(2) enrollment patterns;\n(3) retention rates;\n(4) completion rates;\n(5) average cumulative debt at exit or graduation as possible; and\n(6) time to completion.\nData must be disaggregated by institution, academic year, race and ethnicity, gender, and other factors determined to be relevant by the commissioner.",
	"repealed": false
}