{
	"id": "214.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.075",
	"title": "214.075 HEALTH-RELATED LICENSING BOARDS; CRIMINAL BACKGROUND CHECKS.",
	"text": "(a) Each health-related licensing board, as defined in section 214.01, subdivision 2, shall require the following individuals to submit to a criminal history records check of state data completed by the Bureau of Criminal Apprehension (BCA) and a national criminal history records check, including a search of the records of the Federal Bureau of Investigation (FBI):\n(1) applicants for initial licensure or licensure by endorsement. An applicant is exempt from this paragraph if the applicant submitted to a state and national criminal history records check as described in this paragraph for a license issued by the same board;\n(2) applicants seeking reinstatement or relicensure, as defined by the individual health-related licensing board, if more than one year has elapsed since the applicant's license or registration expiration date; or\n(3) licensees applying for eligibility to participate in an interstate licensure compact.\n(b) An applicant's criminal background check results are valid for one year from the date the background check results were received by the board. If more than one year has elapsed since the results were received by the board, then an applicant who has not completed the licensure, reinstatement, or relicensure process must complete a new background check.\nIf a health-related licensing board has reasonable cause to believe a licensee has been charged with or convicted of a crime in this or any other jurisdiction, the health-related licensing board may require the licensee to submit to a criminal history records check of state data completed by the BCA and a national criminal history records check, including a search of the records of the FBI.\n(a) In order to effectuate the federal and state level, fingerprint-based criminal background check, the applicant or licensee must submit a completed criminal history records check consent form and a full set of fingerprints to the respective health-related licensing board or a designee in the manner and form specified by the board.\n(b) The applicant or licensee is responsible for all fees associated with preparation of the fingerprints, the criminal records check consent form, and the criminal background check. The fees for the criminal records background check shall be set by the BCA and the FBI and are not refundable. The fees shall be submitted to the respective health-related licensing board by the applicant or licensee as prescribed by the respective board.\n(c) All fees received by the health-related licensing boards under this subdivision shall be deposited in dedicated accounts in the special revenue fund and are appropriated to health-related licensing boards to pay for the criminal background checks conducted by the Bureau of Criminal Apprehension and Federal Bureau of Investigation.\n(a) The health-related licensing boards shall not issue a license to any applicant who refuses to consent to a criminal background check or fails to submit fingerprints after submission of an application for licensure. Any fees paid by the applicant to the board shall be forfeited if the applicant refuses to consent to the criminal background check or fails to submit the required fingerprints.\n(b) The failure of a licensee to submit to a criminal background check as provided in subdivision 3 is grounds for disciplinary action by the respective health-related licensing board.\nThe health-related licensing board or designee shall submit applicant or licensee fingerprints to the BCA. The BCA shall perform a check for state criminal justice information and shall forward the applicant's or licensee's fingerprints to the FBI to perform a check for national criminal justice information regarding the applicant or licensee. The BCA shall report to the board the results of the state and national criminal history records checks.\nThe health-related licensing board may require an alternative method of criminal history checks for an applicant or licensee who has submitted at least two sets of fingerprints in accordance with this section that have been unreadable by the BCA or the FBI.\nPrior to taking disciplinary action against an applicant or a licensee based on a criminal conviction, the health-related licensing board shall provide the applicant or the licensee an opportunity to complete or challenge the accuracy of the criminal history information reported to the board. The applicant or licensee shall have 30 calendar days following notice from the board of the intent to deny licensure or to take disciplinary action to request an opportunity to correct or complete the record prior to the board taking disciplinary action based on the information reported to the board. The board shall provide the applicant up to 180 days to challenge the accuracy or completeness of the report with the agency responsible for the record. This subdivision does not affect the right of the subject of the data to contest the accuracy or completeness under section 13.04, subdivision 4.\nMS 2018 [Repealed, 2019 c 49 s 7]",
	"repealed": false
}