{
	"id": "127A.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/127A.45",
	"title": "127A.45 PAYMENT OF AIDS AND CREDITS TO SCHOOL DISTRICTS.",
	"text": "This section applies to all aids or credits paid by the commissioner from the general fund to districts.\n(a) \"Other district receipts\" means payments by county treasurers pursuant to section 276.10, apportionments from the school endowment fund pursuant to section 127A.33, apportionments by the county auditor pursuant to section 127A.34, subdivision 2, and payments to school districts by the commissioner of revenue pursuant to chapter 298.\n(b) \"Cumulative amount guaranteed\" means the product of\n(1) the cumulative disbursement percentage shown in subdivision 3; times\n(2) the sum of\n(i) the current year aid payment percentage of the estimated aid and credit entitlements paid according to subdivision 13; plus\n(ii) 100 percent of the entitlements paid according to subdivisions 11 and 12; plus\n(iii) the other district receipts.\n(c) \"Payment date\" means the date on which state payments to districts are made by the electronic funds transfer method. If a payment date falls on a Saturday, a Sunday, or a weekday which is a legal holiday, the payment shall be made on the immediately preceding business day. The commissioner may make payments on dates other than those listed in subdivision 3, but only for portions of payments from any preceding payment dates which could not be processed by the electronic funds transfer method due to documented extenuating circumstances.\n(d) The current year aid payment percentage equals 90.\n(a) The commissioner shall pay to a district on the dates indicated an amount computed as follows: the cumulative amount guaranteed minus the sum of (1) the district's other district receipts through the current payment, and (2) the aid and credit payments through the immediately preceding payment. For purposes of this computation, the payment dates and the cumulative disbursement percentages are as follows:\n(b) In addition to the amounts paid under paragraph (a), the commissioner shall pay to a school district or charter school on the dates indicated an amount computed as follows:\n(c) Notwithstanding paragraph (b), if the current year aid payment percentage under subdivision 2, paragraph (d), is less than 90, in addition to the amounts paid under paragraph (a), the commissioner shall pay to a charter school on the dates indicated an amount computed as follows:\n(d) Notwithstanding paragraph (b), if a charter school is an eligible special education charter school under section 124E.21, subdivision 2, in addition to the amounts paid under paragraph (a), the commissioner shall pay to a charter school on the dates indicated an amount computed as follows:\n(a) The commissioner, in consultation with the commissioner of management and budget, may revise the payment dates and percentages in subdivision 3 for a district if it is determined that:\n(1) there is an emergency; or\n(2) there are serious cash flow problems in the district that cannot be resolved by issuing warrants or other forms of indebtedness; or\n(3) the district is facing a serious cash flow problem because of an abatement that exceeds $100 times the resident pupil units of the district.\n(b) The commissioner shall establish a process and criteria for districts to appeal the payment dates and percentages established in subdivision 3.\n[Repealed, 1999 c 241 art 6 s 15]\nFor any district exceeding its expenditure limitations under section 123B.83, and if requested by the district, the commissioner of education, in consultation with the commissioner of management and budget, and a school district may negotiate a cash flow payment schedule under subdivision 3 corresponding to the district's cash flow needs so as to minimize the district's short-term borrowing needs.\nThe board of directors of any eligible special education charter school under section 124E.21, subdivision 2, may request that the commissioner of education accelerate the school's cash flow under this section. The commissioner must approve a properly submitted request within 30 days of its receipt. The commissioner must accelerate the school's regular special education aid payments according to the schedule in the school's request and modify the payments to the school under subdivision 3 accordingly. A school must not receive current payments of regular special education aid exceeding 90 percent of its estimated aid entitlement for the fiscal year. The commissioner must delay the special education aid payments to all other school districts and charter schools in proportion to each district or charter school's total share of regular special education aid such that the overall aid payment savings from the aid payment shift remains unchanged for any fiscal year.\nSubdivision 3 does not authorize the commissioner to pay to a district's operating funds an amount of state general fund cash that exceeds the sum of:\n(a) its estimated aid and credit payments for the current year according to subdivision 13;\n(b) its actual aid payments according to subdivisions 11 and 12; and\n(c) the final adjustment payment for the prior year.\n[Repealed, 2008 c 363 art 2 s 52]\n(a) Notwithstanding subdivisions 3 and 7, if the current year aid payment percentage, under subdivision 2, is less than 90, then a school district or charter school exceeding its expenditure limitations under section 123B.83 as of June 30 of the prior fiscal year may receive a portion of its final payment for the current fiscal year on June 20, if requested by the district or charter school. The amount paid under this subdivision must not exceed the lesser of:\n(1) the difference between 90 percent and the current year payment percentage in subdivision 2, paragraph (d), in the current fiscal year times the sum of the district or charter school's general education aid plus the aid adjustment in section 127A.50 for the current fiscal year; or\n(2) the amount by which the district's or charter school's net negative unreserved general fund balance as of June 30 of the prior fiscal year exceeds 2.5 percent of the district or charter school's expenditures for that fiscal year.\n(b) The state total advance final payment under this subdivision for any year must not exceed $7,500,000. If the amount request exceeds $7,500,000, the advance final payment for each eligible district must be reduced proportionately.\nFor purposes of determining the amount of state general fund cash to be paid to districts pursuant to subdivision 3, the commissioner shall:\n(1) assume that the payments to school districts by the county treasurer of revenues accruing to the fiscal year of receipt pursuant to section 276.11 are made in the following manner:\n(i) 50 percent within seven business days of each due date; and\n(ii) 100 percent within 14 business days of each due date;\n(2) assume that the payments to districts by the county treasurer of revenues accruing to the fiscal year of receipt pursuant to section 276.111 are made in the following manner:\n(i) 50 percent within seven business days of the October 15 due date;\n(ii) 100 percent within 14 business days of the October 15 due date; and\n(iii) 100 percent within ten business days of the November 15 due date; and\n(3) assume that the payments to school districts by county auditors pursuant to section 127A.34, subdivision 2, are made at the end of the months indicated in that subdivision.\n(a) For all aids and credits paid according to subdivision 13, the final adjustment payment must include the amounts necessary to pay the district's full aid entitlement for the prior year based on actual data. This payment must be used to correct all estimates used for the payment schedule in subdivision 3. The payment must be made as specified in subdivision 3. In the event actual data are not available, the final adjustment payment may be computed based on estimated data. A corrected final adjustment payment must be made when actual data are available.\n(b) Notwithstanding paragraph (a) and subdivision 3, for a charter school that ceases operation before the end of a school year, a final adjustment payment for aid programs funded with an open appropriation may be made after audit of the prior fiscal year and current fiscal year pupil counts.\nEach fiscal year state general fund payments for a district nonoperating fund must be made at the current year aid payment percentage of the estimated entitlement during the fiscal year of the entitlement. This amount shall be paid in six equal monthly installments from July through December. The amount of the actual entitlement, after adjustment for actual data, minus the payments made during the fiscal year of the entitlement must be paid prior to October 31 of the following school year. The commissioner may make advance payments of debt service equalization aid and state-paid tax credits for a district's debt service fund earlier than would occur under the preceding schedule if the district submits evidence showing a serious cash flow problem in the fund. The commissioner may make earlier payments during the year and, if necessary, increase the percent of the entitlement paid to reduce the cash flow problem.\nOne hundred percent of the aid for the previous fiscal year must be paid in the current year for the following aids: telecommunications/Internet access equity aid according to section 125B.26, special education special pupil aid according to section 125A.75, subdivision 3, aid for court-placed special education expenses according to section 125A.79, subdivision 4, and aid for special education out-of-state tuition according to section 125A.79, subdivision 8, and shared time aid according to section 126C.01, subdivision 7.\nOne hundred percent of the aid for the current fiscal year must be paid for the following aids: reimbursement for enrollment options transportation according to sections 124D.03, subdivision 8, and 124D.09, subdivision 22, and chapter 124E, and support services aid, for persons who are deaf, deafblind, and hard-of-hearing according to section 124D.57.\nOne hundred percent of the state aid in fiscal years 2003 and later received under section 124D.87 must be paid by the state to the recipient school district on August 30 of that year. The recipient school district must recognize this aid in the previous fiscal year.\nExcept as provided in subdivisions 11, 12, 12a, 14, and 14a, each fiscal year, all education aids and credits in this chapter and chapters 120A, 120B, 121A, 122A, 123A, 123B, 124D, 124E, 125A, 125B, 126C, 134, and section 273.1392, shall be paid at the current year aid payment percentage of the estimated entitlement during the fiscal year of the entitlement. For the purposes of this subdivision, a district's estimated entitlement for special education aid under section 125A.76 for fiscal year 2014 and later equals 97.4 percent of the district's entitlement for the current fiscal year. The final adjustment payment, according to subdivision 9, must be the amount of the actual entitlement, after adjustment for actual data, minus the payments made during the fiscal year of the entitlement.\nThe state shall pay aid according to sections 123B.40 to 123B.48 for pupils attending nonpublic schools as follows:\n(1) an advance payment by November 30 equal to the current year aid payment percentage of the estimated entitlement for the current fiscal year; and\n(2) a final payment by October 31 of the following fiscal year, adjusted for actual data.\nIf a payment advance to meet cash flow needs is requested by a district and approved by the commissioner, the state shall pay nonpublic pupil transportation aid according to section 123B.92 by October 31.\nNotwithstanding subdivisions 3 and 13, the state shall pay 100 percent of the aid for the current year according to sections 124D.111, 124D.1158, and 124D.118 based on submitted monthly vouchers showing meals and milk served.\n(a) An education aids cash flow account is established in the state treasury for the purpose of ensuring the timely payment of state aids or credits to districts as provided in this section. In the event the account balance in any appropriation from the general fund to the department for education aids or credits is insufficient to make the next scheduled payment or payments, the commissioner is authorized to transfer funds from the education aids cash flow account to the accounts that are insufficient.\n(b) For purposes of this subdivision, an account may have an insufficient balance only as a result of some districts being overpaid based on revised estimates for the relevant annual aid or credit entitlements. When the overpayment amounts are recovered from the pertinent districts, the commissioner shall transfer those amounts to the education aids cash flow account. The commissioner shall determine when it is not feasible to recover the overpayments in a timely manner from the district's future aid payments and notify the district of the amount that is to be refunded to the state. Districts are encouraged to make such refunds promptly. The commissioner may approve a schedule for making a refund when a district demonstrates that its cash flow is inadequate to promptly make the refund in full.\n(c) There is annually appropriated from the general fund to the education aids cash flow account the additional amount necessary to ensure the timely payment of state aids or credits to districts as provided in this section. For any fiscal year, the appropriation authorized in this subdivision must not exceed an amount equal to two-tenths of one percent of the total general fund appropriations in that year for education aids and credits. At the close of each fiscal year, the amount of actual transfers plus anticipated transfers required in paragraph (b) must equal the authorized amounts transferred in paragraph (a) so that the net effect on total general fund spending for education aids and credits is zero.\nNotwithstanding subdivision 3, the current year aid payment percentage of the amount under section 124D.041 shall be paid in equal installments on August 30, December 30, and March 30, with a final adjustment payment on October 30 of the next fiscal year of the remaining amount.\nExcept where otherwise specifically authorized, state education aid payments shall be made only to the school district, charter school, or other education organization earning state aid revenues as a result of providing education services.",
	"repealed": false
}