{
	"id": "13D.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/13D.05",
	"title": "13D.05 MEETINGS HAVING DATA CLASSIFIED AS NOT PUBLIC.",
	"text": "(a) Except as provided in this chapter, meetings may not be closed to discuss data that are not public data.\n(b) Data that are not public data may be discussed at a meeting subject to this chapter without liability or penalty, if the disclosure relates to a matter within the scope of the public body's authority and is reasonably necessary to conduct the business or agenda item before the public body.\n(c) Data discussed at an open meeting retain the data's original classification; however, a record of the meeting, regardless of form, shall be public.\n(d) All closed meetings, except those closed as permitted by the attorney-client privilege, must be electronically recorded at the expense of the public body. Unless otherwise provided by law, the recordings must be preserved for at least three years after the date of the meeting.\n(a) Any portion of a meeting must be closed if expressly required by other law or if the following types of data are discussed:\n(1) data that would identify alleged victims or reporters of criminal sexual conduct, domestic abuse, or maltreatment of minors or vulnerable adults;\n(2) active investigative data as defined in section 13.82, subdivision 7, or internal affairs data relating to allegations of law enforcement personnel misconduct collected or created by a state agency, statewide system, or political subdivision;\n(3) educational data, health data, medical data, welfare data, or mental health data that are not public data under section 13.32, 13.3805, subdivision 1, 13.384, or 13.46, subdivision 2 or 7; or\n(4) an individual's medical records governed by sections 144.291 to 144.298.\n(b) A public body shall close one or more meetings for preliminary consideration of allegations or charges against an individual subject to its authority. If the members conclude that discipline of any nature may be warranted as a result of those specific charges or allegations, further meetings or hearings relating to those specific charges or allegations held after that conclusion is reached must be open. A meeting must also be open at the request of the individual who is the subject of the meeting.\n(a) A public body may close a meeting to evaluate the performance of an individual who is subject to its authority. The public body shall identify the individual to be evaluated prior to closing a meeting. At its next open meeting, the public body shall summarize its conclusions regarding the evaluation. A meeting must be open at the request of the individual who is the subject of the meeting.\n(b) Meetings may be closed if the closure is expressly authorized by statute or permitted by the attorney-client privilege.\n(c) A public body may close a meeting:\n(1) to determine the asking price for real or personal property to be sold by the government entity;\n(2) to review confidential or protected nonpublic appraisal data under section 13.44, subdivision 3; and\n(3) to develop or consider offers or counteroffers for the purchase or sale of real or personal property.\nBefore holding a closed meeting under this paragraph, the public body must identify on the record the particular real or personal property that is the subject of the closed meeting. The proceedings of a meeting closed under this paragraph must be tape recorded at the expense of the public body. The recording must be preserved for eight years after the date of the meeting and made available to the public after all real or personal property discussed at the meeting has been purchased or sold or the governing body has abandoned the purchase or sale. The real or personal property that is the subject of the closed meeting must be specifically identified on the tape. A list of members and all other persons present at the closed meeting must be made available to the public after the closed meeting. If an action is brought claiming that public business other than discussions allowed under this paragraph was transacted at a closed meeting held under this paragraph during the time when the tape is not available to the public, section 13D.03, subdivision 3, applies.\nAn agreement reached that is based on an offer considered at a closed meeting is contingent on approval of the public body at an open meeting. The actual purchase or sale must be approved at an open meeting after the notice period required by statute or the governing body's internal procedures, and the purchase price or sale price is public data.\n(d) Meetings may be closed to receive security briefings and reports, to discuss issues related to security systems, to discuss emergency response procedures and to discuss security deficiencies in or recommendations regarding public services, infrastructure and facilities, if disclosure of the information discussed would pose a danger to public safety or compromise security procedures or responses. Financial issues related to security matters must be discussed and all related financial decisions must be made at an open meeting. Before closing a meeting under this paragraph, the public body, in describing the subject to be discussed, must refer to the facilities, systems, procedures, services, or infrastructures to be considered during the closed meeting. A closed meeting must be tape recorded at the expense of the governing body, and the recording must be preserved for at least four years.",
	"repealed": false
}