{
	"id": "13.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.601",
	"title": "13.601 ELECTED AND APPOINTED OFFICIALS.",
	"text": "Financial disclosure statements of elected or appointed officials which, by requirement of the political subdivision, are filed with the political subdivision, are public data on individuals.\nCorrespondence between individuals and elected officials is private data on individuals, but may be made public by either the sender or the recipient.\n(a) Data about applicants for appointment to a public body collected by a government entity as a result of the applicant's application for appointment to the public body are private data on individuals except that the following are public:\n(1) name;\n(2) city of residence, except when the appointment has a residency requirement that requires the entire address to be public;\n(3) education and training;\n(4) employment history;\n(5) volunteer work;\n(6) awards and honors;\n(7) prior government service;\n(8) any data required to be provided or that are voluntarily provided in an application for appointment to a multimember agency pursuant to section 15.0597; and\n(9) veteran status.\n(b) Once an individual is appointed to a public body, the following additional items of data are public:\n(1) residential address;\n(2) either a telephone number or electronic mail address where the appointee can be reached, or both at the request of the appointee;\n(3) first and last dates of service on the public body;\n(4) the existence and status of any complaints or charges against an appointee; and\n(5) upon completion of an investigation of a complaint or charge against an appointee, the final investigative report is public, unless access to the data would jeopardize an active investigation.\n(c) Notwithstanding paragraph (b), any electronic mail address or telephone number provided by a public body for use by an appointee shall be public. An appointee may use an electronic mail address or telephone number provided by the public body as the designated electronic mail address or telephone number at which the appointee can be reached.",
	"repealed": false
}