{
	"id": "142D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.11",
	"title": "142D.11 EARLY CHILDHOOD FAMILY EDUCATION (ECFE) REVENUE.",
	"text": "The revenue for early childhood family education programs for a school district equals the formula allowance for the year times 0.023 times the greater of:\n(1) 150; or\n(2) the number of people under five years of age residing in the district on October 1 of the previous school year.\nFor the purposes of subdivision 1, data reported to the department may be used to determine the number of people under five years of age residing in the district. The commissioner, with the assistance of the state demographer, shall review the number reported by any district operating an early childhood family education program. If requested, the district shall submit to the commissioner an explanation of its methods and other information necessary to document accuracy. If the commissioner determines that the district has not provided sufficient documentation of accuracy, the commissioner may request the state demographer to prepare an estimate of the number of people under five years of age residing in the district and may use this estimate for the purposes of subdivision 1.\nBy September 30 of each year, the commissioner of education shall establish a tax rate for early childhood family education revenue that raises $22,135,000 in each fiscal year. After consulting with the commissioner of children, youth, and families, if the commissioner of education determines that the amount of the early childhood family education levy would exceed the early childhood family education revenue, then the early childhood family education levy must equal the early childhood family education revenue. A district may not certify an early childhood family education levy unless it has met the annual program data reporting requirements under section 142D.11, subdivision 13.\nIf a district complies with the provisions of section 142D.11, it must receive early childhood family education aid equal to the difference between the early childhood family education revenue and the early childhood family education levy. If the district does not levy the entire amount permitted, the early childhood family education aid must be reduced in proportion to the actual amount levied.\n(a) Early childhood family education revenue may be used only for early childhood family education programs.\n(b) Not more than five percent of early childhood family education revenue, as defined in subdivision 9, may be used to administer early childhood family education programs.\n(c) An early childhood family education program may use up to ten percent of its early childhood family education revenue as defined in subdivision 1, including revenue from participant fees, for equipment that is used in the early childhood family education program. This revenue may only be used for the following purposes:\n(1) to purchase or lease computers and related materials; and\n(2) to purchase or lease equipment for instruction for participating children and their families.\nIf a district anticipates an unusual circumstance requiring its early childhood family education program capital expenditures to exceed the ten percent limitation, prior approval to exceed the limit must be obtained in writing from the commissioner.\n(a) A district that is eligible to levy for early childhood family education under subdivision 3 and that enters into a collaborative agreement to provide education services and social services to families with young children is eligible for home visiting revenue.\n(b) Total home visiting revenue for a district equals $3 times the number of people under five years of age residing in the district on September 1 of the last school year. Revenue under this subdivision must not be included as revenue under subdivision 1. The revenue must be used for home visiting programs under section 142D.11, subdivision 4.\nTo obtain home visiting revenue, a district may levy an amount not more than the product of its home visiting revenue for the fiscal year times the lesser of one or the ratio of its adjusted net tax capacity per adjusted pupil unit to the home visiting equalizing factor. The home visiting equalizing factor equals $17,250 for fiscal year 2018 and later.\nA district's home visiting aid equals its home visiting revenue minus its home visiting levy times the ratio of the actual amount levied to the permitted levy.\nEarly childhood family education revenue, which includes aids, levies, fees, grants, and all other revenues received by the district for early childhood family education programs, must be maintained in a reserve account within the community service fund.\nThe commissioner and the commissioner of education shall enter into an agreement under which the commissioner of education shall distribute funds appropriated for programs under this section.",
	"repealed": false
}