{
	"id": "79A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.25",
	"title": "79A.25 DEFAULT OF A COMMERCIAL SELF-INSURANCE GROUP.",
	"text": "The commissioner of labor and industry shall notify the commissioner and the commercial self-insurance group security fund if the commissioner of labor and industry has knowledge that any commercial self-insurance group has failed to pay workers' compensation benefits as required by chapter 176. If the commissioner determines that a court of competent jurisdiction has declared the commercial self-insurance group to be insolvent and the commercial self-insurance group has failed to pay workers' compensation as required by chapter 176 or if the commissioner issues a certificate of default against a commercial self-insurance group for failure to pay workers' compensation as required by chapter 176, then the security deposit posted by the commercial self-insurance group shall be utilized to administer and pay the commercial self-insurance group's workers' compensation obligation.\n(a) The commissioner shall revoke the commercial self-insurance group's certificate to self-insure once notified of the commercial self-insurance group's insolvency or upon issuance of a certificate of default. The revocation shall be completed as soon as practicable, but no later than 30 days after the commercial self-insurance group's security has been called.\n(b) The commissioner shall also revoke a commercial self-insurance group's authority to self-insure on the following grounds:\n(1) failure to comply with any lawful order of the commissioner;\n(2) failure to comply with any provision of chapter 176;\n(3) a deterioration of the commercial self-insurance group's financial condition affecting its ability to pay obligations in chapter 176;\n(4) committing an unfair or deceptive act or practice as defined in section 72A.20; or\n(5) failure to abide by the plan of operation of the Workers' Compensation Reinsurance Association.\n(a) A commercial self-insurance group must notify the commissioner, prior to or immediately upon a court of competent jurisdiction declaring it to be insolvent. If a commercial self-insurance group has been declared insolvent by a court of competent jurisdiction and the commercial self-insurance group has failed to pay workers' compensation as required by chapter 176, the commissioner must call the security and proceed in accordance with this section.\n(b) If a commercial self-insurance group has notified the commissioner that a court of competent jurisdiction has declared it bankrupt but the commercial self-insurance group has not failed to pay workers' compensation benefits as required by chapter 176, the commissioner may call the security and proceed in accordance with this section if the commissioner determines that the commercial self-insurance group's payment of workers' compensation benefits would be delayed in any way as a result of the bankruptcy petition or declaration or that the commercial self-insurance group would otherwise be unable to fulfill its obligations under chapter 79A or 176.\n(c) In making the determination provided for in paragraph (b) to call a commercial self-insurance group's security and proceed in accordance with this section, the commissioner must consult with the commissioner of labor and industry to determine if the commissioner of labor and industry has knowledge that the commercial self-insurance group has failed to pay workers' compensation benefits as required by chapter 176. The commissioner shall also consider the following:\n(1) the commercial self-insurance group's most recent actuarial statement, including but not limited to estimated future liability and posted security;\n(2) the commercial self-insurance group's claims history and claims projections;\n(3) the circumstances surrounding the commercial self-insurance group's petition to file bankruptcy; and\n(4) any other circumstances the commissioner deems relevant.\n(d) The commissioner must also meet and confer with the commercial self-insurance group and the group security fund. The initial meet and confer must occur within 30 days of the filing of the petition for chapter 11 bankruptcy. Failure to participate in the meet and confer process by the commercial self-insurance group may result in a default determination to immediately transfer the posted security and claims obligations to the fund. During the meet and confer, the commissioner may ask the commercial self-insurance group to provide additional information and the commercial self-insurance group security fund may inspect the commercial self-insurance group's most recent actuarial study on file with the commissioner as well as its current security deposit amount required by the commissioner. Data disclosed during the meet and confer must remain confidential. Nothing in this section shall limit the fund's authority to seek information directly from its members.\nIn the event of insolvency or certificate of default, the commissioner shall immediately notify by certified mail the commissioner of management and budget, the surety, the issuer of an irrevocable letter of credit, and any custodian of the security. At the time of notification, the commissioner shall also call the security and transfer and assign it to the commercial self-insurance group security fund. The commissioner shall also notify by certified mail the commercial self-insurance group's security fund and order the commercial security fund to assume the insolvent commercial self-insurance group's obligations for which it is liable under chapter 176.",
	"repealed": false
}