{
	"id": "117.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/117.57",
	"title": "117.57 AUTHORITIES; RAILROAD PROPERTIES.",
	"text": "The power of eminent domain of an authority, as defined in section 469.174, subdivision 2, extends to railroad properties located within the authority's limits, provided:\n(1) the railroad property is not a line of track for which abandonment is required under federal law, or if it is a line of track for which abandonment is required under federal law, abandonment has been approved;\n(2) the railroad property is not currently used for the following activities of the railroad, not including storage, maintenance, and repair activities:\n(i) switching;\n(ii) loading or unloading; or\n(iii) classification activities;\n(3) some part of the property contains land pollution as defined in section 116.06, or contains a release or threatened release of petroleum, as provided in chapter 115C, or contains a release or threatened release of a pollutant, contaminant, hazardous substance, or hazardous waste, as provided in chapter 115B; and\n(4) the authority intends to develop the property and has a plan for its cleanup and development within five years in order to maximize its market value.\nProperty in current use under clause (2) includes only that area which is reasonably necessary for current operation.\nUpon a showing by the petitioner in condemnation proceedings that the conditions described in clauses (1) to (3) exist, then the public use to which the authority would put the property is presumed a superior public use to railroad use or any other past, present, or proposed future use. A railroad may rebut the presumption by clear and convincing evidence that the railroad use is a superior use.\nNothing in this section shall supersede the provisions of section 222.63.\nAn authority shall not be adjudged to have a superior public use to that of a regional railroad authority as defined in section 398A.01, a railroad property which has been identified and approved as a light rail corridor by the Metropolitan Council under chapter 473, or a state trail covered by section 85.015.\n(a) Except as provided in paragraph (b), subdivision 1 does not apply to railroad property that is in a county outside of the metropolitan area as defined in section 473.121, subdivision 2, if:\n(1) the property is a line of track in actual use; and\n(2) the line of track is the principal means of transportation for an agricultural use, as defined in section 17.81, subdivision 4, by an owner or lessee of real estate abutting the line of track.\n(b) The line of track may be acquired under subdivision 1 with the written consent of all the owners or lessees described in paragraph (a), clause (2).\nNo property with ongoing railroad use at the time of acquisition may be acquired under this section without payment of the costs of relocation under section 117.52.\nIn a condemnation under this section, where the authority seeks title and possession under section 117.042, the time provided in that section must be extended by the court for a period, not to exceed 150 days, if reasonably required for the relocation of any ongoing railroad use at the time of the acquisition.\nNo property may be acquired under this section for use as a coal slurry pipeline or other related facility.",
	"repealed": false
}