{
	"id": "156.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/156.001",
	"title": "156.001 DEFINITIONS.",
	"text": "Except where the context otherwise indicates, for the purposes of this chapter, and acts amendatory thereof, the terms defined in this section have the meanings given them.\n\"Accredited or approved college of veterinary medicine\" means a veterinary college or division of a university or college that offers the degree of doctor of veterinary medicine or its equivalent and that conforms to the standards required for accreditation or approval by the American Veterinary Medical Association Council on Education.\n\"Animal\" does not include poultry.\n\"Board\" means the state Board of Veterinary Medicine.\n\"Compensation\" includes but is not limited to all fees, monetary rewards, discounts, and emoluments received directly or indirectly.\n\"Direct supervision\" means:\n(1) when a supervising veterinarian or licensed veterinary technician is in the immediate area and within audible or visual range of an animal and the unlicensed veterinary employee treating the animal;\n(2) the supervising veterinarian has met the requirements of a veterinarian-client-patient relationship under section 156.16, subdivision 12; and\n(3) the supervising veterinarian assumes responsibility for the professional care given to an animal by a person working under the veterinarian's direction.\n[See Note.]\n\"Educational commission for foreign veterinary graduates certificate\" or \"ECFVG certificate\" means a certificate issued by the American Veterinary Medical Association Education Commission for Foreign Veterinary Graduates, indicating that the holder has demonstrated knowledge and skill equivalent to that possessed by a graduate of an accredited or approved college of veterinary medicine.\n\"Firm\" includes a corporation, limited liability company, and limited liability partnership, wherever incorporated, organized, or registered.\n\"Foreign college of veterinary medicine\" means a college of veterinary medicine other than an accredited or approved college of veterinary medicine.\n\"Licensed veterinary technician\" means a person licensed by the board under section 156.077.\n[See Note.]\n\"Licensee\" means a person licensed to practice veterinary medicine in the state of Minnesota.\n\"Operation\" includes but is not limited to any act of cutting, scraping, or disturbing the intact body surface in any way, and any surgical or dental procedure, except as otherwise provided in this chapter.\n\"Practice of veterinary medicine\" has the meaning given by section 156.12.\nA \"Program for the Assessment of Veterinary Education Equivalence\" or \"PAVE\" certificate is issued by the American Association of Veterinary State Boards, indicating that the holder has demonstrated knowledge and skill equivalent to that possessed by a graduate of an accredited or approved college of veterinary medicine.\n\"Remote supervision\" means:\n(1) a veterinarian is not on the premises but is acquainted with the keeping and care of an animal by virtue of an examination of the animal or medically appropriate and timely visits to the premises where the animal is kept;\n(2) the veterinarian has given written or oral instructions to a licensed veterinary technician for ongoing care of an animal and is available by telephone or other form of immediate communication; and\n(3) the employee treating the animal timely enters into the animal's medical record documentation of the treatment provided and the documentation is reviewed by the veterinarian.\n[See Note.]\n\"Veterinary medicine\" includes veterinary surgery, obstetrics, pathology, radiology, dentistry, ophthalmology, cardiology, dermatology, laboratory animal medicine, and all other branches or specialties of veterinary medicine.\n\"Veterinary technology\" means the science and practice of providing professional support to veterinarians, including the direct supervision of unlicensed veterinary employees. Veterinary technology does not include veterinary diagnosis, prognosis, surgery, or medication prescription.\n[See Note.]",
	"repealed": false
}