{
	"id": "352.029",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.029",
	"title": "352.029 COVERAGE FOR EMPLOYEES OF LABOR ORGANIZATIONS.",
	"text": "Unless already specifically included under section 352.01, subdivision 2a, or unless specifically excluded under section 352.01, subdivision 2b, a state employee on leave of absence without pay to provide service as an employee or officer of a labor organization that is an exclusive bargaining agent representing state employees may elect under subdivision 2 to be covered by the general state employees retirement plan of the Minnesota State Retirement System for service with the labor organization, subject to the limitations set forth in subdivisions 2a and 2b.\nA person described in subdivision 1 is covered by the system if written election to be covered is delivered to the executive director within 90 days of being employed by the labor organization, or within 90 days of starting the first leave of absence with an exclusive bargaining agent, whichever is later.\n(a) The covered salary for a labor organization employee who is a member under section 352.01, subdivision 2a, paragraph (a), or who qualifies for membership under this section or section 352.75 is limited to the lesser of:\n(1) the employee's actual salary as defined under section 352.01, subdivision 13; or\n(2) 75 percent of the salary of the governor as set under section 15A.082.\n(b) The limited covered salary determined under this subdivision must be used in determining employee, employer, and employer additional contributions under section 352.04, subdivisions 2 and 3, and in determining retirement annuities and other benefits under this chapter and chapter 356.\nA retirement annuity is only payable, if the person has met any other applicable requirements, upon the termination of employment by the labor organization by the person who is a member under section 352.01, subdivision 2a, paragraph (a), or who elected coverage under subdivision 1. The reemployed annuitant earnings limitation set forth in section 352.115, subdivision 10, applies in the event that the person who is a member under section 352.01, subdivision 2a, paragraph (a), or who elected coverage under subdivision 1 retires and is subsequently reemployed while an annuitant by the labor organization or by any other entity employing persons who are covered by the Minnesota State Retirement System by virtue of that employment.\nThe employee and employer contributions required by section 352.04, or by section 352.92 for employees covered by section 352.91, are the obligation of the employee who is a member under section 352.01, subdivision 2a, paragraph (a), or who chooses coverage under this section. However, the employing labor organization may pay the employer contributions. Contributions made by the employee must be made by salary deduction. The employing labor organization shall pay all contributions to the system as required by section 352.04, or by section 352.92 for employees covered by section 352.91.\n[Repealed, 1992 c 432 art 1 s 11]\nEmployees of a labor organization who become members of the system under section 352.01, subdivision 2a, paragraph (a), or under this section are not eligible for election to the board of directors.",
	"repealed": false
}