{
	"id": "41A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.06",
	"title": "41A.06 PROJECT TAXES AND OTHER CHARGES.",
	"text": "The payments, taxes, and governmental charges described in this section which are received as a consequence of the undertaking, completion, and operation of each agricultural resource loan project for which a loan guaranty is made by the state are appropriated to the loan guaranty fund. This appropriation shall not lapse at the close of any fiscal year under the provisions of section 16A.28, and the receipts from the appropriation shall remain available as provided in section 41A.05, subdivision 1. The state is not obligated, however, to continue the appropriation with respect to charges not yet collected, except to the extent determined to be necessary for compliance with the terms of the loan guaranty agreement.\nReceipts of charges related to a particular project shall be deposited and recorded in its project account in the guaranty fund; but the board may reallocate receipts in any project account which cause the amount held in the account to exceed the minimum balance established initially pursuant to section 41A.04, subdivision 3, clause (2). The reallocation may be made to another project account for the purpose of maintaining the minimum balance in the account.\nGuaranty and commitment fees paid by borrowers pursuant to the loan guaranty provision required by section 41A.03, subdivision 3, clause (j), and repayments by borrowers of amounts advanced by the state under contracts referred to in section 41A.03, subdivision 4, shall be deposited in the project account for the borrower's project and shall not be disbursed or transferred for any purpose other than the fulfillment of the state's obligations under the loan guaranty for that project. Funds may be transferred out of the account if the minimum required balance in the project account is maintained and exceeds the aggregate amount of fees and payments previously received from the borrower plus interest received from the investment thereof.\nAll collections of the excise taxes imposed by chapter 297A upon retail sales, and upon the privilege of use, storage, or consumption in Minnesota, of personal property and services purchased for the construction or operation of any project for which a loan guaranty has been made or conditionally committed, less any refunds required by law and a proportionate share of the cost of administration and enforcement of the assessment and collection of the taxes, are appropriated and shall be deposited from the general fund into the project account in the guaranty fund at least once each year from and after the date of the conditional commitment. The commissioner of management and budget shall secure from each borrower the amount of taxes so imposed and from the commissioner of revenue the amount of refunds or costs to be deducted from them.\nIf tax increment financing is to be used for the project, the applicant for a loan guaranty or bonds for any project, and the county in which the project is situated, shall do all acts and things necessary for the computation and segregation of property tax increments resulting from the construction of the project in accordance with the provisions of section 469.149, and for the remittance to the commissioner of management and budget, for deposit in the loan guaranty fund, of all tax increments received from and after the date of the conditional commitment for the loan guaranty. If the project account contains an amount equal to the average annual payment of principal and interest on the bonds or for the guaranteed portion of a guaranteed loan, the board must annually return the excess tax increment to be distributed as provided by section 469.176, subdivision 2, clause (4), until the increment has been discharged under the agreement or section 469.149.",
	"repealed": false
}