{
	"id": "62I.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/62I.06",
	"title": "62I.06 POLICY FORMS; PREMIUM RATE.",
	"text": "The policies and contracts of coverage issued pursuant to this chapter shall contain the usual and customary provisions of similar insurance policies issued by private insurance companies. If a standard form is used in the private marketplace for any type of coverage that is to be extended by the association, then the association shall use that form. If there are varying types of forms used in the marketplace the association may choose to use a standard policy form issued by a service organization or other entity who commonly prepares standardized types of forms. If the board determines that neither of these alternatives is appropriate, then it shall adopt a policy form based upon the terms and conditions of the policies used for this type of coverage that are the most commonly used in the private market. As far as practical the board shall attempt to adopt forms that are consistent with the practice in the private market. No policy forms shall be used by the association unless it has been filed with the commissioner, and the commissioner may disapprove the form within 30 days if the commissioner determines that it is misleading, it violates public policy, or for any reason that the commissioner would be empowered to reject a similar form filed by a private company.\nIf the insured fails to pay a stabilization reserve fund charge the association may cancel the policy by mailing or delivering to the insured at the insured's address shown on the policy at least ten days' written notice stating the date that the cancellation is effective.\nThe rating plan, rating classification, and territories applicable to insurance written by the association and related statistics are subject to chapter 70A. Rates shall be on an actuarially sound basis. The commissioner shall take all appropriate steps to make available, upon request of the association, loss and expense experience of insurers previously writing or currently writing insurance of any type the association offers or intends to offer.\n[Repealed by amendment, 2017 c 34 s 4]\nThe commissioner may examine the business of the association as often as is appropriate to insure that the association is operating in a manner consistent with this chapter or other Minnesota laws. If it is found that the operation is deficient or inconsistent with this chapter or other Minnesota laws the commissioner may order the association to take corrective action.\nThe association shall certify to the commissioner the estimated amount of any deficit remaining after the stabilization reserve fund has been exhausted and any required deficit assessment. Within 60 days after the certification, the commissioner shall authorize the association to recover the members' respective shares of the deficit assessment by assessing all members an amount sufficient to fully fund the obligations of the association. The assessment of each member shall be determined in the manner provided in section 62I.07. An assessment made pursuant to this section shall be deductible by the member from premium taxes due the state as provided in section 297I.20, subdivision 2.\nIn addition to the usual manner of amending the rating plan set forth in this section and section 62I.06, the following procedure may also be used:\n(1) Any person may, by written petition served upon the commissioner of commerce request that a hearing be held to amend the rating plan, or any part of the rating plan.\n(2) The commissioner shall forward a copy of the petition to the chief administrative law judge within three business days of its receipt. The chief administrative law judge shall, within three business days of receipt of the copy of the petition or a request for hearing by the commissioner, set a hearing date, assign an administrative law judge to hear the matter, and notify the commissioner of the hearing date and the administrative law judge assigned to hear the matter. The hearing date must be set not less than 60 days nor more than 90 days from the date of receipt of the petition by the commissioner or the date of the commissioner's request for hearing if the commissioner is the person requesting a hearing.\n(3) The commissioner shall publish a notice of the hearing in the State Register at least 30 days before the hearing date. The notice should be similar to that used for rulemaking under the Administrative Procedure Act. Approval of the notice by the administrative law judge is not required.\n(4) The hearing and all matters which occur after the hearing are a contested case under chapter 14. Within 45 days from the commencement of the hearing and within 15 days of the completion of the hearing the administrative law judge shall submit a report to the commissioner of commerce. The parties, or the administrative law judge, if the parties cannot agree, shall adjust all time requirements under the contested case procedure to conform with the 45-day requirement.\n(5) The commissioner shall render a decision within ten business days of the receipt of the administrative law judge's report.\n(6) If all parties to the proceeding agree, any of the previous requirements may be waived or modified.\n(7) A petition for a hearing to amend the rating plan or any part of the rating plan received by the commissioner within 180 days of the date of the commissioner's decision in a prior proceeding to amend the rating plan is invalid and requires no action provided the petition involves the same rates as the previous hearing. If the petition involves matters in addition to those dealt with in the previous hearing, then the additional matters shall be treated as a separate petition for hearing and a hearing may be held on those matters.",
	"repealed": false
}