{
	"id": "609.066",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.066",
	"title": "609.066 AUTHORIZED USE OF DEADLY FORCE BY PEACE OFFICERS.",
	"text": "For the purposes of this section, \"deadly force\" means force which the actor uses with the purpose of causing, or which the actor should reasonably know creates a substantial risk of causing, death or great bodily harm. The intentional discharge of a firearm, other than a firearm loaded with less lethal munitions and used by a peace officer within the scope of official duties, in the direction of another person, or at a vehicle in which another person is believed to be, constitutes deadly force. \"Less lethal munitions\" means projectiles which are designed to stun, temporarily incapacitate, or cause temporary discomfort to a person. \"Peace officer\" has the meaning given in section 626.84, subdivision 1.\nThe legislature hereby finds and declares the following:\n(1) that the authority to use deadly force, conferred on peace officers by this section, is a critical responsibility that shall be exercised judiciously and with respect for human rights and dignity and for the sanctity of every human life. The legislature further finds and declares that every person has a right to be free from excessive use of force by officers acting under color of law;\n(2) as set forth below, it is the intent of the legislature that peace officers use deadly force only when necessary in defense of human life or to prevent great bodily harm. In determining whether deadly force is necessary, officers shall evaluate each situation in light of the particular circumstances of each case;\n(3) that the decision by a peace officer to use deadly force shall be evaluated from the perspective of a reasonable officer in the same situation, based on the totality of the circumstances known to or perceived by the officer at the time, rather than with the benefit of hindsight, and that the totality of the circumstances shall account for occasions when officers may be forced to make quick judgments about using deadly force; and\n(4) that peace officers should exercise special care when interacting with individuals with known physical, mental health, developmental, or intellectual disabilities as an individual's disability may affect the individual's ability to understand or comply with commands from peace officers.\n(a) Notwithstanding the provisions of section 609.06 or 609.065, the use of deadly force by a peace officer in the line of duty is justified only if an objectively reasonable officer would believe, based on the totality of the circumstances known to the officer at the time and without the benefit of hindsight, that such force is necessary:\n(1) to protect the peace officer or another from death or great bodily harm, provided that the threat:\n(i) can be articulated with specificity;\n(ii) is reasonably likely to occur absent action by the law enforcement officer; and\n(iii) must be addressed through the use of deadly force without unreasonable delay; or\n(2) to effect the arrest or capture, or prevent the escape, of a person whom the peace officer knows or has reasonable grounds to believe has committed or attempted to commit a felony and the officer reasonably believes that the person will cause death or great bodily harm to another person under the threat criteria in clause (1), items (i) to (iii), unless immediately apprehended.\n(b) A peace officer shall not use deadly force against a person based on the danger the person poses to self if an objectively reasonable officer would believe, based on the totality of the circumstances known to the officer at the time and without the benefit of hindsight, that the person does not pose a threat of death or great bodily harm to the peace officer or to another under the threat criteria in paragraph (a), clause (1), items (i) to (iii).\nThis section and sections 609.06, 609.065 and 629.33 may not be used as a defense in a civil action brought by an innocent third party.",
	"repealed": false
}