{
	"id": "256B.0924",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0924",
	"title": "256B.0924 TARGETED CASE MANAGEMENT SERVICES.",
	"text": "The state recognizes that targeted case management services can decrease the need for more costly services such as multiple emergency room visits or hospitalizations by linking eligible individuals with less costly services available in the community.\nFor purposes of this section, the following terms have the meanings given:\n(a) \"Targeted case management\" means services which will assist medical assistance eligible persons to gain access to needed medical, social, educational, and other services. Targeted case management does not include therapy, treatment, legal, or outreach services.\n(b) \"Targeted case management for adults\" means activities that coordinate and link social and other services designed to help eligible persons gain access to needed protective services, social, health care, mental health, habilitative, educational, vocational, recreational, advocacy, legal, chemical, health, and other related services.\nPersons are eligible to receive targeted case management services under this section if the requirements in paragraphs (a) and (b) are met.\n(a) The person must be assessed and determined by the local county agency to:\n(1) be age 18 or older;\n(2) be receiving medical assistance;\n(3) have significant functional limitations; and\n(4) be in need of service coordination to attain or maintain living in an integrated community setting.\n(b) The person must be a vulnerable adult in need of adult protection as defined in section 626.5572, or is an adult with a developmental disability as defined in section 252A.02, subdivision 2, or a related condition as defined in section 256B.02, subdivision 11, and is not receiving home and community-based waiver services, or is an adult who lacks a permanent residence and who has been without a permanent residence for at least one year or on at least four occasions in the last three years.\n(a) For persons with developmental disabilities, targeted case management services must meet the provisions of section 256B.092.\n(b) For persons not eligible as a person with a developmental disability, targeted case management service activities include:\n(1) an assessment of the person's need for targeted case management services;\n(2) the development of a written personal service plan;\n(3) a regular review and revision of the written personal service plan with the recipient and the recipient's legal representative, and others as identified by the recipient, to ensure access to necessary services and supports identified in the plan;\n(4) effective communication with the recipient and the recipient's legal representative and others identified by the recipient;\n(5) coordination of referrals for needed services with qualified providers;\n(6) coordination and monitoring of the overall service delivery to ensure the quality and effectiveness of services;\n(7) assistance to the recipient and the recipient's legal representative to help make an informed choice of services;\n(8) advocating on behalf of the recipient when service barriers are encountered or referring the recipient and the recipient's legal representative to an independent advocate;\n(9) monitoring and evaluating services identified in the personal service plan to ensure personal outcomes are met and to ensure satisfaction with services and service delivery;\n(10) conducting face-to-face monitoring with the recipient at least twice a year;\n(11) completing and maintaining necessary documentation that supports and verifies the activities in this section;\n(12) coordinating with the medical assistance facility discharge planner prior to the recipient's discharge into the community; and\n(13) a personal service plan developed and reviewed at least annually with the recipient and the recipient's legal representative. The personal service plan must be revised when there is a change in the recipient's status. The personal service plan must identify:\n(i) the desired personal short and long-term outcomes;\n(ii) the recipient's preferences for services and supports, including development of a person-centered plan if requested; and\n(iii) formal and informal services and supports based on areas of assessment, such as: social, health, mental health, residence, family, educational and vocational, safety, legal, self-determination, financial, and chemical health as determined by the recipient and the recipient's legal representative and the recipient's support network.\n(a) Subject to federal approval, contact made for targeted case management by interactive video shall be eligible for payment under subdivision 6 if:\n(1) the person receiving targeted case management services is residing in:\n(i) a hospital;\n(ii) a nursing facility; or\n(iii) a residential setting licensed under chapter 245A or 245D or a boarding and lodging establishment or lodging establishment that provides supportive services or health supervision services according to section 157.17 that is staffed 24 hours a day, seven days a week;\n(2) interactive video is in the best interests of the person and is deemed appropriate by the person receiving targeted case management or the person's legal guardian, the case management provider, and the provider operating the setting where the person is residing;\n(3) the use of interactive video is approved as part of the person's written personal service or case plan; and\n(4) interactive video is used for up to, but not more than, 50 percent of the minimum required face-to-face contact.\n(b) The person receiving targeted case management or the person's legal guardian has the right to choose and consent to the use of interactive video under this subdivision and has the right to refuse the use of interactive video at any time.\n(c) The commissioner shall establish criteria that a targeted case management provider must attest to in order to demonstrate the safety or efficacy of delivering the service via interactive video. The attestation may include that the case management provider has:\n(1) written policies and procedures specific to interactive video services that are regularly reviewed and updated;\n(2) policies and procedures that adequately address client safety before, during, and after the interactive video services are rendered;\n(3) established protocols addressing how and when to discontinue interactive video services; and\n(4) established a quality assurance process related to interactive video services.\n(d) As a condition of payment, the targeted case management provider must document the following for each occurrence of targeted case management provided by interactive video:\n(1) the time the service began and the time the service ended, including an a.m. and p.m. designation;\n(2) the basis for determining that interactive video is an appropriate and effective means for delivering the service to the person receiving case management services;\n(3) the mode of transmission of the interactive video services and records evidencing that a particular mode of transmission was utilized;\n(4) the location of the originating site and the distant site; and\n(5) compliance with the criteria attested to by the targeted case management provider as provided in paragraph (c).\nCounty boards or providers who contract with the county are eligible to receive medical assistance reimbursement for adult targeted case management services. To qualify as a provider of targeted case management services the vendor must:\n(1) have demonstrated the capacity and experience to provide the activities of case management services defined in subdivision 4;\n(2) be able to coordinate and link community resources needed by the recipient;\n(3) have the administrative capacity and experience to serve the eligible population in providing services and to ensure quality of services under state and federal requirements;\n(4) have a financial management system that provides accurate documentation of services and costs under state and federal requirements;\n(5) have the capacity to document and maintain individual case records complying with state and federal requirements;\n(6) coordinate with county social service agencies responsible for planning for community social services under chapters 256E and 256F; conducting adult protective investigations under section 626.557, and conducting prepetition screenings for commitments under section 253B.07;\n(7) coordinate with health care providers to ensure access to necessary health care services;\n(8) have a procedure in place that notifies the recipient and the recipient's legal representative of any conflict of interest if the contracted targeted case management service provider also provides the recipient's services and supports and provides information on all potential conflicts of interest and obtains the recipient's informed consent and provides the recipient with alternatives; and\n(9) have demonstrated the capacity to achieve the following performance outcomes: access, quality, and consumer satisfaction.\n(a) Medical assistance and MinnesotaCare payment for targeted case management shall be made on a monthly basis. In order to receive payment for an eligible adult, the provider must document at least one contact per month and not more than two consecutive months without a face-to-face contact either in person or by interactive video that meets the requirements in section 256B.0625, subdivision 20b, with the adult or the adult's legal representative, family, primary caregiver, or other relevant persons identified as necessary to the development or implementation of the goals of the personal service plan.\n(b) Payment for targeted case management provided by county staff under this subdivision shall be based on the monthly rate methodology under section 256B.094, subdivision 6, paragraph (b), calculated as one combined average rate together with adult mental health case management under section 256B.0625, subdivision 20, except for calendar year 2002. In calendar year 2002, the rate for case management under this section shall be the same as the rate for adult mental health case management in effect as of December 31, 2001. Billing and payment must identify the recipient's primary population group to allow tracking of revenues.\n(c) Payment for targeted case management provided by county-contracted vendors shall be based on a monthly rate calculated in accordance with section 256B.076, subdivision 2. The rate must not exceed the rate charged by the vendor for the same service to other payers. If the service is provided by a team of contracted vendors, the team shall determine how to distribute the rate among its members. No reimbursement received by contracted vendors shall be returned to the county, except to reimburse the county for advance funding provided by the county to the vendor.\n(d) If the service is provided by a team that includes contracted vendors and county staff, the costs for county staff participation on the team shall be included in the rate for county-provided services. In this case, the contracted vendor and the county may each receive separate payment for services provided by each entity in the same month. In order to prevent duplication of services, the county must document, in the recipient's file, the need for team targeted case management and a description of the different roles of the team members.\n(e) Notwithstanding section 256B.19, subdivision 1, the nonfederal share of costs for targeted case management shall be provided by the recipient's county of responsibility, as defined in sections 256G.01 to 256G.12, from sources other than federal funds or funds used to match other federal funds.\n(f) The commissioner may suspend, reduce, or terminate reimbursement to a provider that does not meet the reporting or other requirements of this section. The county of responsibility, as defined in sections 256G.01 to 256G.12, is responsible for any federal disallowances. The county may share this responsibility with its contracted vendors.\n(g) The commissioner shall set aside five percent of the federal funds received under this section for use in reimbursing the state for costs of developing and implementing this section.\n(h) Payments to counties for targeted case management expenditures under this section shall only be made from federal earnings from services provided under this section. Payments to contracted vendors shall include both the federal earnings and the county share.\n(i) Notwithstanding section 256B.041, county payments for the cost of case management services provided by county staff shall not be made to the commissioner of management and budget. For the purposes of targeted case management services provided by county staff under this section, the centralized disbursement of payments to counties under section 256B.041 consists only of federal earnings from services provided under this section.\n(j) If the recipient is a resident of a nursing facility, intermediate care facility, or hospital, and the recipient's institutional care is paid by medical assistance, payment for targeted case management services under this subdivision is limited to the lesser of:\n(1) the last 180 days of the recipient's residency in that facility; or\n(2) the limits and conditions which apply to federal Medicaid funding for this service.\n(k) Payment for targeted case management services under this subdivision shall not duplicate payments made under other program authorities for the same purpose.\n(l) Any growth in targeted case management services and cost increases under this section shall be the responsibility of the counties.\nThe commissioner of human services in consultation with county boards shall establish a program to accomplish the provisions of subdivisions 1 to 6. The commissioner in consultation with county boards shall establish performance measures to evaluate the effectiveness of the targeted case management services. If a county fails to meet agreed-upon performance measures, the commissioner may authorize contracted providers other than the county. Providers contracted by the commissioner shall also be subject to the standards in subdivision 6.",
	"repealed": false
}