{
	"id": "18.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.83",
	"title": "18.83 CONTROL; ERADICATION; NOTICES; EXPENSES.",
	"text": "A general notice for noxious weed control or eradication must be published on or before May 15 of each year. Failure of the county agricultural weed inspector or county-designated employee to publish the general notice does not relieve a person from the necessity of full compliance with sections 18.76 to 18.91 and related rules. The published notice is legal and sufficient notice when an individual notice cannot be served.\nAn inspector or county-designated employee may find it necessary to secure more prompt or definite control or eradication of noxious weeds than is accomplished by the published general notice. In these special or individual instances, involving one or a limited number of persons, the inspector or county-designated employee having jurisdiction shall serve individual notices in writing upon the person who owns the land and the person who occupies the land, or the person responsible for or charged with the maintenance of public land, giving specific instructions on when and how named noxious weeds are to be controlled or eradicated. Individual notices provided for in this section must be served in the same manner as a summons in a civil action in the district court or by certified mail. Service on a person living temporarily or permanently outside of the inspector's or county-designated employee's jurisdiction may be made by sending the notice by certified mail to the last known address of the person, to be ascertained, if necessary, from the last tax list in the county treasurer's office.\n(1) A recipient of an individual notice may appeal, in writing, the order for control or eradication of noxious weeds. This appeal must be filed with a member of the appeal committee in the county where the land is located within two working days of the time the notice is received. The committee must inspect the land specified in the notice and report back to the recipient and the inspector or county-designated employee who issued the notice within five working days, either agreeing, disagreeing, or revising the order. The decision may be appealed in district court. If the committee agrees or revises the order, the control or eradication specified in the order, as approved or revised by the committee, may be carried out.\n(2) The county board shall appoint members of the appeal committee. The membership must include a county commissioner or municipal official and a landowner residing in the county. The expenses of the members may be reimbursed by the county upon submission of an itemized statement to the county auditor. At its option, the county board, by resolution, may delegate the duties of the appeal committee to its board of adjustment established pursuant to section 394.27. When carrying out the duties of the appeal committee, the zoning board of adjustment shall comply with all of the procedural requirements of this section.\nIf a person does not comply with an individual notice served on the person or an individual notice cannot be served, the inspector or county-designated employee having jurisdiction shall have the noxious weeds controlled or eradicated within the time and in the manner the inspector or county-designated employee designates.\nAn inspector or county-designated employee may consider it necessary to control or eradicate noxious weeds along with all or a part of a growing crop to prevent the maturation and spread of noxious weeds within the inspector's or county-designated employee's jurisdiction. If this situation exists, the inspector or county-designated employee may have the noxious weeds controlled or eradicated together with the crop after the appeal committee has reviewed the matter as outlined in subdivision 3 and reported back agreement with the order.\nThe inspector or county-designated employee may hire a person to control or eradicate noxious weeds if the person who owns the land, the person who occupies the land, or the person responsible for the maintenance of public land has failed to comply with an individual notice or with the published general notice when an individual notice cannot be served. The person hired must have authorization, in writing, from the inspector or county-designated employee to enter upon the land.\nA claim for the expense of controlling or eradicating noxious weeds, which may include the costs of serving notices, is a legal charge against the county in which the land is located. The officers having the work done must file with the county auditor a verified and itemized statement of cost for all services rendered on each separate tract or lot of land. The county auditor shall immediately issue proper warrants to the persons named on the statement as having rendered services. To reimburse the county for its expenditure in this regard, the county auditor shall certify the total amount due and, unless an appeal is made in accordance with section 18.84, enter it on the tax roll as a tax upon the land and it must be collected as other real estate taxes are collected.\nIf public land is involved, the amount due must be paid from funds provided for maintenance of the land or from the general revenue or operating fund of the agency responsible for the land. Each claim for control or eradication of noxious weeds on public lands must first be approved by the commissioner of agriculture.",
	"repealed": false
}