{
	"id": "123B.44",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.44",
	"title": "123B.44 PROVISION OF PUPIL SUPPORT SERVICES.",
	"text": "The commissioner of education shall promulgate rules under the provisions of chapter 14 requiring each district or other intermediary service area: (a) to provide each year upon formal request by a specific date by or on behalf of a nonpublic school pupil enrolled in a nonpublic school located in that district or area, the same specific health services as are provided for public school pupils by the district where the nonpublic school is located; and (b) to provide each year upon formal request by a specific date by or on behalf of a nonpublic school secondary pupil enrolled in a nonpublic school located in that district or area, the same specific guidance and counseling services as are provided for public school secondary pupils by the district where the nonpublic school is located. The district where the nonpublic school is located must provide the necessary transportation within the district boundaries between the nonpublic school and a public school or neutral site for nonpublic school pupils who are provided pupil support services under this section if the district elects to provide pupil support services at a site other than the nonpublic school. Each request for pupil support services must set forth the guidance and counseling or health services requested by or on behalf of all eligible nonpublic school pupils enrolled in a given nonpublic school. No district or intermediary service area must not expend an amount for these pupil support services which exceeds the amount allotted to it under this section.\nHealth and guidance and counseling services may be provided to nonpublic school pupils under this section at a public school, a neutral site, the nonpublic school or any other suitable location. District or intermediary service area personnel and representatives of the nonpublic school pupils receiving pupil support services must hold an annual consultation regarding the type of services, provider of services, and the location of the provision of these services. The district board or intermediary service area governing board must make the final decision on the location of the provision of these services.\nGuidance and counseling services provided to nonpublic school pupils pursuant to this section shall not include the planning or selection of particular courses or classroom activities of the nonpublic school.\nEach school year the commissioner shall allot to the school districts or other intermediary service areas for the provision of health services pursuant to this section the actual cost of the services provided for the pupils in each respective nonpublic school for that school year. The allotment must not exceed the average expenditure per public school pupil for these services by those Minnesota public elementary and secondary schools which provide health services to public school pupils, multiplied by the number of pupils in that particular nonpublic school who request these health services and who are enrolled as of September 15 of the current school year.\nEach school year the commissioner shall allot to the school districts or intermediary service areas for the provision of guidance and counseling services pursuant to this section the actual cost of the services provided for the pupils in each respective nonpublic school for that school year. The allotment for guidance and counseling services for the secondary pupils in each nonpublic school must not exceed the average expenditure per public school secondary pupil for these services by those Minnesota public schools which provide these services to their secondary pupils, multiplied by the number of secondary pupils in that particular nonpublic school who request these services and who are enrolled as of September 15 of the current school year.\nFor purposes of computing maximum allotments for each school year pursuant to this section, the average public school expenditure per pupil for health services and the average public school expenditure per secondary pupil for guidance and counseling services shall be computed and established by the department by February 1 of the preceding school year from the most recent public school year data then available.",
	"repealed": false
}