{
	"id": "62Q.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.52",
	"title": "62Q.52 DIRECT ACCESS TO OBSTETRIC AND GYNECOLOGIC SERVICES.",
	"text": "(a) Health plan companies shall allow female enrollees direct access to providers who specialize in obstetrics and gynecology for the following services:\n(1) evaluation and necessary treatment for obstetric conditions or emergencies;\n(2) maternity care; and\n(3) evaluation and necessary treatment for gynecologic conditions or emergencies, including annual preventive health examinations.\n(b) For purposes of this section, \"direct access\" means that a female enrollee may obtain the obstetric and gynecologic services specified in paragraph (a) from providers who specialize in obstetrics and gynecology in the enrollee's network without a referral from, or prior approval through a primary care provider, another physician, the health plan company, or its representatives.\n(c) The health plan company shall treat the provision of obstetrical and gynecological care and the ordering of related obstetrical and gynecological items and services, pursuant to paragraph (a), by a participating health care provider who specializes in obstetrics or gynecology as the authorization of a primary care provider.\n(d) The health plan company may require the health care provider to agree to otherwise adhere to the health plan company's policies and procedures, including procedures for obtaining prior authorization and for providing services in accordance with a treatment plan, if any, approved by the health plan company.\n(e) Health plan companies shall not require higher co-payments, coinsurance, deductibles, or other enrollee cost-sharing for direct access.\n(f) This section applies only to services described in paragraph (a) that are covered by the enrollee's coverage, but coverage of a preventive health examination for female enrollees must not exclude coverage of a gynecologic examination.\n(g) For purposes of this section, a health care provider who specializes in obstetrics or gynecology means any individual, including an individual other than a physician, who is authorized under state law to provide obstetrical or gynecological care.\n(h) This section does not:\n(1) waive any exclusions of coverage under the terms and conditions of the health plan with respect to coverage of obstetrical or gynecological care; or\n(2) preclude the health plan company from requiring that the participating health care provider providing obstetrical or gynecological care notify the primary care provider or the health plan company of treatment decisions.\nA health plan company shall provide notice to enrollees of the provisions of subdivision 1 in accordance with the requirements of the Affordable Care Act.\nThe commissioner of health shall enforce this section.",
	"repealed": false
}