{
	"id": "545.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/545.05",
	"title": "545.05 EXPEDITED PROCESS TO REVIEW AND DETERMINE THE EFFECTIVENESS OF FINANCING STATEMENTS.",
	"text": "(a) As used in this section, a financing statement or other record filed in the manner provided by sections 336.9-501 to 336.9-531 of the Uniform Commercial Code - Secured Transactions to perfect a security interest is fraudulent or otherwise improper if it is filed without the authorization of the obligor, person named as debtor, or owner of collateral described or indicated in the financing statement or other record, or by consent of an agent, fiduciary, or other representative of that person or without the consent of the secured party of record in the case of an amendment or termination.\n(b) All other financing statements filed in the manner provided by sections 336.9-501 to 336.9-531 to perfect agricultural liens or for purposes outside of the Uniform Commercial Code - Secured Transactions are also fraudulent or otherwise improper and subject to this section if there is no statutory or other legal authority therefor.\n(c) As used in this section, filing office or filing officer refers to the office or officer where a financing statement or other record is appropriately filed or recorded as provided by law, including, but not limited to, the county recorder, the secretary of state, and other related filing officers.\nAn obligor, person named as a debtor, or owner of collateral described or indicated in a financing statement or other record filed in the manner provided by sections 336.9-501 to 336.9-531, who has reason to believe that the financing statement or other record is fraudulent or otherwise improper may complete and file at any time a motion for judicial review of the effectiveness of the financing statement or other record. A secured party of record who believes that an amendment or termination of a financing statement or other record is fraudulent or otherwise improper may also file a motion.\n(a) The motion under subdivision 2 must be mailed by certified United States mail to the person who is indicated as the secured party on the allegedly fraudulent or improper record at the address listed on the record or, in the case of a filing by the secured party of record, to the address of the person who filed the amendment or termination in question, as listed on the record. The motion must be accompanied by a copy of the record in question, an affidavit of mailing, the form for responding to the motion under subdivision 6, and a copy of the text of this section.\n(b) On the day the motion is mailed, a copy of the materials must be filed with the district court of the county in which the financing statement or other record has been filed or in the county of residence of the moving party. The motion must be supported by the affidavit of the moving party or the moving party's attorney setting forth a concise statement of the facts upon which the claim for relief is based. There is no filing fee for a motion or a response filed under this section.\nThe motion must be in substantially the following form:\nIn Re: A Purported Financing Statement in the district court of ............. County, Minnesota, Against [Name of person who filed the financing statement]\nMOTION FOR JUDICIAL REVIEW OF A FINANCING STATEMENT FILED UNDER THE UNIFORM COMMERCIAL CODE - SECURED TRANSACTIONS\n.................................... (name of moving party) files this motion requesting a judicial determination of the effectiveness of a financing statement or other record filed in the manner provided by sections 336.9-501 to 336.9-531 of the Uniform Commercial Code - Secured Transactions in the office of the ............... (filing office and location) and in support of the motion provides as follows:\nI.\n................. (name), the moving party, is the [obligor, person named as a debtor, or owner of collateral described or indicated in] [secured party of record listed in] a financing statement or other record filed in the manner provided in sections 336.9-501 to 336.9-531 of the Uniform Commercial Code.\nII.\nOn ............. (date), in the exercise of the filing officer's official duties as .................. (filing officer's position), the filing officer received and filed or recorded the financing statement or other record, a copy which is attached, that purports to [perfect a security interest or agricultural lien against the obligor, person named as debtor, or the owner of collateral described or indicated in the financing statement or other record] [amend or terminate the financing statement in which the moving party is listed as the secured party of record] [be for a purpose outside of the Uniform Commercial Code - Secured Transactions].\nIII.\nThe moving party alleges that the financing statement or other record is fraudulent or otherwise improper and that this court should declare the financing statement or other record ineffective.\nIV.\nThe moving party attests that the assertions in this motion are true and correct.\nV.\nThe moving party does not request the court to make a finding as to any underlying claim of the parties involved. The moving party further acknowledges that the moving party may be subject to sanctions if this motion is determined to be frivolous. The moving party may be contacted by the respondent at:\nMailing Address: (required)\nTelephone Number:\nFacsimile Number: (either facsimile or email contact is required)\nEmail Address: (either facsimile or email contact is required)\nREQUEST FOR RELIEF\nThe moving party requests the court to review the attached documentation and enter an order finding that the financing statement or other record is ineffective together with other findings as the court deems appropriate.\nRespectfully submitted, .......................... (Signature and typed name and address).\nThe form for the certificate of acknowledgment must be substantially as follows:\nAFFIDAVIT\nTHE STATE OF MINNESOTA COUNTY OF .......\nBEFORE ME, the undersigned authority, personally appeared ........., who, being by me duly sworn, deposed as follows:\n\"My name is ............... I am over 18 years of age, of sound mind, with personal knowledge of the following facts, and fully competent to testify.\nI attest that the assertions contained in the accompanying motion are true and correct.\"\nSUBSCRIBED and SWORN TO before me, this ..... day of ..................\nNOTARY PUBLIC, State of [state name]\nNotary's printed name: .........................\nMy commission expires: .........................\nThe motion must be supported by the affidavit of the moving party or the moving party's attorney setting forth a concise statement of the facts upon which the claim for relief is based.\nThe moving party shall complete an affidavit of mailing the motion to the court and to the respondent in substantially the following form:\nState of Minnesota\nCounty of ..........\n............................, the moving party, being duly sworn, on oath, deposes and says that on the ..... day of .........., ......., the moving party mailed the motion to the court and the respondent by placing a true and correct copy of the motion in an envelope addressed to them as shown by certified United States mail at ............................, Minnesota.\nSubscribed and sworn to before me this ..... day of ...................., .......\nThe person listed as [the secured party in] [filing] the record for which the moving party has requested review may respond to the motion and accompanying materials to request an actual hearing within 20 days from the mailing by certified United States mail by the moving party. The form for use by the person listed as [the secured party in] [filing] the record in question to respond to the motion for judicial review must be in substantially the following form:\nIn Re: A Purported Financing Statement in the district court of ............. County, Minnesota, Against [Name of person who filed the financing statement]\nRESPONSE TO MOTION FOR JUDICIAL REVIEW OF A FINANCING STATEMENT FILED UNDER THE UNIFORM COMMERCIAL CODE - SECURED TRANSACTIONS\n............................ (name) files this response to a motion requesting a judicial determination of the effectiveness of a financing statement or other record filed in the manner provided by sections 336.9-501 to 336.9-531 of the Uniform Commercial Code - Secured Transactions in the office of the ............... (filing office and location) and in support of the motion provides as follows:\nI.\n................. (name), the respondent, is the person listed as [the secured party in] [filing] the record for which review has been requested by the moving party.\nII.\nOn ............. (date), in the exercise of the filing officer's official duties as .................. (filing officer's position), the filing officer received and filed or recorded the financing statement or other record, a copy which is attached, that purports to [perfect a security interest or agricultural lien against] [amend or terminate a record filed by] [be for a purpose outside of the Uniform Commercial Code - Secured Transactions as to] the moving party.\nIII.\nRespondent states that the financing statement or other record is not fraudulent or otherwise improper and that this court should not declare the financing statement or other record ineffective.\nIV.\nRespondent attests that assertions in this response are true and correct.\nV.\nRespondent does not request the court to make a finding as to any underlying claim of the parties involved. Respondent further acknowledges that respondent may be subject to sanctions if this response is determined to be frivolous.\nREQUEST FOR RELIEF\nRespondent requests the court to review the attached documentation, to set a hearing for no later than five days after the date of this response or as soon after that as the court shall order and to enter an order finding that the financing statement or other record is not ineffective together with other findings as the court deems appropriate. Respondent may be contacted at:\nMailing Address: (required)\nTelephone Number:\nFacsimile Number: (either facsimile or email contact is required)\nEmail Address: (either facsimile or email contact is required)\nRespectfully submitted, .........................\n(Signature and typed name and address).\nThe form for the certificate of acknowledgment must be substantially as follows:\nAFFIDAVIT\nTHE STATE OF MINNESOTA COUNTY OF .......\nBEFORE ME, the undersigned authority, personally appeared ........., who, being by me duly sworn, deposed as follows:\n\"My name is ............... I am over 18 years of age, of sound mind, with personal knowledge of the following facts, and fully competent to testify.\nI attest that the assertions contained in the accompanying motion are true and correct.\"\nSUBSCRIBED and SWORN TO before me, this ..... day of ..................\nNOTARY PUBLIC, State of [state name]\nNotary's printed name: .........................\nMy commission expires: .........................\nRespondent shall submit the response by United States mail to both the court and the moving party, and also by either email or facsimile as provided by the moving party. The respondent shall complete an affidavit of mailing the response to the court and to the moving party in substantially the following form:\nState of Minnesota\nCounty of ..........\n............................, being the responding party, being duly sworn, on oath, deposes and says that on the ..... day of .........., ......., respondent mailed the response to court and the moving party by placing a true and correct copy of the response in an envelope addressed to them as shown depositing the same with postage prepaid, in the United States Mail at ............................, Minnesota.\nSubscribed and sworn to before me this ..... day of ...................., .......\n(a) If a hearing is timely requested, the court shall hold that hearing within five days after the mailing of the response by the respondent or as soon after that as ordered by the court. After the hearing, the court shall enter appropriate findings of fact and conclusions of law regarding the financing statement or other record filed in the manner provided by sections 336.9-501 to 336.9-531 of the Uniform Commercial Code.\n(b) If a hearing request under subdivision 7 is not received by the court by the 20th day following the mailing of the original motion, the court's finding may be made solely on a review of the documentation attached to the motion and without hearing any testimonial evidence. After that review, which must be conducted no later than five days after the 20-day period has expired, the court shall enter appropriate findings of fact and conclusions of law as provided in subdivision 11 regarding the financing statement or other record filed in the manner provided by sections 336.9-501 to 336.9-531 of the Uniform Commercial Code.\n(c) A copy of the findings of fact and conclusions of law must be sent to the moving party, the respondent, and the person who filed the financing statement or other record at the address listed in the motion or response of each person within seven days of the date that the findings of fact and conclusions of law are issued by the court.\n(d) In all cases, the moving party shall file or record an attested copy of the findings of fact and conclusions of law in the filing office in the appropriate class of records in which the original financing statement or other record was filed or recorded. The filing officer shall not collect a filing fee for filing a court's finding of fact and conclusion of law as provided in this section except as specifically directed by the court in its findings and conclusions.\nThe findings of fact and conclusion of law for an expedited review where no hearing has been requested must be in substantially the following form:\nMISCELLANEOUS DOCKET No. ...........\nIn Re: A Purported Financing Statement or Other Record in the district court of ........................... County, Minnesota, Against [Name of person who filed financing statement]\nJudicial Finding of Fact and Conclusion of Law Regarding a Financing Statement or Other Record Filed in the manner provided by sections 336.9-501 to 336.9-531 of the Uniform Commercial Code - Secured Transactions\nOn the (number) day of (month), (year), in the above entitled and numbered cause, this court reviewed a motion, verified by affidavit, of (name) and the documentation attached. The respondent did not respond within the required 20-day period. No testimony was taken from any party, nor was there any notice of the court's review, the court having made the determination that a decision could be made solely on review of the documentation as provided in Minnesota Statutes, section 545.05.\nThe court finds as follows (only an item or subitem checked and initialed is a valid court ruling):\n[..] The documentation attached to the motion IS filed or recorded with the authorization of the obligor, person named as debtor, or owner of collateral described or indicated in the financing statement or other record, or by consent of an agent, fiduciary, or other representative of that person, or with the authorization of the secured party of record in the case of an amendment or termination, and IS a legally valid financing statement or other record under the Uniform Commercial Code - Secured Transactions law of this state.\n[..] The documentation attached to the motion IS NOT filed or recorded with the authorization of the obligor, person named as debtor, or owner of collateral described or indicated in the documentation, or by consent of an agent, fiduciary, or other representative of that person, or with the authorization of the secured party of record in the case of an amendment or termination and, IS NOT a legally valid financing statement or other record under the Uniform Commercial Code - Secured Transactions law of this state.\n[..] The documentation attached to the motion IS filed to perfect an agricultural lien or for a purpose outside of the Uniform Commercial Code - Secured Transactions and there IS statutory or other legal authority therefor.\n[..] The documentation attached to the motion purports to perfect an agricultural lien or for a purpose outside of the Uniform Commercial Code - Secured Transactions, and there IS NOT statutory or other legal authority therefor.\n[..] This court makes no finding as to any underlying claims of the parties involved and expressly limits its findings of fact and conclusions of law to the review of a ministerial act. The filing officer shall remove the subject financing statement or other record so that the record is not reflected in or obtained as a result of any search, standard or otherwise, conducted of those records, but shall retain them and these findings of fact and conclusions of law in the filing office for the duration of the period for which they would have otherwise been filed.\nSIGNED ON THIS THE ...... DAY of .......\n............. District Judge\n............. District\n............. County, Minnesota\nIf a determination is made after a hearing, the court may award the prevailing party all costs related to the entire review, including, but not limited to, filing fees, attorney fees, administrative costs, and other costs.\nIf the moving party files a subsequent motion under this section against a person filing a financing statement or other record that is reviewed under this section and found to be legally valid under the Uniform Commercial Code - Secured Transactions law of this state or under other statutory or legal authority, the court may, in addition to assessing costs, order other equitable relief against the moving party or enter other sanctions against the moving party.\nThe chief judge of a district court may order that any or all proceedings under this section be conducted and heard by other judicial officers of that district court.",
	"repealed": false
}