{
	"id": "256B.0371",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0371",
	"title": "256B.0371 PERFORMANCE BENCHMARKS FOR DENTAL ACCESS; CONTINGENT DENTAL ADMINISTRATOR.",
	"text": "For coverage years 2022 to 2024, the commissioner shall establish a performance benchmark under which at least 55 percent of children and adults who were continuously enrolled for at least 11 months in either medical assistance or MinnesotaCare through a managed care or county-based purchasing plan received at least one dental visit during the coverage year.\nFor coverage years 2022 to 2024, if a managed care or county-based purchasing plan under contract with the commissioner to provide dental services under this chapter or chapter 256L has a rate of dental utilization that is ten percent or more below the performance benchmark specified in subdivision 1, the commissioner shall require the managed care or county-based purchasing plan to submit a corrective action plan to the commissioner describing how the entity intends to increase dental utilization to meet the performance benchmark. The managed care or county-based purchasing plan must:\n(1) provide a written corrective action plan to the commissioner for approval;\n(2) implement the plan; and\n(3) provide the commissioner with documentation of each corrective action taken.\n(a) The commissioner shall determine the extent to which managed care and county-based purchasing plans in the aggregate meet the performance benchmark specified in subdivision 1 for coverage year 2024. If managed care and county-based purchasing plans in the aggregate fail to meet the performance benchmark, the commissioner, after issuing a request for information followed by a request for proposals, shall contract with a dental administrator to administer dental services beginning January 1, 2026, for all recipients of medical assistance and MinnesotaCare, including persons served under fee-for-service and persons receiving services through managed care and county-based purchasing plans.\n(b) The dental administrator must provide administrative services, including but not limited to:\n(1) provider recruitment, contracting, and assistance;\n(2) recipient outreach and assistance;\n(3) utilization management and reviews of medical necessity for dental services;\n(4) dental claims processing;\n(5) coordination of dental care with other services;\n(6) management of fraud and abuse;\n(7) monitoring access to dental services;\n(8) performance measurement;\n(9) quality improvement and evaluation; and\n(10) management of third-party liability requirements.\n(c) Dental administrator payments to contracted dental providers must be at the rates established under sections 256B.76 and 256L.11.\n(d) Recipients must be given a choice of dental provider, including any provider who agrees to provider participation requirements and payment rates established by the commissioner and dental administrator. The dental administrator must comply with the network adequacy and geographic access requirements that apply to managed care and county-based purchasing plans for dental services under section 62K.14.\n(e) The contract with the dental administrator must include a provision that states that if the dental administrator fails to meet, by calendar year 2029, a performance benchmark under which at least 55 percent of children and adults who were continuously enrolled for at least 11 months in either medical assistance or MinnesotaCare received at least one dental visit during the calendar year, the contract must be terminated and the commissioner must enter into a contract with a new dental administrator as soon as practicable.\n(f) The commissioner shall implement this subdivision in consultation with representatives of providers who provide dental services to patients enrolled in medical assistance or MinnesotaCare, including but not limited to providers serving primarily low-income and socioeconomically complex populations, and with representatives of managed care plans and county-based purchasing plans.\n(a) The commissioner shall submit an annual report beginning March 15, 2022, and ending March 15, 2026, to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services policy and finance that includes the percentage for adults and children one through 20 years of age for the most recent complete calendar year receiving at least one dental visit for both fee-for-service and the prepaid medical assistance program. The report must include:\n(1) statewide utilization for both fee-for-service and for the prepaid medical assistance program;\n(2) utilization by county;\n(3) utilization by children receiving dental services through fee-for-service and through a managed care plan or county-based purchasing plan; and\n(4) utilization by adults receiving dental services through fee-for-service and through a managed care plan or county-based purchasing plan.\n(b) The report must also include a description of any corrective action plans required to be submitted under subdivision 2.\n(c) The initial report due on March 15, 2022, must include the utilization metrics described in paragraph (a) for each of the following calendar years: 2017, 2018, 2019, and 2020.\n(d) In the annual report due on March 15, 2023, and in each report due thereafter, the commissioner shall include the following:\n(1) the number of dentists enrolled with the commissioner as a medical assistance dental provider and the congressional district or districts in which the dentist provides services;\n(2) the number of enrolled dentists who provided fee-for-service dental services to medical assistance or MinnesotaCare patients within the previous calendar year in the following increments: one to nine patients, ten to 100 patients, and over 100 patients;\n(3) the number of enrolled dentists who provided dental services to medical assistance or MinnesotaCare patients through a managed care plan or county-based purchasing plan within the previous calendar year in the following increments: one to nine patients, ten to 100 patients, and over 100 patients; and\n(4) the number of dentists who provided dental services to a new patient who was enrolled in medical assistance or MinnesotaCare within the previous calendar year.\n(e) The report due on March 15, 2023, must include the metrics described in paragraph (d) for each of the following years: 2017, 2018, 2019, 2020, and 2021.",
	"repealed": false
}