{
	"id": "471.471",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.471",
	"title": "471.471 ACCESS REVIEW BOARD.",
	"text": "The Access Review Board consists of:\n(1) a representative of the Department of Labor and Industry, appointed by the commissioner of labor and industry;\n(2) a representative of the state fire marshal's office, appointed by the commissioner of public safety;\n(3) the commissioner of human rights or the commissioner's designee;\n(4) a representative of the elevator safety section, designated by the commissioner of labor and industry; and\n(5) the chair of the Council on Disability or the chair's designee.\nThe board shall elect a chair from among its members. Terms of members coincide with the terms of their appointing authorities or, in the case of ex officio members or their designees, with the terms of the offices by virtue of which they are members of the board. Compensation of members is governed by section 15.0575, subdivision 3.\nThe commissioner of labor and industry shall furnish staff, office space, and administrative support to the board. Staff assigned to the board must be knowledgeable with respect to access codes, site surveys, plan design, and product use and eligibility.\nThe board shall consider applications for waivers from the State Building Code to permit the installation of stairway chair lifts to provide limited accessibility for persons with disabilities to buildings in which the provision of access by means permitted under the State Building Code is not architecturally or financially possible. In considering applications, the board shall review other possible access options. The board may approve an application for installation of a stairway chair when the board determines that the installation would be appropriate and no other means of access is possible. In determining whether to approve an application, the board shall consider:\n(1) the need for limited accessibility when a higher degree of accessibility is not required by state or federal law or rule;\n(2) the architectural feasibility of providing a greater degree of accessibility than would be provided by the proposed device or equipment;\n(3) the total cost of the proposed device or equipment over its projected usable life, including installation, maintenance, and replacement costs;\n(4) the reliability of the proposed device or equipment;\n(5) the applicant's ability to comply with all recognized access and safety standards for installation and maintenance; and\n(6) whether the proposed device or equipment can be operated and used without reducing or compromising minimum safety standards.\nThe board shall consider the applicant's demonstrated inability to afford a greater degree of accessibility, but may not give greater weight to this factor than to the factors listed in clauses (1) to (6). The board may not approve an application unless the applicant guarantees that the device or equipment will be installed and operated in accordance with nationally recognized standards for such devices or equipment and agrees to obtain any permits needed from the agency responsible for enforcing those standards.\nA person seeking a waiver shall apply to the Department of Labor and Industry on a form prescribed by the board and pay a $70 fee to the construction code fund. The division shall review the application to determine whether it appears to be meritorious, using the standards set out in subdivision 3. The division shall forward applications it considers meritorious to the board, along with a list and summary of applications considered not to be meritorious. The board may require the division to forward to it an application the division has considered not to be meritorious. The board shall issue a decision on an application within 90 days of its receipt. A board decision to approve an application must be unanimous. An application that contains false or misleading information must be rejected.\nBoard members are immune from liability for personal injury or death resulting from the use or misuse of a device or equipment installed and operated under a waiver granted by the board.",
	"repealed": false
}