{
	"id": "151.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.01",
	"title": "151.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words, terms, and phrases, for the purposes of this chapter, shall be given the meanings subjoined to them.\n\"Pharmacy\" means a place of business in which prescription drugs are prepared, compounded, or dispensed by or under the supervision of a pharmacist and from which related clinical pharmacy services are delivered.\n\"Limited service pharmacy\" means a pharmacy that has been issued a restricted license by the board to perform a limited range of the activities that constitute the practice of pharmacy.\n\"Pharmacist\" means an individual with a currently valid license issued by the Board of Pharmacy to practice pharmacy.\n[Repealed, 1988 c 550 s 20]\n\"Drug\" means all medicinal substances and preparations recognized by the United States Pharmacopoeia and National Formulary, or any revision thereof; biological products, other than blood or blood components; all substances and preparations intended for external and internal use in the diagnosis, cure, mitigation, treatment, or prevention of disease in humans or other animals; and all substances and preparations, other than food, intended to affect the structure or any function of the bodies of humans or other animals. The term drug shall also mean any compound, substance, or derivative that is not approved for human consumption by the United States Food and Drug Administration or specifically permitted for human consumption under Minnesota law, and, when introduced into the body, induces an effect similar to that of a Schedule I or Schedule II controlled substance listed in section 152.02, subdivisions 2 and 3, or Minnesota Rules, parts 6800.4210 and 6800.4220, regardless of whether the substance is marketed for the purpose of human consumption.\n\"Medicine\" means any remedial agent that has the property of curing, preventing, treating, or mitigating diseases, or that is used for that purpose.\n\"Poisons\" means any substance that, when introduced into the system, directly or by absorption, produces violent, morbid, or fatal changes, or that destroys living tissue with which it comes in contact.\n\"Chemical\" means all medicinal or industrial substances, whether simple or compound, or obtained through the process of the science and art of chemistry, whether of organic or inorganic origin.\n\"Board\" or \"Board of Pharmacy\" means the Minnesota Board of Pharmacy.\n\"Director\" means the executive director of the Minnesota Board of Pharmacy.\n\"Person\" means an individual, firm, partnership, company, corporation, trustee, association, agency, or other public or private entity.\n\"Wholesale\" means and includes any sale for the purpose of resale.\n\"Commercial purposes\" means the ordinary purposes of trade, agriculture, industry, and commerce, exclusive of the practices of medicine, pharmacy, and other health care professions.\n\"Manufacturing\" means the production, preparation, propagation, conversion, or processing of a drug, either directly or indirectly, by extraction from substances of natural origin or independently by means of chemical or biological synthesis. Manufacturing includes the packaging or repackaging of a drug, or the labeling or relabeling of the container of a drug, for resale by pharmacies, practitioners, or other persons. Manufacturing does not include the prepackaging, extemporaneous compounding, or anticipatory compounding of a drug within a licensed pharmacy or by a practitioner, nor the labeling of a container within a pharmacy or by a practitioner for the purpose of dispensing a drug to a patient pursuant to a valid prescription.\n\"Manufacturer\" means any person engaged in manufacturing.\n\"Outsourcing facility\" means a facility that is registered by the United States Food and Drug Administration pursuant to United States Code, title 21, section 353b.\n\"Pharmacist intern\" means (1) a natural person satisfactorily progressing toward the degree in pharmacy required for licensure, or (2) a graduate of the University of Minnesota College of Pharmacy, or other pharmacy college approved by the board, who is registered by the Board of Pharmacy for the purpose of obtaining practical experience as a requirement for licensure as a pharmacist, or (3) a qualified applicant awaiting examination for licensure.\n\"Pharmacy technician\" means a person not licensed as a pharmacist or registered as a pharmacist intern, who has been trained in pharmacy tasks that do not require the professional judgment of a licensed pharmacist. A pharmacy technician may not perform tasks specifically reserved to a licensed pharmacist.\n\"Prescription drug order\" means a lawful written, oral, or electronic order of a practitioner for a drug for a specific patient. Prescription drug orders for controlled substances must be prepared in accordance with the provisions of section 152.11 and the federal Controlled Substances Act and the regulations promulgated thereunder.\n\"Prescription\" means a prescription drug order that is written or printed on paper, an oral order reduced to writing by a pharmacist, or an electronic order. To be valid, a prescription must be issued for an individual patient by a practitioner within the scope and usual course of the practitioner's practice, and must contain the date of issue, name and address of the patient, name and quantity of the drug prescribed, directions for use, the name and address of the practitioner, and a telephone number at which the practitioner can be reached. A prescription written or printed on paper that is given to the patient or an agent of the patient or that is transmitted by fax must contain the practitioner's manual signature. An electronic prescription must contain the practitioner's electronic signature.\n\"Chart order\" means a prescription drug order for a drug that is to be dispensed by a pharmacist, or by a pharmacist intern under the direct supervision of a pharmacist, and administered by an authorized person only during the patient's stay in a hospital or long-term care facility. The chart order shall contain the name of the patient, another patient identifier such as birth date or medical record number, the drug ordered, and any directions that the practitioner may prescribe concerning strength, dosage, frequency, and route of administration. The manual or electronic signature of the practitioner must be affixed to the chart order at the time it is written or at a later date in the case of verbal chart orders.\n\"Legend drug\" means a drug that is required by federal law to be dispensed only pursuant to the prescription of a licensed practitioner.\n\"Label\" means a display of written, printed, or graphic matter upon the immediate container of any drug or medicine. Any word, statement, or other information required by or under the authority of this chapter to appear on the label shall also appear on the outside container or wrapper, if any there be, of the retail package of such drug or medicine, or be easily legible through the outside container or wrapper.\n\"Package\" means any container or wrapping in which any drug or medicine is enclosed for use in the delivery or display of that article to retail purchasers, but does not include:\n(a) shipping containers or wrappings used solely for the transportation of any such article in bulk or in quantity to manufacturers, packers, processors, or wholesale or retail distributors;\n(b) shipping containers or outer wrappings used by retailers to ship or deliver any such article to retail customers if such containers and wrappings bear no printed matter pertaining to any particular drug or medicine.\n\"Labeling\" means all labels and other written, printed, or graphic matter (a) upon a drug or medicine or any of its containers or wrappers, or (b) accompanying such article.\n\"Federal act\" means the Federal Food, Drug, and Cosmetic Act, United States Code, title 21, section 301, et seq., as amended.\n\"Pharmacist in charge\" means a duly licensed pharmacist in the state of Minnesota who has been designated in accordance with the rules of the Board of Pharmacy to assume professional responsibility for the operation of the pharmacy in compliance with the requirements and duties as established by the board in its rules.\n\"Practitioner\" means a licensed doctor of medicine, licensed doctor of osteopathic medicine duly licensed to practice medicine, licensed doctor of dentistry, licensed doctor of optometry, licensed podiatrist, licensed veterinarian, licensed advanced practice registered nurse, or licensed physician assistant. For purposes of sections 151.15, subdivision 4; 151.211, subdivision 3; 151.252, subdivision 3; 151.37, subdivision 2, paragraph (b); and 151.461, \"practitioner\" also means a dental therapist authorized to dispense and administer under chapter 150A. For purposes of sections 151.252, subdivision 3, and 151.461, \"practitioner\" also means a pharmacist authorized to prescribe self-administered hormonal contraceptives, nicotine replacement medications, or opiate antagonists under section 151.37, subdivision 14, 15, or 16, or authorized to prescribe drugs to prevent the acquisition of human immunodeficiency virus (HIV) under section 151.37, subdivision 17.\n\"Brand name\" means the registered trademark name given to a drug product by its manufacturer, labeler or distributor.\n\"Generic name\" means the established name or official name of a drug or drug product.\n\"Finished dosage form\" means that form of a drug that is or is intended to be dispensed or administered to the patient and requires no further manufacturing or processing other than packaging, reconstitution, or labeling.\n\"Practice of pharmacy\" means:\n(1) interpretation and evaluation of prescription drug orders;\n(2) compounding, labeling, and dispensing drugs and devices (except labeling by a manufacturer or packager of nonprescription drugs or commercially packaged legend drugs and devices);\n(3) participation in clinical interpretations and monitoring of drug therapy for assurance of safe and effective use of drugs, including ordering and performing laboratory tests that are waived under the federal Clinical Laboratory Improvement Act of 1988, United States Code, title 42, section 263a et seq. A pharmacist may collect specimens, interpret results, notify the patient of results, and refer the patient to other health care providers for follow-up care and may initiate, modify, or discontinue drug therapy only pursuant to a protocol or collaborative practice agreement. A pharmacist may delegate the authority to administer tests under this clause to a pharmacy technician or pharmacy intern. A pharmacy technician or pharmacy intern may perform tests authorized under this clause if the technician or intern is working under the direct supervision of a pharmacist;\n(4) participation in drug and therapeutic device selection; drug administration for first dosage and medical emergencies; intramuscular and subcutaneous drug administration under a prescription drug order; drug regimen reviews; and drug or drug-related research;\n(5) drug administration, through intramuscular and subcutaneous administration used to treat mental illnesses as permitted under the following conditions:\n(i) upon the order of a prescriber and the prescriber is notified after administration is complete; or\n(ii) pursuant to a protocol or collaborative practice agreement as defined by section 151.01, subdivisions 27b and 27c, and participation in the initiation, management, modification, administration, and discontinuation of drug therapy is according to the protocol or collaborative practice agreement between the pharmacist and a dentist, optometrist, physician, physician assistant, podiatrist, or veterinarian, or an advanced practice registered nurse authorized to prescribe, dispense, and administer under section 148.235. Any changes in drug therapy or medication administration made pursuant to a protocol or collaborative practice agreement must be documented by the pharmacist in the patient's medical record or reported by the pharmacist to a practitioner responsible for the patient's care;\n(6) initiating, ordering, and administering influenza and COVID-19 or SARS-CoV-2 vaccines authorized or approved by the United States Food and Drug Administration to all eligible individuals three years of age and older and all other United States Food and Drug Administration-approved vaccines to patients six years of age and older according to the federal Advisory Committee on Immunization Practices recommendations. A pharmacist may delegate the authority to administer vaccines under this clause to a pharmacy technician or pharmacy intern who has completed training in vaccine administration if:\n(i) the pharmacist and the pharmacy technician or pharmacy intern have successfully completed a program approved by the Accreditation Council for Pharmacy Education (ACPE) specifically for the administration of immunizations or a program approved by the board;\n(ii) the pharmacist utilizes the Minnesota Immunization Information Connection to assess the immunization status of individuals prior to the administration of vaccines, except when administering influenza vaccines to individuals age nine and older;\n(iii) the pharmacist reports the administration of the immunization to the Minnesota Immunization Information Connection;\n(iv) if the patient is 18 years of age or younger, the pharmacist, pharmacy technician, or pharmacy intern informs the patient and any adult caregiver accompanying the patient of the importance of a well-child visit with a pediatrician or other licensed primary care provider; and\n(v) in the case of a pharmacy technician administering vaccinations while being supervised by a licensed pharmacist:\n(A) the supervision is in-person and must not be done through telehealth as defined under section 62A.673, subdivision 2;\n(B) the pharmacist is readily and immediately available to the immunizing pharmacy technician;\n(C) the pharmacy technician has a current certificate in basic cardiopulmonary resuscitation;\n(D) the pharmacy technician has completed a minimum of two hours of ACPE-approved, immunization-related continuing pharmacy education as part of the pharmacy technician's two-year continuing education schedule; and\n(E) the pharmacy technician has completed one of two training programs listed under Minnesota Rules, part 6800.3850, subpart 1h, item B;\n(7) participation in the initiation, management, modification, and discontinuation of drug therapy according to a written protocol or collaborative practice agreement between: (i) one or more pharmacists and one or more dentists, optometrists, physicians, physician assistants, podiatrists, or veterinarians; or (ii) one or more pharmacists and one or more physician assistants authorized to prescribe, dispense, and administer under chapter 147A, or advanced practice registered nurses authorized to prescribe, dispense, and administer under section 148.235. Any changes in drug therapy made pursuant to a protocol or collaborative practice agreement must be documented by the pharmacist in the patient's medical record or reported by the pharmacist to a practitioner responsible for the patient's care;\n(8) participation in the storage of drugs and the maintenance of records;\n(9) patient counseling on therapeutic values, content, hazards, and uses of drugs and devices;\n(10) offering or performing those acts, services, operations, or transactions necessary in the conduct, operation, management, and control of a pharmacy;\n(11) participation in the initiation, management, modification, and discontinuation of therapy with opiate antagonists, as defined in section 604A.04, subdivision 1, pursuant to:\n(i) a written protocol as allowed under clause (7); or\n(ii) a written protocol with a community health board medical consultant or a practitioner designated by the commissioner of health, as allowed under section 151.37, subdivision 13;\n(12) prescribing self-administered hormonal contraceptives; nicotine replacement medications; and opiate antagonists for the treatment of an acute opiate overdose pursuant to section 151.37, subdivision 14, 15, or 16;\n(13) participation in the placement of drug monitoring devices according to a prescription, protocol, or collaborative practice agreement;\n(14) prescribing, dispensing, and administering drugs for preventing the acquisition of human immunodeficiency virus (HIV) if the pharmacist meets the requirements in section 151.37, subdivision 17; and\n(15) ordering, conducting, and interpreting laboratory tests necessary for therapies that use drugs for preventing the acquisition of HIV, if the pharmacist meets the requirements in section 151.37, subdivision 17.\n[See Note.]\n\"Protocol\" means:\n(1) a specific written plan that describes the nature and scope of activities that a pharmacist may engage in when initiating, managing, modifying, or discontinuing drug therapy as allowed in subdivision 27, clause (7); or\n(2) a specific written plan that authorizes a pharmacist to administer vaccines and that complies with subdivision 27, clause (6).\n\"Collaborative practice\" means patient care activities, consistent with subdivision 27, engaged in by one or more pharmacists who have agreed to work in collaboration with one or more practitioners to initiate, manage, and modify drug therapy under specified conditions mutually agreed to by the pharmacists and practitioners.\n\"Collaborative practice agreement\" means a written and signed agreement between one or more pharmacists and one or more practitioners that allows the pharmacist or pharmacists to engage in collaborative practice.\n\"Veterinary legend drug\" means a drug that is required by federal law to be dispensed only pursuant to the prescription of a licensed veterinarian.\n\"Medical gas\" means any gas or liquid manufactured or stored in a liquefied, nonliquefied, or cryogenic state that:\n(1) has a chemical or physical action in or on the human body or animals or is used in conjunction with medical gas equipment; and\n(2) is intended to be used for the diagnosis, cure, mitigation, treatment, or prevention of disease.\n\"Medical gas manufacturer\" means any person:\n(1) originally manufacturing a medical gas by chemical reaction, physical separation, compression of atmospheric air, purification, or other means;\n(2) filling a medical gas into a dispensing container via gas to gas, liquid to gas, or liquid to liquid processes;\n(3) combining two or more medical gases into a container to form a medically appropriate mixture; or\n(4) filling a medical gas via liquid to liquid into a final use container at the point of use.\n\"Medical gas wholesaler\" means any person who sells a medical gas to another business or entity for the purpose of reselling or providing that medical gas to the ultimate consumer or patient.\n\"Medical gas dispenser\" means any person, other than a licensed practitioner or pharmacy, who sells or provides a medical gas directly to the ultimate consumer or patient via a valid prescription.\n\"Dispense\" or \"dispensing\" means the interpretation, evaluation, and processing of a prescription drug order and includes those processes specified by the board in rule that are necessary for the preparation and provision of a drug to a patient or patient's agent in a suitable container appropriately labeled for subsequent administration to, or use by, a patient.\n\"Central service pharmacy\" means a pharmacy that performs those activities involved in the dispensing of a drug for another pharmacy, pursuant to the requirements of this chapter and the rules of the board.\n\"Electronic signature\" means an electronic sound, symbol, or process attached to or associated with a record and executed or adopted by a person with the intent to sign the record.\n\"Electronic transmission\" means transmission of information in electronic form.\n\"Health professional shortage area\" means an area designated as such by the federal Secretary of Health and Human Services, as provided under Code of Federal Regulations, title 42, part 5, and United States Code, title 42, section 254E.\n\"Compounding\" means preparing, mixing, assembling, packaging, and labeling a drug for an identified individual patient as a result of a practitioner's prescription drug order. Compounding also includes anticipatory compounding, as defined in this section, and the preparation of drugs in which all bulk drug substances and components are nonprescription substances. Compounding does not include mixing or reconstituting a drug according to the product's labeling or to the manufacturer's directions, provided that such labeling has been approved by the United States Food and Drug Administration (FDA) or the manufacturer is licensed under section 151.252. Compounding does not include the preparation of a drug for the purpose of, or incident to, research, teaching, or chemical analysis, provided that the drug is not prepared for dispensing or administration to patients. All compounding, regardless of the type of product, must be done pursuant to a prescription drug order unless otherwise permitted in this chapter or by the rules of the board. Compounding does not include a minor deviation from such directions with regard to radioactivity, volume, or stability, which is made by or under the supervision of a licensed nuclear pharmacist or a physician, and which is necessary in order to accommodate circumstances not contemplated in the manufacturer's instructions, such as the rate of radioactive decay or geographical distance from the patient.\n\"Anticipatory compounding\" means the preparation by a pharmacy of a supply of a compounded drug product that is sufficient to meet the short-term anticipated need of the pharmacy for the filling of prescription drug orders. In the case of practitioners only, anticipatory compounding means the preparation of a supply of a compounded drug product that is sufficient to meet the practitioner's short-term anticipated need for dispensing or administering the drug to patients treated by the practitioner. Anticipatory compounding is not the preparation of a compounded drug product for wholesale distribution.\n\"Extemporaneous compounding\" means the compounding of a drug product pursuant to a prescription drug order for a specific patient that is issued in advance of the compounding. Extemporaneous compounding is not the preparation of a compounded drug product for wholesale distribution.\n\"Compounded positron emission tomography drug\" means a drug that:\n(1) exhibits spontaneous disintegration of unstable nuclei by the emission of positrons and is used for the purpose of providing dual photon positron emission tomographic diagnostic images;\n(2) has been compounded by or on the order of a practitioner in accordance with the relevant parts of Minnesota Rules, chapters 4731 and 6800, for a patient or for research, teaching, or quality control; and\n(3) includes any nonradioactive reagent, reagent kit, ingredient, nuclide generator, accelerator, target material, electronic synthesizer, or other apparatus or computer program to be used in the preparation of such a drug.\n\"Ultimate user\" means a natural person who possesses a legend drug that was lawfully obtained for personal use or for the use of a household member or for the use of an animal owned by the natural person or by a household member.\n\"Biological product\" has the meaning provided in United States Code, title 42, section 262.\n\"Interchangeable biological product\" means a biological product that the United States Food and Drug Administration has:\n(1) licensed, and determined to meet the standards for \"interchangeability\" under United States Code, title 42, section 262(k)(4); or\n(2) determined to be therapeutically equivalent, as set forth in the most recent edition or supplement of the United States Food and Drug Administration publication titled \"Approved Drug Products with Therapeutic Equivalence Evaluations.\"\n\"Self-administered hormonal contraceptive\" means a drug composed of a combination of hormones that is approved by the United States Food and Drug Administration to prevent pregnancy and is administered by the user.\n\"Syringe services provider\" means a community-based public health program that offers cost-free comprehensive harm reduction services, which may include: providing sterile needles, syringes, and other injection equipment; making safe disposal containers for needles and syringes available; educating participants and others about overdose prevention, safer injection practices, and infectious disease prevention; providing blood-borne pathogen testing or referrals to blood-borne pathogen testing; offering referrals to substance use disorder treatment, including substance use disorder treatment with medications for opioid use disorder; and providing referrals to medical treatment and services, mental health programs and services, and other social services.",
	"repealed": false
}