{
	"id": "609.6057",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.6057",
	"title": "609.6057 GEOGRAPHIC RESTRICTION.",
	"text": "As used in this section, \"geographic restriction\" means a limitation prohibiting a defendant in a criminal proceeding or a juvenile offender in a delinquency proceeding from entering a designated property or geographic area.\nA person who knows of a geographic restriction order issued against the person and intentionally enters or remains in the restricted area is guilty of a misdemeanor.\n(a) A geographic restriction may be issued as a pretrial order before final disposition of the underlying criminal case, as a postconviction probationary order, or both. A geographic restriction order is independent of any condition of pretrial release or probation imposed on the defendant. A geographic restriction order may be issued in addition to a similar restriction imposed as a condition of pretrial release or probation.\n(b) A court may issue a geographic restriction upon a finding that its issuance will serve the interests of protecting public safety or property. In making that determination, a court shall consider the following factors:\n(1) whether a defendant's presence in a restricted area creates a risk to public safety or property;\n(2) a defendant's criminal history;\n(3) the likelihood of future criminal activity within the restricted area; and\n(4) any other factors deemed relevant by the court.\n(c) A court may grant any exceptions to a geographic restriction that it deems necessary in order to avoid the imposition of a significant hardship upon a defendant. In determining whether to grant an exception, a court shall also consider the impact of the exception on the interests of protecting public safety or property.\n(d) A geographic restriction order under this section shall be issued in a proceeding that is separate from but which may be held immediately following a proceeding in which any pretrial release or sentencing issues are decided.\n(e) A court issuing a geographic restriction order under this section shall notify a defendant:\n(1) of the area subject to a geographic restriction; and\n(2) that violation of the geographic restriction order is a crime.\n(a) A court shall cancel a pretrial geographic restriction order at the final disposition of the underlying criminal case.\n(b) A court shall cancel a postconviction geographic restriction order when an offender completes a period of probationary supervision or is committed to the commissioner of corrections.\n(c) A court may cancel a postconviction geographic restriction order at any time during which an offender is under probationary supervision.",
	"repealed": false
}