{
	"id": "216I.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.09",
	"title": "216I.09 PERMIT AMENDMENTS.",
	"text": "This section applies to a request by the owner of the large energy infrastructure facility to modify any provision or condition of a site or route permit issued by the commission, including the following:\n(1) upgrades or rebuilds an existing electric line and associated facilities to a voltage capable of operating between 100 kilovolts and 300 kilovolts that does not result in significant changes in the human and environmental impact of the facility; or\n(2) repowers or refurbishes a large electric power generating plant, a large wind energy conversion system, a solar energy generating system, or an energy storage system that increases the efficiency of the system, provided the project does not increase the developed area within the permitted site or increase the nameplate capacity of the facility's most recent interconnection agreement. For a large electric power generating plant, an increase in efficiency is a reduction in the amount of British thermal units required to produce a kilowatt hour of electricity at the facility.\nA person that seeks authorization to amend a large energy infrastructure facility must apply to the commission. The application must be in writing and must (1) describe the alteration to be made or the amendment sought, and (2) explain why the request meets the eligibility criteria under subdivision 1. The application must describe any changes to the environmental impacts evaluated by the commission as part of the initial permit approval. If there are significant changes to the environmental impacts evaluated by the commission as part of the initial permit approval, environmental review must be conducted pursuant to the applicable requirements of Minnesota Rules, chapter 4410, and parts 7849.1000 to 7849.2100.\nThe commission must mail notice that the application was received to the persons on the general list and to the persons on the project contact list, if a project list exists.\nThe commission must provide at least a ten-day period for interested persons to submit comments on the application or to request that the matter be brought to the commission for consideration. The applicant may respond to submitted comments within seven days of the date the comment period closes.\nWithin 30 days of the date the applicant responds to submitted comments under subdivision 4, the commission must decide whether to authorize the permit amendment, bring the matter to the commission for consideration, or determine that the application requires a permitting decision under another section in this chapter.\nThe commission may authorize an amendment but impose reasonable conditions on the approval. The commission must notify the applicant in writing of the commission's decision and send a copy of the decision to any person who requested notification or filed comments on the application.\nFor a large electric power generating plant or high-voltage transmission line that was not issued a permit by the commission, the owner or operator of the nonpermitted facility may seek approval of a project listed under subdivision 1 from the local unit of government if the facility qualifies for standard review under section 216I.07 or local review under section 216I.08.",
	"repealed": false
}