{
	"id": "325D.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/325D.72",
	"title": "325D.72 BAD FAITH ASSERTIONS OF PATENT INFRINGEMENT.",
	"text": "For purposes of this section, \"end user\" means a person, whether an individual, business, or financial institution, that purchases, rents, leases, or otherwise obtains a product, service, or technology in the commercial market that is not for resale and that is, or later becomes, the subject of a patent infringement assertion due to the person's use of the product, service, or technology.\n(a) A person may not send to an end user located or doing business in this state a written or electronic communication that is a bad faith claim of patent infringement.\n(b) A communication is a bad faith claim of patent infringement if the communication includes a claim that the end user or a person affiliated with the end user has infringed a patent and is liable for that infringement and:\n(1) the communication falsely states that the sender has filed a lawsuit in connection with the claim;\n(2) the sender or a person the sender represents does not have a current right to license the patent to or enforce the patent against the end user;\n(3) the patent has been held invalid or unenforceable in a final judgment or administrative decision;\n(4) the infringing activity alleged in the communication occurred after the patent expired; or\n(5) the communication is likely to materially mislead a reasonable end user because the communication does not contain information sufficient to inform the end user of:\n(i) the identity of the person asserting the claim;\n(ii) the patent that is alleged to have been infringed; and\n(iii) at least one product, service, or technology obtained by the end user that is alleged to infringe the patent or the activity of the end user that is alleged to infringe the patent.\nIf the attorney general believes that a person has violated or is violating this section, the attorney general may bring an action on behalf of the state to enjoin the person from violating this section. In addition to seeking an injunction, the attorney general may request and the court may order any other relief that may be in the public interest, including:\n(1) the imposition of a civil penalty in an amount not to exceed $50,000 for each violation of subdivision 2;\n(2) an order requiring reimbursement to this state for the reasonable value of investigating and prosecuting a violation of subdivision 2; and\n(3) an order requiring restitution to a victim for legal and professional expenses related to the violation.\n(a) This section shall not be construed to limit the rights and remedies available to the state or another person under any other law or alter or restrict the attorney general's authority under other law with regard to conduct involving claims of patent infringement. This section shall not prohibit a person who owns or has a right to license or enforce a patent from notifying others of the person's ownership or right; offering the patent to others for license or sale; notifying any person of the person's infringement of the patent as provided by United States Code, title 35, section 287; or seeking compensation for past or present infringement of the patent or for a license to the patent. This section shall not be construed to apply to a person who has demonstrated good faith business practices in previous efforts to enforce the patent, or a substantially similar patent, or who has successfully enforced the patent, or a substantially similar patent, through litigation.\n(b) This section shall not apply to any written or electronic communication:\n(1) sent by any owner of a patent who has engaged in substantial research, commercial development, production, manufacturing, processing, or delivery of products or materials related to the patent or substantially similar patents;\n(2) sent by any institution of higher education;\n(3) sent by a charitable institution under section 501(c)(3) of the Internal Revenue Code, and those within its control group as defined therein;\n(4) sent by any technology transfer organization whose primary purpose is to facilitate the commercialization of technology developed by an institution of higher education or charitable institution under section 501(c)(3) of the Internal Revenue Code, and those within its control group as defined therein; or\n(5) relating to a demand or assertion of patent infringement that arises under United States Code, title 35, section 271(e)(2); United States Code, title 21, section 355; or United States Code, title 42, section 262, and any civil action including such a demand or assertion.\nThis section does not create a private cause of action for a violation of subdivision 2.",
	"repealed": false
}