{
	"id": "342.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.34",
	"title": "342.34 CANNABIS WHOLESALER OPERATIONS.",
	"text": "A cannabis wholesaler must ensure that cannabis plants, cannabis flower, and cannabis products are physically separated from all other products, including but not limited to lower-potency hemp edibles and hemp-derived consumer products, in a manner that prevents any cross-contamination.\nA cannabis wholesaler must maintain accurate records and ensure that appropriate labels remain affixed to cannabis plants, cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products.\n(a) A cannabis wholesaler shall maintain compliance with state and local building, fire, and zoning requirements or regulations.\n(b) A cannabis wholesaler shall ensure that the licensed premises is maintained in a clean and sanitary condition, free from infestation by insects, rodents, or other pests.\nA cannabis wholesaler may purchase and sell other products or items for which the cannabis wholesaler has a license or authorization or that do not require a license or authorization. Products for which no license or authorization is required include but are not limited to industrial hemp products, products that contain hemp grain, hemp-derived topical products, and cannabis paraphernalia, including but not limited to childproof packaging containers and other devices designed to ensure the safe storage and monitoring of cannabis flower and cannabis products in the home to prevent access by individuals under 21 years of age.\n(a) A cannabis wholesaler that imports lower-potency hemp edibles or hemp-derived consumer products, other than hemp-derived topical products, that are manufactured outside the boundaries of the state of Minnesota with the intent to sell the products to a cannabis microbusiness, cannabis mezzobusiness, cannabis retailer, or lower-potency hemp edible retailer must obtain a hemp-derived product importer endorsement from the office.\n(b) A cannabis wholesaler with a hemp-derived product importer endorsement may sell products manufactured outside the boundaries of the state of Minnesota if:\n(1) the manufacturer is licensed in another jurisdiction and subject to regulations designed to protect the health and safety of consumers that the office determines are substantially similar to the regulations in this state; or\n(2) the cannabis wholesaler establishes, to the satisfaction of the office, that the manufacturer engages in practices that are substantially similar to the practices required for licensure of manufacturers in this state.\n(c) The cannabis wholesaler must enter all relevant information regarding an imported hemp-derived consumer product into the statewide monitoring system before the product may be distributed. Relevant information includes information regarding the cultivation, processing, and testing of the industrial hemp used in the manufacture of the product and information regarding the testing of the hemp-derived consumer product. If information regarding the industrial hemp or hemp-derived consumer product was submitted to a statewide monitoring system used in another state, the office may require submission of any information provided to that statewide monitoring system and shall assist in the transfer of data from another state as needed and in compliance with any data classification established by either state.\n(d) The office may suspend, revoke, or cancel the endorsement of a distributor who is prohibited from distributing products containing cannabinoids in any other jurisdiction, convicted of an offense involving the distribution of products containing cannabinoids in any other jurisdiction, or found liable for distributing any product that injured customers in any other jurisdiction. A cannabis wholesaler shall disclose all relevant information related to actions in another jurisdiction. Failure to disclose relevant information may result in disciplinary action by the office, including the suspension, revocation, or cancellation of an endorsement or license.\n(e) Notwithstanding any law to the contrary, it shall not be a defense in any civil or criminal action that a licensed wholesaler relied on information on a product label or otherwise provided by a manufacturer who is not licensed in this state.",
	"repealed": false
}