{
	"id": "34A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/34A.01",
	"title": "34A.01 DEFINITIONS.",
	"text": "The definitions in this section and chapters 28, 28A, 29, 30, 31, 31A, 32D, and 34 apply to this chapter. The definitions in this section apply to chapter 32D.\n\"Commissioner\" means the commissioner of agriculture.\n\"Federal act\" means the federal Food, Drug, and Cosmetic Act, as amended, United States Code, title 21, sections 301 et seq.\n\"Food\" means every ingredient used for, entering into the consumption of, or used or intended for use in the preparation of food, drink, confectionery, or condiment for humans or other animals, whether simple, mixed, or compound; and articles used as components of these ingredients, except that edible cannabis products, as defined in section 342.01, subdivision 20, lower-potency hemp edibles as defined in section 342.01, subdivision 50, and hemp-derived consumer products, as defined in section 342.01, subdivision 37, that are intended to be eaten or consumed as a beverage are not food.\n[See Note.]\n\"Frozen food\" is food that is processed and preserved by freezing and which is intended to be sold in the frozen state.\n\"Label\" means a display of written, printed, or graphic matter upon or affixed to the container of any food, and includes a like display, if required by law or rule, on the outside container or wrapper, if there is one, of the retail package of the food, not including package liners.\n\"Labeling\" means labels and other written, printed, or graphic matter:\n(1) on food or its containers or wrappers;\n(2) accompanying or supporting food; or\n(3) a placard in, on, or adjacent to the food.\n\"Nonperishable food\" is food with a shelf life of more than 90 days and that is not perishable food, readily perishable food, or frozen food.\n\"Perishable food\" means food including, but not limited to, fresh fruits, fresh vegetables, and other products that need protection from extremes of temperatures in order to avoid decomposition by microbial growth or otherwise.\n\"Person\" means any individual, firm, partnership, cooperative, society, joint stock association, association, company, or corporation and includes any officer, employee, agent, trustee, receiver, assignee, or other similar business entity or representative of one of those entities.\n\"Readily perishable food\" is food or a food ingredient consisting in whole or in part of milk, milk products, eggs, meat, fish, poultry, or other food or food ingredient that is capable of supporting growth of infectious or toxigenic microorganisms. Readily perishable food requires time and temperature control to limit pathogenic microorganism growth or toxin formation.\n\"Sell\" and \"sale\" mean keeping, offering, or exposing for sale, use, transporting, transferring, negotiating, soliciting, or exchanging food; having in possession with intent to sell, use, transport, negotiate, solicit, or exchange food; storing, manufacturing, producing, processing, packing, and holding of food for sale; dispensing or giving food; or supplying or applying food in the conduct of any food operation or carrying food in aid of traffic in food whether done or permitted in person or through others.",
	"repealed": false
}