{
	"id": "268B.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.14",
	"title": "268B.14 PREMIUMS.",
	"text": "(a) Family and medical leave premiums accrue and become payable by each employer, except for an employer with an approved private plan under section 268B.10, for each calendar year on the taxable wages that the employer paid to employees in covered employment.\nEach employer must pay premiums quarterly, at the premium rate defined under this section, on the taxable wages paid to each employee. The commissioner must compute the premium due from the wage detail report required under section 268B.12 and notify the employer of the premium due. The premiums must be paid to the family and medical benefit insurance account and must be received by the department on or before the last day of the month following the end of the calendar quarter.\n(b) If for any reason the wages on the wage detail report under section 268B.12 are adjusted for any quarter, the commissioner must recompute the premiums due for that quarter and assess the employer for any amount due or credit the employer as appropriate.\n(a) Every employer must make any payments due under this chapter by electronic payment.\n(b) All third-party processors, paying on behalf of a client company, must make any payments due under this chapter by electronic payment.\n(c) Regardless of paragraph (a) or (b), the commissioner has the discretion to accept payment by other means.\nNotwithstanding section 177.24, subdivision 4, or 181.06, subdivision 1, and subject to subdivision 6, employers must pay a minimum of 50 percent of the annual premiums paid under this section. Employees, through a deduction in their wages to the employer, must pay the remaining portion, if any, of the premium not paid by the employer. Such deductions for any given employee must be in equal proportion to the premiums paid based on the wages of that employee. Deductions under this section must not cause an employee's wage, after the deduction, to fall below the rate required to be paid to the employee by any applicable statute, regulation, rule, ordinance, or government resolution or policy, whichever rate of pay is greater.\n[See Note.]\nThe maximum wages subject to premium in a calendar year is equal to the maximum earnings in that year subject to the FICA Old-Age, Survivors, and Disability Insurance tax.\n[Never effective, 2024 c 127 art 73 s 51]\n[See Note.]\n(a) Small employers are eligible for the premium rates provided by this subdivision if the employer:\n(1) has 30 or fewer employees pursuant to subdivision 5b; and\n(2) the average wage for that employer as calculated in subdivision 5c is less than or equal to 150 percent of the state's average wage in covered employment for the basis period.\n(b) The premium rate for small employers eligible under this subdivision is 75 percent of the annual premium rate calculated in subdivisions 6 and 7, as follows:\n(1) employers must pay a minimum of 25 percent of the rate calculated in subdivisions 6 and 7. Employers shall not deduct from any employees' pay to fund the employer portion of the premium; and\n(2) employees must pay the remaining portion due under this subdivision, if any, of the premium not paid by the employer. The employer must make wage deductions as necessary under this subdivision to fund the employee portion of the premium.\n(a) The basis period for determining premiums under:\n(1) subdivision 5a;\n(2) average employer wages under subdivision 5c; and\n(3) eligibility for small employer assistance grants under section 268B.29 for any tax year shall be the four-quarter period ending September 30 of the prior year.\n(b) For each employer that has been covered for the entirety of the basis period, the maximum number of quarterly wage records reported by the employer during the basis period shall be used to determine premiums under subdivision 5a and eligibility for small employer assistance grants under section 268B.29.\n(c) For any employer not covered for the entirety of the basis period, the number of employees used to determine premiums under subdivision 5a and eligibility for small employer assistance grants under section 268B.29 shall be based on the number of employees working in Minnesota the employer estimates they will employ in the following calendar year.\n(d) If upon a review of the actual number of wage records reported, it is found that a new employer's estimate at time of registration was ten percent or more less than the actual number of records reported, the employer's premiums under subdivision 5a and eligibility for small employer assistance grants under section 268B.29 shall be recalculated based on the wage records reported.\n(a) For each employer that has been covered for the entirety of the basis period, the employer's average wage shall be calculated by dividing the maximum amount of covered wages reported by the employer in a single quarterly wage record during the basis period by the maximum number of quarterly wage records reported by the employer during the basis period.\n(b) For any employer not covered for the entirety of the basis period, the employer's average wage shall by calculated by dividing the employer's estimated amount of covered wages in the following tax year by the employer's estimated number of employees working in Minnesota the employer will employ in the following calendar year.\n(c) If upon a review of the actual amount of covered wages reported it is found that a new employer's estimate at time of registration was ten percent or more less than the actual amount of covered wages, the employer's premiums under subdivision 5a and eligibility for small employer assistance grants under section 268B.29 shall be recalculated based on the wage records reported.\nThe employer premium rates beginning January 1, 2026, shall be as follows:\n(1) for an employer participating in both family and medical benefit programs, 0.7 percent;\n(2) for an employer participating in only the medical benefit program and with an approved private plan for the family benefit program, 0.4 percent; and\n(3) for an employer participating in only the family benefit program and with an approved private plan for the medical benefit program, 0.3 percent.\nThe commissioner may adjust the annual premium rates pursuant to this section prior to January 1, 2026. By July 31, 2026, and then by July 31 of each year thereafter, the commissioner must adjust the annual premium rates for the following calendar year based on program historical experience and sound actuarial principles and so that the projected fund balance as a percentage of total program expenditure does not fall below 25 percent. The commissioner shall contract with a qualified independent actuarial consultant to conduct an actuarial study for this purpose no less than every year. A copy of all actuarial studies, and any revisions or other documents received that relate to an actuarial study, must be provided promptly to the chairs and ranking minority members of the legislative committees with jurisdiction over this chapter. All actuarial studies, and any revisions or other documents received that relate to an actuarial study, must also be filed with the Legislative Reference Library in compliance with section 3.195. A qualified independent actuarial consultant is one who is a Fellow of the Society of Actuaries (FSA) and a Member of the American Academy of Actuaries (MAAA) and who has experience directly relevant to the analysis required. In no year shall the annual premium rate exceed 1.2 percent of taxable wages paid to each employee.\nAll premiums collected under this section must be deposited into the family and medical benefit insurance account.\nThe failure of an employer to pay premiums does not impact the right of an employee to benefits, or any other right, under this chapter.",
	"repealed": false
}