{
	"id": "90.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.181",
	"title": "90.181 STATEMENT OF TIMBER CUT.",
	"text": "(a) The commissioner shall transmit to the permit holder a statement of the amount due therefor by the terms of the permit upon completion of the cutting or at least annually in the case of an auction permit. Any partial payment received may be applied to any items on the statement as the commissioner shall determine.\n(b) The title to the timber shall not pass from the state until the timber has been scaled as required by the permit, full payment for the timber has been received, and all other provisions of the permit have been fully complied with.\n(a) If the amount of the statement is not paid or the payment is not postmarked within 30 days of the statement date, the amount bears interest at the rate determined pursuant to section 16A.124, except that the purchaser is not required to pay interest that totals $1 or less. If the amount is not paid within 60 days, the commissioner shall place the account in the hands of the commissioner of revenue according to chapter 16D, who shall proceed to collect the amount due. When deemed in the best interests of the state, the commissioner shall take possession of the timber for which an amount is due wherever it may be found and sell the timber informally or at public auction after giving reasonable notice.\n(b) The proceeds of the sale must be applied, first, to the payment of the expenses of seizure and sale and, second, to the payment of the amount due for the timber, with interest. The surplus, if any, belongs to the state. In case a sufficient amount is not realized to pay these amounts in full, the balance must be collected by the attorney general. Payment of the amount, recovery of judgment for the amount, satisfaction of the judgment, or seizure and sale of timber does not:\n(1) release the sureties on any security deposit given pursuant to this chapter;\n(2) preclude the state from afterwards claiming that the timber was cut or removed contrary to law and recovering damages for the trespass thereby committed; or\n(3) preclude the state from prosecuting the offender criminally.",
	"repealed": false
}