{
	"id": "116J.993",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.993",
	"title": "116J.993 DEFINITIONS.",
	"text": "For the purposes of sections 116J.993 to 116J.995, the terms defined in this section have the meanings given them.\n\"Benefit date\" means the date that the recipient receives the business subsidy. If the business subsidy involves the purchase, lease, or donation of physical equipment, then the benefit date begins when the recipient puts the equipment into service. If the business subsidy is for improvements to property, then the benefit date refers to the earliest date of either:\n(1) when the improvements are finished for the entire project; or\n(2) when a business occupies the property. If a business occupies the property and the subsidy grantor expects that other businesses will also occupy the same property, the grantor may assign a separate benefit date for each business when it first occupies the property.\n\"Business subsidy\" or \"subsidy\" means a state or local government agency grant, contribution of personal property, real property, infrastructure, the principal amount of a loan at rates below those commercially available to the recipient, any reduction or deferral of any tax or any fee, any guarantee of any payment under any loan, lease, or other obligation, or any preferential use of government facilities given to a business.\nThe following forms of financial assistance are not a business subsidy:\n(1) a business subsidy of less than $150,000;\n(2) assistance that is generally available to all businesses or to a general class of similar businesses, such as a line of business, size, location, or similar general criteria;\n(3) public improvements to buildings or lands owned by the state or local government that serve a public purpose and do not principally benefit a single business or defined group of businesses at the time the improvements are made;\n(4) redevelopment property polluted by contaminants as defined in section 116J.552, subdivision 3;\n(5) assistance provided for the sole purpose of renovating old or decaying building stock or bringing it up to code and assistance provided for designated historic preservation districts, provided that the assistance is equal to or less than 50 percent of the total cost;\n(6) assistance to provide job readiness and training services if the sole purpose of the assistance is to provide those services;\n(7) assistance for housing;\n(8) assistance for pollution control or abatement, including assistance for a tax increment financing hazardous substance subdistrict as defined under section 469.174, subdivision 23;\n(9) assistance for energy conservation;\n(10) tax reductions resulting from conformity with federal tax law;\n(11) workers' compensation and unemployment insurance;\n(12) benefits derived from regulation;\n(13) indirect benefits derived from assistance to educational institutions;\n(14) funds from bonds allocated under chapter 474A, bonds issued to refund outstanding bonds, and bonds issued for the benefit of an organization described in section 501(c)(3) of the Internal Revenue Code of 1986, as amended through December 31, 1999;\n(15) assistance for a collaboration between a Minnesota higher education institution and a business;\n(16) assistance for a tax increment financing soils condition district as defined under section 469.174, subdivision 19;\n(17) redevelopment when the recipient's investment in the purchase of the site and in site preparation is 70 percent or more of the assessor's current year's estimated market value;\n(18) general changes in tax increment financing law and other general tax law changes of a principally technical nature;\n(19) federal assistance until the assistance has been repaid to, and reinvested by, the state or local government agency;\n(20) funds from dock and wharf bonds issued by a seaway port authority;\n(21) business loans and loan guarantees of $150,000 or less;\n(22) federal loan funds provided through the United States Department of Commerce, Economic Development Administration; and\n(23) property tax abatements granted under section 469.1813 to property that is subject to valuation under Minnesota Rules, chapter 8100.\n\"Grantor\" means any state or local government agency with the authority to grant a business subsidy.\n\"Local government agency\" includes a statutory or home rule charter city, housing and redevelopment authority, town, county, port authority, economic development authority, community development agency, nonprofit entity created by a local government agency, or any other entity created by or authorized by a local government with authority to provide business subsidies.\n\"Recipient\" means any for-profit or nonprofit business entity that receives a business subsidy. Only nonprofit entities with at least 100 full-time equivalent positions and with a ratio of highest to lowest paid employee, that exceeds ten to one, determined on the basis of full-time equivalent positions, are included in this definition.\n\"Residence\" means the place where an individual has established a permanent home from which the individual has no present intention of moving.\n\"State government agency\" means any state agency that has the authority to award business subsidies.",
	"repealed": false
}