{
	"id": "352.116",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.116",
	"title": "352.116 ANNUITIES UPON RETIREMENT.",
	"text": "(a) This subdivision applies only to a person who first became a covered employee or a member of a pension fund listed in section 356.30, subdivision 3, before July 1, 1989, and whose annuity is higher when calculated under section 352.115, subdivision 3, paragraph (a), in conjunction with this subdivision than when calculated under section 352.115, subdivision 3, paragraph (b), in conjunction with subdivision 1a.\n(b) Any employee who is eligible for a retirement annuity under section 352.115, subdivision 1, and who retires before normal retirement age with credit for at least three but less than 30 years of allowable service shall be paid the normal retirement annuity provided in section 352.115, subdivisions 2 and 3, paragraph (a), reduced by one-quarter of one percent for each month that the employee is under normal retirement age at the time of retirement. An employee who is eligible for a retirement annuity under section 352.115, subdivision 1, and who retires prior to age 62 with credit for at least 30 years of allowable service shall be paid the normal retirement annuity provided in section 352.115, subdivisions 2 and 3, paragraph (a), reduced by one-quarter of one percent for each month that the employee is under age 62 at the time of retirement.\n(c) Any person whose attained age plus credited allowable service totals 90 years is entitled, upon application, to a retirement annuity in an amount equal to the normal annuity provided in section 352.115, subdivisions 2 and 3, paragraph (a), without any reduction by reason of early retirement.\n(a) This subdivision applies to a person who has become at least 55 years old and first became a covered employee after June 30, 1989, and to any other covered employee who has become at least 55 years old and whose annuity is higher when calculated under section 352.115, subdivision 3, paragraph (b), in conjunction with this subdivision than when calculated under section 352.115, subdivision 3, paragraph (a), in conjunction with subdivision 1. A covered employee who retires before the normal retirement age shall be paid the normal retirement annuity provided in section 352.115, subdivisions 2 and 3, paragraph (b), reduced as described in paragraph (b) or (c), as applicable.\n(b) For covered employees who retire on or after July 1, 2019, the reduced annuity is the actuarial equivalent of the annuity that would be payable to the employee if the employee deferred receipt of the annuity until normal retirement age and the annuity amount were augmented at the applicable annual rate, compounded annually, from the day the annuity begins to accrue until the normal retirement age. The applicable annual rate is the rate in effect on the employee's effective date of retirement and shall be considered as fixed for the employee for the period until the employee reaches normal retirement age. The applicable annual rates are the following:\n(1) until June 30, 2019, three percent if the employee became an employee before July 1, 2006, and 2.5 percent if the employee became an employee after June 30, 2006;\n(2) beginning July 1, 2019, through June 30, 2024, a rate that changes each month, on the first day of the month, starting with the rate in clause (1), as applicable to the employee, and reducing the rate to zero in equal monthly increments over the five-year period; and\n(3) after June 30, 2024, zero percent.\nAfter June 30, 2024, actuarial equivalent, for the purpose of determining the reduced annuity commencing before normal retirement age under this clause, shall not take into account any augmentation.\n(c) For covered employees who retire before July 1, 2019, the reduced annuity is the actuarial equivalent of the annuity that would be payable to the employee if the employee deferred receipt of the annuity until normal retirement age and the annuity amount were augmented at an annual rate of three percent, compounded annually, from the day the annuity begins to accrue until normal retirement age if the employee became an employee before July 1, 2006, and at an annual rate of 2.5 percent, compounded annually, from the day the annuity begins to accrue until normal retirement age if the employee became an employee after June 30, 2006.\nAny employee who retires after reaching normal retirement age shall be paid the annuity provided in section 352.115.\nThe board shall establish an optional retirement annuity in the form of a joint and survivor annuity. The board may also establish an optional annuity in the form of an annuity payable for a period certain and for life thereafter. In addition, the board may also establish an optional annuity that takes the form of an annuity calculated on the basis of the age of the retired employee at retirement and payable for the period before the retired employee becomes eligible for Social Security old age retirement benefits in a greater amount than the amount of the annuity calculated under subdivision 2 on the basis of the age of the retired employee at retirement. For each year that the retiring employee is under age 62, up to five percent of the total single life annuity required reserves may be used to accelerate the optional retirement annuity. This greater amount shall be paid until the end of the month in which the retired employee reaches age 62, at which time the annuity shall be reduced. Except as provided in subdivision 3a, the optional forms must be actuarially equivalent to the normal single life annuity forms provided in sections 352.115 and 352.116, whichever applies.\n(a) If a retired employee or disabilitant selects a joint and survivor annuity option under subdivision 3 after June 30, 1989, the retired employee or disabilitant must receive a normal single-life annuity if the designated optional annuity beneficiary dies before the retired employee or disabilitant. Under this option, no reduction may be made in the annuity to provide for restoration of the normal single-life annuity in the event of the death of the designated optional annuity beneficiary.\n(b) The annuity adjustment specified in paragraph (a) also applies to joint and survivor annuity options under subdivision 3 elected before July 1, 1989. The annuity adjustment under this paragraph occurs on July 1, 1989, or on the first day of the first month following the death of the designated optional annuity beneficiary, whichever is later. This paragraph may not be interpreted as authorizing retroactive payments.\n(a) The board of directors must provide a joint and survivor annuity option to members of the correctional employees and State Patrol retirement funds. Under this option, if a former member or disabilitant selects a joint and survivor annuity option after June 30, 1989, the former member or disabilitant must receive a normal single life annuity if the designated optional annuity beneficiary dies before the former member or disabilitant. Under this option, no reduction may be made in the person's annuity to provide for restoration of the normal single life annuity in the event of the death of the designated optional annuity beneficiary.\n(b) The annuity adjustment specified in paragraph (a) also applies to joint and survivor annuity options elected before July 1, 1989. The annuity adjustment under this paragraph occurs on July 1, 1989, or on the first day of the first month following the death of the designated optional annuity beneficiary, whichever is later. This paragraph may not be interpreted as authorizing retroactive payments.\nIn the event of the death of the designated optional annuity beneficiary before the retired employee or disabilitant, the restoration of the normal single life annuity under subdivision 3a or 3b will take effect as of the first of the month following the date of death of the designated optional annuity beneficiary or on the first of the month following one year before the date on which a certified copy of the death record of the designated optional annuity beneficiary is received in the Office of the Minnesota State Retirement System, whichever date is later.\nIn establishing the procedure for determining the actuarial equivalency of early retirement annuities as required under subdivision 1a or in establishing actuarial equivalent optional retirement annuity forms as required under subdivision 3, the board shall obtain the written recommendation of the actuary retained under section 356.214. The recommendations shall be a part of the permanent records of the board.",
	"repealed": false
}