{
	"id": "144.553",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.553",
	"title": "144.553 ALTERNATIVE APPROVAL PROCESS.",
	"text": "(a) An organization seeking to obtain a hospital license must submit a letter of intent to the commissioner, specifying the community in which the proposed hospital would be located and the number of beds proposed for the new hospital. When multiple letters of intent are received, the commissioner shall determine whether they constitute requests for separate projects or are competing proposals to serve the same or a similar service area.\n(b) Upon receipt of a letter under paragraph (a), the commissioner shall publish a notice in the State Register that includes the information received from the organization under paragraph (a). The notice must state that another organization interested in seeking a hospital license to serve the same or a similar service area must notify the commissioner within 30 days.\n(c) If no responses are received from additional organizations under paragraph (b), the commissioner shall notify the entity seeking a license that it is required to submit a plan under section 144.552 and shall notify the chairs of the house of representatives and senate committees having jurisdiction over health and human services policy and finance that the project is subject to sections 144.551 and 144.552.\n(a) If one or more responses are received by the commissioner under subdivision 1, paragraph (b), the commissioner shall complete within 90 days a needs assessment to determine if a new hospital is needed in the proposed service area.\n(b) The organizations that have filed or responded to a letter of intent under subdivision 1 shall provide to the commissioner within 30 days of a request from the commissioner a statement justifying the need for a new hospital in the service area and sufficient information, as determined by the commissioner, to allow the commissioner to determine the need for a new hospital. The information may include, but is not limited to, a demographic analysis of the proposed service area, the number of proposed beds, the types of hospital services to be provided, and distances and travel times to existing hospitals currently providing services in the service area.\n(c) The commissioner shall make a determination of need for the new hospital. If the commissioner determines that a new hospital in the service area is not justified, the commissioner shall notify the applicants in writing, stating the reasons for the decision.\n(a) If the commissioner determines that a new hospital is needed in the proposed service area, the commissioner shall notify the applicants of that finding and shall select the applicant determined under the process established in this subdivision to be best able to provide services consistent with the review criteria established in this subdivision.\n(b) The commissioner shall:\n(1) determine market-specific criteria that shall be used to evaluate all proposals. The criteria must include standards regarding:\n(i) access to care;\n(ii) quality of care;\n(iii) cost of care; and\n(iv) overall project feasibility;\n(2) establish additional criteria at the commissioner's discretion. In establishing the criteria, the commissioner shall consider the need for:\n(i) mental health services in the service area, including both inpatient and outpatient services for adults, adolescents, and children;\n(ii) a significant commitment to providing uncompensated care, including discounts for uninsured patients and coordination with other providers of care to low-income uninsured persons; and\n(iii) coordination with other hospitals so that specialized services are not unnecessarily duplicated and are provided in sufficient volume to ensure the maintenance of high-quality care; and\n(3) define a service area for the proposed hospital. The service area shall consist of:\n(i) in the 11-county metropolitan area, in St. Cloud, and in Duluth, the zip codes located within a 20-mile radius of the proposed new hospital location; and\n(ii) in the remainder of the state, the zip codes within a 30-mile radius of the proposed new hospital location.\n(c) If the plan is being submitted by an existing hospital, the commissioner shall also consider:\n(1) the ability of the applicant to maintain the applicant's current level of community benefit as defined in section 144.699, subdivision 5, at the existing facility; and\n(2) the impact on the workforce at the existing facility including the applicant's plan for:\n(i) transitioning current workers to the new facility;\n(ii) retraining and employment security for current workers; and\n(iii) addressing the impact of layoffs at the existing facility on affected workers.\n(d) The commissioner shall publish the criteria determined under paragraphs (b) and (c) in the State Register within 60 days of the determination under subdivision 2. Once published, the criteria shall not be modified with respect to the particular project and applicants to which they apply. The commissioner shall publish with the criteria guidelines for a proposal and submission review process.\n(e) For 60 days after the publication under paragraph (d), the commissioner shall accept proposals to construct a hospital from organizations that have submitted a letter of intent under subdivision 1, paragraph (a), or have notified the commissioner under subdivision 1, paragraph (b). The proposal must include a plan for the new hospital and evidence of compliance with the criteria specified under paragraphs (b) and (c). Once submitted, the proposal may not be revised except:\n(1) to submit corrections of material facts; or\n(2) in response to a request from the commissioner to provide clarification or further information.\n(f) The commissioner shall determine within 90 days of the deadline for applications under paragraph (e), which applicant has demonstrated that it is best able to provide services consistent with the published criteria. The commissioner shall make this determination by order following a hearing according to this paragraph. The hearing shall not constitute or be considered to be a contested case hearing under chapter 14 and shall be conducted solely under the procedures specified in this paragraph. The hearing shall commence upon at least 30 days' notice to the applicants by the commissioner. The hearing may be conducted by the commissioner or by a person designated by the commissioner. The designee may be an administrative law judge. The purpose of the hearing shall be to receive evidence to assist the commissioner in determining which applicant has demonstrated that it best meets the published criteria.\nThe parties to the hearing shall consist only of those applicants who have submitted a completed application. Each applicant shall have the right to be represented by counsel, to present evidence deemed relevant by the commissioner, and to examine and cross-examine witnesses. Persons who are not parties to the proceeding but who wish to present comments or submit information may do so in the manner determined by the commissioner or the commissioner's designee. Any person who is not a party shall have no right to examine or cross-examine witnesses. The commissioner may participate as an active finder of fact in the hearing and may ask questions to elicit information or clarify answers or responses.\n(g) Prior to making a determination selecting an application, the commissioner shall hold a public hearing in the proposed hospital service area to accept comments from members of the public. The commissioner shall take this information into consideration in making the determination. The commissioner shall appoint an advisory committee, including legislators and local elected officials who represent the service area and outside experts to assist in the recommendation process. The legislative appointees shall include, at a minimum, the chairs of the senate and house of representatives committees with jurisdiction over health care policy. The commissioner shall issue an order selecting an application following the closing of the record of the hearing as determined by the hearing officer. The commissioner's order shall include a statement of the reasons the selected application best meets the published criteria.\n(h) Within 30 days following the determination under paragraph (f), the commissioner shall recommend the selected proposal to the legislature.\n(i) If an exception to the moratorium is approved under section 144.551 after a review under this section, the commissioner shall monitor the implementation of the exception up to completion of the construction project. Thirty days after completion of the construction project, the hospital shall submit to the commissioner a report on how the construction has met the provisions of the plan originally submitted under the public interest review process or a plan submitted pursuant to section 144.551, subdivision 1, paragraph (b), clause (20).\nNotwithstanding section 16A.1283, applicants who are a party at any stage of the administrative process established in this section shall pay the cost of that stage of the process, as determined by the commissioner. The cost of the needs assessment, criteria development, and hearing shall be divided equally among the applicants. Money received by the commissioner under this subdivision is appropriated to the commissioner for the purpose of administering this section.",
	"repealed": false
}