{
	"id": "474A.047",
	"url": "https://www.revisor.mn.gov/statutes/cite/474A.047",
	"title": "474A.047 RESIDENTIAL RENTAL BONDS; LIMITATIONS.",
	"text": "(a) An issuer may only use the proceeds from residential rental bonds if the proposed project meets the following requirements:\n(1) the proposed residential rental project meets the requirements of section 142(d) of the Internal Revenue Code regarding the incomes of the occupants of the housing; and\n(2) the maximum rent for at least 20 percent of the units in the proposed residential rental project do not exceed the area fair market rent or exception fair market rents for existing housing, if applicable, as established by the federal Department of Housing and Urban Development. The rental rates of units in a residential rental project for which project-based federal assistance payments are made are deemed to be within the rent limitations of this clause.\n(b) The proceeds from residential rental bonds may be used for a project for which project-based federal rental assistance payments are made only if:\n(1) the owner of the project enters into a binding agreement with the Minnesota Housing Finance Agency under which the owner is obligated to extend any existing low-income affordability restrictions and any contract or agreement for rental assistance payments for the maximum term permitted, including any renewals thereof; and\n(2) the Minnesota Housing Finance Agency certifies that project reserves will be maintained at closing of the bond issue and budgeted in future years at the lesser of:\n(i) the level described in Minnesota Rules, part 4900.0010, subpart 7, item A, subitem (2), effective May 1, 1997; or\n(ii) the level of project reserves available prior to the bond issue, provided that additional money is available to accomplish repairs and replacements needed at the time of bond issue.\nPrior to the issuance of residential rental bonds, the developer of the project for which the bond proceeds will be used must enter into a 15-year agreement with the issuer that specifies the maximum rental rates of the rent-restricted units in the project and the income levels of the residents of the project occupying income-restricted units. Such rental rates and income levels must be within the limitations established under subdivision 1. The developer must annually certify to the issuer over the term of the agreement that the rental rates for the rent-restricted units are within the limitations under subdivision 1. The issuer may request individual certification of the income of residents of the income-restricted units. The commissioner may request from the issuer a copy of the annual certification prepared by the developer. The commissioner may require the issuer to request individual certification of all residents of the income-restricted units.\nThe issuer shall monitor project compliance with the rental rate and income level requirements under subdivision 1. The issuer may issue an order of noncompliance if a project is found by the issuer to be out of compliance with the rental rate or income level requirements under subdivision 1. The owner or owners of the project shall pay a penalty to the issuer equal to one-half of one percent of the total amount of bonds issued for the project under this chapter if the issuer issues an order of noncompliance. For each additional year a project is out of compliance, the annual penalty must be increased by one-half of one percent of the total amount of bonds issued under this chapter for the project. The issuer may waive insubstantial violations.",
	"repealed": false
}