{
	"id": "16B.98",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.98",
	"title": "16B.98 GRANTS MANAGEMENT PROCESS.",
	"text": "(a) As a condition of receiving a grant from an appropriation of state funds, the recipient of the grant must agree to minimize administrative costs. The granting agency is responsible for negotiating appropriate limits to these costs so that the state derives the optimum benefit for grant funding.\n(b) This section does not apply to general obligation grants as defined by section 16A.695 and also capital project grants to political subdivisions as defined by section 16A.86.\nAn employee of the executive branch involved directly or indirectly in grants processes, at any level, is subject to the code of ethics in section 43A.38.\n(a) The commissioner must develop policies regarding code of ethics and conflict of interest designed to prevent conflicts of interest for employees, committee members, or others involved in the recommendation, awarding, and administration of grants. The policies must apply to employees who are directly or indirectly in the grants process, which may include the following:\n(1) developing request for proposals or evaluation criteria;\n(2) drafting, recommending, awarding, amending, revising, or entering into grant agreements;\n(3) evaluating or monitoring performance; or\n(4) authorizing payments.\n(b) The policies must include:\n(1) a process to make all parties to the grant aware of policies and laws relating to conflict of interest, and training on how to avoid and address potential conflicts; and\n(2) a process under which those who have a conflict of interest or a potential conflict of interest must disclose the matter.\n(c) If the employee, appointing authority, or commissioner determines that a conflict of interest exists, the matter shall be assigned to another employee who does not have a conflict of interest. If it is not possible to assign the matter to an employee who does not have a conflict of interest, interested personnel shall be notified of the conflict and the employee may proceed with the assignment.\nA state employee who discovers evidence of violation of laws or rules governing grants is encouraged to report the violation or suspected violation to the employee's supervisor, the commissioner or the commissioner's designee, or the legislative auditor. The legislative auditor shall report to the Legislative Audit Commission if there are multiple complaints about the same agency. The auditor's report to the Legislative Audit Commission under this section must disclose only the number and type of violations alleged. An employee making a good faith report under this section has the protections provided for under section 181.932, prohibiting the employer from discriminating against the employee.\n(a) A grant agreement and amendments are not valid and do not bind unless:\n(1) the grant agreement and amendments have been executed by the head of the agency or a delegate who is party to the grant;\n(2) the grant agreement and amendments have been approved by the commissioner;\n(3) the accounting system shows an encumbrance for the amount of the grant in accordance with policy approved by the commissioner except as provided in subdivision 11; and\n(4) the grant agreement and amendments include an effective date that references either section 16C.05, subdivision 2, or 16B.98, subdivisions 5 and 7, as determined by the granting agency.\n(b) The combined grant agreement and amendments must not exceed five years without specific, written approval by the commissioner according to established policy, procedures, and standards, or unless the commissioner determines that a longer duration is in the best interest of the state.\n(c) A fully executed copy of the grant agreement with all amendments and other required records relating to the grant must be kept on file at the granting agency for a time equal to that required of grantees in subdivision 8.\n(d) Grant agreements must comply with policies established by the commissioner for minimum grant agreement standards and practices.\n(e) The attorney general may periodically review and evaluate a sample of state agency grants to ensure compliance with applicable laws.\nA granting agency shall diligently administer and monitor any grant it has entered into. A granting agency must report to the commissioner at any time at the commissioner's request on the status of any grant to which the agency is a party.\nPayments to the grantee may not be issued until the grant agreement is fully executed. Encumbrances for grants issued by June 30 may be certified for a period of one year beyond the year in which the funds were originally appropriated as provided by section 16A.28, subdivision 6.\n(a) A grant agreement made by an executive agency must include an audit clause that provides that the books, records, documents, and accounting procedures and practices of the grantee or other party that are relevant to the grant or transaction are subject to examination by the commissioner, the granting agency and either the legislative auditor or the state auditor, as appropriate, for a minimum of six years from the grant agreement end date, receipt and approval of all final reports, or the required period of time to satisfy all state and program retention requirements, whichever is later. If a grant agreement does not include an express audit clause, the audit authority under this subdivision is implied.\n(b) If the granting agency is a local unit of government, and the governing body of the local unit of government requests that the state auditor examine the books, records, documents, and accounting procedures and practices of the grantee or other party according to this subdivision, the granting agency shall be liable for the cost of the examination. If the granting agency is a local unit of government, and the grantee or other party requests that the state auditor examine all books, records, documents, and accounting procedures and practices related to the grant, the grantee or other party that requested the examination shall be liable for the cost of the examination.\nThe attorney general may pursue remedies available by law to avoid the obligation of an agency to pay under a grant or to recover payments made if activities under the grant are so unsatisfactory, incomplete, or inconsistent that payment would involve unjust enrichment. The contrary opinion of the granting agency does not affect the power of the attorney general under this subdivision.\nNotwithstanding any other law, an agency may not require an Indian tribe or band to deny its sovereignty as a requirement or condition of a grant with an agency.\nNotwithstanding subdivision 5, paragraph (a), clause (2), or section 16C.05, subdivision 2, paragraph (a), clause (3), agencies may permit a specifically named, legislatively appropriated, noncompetitive grant recipient to incur eligible expenses based on an agreed upon work plan and budget for up to 60 days prior to an encumbrance being established in the accounting system.\n(a) The head of the agency or delegate entering into a grant agreement in excess of $25,000 must submit a report to the commissioner who must make the report publicly available online.\n(b) The report must:\n(1) summarize the purpose of the grant;\n(2) state the amount provided to the grantee; and\n(3) include a written performance evaluation of the work done under the grant. The evaluation must include an appraisal of the grantee's timeliness, quality, and overall performance in meeting the terms and objectives of the grant. Grantees may request copies of evaluations prepared under this subdivision and may respond in writing. Grantee responses must be maintained with the grant file.\nNo action may be maintained by a grantee against an employee or agency who discloses information about a current or former grantee under subdivision 12, unless the grantee demonstrates by clear and convincing evidence that:\n(1) the information was false and defamatory;\n(2) the employee or agency knew or should have known the information was false and acted with malicious intent to injure the current or former grantee; and\n(3) the information was acted upon in a manner that caused harm to the current or former grantee.\nUnless amounts are otherwise appropriated for administrative costs, a state agency may retain up to five percent of the amount appropriated to the agency for grants enacted by the legislature and formula grants and up to ten percent for competitively awarded grants. This subdivision applies to appropriations made for new grant programs enacted on or after July 1, 2023. This subdivision does not apply to grants funded with an appropriation of proceeds from the sale of state general obligation bonds.",
	"repealed": false
}