{
	"id": "15B.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/15B.32",
	"title": "15B.32 STATE CAPITOL PRESERVATION COMMISSION.",
	"text": "(a) As used in this section and section 15B.36, the terms defined in this subdivision have the following meanings.\n(b) \"Commission\" means the State Capitol Preservation Commission created under this section.\n(c) \"Capitol Area\" means the geographic area defined in section 15B.02.\n(d) \"Board\" means the Capitol Area Architectural and Planning Board created under section 15B.03.\n(e) \"Predesign\" has the meaning given in section 16B.335, subdivision 3, paragraph (a).\nThe State Capitol Preservation Commission consists of 24 members, appointed as follows:\n(1) the governor;\n(2) the lieutenant governor;\n(3) the attorney general;\n(4) the chief justice of the supreme court, or the chief justice's designee, who shall be a member of the supreme court;\n(5) the majority leader of the senate or the majority leader's designee, who shall be a member of the senate;\n(6) the minority leader of the senate or the minority leader's designee, who shall be a member of the senate;\n(7) the speaker of the house or the speaker's designee, who shall be a member of the house of representatives;\n(8) the minority leader of the house of representatives or the minority leader's designee, who shall be a member of the house of representatives;\n(9) two members of the senate, including one member from the majority party appointed by the majority leader and one member from the minority party appointed by the minority leader;\n(10) two members of the house of representatives, including one member appointed by the speaker of the house and one member from the minority party appointed by the minority leader;\n(11) the chair and ranking minority member of the house of representatives committee with jurisdiction over capital investment and the chair and ranking minority member of the senate committee with jurisdiction over capital investment;\n(12) the commissioner of administration or the commissioner's designee;\n(13) the commissioner of public safety or the commissioner's designee;\n(14) the executive director of the Minnesota Historical Society or the executive director's designee;\n(15) the executive secretary of the Capitol Area Architectural and Planning Board; and\n(16) four public members appointed by the governor.\n(a) A member serving on the commission because the member or the appointing authority for the member holds an elected or appointed office shall serve on the commission as long as the member or the appointing authority holds the office.\n(b) Public members of the commission shall serve two-year terms. The public members may not serve for more than three consecutive terms.\n(c) The removal of members and filling of vacancies on the commission are as provided in section 15.059.\n(a) The governor is the chair of the commission. The lieutenant governor is the vice-chair of the commission and may act as the chair of the commission in the absence of the governor. The governor may designate a staff member to attend commission meetings and vote on the governor's behalf in the absence of the governor.\n(b) The commission shall meet at least annually and at other times at the call of the chair. Meetings of the commission are subject to chapter 13D.\nThe commissioner of administration shall provide administrative support to the commission.\n(a) The commission:\n(1) shall exercise ongoing coordination of the protection, risk management, and preservation of the Capitol building;\n(2) shall consult with and advise the commissioner of administration, the board, and the Minnesota Historical Society regarding their applicable statutory responsibilities for and in the Capitol building;\n(3) shall develop a comprehensive, multiyear maintenance and preservation plan for the Capitol building, review the plan periodically, and, as appropriate, amend and modify the plan. The plan shall identify and address the long-term maintenance and preservation requirements of the Capitol building and shall take into account the recommendations of the long-range strategic plan under section 16B.24;\n(4) shall develop and implement a plan to ensure a welcoming and accessible Minnesota State Capitol for all Minnesotans and visitors;\n(5) shall develop and implement a comprehensive financial plan to fund the ongoing preservation of the Capitol building;\n(6) shall provide annual reports about the condition of the Capitol building and its needs, as well as all activities related to the preservation of the Capitol building;\n(7) may solicit gifts, grants, or donations of any kind from any private or public source to carry out the purposes of this section. For purposes of this section, the commissioner of administration may expend money appropriated by the legislature for these purposes in the same manner as private persons, firms, corporations, and associations make expenditures for these purposes. All gifts, grants, or donations received by the commission shall be deposited in a State Capitol preservation account established in the special revenue fund. Money in the account is appropriated to the commissioner of administration for the activities of clause (4), the commission, and implementation of the predesign plan under this section. Appropriations under this clause do not cancel and are available until expended; and\n(8) shall approve a program of art exhibits to encourage public visits to the Capitol and to be displayed in a space in the Capitol building that is listed in section 15B.36, subdivision 1, before an exhibit that is part of the program can be displayed for two weeks or longer. When considering recommendations made under section 15B.36, the commission must approve or reject recommended exhibits as a whole and may not approve or reject individual pieces within a recommended exhibit. The approved program must address the proposed schedule, how it addresses adopted themes for art in the Capitol, and the type or types of artwork.\n(b) By January 15 of each year, the commission shall report to the chairs and ranking minority members of the legislative committees with jurisdiction over state government operations, capital investment, finance, ways and means, and legacy finance regarding the maintenance and preservation needs of the Capitol building, including recommendations adopted by the commission, the comprehensive financial plan required under paragraph (a), clause (5), and any proposed draft legislation necessary to implement the recommendations of the commission.\n[Repealed, 2014 c 286 art 8 s 40]",
	"repealed": false
}