{
	"id": "124D.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.19",
	"title": "124D.19 COMMUNITY EDUCATION PROGRAMS; ADVISORY COUNCIL.",
	"text": "Each school board may initiate a community education program in its district and provide for the general supervision of the program. Each board may, as it considers appropriate, employ community education staff to further the purposes of the community education program.\nEach board must provide for an advisory council to consist of members who represent: various service organizations; churches; public and nonpublic schools; local government including elected officials; public and private nonprofit agencies serving youth and families; parents; youth; park, recreation or forestry services of municipal or local government units located in whole or in part within the boundaries of the school district; and any other groups participating in the community education program in the school district.\n(a) Except as provided under paragraphs (b) and (c), each board shall employ a licensed community education director. The board shall submit the name of the person who is serving as director of community education under this section on the district's annual community education report to the commissioner.\n(b) A board may apply to the Minnesota Board of School Administrators under Minnesota Rules, part 3512.5300, subpart 11, for authority to use an individual who is not licensed as a community education director.\n(c) A board of a district with a total population of 6,000 or less may identify an employee who holds a valid superintendent license under Minnesota Rules, chapter 3512, to serve as director of community education. To be eligible for an exception under this paragraph, the board shall certify in writing to the commissioner that the district has not placed a licensed director of community education on unrequested leave. A principal serving as a community education director under this paragraph on June 1, 2011, may continue to serve in that capacity.\nThe council must function in cooperation with the community education director in an advisory capacity in the interest of promoting the goals and objectives of sections 124D.18 and 124D.19.\nEach council must adopt a policy to reduce and eliminate program duplication within the district.\nNotwithstanding any law to the contrary, during the summer a school district may offer community education programs to elementary and secondary pupils. The district may use community education revenue received pursuant to section 124D.20 and charge fees for the cost of the programs.\nA board may offer, as part of a community education program, a program for adults with disabilities. Boards are encouraged to offer programs cooperatively with other districts and organizations. Programs may not be limited to district residents. Programs may include:\n(1) services enabling the adults to participate in community activities or community education classes;\n(2) classes specifically for adults with disabilities;\n(3) outreach activities to identify adults needing service;\n(4) activities to increase public awareness of the roles of people with disabilities;\n(5) activities to enhance the role of people with disabilities in the community; and\n(6) other direct and indirect services and activities benefiting adults with disabilities.\n(a) Beginning July 1, 2024, and at least once every five years thereafter, a district's community education advisory council must review and approve the district's adults with disabilities program and submit a statement of assurances to the commissioner in the form and manner determined by the commissioner. The program must seek feedback from adults with disabilities and other community organizations providing services to adults with disabilities.\n(b) Each school district with an adults with disabilities program must include at least the following information about its adults with disabilities program in its annual community education report under subdivision 14:\n(1) a summary of the characteristics of the people served by the program;\n(2) a description of the program services and activities;\n(3) the most recent program budget;\n(4) a summary of the participation by adults with disabilities in developing the program;\n(5) an assessment of the needs of adults with disabilities; and\n(6) a description of cooperative efforts with community organizations.\nA district advisory council may prepare a youth development plan. The council is encouraged to use the state guidelines when developing the local plan. The school board may approve the youth development plan.\n(a) A school board may offer, as part of a community education program with a youth development program, a youth service program that provides young people with meaningful opportunities to become involved in their community, develop individual capabilities, make career connections, seek support networks and services, become active citizens, and address community needs through youth service. The board may award up to one credit, or the equivalent, toward graduation for a pupil who completes the youth service requirements of the district. The community education advisory council, after considering the results of the commissioner's study under section 124D.50, subdivision 1, must design the program in cooperation with the district planning, evaluating and reporting committee and local organizations that train volunteers or need volunteers' services.\n(b) Programs must include:\n(1) preliminary training for pupil volunteers conducted, when possible, by organizations experienced in such training;\n(2) supervision of the pupil volunteers to ensure appropriate placement and adequate learning opportunity;\n(3) sufficient opportunity, in a positive setting for human development, for pupil volunteers to develop general skills in preparation for employment, to enhance self-esteem and self-worth, and to give genuine service to their community;\n(4) integration of academic learning with the service experience; and\n(5) integration of youth community service with elementary and secondary curriculum.\n(c) Youth service projects include, but are not limited to, the following:\n(1) human services for the elderly, including home care and related services;\n(2) tutoring and mentoring;\n(3) training for and providing emergency services;\n(4) services at extended day programs;\n(5) environmental services; and\n(6) service-learning programs in which schools, including postsecondary schools, and employers work together with young people to provide them with meaningful opportunities for community service and with the academic and technical skills that employers require.\n(d) A youth service project must have a community sponsor that may be a governmental unit or nonprofit organization. To assure that pupils provide additional services, each sponsor must assure that pupil services do not displace employees or reduce the workload of any employee.\n(e) The commissioner shall assist districts in planning youth service programs, implementing programs, and developing recommendations for obtaining community sponsors.\n(a) A school board may offer, as part of a community education program, a school-age care program for children from kindergarten through grade 6 for the purpose of expanding students' learning opportunities. If the school board chooses not to offer a school-age care program, it may allow an appropriate insured community group, for profit entity or nonprofit organization to use available school facilities for the purpose of offering a school-age care program.\n(b) A school-age care program must include the following:\n(1) adult supervised programs while school is not in session;\n(2) parental involvement in program design and direction;\n(3) partnerships with the kindergarten through grade 12 system, and other public, private, or nonprofit entities;\n(4) opportunities for trained secondary school pupils to work with younger children in a supervised setting as part of a community service program; and\n(5) access to available school facilities, including the gymnasium, sports equipment, computer labs, and media centers, when not otherwise in use as part of the operation of the school. The school district may establish reasonable rules relating to access to these facilities and may require that:\n(i) the organization request access to the facilities and prepare and maintain a schedule of proposed use;\n(ii) the organization provide evidence of adequate insurance to cover the activities to be conducted in the facilities; and\n(iii) the organization prepare and maintain a plan demonstrating the adequacy and training of staff to supervise the use of the facilities.\n(c) The district may charge a sliding fee based upon family income for school-age care programs. The district may receive money from other public or private sources for the school-age care program. The board of the district must develop standards for school-age child care programs. The commissioner of education may not adopt rules for school-age care programs.\n(d) The district shall maintain a separate account within the community services fund for all funds related to the school-age care program.\n(e) A district is encouraged to coordinate the school-age care program with its special education, vocational education, adult basic education, early childhood family education programs, kindergarten through grade 12 instruction and curriculum services, youth development and youth service agencies, and with related services provided by other governmental agencies and nonprofit agencies.\nEach district operating a community education program under this section may establish a youth after-school enrichment program to maintain and expand participation by school-age youth in supervised activities during nonschool hours. The youth after-school enrichment programs must include activities that support development of social, mental, physical, and creative abilities of school-age youth; provide structured youth programs during high-risk times; and design programming to promote youth leadership development and improved academic performance.\nThe goals of youth after-school enrichment programs are to:\n(1) collaborate with and leverage existing community resources that have demonstrated effectiveness;\n(2) reach out to children and youth, including at-risk youth, in the community;\n(3) increase the number of children participating in adult-supervised programs during nonschool hours;\n(4) support academic achievement; and\n(5) increase skills in technology, the arts, sports, and other activities.\nEach district offering a community education program under this section must annually report to the department information regarding each community education program, including youth after-school enrichment programs, that receives aid or levy.",
	"repealed": false
}