{
	"id": "148.909",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.909",
	"title": "148.909 LICENSURE FOR VOLUNTEER PRACTICE.",
	"text": "Retired providers who are or were licensed, certified, or registered to practice psychology in any jurisdiction may apply to the board for licensure to practice psychology as a licensed psychologist-volunteer provided the applicant meets the following requirements and the requirements in subdivision 2:\n(1) submits to the board a notarized application for licensure as a licensed psychologist-volunteer;\n(2) is of good moral character and has no complaints or corrective or disciplinary action pending in any jurisdiction;\n(3) if not currently licensed by the board, passes the most recent version of the professional responsibility examination administered by the board and pays the fee associated with sitting for the examination; and\n(4) pays the nonrefundable fee for licensure established in subdivision 8.\nAn applicant who was formerly licensed by the board must meet the education, training, and experience requirements that were in place at the time of the original license. An applicant who was not formerly licensed by the board must meet the current requirements for licensure.\nA provider licensed under this section shall only provide psychological services on a pro bono basis and shall not receive a commission, rebate, or remuneration, directly or indirectly, except that a provider may accept reimbursement for reasonable expenses incurred due to the provision of volunteer psychological services.\nA provider licensed under this section shall receive a license documenting that they are licensed for volunteer practice.\nIn addition to the descriptions allowed in section 148.96, providers granted licensure under this section shall use the designation \"LP-V\" to designate licensed psychologist-volunteer.\nProviders licensed under this section who request to return to their previous licensure status may do so upon submission of a written application provided by the board and payment of the applicable licensure fee. Providers may not concurrently hold a license as a licensed psychologist and a license as a licensed psychologist-volunteer.\n[Repealed, 1Sp2017 c 6 art 11 s 56]\nThe fee for licensure as a licensed psychologist-volunteer shall be 50 percent of the fee for licensure as a licensed psychologist. A provider licensed under this section shall not be subject to special board fees.\nA provider licensed under this section is subject to all of the provisions in the Minnesota Psychology Practice Act, violation of which is grounds for disciplinary action in accordance with section 148.941.",
	"repealed": false
}