{
	"id": "62A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.29",
	"title": "62A.29 SURETY BOND OR SECURITY FOR CERTAIN HEALTH BENEFIT PLANS.",
	"text": "Any employer, except the state and its political subdivisions as defined in section 65B.43, subdivision 20, who provides a health benefit plan to its Minnesota employees, which is to some extent self-insured by the employer, and who purchases stop-loss insurance coverage, or any other insurance coverage, in connection with the health benefit plan, shall annually file with the commissioner, within 60 days of the end of the employer's fiscal year, security acceptable to the commissioner in an amount specified under subdivision 2, or a surety bond in the form and amount prescribed by subdivisions 2 and 3. An acceptable surety bond is one issued by a corporate surety authorized by the commissioner to transact this business in the state of Minnesota for the purposes of this section. The term \"Minnesota employees\" includes any Minnesota resident who is employed by the employer.\nThe amount of surety bond or acceptable security required by subdivision 1 shall be equal to one-fourth of the projected annual medical and hospital expenses to be incurred by the employer or $1,000, whichever is greater, with respect to its Minnesota employees by reason of the portion of the employer's health benefit plan which is self-insured by the employer.\nThe surety bond shall provide as follows:\nSURETY BOND\nKNOW ALL PERSONS BY THESE PRESENTS: That (entity to be bonded), of (location), (hereinafter called the \"principal\"), as principal, and (bonding company name), a (name of state) corporation, of (location) (hereinafter called the \"surety\"), as surety are held and firmly bound unto the commissioner of commerce of the state of Minnesota for the use and benefit of Minnesota residents entitled to health benefits from the principal in the sum of ($.........), for the payment of which well and truly to be made, the principal binds itself, its successor and assigns, and the surety binds itself and its successors and assigns, jointly and severally, firmly by these presents.\nWHEREAS, in accordance with section (......) of the Minnesota Statute, principal is required to file a surety bond with the commissioner of commerce of the state of Minnesota.\nNOW, THEREFORE, the condition of this obligation is such that if the said principal shall, according to the terms, provisions, and limitations of principals' health benefit program for its Minnesota employees, pay all of its liabilities and obligations, including all benefits as provided in the attached plan, then, this obligation shall be null and void, otherwise to remain in full force and effect, subject, however, to the following terms and conditions:\n1. The liability of the surety is limited to the payment of the benefits of the employee benefit plan which are payable by the principal and within the amount of the bond. The surety shall be bound to payments owed by the principal for obligations arising from a default of the principal or any loss incurred during the period to which the bond applies.\n2. In the event of any default on the part of the principal to abide by the terms and provision of the attached plan, the commissioner of commerce may, upon ten-days notice to the surety and opportunity to be heard, require the surety to pay all of the principal's past and future obligations under the attached plan with respect to the principal's Minnesota employees.\n3. Service on the surety shall be deemed to be service on the principals.\n4. This bond shall be in effect from ............... to ................, and may not be canceled by either the surety or the principal.\n5. Any Minnesota employee of principal aggrieved by a default of principal under the attached plan, and/or the commissioner of commerce on behalf of any such employee, may enforce the provisions of this bond.\n6. This bond shall become effective at (time of day, month, day, year).\nIN TESTIMONY WHEREOF, said principals and said surety have caused this instrument to be signed by their respective, duly authorized officers and their corporate seals to be hereunto affixed this (day, month, year).\nThe commissioner of revenue shall deny any business tax deduction to an employer for the employer's contribution to a health plan for the period which the employer fails to comply with this section. This section does not apply to trusts established under chapter 62H which have been approved by the commissioner.\nAn employer subject to this section may petition the commissioner to, and the commissioner may, allow the use of a surety bond not in the form specified in subdivision 3, or grant a reduction in the amount of the surety bond or security required.\nIn reviewing a petition submitted under this subdivision, the commissioner must consider, in addition to any other factors, information provided by the petitioner in regard to the following:\n(1) the size of the petitioner's business;\n(2) the number of employees;\n(3) the cost of providing the bond or security and the effect the cost will have on the petitioner's financial condition;\n(4) whether the cost of the bond or security will impair the petitioner's ability to self-insure; and\n(5) the petitioner's likelihood of being able to meet the petitioner's future obligations in regard to the health plan.",
	"repealed": false
}