{
	"id": "148.622",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.622",
	"title": "148.622 BOARD OF DIETETICS AND NUTRITION PRACTICE.",
	"text": "The Board of Dietetics and Nutrition Practice consists of seven members appointed by the governor.\nMembers of the board must have been residents of the state of Minnesota for two years immediately preceding appointment and must represent various geographic areas of the state and various employment settings, as required by this section. Two members must be dietitians registered with the commission with at least three years of dietetics practice in Minnesota. Two members must be nutritionists with at least three years of nutrition practice in Minnesota. The professional members first appointed need not be licensed under this chapter for appointment to their first terms on the board, but must possess the qualifications necessary for licensure under this chapter. Three other members must be public members as defined under section 214.02. Two of the public members must be consumers of nutrition care services or caregivers of those utilizing such services.\n(a) Members must be appointed for staggered terms of four years, with terms beginning August 1 of each year. The terms of the initial board members must be determined by lot as follows: one member must be appointed for a term that expires August 1, 2000; two members must be appointed for terms that expire August 1, 1998; two members must be appointed for terms that expire August 1, 1997; and two members must be appointed for terms that expire August 1, 1995. Members of the board serve until the expiration of the term to which they have been appointed or until their successors have qualified. A person may not be appointed to serve more than two consecutive terms.\n(b) The board shall organize annually and select a chair and vice-chair.\n(c) Four members of the board, including two professional members and two public members, constitute a quorum to do business.\n(d) The board shall hold at least two regular meetings each year. Additional meetings may be held at the call of the chair or at the written request of any three members of the board. At least 14 days' written advance notice of the board meeting is required.\n(e) Board members receive compensation for their services in accordance with section 15.0575.",
	"repealed": false
}