{
	"id": "514.981",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.981",
	"title": "514.981 MEDICAL ASSISTANCE LIEN.",
	"text": "(a) Subject to sections 514.980 to 514.985, payments made by a medical assistance agency to provide medical assistance benefits to a medical assistance recipient who owns property in this state or to the recipient's spouse constitute a lien in favor of the agency upon all real property that is owned by the medical assistance recipient on or after the time when the recipient is institutionalized.\n(b) The amount of the lien is limited to the same extent as a claim against the estate under section 256B.15, subdivision 2.\n(a) A medical assistance lien attaches and becomes enforceable against specific real property as of the date when the following conditions are met:\n(1) payments have been made by an agency for a medical assistance benefit;\n(2) notice and an opportunity for a hearing have been provided under paragraph (b);\n(3) a lien notice has been filed as provided in section 514.982;\n(4) if the property is registered property, the lien notice has been memorialized on the certificate of title of the property affected by the lien notice; and\n(5) all restrictions against enforcement have ceased to apply.\n(b) An agency may not file a medical assistance lien notice until the medical assistance recipient or the recipient's legal representative has been sent, by certified or registered mail, written notice of the agency's lien rights and there has been an opportunity for a hearing under section 256.045. In addition, the agency may not file a lien notice unless the agency determines as medically verified by the recipient's attending physician, advanced practice registered nurse, or physician assistant that the medical assistance recipient cannot reasonably be expected to be discharged from a medical institution and return home.\n(c) An agency may not file a medical assistance lien notice against real property while it is the home of the recipient's spouse.\n(d) An agency may not file a medical assistance lien notice against real property that was the homestead of the medical assistance recipient or the recipient's spouse when the medical assistance recipient received medical institution services if any of the following persons are lawfully residing in the property:\n(1) a child of the medical assistance recipient if the child is under age 21 or is blind or permanently and totally disabled according to the Supplemental Security Income criteria;\n(2) a child of the medical assistance recipient if the child resided in the homestead for at least two years immediately before the date the medical assistance recipient received medical institution services, and the child provided care to the medical assistance recipient that permitted the recipient to live without medical institution services; or\n(3) a sibling of the medical assistance recipient if the sibling has an equity interest in the property and has resided in the property for at least one year immediately before the date the medical assistance recipient began receiving medical institution services.\n(e) A medical assistance lien applies only to the specific real property described in the lien notice.\nA medical assistance lien notice remains effective from the time it is filed until it can be disregarded under sections 514.980 to 514.985. A medical assistance lien that has attached to specific real property continues until the lien is satisfied, becomes unenforceable under subdivision 6, or is released and discharged under subdivision 5.\nA medical assistance lien that attaches to specific real property is subject to the rights of any other person whose interest in the real property is perfected before a lien notice has been filed under section 514.982, including:\n(a) an owner, other than the recipient or recipient's spouse;\n(b) a purchaser;\n(c) a holder of a mortgage or security interest; or\n(d) a judgment lien creditor.\nThe rights of the other person have the same protections against a medical assistance lien as are afforded against a judgment lien that arises out of an unsecured obligation and that arises as of the time of the filing of the medical assistance lien notice under section 514.982. A medical assistance lien is inferior to a lien for taxes or special assessments or other lien that would be superior to the perfected lien of a judgment creditor.\n(a) An agency that files a medical assistance lien notice shall release and discharge the lien in full if:\n(1) the medical assistance recipient is discharged from the medical institution and returns home;\n(2) the medical assistance lien is satisfied;\n(3) the agency has received reimbursement for the amount secured by the lien or a legally enforceable agreement has been executed providing for reimbursement of the agency for that amount; or\n(4) the medical assistance recipient, if single, or the recipient's surviving spouse, has died, and a claim may not be filed against the estate of the decedent under section 256B.15, subdivision 3.\n(b) Upon request, the agency that files a medical assistance lien notice shall release a specific parcel of real property from the lien if:\n(1) the property is or was the homestead of the recipient's spouse during the time of the medical assistance recipient's institutionalization, or the property is or was attributed to the spouse under section 256B.059, subdivision 3 or 4, and the spouse is not receiving medical assistance benefits;\n(2) the property would be exempt from a claim against the estate under section 256B.15, subdivision 4;\n(3) the agency receives reimbursement, or other collateral sufficient to secure payment of reimbursement, in an amount equal to the lesser of the amount secured by the lien, or the amount the agency would be allowed to recover upon enforcement of the lien against the specific parcel of property if the agency attempted to enforce the lien on the date of the request to release the lien; or\n(4) the medical assistance lien cannot lawfully be enforced against the property because of an error, omission, or other material defect in procedure, description, identity, timing, or other prerequisite to enforcement.\n(c) The agency that files a medical assistance lien notice may release the lien if the attachment or enforcement of the lien is determined by the agency to be contrary to the public interest.\n(d) The agency that files a medical assistance lien notice shall execute the release of the lien and file the release as provided in section 514.982, subdivision 2.\n(a) A medical assistance lien is a lien on the real property it describes for a period of ten years from the date it attaches according to section 514.981, subdivision 2, paragraph (a), except as otherwise provided for in sections 514.980 to 514.985. The agency may renew a medical assistance lien for an additional ten years from the date it would otherwise expire by recording or filing a certificate of renewal before the lien expires. The certificate shall be recorded or filed in the office of the county recorder or registrar of titles for the county in which the lien is recorded or filed. The certificate must refer to the recording or filing data for the medical assistance lien it renews. The certificate need not be attested, certified, or acknowledged as a condition for recording or filing. The registrar of titles or the recorder shall file, record, index, and return the certificate of renewal in the same manner as provided for medical assistance liens in section 514.982, subdivision 2.\n(b) A medical assistance lien is not enforceable against the real property of an estate to the extent there is a determination by a court of competent jurisdiction, or by an officer of the court designated for that purpose, that there are insufficient assets in the estate to satisfy the agency's medical assistance lien in whole or in part because of the homestead exemption under section 256B.15, subdivision 4, the rights of the surviving spouse or minor children under section 524.2-403, paragraphs (a) and (b), or claims with a priority under section 524.3-805, paragraph (a), clauses (1) to (4). For purposes of this section, the rights of the decedent's adult children to exempt property under section 524.2-403, paragraph (b), shall not be considered costs of administration under section 524.3-805, paragraph (a), clause (1).\n(c) Notwithstanding any law or rule to the contrary, the provisions in clauses (1) to (7) apply if a life estate subject to a medical assistance lien ends according to its terms, or if a medical assistance recipient who owns a life estate or any interest in real property as a joint tenant that is subject to a medical assistance lien dies.\n(1) The medical assistance recipient's life estate or joint tenancy interest in the real property shall not end upon the recipient's death but shall merge into the remainder interest or other interest in real property the medical assistance recipient owned in joint tenancy with others. The medical assistance lien shall attach to and run with the remainder or other interest in the real property to the extent of the medical assistance recipient's interest in the property at the time of the recipient's death as determined under this section.\n(2) If the medical assistance recipient's interest was a life estate in real property, the lien shall be a lien against the portion of the remainder equal to the percentage factor for the life estate of a person the medical assistance recipient's age on the date the life estate ended according to its terms or the date of the medical assistance recipient's death as listed in the Life Estate Mortality Table in the health care program's manual.\n(3) If the medical assistance recipient owned the interest in real property in joint tenancy with others, the lien shall be a lien against the portion of that interest equal to the fractional interest the medical assistance recipient would have owned in the jointly owned interest had the medical assistance recipient and the other owners held title to that interest as tenants in common on the date the medical assistance recipient died.\n(4) The medical assistance lien shall remain a lien against the remainder or other jointly owned interest for the length of time and be renewable as provided in paragraph (a).\n(5) Subdivision 5, paragraph (a), clause (4), paragraph (b), clauses (1) and (2); and subdivision 6, paragraph (b), do not apply to medical assistance liens which attach to interests in real property as provided under this subdivision.\n(6) The continuation of a medical assistance recipient's life estate or joint tenancy interest in real property after the medical assistance recipient's death for the purpose of recovering medical assistance provided for in sections 514.980 to 514.985 modifies common law principles holding that these interests terminate on the death of the holder.\n(7) Notwithstanding any law or rule to the contrary, no release, satisfaction, discharge, or affidavit under section 256B.15 shall extinguish or terminate the life estate or joint tenancy interest of a medical assistance recipient subject to a lien under sections 514.980 to 514.985 on the date the recipient dies.\n(8) The provisions of clauses (1) to (7) do not apply to a homestead owned of record, on the date the recipient dies, by the recipient and the recipient's spouse as joint tenants with a right of survivorship. Homestead means the real property occupied by the surviving joint tenant spouse as their sole residence on the date the recipient dies and classified and taxed to the recipient and surviving joint tenant spouse as homestead property for property tax purposes in the calendar year in which the recipient dies. For purposes of this exemption, real property the recipient and their surviving joint tenant spouse purchase solely with the proceeds from the sale of their prior homestead, own of record as joint tenants, and qualify as homestead property under section 273.124 in the calendar year in which the recipient dies and prior to the recipient's death shall be deemed to be real property classified and taxed to the recipient and their surviving joint tenant spouse as homestead property in the calendar year in which the recipient dies. The surviving spouse, or any person with personal knowledge of the facts, may provide an affidavit describing the homestead property affected by this clause and stating facts showing compliance with this clause. The affidavit shall be prima facie evidence of the facts it states. All provisions in this paragraph related to the continuation of a recipient's life estate or joint tenancy interests in real property after the recipient's death, for the purpose of recovering medical assistance but not alternative care, are effective only for life estates and joint tenancy interests established on or after August 1, 2003.",
	"repealed": false
}