{
	"id": "259.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.13",
	"title": "259.13 PERSONS WITH FELONY CONVICTION; NAME CHANGES.",
	"text": "(a) A person with a felony conviction under Minnesota law or the law of another state or federal jurisdiction shall serve a notice of application for a name change on the prosecuting authority that obtained the conviction against the person when seeking a name change through one of the following procedures:\n(1) an application for a name change under section 259.10;\n(2) a request for a name change in conjunction with a marriage dissolution under section 518.27; or\n(3) a request for a name change under section 259.14.\nIf the conviction is from another state or federal jurisdiction, notice of application must also be served on the attorney general.\n(b) A person who seeks a name change under section 259.10 or 518.27 shall file proof of service with the court as part of the name change request.\n(c) The name change request may not be granted during the 30-day period provided for in subdivision 2 or, if an objection is filed under subdivision 2, until satisfaction of the requirements in subdivision 3 or 4. Nothing in this section shall delay the granting of a marriage license under section 517.08, which may be granted without the name change.\nAt any time within 30 days from the date of service of the notice of application for a name change under this section, the prosecuting authority or the attorney general may file an objection to the application for a name change. The objection may be made on the basis that the request aims to defraud or mislead, is not made in good faith, will cause injury to a person, or will compromise public safety. If an objection to the application for a name change is filed within this time period, the court may not grant the name change request, and the county may not allow the name change as part of a marriage license.\nA person who seeks a name change may contest the prosecuting authority's or attorney general's objection by filing a motion with the court for an order permitting the requested name change. Except as provided in subdivision 4, no name change shall be granted unless the person requesting it proves by clear and convincing evidence that the request is not based upon an intent to defraud or mislead, is made in good faith, will not cause injury to a person, and will not compromise public safety.\nThe court shall grant a name change if failure to allow it would infringe on a constitutional right of the person.\n(a) Except as provided in paragraph (b), a person seeking a name change under this section may proceed in forma pauperis only when the failure to allow the name change would infringe upon a constitutional right.\n(b) A court shall not require a person with a felony conviction to pay filing fees for a name change application provided that the person files the action within 180 days after the marriage and submits to the court a certified copy of the marriage certificate.\nA person who knowingly violates this section is guilty of a gross misdemeanor.",
	"repealed": false
}