{
	"id": "13D.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/13D.01",
	"title": "13D.01 MEETINGS MUST BE OPEN TO THE PUBLIC; EXCEPTIONS.",
	"text": "All meetings, including executive sessions, must be open to the public\n(a) of a state\n(1) agency,\n(2) board,\n(3) commission, or\n(4) department,\nwhen required or permitted by law to transact public business in a meeting;\n(b) of the governing body of a\n(1) school district however organized,\n(2) unorganized territory,\n(3) county,\n(4) statutory or home rule charter city,\n(5) town, or\n(6) other public body;\n(c) of any\n(1) committee,\n(2) subcommittee,\n(3) board,\n(4) department, or\n(5) commission,\nof a public body; and\n(d) of the governing body or a committee of:\n(1) a statewide public pension plan defined in section 356A.01, subdivision 24; or\n(2) a local public pension plan governed by sections 424A.091 to 424A.096, or chapter 354A, or Laws 2013, chapter 111, article 5, sections 31 to 42.\nThis chapter does not apply\n(1) to meetings of the commissioner of corrections;\n(2) to a state agency, board, or commission when it is exercising quasi-judicial functions involving disciplinary proceedings; or\n(3) as otherwise expressly provided by statute.\nBefore closing a meeting, a public body shall state on the record the specific grounds permitting the meeting to be closed and describe the subject to be discussed.\n(a) The votes of the members of the state agency, board, commission, or department; or of the governing body, committee, subcommittee, board, department, or commission on an action taken in a meeting required by this section to be open to the public must be recorded in a journal or minutes.\n(b) The vote of each member must be recorded on each appropriation of money, except for payments of judgments, claims, and amounts fixed by statute.\nThe journal or any minutes used to record votes of a meeting subject to this chapter must be open to the public during all normal business hours where records of the public body are kept.\n(a) In any meeting which under subdivisions 1, 2, 4, and 5, and section 13D.02 must be open to the public, at least one copy of any printed materials relating to the agenda items of the meeting prepared or distributed by or at the direction of the governing body or its employees and:\n(1) distributed at the meeting to all members of the governing body;\n(2) distributed before the meeting to all members; or\n(3) available in the meeting room to all members;\nshall be available in the meeting room for inspection by the public while the governing body considers their subject matter.\n(b) This subdivision does not apply to materials classified by law as other than public as defined in chapter 13, or to materials relating to the agenda items of a closed meeting held in accordance with the procedures in section 13D.03 or other law permitting the closing of meetings.",
	"repealed": false
}