{
	"id": "611.272",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.272",
	"title": "611.272 ACCESS TO GOVERNMENT DATA.",
	"text": "The district public defender, the state public defender, or an attorney working for a public defense corporation under section 611.216 has access to the criminal justice data communications network described in section 299C.46, as provided in this section. Access to data under this section is limited to data necessary to prepare criminal cases in which the public defender has been appointed as follows:\n(1) access to data about witnesses in a criminal case shall be limited to records of criminal convictions, custody status, custody history, aliases and known monikers, race, probation status, identity of probation officer, and booking photos; and\n(2) access to data regarding the public defender's own client which includes, but is not limited to, criminal history data under section 13.87; juvenile offender data under section 299C.095; warrant information data under section 299C.115; incarceration data under section 299C.14; conditional release data under section 241.065; and diversion program data under section 299C.46, subdivision 5.\nThe public defender has access to data under this section, whether accessed via the integrated search service as defined in section 13.873 or other methods. The public defender does not have access to law enforcement active investigative data under section 13.82, subdivision 7; data protected under section 13.82, subdivision 17; confidential arrest warrant indices data under section 13.82, subdivision 19; or data systems maintained by a prosecuting attorney. The public defender has access to the data at no charge, except for the monthly network access charge under section 299C.46, subdivision 3, paragraph (b), and a reasonable installation charge for a terminal. Notwithstanding section 13.87, subdivision 3; 299C.46, subdivision 3, paragraph (b); 299C.48, or any other law to the contrary, there shall be no charge to public defenders for Internet access to the criminal justice data communications network.",
	"repealed": false
}