{
	"id": "114C.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/114C.12",
	"title": "114C.12 PROCEDURE TO ISSUE, AMEND, AND REVOKE.",
	"text": "The commissioner of the Pollution Control Agency shall:\n(1) ensure that the stakeholder group for each Minnesota XL permit includes members that represent diversity of stakeholders that emphasizes participation by members from the local community but does not exclude other stakeholders;\n(2) ensure that a decision-making process that seeks consensus is in place; and\n(3) ensure that reasonable technical assistance is provided to facilitate stakeholder understanding of the design, implementation, and evaluation of each Minnesota XL permit.\nThe Pollution Control Agency may issue, amend, or revoke Minnesota XL permits using the single permit and variance procedure in subdivision 4, notwithstanding conflicting state or local procedural requirements. If a Minnesota XL permit includes variances from applicable state rules or local ordinances or local regulations, the issuance or amendment of the permit constitutes adoption of a variance to such state rules or local ordinances or local regulations if the Minnesota XL permit identifies, in general terms, any state rules or local ordinances or local regulations being varied.\nAlthough subdivision 2 establishes the procedure for granting variances in a Minnesota XL permit, the agency in deciding whether to grant a variance must apply the substantive standards for granting a variance applicable to the state rule, local ordinance, or local regulation being varied or find that the variance either:\n(1) promotes reduction in overall levels of pollution beyond what is required by applicable law, consistent with the purposes of this chapter; or\n(2) reduces the administrative burden on state or local agencies or the permittee, provided that alternative monitoring, testing, notification, record keeping, or reporting requirements will provide the information needed by the state or local agency to ensure compliance.\n(a) The Pollution Control Agency must provide at least 30 days for public comment on the agency's proposed issuance, amendment, or revocation of a Minnesota XL permit. Before the start of the public comment period, the commissioner of the Pollution Control Agency must prepare a draft permit, permit amendment, or notice of permit revocation and a fact sheet that:\n(1) briefly describes the principal facts and the significant factual, legal, methodological, and policy questions considered by the commissioner and the commissioner's proposed determination;\n(2) briefly describes how the permit action proposed by the commissioner meets the criteria of section 114C.11 and furthers the policy of section 114C.01; and\n(3) identifies any rules that would be varied by the commissioner's proposed permit action.\n(b) The commissioner shall prepare a public notice of the proposed permit action that:\n(1) briefly describes the facility or activity that is the subject of the proposed permit action;\n(2) states the commissioner's proposed permit action and whether it includes a variance of any state rules or local ordinances or local regulations;\n(3) identifies an agency person to contact for additional information;\n(4) states that the draft permit, permit amendment, or notice of revocation and the fact sheet are available upon request;\n(5) states that comments may be submitted to the agency by the public during the comment period; and\n(6) describes the procedures that the agency will use to make a final decision, including how persons may request public informational meetings, contested case hearings, and appearances at public meetings of the agency. The agency or the commissioner may order a public informational meeting if the comments received during the comment period demonstrate considerable public interest in the proposed permit action.\n(c) The commissioner shall mail the public notice to the applicant, all persons who have registered with the agency to receive notice of permit actions, and to any interested person upon request. The commissioner shall make a copy of the public notice available at the agency's main office and the applicable regional office. The commissioner shall circulate the public notice in the geographic area of the facility or activity subject to the proposed permit action, either by posting in public buildings, by publication in local newspapers or periodicals, by publication in the State Register, or by an alternate method deemed by the commissioner to be more effective such as an electronic bulletin board or mail service.\n(d) The commissioner shall have the discretion to issue, amend, or revoke a Minnesota XL permit if:\n(1) the commissioner has included in the public notice information notifying persons of their right to request that the decision to issue, amend, or revoke the Minnesota XL permit be presented to the agency; and\n(2) neither the permit applicant, a member of the stakeholders group, or any person commenting on the proposed issuance, amendment, or revocation of the Minnesota XL permit has requested, during the comment period, that the decision be made by the agency or requested a contested case hearing.\nIf the conditions in clauses (1) and (2) have not been met, or if, prior to the commissioner's decision, one or more members of the agency request that the decision to issue, amend, or revoke the Minnesota XL permit be made by the agency, then the agency shall have the sole authority to make that decision.\n(a) The Pollution Control Agency may revoke a Minnesota XL permit if requested by the permittee or if the agency finds that:\n(1) the permittee is in significant noncompliance with the Minnesota XL permit or with applicable law;\n(2) the permittee is not able, or has shown a lack of willingness, to comply with future pollution reduction deadlines in the Minnesota XL permit;\n(3) the permitted facility or activity endangers human health or the environment and the danger cannot be removed by an amendment to the Minnesota XL permit; or\n(4) after proper notification and a reasonable amount of time has passed, the permittee has not satisfactorily addressed a substantive issue raised by a majority of members of the stakeholders group.\n(b) If the agency revokes a Minnesota XL permit, it shall in its revocation order:\n(1) delay any compliance deadlines that had been varied by the Minnesota XL permit if the agency finds it necessary to provide the permittee a reasonable amount of time to obtain alternative permits under chapters other than this chapter and under local ordinances and regulations, and to achieve compliance; and\n(2) establish practical interim requirements to replace the requirements of the Minnesota XL permit that the agency finds the permittee will not be able to comply with between the time of permit revocation and issuance of the alternative permits, provided that such interim requirements shall not allow pollution from the facility in excess of that allowed by applicable law at the time the permit was issued.\n(c) The permittee shall comply with the agency's order and with all requirements of the Minnesota XL permit for which alternative interim requirements have not been established in the agency's order, until the applicable alternative permits have been issued.",
	"repealed": false
}