{
	"id": "518A.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.81",
	"title": "518A.81 ASSIGNMENT OF CHILD SUPPORT AND MAINTENANCE.",
	"text": "(a) The term \"direct support\" as used in this chapter and chapters 142A, 257, 518, and 518C refers to an assigned support payment from an obligor which is paid directly to a recipient of public assistance.\n(b) The term \"public assistance\" as used in this chapter and chapters 142A, 257, 518, and 518C, includes any form of assistance provided under MFIP under chapter 142G; child care assistance provided through the child care fund under chapter 119B; any form of medical assistance under chapter 256B; and foster care as provided under title IV-E of the Social Security Act. MinnesotaCare and health plans subsidized by federal premium tax credits or federal cost-sharing reductions are not considered public assistance for purposes of a child support referral.\n(c) The term \"child support agency\" as used in this section refers to the public authority responsible for child support enforcement.\n(d) The term \"public assistance agency\" as used in this section refers to a public authority providing public assistance to an individual.\n(e) The terms \"child support\" and \"arrears\" as used in this section have the meanings provided in section 518A.26.\n(f) The term \"maintenance\" as used in this section has the meaning provided in section 518.003.\n(a) An individual receiving public assistance in the form of assistance under MFIP under chapter 142G is considered to have assigned to the state at the time of application all rights to child support and maintenance from any other person the applicant or recipient may have in the individual's own behalf or in the behalf of any other family member for whom application for public assistance is made. An assistance unit is ineligible for the Minnesota family investment program unless the caregiver assigns all rights to child support and maintenance benefits according to this section.\n(1) The assignment is effective as to any current child support and current maintenance.\n(2) Any child support or maintenance arrears that accrue while an individual is receiving public assistance in the form of assistance under any of the programs listed in this paragraph are permanently assigned to the state.\n(3) The assignment of current child support and current maintenance ends on the date the individual ceases to receive or is no longer eligible to receive public assistance under any of the programs listed in this paragraph.\n(b) An individual receiving public assistance in the form of medical assistance is considered to have assigned to the state at the time of application all rights to medical support from any other person the individual may have in the individual's own behalf or in the behalf of any other family member for whom medical assistance is provided.\n(1) An assignment is effective as to any medical support accruing after the date of medical assistance eligibility.\n(2) Any medical support arrears that accrue while an individual is receiving public assistance in the form of medical assistance are permanently assigned to the state.\n(3) The assignment of current medical support ends on the date the individual ceases to receive or is no longer eligible to receive public assistance in the form of medical assistance.\n(c) An individual receiving public assistance in the form of child care assistance under the child care fund pursuant to chapter 119B is considered to have assigned to the state at the time of application all rights to child care support from any other person the individual may have in the individual's own behalf or in the behalf of any other family member for whom child care assistance is provided.\n(1) The assignment is effective as to any current child care support.\n(2) Any child care support arrears that accrue while an individual is receiving public assistance in the form of child care assistance under the child care fund in chapter 119B are permanently assigned to the state.\n(3) The assignment of current child care support ends on the date the individual ceases to receive or is no longer eligible to receive public assistance in the form of child care assistance under the child care fund under chapter 119B.\n(a) The state shall distribute current child support and maintenance received by the state to an individual who assigns the right to that support under subdivision 2, paragraph (a).\n(b) When the public authority collects child support arrearages on behalf of an individual who is receiving public assistance, the public authority shall first apply the collection to satisfy those arrears that are permanently assigned to the state.\n(c) When the public authority collects child support arrearages on behalf of an individual who is not receiving public assistance, the public authority shall first apply the collection to satisfy those arrears that are not permanently assigned to the state.\n(d) When the public authority collects child support arrearages certified under the federal tax offset, the public authority shall first apply the collection to satisfy those arrears that are permanently assigned to the state.\nMS 2022 [Repealed, 2024 c 80 art 8 s 71]\nAssignments in this section take effect upon a determination that the applicant is eligible for public assistance. The amount of support assigned under this subdivision may not exceed the total amount of public assistance issued or the total support obligation, whichever is less. Child care support collections made according to an assignment under subdivision 2, paragraph (c), must be deposited, subject to any limitations of federal law, in the general fund.\nAfter notification from a public assistance agency that an individual has applied for or is receiving any form of public assistance, the child support agency shall determine whether the party is cooperating with the agency in establishing paternity, child support, modification of an existing child support order, or enforcement of an existing child support order. The public assistance agency shall notify each applicant or recipient in writing of the right to claim a good cause exemption from cooperating with the requirements in this section. A copy of the notice must be furnished to the applicant or recipient, and the applicant or recipient and a representative from the public authority shall acknowledge receipt of the notice by signing and dating a copy of the notice. The individual shall cooperate with the child support agency by:\n(1) providing all known information regarding the alleged father or obligor, including name, address, Social Security number, telephone number, place of employment or school, and the names and addresses of any relatives;\n(2) appearing at interviews, hearings and legal proceedings;\n(3) submitting to genetic tests including genetic testing of the child, under a judicial or administrative order; and\n(4) providing additional information known by the individual as necessary for cooperating in good faith with the child support agency.\nThe caregiver of a minor child must cooperate with the efforts of the public authority to collect support according to this subdivision. A caregiver must notify the public authority of all support the caregiver receives during the period the assignment of support required under subdivision 2 is in effect. Direct support retained by a caregiver must be counted as unearned income when determining the amount of the assistance payment, and repaid to the child support agency for any month when the direct support retained is greater than the court-ordered child support and the assistance payment and the obligor owes support arrears.\nIf the individual cannot provide the information required in subdivision 5, before making a determination that the individual is cooperating, the child support agency shall make a finding that the individual could not reasonably be expected to provide the information. In making this finding, the child support agency shall consider:\n(1) the age of the child for whom support is being sought;\n(2) the circumstances surrounding the conception of the child;\n(3) the age and mental capacity of the parent or caregiver of the child for whom support is being sought;\n(4) the time period that has expired since the parent or caregiver of the child for whom support is sought last had contact with the alleged father or obligor, or the person's relatives; and\n(5) statements from the applicant or recipient or other individuals that show evidence of an inability to provide correct information about the alleged father or obligor because of deception by the alleged father or obligor.\nUnless good cause is found to exist under subdivision 10, upon a determination of noncooperation by the child support agency, the agency shall promptly notify the individual and each public assistance agency providing public assistance to the individual that the individual is not cooperating with the child support agency. Upon notice of noncooperation, the individual shall be sanctioned in the amount determined according to the public assistance agency responsible for enforcing the sanction.\n(a) Failure by a caregiver to satisfy any of the requirements of subdivision 5 constitutes refusal to cooperate, and the sanctions under paragraph (b) apply. The IV-D agency must determine whether a caregiver has refused to cooperate according to subdivision 5.\n(b) Determination by the IV-D agency that a caregiver has refused to cooperate has the following effects:\n(1) a caregiver is subject to the applicable sanctions under section 256J.46;\n(2) a caregiver who is not a parent of a minor child in an assistance unit may choose to remove the child from the assistance unit unless the child is required to be in the assistance unit; and\n(3) a parental caregiver who refuses to cooperate is ineligible for medical assistance.\nThe IV-A or IV-D agency must notify the caregiver that the caregiver may claim a good cause exemption from cooperating with the requirements in subdivision 5. Good cause may be claimed and exemptions determined according to subdivisions 10 to 13.\n(a) Cooperation with the child support agency under subdivision 5 is not necessary if the individual asserts, and both the child support agency and the public assistance agency find, good cause exists under this subdivision for failing to cooperate. An individual may request a good cause exemption by filing a written claim with the public assistance agency on a form provided by the commissioner of children, youth, and families. Upon notification of a claim for good cause exemption, the child support agency shall cease all child support enforcement efforts until the claim for good cause exemption is reviewed and the validity of the claim is determined. Designated representatives from public assistance agencies and at least one representative from the child support enforcement agency shall review each claim for a good cause exemption and determine its validity.\n(b) Good cause exists when an individual documents that pursuit of child support enforcement services could reasonably result in:\n(1) physical or emotional harm to the child for whom support is sought;\n(2) physical harm to the parent or caregiver with whom the child is living that would reduce the ability to adequately care for the child; or\n(3) emotional harm to the parent or caregiver with whom the child is living, of such nature or degree that it would reduce the person's ability to adequately care for the child.\nPhysical and emotional harm under this paragraph must be of a serious nature in order to justify a finding of good cause exemption. A finding of good cause exemption based on emotional harm may only be based upon a demonstration of emotional impairment that substantially affects the individual's ability to function.\n(c) Good cause also exists when the designated representatives in this subdivision believe that pursuing child support enforcement would be detrimental to the child for whom support is sought and the individual applicant or recipient documents any of the following:\n(1) the child for whom child support enforcement is sought was conceived as a result of incest or rape;\n(2) legal proceedings for the adoption of the child are pending before a court of competent jurisdiction; or\n(3) the parent or caregiver of the child is currently being assisted by a public or licensed private social service agency to resolve the issues of whether to keep the child or place the child for adoption.\nThe parent or caregiver's right to claim a good cause exemption based solely on this paragraph expires if the assistance lasts more than 90 days.\n(d) The public authority shall consider the best interests of the child in determining good cause.\n(a) An individual seeking a good cause exemption has 20 days from the date the good cause claim was provided to the public assistance agency to supply evidence supporting the claim. The public assistance agency may extend the time period in this section if it believes the individual is cooperating and needs additional time to submit the evidence required by this section. Failure to provide this evidence shall result in the child support agency resuming child support enforcement efforts.\n(b) Evidence supporting a good cause claim includes, but is not limited to:\n(1) a birth record or medical or law enforcement records indicating that the child was conceived as the result of incest or rape;\n(2) court documents or other records indicating that legal proceedings for adoption are pending before a court of competent jurisdiction;\n(3) court, medical, criminal, child protective services, social services, domestic violence advocate services, psychological, or law enforcement records indicating that the alleged father or obligor might inflict physical or emotional harm on the child, parent, or caregiver;\n(4) medical records or written statements from a licensed medical professional indicating the emotional health history or status of the custodial parent, child, or caregiver, or indicating a diagnosis or prognosis concerning their emotional health;\n(5) a written statement from a public or licensed private social services agency that the individual is deciding whether to keep the child or place the child for adoption; or\n(6) sworn statements from individuals other than the applicant or recipient that provide evidence supporting the good cause claim.\n(c) The child support agency and the public assistance agency shall assist an individual in obtaining the evidence in this section upon request of the individual.\nA good cause exemption must be granted if the individual's claim and the investigation of the supporting evidence satisfy the investigating agencies that the individual has good cause for refusing to cooperate.\nAccording to section 142A.20, an individual may appeal the determination or redetermination of good cause under this section. To initiate an appeal of a good cause determination or redetermination, the individual must make a request for a state agency hearing in writing within 30 calendar days after the date that a notice of denial for good cause is mailed or otherwise transmitted to the individual. Until a human services judge issues a decision under section 256.0451, subdivision 22, the child support agency shall cease all child support enforcement efforts and shall not report the individual's noncooperation to public assistance agencies.\nThe public authority may issue a notice of the individual's noncooperation to each public assistance agency providing public assistance to the individual if:\n(1) 30 calendar days have passed since the later of the initial county denial or the date of the denial following the state agency hearing; or\n(2) the individual has not cooperated with the child support agency as required in subdivision 5.\n(a) A good cause exemption may not continue for more than one year without redetermination of cooperation and good cause pursuant to this section. The child support agency may redetermine cooperation and the designated representatives in subdivision 10 may redetermine the granting of a good cause exemption before the one year expiration in this subdivision.\n(b) A good cause exemption must be allowed under subsequent applications and redeterminations without additional evidence when the factors that led to the exemption continue to exist. A good cause exemption must end when the factors that led to the exemption have changed.\nThe commissioner shall establish domestic violence and sexual abuse training programs for child support agency employees. The training programs must be developed in consultation with experts on domestic violence and sexual assault. To the extent possible, representatives of the child support agency involved in making a determination of cooperation under subdivision 6 or reviewing a claim for good cause exemption under subdivision 9 shall receive training in accordance with this subdivision.\n[Repealed, 2008 c 363 art 16 s 8]",
	"repealed": false
}