{
	"id": "16B.2405",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.2405",
	"title": "16B.2405 CAPITOL BUILDING POWERS AND DUTIES.",
	"text": "The commissioner, upon receipt of funding for these purposes, shall:\n(1) maintain and operate the Capitol building and grounds according to section 16B.24 and other applicable law;\n(2) designate a project manager to oversee and manage predesign, design, and construction contracts and funding for all modifications to the Capitol building;\n(3) manage design and construction projects and funding for the Capitol building according to section 16B.31 and other applicable law;\n(4) lease space in the Capitol building, as provided in section 16B.24, to state agencies, constitutional officers, and the court administrator on behalf of the judicial branch and allocate space in the Capitol building to the legislative branch as determined by the commission;\n(5) provide information about the Capitol building to the commission, legislative bodies, and others as needed regarding maintenance, operation, leasing, condition assessments, design, and construction projects; and\n(6) assist the State Capitol Preservation Commission with performance of its duties as needed.\nThe commissioner may collect charges or fees from users holding events in the Capitol building. Money collected by the commissioner under this subdivision shall be deposited in a Capitol events dedicated account in the special revenue fund. Money in the dedicated account is appropriated to the commissioner of administration to recover direct costs incurred from holding events in the Capitol building. The commissioner shall report annually by September 15 on the events held in the Capitol building, the amounts collected for those events, and the costs for operating events, to the chairs and ranking minority members of the committees in the house of representatives and the senate with jurisdiction over finance and policy relating to the commissioner of administration.",
	"repealed": false
}