{
	"id": "580.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.042",
	"title": "580.042 FORECLOSURE ADVICE NOTICE TO TENANT.",
	"text": "This section applies to foreclosure of mortgages by advertisement under this chapter and foreclosure of mortgages by action under chapter 581 on property consisting of one to four family dwelling units, one or more of which are occupied by a tenant as a residence.\nThe notice required by this section must be in 14-point boldface type and must be printed on colored paper that is other than the color of the notice of foreclosure and of the notice to be given under section 580.041, subdivision 1b, and that does not obscure or overshadow the content of the notice. The title of the notice must be in 20-point boldface type. The notice must be on its own page.\nThe notice required by this section must appear substantially as follows.\n\"Foreclosure: Advice to Tenants\nYou are renting in a property that is in foreclosure. Minnesota law requires that we send you this notice about the foreclosure process. Please read it carefully.\nThe mortgage foreclosure does not change the terms of your lease. You and your landlord must continue to follow the terms of your lease, including the rights and responsibilities of you and your landlord. You must keep paying rent unless you have a legal reason to withhold it. Your landlord must keep the property repaired. Utilities must be paid under the terms of your lease or under state law.\nMoving out of the property early might be a violation of your lease. The date of the sheriff's foreclosure sale is in the attached foreclosure notice. In most cases you do not need to move from the property before the sheriff's foreclosure sale. Read your lease to see if it says anything about foreclosure and about the rights you may have if the property is in foreclosure. If you have a month-to-month lease, the foreclosure notice does not change the rules for ending your lease. You and your landlord must still give legal notice to end your lease.\nIn most cases, your landlord has six months after the date of the sheriff's foreclosure sale to pay off the mortgage. This is called the \"redemption period.\" Read the attached foreclosure notice to determine the length of the redemption period. You cannot be asked to move during the redemption period except for lease violations or if your lease expires during the redemption period. If your landlord stops the foreclosure, you may not have to move from the property. If your landlord does not stop the foreclosure, there will be a new owner of the property at the end of the redemption period.\nThe new owner may have the legal right to ask you to move even if your lease is not over. But, the new owner must still give you a written notice stating that the new owner wants you to move.\nDo not wait to get information about foreclosure. Mortgage foreclosure is a complicated process. It is important you learn about your rights as a renter when there is a mortgage foreclosure. You may have fewer options if you wait too long. There are government agencies and nonprofit organizations that you may contact for helpful information about the foreclosure process. For the name and telephone number of an organization near you, please call the legal aid office or bar association office in your county. You also can find information on tenant rights at HOME Line at (866) 866-3546 and Law Help Minnesota at http://www.LawHelpMN.org. The state of Minnesota does not guarantee the advice of these agencies and organizations.\"\nAny person may establish compliance with or inapplicability of this section by recording, with the county recorder or registrar of titles, an affidavit by a person having knowledge of the facts, stating that the notice required by this section has been delivered in compliance with this section. The affidavit and a certified copy of a recorded affidavit is prima facie evidence of the facts stated in the affidavit. The affidavit may be recorded regarding any foreclosure sale, including foreclosure sales that occurred prior to August 1, 2008, and may be recorded separately or as part of the record of a foreclosure.\n(a) No mortgage foreclosure sale under this chapter is invalid because of failure to comply with this section.\n(b) A person who violates this section is liable for $500 to the lessee of the mortgagor at the time the notice should have been served. A person is not liable in an action for a violation of this section if the person shows by a preponderance of the evidence that the violation was not intentional and resulted from a bona fide error and the person adopted and maintained reasonable procedures to avoid the error. A plaintiff does not have cause of action if the defendant has complied with section 580.03.",
	"repealed": false
}