{
	"id": "373.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/373.27",
	"title": "373.27 GREAT RIVER ROAD, FINANCIAL ASSISTANCE.",
	"text": "The county board of any county lying adjacent to the Great River Road or through which the Great River Road passes, may grant to the Mississippi River Parkway Commission of Minnesota, the commissioner of transportation, or the commissioner of natural resources the money it deems advisable, for the following purposes:\n(a) to promote and develop the Great River Road in Minnesota;\n(b) to pay actual expenses of commission members incurred in the performance of their duties as commissioners;\n(c) to purchase stationery and office supplies;\n(d) to pay dues to the national Mississippi River Parkway Commission; and\n(e) to purchase lands and interests in lands including scenic easements, in addition to the normal right-of-way required for the Great River Road.\nLands and interests in lands purchased may include parkway features such as lands necessary for recreation, safety rest areas, and the conservation of natural scenic beauty, including submarginal lands, faces of adjacent hillsides, lakeshore and river banks, swamps and residual parcels and areas of historical, archaeological or scientific interest, in accordance with the joint report to Congress and the plan proposed by the state and approved by the secretary of commerce and the secretary of the interior.\nCounty grants may come from any money available in the county treasury and the county may levy a tax upon the taxable property in the county to make the grants authorized by this section.\nAll money grants under subdivision 1 shall be deposited in the special revenue fund in the state treasury and is appropriated to the commission or commissioner for the purposes specified in the grant. The money shall not cancel but shall remain available until expended for the purpose or purposes for which it was granted. If no specific purpose is named in the grant, the money shall be available to the commission or commissioner for any of the purposes set forth in subdivision 1.",
	"repealed": false
}