{
	"id": "353D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/353D.03",
	"title": "353D.03 FUNDING OF PLAN.",
	"text": "(a) The following classes of eligible participants who elect to participate in the public employees defined contribution plan under section 353D.02 shall contribute an amount equal to five percent of salary as defined in section 353.01, subdivision 10:\n(1) local government officials;\n(2) physicians; and\n(3) persons who are excluded from membership under section 353.01, subdivision 2b, paragraph (a), clause (23).\n(b) A participant's governmental subdivision shall contribute a matching amount.\n[Repealed, 2010 c 359 art 5 s 28]\n(a) A public ambulance service that elects to participate in the plan shall fund benefits for its qualified personnel who individually elect to participate.\n(b) Personnel who are paid for their services may elect to make member contributions in an amount not to exceed the service's contribution on their behalf.\n(c) Ambulance service contributions on behalf of salaried employees must be a fixed percentage of salary.\n(d) An ambulance service making contributions for volunteer or largely uncompensated personnel, or a municipality or county making contributions on behalf of rescue squad members who are volunteers or largely uncompensated personnel, may assign a unit value for each call or each period of alert duty for the purpose of calculating ambulance service or rescue squad service contributions, as applicable.\n[Repealed, 2015 c 68 art 12 s 42]\nA city manager who elects to participate in the plan shall contribute an amount equal to the contribution under section 353.27, subdivision 2. The applicable city shall make a contribution equal to the contribution required under section 353.27, subdivision 3.\n(a) Unless paragraph (b) applies, a volunteer or emergency on-call firefighter who elects to participate in the plan shall contribute at least 7.5 percent of any compensation received for firefighting services.\n(b) If the municipality or the independent nonprofit firefighting corporation ratified the election of plan coverage under section 353D.02, subdivision 6, the volunteer firefighter and the employing unit shall contribute in total an amount equal at least to 7.5 percent of any compensation received for firefighting services.",
	"repealed": false
}