{
	"id": "325F.6656",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.6656",
	"title": "325F.6656 ALTERNATIVE DISPUTE SETTLEMENT.",
	"text": "If a manufacturer has established, or participates in, an informal dispute settlement procedure which substantially complies with the provisions of the Code of Federal Regulations, title 16, part 703, as amended, and the requirements of this section, the provisions of section 325F.6654 concerning refunds or replacement do not apply to a consumer who has not first used this procedure.\nThe findings and decisions in an informal dispute settlement procedure shall address and state in writing whether the consumer would be entitled to a refund or replacement under the presumptions and criteria set out in section 325F.6654, and are admissible as nonbinding evidence in any legal action and are not subject to further foundation requirements.\nIf, in an informal dispute settlement procedure, it is decided that a consumer is entitled to a replacement vehicle under section 325F.6654, then the consumer has the option of selecting and receiving either a replacement vehicle or a full refund as authorized by section 325F.6654. Any refund selected by a consumer shall include all amounts authorized by section 325F.6654.\n(a) In any informal dispute settlement procedure provided for by this section:\n(1) no documents shall be received by any informal dispute settlement mechanism unless those documents have been provided to each of the parties in the dispute prior to the mechanism's meeting, with an opportunity for the parties to comment on the documents in writing, or with oral presentation at the request of the mechanism;\n(2) \"nonvoting\" manufacturer or dealer representatives shall not attend or participate in the internal dispute settlement procedures unless the consumer is also present and given a chance to be heard, or unless the consumer previously consents to the manufacturer or dealer participation without the consumer's presence and participation;\n(3) consumers shall be given an adequate opportunity to contest a manufacturer's assertion that a nonconformity falls within intended specifications for the vehicle by having the basis of the manufacturer's claim appraised by a technical expert selected and paid for by the consumer prior to the informal dispute settlement hearing;\n(4) no disputes shall be heard where there has been a recent attempt by the manufacturer to repair a consumer's vehicle, but no response has yet been received by the informal dispute mechanism from the consumer as to whether the repairs were successfully completed. This provision shall not prejudice a consumer's rights under this section nor shall it extend the informal dispute mechanism's 40-day time limit for deciding disputes, as established by the Code of Federal Regulations, title 16, part 703; and\n(5) the manufacturer shall provide and the informal dispute settlement mechanism shall consider all information relevant to resolving the dispute, such as the prior dispute records and information required by the Code of Federal Regulations, title 16, part 703.6, and any relevant technical service bulletins which may have been issued by the manufacturer or lessor regarding the motor vehicle being disputed.\n(b) A settlement reached under this section is binding on all participating parties.\nNo consumer shall be required to first participate in an informal dispute settlement procedure before filing an action in district court if the informal dispute settlement procedure does not comply with the requirements of this section, notwithstanding the procedure's compliance with the Code of Federal Regulations, title 16, part 703.\nAny consumer injured by a violation of this section may bring a civil action to enforce this section and recover costs and disbursements, including reasonable attorney's fees.",
	"repealed": false
}