{
	"id": "299C.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.53",
	"title": "299C.53 MISSING PERSONS REPORT; DUTIES OF COMMISSIONER AND LAW ENFORCEMENT AGENCIES.",
	"text": "(a) A law enforcement agency shall accept without delay any report of a missing person. The law enforcement agency shall not refuse to accept a missing person report on the basis that:\n(1) the missing person is an adult;\n(2) the circumstances do not indicate foul play;\n(3) the person has been missing for a short amount of time;\n(4) the person has been missing for a long amount of time;\n(5) there is no indication that the missing person was in the jurisdiction served by the law enforcement agency at the time of the disappearance;\n(6) the circumstances suggest that the disappearance may be voluntary;\n(7) the reporting person does not have personal knowledge of the facts;\n(8) the reporting person cannot provide all of the information requested by the law enforcement agency;\n(9) the reporting person lacks a familial or other relationship with the missing person; or\n(10) for any other reason, except in cases where the law enforcement agency has direct knowledge that the person is, in fact, not missing and the whereabouts and welfare of the person are known at the time the report is being made.\nA law enforcement agency shall accept missing person reports in person. An agency may also accept reports by telephone or other electronic means to the extent the reporting is consistent with the agency's policies or practices.\n(b) Upon receiving a report of a person believed to be missing, a law enforcement agency shall conduct a preliminary investigation to determine whether the person is missing, and if missing, whether the person is endangered. If the person is initially determined to be missing and endangered, the agency shall immediately consult the Bureau of Criminal Apprehension during the preliminary investigation, in recognition of the fact that the first two hours are critical. If the person is determined to be missing and endangered, the agency shall immediately enter identifying and descriptive information about the person into the NCIC computer. Law enforcement agencies having direct access to the NCIC computer shall enter and retrieve the data directly and shall cooperate in the entry and retrieval of data on behalf of law enforcement agencies which do not have direct access to the systems.\nAs soon as is practically possible after a missing person is located, the law enforcement agency which located or returned the missing person shall notify the law enforcement agency having jurisdiction over the investigation, and that agency shall cancel the entry from the NCIC computer.\nThe Bureau of Criminal Apprehension must operate a missing person alert program. If the Bureau of Criminal Apprehension receives a report from a law enforcement agency indicating that a person is missing and endangered, the superintendent must originate an alert. The superintendent may assist the law enforcement agency in conducting the preliminary investigation, offer resources, and assist the agency in helping implement the investigation policy with particular attention to the need for immediate action. The law enforcement agency shall promptly notify all appropriate law enforcement agencies in the state and is required to issue a missing person alert utilizing the Crime Alert Network as prescribed in section 299A.61 and, if deemed appropriate, law enforcement agencies in adjacent states or jurisdictions of any information that may aid in the prompt location and safe return of a missing and endangered person. The superintendent shall provide guidance on issuing alerts using this system and provide the system for law enforcement agencies to issue these alerts. The Bureau of Criminal Apprehension may provide assistance to agencies in issuing missing person alerts as required by this section.\nIn addition to the provisions of sections 299C.51 to 299C.565, the law enforcement agency and the Bureau of Criminal Apprehension shall comply with requirements provided in federal law on reporting and investigating missing children cases. For purposes of this subdivision, the definition of \"child,\" \"children,\" or \"minor\" shall be determined in accordance with the applicable federal law.",
	"repealed": false
}