{
	"id": "256B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.06",
	"title": "256B.06 ELIGIBILITY; MIGRANT WORKERS; CITIZENSHIP.",
	"text": "[Renumbered 256B.055, subdivision 1]\n[Renumbered 256B.055, subd 2]\n[Renumbered 256B.055, subd 3]\n[Renumbered 256B.055, subd 4]\n[Renumbered 256B.055, subd 5]\n[Renumbered 256B.055, subd 6]\n[Renumbered 256B.055, subd 7]\n[Renumbered 256B.055, subd 8]\n[Renumbered 256B.055, subd 9]\n[Renumbered 256B.055, subd 10]\n[Renumbered 256B.055, subd 11]\n[Renumbered 256B.056, subdivision 1]\n[Renumbered 256B.056, subd 2]\n[Renumbered 256B.056, subd 3]\n[Renumbered 256B.056, subd 4]\n[Renumbered 256B.056, subd 5]\n[Renumbered 256B.056, subd 6]\n[Renumbered 256B.055, subd 12]\n[Renumbered 256B.056, subd 7]\n[Repealed, 1974 c 525 s 3]\nNotwithstanding any law to the contrary, a migrant worker who meets all of the eligibility requirements of this section except for having a permanent place of abode in another state, shall be eligible for medical assistance and shall have medical needs met by the county in which the worker resides at the time of making application.\n(a) Eligibility for medical assistance is limited to citizens of the United States, qualified noncitizens as defined in this subdivision, and other persons residing lawfully in the United States. Citizens or nationals of the United States must cooperate in obtaining satisfactory documentary evidence of citizenship or nationality according to the requirements of the federal Deficit Reduction Act of 2005, Public Law 109-171.\n(b) \"Qualified noncitizen\" means a person who meets one of the following immigration criteria:\n(1) admitted for lawful permanent residence according to United States Code, title 8;\n(2) admitted to the United States as a refugee according to United States Code, title 8, section 1157;\n(3) granted asylum according to United States Code, title 8, section 1158;\n(4) granted withholding of deportation according to United States Code, title 8, section 1253(h);\n(5) paroled for a period of at least one year according to United States Code, title 8, section 1182(d)(5);\n(6) granted conditional entrant status according to United States Code, title 8, section 1153(a)(7);\n(7) determined to be a battered noncitizen by the United States Attorney General according to the Illegal Immigration Reform and Immigrant Responsibility Act of 1996, title V of the Omnibus Consolidated Appropriations Bill, Public Law 104-200;\n(8) is a child of a noncitizen determined to be a battered noncitizen by the United States Attorney General according to the Illegal Immigration Reform and Immigrant Responsibility Act of 1996, title V, of the Omnibus Consolidated Appropriations Bill, Public Law 104-200; or\n(9) determined to be a Cuban or Haitian entrant as defined in section 501(e) of Public Law 96-422, the Refugee Education Assistance Act of 1980.\n(c) All qualified noncitizens who were residing in the United States before August 22, 1996, who otherwise meet the eligibility requirements of this chapter, are eligible for medical assistance with federal financial participation.\n(d) Beginning December 1, 1996, qualified noncitizens who entered the United States on or after August 22, 1996, and who otherwise meet the eligibility requirements of this chapter are eligible for medical assistance with federal participation for five years if they meet one of the following criteria:\n(1) refugees admitted to the United States according to United States Code, title 8, section 1157;\n(2) persons granted asylum according to United States Code, title 8, section 1158;\n(3) persons granted withholding of deportation according to United States Code, title 8, section 1253(h);\n(4) veterans of the United States armed forces with an honorable discharge for a reason other than noncitizen status, their spouses and unmarried minor dependent children; or\n(5) persons on active duty in the United States armed forces, other than for training, their spouses and unmarried minor dependent children.\nBeginning July 1, 2010, children and pregnant women who are noncitizens described in paragraph (b) or who are lawfully present in the United States as defined in Code of Federal Regulations, title 8, section 103.12, and who otherwise meet eligibility requirements of this chapter, are eligible for medical assistance with federal financial participation as provided by the federal Children's Health Insurance Program Reauthorization Act of 2009, Public Law 111-3.\n(e) Nonimmigrants who otherwise meet the eligibility requirements of this chapter are eligible for the benefits as provided in paragraphs (f) to (h). For purposes of this subdivision, a \"nonimmigrant\" is a person in one of the classes listed in United States Code, title 8, section 1101(a)(15).\n(f) Payment shall also be made for care and services that are furnished to noncitizens, regardless of immigration status, who otherwise meet the eligibility requirements of this chapter, if such care and services are necessary for the treatment of an emergency medical condition.\n(g) For purposes of this subdivision, the term \"emergency medical condition\" means a medical condition that meets the requirements of United States Code, title 42, section 1396b(v).\n(h)(1) Notwithstanding paragraph (g), services that are necessary for the treatment of an emergency medical condition are limited to the following:\n(i) services delivered in an emergency room or by an ambulance service licensed under chapter 144E that are directly related to the treatment of an emergency medical condition;\n(ii) services delivered in an inpatient hospital setting following admission from an emergency room or clinic for an acute emergency condition; and\n(iii) follow-up services that are directly related to the original service provided to treat the emergency medical condition and are covered by the global payment made to the provider.\n(2) Services for the treatment of emergency medical conditions do not include:\n(i) services delivered in an emergency room or inpatient setting to treat a nonemergency condition;\n(ii) organ transplants, stem cell transplants, and related care;\n(iii) services for routine prenatal care;\n(iv) continuing care, including long-term care, nursing facility services, home health care, adult day care, day training, or supportive living services;\n(v) elective surgery;\n(vi) outpatient prescription drugs, unless the drugs are administered or dispensed as part of an emergency room visit;\n(vii) preventative health care and family planning services;\n(viii) rehabilitation services;\n(ix) physical, occupational, or speech therapy;\n(x) transportation services;\n(xi) case management;\n(xii) prosthetics, orthotics, durable medical equipment, or medical supplies;\n(xiii) dental services;\n(xiv) hospice care;\n(xv) audiology services and hearing aids;\n(xvi) podiatry services;\n(xvii) chiropractic services;\n(xviii) immunizations;\n(xix) vision services and eyeglasses;\n(xx) waiver services;\n(xxi) individualized education programs; or\n(xxii) substance use disorder treatment.\n(i) Pregnant noncitizens who are ineligible for federally funded medical assistance because of immigration status, are not covered by a group health plan or health insurance coverage according to Code of Federal Regulations, title 42, section 457.310, and who otherwise meet the eligibility requirements of this chapter, are eligible for medical assistance through the period of pregnancy, including labor and delivery, and 12 months postpartum.\n(j) Beginning October 1, 2003, persons who are receiving care and rehabilitation services from a nonprofit center established to serve victims of torture and are otherwise ineligible for medical assistance under this chapter are eligible for medical assistance without federal financial participation. These individuals are eligible only for the period during which they are receiving services from the center. Individuals eligible under this paragraph shall not be required to participate in prepaid medical assistance. The nonprofit center referenced under this paragraph may establish itself as a provider of mental health targeted case management services through a county contract under section 256.0112, subdivision 6. If the nonprofit center is unable to secure a contract with a lead county in its service area, then, notwithstanding the requirements of section 256B.0625, subdivision 20, the commissioner may negotiate a contract with the nonprofit center for provision of mental health targeted case management services. When serving clients who are not the financial responsibility of their contracted lead county, the nonprofit center must gain the concurrence of the county of financial responsibility prior to providing mental health targeted case management services for those clients.\n(k) Notwithstanding paragraph (h), clause (2), the following services are covered as emergency medical conditions under paragraph (f) except where coverage is prohibited under federal law for services under clauses (1) and (2):\n(1) dialysis services provided in a hospital or freestanding dialysis facility;\n(2) surgery and the administration of chemotherapy, radiation, and related services necessary to treat cancer if the recipient has a cancer diagnosis that is not in remission and requires surgery, chemotherapy, or radiation treatment; and\n(3) kidney transplant if the person has been diagnosed with end stage renal disease, is currently receiving dialysis services, and is a potential candidate for a kidney transplant.\n(l) Effective July 1, 2013, recipients of emergency medical assistance under this subdivision are eligible for coverage of the elderly waiver services provided under chapter 256S, and coverage of rehabilitative services provided in a nursing facility. The age limit for elderly waiver services does not apply. In order to qualify for coverage, a recipient of emergency medical assistance is subject to the assessment and reassessment requirements of section 256B.0911. Initial and continued enrollment under this paragraph is subject to the limits of available funding.\nWhen determining eligibility for any federal or state funded medical assistance under this section, the income and resources of all noncitizens shall be deemed to include their sponsors' income and resources as required under the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, title IV, Public Law 104-193, sections 421 and 422, and subsequently set out in federal rules. This section is effective May 1, 1997. Beginning July 1, 2010, sponsor deeming does not apply to pregnant women and children who are qualified noncitizens, as described in subdivision 4, paragraph (b).\n[Renumbered 142A.40]",
	"repealed": false
}