{
	"id": "43A.318",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.318",
	"title": "43A.318 PUBLIC EMPLOYEES GROUP LONG-TERM CARE INSURANCE PROGRAM.",
	"text": "(a) Scope. For the purposes of this section, the terms defined have the meanings given them.\n(b) Eligible person. \"Eligible person\" means:\n(1) a person who is eligible for insurance and benefits under section 43A.24;\n(2) a person who at the time of separation from employment was eligible to purchase coverage at personal expense under section 43A.27, subdivision 3, regardless of whether the person elected to purchase this coverage;\n(3) a spouse of a person described in clause (1) or (2), regardless of the enrollment status in the program of the person described in clause (1) or (2); or\n(4) a parent of a person described in clause (1), regardless of the enrollment status in the program of the person described in clause (1).\n(c) Program. \"Program\" means the statewide public employees long-term care insurance program created under subdivision 2.\n(d) Qualified vendor. \"Qualified vendor\" means an entity licensed or authorized to underwrite, provide, or administer group long-term care insurance benefits in this state.\n(a) The commissioner may administer a program to make long-term care coverage available to eligible persons. The commissioner may determine the program's funding arrangements, request bids from qualified vendors, and negotiate and enter into contracts with qualified vendors. Contracts are not subject to the requirements of section 16C.16 or 16C.19. Contracts must be for a uniform term of at least one year, but may be made automatically renewable from term to term in the absence of notice of termination by either party. The program may not be self-insured until the commissioner has completed an actuarial study of the program and reported the results of the study to the legislature and self-insurance has been specifically authorized by law.\n(b) The program may provide coverage for home, community, and institutional long-term care and any other benefits as determined by the commissioner. Coverage is optional. The enrolled eligible person must pay the full cost of the coverage.\n(c) The commissioner shall promote activities that attempt to raise awareness of the need for long-term care insurance among residents of the state and encourage the increased prevalence of long-term care coverage. These activities must include the sharing of knowledge gained in the development of the program.\n(d) The commissioner may employ and contract with persons and other entities to perform the duties under this section and may determine their duties and compensation consistent with this chapter.\n(e) The benefits provided under this section are not terms and conditions of employment as defined under section 179A.03, subdivision 19, and are not subject to collective bargaining.\n(f) The commissioner shall establish underwriting criteria for entry of all eligible persons into the program. Eligible persons who would be immediately eligible for benefits may not enroll.\n(g) Eligible persons who meet underwriting criteria may enroll in the program upon hiring and at other times established by the commissioner.\n(h) An eligible person enrolled in the program may continue to participate in the program even if an event, such as termination of employment, changes the person's employment status.\n(i) Participating public employee pension plans and public employers may provide automatic pension or payroll deduction for payment of long-term care insurance premiums to qualified vendors contracted with under this section.\n(j) The premium charged to program enrollees must include an administrative fee to cover all program expenses incurred in addition to the cost of coverage. All fees collected are appropriated to the commissioner for the purpose of administrating the program.\n[Repealed, 2007 c 133 art 2 s 13]\n(a) The long-term care insurance trust fund in the state treasury consists of deposits of the premiums received from persons enrolled in the program. All money in the fund is appropriated to the commissioner to pay premiums, claims, refunds, administrative costs, and other related service costs. The commissioner shall reserve an amount of money sufficient to cover the actuarially estimated costs of claims incurred but unpaid. The trust fund must be used solely for the purpose of the program.\n(b) The State Board of Investment shall invest the money in the fund according to section 11A.24. Investment income and losses attributable to the fund must be credited to or deducted from the fund.\nThis section does not prohibit or limit individuals or local governments from purchasing long-term care insurance through other private sources.",
	"repealed": false
}