{
	"id": "360.039",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.039",
	"title": "360.039 FEDERAL AID.",
	"text": "Every municipality is authorized, subject to the provisions of section 360.0161, to accept, receive, receipt for, disburse, and expend federal and state money and other money, public or private, made available by grant or loan or both to accomplish, in whole or in part, any of the purposes of this act. All federal money accepted under this section shall be accepted and expended by the municipality upon such terms and conditions as are prescribed by the United States and as are consistent with state law; and all state money accepted under this section shall be accepted and expended by the municipality upon such terms and conditions as are prescribed by the state. Unless otherwise prescribed by the agency from which such money was received, the chief financial officer of the municipality shall, on its behalf deposit all money received pursuant to this section and shall keep it, in separate funds designated according to the purposes for which the money was made available, in trust for such purposes.\nA municipality is authorized to designate the commissioner as its agent to accept, receive, receipt for, and disburse federal and state money and other money, public or private, made available by grant or loan or both to accomplish, in whole or in part, any of the purposes of this act; and to designate the commissioner as its agent in contracting for and supervising the planning, acquisition, development, construction, improvement, maintenance, equipment, or operation of any airports or other air navigation facility. Such municipality may enter into an agreement with the commissioner prescribing the terms and conditions of the agency in accordance with such terms and conditions as are prescribed by the United States, if federal money is involved, and in accordance with the applicable laws of this state. All federal money accepted under this section by the commissioner shall be accepted and transferred or expended by the commissioner upon such terms and conditions as are prescribed by the United States.\nAll contracts for the planning, acquisition, construction, enlargement, improvement, maintenance, equipment, or operation of airports or other air navigation facilities, made by the municipality itself or through the agency of the commissioner, shall be made pursuant to the laws of this state governing the making of like contracts; provided, however, that where such planning, acquisition, construction, improvement, enlargement, maintenance, equipment, or operation is financed wholly or partly with federal money, the municipality, or the commissioner as its agent, may let contracts in the manner prescribed by the federal authorities, acting under the laws of the United States, and any rules or regulations made thereunder, notwithstanding any other state law to the contrary.",
	"repealed": false
}