{
	"id": "135A.012",
	"url": "https://www.revisor.mn.gov/statutes/cite/135A.012",
	"title": "135A.012 HIGHER EDUCATION ATTAINMENT GOAL.",
	"text": "This section sets a goal for postsecondary education and workforce training credential attainment for Minnesota residents.\nThe number of Minnesota residents ages 25 to 44 years who hold postsecondary or industry-recognized credentials should be increased to at least 70 percent by 2025.\nThe attainment goal in this section is not to the exclusion of any other goals and does not confer a right or create a claim for any person.\nThe Office of Higher Education shall work with the state demographer's office to measure progress towards the attainment of the goal specified in subdivision 2. The United States Census Bureau data shall be used to calculate the number of individuals in the state who hold a postsecondary degree. The Office of Higher Education, demographer's office, the Department of Employment and Economic Development, and the Department of Labor and Industry shall develop a methodology to estimate the number of individuals that hold a credential awarded by a postsecondary institution or recognized by an industry authority as their highest credential using data available at the time that the analysis is completed.\n(a) Beginning in 2016 and every year thereafter, the Office of Higher Education, in collaboration with the state demographer's office, shall, by October 15, report to the chairs and ranking minority members of the legislative committees with primary jurisdiction over higher education policy and finance on the progress towards meeting or exceeding the goal of this section.\n(b) Meeting and maintaining the goal of 70 percent of Minnesota residents ages 25 to 44 years holding a postsecondary or industry-recognized credential will likely be difficult without achieving attainment rates that are comparable across all race and ethnicity groups. The Office of Higher Education shall utilize benchmarks of 30 percent or higher and 50 percent or higher to report progress by race and ethnicity groups toward meeting the educational attainment rate goal of 70 percent.",
	"repealed": false
}