{
	"id": "243.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.205",
	"title": "243.205 NOTICE OF RESTORATION OF RIGHT TO VOTE.",
	"text": "The chief executive officer of each state and local correctional facility shall designate an official within the facility to provide the notice and application required under this section to a person to whom the civil right to vote is restored by reason of the person's release from actual incarceration. The official shall maintain an adequate supply of voter registration applications and informational materials for this purpose.\nA notice of restoration of the civil right to vote and a voter registration application must be provided as follows:\n(1) the chief executive officer of each state and local correctional facility shall provide the notice and application to a person being released from the facility following incarceration for a felony-level offense; and\n(2) a probation officer or supervised release agent shall provide the notice and application to all individuals under correctional supervision for a felony-level offense.\nMS 2023 Supp [Repealed, 2024 c 112 art 2 s 81]\nThe notice required by subdivision 2 must include all of the following information:\n(1) the statement \"Your right to vote has been restored.\";\n(2) a statement that says the person is eligible to vote if the person meets the eligibility requirements;\n(3) a list of the eligibility requirements to vote;\n(4) a statement that a voter registration application is attached to the notice and information on all the ways to register to vote;\n(5) information on where to find a list of documents to be used to provide current proof of residence;\n(6) the statement \"If you violate the conditions of release, the commissioner may revoke your release after due process and reimprison you. If that occurs, your right to vote is lost again while you are in prison.\"; and\n(7) information on where the person may find more information about voting rights.\nA failure to provide proper notice as required by this section does not prevent the restoration of the person's civil right to vote.",
	"repealed": false
}