{
	"id": "504B.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.151",
	"title": "504B.151 RESTRICTION ON RESIDENTIAL LEASE TERMS FOR BUILDINGS IN FINANCIAL DISTRESS; REQUIRED NOTICE OF PENDING FORECLOSURE.",
	"text": "(a) Once a landlord has received notice of a contract for deed cancellation under section 559.21 or notice of a mortgage foreclosure sale under chapter 580 or 582, or summons and complaint under chapter 581, the landlord may only enter into (i) a periodic residential lease agreement with a term of not more than two months or the time remaining in the contract cancellation period or the mortgagor's redemption period, whichever is less or (ii) a fixed term residential tenancy not extending beyond the cancellation period or the landlord's period of redemption until:\n(1) the contract for deed has been reinstated or paid in full;\n(2) the mortgage default has been cured and the mortgage reinstated;\n(3) the mortgage has been satisfied;\n(4) the property has been redeemed from a foreclosure sale; or\n(5) a receiver has been appointed.\n(b) Before entering into a lease under this section and accepting any rent or security deposit from a tenant, the landlord must notify the prospective tenant in writing that the landlord has received notice of a contract for deed cancellation or notice of a mortgage foreclosure sale as appropriate, and the date on which the contract cancellation period or the mortgagor's redemption period ends.\n(c) This section does not apply to a manufactured home park as defined in section 327C.015, subdivision 8.\n(d) A landlord who violates the requirements in this subdivision is liable to the lessee for a civil penalty of $500, unless the landlord falls under the exception in subdivision 2. The remedy provided under this paragraph is in addition to and shall not limit other rights or remedies available to landlords and tenants.\nThis section does not apply if:\n(1) the holder or the mortgagee agrees not to terminate the tenant's lease other than for lease violations for at least one year from the commencement of the tenancy; and\n(2) the lease does not require the tenant to prepay rent for any month commencing after the end of the cancellation or redemption period, so that the rent payment would be due prior to the end of the cancellation or redemption period.\nFor the purposes of this section, a holder means a contract for deed vendor or a holder of the sheriff's certificate of sale or any assignee of the contract for deed vendor or of the holder of the sheriff's certificate of sale.\n(a) A tenant who enters into a lease under subdivision 2 is:\n(1) deemed by operation of law to become the tenant of the holder immediately upon the holder succeeding to the interest of the landlord under the lease; and\n(2) bound to the holder under all the provisions of the lease for either the balance of the lease term or for one year after the start of the tenancy, whichever occurs first.\n(b) A tenant who becomes the tenant of the holder under this subdivision is not obligated to pay rent to the holder until the holder mails, by first class mail to the tenant at the property address, written notice that the holder has succeeded to the interest of the landlord. A letter from the holder to the tenant to that effect is prima facie evidence that the holder has succeeded to the interest of the landlord.\nA holder succeeding to an interest in a lease lawfully entered into under subdivision 2 is not:\n(1) liable for any act or omission of any prior landlord;\n(2) subject to any offset or defense which the tenant had against any prior landlord; or\n(3) bound by any modification of the lease entered into under subdivision 2, unless the modification is made with the holder's consent.",
	"repealed": false
}