{
	"id": "256F.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/256F.10",
	"title": "256F.10 CHILD WELFARE TARGETED CASE MANAGEMENT.",
	"text": "Persons under 21 years of age who are eligible to receive medical assistance are eligible for child welfare targeted case management services under section 256B.094 and this section if they have received an assessment and have been determined by the local county or tribal social services agency to be:\n(1) at risk of placement or in placement as described in section 260C.212, subdivision 1;\n(2) at risk of maltreatment or experiencing maltreatment as defined in section 260E.03, subdivision 12; or\n(3) in need of protection or services as defined in section 260C.007, subdivision 6.\nChild welfare targeted case management services are available from providers meeting qualification requirements and the certification standards specified in subdivision 4. Eligible recipients may choose any certified provider of child welfare targeted case management services.\nProviders may seek certification for medical assistance reimbursement to provide child welfare targeted case management services. The certification process is initiated by submitting a written statement of interest to the commissioner.\nCertified providers may elect to discontinue participation by a written notice to the commissioner at least 120 days before the end of the final calendar quarter of participation.\nThe commissioner must certify each provider before enrolling it as a child welfare targeted case management provider of services under section 256B.094 and this section. The certification process shall examine the provider's ability to meet the qualification requirements and certification standards in this subdivision and other federal and state requirements of this service. A certified child welfare targeted case management provider is an enrolled medical assistance provider who is determined by the commissioner to have all of the following:\n(1) the legal authority to provide public welfare under sections 393.01, subdivision 7, and 393.07 or a federally recognized Indian tribe;\n(2) the demonstrated capacity and experience to provide the components of case management to coordinate and link community resources needed by the eligible population;\n(3) administrative capacity and experience in serving the target population for whom it will provide services and in ensuring quality of services under state and federal requirements;\n(4) the legal authority to provide complete investigative and protective services under section 260E.20, and child welfare and foster care services under section 393.07, subdivisions 1 and 2, or a federally recognized Indian tribe;\n(5) a financial management system that provides accurate documentation of services and costs under state and federal requirements; and\n(6) the capacity to document and maintain individual case records under state and federal requirements.\nCase managers are individuals employed by and authorized by the certified child welfare targeted case management provider to provide case management services under section 256B.094 and this section. A case manager must have:\n(1) skills in identifying and assessing a wide range of children's needs;\n(2) knowledge of local child welfare and a variety of community resources and effective use of those resources for the benefit of the child; and\n(3) a bachelor's degree in social work, psychology, sociology, or a closely related field from an accredited four-year college or university; or a bachelor's degree from an accredited four-year college or university in a field other than social work, psychology, sociology or a closely related field, plus one year of experience in the delivery of social services to children as a supervised social worker in a public or private social services agency; or\n(4) been authorized to serve as a tribal child welfare case manager certified by a federally recognized tribal government within the state of Minnesota, pursuant to section 256B.02, subdivision 7, paragraph (c), and determined as meeting applicable standards.\n(a) Except for portion set aside in paragraph (b), the federal funds earned under this section and section 256B.094 by providers shall be paid to each provider based on its earnings, and must be used by each provider to expand preventive child welfare services.\nIf a county or tribal social services agency chooses to be a provider of child welfare targeted case management and if that county or tribal social services agency also joins a local children's mental health collaborative as authorized by the 1993 legislature, then the federal reimbursement received by the county or tribal social services agency for providing child welfare targeted case management services to children served by the local collaborative shall be transferred by the county or tribal social services agency to the integrated fund. The federal reimbursement transferred to the integrated fund by the county or tribal social services agency must not be used for residential care other than respite care described under subdivision 7, paragraph (d).\n(b) The commissioner shall set aside a portion of the federal funds earned under this section to repay the special revenue maximization account under section 256.01, subdivision 2, paragraph (o). The repayment is limited to:\n(1) the costs of developing and implementing this section and section 256B.094;\n(2) programming the information systems; and\n(3) the lost federal revenue for the central office claim directly caused by the implementation of these sections.\nAny unexpended funds from the set-aside under this paragraph shall be distributed to providers according to paragraph (a).\n(a) Counties and tribal social services must continue the base level of expenditures for preventive child welfare services from either or both of any state, county, or federal funding source, which, in the absence of federal funds earned under this section, would have been available for these services. The commissioner shall review the county or tribal social services expenditures annually using reports required under sections 245.482 and 256.01, subdivision 2, paragraph (p), to ensure that the base level of expenditures for preventive child welfare services is continued from sources other than the federal funds earned under this section.\n(b) The commissioner may reduce, suspend, or eliminate either or both of a county's or tribal social services' obligations to continue the base level of expenditures and to expand child welfare preventive services if the commissioner determines that one or more of the following conditions apply to that county or reservation:\n(1) imposition of levy limits that significantly reduce available social service funds;\n(2) reduction in the net tax capacity of the taxable property within a county or reservation that significantly reduces available social service funds;\n(3) reduction in the number of children under age 19 in the county or reservation by 25 percent when compared with the number in the base year using the most recent data provided by the State Demographer's Office; or\n(4) termination of the federal revenue earned under this section.\n(c) The commissioner may suspend for one year either or both of a county's or tribal social services' obligations to continue the base level of expenditures and to expand child welfare preventive services if the commissioner determines that in the previous year one or more of the following conditions applied to that county or reservation:\n(1) the total number of children in placement under sections 260C.212 and 393.07, subdivisions 1 and 2, has been reduced by 50 percent from the total number in the base year; or\n(2) the average number of children in placement under sections 260C.212 and 393.07, subdivisions 1 and 2, on the last day of each month is equal to or less than one child per 1,000 children in the county or reservation.\n(d) For the purposes of this section, child welfare preventive services are those services directed toward a specific child or family that further the goals of Minnesota Statutes 2002, section 256F.01, and include assessments, family preservation services, service coordination, community-based treatment, crisis nursery services when the parents retain custody and there is no voluntary placement agreement with a child-placing agency, respite care except when it is provided under a medical assistance waiver, home-based services, and other related services. For the purposes of this section, child welfare preventive services shall not include shelter care placements under the authority of the court or public agency to address an emergency, residential services except for respite care, child care for the purposes of employment and training, adult services, services other than child welfare targeted case management when they are provided under medical assistance, placement services, or activities not directed toward a specific child or family. Respite care must be planned, routine care to support the continuing residence of the child with its family or long-term primary caretaker and must not be provided to address an emergency.\n(e) For the counties and tribal social services beginning to claim federal reimbursement for services under this section and section 256B.094, the base year is the calendar year ending at least two calendar quarters before the first calendar quarter in which the provider begins claiming reimbursement. For the purposes of this section, the base level of expenditures is the level of county or tribal social services expenditures in the base year for eligible child welfare preventive services described in this subdivision.\n(a) Notwithstanding section 256B.19, subdivision 1, for the purposes of child welfare targeted case management under section 256B.094 and this section, the nonfederal share of costs shall be provided by the provider of child welfare targeted case management from sources other than federal funds or funds used to match other federal funds, except when allowed by federal law or agreement.\n(b) Provider expenditures eligible for federal reimbursement under this section must not be made from federal funds or funds used to match other federal funds, except when allowed by federal law or agreement.\n(c) The commissioner may suspend, reduce, or terminate the federal reimbursement to a provider that does not meet the reporting or other requirements of section 256B.094 and this section. The county or reservation is responsible for any federal disallowances. The county or reservation may share this responsibility with its contracted vendors.\nPayments to certified providers for child welfare targeted case management expenditures under section 256B.094 and this section shall only be made of federal earnings from services provided under section 256B.094 and this section. Payments to contracted vendors shall include both the federal earnings and the nonfederal share.\nNotwithstanding section 256B.041, provider payments for the cost of child welfare targeted case management services shall not be made to the commissioner of management and budget. For the purposes of child welfare targeted case management services under section 256B.094 and this section, the centralized disbursement of payments to providers under section 256B.041 consists only of federal earnings from services provided under section 256B.094 and this section.",
	"repealed": false
}