{
	"id": "549.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/549.30",
	"title": "549.30 DEFINITIONS.",
	"text": "For purposes of sections 549.30 to 549.41, the terms defined in this section have the meanings given them.\n\"Annuity issuer\" means an insurer that has issued an annuity contract to be used to fund periodic payments under a structured settlement.\nMS 2020 [Repealed, 2022 c 62 s 32]\n\"Assignee\" means a person acquiring or proposing to acquire structured settlement payments from a structured settlement purchase company or transferee after, or concurrently with, the transfer of the structured settlement payment rights by the payee to the structured settlement purchase company or transferee.\n\"Dependents\" means a payee's spouse and minor children and all other family members and other persons for whom the payee is legally obligated to provide support, including spousal maintenance.\n\"Discounted present value\" means the present value of future payments, as determined by discounting the payments to the present using the most recently published applicable federal rate for determining the present value of an annuity, as issued by the United States Internal Revenue Service.\n\"Effective annual interest rate\" means the effective rate of interest per year the payee will be paying the transferee based on the net advance amount that a payee will receive from the transferee and the amounts and timing of the structured settlement payments that the payee is transferring to the transferee.\n\"Gross advance amount\" means the sum payable to the payee or for the payee's account as consideration for a transfer of structured settlement payment rights before any reductions for transfer expenses or other deductions to be made from such consideration.\n\"Independent professional advice\" means advice of an attorney, certified public accountant, actuary, or other licensed professional adviser.\n\"Interested parties\" means the payee, a beneficiary irrevocably designated under the annuity contract to receive payments following the payee's death or, if the designated beneficiary is a minor, the designated beneficiary's parent or guardian, the annuity issuer, the structured settlement obligor, and any other party to the structured settlement that has continuing rights or obligations to receive or make payments under the structured settlement.\n\"Net advance amount\" means the gross advance amount, less the aggregate amount of the actual and estimated transfer expenses.\n\"Payee\" means an individual who is receiving tax-free damage payments under a structured settlement and proposes to make a transfer of payment rights under the structured settlement.\n\"Periodic payments\" includes both recurring payments and scheduled future lump-sum payments.\n\"Prospective payee\" means an individual who is receiving tax-free payments under a structured settlement pursuant to United States Code, title 26, section 130, and who has been personally and individually solicited by and has not yet proposed to transfer all or a portion of the structured settlement payment rights to a structured settlement purchase company.\n\"Qualified assignment agreement\" means an agreement providing for a qualified assignment as provided by the United States Internal Revenue Code, title 26, section 130, as amended.\n\"Responsible administrative authority\" means a government authority vested by law with exclusive jurisdiction over the settled claim resolved by the structured settlement.\n\"Secretary\" means the secretary of state.\n\"Settled claim\" means the original tort claim resolved by a structured settlement.\n\"Structured settlement\" means an arrangement for periodic payment of damages for personal injuries established by settlement or judgment in resolution of a tort claim.\n\"Structured settlement agreement\" means the agreement, judgment, stipulation, or release embodying the terms of a structured settlement.\n\"Structured settlement obligor\" means the party that has the continuing periodic payment obligation to the payee under a structured settlement agreement or a qualified assignment agreement.\n\"Structured settlement payment rights\" means rights to receive periodic payments under a structured settlement, whether from the settlement obligor or the annuity issuer, where: (1) the payee or any other interested party is domiciled in the state; or (2) the structured settlement agreement was approved by a court or responsible administrative authority in the state.\n\"Structured settlement purchase company\" means a person that acts as a transferee in the state and who is registered with the secretary pursuant to section 549.35.\n\"Structured settlement transfer proceeding\" means a court proceeding initiated by the filing of an application by a structured settlement purchase company seeking court approval of a transfer in accordance with sections 549.30 to 549.41.\n\"Terms of the structured settlement\" means the terms of the structured settlement agreement, the annuity contract, a qualified assignment agreement, and an order or approval of a court, responsible administrative authority, or other government authority authorizing or approving the structured settlement.\n\"Transfer\" means a sale, assignment, pledge, hypothecation, or other form of alienation or encumbrance made by a payee for consideration. A transfer does not include the creation or perfection of a security interest in structured settlement payment rights under a blanket security agreement entered into with an insured depository institution, in the absence of any action to redirect the structured settlement payments to such insured depository institution, or an agent or successor in interest thereof, or otherwise to enforce such blanket security interest against the structured settlement payment rights.\n\"Transfer agreement\" means the agreement providing for transfer of structured settlement payment rights from a payee to a transferee.\n\"Transfer expense\" means all expenses of a transfer that are required under the transfer agreement to be paid by the payee or deducted from the gross advance amount, including, without limitation, court filing fees, attorney fees, escrow fees, lien recordation fees, and judgment and lien search fees. Transfer expense does not include preexisting obligations of the payee payable for the payee's account from the proceeds of the transfer.\n\"Transfer order\" means an order approving a transfer in accordance with sections 549.30 to 549.41.\n\"Transferee\" means a person acquiring or proposing to acquire structured settlement payment rights through a transfer.",
	"repealed": false
}