{
	"id": "609.106",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.106",
	"title": "609.106 HEINOUS CRIMES.",
	"text": "(a) As used in this section, \"heinous crime\" means:\n(1) a violation or attempted violation of section 609.185 or 609.19;\n(2) a violation of section 609.195 or 609.221; or\n(3) a violation of section 609.342, 609.343, or 609.344, if the offense was committed with force or violence.\n(b) \"Previous conviction\" means a conviction in Minnesota for a heinous crime or a conviction elsewhere for conduct that would have been a heinous crime under this chapter if committed in Minnesota. The term includes any conviction that occurred before the commission of the present offense of conviction, but does not include a conviction if 15 years have elapsed since the person was discharged from the sentence imposed for the offense.\nExcept as provided in subdivision 3, the court shall sentence a person to life imprisonment without possibility of release under the following circumstances:\n(1) the person is convicted of first-degree murder under section 609.185, paragraph (a), clause (1), (2), (4), or (7), or murder of unborn child in the first degree under section 609.2661, clause (1) or (2);\n(2) the person is convicted of committing first-degree murder in the course of a kidnapping under section 609.185, paragraph (a), clause (3), or murder of unborn child in the first degree in the course of a kidnapping under section 609.2661, clause (3); or\n(3) the person is convicted of first-degree murder under section 609.185, paragraph (a), clause (3), (5), or (6), or murder of unborn child in the first degree under section 609.2661, clause (3), and the court determines on the record at the time of sentencing that the person has one or more previous convictions for a heinous crime.\nThe court shall sentence a person who was under 18 years of age at the time of the commission of an offense under the circumstances described in subdivision 2 to imprisonment for life.",
	"repealed": false
}