{
	"id": "290C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/290C.02",
	"title": "290C.02 DEFINITIONS.",
	"text": "When used in sections 290C.01 to 290C.13, the terms in this section have the meanings given them.\n\"Approved plan writers\" are natural resource professionals who are self-employed, employed by private companies or individuals, nonprofit organizations, local units of government, or public agencies, and who are approved by the commissioner of natural resources. Persons determined to be certified foresters by the Society of American Foresters shall be deemed to meet the standards required under this subdivision. The commissioner of natural resources shall issue a unique identification number to each approved planner.\n(a) \"Claimant\" means:\n(1) a person, as that term is defined in section 290.01, subdivision 2, who owns forest land in Minnesota and files an application authorized by the Sustainable Forest Incentive Act;\n(2) a purchaser or grantee if property enrolled in the program was sold or transferred after the original application was filed and prior to the annual incentive payment being made; or\n(3) an owner of land previously covered by an auxiliary forest contract that automatically qualifies for inclusion in the Sustainable Forest Incentive Act program pursuant to section 88.49, subdivision 9a, or 88.491, subdivision 2.\n(b) Owners of land that qualifies for inclusion pursuant to section 88.49, subdivision 9a, or 88.491, subdivision 2, must notify the commissioner in writing of the expiration of the auxiliary forest contract or land trade with a governmental unit and submit an application to the commissioner by July 1 in order to be eligible to receive a payment by October 1 of that same year. For purposes of section 290C.11, claimant also includes any person bound by the covenant required in section 290C.04.\n(c) No more than one claimant is entitled to a payment under this chapter with respect to any tract, parcel, or piece of land enrolled under this chapter that has been assigned the same parcel identification number. When enrolled forest land is owned by two or more persons, the owners must determine between them which person is eligible to claim the payments provided under sections 290C.01 to 290C.13. In the case of property sold or transferred, the former owner and the purchaser or grantee must determine between them which person is eligible to claim the payments provided under sections 290C.01 to 290C.13. The owners, transferees, or grantees must notify the commissioner in writing which person is eligible to claim the payments.\n\"Commissioner\" means the commissioner of revenue.\n[Repealed, 1Sp2017 c 1 art 10 s 17]\n\"Forest land\" means land containing a minimum of 20 contiguous acres for which the owner has implemented a forest management plan that was prepared or updated within the past ten years by an approved plan writer. For purposes of this subdivision, acres are considered to be contiguous even if they are separated by a road, waterway, railroad track, or other similar intervening property. At least 50 percent of the contiguous acreage must meet the definition of forest land in section 88.01, subdivision 7. For the purposes of sections 290C.01 to 290C.13, forest land does not include (i) land used for residential or agricultural purposes, (ii) land enrolled in the reinvest in Minnesota program, a state or federal conservation reserve or easement reserve program under sections 103F.501 to 103F.531, the Minnesota agricultural property tax law under section 273.111, or land subject to agricultural land preservation controls or restrictions as defined in section 40A.02 or under the Metropolitan Agricultural Preserves Act under chapter 473H, (iii) any land that becomes subject to a conservation easement funded under section 97A.056 or a comparable permanent easement conveyed to a governmental or nonprofit entity after May 30, 2013; or (iv) land improved with a structure; pavement, other than a paved trail under easement, lease, or terminable license to the state of Minnesota or a political subdivision; sewer; campsite; or any road, other than a township road, used for purposes not prescribed in the forest management plan.\n\"Forest management plan\" means a written document providing a framework for site-specific healthy, productive, and sustainable forest resources. A forest management plan must include at least the following: (i) forest management goals for the land; (ii) a reliable field inventory of the individual forest cover types, their age, and density; (iii) a description of the soil type and quality; (iv) an aerial photo and/or map of the vegetation and other natural features of the land clearly indicating the boundaries of the land and of the forest land; (v) the proposed future conditions of the land; (vi) prescriptions to meet proposed future conditions of the land; (vii) a recommended timetable for implementing the prescribed activities; and (viii) a legal description of the land encompassing the parcels included in the plan. All management activities prescribed in a plan must be in accordance with the recommended timber harvesting and forest management guidelines. The commissioner of natural resources shall provide a framework for plan content and updating and revising plans.\n\"Timber harvesting and forest management guidelines\" means guidelines developed under section 89A.05 and adopted by the Minnesota Forest Resources Council in effect at the time the tract, parcel, or piece of land is enrolled in the sustainable forest incentive program.\n[Repealed, 1Sp2017 c 1 art 10 s 17]",
	"repealed": false
}