{
	"id": "400.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/400.04",
	"title": "400.04 SOLID WASTE MANAGEMENT PROGRAM.",
	"text": "Any county may conduct a solid waste management program which may include activities authorized by sections 400.01 to 400.17 and such other activities as are necessary and convenient to effectively carry out the purposes of sections 400.01 to 400.17. A county that enters into a joint powers agreement under section 471.59 with a metropolitan county as defined in section 473.121, subdivision 4, to accomplish a solid waste management purpose may exercise the powers of the metropolitan county for the purpose of solid waste management under the joint powers agreement.\nA county may acquire by gift, lease, purchase, or eminent domain as provided by law any land or interest in land upon such terms and conditions as it shall determine, including the use of contracts for deed, within or outside of the county, which the board deems suitable for these purposes; provided that no such land or interest in land situated in any other county shall be acquired without the approval by resolution of the county board thereof.\nA county may acquire, construct, enlarge, improve, repair, supervise, control, maintain, and operate any and all solid waste facilities and other property and facilities needed, used, or useful for solid waste management purposes. Notwithstanding any other law to the contrary, a county may purchase and lease materials, equipment, machinery, and such other personal property as is necessary for such purposes including recycling upon terms and conditions determined by the board, with or without advertisement for bids including the use of conditional sales contracts and lease-purchase agreements. If a county contract is let by negotiation, without advertising for bids, the county shall conduct such negotiation and award the contract using a fair and open procedure and in full compliance with chapter 13D. If a county contract is to be awarded by bid, the county may, after notice to the public and prospective bidders, conduct a fair and open process of prequalification of bidders prior to advertisement for bids. A county may employ such personnel as are reasonably necessary for the care, maintenance and operation of such property and facilities. A county shall contract with private persons for the construction, maintenance, and operation of solid waste facilities where the facilities are adequate and available for use and competitive with other means of providing the same service.\nNotwithstanding sections 375.21 and 471.345, a county may enter into contracts for the construction, installation, maintenance, and operation of property and facilities on private or public lands and may contract for the furnishing of solid waste management services upon terms and conditions determined by the board, with or without advertisement for bids, including the use of conditional sales contracts and lease-purchase agreements. If a county contract is let by negotiation, without advertising for bids, the county shall conduct negotiations and award the contract using a fair and open procedure and in full compliance with chapter 13D. If an agency permit is required for a solid waste service, a contract entered into under this subdivision is not binding until the permit is issued.\nThe county may provide for surveys and plans to determine locations available, appropriate, and suitable for property and facilities needed for the program, and plans for the improvement of property and facilities.\nA county is authorized to expend funds for the purposes enumerated in this section and for any other activities necessary to an efficient solid waste management program.",
	"repealed": false
}