{
	"id": "16A.1285",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.1285",
	"title": "16A.1285 DEPARTMENTAL EARNINGS; CHARGES LEVIED BY AGENCY.",
	"text": "In this section, \"departmental earnings\" means any charge for goods and services and any regulatory, licensure, or other similar charges levied by any state agency and paid by individuals, businesses, or other nonstate entities. This definition must not be construed to include general taxes collected by a state agency or charges for services provided by one state agency to another state agency.\nUnless otherwise provided by law, specific charges falling within definitions stipulated in subdivision 1 must be set at a level that neither significantly over recovers nor under recovers costs, including overhead costs, involved in providing the services.\nUnless specifically provided otherwise in statute, in setting, adjusting, or authorizing charges that in whole or in part recover previously unrecovered costs, recovery is limited to those unrecovered costs incurred during the two fiscal years immediately preceding the setting, adjustment, or authorization.\nThe commissioner of management and budget shall classify, monitor, analyze, and report all departmental earnings that fall within the definition established in subdivision 1. Specifically, the commissioner shall:\n(1) establish and maintain a classification system that clearly defines and distinguishes categories and types of departmental earnings and takes into account the purpose of the various earnings types and the extent to which various earnings types serve a public or private interest;\n(2) prepare a biennial report that documents collection costs, purposes, and yields of all departmental earnings, the report to be submitted to the legislature on or before the fourth Tuesday in January in each odd-numbered year and to include estimated data for the year in which the report is prepared, actual data for the two years immediately before, and estimates for the two years immediately following; and\n(3) prepare and maintain a detailed directory of all departmental earnings.\nIn a year following the election of a governor who had not been governor the previous year, the report required by clause (2) must be submitted by the third Tuesday in February.\n[Repealed, 1999 c 250 art 1 s 115 para (d)]\n[Repealed, 1999 c 250 art 1 s 115 para (d)]",
	"repealed": false
}