{
	"id": "260.771",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.771",
	"title": "260.771 INVOLUNTARY CHILD PLACEMENT PROCEEDINGS.",
	"text": "[Renumbered 260.763, subd 1]\nIn any child placement proceeding, the child-placing agency or petitioner shall ensure that appropriate active efforts as described in section 260.762 are provided to the Indian child's parent or parents, Indian custodian, and family to support reunification and preservation of the Indian child's placement with and relationship to the Indian child's extended family.\nIn any child placement proceeding, the child-placing agency or petitioner shall follow the placement preferences described in section 260.773 or, where preferred placement is not available even with the provision of active efforts, shall follow section 260.773, subdivisions 12 to 15.\nAny child-placing agency or petitioner considering placement of an Indian child shall ensure active efforts are made to identify and locate siblings and extended family members and to explore placement with extended family members and ensure the Indian child's relationship with the Indian child's extended family and Tribe.\nThe notice provisions in section 260.761 apply to all involuntary child placement proceedings under this section. An Indian child ten years of age and older, the Indian child's parent or parents, the Indian custodian, and the Indian child's Tribe shall have notice of the right to participate in all hearings regarding the Indian child.\nIn any child placement proceeding, the court shall establish whether an Indian child is involved and the identity of the Indian child's Tribe. Sections 260.751 to 260.835 and the federal Indian Child Welfare Act are applicable without exception in any child placement proceeding involving an Indian child. Sections 260.751 to 260.835 apply to child placement proceedings involving an Indian child whether the child is in the physical or legal custody of an Indian parent or parents, Indian custodian, Indian extended family member, or other person at the commencement of the proceedings. A court shall not determine the applicability of sections 260.751 to 260.835 or the federal Indian Child Welfare Act to a child placement proceeding based upon whether an Indian child is part of an existing Indian family or based upon the level of contact a child has with the child's Indian Tribe, reservation, society, or off-reservation community.\nIn any state court child placement proceeding of an Indian child, the Indian child's Tribe, parent or parents, and Indian custodian shall have the right to intervene at any point in the proceeding.\n(a) In any state court child placement proceeding, including but not limited to any proceeding where the petitioner or another party seeks to temporarily or permanently remove an Indian child from the Indian child's parent or parents or Indian custodian, the Indian child's parent or parents or Indian custodian shall have the right to be represented by an attorney. If the parent or parents or Indian custodian cannot afford an attorney and meet the requirements of section 611.17, an attorney will be appointed to represent them.\n(b) In any state court child placement proceeding, any Indian child ten years of age or older shall have the right to court-appointed counsel. The court may appoint counsel for any Indian child under ten years of age in any state court child placement proceeding if the court determines that appointment is appropriate and in the best interest of the Indian child.\n(c) If the court appoints counsel to represent a person pursuant to this subdivision, the court shall appoint counsel to represent the person prior to the first hearing on the petition, but may appoint counsel at any stage of the proceeding if the court deems it necessary. The court shall not appoint a public defender to represent the person unless such appointment is authorized by section 611.14.\nEach party to a proceeding under this section involving an Indian child shall have the right to examine all the reports or other documents filed with the court upon which any decision with respect to the action may be based.\nAt any subsequent stage of the child-placing agency or petitioner's involvement with an Indian child, the child-placing agency or petitioner shall, upon request, give the Tribal social services agency full cooperation including access to all files concerning the Indian child. If the files contain confidential or private data, the child-placing agency or petitioner may require execution of an agreement with the Tribal social services agency specifying that the Tribal social services agency shall maintain the data according to statutory provisions applicable to the data.\n(a) In any child placement proceeding that involves an Indian child, any Tribe that the Indian child may be eligible for membership in, as determined by the Tribe, is a party to the proceedings without the need to file a motion.\n(b) An Indian child's Tribe, Tribal representative, or attorney representing the Tribe:\n(1) may appear remotely at hearings by telephone, video conference, or other electronic medium without prior request;\n(2) is not required to use the court's electronic filing and service system and may use United States mail, facsimile, or other alternative method for filing and service;\n(3) may file documents with the court using an alternative method that the clerk of court shall accept and file electronically;\n(4) is exempt from any filing fees required under section 357.021; and\n(5) is exempt from the pro hac vice requirements of Rule 5 of the Minnesota General Rules of Practice.\n[Renumbered 260.763, subd 4]\n[Renumbered 260.763, subd 5]\n(a) [Renumbered 260.763, subd 2]\n(b) [Renumbered 260.763 subd 2a]\n[Renumbered 260.763, subd 3]\n(a) In any involuntary placement proceeding, the court must determine by clear and convincing evidence, including testimony of a qualified expert witness, that continued custody of the Indian child by the parent or Indian custodian is likely to result in serious emotional damage or serious physical damage to the Indian child.\nIn a termination of parental rights proceeding, the court must determine by evidence beyond a reasonable doubt, including testimony of a qualified expert witness, that continued custody of the Indian child by the parent or Indian custodian is likely to result in serious emotional damage or serious physical damage to the Indian child.\nIn an involuntary permanent transfer of legal and physical custody, permanent custody to the agency, temporary custody to the agency, or other permanency proceeding, the court must determine by clear and convincing evidence, including testimony of a qualified expert witness, that the continued custody of the Indian child by the Indian child's parent or parents or Indian custodian is likely to result in serious emotional damage or serious physical damage to the Indian child. Qualified expert witness testimony is not required where custody is transferred to the Indian child's parent.\nTestimony of a qualified expert witness shall be provided for involuntary child placement and permanency proceedings independently.\n(b) The child-placing agency, petitioner, or any other party shall make diligent efforts to locate and present to the court a qualified expert witness designated by the Indian child's Tribe. The qualifications of a qualified expert witness designated by the Indian child's Tribe are not subject to a challenge in Indian child placement proceedings.\n(c) If a party cannot obtain testimony from a Tribally designated qualified expert witness, the party shall submit to the court the diligent efforts made to obtain a Tribally designated qualified expert witness.\n(d) If clear and convincing evidence establishes that a party's diligent efforts cannot produce testimony from a Tribally designated qualified expert witness, the party shall demonstrate to the court that a proposed qualified expert witness is, in descending order of preference:\n(1) a member of the Indian child's Tribe who is recognized by the Indian child's Tribal community as knowledgeable in Tribal customs as they pertain to family organization and child-rearing practices; or\n(2) an Indian person from an Indian community who has substantial experience in the delivery of child and family services to Indians and extensive knowledge of prevailing social and cultural standards and contemporary and traditional child-rearing practices of the Indian child's Tribe.\nIf clear and convincing evidence establishes that diligent efforts have been made to obtain a qualified expert witness who meets the criteria in clause (1) or (2), but those efforts have not been successful, a party may use an expert witness, as defined by the Minnesota Rules of Evidence, rule 702, who has substantial experience in providing services to Indian families and who has substantial knowledge of prevailing social and cultural standards and child-rearing practices within the Indian community. The court or any party may request the assistance of the Indian child's Tribe or the Bureau of Indian Affairs agency serving the Indian child's Tribe in locating persons qualified to serve as expert witnesses.\n(e) The court may allow alternative methods of participation and testimony in state court proceedings by a qualified expert witness, such as participation or testimony by telephone, video conference, or other electronic medium.\n[Renumbered 260.773]\nGuardians ad litem shall be specifically trained in the provision of services to Indian children, parent or parents, and Indian custodians under relevant federal and state laws and rules of court pursuant to section 480.35, subdivision 2, clause (3).",
	"repealed": false
}