{
	"id": "203B.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.05",
	"title": "203B.05 DESIGNATION OF MUNICIPAL CLERKS TO ADMINISTER ABSENTEE VOTING LAWS.",
	"text": "The full-time clerk of any city or town shall administer the provisions of sections 203B.04 to 203B.15 and 203B.30 if:\n(1) the county auditor of that county has designated the clerk to administer them; or\n(2) the clerk has given the county auditor of that county notice of intention to administer them.\nThe designation or notice must specify whether the clerk will be responsible for the administration of a ballot board as provided in section 203B.121.\nA clerk of a city that is located in more than one county may only administer the provisions of sections 203B.04 to 203B.15 and 203B.30 if the clerk has been designated by each of the county auditors or has provided notice to each of the county auditors that the city will administer absentee voting. A clerk may only administer the provisions of sections 203B.04 to 203B.15 and 203B.30 if the clerk has technical capacity to access the statewide voter registration system in the secure manner prescribed by the secretary of state. The secretary of state must identify hardware, software, security, or other technical prerequisites necessary to ensure the security, access controls, and performance of the statewide voter registration system. A clerk must receive training approved by the secretary of state on the use of the statewide voter registration system before administering this section. A clerk may not use the statewide voter registration system until the clerk has received the required training. The county auditor must notify the secretary of state of any municipal clerk who will be administering the provisions of this section and the duties that the clerk will administer.\n[See Note.]\nFor city, town, and school district elections not held on the same day as a statewide election, applications for absentee ballots shall be filed with the city, school district, or town clerk and the duties prescribed by this chapter for the county auditor shall be performed by the city, school district, or town clerk unless the county auditor agrees to perform those duties on behalf of the city, school district, or town clerk. The costs incurred to provide absentee ballots and perform the duties prescribed by this subdivision shall be paid by the city, town, or school district holding the election.\nNotwithstanding any other law, this chapter applies to school district elections held on the same day as a statewide election or an election for a county or municipality wholly or partially within the school district.",
	"repealed": false
}