{
	"id": "16D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/16D.08",
	"title": "16D.08 COLLECTION DUTIES AND POWERS.",
	"text": "The commissioner shall take all reasonable and cost-effective actions to collect debts referred to the commissioner.\n(a) In addition to the collection remedies available to private collection agencies in this state, the commissioner, with legal assistance from the attorney general, may utilize any statutory authority granted to a referring agency for purposes of collecting debt owed to that referring agency. The commissioner may also use the tax collection remedies in sections 270C.03, subdivision 1, clause (8), 270C.31, 270C.32, 270C.52, subdivisions 2 and 3, 270C.63, 270C.65, and 270C.67 to 270C.72. A debtor may take advantage of any administrative or appeal rights contained in the listed sections. For administrative and appeal rights for nontax debts, references to administrative appeals or to the taxpayer rights advocate shall be construed to be references to the case reviewer, references to Tax Court shall be construed to mean district court, and offers in compromise shall be submitted to the referring agency. A debtor who qualifies for cancellation of collection costs under section 16D.11, subdivision 3, clause (1), can apply to the commissioner for reduction or release of a continuous wage levy, if the debtor establishes that the debtor needs all or a portion of the wages being levied upon to pay for essential living expenses, such as food, clothing, shelter, medical care, or expenses necessary for maintaining employment. The commissioner's determination not to reduce or release a continuous wage levy is appealable to district court. The word \"tax\" or \"taxes\" when used in the tax collection statutes listed in this subdivision also means debts referred under this chapter.\n(b) Before using the tax collection remedies listed in this subdivision, notice and demand for payment of the amount due must be given to the person liable for the payment or collection of the debt at least 30 days prior to the use of the remedies. The notice must be sent to the person's last known address and must include a brief statement that sets forth in simple and nontechnical terms the amount and source of the debt, the nature of the available collection remedies, and remedies available to the debtor.",
	"repealed": false
}