{
	"id": "611.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.42",
	"title": "611.42 COMPETENCY MOTION PROCEDURES.",
	"text": "A defendant is incompetent and shall not plead, be tried, or be sentenced if, due to a mental illness or cognitive impairment, the defendant lacks the ability to:\n(1) rationally consult with counsel;\n(2) understand the proceedings; or\n(3) participate in the defense.\n(a) A defendant must not be allowed to waive counsel if the defendant lacks ability to:\n(1) knowingly, voluntarily, and intelligently waive the right to counsel;\n(2) appreciate the consequences of proceeding without counsel;\n(3) comprehend the nature of the charge;\n(4) comprehend the nature of the proceedings;\n(5) comprehend the possible punishment; or\n(6) comprehend any other matters essential to understanding the case.\n(b) The court must not proceed under this section before a lawyer consults with the defendant and has an opportunity to be heard.\n(a) At any time, the prosecutor or defense counsel may make a motion challenging the defendant's competency, or the court on its initiative may raise the issue. The defendant's consent is not required to bring a competency motion. The motion shall be supported by specific facts but shall not include communications between the defendant and defense counsel if disclosure would violate attorney-client privilege. By bringing the motion, the defendant does not waive attorney-client privilege.\n(b) If competency is at issue, the court shall appoint a forensic navigator to provide the services described in section 611.55, including development of a bridge plan to identify appropriate housing and services if the defendant is released from custody or any charges are dismissed.\n(c) In felony, gross misdemeanor, and targeted misdemeanor cases, if the court determines there is a reasonable basis to doubt the defendant's competency and there is probable cause for the charge, the court must suspend the criminal proceedings and order an examination of the defendant.\n(d) In misdemeanor cases, other than cases involving a targeted misdemeanor, if the court determines there is a reasonable basis to doubt the defendant's competency and there is probable cause for the charge, the court must suspend the criminal proceedings. The court may order an examination of the defendant under section 611.43 if the examination is in the public interest. For purposes of this paragraph, an examination is in the public interest when it is necessary to assess whether the defendant has a cognitive impairment or mental illness; determine whether a defendant has the ability to access housing, food, income, disability verification, medications, and treatment for medical conditions; or whether a defendant has the ability to otherwise address any basic needs.\n(a) Except as provided in this subdivision, when the court determines there is a reasonable basis to doubt a defendant's competency and orders an examination of the defendant, a forensic navigator must complete a bridge plan with the defendant as described in section 611.55, subdivision 4, submit the bridge plan to the court, and provide a written copy to the defendant before the court or prosecutor dismisses any charges based on a belief or finding that the defendant is incompetent. The court may dismiss a case where the most serious charge is a misdemeanor, other than a targeted misdemeanor, without holding a hearing unless either party objects.\n(b) If for any reason a forensic navigator has not been appointed, the court must make every reasonable effort to coordinate with any resources available to the court and refer the defendant for possible assessment and social services, including but not limited to services for engagement under section 253B.041, before dismissing any charges based on a finding that the defendant is incompetent.\n(c) If working with the forensic navigator or coordinating a referral to services would cause an unreasonable delay in the release of a defendant being held in custody, the court may release the defendant. If a defendant has not been engaged for assessment and referral before release, the court may coordinate with the forensic navigator or any resources available to the court to engage the defendant for up to 90 days after release.\n(d) Courts may partner and collaborate with county social services, community-based programs, jails, and any other available resource to provide referrals to services when a defendant's competency is at issue or a defendant has been found incompetent to proceed.\n(e) Counsel for the defendant may bring a motion to dismiss the proceedings in the interest of justice at any stage of the proceedings.",
	"repealed": false
}