{
	"id": "297B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/297B.01",
	"title": "297B.01 DEFINITIONS.",
	"text": "The following words, terms and phrases when used in Laws 1971, chapter 853, shall have the meaning ascribed to them in this section except where the context clearly indicates a different meaning.\nMS 2006 [Renumbered subd 13]\nMS 2006 [Renumbered subd 12]\nMS 2006 [Renumbered subd 18]\nMS 2006 [Renumbered subd 11]\nMS 2006 [Renumbered subd 17]\nMS 2006 [Renumbered subd 16]\nMS 2006 [Renumbered subd 14]\nMS 2006 [Renumbered subd 15]\nUnless specifically defined otherwise, \"Internal Revenue Code\" means the Internal Revenue Code as defined in section 289A.02, subdivision 7.\n\"Motor vehicle\" means any self-propelled vehicle not operated exclusively upon railroad tracks and any vehicle propelled or drawn by a self-propelled vehicle for which registration is required by chapter 168. Motor vehicle includes vehicles known as trackless trolleys which are propelled by electric power obtained from overhead trolley wires but not operated upon rails and motor vehicles that are purchased on Indian reservations where the tribal council has entered into a sales tax on motor vehicles refund agreement with the state of Minnesota. Motor vehicle does not include snowmobiles or manufactured homes.\n\"Motor vehicle registrar\" shall mean the registrar of motor vehicles who is the officer in charge of the Division of Driver and Vehicle Services, Department of Public Safety, of this state and who shall act as the agent of the commissioner of revenue in administering the provisions of this chapter.\n\"Person\" includes any individual, firm, partnership, joint adventure, association, corporation, estate, business trust, receiver, or any other group or combination acting as a unit and the plural as well as the singular number.\n(a) \"Purchase price\" means the total consideration valued in money for a sale, whether paid in money or otherwise. The purchase price excludes the amount of a manufacturer's rebate paid or payable to the purchaser. If a motor vehicle is taken in trade as a credit or as part payment on a motor vehicle taxable under this chapter, the credit or trade-in value allowed by the person selling the motor vehicle shall be deducted from the total selling price to establish the purchase price of the vehicle being sold and the trade-in allowance allowed by the seller shall constitute the purchase price of the motor vehicle accepted as a trade-in. The purchase price in those instances where the motor vehicle is acquired by gift or by any other transfer for a nominal or no monetary consideration shall also include the average value of similar motor vehicles, established by standards and guides as determined by the motor vehicle registrar. The purchase price in those instances where a motor vehicle is manufactured by a person who registers it under the laws of this state shall mean the manufactured cost of such motor vehicle and manufactured cost shall mean the amount expended for materials, labor, and other properly allocable costs of manufacture, except that in the absence of actual expenditures for the manufacture of a part or all of the motor vehicle, manufactured costs shall mean the reasonable value of the completed motor vehicle.\n(b) The term \"purchase price\" shall not include the portion of the value of a motor vehicle due solely to modifications necessary to make the motor vehicle accessible to persons with a disability.\n(c) The term \"purchase price\" shall not include the transfer of a motor vehicle by way of gift between spouses or parent and child, or to a nonprofit organization as provided under subdivision 16, paragraph (c), clause (6), nor shall it include the transfer of a motor vehicle by a guardian to a ward when there is no monetary consideration and the title to such vehicle was registered in the name of the guardian, as guardian, only because the ward was a minor.\n(d) The term \"purchase price\" shall not include the transfer of a motor vehicle as a gift between a foster parent and foster child. For purposes of this subdivision, a foster relationship exists, regardless of the age of the child, if (1) a foster parent's home is or was licensed as a foster family home under Minnesota Rules, parts 2960.3000 to 2960.3340, and (2) the county verifies that the child was a state ward or in permanent foster care.\n(e) There shall not be included in \"purchase price\" the amount of any tax imposed by the United States upon or with respect to retail sales whether imposed upon the retailer or the consumer.\n\"Purchaser\" shall mean any person owning or in possession of a motor vehicle who makes application to the motor vehicle registrar for registration plates for such vehicle or for transfer of ownership of a vehicle previously registered in this state.\n(a) \"Sale,\" \"sells,\" \"selling,\" \"purchase,\" \"purchased,\" or \"acquired\" means any transfer of title of any motor vehicle, whether absolutely or conditionally, for a consideration in money or by exchange or barter for any purpose other than resale in the regular course of business.\n(b) Any motor vehicle utilized by the owner only by leasing such vehicle to others or by holding it in an effort to so lease it, and which is put to no other use by the owner other than resale after such lease or effort to lease, shall be considered property purchased for resale.\n(c) The terms also shall include any transfer of title or ownership of a motor vehicle by other means, for or without consideration, except that these terms shall not include:\n(1) the acquisition of a motor vehicle by inheritance from or by bequest of, or transfer-on-death of title by, a decedent who owned it;\n(2) the transfer of a motor vehicle which was previously licensed in the names of two or more joint tenants and subsequently transferred without monetary consideration to one or more of the joint tenants;\n(3) the transfer of a motor vehicle by way of gift from a limited used vehicle dealer licensed under section 168.27, subdivision 4a, to an individual, when the transfer is with no monetary or other consideration or expectation of consideration and the parties to the transfer submit an affidavit to that effect at the time the title transfer is recorded;\n(4) the transfer of a motor vehicle by gift between:\n(i) spouses;\n(ii) parents and a child; or\n(iii) grandparents and a grandchild;\n(5) the voluntary or involuntary transfer of a motor vehicle between spouses in a divorce proceeding; or\n(6) the transfer of a motor vehicle by way of a gift to an organization that is exempt from federal income taxation under section 501(c)(3) of the Internal Revenue Code when the motor vehicle will be used exclusively for religious, charitable, or educational purposes.\n\"Use\" shall mean the exercise by any person of any right or power over a motor vehicle incident to the ownership or possession of such a vehicle, except that it shall not include the sale or holding for sale of such a vehicle in the regular course of business. The term shall not include motor vehicles rented or leased.\n\"Vehicle\" shall include every device in, upon, or by which any person or property may be transported or drawn upon a public highway, except devices moved by human power or animal power or used exclusively upon stationary rails or tracks.",
	"repealed": false
}