{
	"id": "125A.0942",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.0942",
	"title": "125A.0942 STANDARDS FOR RESTRICTIVE PROCEDURES.",
	"text": "(a) Schools that intend to use restrictive procedures shall maintain and make publicly accessible in an electronic format on a school or district website or make a paper copy available upon request describing a restrictive procedures plan for children with disabilities that at least:\n(1) lists the restrictive procedures the school intends to use;\n(2) describes how the school will implement a range of positive behavior strategies and provide links to mental health services;\n(3) describes how the school will provide training on de-escalation techniques, consistent with section 122A.187, subdivision 4;\n(4) describes how the school will monitor and review the use of restrictive procedures, including:\n(i) conducting post-use debriefings, consistent with subdivision 3, paragraph (a), clause (5); and\n(ii) convening an oversight committee to undertake a quarterly review of the use of restrictive procedures based on patterns or problems indicated by similarities in the time of day, day of the week, duration of the use of a procedure, the individuals involved, or other factors associated with the use of restrictive procedures; the number of times a restrictive procedure is used schoolwide and for individual children; the number and types of injuries, if any, resulting from the use of restrictive procedures; whether restrictive procedures are used in nonemergency situations; the need for additional staff training; and proposed actions to minimize the use of restrictive procedures; any disproportionate use of restrictive procedures based on race, gender, or disability status; the role of the school resource officer or police in emergencies and the use of restrictive procedures; and documentation to determine if the standards for using restrictive procedures as described in sections 125A.0941 and 125A.0942 are met; and\n(5) includes a written description and documentation of the training staff completed under subdivision 5.\n(b) Schools annually must publicly identify oversight committee members who must at least include:\n(1) a mental health professional, school psychologist, or school social worker;\n(2) an expert in positive behavior strategies;\n(3) a special education administrator; and\n(4) a general education administrator.\n(a) Restrictive procedures may be used only by a licensed special education teacher, school social worker, school psychologist, behavior analyst certified by the National Behavior Analyst Certification Board, a person with a master's degree in behavior analysis, other licensed education professional, paraprofessional under section 120B.363, or mental health professional under section 245.4871, subdivision 27, who has completed the training program under subdivision 5.\n(b) A school shall make reasonable efforts to notify the parent on the same day a restrictive procedure is used on the child, or if the school is unable to provide same-day notice, notice is sent within two days by written or electronic means or as otherwise indicated by the child's parent under paragraph (f).\n(c) The district must hold a meeting of the individualized education program or individualized family service plan team, conduct or review a functional behavioral analysis, review data, consider developing additional or revised positive behavioral interventions and supports, consider actions to reduce the use of restrictive procedures, and modify the individualized education program, individualized family service plan, or behavior intervention plan as appropriate. The district must hold the meeting: within ten calendar days after district staff use restrictive procedures on two separate school days within 30 calendar days or a pattern of use emerges and the child's individualized education program, individualized family service plan, or behavior intervention plan does not provide for using restrictive procedures in an emergency; or at the request of a parent or the district after restrictive procedures are used. The district must review use of restrictive procedures at a child's annual individualized education program or individualized family service plan meeting when the child's individualized education program or individualized family service plan provides for using restrictive procedures in an emergency.\n(d) If the individualized education program or individualized family service plan team under paragraph (c) determines that existing interventions and supports are ineffective in reducing the use of restrictive procedures or the district uses restrictive procedures on a child on ten or more school days during the same school year, the team, as appropriate, either must consult with other professionals working with the child; consult with experts in behavior analysis, mental health, communication, or autism; consult with culturally competent professionals; review existing evaluations, resources, and successful strategies; or consider whether to reevaluate the child.\n(e) At the individualized education program or individualized family service plan meeting under paragraph (c), the team must review any known medical or psychological limitations, including any medical information the parent provides voluntarily, that contraindicate the use of a restrictive procedure, consider whether to prohibit that restrictive procedure, and document any prohibition in the individualized education program, individualized family service plan, or behavior intervention plan.\n(f) An individualized education program or individualized family service plan team may plan for using restrictive procedures and may include these procedures in a child's individualized education program, individualized family service plan, or behavior intervention plan; however, the restrictive procedures may be used only in response to behavior that constitutes an emergency, consistent with this section. The individualized education program, individualized family service plan, or behavior intervention plan shall indicate how the parent wants to be notified when a restrictive procedure is used.\n(a) Physical holding or seclusion may be used only in an emergency. A school that uses physical holding or seclusion shall meet the following requirements:\n(1) physical holding or seclusion is the least intrusive intervention that effectively responds to the emergency;\n(2) physical holding or seclusion is not used to discipline a noncompliant child;\n(3) physical holding or seclusion ends when the threat of harm ends and the staff determines the child can safely return to the classroom or activity;\n(4) staff directly observes the child while physical holding or seclusion is being used;\n(5) each time physical holding or seclusion is used, the staff person who implements or oversees the physical holding or seclusion documents, as soon as possible after the incident concludes, the following information:\n(i) a description of the incident that led to the physical holding or seclusion;\n(ii) why a less restrictive measure failed or was determined by staff to be inappropriate or impractical;\n(iii) the time the physical holding or seclusion began and the time the child was released;\n(iv) a brief record of the child's behavioral and physical status; and\n(v) a brief description of the post-use debriefing that occurred as a result of the use of the physical hold or seclusion;\n(6) the room used for seclusion must:\n(i) be at least six feet by five feet;\n(ii) be well lit, well ventilated, adequately heated, and clean;\n(iii) have a window that allows staff to directly observe a child in seclusion;\n(iv) have tamperproof fixtures, electrical switches located immediately outside the door, and secure ceilings;\n(v) have doors that open out and are unlocked, locked with keyless locks that have immediate release mechanisms, or locked with locks that have immediate release mechanisms connected with a fire and emergency system; and\n(vi) not contain objects that a child may use to injure the child or others; and\n(7) before using a room for seclusion, a school must:\n(i) receive written notice from local authorities that the room and the locking mechanisms comply with applicable building, fire, and safety codes; and\n(ii) register the room with the commissioner, who may view that room.\n(b) By February 1, 2015, and annually thereafter, stakeholders may, as necessary, recommend to the commissioner specific and measurable implementation and outcome goals for reducing the use of restrictive procedures and the commissioner must submit to the legislature a report on districts' progress in reducing the use of restrictive procedures that recommends how to further reduce these procedures and eliminate the use of seclusion. The statewide plan includes the following components: measurable goals; the resources, training, technical assistance, mental health services, and collaborative efforts needed to significantly reduce districts' use of seclusion; and recommendations to clarify and improve the law governing districts' use of restrictive procedures. The commissioner must consult with interested stakeholders when preparing the report, including representatives of advocacy organizations, special education directors, teachers, paraprofessionals, intermediate school districts, school boards, day treatment providers, county social services, state human services department staff, mental health professionals, and autism experts. Beginning with the 2016-2017 school year, in a form and manner determined by the commissioner, districts must report data quarterly to the department by January 15, April 15, July 15, and October 15 about individual students who have been secluded. By July 15 each year, districts must report summary data on their use of restrictive procedures to the department for the prior school year, July 1 through June 30, in a form and manner determined by the commissioner. The summary data must include information about the use of restrictive procedures, including use of reasonable force under section 121A.582.\nThe following actions or procedures are prohibited:\n(1) engaging in conduct prohibited under section 121A.58;\n(2) requiring a child to assume and maintain a specified physical position, activity, or posture that induces physical pain;\n(3) totally or partially restricting a child's senses as punishment;\n(4) presenting an intense sound, light, or other sensory stimuli using smell, taste, substance, or spray as punishment;\n(5) denying or restricting a child's access to equipment and devices such as walkers, wheelchairs, hearing aids, and communication boards that facilitate the child's functioning, except when temporarily removing the equipment or device is needed to prevent injury to the child or others or serious damage to the equipment or device, in which case the equipment or device shall be returned to the child as soon as possible;\n(6) interacting with a child in a manner that constitutes sexual abuse, neglect, or physical abuse under chapter 260E;\n(7) withholding regularly scheduled meals or water;\n(8) denying access to bathroom facilities;\n(9) physical holding that restricts or impairs a child's ability to breathe, restricts or impairs a child's ability to communicate distress, places pressure or weight on a child's head, throat, neck, chest, lungs, sternum, diaphragm, back, or abdomen, or results in straddling a child's torso;\n(10) prone restraint; and\n(11) the use of seclusion on children from birth through grade 3 by September 1, 2024.\n(a) To meet the requirements of subdivision 1, staff who use restrictive procedures, including paraprofessionals, shall complete training in the following skills and knowledge areas:\n(1) positive behavioral interventions;\n(2) communicative intent of behaviors;\n(3) relationship building;\n(4) alternatives to restrictive procedures, including techniques to identify events and environmental factors that may escalate behavior;\n(5) de-escalation methods;\n(6) standards for using restrictive procedures only in an emergency;\n(7) obtaining emergency medical assistance;\n(8) the physiological and psychological impact of physical holding and seclusion;\n(9) monitoring and responding to a child's physical signs of distress when physical holding is being used;\n(10) recognizing the symptoms of and interventions that may cause positional asphyxia when physical holding is used;\n(11) district policies and procedures for timely reporting and documenting each incident involving use of a restricted procedure; and\n(12) schoolwide programs on positive behavior strategies.\n(b) The commissioner, after consulting with the commissioner of human services, must develop and maintain a list of training programs that satisfy the requirements of paragraph (a). The commissioner also must develop and maintain a list of experts to help individualized education program or individualized family service plan teams reduce the use of restrictive procedures. The district shall maintain records of staff who have been trained and the organization or professional that conducted the training. The district may collaborate with children's community mental health providers to coordinate trainings.\n(a) School districts are encouraged to establish effective schoolwide systems of positive behavior interventions and supports.\n(b) Nothing in this section or section 125A.0941 precludes the use of reasonable force under sections 121A.582; 609.06, subdivision 1; and 609.379. Any reasonable force used under sections 121A.582; 609.06, subdivision 1; and 609.379 which intends to hold a child immobile or limit a child's movement where body contact is the only source of physical restraint or confines a child alone in a room from which egress is barred shall be reported to the Department of Education as a restrictive procedure, including physical holding or seclusion used by an unauthorized or untrained staff person.\n(c) By February 1, 2024, the commissioner, in cooperation with stakeholders, must make recommendations to the legislature for urgently ending seclusion in Minnesota schools. The commissioner must consult with interested stakeholders, including parents of students who have been secluded or restrained; advocacy organizations; legal services providers; special education directors; teachers; paraprofessionals; intermediate school districts and cooperative units as defined under section 123A.24, subdivision 2; school boards; day treatment providers; county social services; state human services department staff; mental health professionals; autism experts; and representatives of groups disproportionately affected by restrictive procedures, including People of Color and people with disabilities. The recommendations must include specific dates for ending seclusion by grade or facility. The recommendations must identify existing resources and the new resources necessary for staff capacity, staff training, children's supports, child mental health services, and schoolwide collaborative efforts.",
	"repealed": false
}