{
	"id": "429.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/429.101",
	"title": "429.101 UNPAID SPECIAL CHARGES MAY BE SPECIAL ASSESSMENTS.",
	"text": "(a) In addition to any other method authorized by law or charter, the governing body of any municipality may provide for the collection of unpaid special charges as a special assessment against the property benefited for all or any part of the cost of:\n(1) snow, ice, or rubbish removal from sidewalks;\n(2) weed elimination from streets or private property;\n(3) removal or elimination of public health or safety hazards from private property, excluding any structure included under the provisions of sections 463.15 to 463.26;\n(4) installation or repair of water service lines, street sprinkling or other dust treatment of streets;\n(5) the trimming and care of trees and the removal of unsound trees from any street;\n(6) the treatment and removal of insect infested or diseased trees on private property, the repair of sidewalks and alleys;\n(7) the operation of a street lighting system;\n(8) the operation and maintenance of a fire protection or a pedestrian skyway system;\n(9) inspections relating to a municipal housing maintenance code violation;\n(10) the recovery of any disbursements under section 504B.445, subdivision 4, clause (5), including disbursements for payment of utility bills and other services, even if provided by a third party, necessary to remedy violations as described in section 504B.445, subdivision 4, clause (2); or\n(11) MS 2004 [Repealed, 2004 c 275 s 5]\n(12) the recovery of delinquent vacant building registration fees under a municipal program designed to identify and register vacant buildings.\n(b) The council may by ordinance adopt regulations consistent with this section to make this authority effective, including, at the option of the council, provisions for placing primary responsibility upon the property owner or occupant to do the work personally (except in the case of street sprinkling or other dust treatment, alley repair, tree trimming, care, and removal, or the operation of a street lighting system) upon notice before the work is undertaken, and for collection from the property owner or other person served of the charges when due before unpaid charges are made a special assessment.\n(c) A home rule charter city, statutory city, county, or town operating an energy improvements financing program under section 216C.436 or 216C.437 has the authority granted to a municipality under paragraph (a) with respect to energy improvements financed under that section.\nAny special assessment levied under subdivision 1 shall be payable in a single installment, or by up to ten equal annual installments as the council may provide, except that a special assessment made under an energy improvements financing program under subdivision 1, paragraph (c), may be repayable in up to 20 equal installments. With these exceptions, sections 429.061, 429.071, and 429.081 shall apply to assessments made under this section.\n(a) After a contract for any of the work enumerated in subdivision 1 has been let, or the work commenced, the council may issue obligations to defray the expense of any such work financed in whole or in part by special charges and assessments imposed upon benefited property under this section.\n(b) Section 429.091 shall apply to such obligations with the following modifications:\n(1) such obligations shall be payable not more than two years from the date of issuance;\n(2) the amount of such obligations issued at one time in a municipality shall not exceed the cost of such work during the ensuing six months as estimated by the council;\n(3) a separate improvement fund shall be set up for each of the enumerated services referred to in subdivision 1 and financed under this section.\n(c) Proceeds of special charges as well as special assessments and taxes shall be credited to such improvement fund.",
	"repealed": false
}