{
	"id": "245I.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/245I.23",
	"title": "245I.23 INTENSIVE RESIDENTIAL TREATMENT SERVICES AND RESIDENTIAL CRISIS STABILIZATION.",
	"text": "(a) Intensive residential treatment services is a community-based medically monitored level of care for an adult client that uses established rehabilitative principles to promote a client's recovery and to develop and achieve psychiatric stability, personal and emotional adjustment, self-sufficiency, and other skills that help a client transition to a more independent setting.\n(b) Residential crisis stabilization provides structure and support to an adult client in a community living environment when a client has experienced a mental health crisis and needs short-term services to ensure that the client can safely return to the client's home or precrisis living environment with additional services and supports identified in the client's crisis assessment.\n(a) \"Program location\" means a set of rooms that are each physically self-contained and have defining walls extending from floor to ceiling. Program location includes bedrooms, living rooms or lounge areas, bathrooms, and connecting areas.\n(b) \"Treatment team\" means a group of staff persons who provide intensive residential treatment services or residential crisis stabilization to clients. The treatment team includes mental health professionals, mental health practitioners, clinical trainees, certified rehabilitation specialists, mental health rehabilitation workers, and mental health certified peer specialists.\nThe license holder must describe in writing all treatment services that the license holder provides. The license holder must have the description readily available for the commissioner upon the commissioner's request.\n(a) On a daily basis, the license holder must follow a client's treatment plan to provide intensive residential treatment services to the client to improve the client's functioning.\n(b) The license holder must offer and have the capacity to directly provide the following treatment services to each client:\n(1) rehabilitative mental health services;\n(2) crisis prevention planning to assist a client with:\n(i) identifying and addressing patterns in the client's history and experience of the client's mental illness; and\n(ii) developing crisis prevention strategies that include de-escalation strategies that have been effective for the client in the past;\n(3) health services and administering medication;\n(4) co-occurring substance use disorder treatment;\n(5) engaging the client's family and other natural supports in the client's treatment and educating the client's family and other natural supports to strengthen the client's social and family relationships; and\n(6) making referrals for the client to other service providers in the community and supporting the client's transition from intensive residential treatment services to another setting.\n(c) The license holder must include Illness Management and Recovery (IMR), Enhanced Illness Management and Recovery (E-IMR), or other similar interventions in the license holder's programming as approved by the commissioner.\n(a) On a daily basis, the license holder must follow a client's individual crisis treatment plan to provide services to the client in residential crisis stabilization to improve the client's functioning.\n(b) The license holder must offer and have the capacity to directly provide the following treatment services to the client:\n(1) crisis stabilization services as described in section 256B.0624, subdivision 7;\n(2) rehabilitative mental health services;\n(3) health services and administering the client's medications; and\n(4) making referrals for the client to other service providers in the community and supporting the client's transition from residential crisis stabilization to another setting.\n(a) If the license holder offers additional treatment services to a client, the treatment service must be:\n(1) approved by the commissioner; and\n(2)(i) a mental health evidence-based practice that the federal Department of Health and Human Services Substance Abuse and Mental Health Service Administration has adopted;\n(ii) a nationally recognized mental health service that substantial research has validated as effective in helping individuals with serious mental illness achieve treatment goals; or\n(iii) developed under state-sponsored research of publicly funded mental health programs and validated to be effective for individuals, families, and communities.\n(b) Before providing an optional treatment service to a client, the license holder must provide adequate training to a staff person about providing the optional treatment service to a client.\n(a) Within 12 hours of a client's admission, the license holder must evaluate and document the client's immediate needs, including the client's:\n(1) health and safety, including the client's need for crisis assistance;\n(2) responsibilities for children, family and other natural supports, and employers; and\n(3) housing and legal issues.\n(b) Within 24 hours of the client's admission, the license holder must complete an initial treatment plan for the client. The license holder must:\n(1) base the client's initial treatment plan on the client's referral information and an assessment of the client's immediate needs;\n(2) consider crisis assistance strategies that have been effective for the client in the past;\n(3) identify the client's initial treatment goals, measurable treatment objectives, and specific interventions that the license holder will use to help the client engage in treatment;\n(4) identify the participants involved in the client's treatment planning. The client must be a participant; and\n(5) ensure that a treatment supervisor approves of the client's initial treatment plan if a mental health practitioner or clinical trainee completes the client's treatment plan, notwithstanding section 245I.08, subdivision 3.\n(c) According to section 245A.65, subdivision 2, paragraph (b), the license holder must complete an individual abuse prevention plan as part of a client's initial treatment plan.\n(d) Within five days of the client's admission and again within 60 days after the client's admission, the license holder must complete a level of care assessment of the client. If the license holder determines that a client does not need a medically monitored level of service, a treatment supervisor must document how the client's admission to and continued services in intensive residential treatment services are medically necessary for the client.\n(e) Within ten days of a client's admission, the license holder must complete or review and update the client's standard diagnostic assessment.\n(f) Within ten days of a client's admission, the license holder must complete the client's individual treatment plan, notwithstanding section 245I.10, subdivision 8. Within 40 days after the client's admission and again within 70 days after the client's admission, the license holder must update the client's individual treatment plan. The license holder must focus the client's treatment planning on preparing the client for a successful transition from intensive residential treatment services to another setting. In addition to the required elements of an individual treatment plan under section 245I.10, subdivision 8, the license holder must identify the following information in the client's individual treatment plan: (1) the client's referrals and resources for the client's health and safety; and (2) the staff persons who are responsible for following up with the client's referrals and resources. If the client does not receive a referral or resource that the client needs, the license holder must document the reason that the license holder did not make the referral or did not connect the client to a particular resource. The license holder is responsible for determining whether additional follow-up is required on behalf of the client.\n(g) Within 30 days of the client's admission, the license holder must complete a functional assessment of the client. Within 60 days after the client's admission, the license holder must update the client's functional assessment to include any changes in the client's functioning and symptoms.\n(h) For a client with a current substance use disorder diagnosis and for a client whose substance use disorder screening in the client's standard diagnostic assessment indicates the possibility that the client has a substance use disorder, the license holder must complete a written assessment of the client's substance use within 30 days of the client's admission. In the substance use assessment, the license holder must: (1) evaluate the client's history of substance use, relapses, and hospitalizations related to substance use; (2) assess the effects of the client's substance use on the client's relationships including with family member and others; (3) identify financial problems, health issues, housing instability, and unemployment; (4) assess the client's legal problems, past and pending incarceration, violence, and victimization; and (5) evaluate the client's suicide attempts, noncompliance with taking prescribed medications, and noncompliance with psychosocial treatment.\n(i) On a weekly basis, a mental health professional or certified rehabilitation specialist must review each client's treatment plan and individual abuse prevention plan. The license holder must document in the client's file each weekly review of the client's treatment plan and individual abuse prevention plan.\n(a) Within 12 hours of a client's admission, the license holder must evaluate the client and document the client's immediate needs, including the client's:\n(1) health and safety, including the client's need for crisis assistance;\n(2) responsibilities for children, family and other natural supports, and employers; and\n(3) housing and legal issues.\n(b) Within 24 hours of a client's admission, the license holder must complete a crisis treatment plan for the client under section 256B.0624, subdivision 11. The license holder must base the client's crisis treatment plan on the client's referral information and an assessment of the client's immediate needs.\n(c) Section 245A.65, subdivision 2, paragraph (b), requires the license holder to complete an individual abuse prevention plan for a client as part of the client's crisis treatment plan.\n(a) The license holder must have a staff person assigned to each of the following key staff positions at all times:\n(1) a program director who qualifies as a mental health practitioner. The license holder must designate the program director as responsible for all aspects of the operation of the program and the program's compliance with all applicable requirements. The program director must know and understand the implications of this chapter; chapters 245A, 245C, and 260E; sections 626.557 and 626.5572; Minnesota Rules, chapter 9544; and all other applicable requirements. The license holder must document in the program director's personnel file how the program director demonstrates knowledge of these requirements. The program director may also serve as the treatment director of the program, if qualified;\n(2) a treatment director who qualifies as a mental health professional. The treatment director must be responsible for overseeing treatment services for clients and the treatment supervision of all staff persons; and\n(3) a registered nurse who qualifies as a mental health practitioner. The registered nurse must:\n(i) work at the program location a minimum of eight hours per week;\n(ii) provide monitoring and supervision of staff persons as defined in section 148.171, subdivisions 8a and 23;\n(iii) be responsible for the review and approval of health service and medication policies and procedures under section 245I.03, subdivision 5; and\n(iv) oversee the license holder's provision of health services to clients, medication storage, and medication administration to clients.\n(b) Within five business days of a change in a key staff position, the license holder must notify the commissioner of the staffing change. The license holder must notify the commissioner of the staffing change on a form approved by the commissioner and include the name of the staff person now assigned to the key staff position and the staff person's qualifications.\n(a) The license holder must maintain a treatment team staffing level sufficient to:\n(1) provide continuous daily coverage of all shifts;\n(2) follow each client's treatment plan and meet each client's needs as identified in the client's treatment plan;\n(3) implement program requirements; and\n(4) safely monitor and guide the activities of each client, taking into account the client's level of behavioral and psychiatric stability, cultural needs, and vulnerabilities.\n(b) The license holder must ensure that treatment team members:\n(1) remain awake during all work hours; and\n(2) are available to monitor and guide the activities of each client whenever clients are present in the program.\n(c) On each shift, the license holder must maintain a treatment team staffing ratio of at least one treatment team member to nine clients. If the license holder is serving nine or fewer clients, at least one treatment team member on the day shift must be a mental health professional, clinical trainee, certified rehabilitation specialist, or mental health practitioner. If the license holder is serving more than nine clients, at least one of the treatment team members working during both the day and evening shifts must be a mental health professional, clinical trainee, certified rehabilitation specialist, or mental health practitioner.\n(d) If the license holder provides residential crisis stabilization to clients and is serving at least one client in residential crisis stabilization and more than four clients in residential crisis stabilization and intensive residential treatment services, the license holder must maintain a treatment team staffing ratio on each shift of at least two treatment team members during the client's first 48 hours in residential crisis stabilization.\nA license holder must ensure that treatment team members working on different shifts exchange information about a client as necessary to effectively care for the client and to follow and update a client's treatment plan and individual abuse prevention plan.\n(a) For each day that a client is present in the program, the license holder must provide a daily summary in the client's file that includes observations about the client's behavior and symptoms, including any critical incidents in which the client was involved.\n(b) For each day that a client is not present in the program, the license holder must document the reason for a client's absence in the client's file.\nTreatment team members must have access in person or by telephone to a mental health professional, clinical trainee, certified rehabilitation specialist, or mental health practitioner within 30 minutes. The license holder must maintain a schedule of mental health professionals, clinical trainees, certified rehabilitation specialists, or mental health practitioners who will be available and contact information to reach them. The license holder must keep the schedule current and make the schedule readily available to treatment team members.\n(a) The license holder must hold weekly team meetings and ancillary meetings according to this subdivision.\n(b) A mental health professional or certified rehabilitation specialist must hold at least one team meeting each calendar week. The mental health professional or certified rehabilitation specialist must lead and be physically present at the team meeting, except as permitted under paragraph (e). All treatment team members, including treatment team members who work on a part-time or intermittent basis, must participate in a minimum of one team meeting during each calendar week when the treatment team member is working for the license holder. The license holder must document all weekly team meetings, including the names of meeting attendees, and indicate whether the meeting was conducted remotely under paragraph (e).\n(c) If a treatment team member cannot participate in a weekly team meeting, the treatment team member must participate in an ancillary meeting. A mental health professional, certified rehabilitation specialist, clinical trainee, or mental health practitioner who participated in the most recent weekly team meeting may lead the ancillary meeting. During the ancillary meeting, the treatment team member leading the ancillary meeting must review the information that was shared at the most recent weekly team meeting, including revisions to client treatment plans and other information that the treatment supervisors exchanged with treatment team members. The license holder must document all ancillary meetings, including the names of meeting attendees.\n(d) If a treatment team member working only one shift during a week cannot participate in a weekly team meeting or participate in an ancillary meeting, the treatment team member must read the minutes of the weekly team meeting required to be documented in paragraph (b). The treatment team member must sign to acknowledge receipt of this information, and document pertinent information or questions. The mental health professional or certified rehabilitation specialist must review any documented questions or pertinent information before the next weekly team meeting.\n(e) A license holder may permit a mental health professional or certified rehabilitation specialist to lead the weekly meeting remotely due to medical or weather conditions. If the conditions that do not permit physical presence persist for longer than one week, the license holder must request a variance to conduct additional meetings remotely.\n(a) An eligible client for intensive residential treatment services is an individual who:\n(1) is age 18 or older;\n(2) is diagnosed with a mental illness;\n(3) because of a mental illness, has a substantial disability and functional impairment in three or more areas listed in section 245I.10, subdivision 9, clause (4), that markedly reduce the individual's self-sufficiency;\n(4) has one or more of the following: a history of recurring or prolonged inpatient hospitalizations during the past year, significant independent living instability, homelessness, or very frequent use of mental health and related services with poor outcomes for the individual; and\n(5) in the written opinion of a mental health professional, needs mental health services that available community-based services cannot provide, or is likely to experience a mental health crisis or require a more restrictive setting if the individual does not receive intensive rehabilitative mental health services.\n(b) The license holder must not limit or restrict intensive residential treatment services to a client based solely on:\n(1) the client's substance use;\n(2) the county in which the client resides; or\n(3) whether the client elects to receive other services for which the client may be eligible, including case management services.\n(c) This subdivision does not prohibit the license holder from restricting admissions of individuals who present an imminent risk of harm or danger to themselves or others.\nAn eligible client for residential crisis stabilization is an individual who is age 18 or older and meets the eligibility criteria in section 256B.0624, subdivision 3.\n(a) The license holder must identify the information that the license holder needs to make a determination about a person's admission referral.\n(b) The license holder must:\n(1) always be available to receive referral information about a person seeking admission to the license holder's program;\n(2) respond to the referral source within eight hours of receiving a referral and, within eight hours, communicate with the referral source about what information the license holder needs to make a determination concerning the person's admission;\n(3) consider the license holder's staffing ratio and the areas of treatment team members' competency when determining whether the license holder is able to meet the needs of a person seeking admission; and\n(4) determine whether to admit a person within 72 hours of receiving all necessary information from the referral source.\n(a) When a license holder discharges a client from a program, the license holder must categorize the discharge as a successful discharge, program-initiated discharge, or non-program-initiated discharge according to the criteria in this subdivision. The license holder must meet the standards associated with the type of discharge according to this subdivision.\n(b) To successfully discharge a client from a program, the license holder must ensure that the following criteria are met:\n(1) the client must substantially meet the client's documented treatment plan goals and objectives;\n(2) the client must complete discharge planning with the treatment team; and\n(3) the client and treatment team must arrange for the client to receive continuing care at a less intensive level of care after discharge.\n(c) Prior to successfully discharging a client from a program, the license holder must complete the client's discharge summary and provide the client with a copy of the client's discharge summary in plain language that includes:\n(1) a brief review of the client's problems and strengths during the period that the license holder provided services to the client;\n(2) the client's response to the client's treatment plan;\n(3) the goals and objectives that the license holder recommends that the client addresses during the first three months following the client's discharge from the program;\n(4) the recommended actions, supports, and services that will assist the client with a successful transition from the program to another setting;\n(5) the client's crisis plan; and\n(6) the client's forwarding address and telephone number.\n(d) For a non-program-initiated discharge of a client from a program, the following criteria must be met:\n(1)(i) the client has withdrawn the client's consent for treatment; (ii) the license holder has determined that the client has the capacity to make an informed decision; and (iii) the client does not meet the criteria for an emergency hold under section 253B.051, subdivision 2;\n(2) the client has left the program against staff person advice;\n(3) an entity with legal authority to remove the client has decided to remove the client from the program; or\n(4) a source of payment for the services is no longer available.\n(e) Within ten days of a non-program-initiated discharge of a client from a program, the license holder must complete the client's discharge summary in plain language that includes:\n(1) the reasons for the client's discharge;\n(2) a description of attempts by staff persons to enable the client to continue treatment or to consent to treatment; and\n(3) recommended actions, supports, and services that will assist the client with a successful transition from the program to another setting.\n(f) For a program-initiated discharge of a client from a program, the following criteria must be met:\n(1) the client is competent but has not participated in treatment or has not followed the program rules and regulations and the client has not participated to such a degree that the program's level of care is ineffective or unsafe for the client, despite multiple, documented attempts that the license holder has made to address the client's lack of participation in treatment;\n(2) the client has not made progress toward the client's treatment goals and objectives despite the license holder's persistent efforts to engage the client in treatment, and the license holder has no reasonable expectation that the client will make progress at the program's level of care nor does the client require the program's level of care to maintain the current level of functioning;\n(3) a court order or the client's legal status requires the client to participate in the program but the client has left the program against staff person advice; or\n(4) the client meets criteria for a more intensive level of care and a more intensive level of care is available to the client.\n(g) Prior to a program-initiated discharge of a client from a program, the license holder must consult the client, the client's family and other natural supports, and the client's case manager, if applicable, to review the issues involved in the program's decision to discharge the client from the program. During the discharge review process, which must not exceed five working days, the license holder must determine whether the license holder, treatment team, and any interested persons can develop additional strategies to resolve the issues leading to the client's discharge and to permit the client to have an opportunity to continue receiving services from the license holder. The license holder may temporarily remove a client from the program facility during the five-day discharge review period. The license holder must document the client's discharge review in the client's file.\n(h) Prior to a program-initiated discharge of a client from the program, the license holder must complete the client's discharge summary and provide the client with a copy of the discharge summary in plain language that includes:\n(1) the reasons for the client's discharge;\n(2) the alternatives to discharge that the license holder considered or attempted to implement;\n(3) the names of each individual who is involved in the decision to discharge the client and a description of each individual's involvement; and\n(4) recommended actions, supports, and services that will assist the client with a successful transition from the program to another setting.\n(a) The license holder must be licensed or certified as a board and lodging facility, supervised living facility, or a boarding care home by the Department of Health.\n(b) The license holder must have a capacity of five to 16 beds and the program must not be declared as an institution for mental disease.\n(c) The license holder must furnish each program location to meet the psychological, emotional, and developmental needs of clients.\n(d) The license holder must provide one living room or lounge area per program location. There must be space available to provide services according to each client's treatment plan, such as an area for learning recreation time skills and areas for learning independent living skills, such as laundering clothes and preparing meals.\n(e) The license holder must ensure that each program location allows each client to have privacy. Each client must have privacy during assessment interviews and counseling sessions. Each client must have a space designated for the client to see outside visitors at the program facility.\n(a) A license holder that prohibits clients from leaving the facility by locking exit doors or other permissible methods must meet the additional requirements of this subdivision.\n(b) The license holder must meet all applicable building and fire codes to operate a building with locked exit doors. The license holder must have the appropriate license from the Department of Health, as determined by the Department of Health, for operating a program with locked exit doors.\n(c) For each client present in the facility under a court order, the license holder must maintain documentation of the court order for treatment authorizing the license holder to prohibit the client from leaving the facility.\n(d) Upon a client's admission to a locked program facility, the license holder must document in the client file that the client was informed:\n(1) that the client has the right to leave the facility according to the client's rights under section 144.651, subdivision 21, and that leaving the facility against medical advice may result in legal consequences; and\n(2) that the client may not be able to leave the facility as required under chapter 253B.\n(e) If a client is prohibited from leaving the facility under chapter 253B, the client's treatment plan must reflect this restriction.\nIf the license holder offers services to individuals who are not receiving intensive residential treatment services or residential stabilization at the program location, the license holder must inform the commissioner and submit a plan for approval to the commissioner about how and when the license holder will provide services. The license holder must only provide services to clients who are not receiving intensive residential treatment services or residential crisis stabilization in an area that is physically separated from the area in which the license holder provides clients with intensive residential treatment services or residential crisis stabilization.\nA license holder must obtain approval from the commissioner prior to providing intensive residential treatment services or residential crisis stabilization to clients in more than one program location under one license and dividing one staff person's time between program locations during the same work period.\n(a) In addition to the policies and procedures in section 245I.03, the license holder must establish, enforce, and maintain the policies and procedures in this subdivision.\n(b) The license holder must have policies and procedures for receiving referrals and making admissions determinations about referred persons under subdivisions 15 to 17.\n(c) The license holder must have policies and procedures for discharging clients under subdivision 18. In the policies and procedures, the license holder must identify the staff persons who are authorized to discharge clients from the program.\n(a) A license holder must develop a written quality assurance and improvement plan that includes a plan to:\n(1) encourage ongoing consultation between members of the treatment team;\n(2) obtain and evaluate feedback about services from clients, family and other natural supports, referral sources, and staff persons;\n(3) measure and evaluate client outcomes in the program;\n(4) review critical incidents in the program;\n(5) examine the quality of clinical services in the program; and\n(6) self-monitor the license holder's compliance with this chapter.\n(b) At least annually, the license holder must review, evaluate, and update the license holder's quality assurance and improvement plan. The license holder's review must:\n(1) document the actions that the license holder will take in response to the information that the license holder obtains from the monitoring activities in the plan; and\n(2) establish goals for improving the license holder's services to clients during the next year.\nWhen an applicant requests licensure to provide intensive residential treatment services, residential crisis stabilization, or both to clients, the applicant must submit, on forms that the commissioner provides, any documents that the commissioner requires.",
	"repealed": false
}