{
	"id": "273.1398",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.1398",
	"title": "273.1398 DISPARITY REDUCTION AID AND CREDIT.",
	"text": "(a) In this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Unique taxing jurisdiction\" means the geographic area subject to the same set of local tax rates.\n(c) For purposes of calculating and allocating disparity reduction aid authorized in subdivision 3, \"gross taxes levied on all properties,\" \"gross taxes,\" or \"taxes levied\" means the total net tax capacity based taxes levied on all properties except that levied on the captured value of tax increment districts as defined in section 469.177, subdivision 2, and that levied on the portion of commercial industrial properties' assessed value or gross tax capacity, as defined in section 473F.02, subdivision 3, subject to the areawide tax as provided in section 473F.08, subdivision 6, in a unique taxing jurisdiction. \"Gross taxes\" are before any reduction for disparity reduction aid but \"taxes levied\" are after any reduction for disparity reduction aid. Gross taxes levied or taxes levied cannot be less than zero.\nMS 2002 [Repealed, 2004 c 228 art 3 s 18]\nMS 2002 [Repealed, 1Sp2003 c 21 art 6 s 17]\nMS 1993 Supp [Repealed, 1994 c 416 art 1 s 65]\nMS 1990 [Repealed, 1990 c 604 art 4 s 21]\nMS 2002 [Repealed, 1Sp2003 c 21 art 6 s 17]\nFor aid amounts authorized under subdivision 3: (i) if the effective date for a municipal incorporation, consolidation, annexation, detachment, dissolution, or township organization is on or before June 30 of the year preceding the aid distribution year, the change in boundaries or form of government shall be recognized for aid determinations for the aid distribution year; (ii) if the effective date for a municipal incorporation, consolidation, annexation, detachment, dissolution, or township organization is after June 30 of the year preceding the aid distribution year, the change in boundaries or form of government shall not be recognized for aid determinations until the following year.\nMS 2002 [Repealed, 2004 c 228 art 3 s 18]\nThe amount of disparity aid certified for each taxing district within each unique taxing jurisdiction is the amount certified for taxes payable in the prior year.\nNotwithstanding the provisions of subdivision 3 or section 275.08, subdivision 1d, the amount of disparity reduction aid for a city for aid payable in calendar year 1994 and thereafter is zero, and the local tax rate for taxes payable in 1994 and thereafter for a city shall not be adjusted under section 275.08, subdivision 1d. For purposes of this subdivision, city means a statutory or home rule charter city.\n(a) Class 4a and class 3a property qualifies for a disparity reduction credit if the property is located in a border city that is eligible to have an enterprise zone, as defined in section 469.166.\n(b) The credit is an amount sufficient to reduce (i) the taxes levied on class 4a property to 1.6 percent of the property's taxable market value and (ii) the tax on class 3a property to 1.6 percent of taxable market value.\n(c) The county auditor shall annually certify the costs of the credits to the Department of Revenue. The department shall reimburse local governments for the property taxes forgone as the result of the credits in proportion to their total levies.\nMS 2006 [Repealed, 2007 c 13 art 2 s 11]\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\nMS 2006 [Repealed, 2007 c 13 art 2 s 11]\nMS 2002 [Repealed, 1Sp2003 c 21 art 6 s 17]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1992 [Repealed, 1Sp1993 c 1 art 2 s 7]\nMS 1994 [Repealed, 1996 c 471 art 3 s 55]\nMS 1992 [Repealed, 1Sp1993 c 1 art 2 s 7]\nThe commissioner shall certify the aids provided in subdivision 3 before September 1 of the year preceding the distribution year to the county auditor of the affected local government. The aids provided in subdivision 3, must be paid to local governments other than school districts at the times provided in section 477A.015 for payment of local government aid to taxing jurisdictions, except that the first one-half payment of disparity reduction aid provided in subdivision 3 must be paid on or before August 31. The disparity reduction credit provided in subdivision 4 must be paid to taxing jurisdictions other than school districts at the time provided in section 473H.10, subdivision 3. Aids and credit reimbursements to school districts must be certified to the commissioner of education and paid under section 273.1392. Payment shall not be made to any taxing jurisdiction that has ceased to levy a property tax.\nMS 1995 Supp [Repealed, 1994 c 587 art 3 s 21 para (b)]\nAn amount sufficient to pay the aids and credits provided under this section for school districts, intermediate school districts, or any group of school districts levying as a single taxing entity, is annually appropriated from the general fund to the commissioner of education. An amount sufficient to pay the aids and credits provided under this section for counties, cities, towns, and special taxing districts is annually appropriated from the general fund to the commissioner of revenue. A jurisdiction's aid amount may be increased or decreased based on any prior year adjustments for property tax credit or aid programs.",
	"repealed": false
}