{
	"id": "529.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/529.02",
	"title": "529.02 CUSTODIAL TRUST; GENERAL.",
	"text": "(a) A person may create a custodial trust of property by a written transfer of the property to another person, evidenced by registration or by other instrument of transfer, executed in any lawful manner, naming as beneficiary, an individual who may be the transferor, in which the transferee is designated, in substance, as custodial trustee under the Minnesota Uniform Custodial Trust Act.\n(b) A person may create a custodial trust of property by a written declaration, evidenced by registration of the property or by other instrument of declaration executed in any lawful manner, describing the property and naming as beneficiary an individual other than the declarant, in which the declarant as title holder is designated, in substance, as custodial trustee under the Minnesota Uniform Custodial Trust Act. A registration or other declaration of trust for the sole benefit of the declarant is not a custodial trust under sections 529.01 to 529.19.\n(c) Title to custodial trust property is in the custodial trustee and the beneficial interest is in the beneficiary.\n(d) Except as provided in subsection (e), a transferor may not terminate a custodial trust.\n(e) The beneficiary, if not incapacitated, or the holder of the beneficiary's power of attorney, may terminate a custodial trust by delivering to the custodial trustee a writing signed by the beneficiary or holder of the beneficiary's power of attorney declaring the termination. If not previously terminated, the custodial trust terminates on the death of the beneficiary.\n(f) Any person may augment existing custodial trust property by the addition of other property pursuant to sections 529.01 to 529.19.\n(g) The transferor may designate, or authorize the designation of, a successor custodial trustee in the trust instrument.\n(h) Sections 529.01 to 529.19 do not displace or restrict other means of creating trusts. A trust whose terms do not conform to sections 529.01 to 529.19 may be enforceable according to its terms under other law.",
	"repealed": false
}