{
	"id": "239.752",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.752",
	"title": "239.752 STORAGE TANK MARKING AND CAPACITY; RETAIL LOCATION.",
	"text": "A person responsible for the product shall securely affix a metal or plastic identification tag or tank collar on the fill pipe of a petroleum product storage tank at a business where petroleum products are sold, offered for sale, or dispensed at retail into the storage tanks of motor vehicles. A bulk storage facility operator shall securely affix a metal or plastic identification tag on the fill pipe of each storage tank at the distributor's bulk storage facility. The identification tag must be constructed and printed according to subdivision 2 and installed according to subdivision 3. The identification tag must be printed with the appropriate product identification according to subdivision 4, 5, or 6, and include the gallon capacity for each storage tank. This section does not apply to storage tanks at petroleum refineries or terminals.\nThe identification tag required in subdivision 1 must be at least 3-1/2 inches by 3-1/2 inches and constructed from aluminum, stainless steel, or plastic. All surfaces of the tag or tank collar must be coated with a permanent enamel paint or powder coating. The coating must be light blue for gasoline, white for alcohol products, and dark green for petroleum distillate products. Lettering must be at least three-eighths of one inch high, and printed on the tag with permanent enamel paint or powder coating. Lettering must be black for gasoline and alcohol products and white for petroleum distillate products.\nThe identification tag required in subdivision 1 must be securely affixed to a fill pipe by means of an adjustable steel band clamp or nonreleasable nylon ties. The display surface of the tag must be positioned so that the product information can be easily read by a person filling the storage tank.\n(a) An identification tag or tank collar placed on a storage tank containing gasoline or oxygenated gasoline must be marked with the word \"GASOLINE\" and with the correct octane number and the appropriate product name of the fuel stored in the tank.\n(b) The product name must be selected from the following:\n(1) \"REGULAR\" for oxygenated gasoline of less than 88 octane;\n(2) \"MID-GRADE\" for oxygenated gasoline of at least 88 octane, but less than 91 octane;\n(3) \"PREMIUM\" for oxygenated gasoline of at least 91 octane;\n(4) \"NON-OXY PREM\" for nonoxygenated gasoline of at least 91 octane;\n(5) \"AVIATION\" for gasoline used solely as a fuel for aircraft;\n(6) \"RACING\" for a special racing gasoline intended to be sold for use in off-road motor vehicles; or\n(7) \"SPECIAL\" for gasoline blended with mineral oil or other additives and intended to be sold for use in boats, chainsaws, snowmobiles, or off-road equipment.\n(a) An identification tag or tank collar placed on a storage tank containing unblended alcohol or a predominantly alcohol-based motor fuel must be marked with the word \"ALCOHOL\" and with the appropriate product name of the fuel stored in the tank.\n(b) The product name must be selected from the following:\n(1) \"ETHANOL\" for denatured ethanol, as defined in section 296A.01;\n(2) \"METHANOL\" for methanol;\n(3) \"E85\" for an ethanol-gasoline blend, as defined in section 296A.01; or\n(4) \"M85\" for a methanol-gasoline blend, as defined in section 296A.01.\nStorage tanks containing diesel fuel, heating fuel, kerosene, or other petroleum distillate must be marked with the word \"DISTILLATE\" and with the correct product grade and appropriate tax status selected from the following:\n(1) \"#1 DIESEL\" \"UNDYED\" for #1 diesel fuel for which the motor fuel excise tax has been paid;\n(2) \"#1\" \"DYED\" for #1 heating fuel or #1 diesel fuel intended to be sold for use in off-road vehicles and equipment;\n(3) \"#2 DIESEL\" \"UNDYED\" for #2 diesel fuel for which the motor fuel excise tax has been paid;\n(4) \"#2\" \"DYED\" for #2 heating fuel or #2 diesel fuel intended to be sold for use in off-road vehicles and equipment;\n(5) \"DIESEL\" \"PREMIUM\" \"UNDYED\" for premium diesel fuel for which the motor fuel excise tax has been paid;\n(6) \"DIESEL\" \"PREMIUM\" \"DYED\" for premium diesel fuel intended to be sold off-road;\n(7) \"DIESEL\" B-xx for diesel fuel containing more than the amount mandated in Minnesota;\n(8) \"BIODIESEL\" for fuel containing more than 99 percent biodiesel;\n(9) \"KEROSENE\" \"UNDYED\" for kerosene for which the federal motor fuel excise tax has been paid;\n(10) \"KEROSENE\" \"DYED\" for kerosene intended to be sold for use in off-road vehicles, heating equipment, and other off-road equipment; or\n(11) \"JET/TURBINE\" for jet fuel or turbine fuel.",
	"repealed": false
}