{
	"id": "144E.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.11",
	"title": "144E.11 AMBULANCE SERVICE APPLICATION PROCEDURE.",
	"text": "Each prospective licensee and each present licensee wishing to offer a new type or types of ambulance service or to expand a primary service area shall make written application for a license to the director on a form provided by the director.\nThe director shall promptly send notice of the completed application to each county board, community health board, governing body of a regional emergency medical services system designated under section 144E.50, ambulance service, and municipality in the area in which ambulance service would be provided by the applicant. The director shall publish the notice, at the applicant's expense, in the State Register and in a newspaper in the municipality in which the base of operation is or will be located, or if no newspaper is published in the municipality or if the service is or would be provided in more than one municipality, in a newspaper published at the county seat of the county or counties in which the service would be provided.\nEach municipality, county, community health board, governing body of a regional emergency medical services system, ambulance service, and other person wishing to make recommendations concerning the disposition of the application shall make written recommendations or comments opposing the application to the director within 30 days of the publication of notice of the application in the State Register.\n(a) If no more than five written comments opposing the application have been received by the director under subdivision 3, and the director has determined, after considering the factors listed under subdivision 6, that the proposed service or expansion of primary service area is needed, the applicant shall be exempt from the contested case hearing process under subdivision 5.\n(b) An applicant exempted from a contested case hearing under this subdivision shall furnish additional information, as requested by the director, to support its application. The director shall approve the application and grant a license to the applicant within 30 days after final submission of requested information to the director, and upon a determination by the director that the applicant is in compliance with the rules adopted by the director and with the inspection requirements of section 144E.18.\n(c) If an applicant does not comply with the inspection requirements under section 144E.18 within one year of the director's approval of its application, the license shall be denied. The one-year time limit applies to any licensing decision made by the director or to any prior licensing decision made by the commissioner of health or an administrative law judge.\n(d) If, after considering the factors under subdivision 6, the director determines that the proposed service or expansion of primary service area is not needed, the case shall be treated as a contested case under subdivision 5, paragraphs (c) to (g).\n(a) If more than five written comments opposing the application are received by the director as specified under subdivision 3, the director shall give the applicant the option of immediately proceeding to a contested case hearing or trying to resolve the objections within 30 days.\n(b) If, after considering the factors under subdivision 6, the director determines that the proposed service or expansion of primary service area is not needed, the director shall give the applicant the option of immediately proceeding to a contested case hearing or using up to 30 days to satisfy the director that the proposed service or expansion of primary service area is needed.\n(c) The director shall request that the chief administrative law judge appoint an administrative law judge to hold a public hearing in the municipality in which the applicant's base of operation is or will be located:\n(1) if more than five opposing comments remain after 30 days;\n(2) if, after considering the factors under subdivision 6, the director determines that the proposed service or expansion of primary service area is not needed after 30 days; or\n(3) at the applicant's initial request.\n(d) If the applicant's base of operation is located outside of Minnesota, the hearing shall be held at a location within the area in which service would be provided in Minnesota. The public hearing shall be conducted as a contested case hearing under chapter 14. The director shall pay the expenses for the hearing location and the administrative law judge.\n(e) The director shall provide notice of the public hearing, at the applicant's expense, in the State Register and in the newspaper or newspapers in which the notice was published under subdivision 2 for two successive weeks at least ten days before the date of the hearing.\n(f) The administrative law judge shall:\n(1) hold a public hearing as specified in paragraphs (c) and (d);\n(2) allow any interested person the opportunity to be heard, to be represented by counsel, and to present oral and written evidence at the public hearing; and\n(3) provide a transcript of the hearing at the expense of any individual requesting it.\n(g) The administrative law judge shall review and comment upon the application and make written recommendations as to its disposition to the director within 90 days of publication of notice of the hearing in the State Register. In making the recommendations, the administrative law judge shall consider and make written comments as to whether the proposed service or expansion in primary service area is needed, based on consideration of the factors specified in subdivision 6.\nWhen reviewing an application for licensure, the director and administrative law judge shall consider the following factors:\n(1) the recommendations or comments of the governing bodies of the counties, municipalities, community health boards, and regional emergency medical services system designated under section 144E.50 in which the service would be provided;\n(2) the deleterious effects on the public health from duplication, if any, of ambulance services that would result from granting the license;\n(3) the estimated effect of the proposed service or expansion in primary service area on the public health; and\n(4) whether any benefit accruing to the public health would outweigh the costs associated with the proposed service or expansion in primary service area. The administrative law judge shall recommend that the director either grant or deny a license or recommend that a modified license be granted. The reasons for the recommendation shall be set forth in detail. The administrative law judge shall make the recommendations and reasons available to any individual requesting them.\nAfter receiving the administrative law judge's report, the director shall approve or deny the application and grant the license within 60 days if the application is approved, and upon determination by the director, that the applicant is in compliance with the rules adopted by the director and with the inspection requirements of section 144E.18. In approving or denying an application, the director shall consider the administrative law judge's report, the evidence contained in the application, and any hearing record and other applicable evidence. The director's decision shall be based on a consideration of the factors contained in subdivision 6. If the director determines to grant the applicant a license, the applicant must comply with the inspection requirements under 144E.18 within one year of the director's approval of the application or the license will be denied. This one-year time limit applies to any licensing decision by the director or to any prior licensing decision made by the commissioner of health or an administrative law judge.\nThe director's decision made under subdivision 7 shall be the final administrative decision. Any person aggrieved by the director's decision or action shall be entitled to judicial review in the manner provided in sections 14.63 to 14.69.\nAn ambulance service license expires two years from the date of licensure. An ambulance service must apply to the director for license renewal at least one month prior to the expiration date of the license and must submit:\n(1) an application prescribed by the director specifying any changes from the information provided for prior licensure and any other information requested by the director to clarify incomplete or ambiguous information presented in the application; and\n(2) the appropriate fee as required under section 144E.29.",
	"repealed": false
}