{
	"id": "326B.091",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.091",
	"title": "326B.091 DEFINITIONS.",
	"text": "For purposes of sections 326B.091 to 326B.099, the terms defined in this section have the meanings given them.\n\"Applicant\" means a person who has submitted to the department an application for an initial or renewal license.\n\"Appropriate and related knowledge\" means facts, information, or principles that are clearly relevant to the licensee's responsibilities under a license issued by the commissioner. These facts, information, or principles must convey substantive and procedural knowledge as it relates to postlicensing issues and must be relevant to the technical aspects of a regulated industry.\n\"Classroom hour\" means 50 minutes of educational content.\n\"Instructor\" means an individual lecturing in an approved educational offering.\n\"License\" means any registration, certification, or other form of approval authorized by this chapter 326B and chapter 327B to be issued by the commissioner or department as a condition of doing business or conducting a trade, profession, or occupation in Minnesota. License includes specifically but not exclusively an authorization issued by the commissioner or department: to perform electrical work, plumbing or water conditioning work, high pressure piping work, or residential building work of a residential contractor, residential remodeler, or residential roofer; to install manufactured housing; to serve as a building official; or to operate a boiler or boat.\n\"Licensee\" means the person named on the license as the person authorized to do business or conduct the trade, profession, or occupation in Minnesota.\n\"Medical hardship\" means a documented physical disability or medical condition.\n\"Notification date\" means the date of the written notification from the department to an applicant that the applicant is qualified to take the examination required for licensure.\n\"Overpayment\" means any payment of money in excess of a statutory fee.\n\"Qualifying individual\" means the individual responsible for obtaining continuing education on behalf of a residential building contractor, residential remodeler, or residential roofer licensed pursuant to sections 326B.801 to 326B.885.\n\"Regulated industry\" means any business, trade, profession, or occupation that requires a license issued under this chapter or chapter 327B as a condition of doing business in Minnesota.\n[Repealed, 2015 c 54 art 5 s 16]\n\"Sponsor\" means any person or entity offering or providing approved continuing education.",
	"repealed": false
}