{
	"id": "145A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.08",
	"title": "145A.08 ASSESSMENT OF COSTS; TAX LEVY AUTHORIZED.",
	"text": "A person who has or whose dependent or spouse has a communicable disease that is subject to control by the community health board is financially liable to the unit or agency of government that paid for the reasonable cost of care provided to control the disease under section 145A.04, subdivision 6.\n(a) If costs are assessed for enforcement of section 145A.04, subdivision 8, and no procedure for the assessment of costs has been specified in an agreement established under section 145A.07, the enforcement costs must be assessed as prescribed in this subdivision.\n(b) A debt or claim against an individual owner or single piece of real property resulting from an enforcement action authorized by section 145A.04, subdivision 8, must not exceed the cost of abatement or removal.\n(c) The cost of an enforcement action under section 145A.04, subdivision 8, may be assessed and charged against the real property on which the public health nuisance, source of filth, or cause of sickness was located. The auditor of the county in which the action is taken shall extend the cost so assessed and charged on the tax roll of the county against the real property on which the enforcement action was taken.\n(d) The cost of an enforcement action taken by a town or city under section 145A.04, subdivision 8, may be recovered from the county in which the town or city is located if the city clerk or other officer certifies the costs of the enforcement action to the county auditor as prescribed in this section. Taxes equal to the full amount of the enforcement action but not exceeding the limit in paragraph (b) must be collected by the county treasurer and paid to the city or town as other taxes are collected and paid.\nA city council or county board that has formed or is a member of a community health board may levy taxes on all taxable property in its jurisdiction to pay the cost of performing its duties under this chapter.",
	"repealed": false
}