{
	"id": "116J.395",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.395",
	"title": "116J.395 BORDER-TO-BORDER BROADBAND DEVELOPMENT GRANT PROGRAM.",
	"text": "A grant program is established under the Department of Employment and Economic Development to award grants to eligible applicants in order to promote the expansion of access to broadband service in unserved or underserved areas of the state.\nGrants may be awarded under this section to fund the acquisition and installation of middle-mile and last-mile infrastructure that support broadband service scalable to speeds of at least 100 megabits per second download and 100 megabits per second upload.\nEligible applicants for grants awarded under this section include:\n(1) an incorporated business or a partnership;\n(2) a political subdivision;\n(3) an Indian tribe;\n(4) a Minnesota nonprofit organization organized under chapter 317A;\n(5) a Minnesota cooperative association organized under chapter 308A, 308B, or 308C; or\n(6) a Minnesota limited liability corporation organized under chapter 322C, to expand broadband access.\n[See Note.]\n(a) An eligible applicant must submit an application to the commissioner on a form prescribed by the commissioner. The commissioner shall develop administrative procedures governing the application and grant award process. The commissioner shall act as fiscal agent for the grant program and shall be responsible for receiving and reviewing grant applications and awarding grants under this section.\n(b) At least 30 days prior to the first day applications may be submitted each fiscal year, the commissioner must publish on the department's website the specific criteria and any quantitative weighting scheme or scoring system the commissioner will use to evaluate or rank applications and award grants under subdivision 6.\nAn applicant for a grant under this section shall provide the following information on the application:\n(1) the location of the project;\n(2) the kind and amount of broadband infrastructure to be purchased for the project;\n(3) evidence regarding the unserved or underserved nature of the community in which the project is to be located;\n(4) the number of households passed that will have access to broadband service as a result of the project, or whose broadband service will be upgraded as a result of the project;\n(5) significant community institutions that will benefit from the proposed project;\n(6) evidence of community support for the project;\n(7) the total cost of the project;\n(8) sources of funding or in-kind contributions for the project that will supplement any grant award;\n(9) evidence that no later than six weeks before submission of the application the applicant contacted, in writing, all entities providing broadband service in the proposed project area to ask for each broadband service provider's plan to upgrade broadband service in the project area to speeds that meet or exceed the state's broadband speed goals in section 237.012, subdivision 1, within the time frame specified in the proposed grant activities;\n(10) the broadband service providers' written responses to the inquiry made under clause (9); and\n(11) any additional information requested by the commissioner.\n(a) Within three days of the close of the grant application process, the office shall publish on its website the proposed geographic broadband service area and the proposed broadband service speeds for each application submitted.\n(b) An existing broadband service provider in or proximate to the proposed project area may, within 30 days of publication of the information under paragraph (a), submit in writing to the commissioner a challenge to an application. A challenge must contain information demonstrating that:\n(1) the provider currently provides or has begun construction to provide broadband service to the proposed project area at speeds equal to or greater than the state speed goal contained in section 237.012, subdivision 1; or\n(2) the provider commits to complete construction of broadband infrastructure and provide broadband service in the proposed project area at speeds equal to or greater than the state speed goal contained in section 237.012, subdivision 1, no later than 18 months after the date grant awards are made under this section for the grant cycle under which the application was submitted.\n(c) The commissioner must evaluate the information submitted in a provider's challenge under this section, and is prohibited from funding a project if the commissioner determines that the provider's commitment to provide broadband service that meets the requirements of paragraph (b) in the proposed project area is credible.\n(d) If the commissioner denies funding to an applicant as a result of a broadband service provider's challenge made under this section, and the broadband service provider does not fulfill the provider's commitment to provide broadband service in the project area, the commissioner is prohibited from denying funding to an applicant as a result of a challenge by the same broadband service provider for the following two grant cycles, unless the commissioner determines that the broadband service provider's failure to fulfill the provider's commitment was the result of factors beyond the broadband service provider's control.\n(a) In evaluating applications and awarding grants, the commissioner shall give priority to applications that are constructed in areas identified by the director of the Office of Broadband Development as unserved.\n(b) In evaluating applications and awarding grants, the commissioner may give priority to applications that:\n(1) are constructed in areas identified by the director of the Office of Broadband Development as underserved;\n(2) offer new or substantially upgraded broadband service to important community institutions including, but not limited to, libraries, educational institutions, public safety facilities, and healthcare facilities;\n(3) facilitate the use of telehealth and electronic health records;\n(4) serve economically distressed areas of the state, as measured by indices of unemployment, poverty, or population loss that are significantly greater than the statewide average;\n(5) provide technical support and train residents, businesses, and institutions in the community served by the project to utilize broadband service;\n(6) include a component to actively promote the adoption of the newly available broadband services in the community;\n(7) provide evidence of strong support for the project from citizens, government, businesses, and institutions in the community;\n(8) provide access to broadband service to a greater number of unserved or underserved households and businesses;\n(9) leverage greater amounts of funding for the project from other private and public sources; or\n(10) commit to implementation of workforce best practices, meaning all laborers and mechanics performing construction, installation, remodeling, or repairs on the project sites for which the grant is provided:\n(i) are paid the prevailing wage rate as defined in section 177.42, subdivision 6, and the applicant and all of its construction contractors and subcontractors agree that the payment of prevailing wage to such laborers and mechanics is subject to the requirements and enforcement provisions under sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45, which the commissioner of labor and industry shall have the authority to enforce; or\n(ii) receive from the employer:\n(A) at least 40 hours of hands-on skills training annually;\n(B) employer-paid family health insurance coverage; and\n(C) employer-paid retirement benefit payments equal to no less than 15 percent of the employee's total taxable wages.\n(c) The commissioner shall endeavor to award grants under this section to qualified applicants in all regions of the state.\n(d) The commissioner shall endeavor to award no less than 50 percent of grant awards from general fund appropriations for the border-to-border broadband grant program under section 116J.396 for applicants that agree to implement the workforce best practices in this section. The applicant's agreement to implement the workforce best practices described in paragraph (b) must be an express condition of providing the grant in the grant agreement.\n[See Note.]\n(a) No grant awarded under this section may fund more than 50 percent of the total cost of a project.\n(b) Grants awarded to a single project under this section must not exceed $10,000,000.\nBy June 30 of each year, the Office of Broadband Development shall publish on the Department of Employment and Economic Development's website and provide to the chairs and ranking minority members of the senate and house of representatives committees with primary jurisdiction over broadband a list of all applications for grants under this section received during the previous year and, for each application:\n(1) the results of any quantitative weighting scheme or scoring system the commissioner used to award grants or rank the applications;\n(2) the grant amount requested; and\n(3) the grant amount awarded, if any.\n(a) Grantees that serve more than 10,000 broadband customers and are receiving funding for projects under this section are required to provide in annual reports information on the workforce performing installation work funded through the grant, including:\n(1) the number of installation labor hours performed by workforce directly employed by the grantee or the Internet service provider;\n(2) the number of installation labor hours performed by contractors and subcontractors on grant-funded projects with subtotals for hours worked by Minnesota residents, people of color, Indigenous people, women, and people with disabilities;\n(3) the name, business address, and number of labor hours performed by each contractor and subcontractor that participated in construction of a grant-funded project;\n(4) the percentages of workforce performing installation labor whose straight-time hourly pay rate was at least $25 and who received employer-paid medical coverage and retirement benefits; and\n(5) any other workforce plan information as determined by the commissioner.\n(b) Following an award, the workforce plan and the requirement to submit ongoing workforce reports shall be incorporated as material conditions of the contract with the department and become enforceable, certified commitments.\n[See Note.]\nIf successful applicants fail to meet the program requirements under this section, or otherwise falsify information regarding such requirements, the commissioner shall investigate the failure and issue an appropriate action, up to and including a determination that the applicant is ineligible for future participation in broadband grant programs funded by the department.\n[See Note.]",
	"repealed": false
}