{
	"id": "609.893",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.893",
	"title": "609.893 TELECOMMUNICATIONS AND INFORMATION SERVICES FRAUD; CRIME DEFINED.",
	"text": "A person commits telecommunications and information services fraud and may be sentenced as provided in subdivision 3 if the person, with intent to evade a lawful charge, obtains telecommunications service for the person's own use by any fraudulent means.\nA person commits a felony and may be sentenced as provided in subdivision 4 who:\n(1) makes available to another, or offers or advertises to make available, a telecommunications device or information in order to facilitate violation of subdivision 1 by another; or\n(2) makes, assembles, or possesses a telecommunications device that is designed or adapted to violate subdivision 1 or to conceal from a provider of telecommunications service or from a lawful authority, the existence or place of origin or destination of telecommunications service.\n(a) Whoever commits telecommunications and information services fraud in violation of subdivision 1 may be sentenced as follows:\n(1) to imprisonment for not more than ten years or to payment of a fine of not more than $20,000, or both, if the value of the services is in excess of $2,500;\n(2) to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both, if the value of the services is more than $500 but not more than $2,500; or\n(3) in all other cases, to imprisonment for not more than 90 days or to payment of a fine of not more than $1,000, or both.\n(b) Amounts involved in a violation of paragraph (a) under one scheme or course of conduct, whether from the same credit card number or several credit card numbers, may be aggregated in determining the classification of the offense.\nWhoever violates subdivision 2 is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.",
	"repealed": false
}