{
	"id": "302A.641",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.641",
	"title": "302A.641 EFFECTIVE DATE OR TIME OF MERGER OR EXCHANGE; EFFECT.",
	"text": "A merger or exchange is effective when the articles of merger or exchange are filed with the secretary of state or on a later date or at a later time specified in the articles of merger or exchange.\nWhen a merger becomes effective:\n(a) the constituent organizations become a single entity, the surviving corporation or surviving limited liability company, as the case may be;\n(b) the separate existence of all constituent organizations except the surviving organization ceases;\n(c) if the surviving organization is a corporation, the surviving corporation has all the rights, privileges, immunities, and powers, and is subject to all the duties and liabilities, of a corporation incorporated under this chapter;\n(d) the surviving organization, whether a corporation, foreign corporation, or domestic or foreign limited liability company, possesses all the rights, privileges, immunities, and franchises, of a public as well as of a private nature, of each of the constituent organizations. All property, real, personal, and mixed, and all debts due on any account, including subscriptions to shares, and all other choses in action, and every other interest of or belonging to or due to each of the constituent organizations vests in the surviving organization without any further act or deed. Confirmatory deeds, assignments, or similar instruments to accomplish that vesting may be signed and delivered at any time in the name of a constituent organization by its current officers or managers, as the case may be, or, if the organization no longer exists, by its last officers or managers, as the case may be. The title to any real, personal, or mixed property or any interest in real, personal, or mixed property vested in any of the constituent organizations does not revert nor in any way become impaired by reason of the merger;\n(e) the surviving organization is responsible and liable for all the liabilities and obligations of each of the constituent organizations. A claim of or against or a pending proceeding by or against a constituent organization may be prosecuted as if the merger had not taken place, or the surviving organization may be substituted in the place of the constituent organization. Neither the rights of creditors nor any liens upon the property of a constituent organization are impaired by the merger; and\n(f) the articles of the surviving organization are deemed to be amended to the extent that changes in its articles, if any, are contained in the plan of merger.\nWhen a merger or exchange becomes effective, the shares of the corporation or corporations to be converted or exchanged under the terms of the plan cease to exist in the case of a merger, or are deemed to be exchanged in the case of an exchange. The holders of those shares are entitled only to the securities, money, or other property into which those shares have been converted or for which those shares have been exchanged in accordance with the plan, subject to any dissenter's rights under section 302A.471.",
	"repealed": false
}