{
	"id": "176.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.231",
	"title": "176.231 REPORT OF DEATH OR INJURY TO COMMISSIONER OF DEPARTMENT OF LABOR AND INDUSTRY.",
	"text": "(a) Where death or serious injury occurs to an employee during the course of employment, the employer shall report the injury or death to the commissioner and insurer within 48 hours after its occurrence. Where any other injury occurs which wholly or partly incapacitates the employee from performing labor or service for more than three calendar days, the employer shall report the injury to the insurer on a form prescribed by the commissioner within ten days from its occurrence.\n(b) An insurer and self-insured employer shall report the injury to the commissioner no later than 14 days from its occurrence. If an injury has not previously been required to be reported, the insurer or self-insured employer must report the injury to the commissioner, in the manner and format prescribed by the commissioner, no later than 14 days after the date that:\n(1) any document initiating a dispute is filed under this chapter;\n(2) a rehabilitation consultation report or a rehabilitation plan is filed under this chapter; or\n(3) permanent partial disability is ascertainable under section 176.101, subdivision 2a.\n(c) Where an injury has once been reported but subsequently death ensues, the employer shall report the death to the commissioner and insurer within 48 hours after the employer receives notice of this fact.\n(d) An employer who provides notice to the Occupational Safety and Health Division of the Department of Labor and Industry of a fatality within the eight-hour time frame required by law, or of an inpatient hospitalization, amputation, or loss of an eye, within the 24-hour time frame required by law, has satisfied the employer's obligation under paragraph (a).\n(e) At the time an injury is required to be reported under paragraph (b), the insurer or self-insured employer must also specify whether the injury is covered by a collective bargaining agreement approved by the commissioner under section 176.1812. Notice must be provided in the format and manner prescribed by the commissioner.\n(a) Where subdivision 1 requires an injury to be reported within 48 hours, the employer may make an initial report to the commissioner by telephone or personal notice, and must report the injury to the insurer within seven days from its occurrence. After receiving this notice, the insurer or self-insured employer must report the injury to the commissioner as provided in subdivision 1. All reports of injury required by subdivision 1 or this subdivision shall include the date of injury. The reports shall be made in the manner and format designated by the commissioner, with one copy to the insurer, and one copy to the employee. The employer must give the employee the \"Minnesota Workers' Compensation System Employee Information Sheet\" at the time the employee is given a copy of the first report of injury. Within two business days after a report of injury filed by a self-insured employer or insurer is accepted by the commissioner, the self-insured employer or insurer must serve the report on the employee in the manner and format prescribed by the commissioner.\n(b) If an insurer or self-insured employer repeatedly fails to pay benefits within three days of the due date, pursuant to section 176.221, the insurer or self-insured employer shall be ordered by the commissioner to explain, in person, the failure to pay benefits due in a reasonable time. If prompt payments are not thereafter made, the commissioner shall refer the insurer or self-insured employer to the commissioner of commerce for action pursuant to section 176.225, subdivision 4.\nA physician, chiropractor, or other health care provider who has examined, treated, or has special knowledge of an injury to an employee which may be compensable under this chapter, shall report to the commissioner all facts relating to the nature and extent of the injury and disability, and the treatment provided for the injury or disability, within ten days after the health care provider has received a written request for the information from the commissioner or an authorized representative of the commissioner.\nThe commissioner or an authorized representative may require the filing of supplementary reports of accidents as is deemed necessary to provide information required by law.\nSupplementary reports or other documents related to the current nature and extent of the employee's injury, disability, or treatment may be requested from a physician, surgeon, chiropractor, or other health care provider by the commissioner or a representative, an employer or insurer, or the employee.\n(a) The commissioner shall prescribe the manner and format for providing the reports and other documents required by this section.\n(b) A report or other document that is required to be filed with the commissioner under this section must be filed electronically in the manner and format required by the commissioner. Except as provided in paragraph (d), the commissioner must give at least 60 days' notice to self-insured employers and insurers, and publish notice in the State Register, of the effective date of required electronic filing of the report or other document.\n(c) Where specified by the commissioner under paragraph (d), a self-insured employer or insurer must file a report or other document with the commissioner electronically according to the version of the Claims Release Standard published by the International Association of Industrial Accident Boards and Commissions (IAIABC) adopted by the commissioner. The commissioner must publish on the department's website a Minnesota implementation guide that prescribes reporting and service requirements consistent with this chapter.\n(d) The commissioner must give notice to self-insured employers and insurers, and publish notice in the State Register, of intent to adopt a version of the Claims Release Standard for a report or other document required to be filed with the commissioner. The notice must include a link to the Minnesota implementation guide. Interested parties must have at least 90 days to submit comments to the commissioner. After considering the comments, the commissioner must publish notice of the adopted version of the Claims Release Standard and Minnesota implementation guide in the State Register at least 90 days before the effective date of the Standard and Guide. The commissioner must also give at least 30 days' notice to self-insured employers and insurers, and publish notice in the State Register, of any updates to the Minnesota implementation guide. The requirements in the adopted versions of the Claims Release Standard and the Minnesota implementation guide supersede any conflicting or obsolete rule. The commissioner may amend or repeal conflicting or obsolete rules, using the procedures in section 14.388 or 14.3895. The adopted versions of the Claims Release Standards and Minnesota implementation guides adopted by the commissioner under this section are not rules under chapter 14, but have the force and effect of law as of the effective date specified in the notice published in the State Register. The commissioner may publish the initial notices in this subdivision before August 31, 2020, to ensure the adopted versions of the Standard and Guide are effective on that date.\n(a) The commissioner of labor and industry shall keep fully informed of the nature and extent of all injuries compensable under this chapter, their resultant disabilities, and of the rights of employees to compensation. In addition to other data required to be filed or reported under this chapter, the insurer or self-insured employer must report to the department any payments of compensation and attorney fees; the amounts of payments made; and any amounts withheld from compensation paid, whether paid voluntarily or by order of a compensation judge, the workers' compensation court of appeals, or the Minnesota Supreme Court. The reports must be made within 14 days of the following events: the date of the first payment, a denial of primary liability, a denial of any part of compensation, a change in the compensation amount or type, commencement of an additional compensation type, reinstatement of compensation after previous discontinuance, or final payment of compensation. Additional reporting requirements are as provided in paragraphs (b) to (g).\n(b) Starting 180 days after the date of injury and every six months thereafter, the self-insured employer or insurer shall report to the commissioner all compensation paid to an employee, any amounts withheld from compensation paid, and any amounts paid for attorney fees.\n(c) A report of permanent partial disability benefits commenced or paid must include a copy of (1) the medical report supporting the permanent partial disability benefit paid; and (2) the form prescribed by the commissioner that was served on the employee showing the permanent partial disability benefit that was or will be paid.\n(d) A final report must be filed to show that the self-insured employer or insurer has ceased payment of all indemnity and rehabilitation benefits where no litigation is pending. The report must be filed within 180 days of the cessation.\n(e) A self-insured employer or insurer must report a change in the number of dependents receiving benefits within 14 days of the change.\n(f) A self-insured employer or insurer must report when a claim is acquired from another self-insured employer or insurer, and whether benefits are currently being paid. A third-party administrator must report when it begins administering a claim and whether benefits are currently being paid. The reports under this paragraph must be filed within 30 days of the acquisition, or a change in the third-party administrator.\n(g) The reports required under this section must be filed electronically according to the requirements of subdivision 5 in the form and manner required by the commissioner. The reports must be served on or provided to the employee as follows:\n(1) If service is required under this chapter, the self-insured employer or insurer must serve the report on the employee or dependents within the time limits required, and must retain a proof of service as required by section 176.285, subdivision 3.\n(2) If the report is not required to be served under this chapter, the self-insured employer or insurer must, no later than two business days of acceptance of the report by the commissioner, send the report to the employee by first class United States mail or another method agreed to by the employee, and specify on the report the date it was sent.\n(3) A report served or provided to the employee under this chapter must contain the information designated by the commissioner in the format required by the commissioner, according to the requirements specified under subdivision 5.\nIf requested by the division, a compensation judge, the Workers' Compensation Court of Appeals, or any member or employee thereof an employer, insurer, or employee shall file with the commissioner a copy suitable for imaging of any medical report or other document in possession which bears upon the case and shall also file a copy of the same report or document with the agency or individual who made the request.\nSubject to subdivision 9, a report or other document, or its copy, which has been filed with the commissioner of the Department of Labor and Industry under this section is not available to public inspection. Any person who has access to such a report shall not disclose its contents to anyone in any manner.\nA person who unauthorizedly discloses a report or its contents to another is guilty of a misdemeanor.\n(a) Reports and other documents in the division file are private data on individuals and nonpublic data as those terms are defined in section 13.02, except that the reports and documents in the division file may be used in hearings held under this chapter, and for the purpose of state investigations and for statistics. The reports and documents in the division file are also available without authorization to:\n(1) the Department of Revenue for use in enforcing Minnesota income tax and property tax refund laws, and the information shall be protected as provided in chapter 270B;\n(2) an agency, as needed to perform its responsibilities under this chapter;\n(3) the Workers' Compensation Reinsurance Association for use by the association in carrying out its responsibilities under chapter 79;\n(4) the special compensation fund for the purpose of auditing assessments under section 176.129; and\n(5) the persons and entities allowed access under subdivisions 9a, 9b, and 9c.\n(b) A person with an authorization signed by the employer, insurer, or employee, as described in paragraph (c), has access to reports and other documents in the division file as provided in the authorization. An authorization must:\n(1) be in writing;\n(2) include the printed name and dated signature of the employee, employer, or insurer representative who is authorizing the documents to be released;\n(3) specify the employer, date of injury, and worker identification or Social Security number;\n(4) include the name of the individual or entity that is authorized to receive the documents. If the authorization is signed by the employer or insurer, the authorization must specify that the access is granted to a person acting on the employer's or insurer's behalf in performing responsibilities under chapter 176;\n(5) specify the time period within which the authorization is valid, which may not exceed one year from the date the authorization was signed, except that access to the division file may exceed one year if provided in subdivision 9a, paragraph (c); and\n(6) include a statement that the person signing the authorization may revoke the authorization by filing written notice with the department at any time, which shall be effective upon receipt by the department.\n(c) For purposes of authorization to access the division file under this subdivision and access to the division file under subdivision 9a, an \"employee\" includes an employee's guardian under section 176.092; a dependent of a deceased employee under section 176.111; a representative of the decedent under section 13.10; or legal heir of a deceased employee's estate; if a court order or other legal documentation is submitted that establishes the person's legal status as a guardian, dependent, representative, or legal heir.\n(a) Access to the division file established for a specific claimed date or dates of injury under this chapter is allowed without an authorization from the employee, employer, or insurer, as described in clauses (1) to (7):\n(1) an employee, as described in subdivision 9, paragraph (c), has access to the division file established for the employee's claimed date or dates of injury;\n(2) an employer and insurer have access to the division file for a workers' compensation claim to which the employer and insurer are parties;\n(3) the Department of Administration under section 13.43, subdivision 18, the assigned risk plan under chapter 79, the special compensation fund established under section 176.129, the self-insurers security fund under chapter 79A, and the Minnesota insurance guaranty association under chapter 60C have access to all of the documents in the division file for a claim to which they are a party or are otherwise providing, paying, or reimbursing workers' compensation benefits under this chapter;\n(4) a person who has filed a motion to intervene in a pending dispute at an agency has access to the documents in the division file that are filed in connection with the dispute in which the person has filed a motion to intervene;\n(5) a registered rehabilitation provider assigned to provide rehabilitation services to an employee has access to the documents in the division file that are filed in connection with the employee's vocational rehabilitation or a dispute about vocational rehabilitation under section 176.102;\n(6) a third-party administrator licensed under section 60A.23, subdivision 8, has access to the division file for a claim it has contracted to administer on behalf of any of the entities listed in this subdivision; and\n(7) the program administrator for a collective bargaining agreement approved by the commissioner under section 176.1812 has access to the division file for a claim that is covered by the agreement.\n(b) An attorney who has filed with the commissioner in CAMPUS a notice of representation of a person or entity listed in paragraph (a) has the same access to documents in the division file that the represented person or entity has, unless the attorney specifies when filing the notice that access should be limited. If the attorney represents an employee as described in subdivision 9, paragraph (c), one of the following documents signed by the employee must be attached to the notice: a written authorization, a retainer agreement, or a document initiating or responding to a workers' compensation dispute filed under this chapter.\n(c) If the attorney's access is not limited by an authorization, notice of representation, or the represented person or entity's access under paragraph (a), the attorney's access continues until one of the following occurs, whichever is later:\n(1) one year after an authorization is filed;\n(2) three years after the date a retainer agreement or notice of representation was filed where no dispute has been initiated; or\n(3) five years after the date a retainer agreement or notice of representation was filed where a dispute has been initiated by filing a document specified in section 176.2611, subdivision 4.\nNotwithstanding the time frames in clauses (1) to (3), an attorney no longer has access to the division file as of the date the attorney files a notice of withdrawal from the case, or the date the department receives written notice that the authorization is withdrawn or that the attorney no longer represents the person. However, if a dispute over an attorney's fees is pending at the office, the attorney has continued access to the division file until a final order or award on stipulation resolving the attorney fee dispute is received by the commissioner.\n(d) The division may provide the worker identification number assigned under section 176.275, subdivision 1, without a signed authorization required under paragraph (b) to an:\n(1) attorney who represents one of the persons described in paragraph (b);\n(2) attorney who represents an intervenor or potential intervenor under section 176.361;\n(3) intervenor; or\n(4) employee's assigned qualified rehabilitation consultant under section 176.102.\n(e) If the department receives information that indicates that identifying or contact information for an employee, dependent, employer, insurer, or third-party administrator for an employer or insurer is erroneous or no longer accurate, the department may update the information in all relevant workers' compensation files to reflect:\n(1) the current and accurate name, address, Social Security number or worker identification number, and contact information for an employee, unless the employee notifies the commissioner in writing that the information in a workers' compensation file for a specific date of injury may not be updated; and\n(2) the current and accurate name, address, and contact information for an employer, insurer, or third-party administrator for an employer or insurer.\nAn agency shall, without the need for an authorization, have full, read-only, real-time, electronic access to view all documents, document contents, dispositions, outcomes, and other data related to a workers' compensation dispute at one of the other agencies, except for the following:\n(1) paper, images, or electronic data created, used or maintained for internal operational purposes by an agency, the special compensation fund, or the vocational rehabilitation unit;\n(2) a confidential mediation statement, including any documents submitted with the statement for the mediator's review and any additional documents submitted to or sent by the mediator in furtherance of mediation efforts; and\n(3) the work product of a compensation judge, a Workers' Compensation Court of Appeals judge, a mediator at the office or department, or the commissioner that is not issued or sent to a party to a claim. Examples of work product include personal notes of hearings or conferences and draft decisions or orders.\nThis subdivision is not intended to allow interagency access to non-dispute-related paper, images, or electronic data created, used or maintained solely for an agency's internal operational purposes.\nEach agency's responsible authority as defined in section 13.02 is responsible for its own employees' use and dissemination of the data and documents in CAMPUS and the office's case management system as required by section 13.05, subdivision 5.\n(a) For purposes of this subdivision, the terms in this paragraph have the meanings given.\n(1) \"Enforcement action\" means a proceeding initiated by the department, commissioner, medical services review board under section 176.103, or rehabilitation review panel under section 176.102, that may result in a penalty, fine, or sanction for violation of workers' compensation laws or that may result in an order for compliance with workers' compensation laws.\n(2) \"Investigation\" includes an investigation, inspection, audit, file review, inquiry, or examination performed by the department or commissioner to administer, enforce, and monitor compliance with workers' compensation laws within the department's jurisdiction.\n(3) \"Final order\" or \"final penalty assessment,\" means that:\n(i) no objection, appeal, or request for hearing has been filed in the manner and within the time required by law;\n(ii) an objection, appeal, or request for hearing has been withdrawn;\n(iii) a settlement agreement or stipulation resolving all or part of the matter has been signed by all parties and, if required by law, has been approved by a judge; or\n(iv) all appeals have been exhausted or waived.\n(b) A claim-specific final order or final penalty assessment issued by the department or commissioner pursuant to a workers' compensation investigation or enforcement proceeding shall be placed in the division file for that employee's claim. Access to the final enforcement order or penalty assessment in the division file shall be as provided in subdivision 9a. Before the enforcement order or penalty assessment is final, only the employee, dependent of a deceased employee, employer, or insurer who are parties to the claim, and any respective attorney representing the party, shall have access to it.\n(c) Enforcement orders and penalty assessments issued by the department, commissioner, medical services review board, or rehabilitation review panel pursuant to workers' compensation investigations or enforcement proceedings that are not claim-specific shall not be placed in the division file. The data practices classification of these orders and penalties is as provided in sections 13.39 and 13.41, except that the names, Social Security numbers, and worker identification numbers of employees with workers' compensation claims and their dependents, and the identity of persons filing a complaint with the department about the subject of the investigation or enforcement action, are private or nonpublic data as those terms are defined in section 13.02 when maintained by a government entity.\nIf an employer, qualified rehabilitation consultant or rehabilitation vendor, insurer, physician, chiropractor, or other health provider fails to file with the commissioner any report or other document required by this chapter in the manner and within the time limitations prescribed, or otherwise fails to provide a report or other document required by this chapter in the manner provided by this chapter, the commissioner may impose a penalty of up to $500 for each failure.\nThe imposition of a penalty may be appealed to a compensation judge within 30 days of notice of the penalty.\nPenalties collected by the state under this subdivision shall be payable to the commissioner for deposit into the assigned risk safety account.\nWhere this section requires the employer to file a report of injury with the commissioner, and the employer is unable or refuses to file the report, the insurer shall file the report within ten days of a request from the division. The report shall be filed in the manner prescribed by this section. If both the employer and the insurer fail to file the report within 30 days of notice of the injury, the commissioner shall file the report.\nThe filing of a report of injury by the commissioner does not subject an employee or the dependents of an employee to the three-year time limitations under section 176.151, paragraphs (a) and (b).\nA substitute filing under this subdivision shall not be a defense to a penalty assessed under subdivision 10.\nBeginning July 1, 1995, the commissioner shall monitor electronically all reports of injury, all payments for reported injuries, and compliance with all reporting and payment timelines.",
	"repealed": false
}