{
	"id": "543.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/543.20",
	"title": "543.20 PERSONAL JURISDICTION IN SUPPORT ENFORCEMENT CASES AND PATERNITY SUITS.",
	"text": "In addition to the methods of service of process provided in the Rules of Civil Procedure, service of a summons, an order to show cause, or an order or judgment within this state may also be made upon an individual by delivering a copy to the individual personally at the individual's place of employment or at a postsecondary education institution in which the individual is enrolled. The employer shall make the individual available for the purpose of delivering a copy. The postsecondary education institution must make the individual's class schedule available to the process server or make the individual available for the purpose of delivering a copy. No employer or postsecondary education institution shall deny a process server admittance to the employer's or postsecondary education institution's premises for the purpose of making service under this section.\nNo service shall be allowed under this section unless such service is made personally on the individual.\nService of an employee at a place of employment or of a student at a postsecondary education institution applies only to: (a) a summons in an action for dissolution, annulment, legal separation, or under the Parentage Act and under section 518A.82; (b) orders to show cause under both section 518A.82 and the revised uniform Reciprocal Enforcement of Support Act as well as for contempt of court for failure to pay child support; (c) petitions under the Domestic Abuse Act; and (d) motions, orders, and judgments for the payment of child support when the court orders personal service.\nAn employer shall not discharge or otherwise discipline an employee, nor shall a postsecondary education institution dismiss or discipline a student as a result of service under this section.\nFor purposes of this section \"postsecondary education institution\" means any state university, community college, technical college, private college, private postsecondary school, or the University of Minnesota.",
	"repealed": false
}