{
	"id": "352.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/352.03",
	"title": "352.03 BOARD OF DIRECTORS; EXECUTIVE DIRECTOR.",
	"text": "(a) The policy-making function of the system is vested in a board of 11 members known as the board of directors. This board shall consist of:\n(1) three members appointed by the governor, one of whom must be a constitutional officer or appointed state official and two of whom must be public members knowledgeable in pension matters;\n(2) four state employees elected by active and inactive vested members of the general state employees retirement plan and members with an account balance in the unclassified employees retirement program, excluding employees and inactive vested members for whom a board member is designated under clause (3);\n(3) one employee of the Metropolitan Council's transit operations or its successor agency designated by the executive committee of the labor organization that is the exclusive bargaining agent representing employees of the transit division;\n(4) one employee who is a member of the State Patrol retirement plan elected by active and inactive vested members of that plan;\n(5) one employee who is a member of the correctional state employees retirement plan established under this chapter elected by active and inactive vested members of that plan; and\n(6) one retired employee of a plan included in the system, elected by disabled and retired employees of the plans administered by the system at a time and in a manner determined by the board.\n(b) The terms of the four elected state employees under paragraph (a), clause (2), must be staggered, with two of the state employee board positions elected each biennium, whose terms of office begin on the first Monday in May after their election. Elected members and the appointed member of the Metropolitan Council's transit operations hold office for a term of four years and until their successors are elected or appointed, and have qualified.\n(c) An employee or former employee of the system is not eligible for membership on the board of directors. A state employee on leave of absence is not eligible for election or reelection to membership on the board of directors.\n(d) The term of any board member who is on leave for more than six months automatically ends on expiration of the term of office.\nThe membership terms, compensation, removal of members, and filling of vacancies for the public members on the board are as provided in section 15.0575.\n(a) Active members and inactive vested members of a plan under this chapter, chapter 352B, or chapter 352D are eligible to vote in board elections as further specified and restricted in this section.\n(b) Retired members and disabilitants from a plan in the system may vote only for the retired member position under subdivision 1, paragraph (a), clause (6).\n(c) If an inactive vested member of a plan under this chapter, chapter 352B, or chapter 352D is an inactive vested member of more than one plan covered by the system, that person is eligible to vote only in elections applicable for inactive vested members of the plan in the system from which the person last received allowable service.\n(d) If a person is an active member of a plan in the system and is an inactive vested member or a retiree from another plan or plans in the system, the person is only eligible to vote in board elections applicable due to the active member plan membership.\n(e) If a person is an inactive vested member from a plan in the system and is also a retiree from another plan in the system, the person is only eligible to vote in elections applicable due to the retiree status.\nAny vacancy of a state employee or retired employee in the board caused by death, resignation, or removal of any member so elected must be filled by the board for the unexpired portion of the term in which the vacancy occurs. Any vacancy of the employee of the transit operating division member of the board caused by death, resignation, or removal must be filled by the governing board of the labor organization that is the exclusive bargaining agent representing employees of the Transit Operating Division.\n[Repealed, 1976 c 134 s 79]\n(a) The board shall:\n(1) elect a chair;\n(2) appoint an executive director;\n(3) establish rules to administer this chapter and chapters 3A, 352B, 352C, 352D, and 490 and transact the business of the system, subject to the limitations of law;\n(4) consider and dispose of, or take any other action the board of directors deems appropriate concerning, denials of applications for annuities or disability benefits under this chapter, chapter 3A, 352B, 352C, 352D, or 490, and complaints of employees and others pertaining to the retirement of employees and the operation of the system;\n(5) oversee the administration of the deferred compensation plan established in section 352.965;\n(6) oversee the administration of the health care savings plan established in section 352.98; and\n(7) approve early retirement and optional annuity factors for all plans administered by the system, including approving retirement annuity factors for the unclassified state employees program under chapter 352D, subject to review by the actuary retained by the Legislative Commission on Pensions and Retirement; establish the schedule for implementation of the approved factors; and notify the Legislative Commission on Pensions and Retirement of the implementation schedule.\n(b) The board shall advise the director on any matters relating to the system and carrying out functions and purposes of this chapter. The board's advice shall control.\nThe board may consider, review, and make recommendations regarding the financial and other needs of retired employees and may disseminate appropriate retirement information to the retired employee. Notwithstanding laws to the contrary, the board, at its discretion, may supply the names and addresses of retirees who were employed by the University of Minnesota at the time of termination to the University of Minnesota and state agencies for retirees who were employed by the specific state agency at the time of termination. The board, at its discretion, may supply names and addresses of state and university retirees to an organization that has been in existence for at least ten years and represents over 5,000 retired state and university employees. The names and addresses of each retiree can only be given to this organization once within 60 days of the effective date of the annuity. The board shall require the retiree organization, University of Minnesota, or applicable state agency to reimburse the fund for any administrative expense of providing the list. The list remains the property of the Minnesota State Retirement System and may not be subsequently sold, conveyed, given, or otherwise transferred by the retiree organization, the University of Minnesota, or the state agency to a third party. Periodically, retirees must be given an opportunity to specify that their name and address not be distributed under this section.\n(a) The board shall appoint an executive director, in this chapter called the director, on the basis of education, experience in the retirement field, ability to manage and lead system staff, and ability to assist the board in setting a vision for the system. The director must have had at least five years' experience in either an executive level management position or in a position with responsibility for the governance, management, or administration of a retirement plan.\n(b) The executive director, deputy director, and assistant director must be in the unclassified service but appointees may be selected from civil service lists if desired. Notwithstanding any law to the contrary, the board must set the salary of the executive director. The board must review the performance of the executive director on an annual basis and may grant salary adjustments as a result of the review. The salary of the deputy director and assistant director must be set in accordance with section 43A.18, subdivision 3.\nThe management of the system is vested in the director, who is the executive and administrative head of the system. The director may appoint a deputy director and an assistant director with the approval of the board. The director shall be advisor to the board on matters pertaining to the system and shall also act as the secretary of the board. The director shall:\n(1) attend meetings of the board;\n(2) prepare and recommend to the board appropriate rules to carry out this chapter;\n(3) establish and maintain an adequate system of records and accounts following recognized accounting principles and controls;\n(4) appoint any employees, both permanent and temporary, that are necessary to carry out the provisions of this chapter;\n(5) organize the work of the system as the director deems necessary to fulfill the functions of the system, and define the duties of its employees and delegate to them any powers or duties, subject to the control of the director and under conditions the director may prescribe. Appointments to exercise delegated power must be by written order and shall be filed with the secretary of state;\n(6) with the advice and consent of the board, contract for the services of an approved actuary, professional management services, and any other consulting services as necessary and fix the compensation for those services. The contracts are not subject to competitive bidding under chapter 16C. Any approved actuary retained by the executive director shall function as the actuarial advisor of the board and the executive director, and may perform actuarial valuations and experience studies to supplement those performed by the actuary retained under section 356.214. Any supplemental actuarial valuations or experience studies shall be filed with the executive director of the Legislative Commission on Pensions and Retirement. Professional management services may not be contracted for more often than once in six years. Copies of professional management survey reports must be transmitted to the secretary of the senate, the chief clerk of the house of representatives, and the Legislative Reference Library as provided by section 3.195, and to the executive director of the commission at the time as reports are furnished to the board. Only management firms experienced in conducting management surveys of federal, state, or local public retirement systems are qualified to contract with the director;\n(7) with the advice and consent of the board provide in-service training for the employees of the system;\n(8) make refunds of accumulated contributions to former state employees and to the designated beneficiary, surviving spouse, legal representative, or next of kin of deceased state employees or deceased former state employees, as provided in this chapter;\n(9) determine the amount of the annuities and disability benefits of employees covered by the system and authorize payment of the annuities and benefits beginning as of the dates on which the annuities and benefits begin to accrue, in accordance with the provisions of this chapter;\n(10) pay annuities, refunds, survivor benefits, salaries, and necessary operating expenses of the system;\n(11) certify funds available for investment to the State Board of Investment;\n(12) with the advice and approval of the board request the State Board of Investment to sell securities when the director determines that funds are needed for the system;\n(13) prepare and submit to the board and the legislature an annual financial report covering the operation of the system, as required by section 356.20;\n(14) prepare and submit biennial and annual budgets to the board and with the approval of the board submit the budgets to the Department of Management and Budget; and\n(15) with the approval of the board, perform other duties required to administer the retirement and other provisions of this chapter and to do its business.\nThe board and the director shall undertake their activities consistent with chapter 356A.\nThe executive director may contract with an accredited independent organization specializing in disability determinations, licensed physicians, or physicians on the staff of the commissioner of health as designated by the commissioner, to be the medical adviser to the system.\nThe medical adviser shall designate licensed physicians to examine applicants for disability benefits. The medical adviser shall pass upon medical reports based upon examinations required to determine whether a state employee is totally and permanently disabled as defined in section 352.01, subdivision 17, shall investigate health and medical statements and certificates by or on behalf of a state employee in connection with a disability benefit, and shall report in writing to the director conclusions and recommendations on matters referred for advice.\nExcept as otherwise specifically provided in this chapter, the final power to determine the status of any individual in the employ of the state for the purposes of this chapter is vested in the board and its decision is final.\nThe attorney general shall be the legal adviser of the board and of the director. The board may sue or be sued or petitioned under this section in the name of the board of directors of the system. In actions brought by it or against it, the board shall be represented by the attorney general and, except as provided in section 356.96, subdivision 13, venue of actions shall be in the Ramsey County District Court.\nUpon request of the director, the Department of Management and Budget shall furnish information about the status of state employees as required by the director or the board in the performance of their duties.\n[Repealed, 1989 c 319 art 1 s 17]\nUnder the direction of the director the head of each department shall give information and keep records the director or the board needs for their duties.\nFor all purposes except quarterly and biennial budgets the system may operate on a calendar rather than a fiscal year basis.\nNotwithstanding chapter 16B or 16C or any law to the contrary, the executive director of the system may use the services of the Department of Administration, Information Services Division, for electronic data processing and related services or may contract for all or a part of the services.",
	"repealed": false
}