{
	"id": "268.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/268.101",
	"title": "268.101 DETERMINATIONS ON ISSUES OF INELIGIBILITY.",
	"text": "(a) In an application for unemployment benefits, each applicant must report the name and the reason for no longer working for the applicant's most recent employer, as well as the names of all employers and the reasons for no longer working for all employers during the six calendar months before the date of the application. If the reason reported for no longer working for any of those employers is other than a layoff because of lack of work, that raises an issue of ineligibility that the department must determine. An applicant must report any offers of employment refused during the eight calendar weeks before the date of the application for unemployment benefits and the name of the employer that made the offer. An applicant's failure to report the name of an employer, or giving an incorrect reason for no longer working for an employer, or failing to disclose an offer of employment that was refused, is a violation of section 268.183.\nIn an application, the applicant must also provide all information necessary to determine the applicant's eligibility for unemployment benefits under this chapter. If the applicant fails or refuses to provide information necessary to determine the applicant's eligibility for unemployment benefits, the applicant is ineligible for unemployment benefits under section 268.085, subdivision 2, until the applicant provides this required information.\n(b) Upon establishment of a benefit account under section 268.07, subdivision 2, the commissioner must notify, by mail or electronic transmission, all employers the applicant was required to report on the application and all base period employers and determined successors to those employers under section 268.051, subdivision 4, in order to provide the employer an opportunity to raise, in a manner and format prescribed by the commissioner, any issue of ineligibility. An employer must be informed of the effect that failure to raise an issue of ineligibility as a result of a quit or discharge of the applicant, as provided for under subdivision 2, paragraph (b), may have on the employer under section 268.047.\n(c) Each applicant must report any employment, and loss of employment, and offers of employment refused, during those weeks the applicant filed continued requests for unemployment benefits under section 268.0865. Each applicant who stops filing continued requests during the benefit year and later begins filing continued requests during that same benefit year must report the name of any employer the applicant worked for during the period between the filing of continued requests and the reason the applicant stopped working for the employer. The applicant must report any offers of employment refused during the period between the filing of continued requests for unemployment benefits. Those employers from which the applicant has reported a loss of employment under this paragraph must be notified by mail or electronic transmission and provided an opportunity to raise, in a manner prescribed by the commissioner, any issue of ineligibility. An employer must be informed of the effect that failure to raise an issue of ineligibility as a result of a quit or a discharge of the applicant may have on the employer under section 268.047.\n(d) The purpose for requiring the applicant to report the name of employers and the reason for no longer working for those employers, or offers of employment refused, under paragraphs (a) and (c) is for the commissioner to obtain information from an applicant raising all issues that may result in the applicant being ineligible for unemployment benefits under section 268.095, because of a quit or discharge, or the applicant being ineligible for unemployment benefits under section 268.085, subdivision 13c. If the reason given by the applicant for no longer working for an employer is other than a layoff because of lack of work, that raises an issue of ineligibility and the applicant is required, as part of the determination process under subdivision 2, paragraph (a), to state all the facts about the cause for no longer working for the employer, if known. If the applicant fails or refuses to provide any required information, the applicant is ineligible for unemployment benefits under section 268.085, subdivision 2, until the applicant provides this required information.\n(a) The commissioner must determine any issue of ineligibility raised by information required from an applicant under subdivision 1, paragraph (a) or (c), and send to the applicant and any involved employer, by mail or electronic transmission, a document titled a determination of eligibility or a determination of ineligibility, as is appropriate. The determination on an issue of ineligibility as a result of a quit or a discharge of the applicant must state the effect on the employer under section 268.047. A determination must be made in accordance with this paragraph even if a notified employer has not raised the issue of ineligibility.\n(b) The commissioner must determine any issue of ineligibility raised by an employer and send to the applicant and that employer, by mail or electronic transmission, a document titled a determination of eligibility or a determination of ineligibility as is appropriate. The determination on an issue of ineligibility as a result of a quit or discharge of the applicant must state the effect on the employer under section 268.047.\nIf a base period employer:\n(1) was not the applicant's most recent employer before the application for unemployment benefits;\n(2) did not employ the applicant during the six calendar months before the application for unemployment benefits; and\n(3) did not raise an issue of ineligibility as a result of a quit or discharge of the applicant within ten calendar days of notification under subdivision 1, paragraph (b);\nthen any exception under section 268.047, subdivisions 2 and 3, begins the Sunday two weeks following the week that the issue of ineligibility as a result of a quit or discharge of the applicant was raised by the employer.\nA communication from an employer must specifically set out why the applicant should be determined ineligible for unemployment benefits for that communication to be considered to have raised an issue of ineligibility for purposes of this section. A statement of \"protest\" or a similar term without more information does not constitute raising an issue of ineligibility for purposes of this section.\n(c) Subject to section 268.031, an issue of ineligibility is determined based upon that information required of an applicant, any information that may be obtained from an applicant or employer, and information from any other source.\n(d) Regardless of the requirements of this subdivision, the commissioner is not required to send to an applicant a copy of the determination where the applicant has satisfied a period of ineligibility because of a quit or a discharge under section 268.095, subdivision 10.\n(e) The department is authorized to issue a determination on an issue of ineligibility within 24 months from the establishment of a benefit account based upon information from any source, even if the issue of ineligibility was not raised by the applicant or an employer.\nIf an applicant obtained unemployment benefits through misrepresentation under section 268.18, subdivision 2, the department is authorized to issue a determination of ineligibility within 48 months of the establishment of the benefit account.\nIf the department has filed an intervention in a worker's compensation matter under section 176.361, the department is authorized to issue a determination of ineligibility within 48 months of the establishment of the benefit account.\n(f) A determination of eligibility or determination of ineligibility is final unless an appeal is filed by the applicant or employer within 45 calendar days after sending. The determination must contain a prominent statement indicating the consequences of not appealing. Proceedings on the appeal are conducted in accordance with section 268.105.\n(g) An issue of ineligibility required to be determined under this section includes any question regarding the denial or allowing of unemployment benefits under this chapter except for issues under section 268.07. An issue of ineligibility for purposes of this section includes any question of effect on an employer under section 268.047.\nMS 2010 [Expired, 2010 c 347 art 2 s 18]\n[Repealed by amendment, 2007 c 128 art 5 s 7]\nRegardless of any provision of the Minnesota Unemployment Insurance Law, the commissioner or an unemployment law judge may, before a determination being made under this chapter, refer any issue of ineligibility, or any other issue under this chapter, directly for hearing in accordance with section 268.105, subdivision 1. The status of the issue is the same as if a determination had been made and an appeal filed.\nUnless an appeal has been filed, the commissioner, on the commissioner's own motion, may reconsider a determination of eligibility or determination of ineligibility that has not become final and issue an amended determination. Any amended determination must be sent to the applicant and any involved employer by mail or electronic transmission. Any amended determination is final unless an appeal is filed by the applicant or notified employer within 45 calendar days after sending. Proceedings on the appeal are conducted in accordance with section 268.105.\nIf a determination or amended determination allows unemployment benefits to an applicant, the unemployment benefits must be paid regardless of any appeal period or any appeal having been filed.\nA determination or amended determination that holds an applicant ineligible for unemployment benefits for periods an applicant has been paid benefits is an overpayment of those unemployment benefits. A determination or amended determination issued under this section that results in an overpayment of unemployment benefits must set out the amount of the overpayment and the requirement under section 268.18, subdivision 1, that the overpaid unemployment benefits must be repaid.\n[Renumbered 268.19, subd 2]",
	"repealed": false
}