{
	"id": "84.991",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.991",
	"title": "84.991 CONSERVATION CORPS MINNESOTA.",
	"text": "(a) The Minnesota Conservation Corps is moved to the Friends of the Minnesota Conservation Corps, an existing nonprofit corporation under section 501(c)(3) of the Internal Revenue Code of 1986, as amended, doing business as Conservation Corps Minnesota under the supervision of a board of directors.\n(b) The expenditure of state funds by Conservation Corps Minnesota is subject to audit by the legislative auditor and regular annual report to the legislature in general and specifically to the house of representatives and senate committees with jurisdiction over environment and natural resources policy and finance.\n(a) Staff employed by Conservation Corps Minnesota are not state employees, but, at the option of the board of directors of the nonprofit corporation and at the expense of the corporation or its staff, employees who are in the employ of the Minnesota Conservation Corps on or before June 30, 2003, may continue to participate in state retirement and deferred compensation that apply to state employees.\n(b) Employment as a Conservation Corps Minnesota member is noncovered employment for purposes of eligibility for unemployment benefits under chapter 268.\n(c) Conservation Corps Minnesota is authorized to continue to have staff and corps members participate in the state of Minnesota workers' compensation program through the Department of Natural Resources. Staff and corps members' claim and administrative costs must be allocated and set annually by the Department of Natural Resources in a manner that is consistent with how these costs are allocated across that agency's operations. The Friends of the Minnesota Conservation Corps shall establish and follow loss-control strategies that are consistent with loss-control activities of the Department of Natural Resources. In the event that the Friends of the Minnesota Conservation Corps becomes insolvent or cannot otherwise fund its claim and administrative costs, liability for these costs shall be assumed by the Department of Natural Resources.\n(d) Conservation Corps Minnesota is a training and service program and exempt from Minnesota prevailing wage guidelines.\nThe Departments of Natural Resources, Agriculture, Public Safety, Transportation, and other appropriate state agencies must constructively collaborate with Conservation Corps Minnesota.\nConservation Corps Minnesota may purchase or lease equipment and services, including fleet, through state contracts administered by the commissioner of administration or the Department of Natural Resources.\nEach employing state or local agency must certify that the assignment of Conservation Corps Minnesota members will not result in the displacement of currently employed workers or workers on seasonal layoff, including partial displacement such as reduction in hours of nonovertime work, wages, or other employment benefits. Supervising agencies that participate in the program may not terminate, lay off, reduce the seasonal hours, or reduce the working hours of any employee for the purpose of using a corps member with available funds. The positions and job duties of corps members employed in projects shall be submitted to affected exclusive representatives prior to actual assignment.\nSection 471.59 relating to joint exercise of powers applies to Conservation Corps Minnesota.",
	"repealed": false
}