{
	"id": "327C.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.04",
	"title": "327C.04 UTILITY CHARGES.",
	"text": "A park owner who either provides utility service directly to residents or who redistributes to residents utility service provided to the park owner by a utility provider may charge the residents for that service, only if the charges comply with this section.\nA park owner who charges residents for a utility service must charge each household the same amount, unless the park owner has installed measuring devices which accurately meter each household's use of the utility. Utility measuring devices installed by the park owner must be installed or repaired only by a licensed plumber, licensed electrician, or licensed manufactured home installer.\nExcept as provided in subdivision 4, no park owner shall, directly or indirectly, charge or otherwise receive payment from a resident for a utility service, or require a resident to purchase a utility service from the park owner or any other person, at a rate which is greater than either of the following:\n(1) a rate which the resident could pay directly for the same utility service from some other comparable source in the same market area; or\n(2) a rate which is charged to single family dwellings with comparable service within the same market area.\nMS 2022 [Repealed, 2023 c 57 art 5 s 17]\n(a) A park owner who redistributes utility service may not charge a resident a commodity rate that exceeds the commodity rate at which the park owner purchases utility service from a utility provider. Before billing residents for redistributed utility service, a park owner must deduct utility service used exclusively or primarily for the park owner's purposes.\n(b) If a utility bill that a park owner receives from a utility provider separates from variable consumption charges a fixed service or meter charge or fee, taxes, surcharges, or other miscellaneous charges, the park owner must deduct the park owner's pro rata share of these separately itemized charges and apportion the remaining fixed portion of the bill equally among residents based on the total number of occupied units in the park.\n(c) A park owner may not charge to or collect from residents any administrative, capital, or other expenses associated with the distribution of utility services, including but not limited to disconnection, reconnection, and late payment fees.\nA park owner may not increase lot rents for 13 months following the commencement of utility bills for a resident whose lease included water and sewer service. In each of the three months prior to commencement of utility billing, a park owner must provide the resident with a sample bill for water and sewer service.",
	"repealed": false
}