{
	"id": "116T.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/116T.02",
	"title": "116T.02 CORPORATION; MEMBERS; BOARD OF DIRECTORS; POWERS.",
	"text": "Northern Technology Initiative, Inc. is a public corporation of the state and is not subject to the laws governing a state agency except as provided in this chapter. The business of the corporation must be conducted under the name \"Northern Technology Initiative, Inc.\"\nNorthern Technology Initiative, Inc. is a regional economic initiative of Minnesota counties, townships, home rule charter or statutory cities within participating counties, economic development groups, state and federal agencies, public and private postsecondary institutions, and businesses. The project area includes, at a minimum, the counties of Carlton, Chisago, Isanti, Kanabec, and Pine, but may be expanded as other contiguous counties elect to participate. The purpose of the corporation is to engage in an integrated, jointly planned economic development effort with a focus on encouraging growth among existing businesses and attracting technology companies to the region served by the corporation. A home rule charter city, statutory city, county, township, or other public entity participating in the initiative may budget public funds for the initiative.\nThe corporation is governed by a board of directors consisting of:\n(1) a member of the governing body of each participating county, appointed by the governing body;\n(2) a member of the governing body of each participating home rule charter or statutory city, appointed by the governing body;\n(3) the president of each participating postsecondary institution;\n(4) the commissioner of the Department of Employment and Economic Development or an employee of the department designated by the commissioner; and\n(5) other members as may be provided by the bylaws adopted and amended in accordance with subdivision 4.\nThe membership terms, compensation, removal, and filling of vacancies of members of the board are governed by the bylaws of the corporation.\nThe board of directors shall adopt bylaws and publish the bylaws and amendments to the bylaws in the State Register. The bylaws must provide for financial and other contributions by participating entities to cover the operation of the corporation.\nThe board shall locate and maintain the corporation's places of business within Carlton, Chisago, Isanti, Kanabec, or Pine County.\n(a) The board must meet at least twice a year and may hold additional meetings upon giving notice in accordance with the bylaws of the corporation. Except as provided in subdivision 7, board meetings are subject to chapter 13D.\n(b) A conference among directors by any means of communication through which the directors may simultaneously hear each other during the conference constitutes a board meeting if the number of directors participating in the conference is sufficient to constitute a quorum for the meeting. Participation in a meeting by that means constitutes presence in person at the meeting.\nThe board of directors may, by a majority vote in a public meeting, decide to hold a closed meeting for purposes of discussing data described in subdivision 8 or security information, trade secret information, or labor relations information, as defined in section 13.37, subdivision 1. The time and place of the closed meeting must be announced at the public meeting. A written roll of members present at the closed meeting must be made available to the public after the closed meeting. The proceedings of a closed meeting must be tape recorded. The data on the tape are nonpublic data or private data on individuals as defined in section 13.02, subdivision 9 or 12, whichever is applicable.\nFinancial data, statistics, and information furnished to the corporation in connection with assistance or proposed assistance, including credit reports; financial statements; statements of net worth; income tax returns, either personal or corporate; and any other business and personal financial records, are private data with regard to data on individuals under section 13.02, subdivision 12, or nonpublic data with regard to data not on individuals under section 13.02, subdivision 9.\nA director, employee, or officer of the corporation may not participate in or vote on a decision of the board relating to an organization in which the director has either a direct or indirect financial interest or a conflict of interest as described in section 10A.07.\nThe corporation is a state agency for purposes of section 3.736, except the corporation, not the state, is responsible for paying for any tort liability.\nThe corporation is subject to chapter 13 and sections 15.17 and 138.163 to 138.226.",
	"repealed": false
}