{
	"id": "354B.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/354B.31",
	"title": "354B.31 IRAP PART-TIME TEACHER MOBILITY PROGRAM.",
	"text": "A faculty member who has three years or more of service in the Minnesota State Colleges and Universities system, by agreement with the board or with the authorized representative of the board, may be assigned to teaching service in a part-time teaching position under subdivision 2.\nFor purposes of this section, \"part-time teaching position\" means a teaching position within the Minnesota State Colleges and Universities system in which the teacher is employed for at least 50 full days or a fractional equivalent as prescribed in section 354.091, and for which the faculty member is compensated in an amount not exceeding 80 percent of the compensation established by the board for a full-time faculty member with identical education and experience with the employing unit.\nA faculty member assigned to a part-time position under this section shall continue to make employee contributions to the individual retirement account plan during the period of part-time employment on the same basis and in the same amounts as would have been paid if the person had been employed on a full-time basis provided that, prior to June 30 each year, the member and the board make that portion of the required employer contribution to the plan, in any proportion which they may agree upon, that is based on the difference between the amount of compensation that would have been paid if the person had been employed on a full-time basis and the amount of compensation actually received by the person for the services rendered in the part-time assignment. The employing unit shall make that portion of the required employer contributions to the plan on behalf of the person that is based on the amount of compensation actually received by the person for the services rendered in the part-time assignment. The employee and employer contributions shall be based upon the rates of contribution prescribed by section 354B.23. Employee contributions for part-time teaching service pursuant to this section shall not continue for more than ten years.\nA faculty member entitled to make employee contributions for part-time teaching service pursuant to this section shall not be entitled during the same period of time to be a member of, accrue allowable service credit in, or make employee contributions to any other Minnesota public employee pension plan, except a firefighters relief association governed by sections 424A.091 to 424A.096.\nIf the board enters into an agreement authorized by this section, the board shall continue any insurance programs furnished or authorized a full-time teacher on an identical basis and with identical sharing of costs for a part-time teacher pursuant to this section. However, the requirements of this subdivision may be modified by a collective bargaining agreement between a board and an exclusive representative pursuant to chapter 179A. Teachers as defined in section 136F.43 employed on a less than 75 percent time basis pursuant to this section are eligible for state paid insurance benefits as if the teachers were employed full time.\nOnly teachers who are public employees as defined in section 179A.03, subdivision 14, during the school year preceding the period of part-time employment pursuant to this section qualify for employee contributions to the retirement plan for part-time teaching service under subdivision 4. Notwithstanding section 179A.03, subdivision 14, clauses (e) and (f), teachers who are employed on a part-time basis for purposes of this section and who would therefore be disqualified from the bargaining unit by one or both of those provisions, continue to be in the bargaining unit during the period of part-time employment under this section for purposes of compensation, fringe benefits, and the grievance procedure.\nThis section does not limit the authority of the board to assign a teacher to a part-time teaching position which does not qualify for full accrual of service credit from and employee contributions to the retirement fund under this section.\nSubdivision 4 does not prohibit a teacher who qualifies for full accrual of service credit from and employee contributions to the retirement fund pursuant to this section in any year from being employed as a substitute teacher by any school district during that year. Notwithstanding sections 354.091 and 354.42, a teacher may not qualify for full accrual of service credit from and employee contributions to the retirement fund for other teaching service rendered for any part of any year for which the teacher qualifies for employee contributions to the retirement plan pursuant to this section.",
	"repealed": false
}