{
	"id": "60A.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.50",
	"title": "60A.50 DEFINITIONS.",
	"text": "For purposes of sections 60A.50 to 60A.592, the terms in subdivisions 2 to 13 have the meanings given them.\n\"Adjusted RBC report\" means an RBC report which has been adjusted by the commissioner in accordance with section 60A.51, subdivision 3.\n\"Commissioner\" means the commissioner of commerce or the commissioner of health, whichever commissioner otherwise regulates the health organization.\n\"Corrective order\" means an order issued by the commissioner specifying corrective actions which the commissioner has determined are required.\n\"Domestic health organization\" means a health organization domiciled in this state.\n\"Foreign health organization\" means a health organization that is licensed to do business in this state but is not domiciled in this state.\n\"NAIC\" means the National Association of Insurance Commissioners.\n\"Health organization\" means an entity licensed under this chapter or chapter 62C or 62D. This definition does not include an organization that is licensed or regulated as either a life and health insurer or a property and casualty insurer that is otherwise subject to either the life or property and casualty risk-based capital requirements.\n\"RBC instructions\" means the RBC report including risk-based capital instructions adopted by the NAIC, as these RBC instructions may be amended by the NAIC from time to time in accordance with the procedures adopted by the NAIC.\n\"RBC level\" means a health organization's company action level RBC, regulatory action level RBC, authorized control level RBC, or mandatory control level RBC where:\n(1) \"company action level RBC\" means, with respect to any health organization, the product of 2.0 and its authorized control level RBC;\n(2) \"regulatory action level RBC\" means the product of 1.5 and its authorized control level RBC;\n(3) \"authorized control level RBC\" means the number determined under the risk-based capital formula in accordance with the RBC instructions; and\n(4) \"mandatory control level RBC\" means the product of .70 and the authorized control level RBC.\n\"RBC plan\" means a comprehensive financial plan containing the elements specified in section 60A.52, subdivision 2. If the commissioner rejects the RBC plan, and it is revised by the health organization, with or without the commissioner's recommendation, the plan must be called the \"revised RBC plan.\"\n\"RBC report\" means the report required in section 60A.51.\n\"Total adjusted capital\" means the sum of:\n(1) a health organization's statutory capital and surplus as determined in accordance with the statutory accounting applicable to the annual financial statements required to be filed; and\n(2) such other items, if any, as the RBC instructions may provide.",
	"repealed": false
}