{
	"id": "256B.0914",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0914",
	"title": "256B.0914 CONFLICTS OF INTEREST RELATED TO MEDICAID EXPENDITURES.",
	"text": "(a) \"Contract\" means a written, fully executed agreement for the purchase of goods and services involving a substantial expenditure of Medicaid funding. A contract under a renewal period shall be considered a separate contract.\n(b) \"Contractor bid or proposal information\" means cost or pricing data, indirect costs, and proprietary information marked as such by the bidder in accordance with applicable law.\n(c) \"Particular expenditure\" means a substantial expenditure as defined below, for a specified term, involving specific parties. The renewal of an existing contract for the substantial expenditure of Medicaid funds is considered a separate, particular expenditure from the original contract.\n(d) \"Source selection information\" means any of the following information prepared for use by the state, county, or independent contractor for the purpose of evaluating a bid or proposal to enter into a Medicaid procurement contract, if that information has not been previously made available to the public or disclosed publicly:\n(1) bid prices submitted in response to a solicitation for sealed bids, or lists of the bid prices before bid opening;\n(2) proposed costs or prices submitted in response to a solicitation, or lists of those proposed costs or prices;\n(3) source selection plans;\n(4) technical evaluations plans;\n(5) technical evaluations of proposals;\n(6) cost or price evaluation of proposals;\n(7) competitive range determinations that identify proposals that have a reasonable chance of being selected for award of a contract;\n(8) rankings of bids, proposals, or competitors;\n(9) the reports and evaluations of source selection panels, boards, or advisory councils; and\n(10) other information marked as \"source selection information\" based on a case-by-case determination by the head of the agency, contractor, designees, or the contracting officer that disclosure of the information would jeopardize the integrity or successful completion of the Medicaid procurement to which the information relates.\n(e) \"Substantial expenditure\" and \"substantial amounts\" mean a purchase of goods or services in excess of $10,000,000 in Medicaid funding under this chapter or chapter 256L.\n(a) Unless provided otherwise, this section applies to:\n(1) any state or local officer, employee, or independent contractor who is responsible for the substantial expenditures of medical assistance or MinnesotaCare funding under this chapter or chapter 256L for which federal Medicaid matching funds are available;\n(2) any individual who formerly was such an officer, employee, or independent contractor; and\n(3) any partner of such a state or local officer, employee, or independent contractor.\n(b) This section is intended to meet the requirements of state participation in the Medicaid program at United States Code, title 42, sections 1396a(a)(4) and 1396u-2(d)(3), which require that states have in place restrictions against conflicts of interest in the Medicaid procurement process, that are at least as stringent as those in effect under United States Code, title 41, section 423, and title 18, sections 207 and 208, as they apply to federal employees.\nA person described in subdivision 2 may not knowingly disclose contractor bid or proposal information, or source selection information before the award by the state, county, or independent contractor of a Medicaid procurement contract to which the information relates unless the disclosure is otherwise authorized by law. No person, other than as provided by law, shall knowingly obtain contractor bid or proposal information or source selection information before the award of a Medicaid procurement contract to which the information relates.\nWhen a person described in subdivision 2, paragraph (a), is participating personally and substantially in a Medicaid procurement for a contract contacts or is contacted by a person who is a bidder or offeror in the same procurement regarding possible employment outside of the entity by which the person is currently employed, the person must:\n(1) report the contact in writing to the person's supervisor and employer's ethics officer; and\n(2) either:\n(i) reject the possibility of employment with the bidder or offeror; or\n(ii) be disqualified from further participation in the procurement until the bidder or offeror is no longer involved in that procurement, or all discussions with the bidder or offeror regarding possible employment have terminated without an arrangement for employment. A bidder or offeror may not engage in employment discussions with an official who is subject to this subdivision, until the bidder or offeror is no longer involved in that procurement.\n(a) A former official of the state or county, or a former independent contractor, described in subdivision 2 may not accept compensation from a Medicaid contractor of a substantial expenditure as an employee, officer, director, or consultant of the contractor within one year after the former official or independent contractor:\n(1) served as the procuring contracting officer, the source selection authority, a member of the source selection evaluation board, or the chief of a financial or technical evaluation team in a procurement in which the contractor was selected for award;\n(2) served as the program manager, deputy program manager, or administrative contracting officer for a contract awarded to the contractor; or\n(3) personally made decisions for the state, county, or independent contractor to:\n(i) award a contract, subcontract, modification of a contract or subcontract, or a task order or delivery order to the contractor;\n(ii) establish overhead or other rates applicable to a contract or contracts with the contractor;\n(iii) approve issuance of a contract payment or payments to the contractor; or\n(iv) pay or settle a claim with the contractor.\n(b) Paragraph (a) does not prohibit a former official of the state, county, or independent contractor from accepting compensation from any division or affiliate of a contractor not involved in the same or similar products or services as the division or affiliate of the contractor that is responsible for the contract referred to in paragraph (a), clause (1), (2), or (3).\n(c) A contractor shall not provide compensation to a former official knowing that the former official is accepting that compensation in violation of this subdivision.\n(a) A person described in subdivision 2, after termination of service with the state, county, or independent contractor, is permanently restricted from knowingly making, with the intent to influence, any communication to or appearance before an officer or employee of a department, agency, or court of the United States, the state of Minnesota and its counties in connection with a particular expenditure:\n(1) in which the United States, the state of Minnesota, or a Minnesota county is a party or has a direct and substantial interest;\n(2) in which the person participated personally and substantially as an officer, employee, or independent contractor; and\n(3) which involved a specific party or parties at the time of participation.\n(b) For purposes of this subdivision and subdivisions 7 and 9, \"participated\" means an action taken through decision, approval, disapproval, recommendation, the rendering of advice, investigation, or other such action.\nNo person described in subdivision 2, within two years after termination of service with the state, county, or independent contractor, shall knowingly make, with the intent to influence, any communication to or appearance before any officer or employee of any government department, agency, or court in connection with a particular expenditure:\n(1) in which the United States, the state of Minnesota, or a Minnesota county is a party or has a direct and substantial interest;\n(2) which the person knows or reasonably should know was actually pending under the official's responsibility as an officer, employee, or independent contractor within one year before the termination of the official's service with the state, county, or independent contractor; and\n(3) which involved a specific party or parties at the time the expenditure was pending.\nSubdivisions 6 and 7 do not apply to:\n(1) communications or representations made in carrying out official duties on behalf of the United States, the state of Minnesota or local government, or as an elected official of the state or local government;\n(2) communications made solely for the purpose of furnishing scientific or technological information; or\n(3) giving testimony under oath. A person subject to subdivisions 6 and 7 may serve as an expert witness in that matter, without restriction, for the state, county, or independent contractor. Under court order, a person subject to subdivisions 6 and 7 may serve as an expert witness for others. Otherwise, the person may not serve as an expert witness in that matter.\nThe commissioner of human services, or the governor in the case of the commissioner, may grant a waiver of a restriction in subdivisions 6 and 7 upon determining that a waiver is in the public interest and that the services of the officer or employee are critically needed for the benefit of the state or county government.\nA person described in subdivision 2, paragraph (a), clause (1), who participates in a particular expenditure in which the person has knowledge or has a financial interest, is subject to the penalties in subdivision 12. For purposes of this subdivision, \"financial interest\" also includes the financial interest of a spouse, minor child, general partner, organization in which the officer or employee is serving as an officer, director, trustee, general partner, or employee, or any person or organization with whom the individual is negotiating or has any arrangement concerning prospective employment.\nSubdivision 10 does not apply if:\n(1) the person first advises the person's supervisor and the employer's ethics officer regarding the nature and circumstances of the particular expenditure and makes full disclosure of the financial interest and receives in advance a written determination made by the commissioner of human services, or the governor in the case of the commissioner, that the interest is not so substantial as to likely affect the integrity of the services which the government may expect from the officer, employee, or independent contractor;\n(2) the financial interest is listed as an exemption at Code of Federal Regulations, title 5, sections 2640.201 to 2640.203, as too remote or inconsequential to affect the integrity of the services of the office, employee, or independent contractor to which the requirement applies.\n(a) A person who violates subdivisions 3 to 5 for the purpose of either exchanging the information covered by this section for anything of value, or for obtaining or giving anyone a competitive advantage in the award of a Medicaid contract, may be sentenced to imprisonment for not more than five years or payment of a fine of not more than $50,000 for each violation, or the amount of compensation which the person received or offered for the prohibited conduct, whichever is greater, or both.\n(b) A person who violates a provision of subdivisions 6 to 11 may be sentenced to imprisonment for not more than 364 days or payment of a fine of not more than $50,000 for each violation or the amount of compensation which the person received or offered for the prohibited conduct, whichever amount is greater, or both. A person who willfully engages in conduct in violation of subdivisions 6 to 11 may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $50,000 for each violation or the amount of compensation which the person received or offered for the prohibited conduct, whichever amount is greater, or both.\n(c) Nothing in this section precludes prosecution under other laws such as section 609.43.\n(a) The Minnesota attorney general may bring a civil action in Ramsey county district court against a person who violates this section. Upon proof of such conduct by a preponderance of evidence, the person is subject to a civil penalty. An individual who violates this section is subject to a civil penalty of not more than $50,000 for each violation plus twice the amount of compensation which the individual received or offered for the prohibited conduct. An organization that violates this section is subject to a civil penalty of not more than $500,000 for each violation plus twice the amount of compensation which the organization received or offered for the prohibited conduct.\n(b) If the Minnesota attorney general has reason to believe that a person is engaging in conduct in violation of this section, the attorney general may petition the Ramsey county district court for an order prohibiting that person from engaging in such conduct. The court may issue an order prohibiting that person from engaging in such conduct if the court finds that the conduct constitutes such a violation. The filing of a petition under this subdivision does not preclude any other remedy which is available by law.\n(a) If a state agency, local agency, or independent contractor receives information that a contractor or a person has violated this section, the state agency, local agency, or independent contractor may:\n(1) cancel the procurement if a contract has not already been awarded;\n(2) rescind the contract; or\n(3) initiate suspension or debarment proceedings according to applicable state or federal law.\n(b) If the contract is rescinded, the state agency, local agency, or independent contractor is entitled to recover, in addition to any penalty prescribed by law, the amount expended under the contract.\n(c) This section does not:\n(1) restrict the disclosure of information to or from any person or class of persons authorized to receive that information;\n(2) restrict a contractor from disclosing the contractor's bid or proposal information or the recipient from receiving that information;\n(3) restrict the disclosure or receipt of information relating to a Medicaid procurement after it has been canceled by the state agency, county agency, or independent contractor before the contract award unless the agency or independent contractor plans to resume the procurement; or\n(4) limit the applicability of any requirements, sanctions, contract penalties, and remedies established under any other law or regulation.\n(d) No person may file a protest against the award or proposed award of a Medicaid contract alleging a violation of this section unless that person reported the information the person believes constitutes evidence of the offense to the applicable state agency, local agency, or independent contractor responsible for the procurement. The report must be made no later than 14 days after the person first discovered the possible violation.",
	"repealed": false
}