{
	"id": "609.822",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.822",
	"title": "609.822 RESIDENTIAL MORTGAGE FRAUD.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Mortgage lending process\" means the process through which a person seeks or obtains a residential mortgage loan including, but not limited to, solicitation, application, or origination, negotiation of terms, third-party provider services, underwriting, signing and closing, and funding of the loan. Documents involved in the mortgage lending process include, but are not limited to, uniform residential loan applications or other loan applications; appraisal reports; HUD-1 settlement statements; supporting personal documentation for loan applications such as W-2 forms, verifications of income and employment, bank statements, tax returns, and payroll stubs; and any required disclosures.\n(c) \"Residential mortgage loan\" has the meaning given in section 58.02, subdivision 18.\nWhoever does any of the following commits residential mortgage fraud and may be sentenced as provided in subdivision 3:\n(1) knowingly makes or causes to be made any deliberate and material misstatement, misrepresentation, or omission during the mortgage lending process with the intention that it be relied on by a mortgage lender, borrower, or any other party to the mortgage lending process;\n(2) knowingly uses or facilitates the use of any deliberate and material misstatement, misrepresentation, or omission, knowing the same to contain a material misstatement, misrepresentation, or omission, during the mortgage lending process with the intention that it be relied on by a mortgage lender, borrower, or any other party to the mortgage lending process; or\n(3) conspires to violate clause (1) or (2).\nAn offense of residential mortgage fraud must not be predicated solely upon information lawfully disclosed under federal disclosure laws, regulations, and interpretations related to the mortgage lending process.\nWhoever violates this section shall be sentenced as provided in section 609.52, subdivision 3, based on the aggregate economic loss suffered by any person as a result of the violation. However, the maximum sentence of imprisonment for the offense may not exceed two years. A person convicted of a violation of this section shall be ordered to pay restitution to persons aggrieved by the violation. Restitution shall be ordered in addition to a fine or imprisonment but not in lieu of a fine or imprisonment. Nothing in this section limits the power of the state to punish any person for conduct which constitutes a crime under any other statute.\nIf the person who violates subdivision 2 knew or had reason to know that the victim was vulnerable due to age, infirmity, or reduced physical or mental capacity, the court may order an aggravated departure under the sentencing guidelines.",
	"repealed": false
}