{
	"id": "148.9981",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.9981",
	"title": "148.9981 DEFINITIONS.",
	"text": "For the purposes of sections 148.9981 to 148.9995, the terms in this section have the meanings given.\n\"Accredited school or educational program\" means a school, university, college, or other postsecondary education program that, at the time the student completes the program, is accredited by a regional accrediting association whose standards are substantially equivalent to those of the North Central Association of Colleges and Postsecondary Education Institutions or an accrediting association that evaluates schools of behavior analysis, psychology, or education for inclusion of the education, practicum, and core function standards.\n\"Advisory council\" means the Behavior Analyst Advisory Council established in section 148.9994.\n\"Board\" means the Board of Psychology established in section 148.90.\n\"Certifying entity\" means the Behavior Analyst Certification Board, Inc., or a successor organization or other organization approved by the board in consultation with the advisory council.\n\"Client\" means an individual who is the recipient of behavior analysis services. Client also means \"patient\" as defined in section 144.291, subdivision 2, paragraph (g).\n\"Licensed behavior analyst\" or \"behavior analyst\" means an individual who holds a valid license issued under sections 148.9981 to 148.9995 to engage in the practice of applied behavior analysis.\n\"Licensee\" means an individual who holds a valid license issued under sections 148.9981 to 148.9995.\n(a) \"Practice of applied behavior analysis\" means the design, implementation, and evaluation of social, instructional, and environmental modifications to produce socially significant improvements in human behavior. The practice of applied behavior analysis includes the empirical identification of functional relations between behavior and environmental factors, known as functional behavioral assessment and analysis. Applied behavior analysis interventions are based on scientific research, direct and indirect observation, and measurement of behavior and environment and utilize contextual factors, motivating operations, antecedent stimuli, positive reinforcement, and other procedures to help individuals develop new behaviors, increase or decrease existing behaviors, and emit behaviors under specific social, instructional, and environmental conditions.\n(b) The practice of applied behavior analysis does not include the diagnosis of psychiatric or mental health disorders, psychological testing, neuropsychology, psychotherapy, cognitive therapy, sex therapy, hypnotherapy, psychoanalysis, or psychological counseling.",
	"repealed": false
}