{
	"id": "260.763",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.763",
	"title": "260.763 JURISDICTION AND TRANSFER TO TRIBAL COURT.",
	"text": "(a) An Indian Tribe has exclusive jurisdiction over all child placement proceedings involving an Indian child who resides or is domiciled within the reservation of the Tribe, except where jurisdiction is otherwise vested in the state by existing federal law. The child-placing agencies and the courts shall defer to a Tribal determination of the Tribe's exclusive jurisdiction when an Indian child resides or is domiciled within the reservation of the Tribe.\n(b) Where an Indian child is a ward of the Tribal court, the Indian Tribe retains exclusive jurisdiction, notwithstanding the residence or domicile of the child unless the Tribe agrees to allow concurrent jurisdiction with the state.\n(c) An Indian Tribe and the state of Minnesota share concurrent jurisdiction over a child placement proceeding involving an Indian child who resides or is domiciled outside of the reservation of the Tribe, or if the Tribe agrees to concurrent jurisdiction.\nThe court shall give full faith and credit to Tribal court placement orders. In any case where the Tribal court orders placement and services, including but not limited to case planning services, full faith and credit of the Tribal court's order shall be provided so long as the county of financial responsibility was provided notice and an opportunity to be heard regarding the expenses. Determination of county of financial responsibility for the placement shall be determined by the child-placing agency in accordance with section 256G.02, subdivision 4. Disputes concerning the county of financial responsibility shall be settled in the manner prescribed in section 256G.09.\nThe court shall give full faith and credit to the public acts, records, and judicial proceedings of any Indian Tribe in all proceedings under sections 260.755 to 260.835. The courts shall give deference to the Tribe's interpretation of the Tribe's own unique system of laws. If further interpretation of a Tribe's laws or order is required, the court shall transfer the proceedings to the jurisdiction of the Tribal court for interpretation of the Tribal court's order.\nThe commissioner or the child-placing agency is hereby authorized to enter into agreements with Indian Tribes respecting care and custody of Indian children and jurisdiction over child placement proceedings, including agreements which may provide for orderly transfer of jurisdiction on a case-by-case basis and agreements which provide for concurrent jurisdiction between the state and an Indian Tribe.\nIn any child placement proceeding, upon a motion or request by the Indian child's parent, Indian custodian, or Tribe, the court, in the absence of good cause to the contrary, shall transfer the proceeding to the jurisdiction of the Tribe absent objection by either of the Indian child's parent or the Indian custodian. The motion or request to transfer may be made by the Indian child's parent, the Indian custodian, or the Indian child's Tribe at any stage in the proceedings by: (1) filing a written motion with the court and serving the motion upon the other parties; or (2) making a request on the record during the hearing, which shall be reflected in the court's findings. A request or motion to transfer made by a Tribal representative of the Indian child's Tribe under this subdivision shall not be considered the unauthorized practice of law. The transfer is subject to declination by the Tribal court of the Tribe.\n(a) Establishing good cause to deny transfer of jurisdiction to a Tribal court is a fact-specific inquiry to be determined on a case-by-case basis. Socioeconomic conditions and the perceived adequacy of Tribal or Bureau of Indian Affairs social services or judicial systems must not be considered in a determination that good cause exists. The party opposed to transfer of jurisdiction to a Tribal court has the burden to prove by clear and convincing evidence that good cause to deny transfer exists. Opposition to a motion to transfer jurisdiction to Tribal court must be in writing and must be served upon all parties.\n(b) Upon a motion or request by an Indian child's parent, Indian custodian, or Tribe, the court shall transfer jurisdiction to a Tribal court unless the court determines that there is good cause to deny transfer based on the following:\n(1) the Indian child's Tribe does not have a Tribal court or any other administrative body of a Tribe vested with authority over child placement proceedings, as defined in section 260.755, subdivision 3, to which the case can be transferred, and no other Tribal court has been designated by the Indian child's Tribe; or\n(2) the evidence necessary to decide the case could not be adequately presented in the Tribal court without undue hardship to the parties or the witnesses and the Tribal court is unable to mitigate the hardship by any means permitted in the Tribal court's rules. Without evidence of undue hardship, travel distance alone is not a basis for denying a transfer.",
	"repealed": false
}