{
	"id": "181.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/181.211",
	"title": "181.211 DEFINITIONS.",
	"text": "The terms defined in this section apply to sections 181.211 to 181.217.\n\"Board\" means the Minnesota Nursing Home Workforce Standards Board established under section 181.212.\n\"Certified worker organization\" means a worker organization that is certified by the board to conduct nursing home worker trainings under section 181.214.\n\"Commissioner\" means the commissioner of labor and industry.\n\"Compensation\" means all income and benefits paid by a nursing home employer to a nursing home worker or on behalf of a nursing home worker, including but not limited to wages, bonuses, differentials, paid leave, pay for scheduling changes, and pay for training or occupational certification.\n\"Employer organization\" means:\n(1) an organization that is exempt from federal income taxation under section 501(c)(6) of the Internal Revenue Code and that represents nursing home employers; or\n(2) an entity that employers, who together employ a majority of nursing home workers in Minnesota, have selected as a representative.\n\"Nursing home\" means a nursing home licensed under chapter 144A, or a boarding care home licensed under sections 144.50 to 144.56.\n\"Nursing home employer\" means an employer of nursing home workers in a licensed, Medicaid-certified facility that is reimbursed under chapter 256R.\n\"Nursing home worker\" means any worker who provides services in a nursing home in Minnesota, including direct care staff, non-direct care staff, and contractors, but excluding administrative staff, medical directors, nursing directors, physicians, and individuals employed by a supplemental nursing services agency.\n\"Worker organization\" means an organization that is exempt from federal income taxation under section 501(c)(3), 501(c)(4), or 501(c)(5) of the Internal Revenue Code, that is not dominated or interfered with by any nursing home employer within the meaning of United States Code, title 29, section 158a(2), and that has at least five years of demonstrated experience engaging with and advocating for nursing home workers.",
	"repealed": false
}