{
	"id": "192A.0851",
	"url": "https://www.revisor.mn.gov/statutes/cite/192A.0851",
	"title": "192A.0851 COMMANDING OFFICER'S NONJUDICIAL PUNISHMENT.",
	"text": "(a) Any commander may impose disciplinary punishments for minor offenses without the intervention of a court-martial pursuant to this section. The governor, the adjutant general, or a general officer in command may delegate the powers under this section to a deputy commanding general or assistant adjutant general who is a member of the state military forces.\n(b) Any commanding officer may impose upon enlisted members of the officer's command:\n(1) an admonition;\n(2) a reprimand;\n(3) the withholding of privileges for not more than six months;\n(4) the forfeiture of not more than seven days' pay;\n(5) a reduction to the next inferior pay grade, if the grade from which demoted is within the promotion authority of the officer imposing the reduction or any officer subordinate to the one who imposes the reduction;\n(6) extra duties for not more than 14 days, which need not be consecutive; and\n(7) restriction to certain specified limits, with or without suspension from duty, for not more than 14 days, which need not be consecutive.\n(c) Any commanding officer of the grade of major or lieutenant colonel or above may impose upon enlisted members of the officer's command:\n(1) any punishment authorized in paragraph (b), clauses (1), (2), and (3);\n(2) the forfeiture of not more than one-half of one month's pay per month for two months;\n(3) a reduction to the lowest or any intermediate pay grade, if the grade from which demoted is within the promotion authority of the officer imposing the reduction or any officer subordinate to the one who imposes the reduction, but an enlisted member in a pay grade above E-4 may not be reduced more than one pay grade;\n(4) extra duties for not more than 45 days, which need not be consecutive; and\n(5) restriction to certain specified limits, with or without suspension from duty, for not more than 60 days, which need not be consecutive.\n(d) The governor, the adjutant general, an officer exercising general court-martial convening authority, or a general officer in command may impose:\n(1) upon officers of the officer's command:\n(i) any punishment authorized in paragraph (c), clauses (1), (2), and (5); and\n(ii) arrest in quarters for not more than 30 days, which need not be consecutive; and\n(2) upon enlisted members of the officer's command, any punishment authorized in paragraph (c).\n(e) Whenever any of those punishments are combined to run consecutively, the total length of the combined punishment cannot exceed the authorized duration of the longest punishment in the combination, and there must be an apportionment of punishments so that no single punishment in the combination exceeds its authorized length under this section.\n(f) Prior to the offer of nonjudicial punishment, the commanding officer shall determine whether arrest in quarters or restriction shall be considered as punishments. Should the commanding officer determine that the punishment options may include arrest in quarters or restriction, the accused shall be notified of the right to demand trial by court-martial. Should the commanding officer determine that the punishment options will not include arrest in quarters or restriction, the accused shall be notified that there is no right to trial by court-martial in lieu of nonjudicial punishment.\n(g) The officer who imposes the punishment, or the successor in command, may, at any time, suspend, set aside, mitigate, or remit any part or amount of the punishment and restore all rights, privileges, and property affected. The officer also may:\n(1) mitigate reduction in grade to forfeiture of pay;\n(2) mitigate arrest in quarters to restriction; or\n(3) mitigate extra duties to restriction.\nThe mitigated punishment shall not be for a greater period than the punishment mitigated. When mitigating reduction in grade to forfeiture of pay, the amount of the forfeiture shall not be greater than the amount that could have been imposed initially under this section by the officer who imposed the punishment mitigated.\n(h) A person punished under this section who considers the punishment unjust or disproportionate to the offense may, through the proper channel, appeal to the next superior authority within 15 days after the punishment is either announced or sent to the accused, as the commander may determine. The appeal shall be promptly forwarded and decided, but the person punished may in the meantime be required to undergo the punishment adjudged. The superior authority may exercise the same powers with respect to the punishment imposed as may be exercised under paragraph (g) by the officer who imposed the punishment. Before acting on an appeal from a punishment, the authority that is to act on the appeal may refer the case to a judge advocate for consideration and advice.\n(i) The imposition and enforcement of disciplinary punishment under this section for any act or omission is not a bar to trial by court-martial or a civilian court of competent jurisdiction for a serious crime or offense growing out of the same act or omission and not properly punishable under this section. The fact that a disciplinary punishment has been enforced may be shown by the accused upon trial and, when so shown, it shall be considered in determining the measure of punishment to be adjudged in the event of a finding of guilty.\n(j) Whenever a punishment of forfeiture of pay is imposed under this section, the forfeiture may apply to pay accruing before, on, or after the date that punishment is imposed.\nRegulations may prescribe the form of records to be kept of proceedings under this section and may prescribe that certain categories of those proceedings shall be in writing.",
	"repealed": false
}