{
	"id": "47.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.205",
	"title": "47.205 ASSIGNMENT OF MORTGAGE; DUTIES; PENALTIES.",
	"text": "For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"Lender\" means all state banks and trust companies, national banking associations, state and federally chartered savings associations, mortgage banks, savings banks, insurance companies, credit unions making a loan, or any person making a conventional loan as defined under section 47.20, subdivision 2, clause (3) or cooperative apartment loan as defined under section 47.20, subdivision 2, clause (4). A \"selling lender\" is a lender who sells, assigns, or transfers the servicing of a loan, to a \"purchasing lender or a servicing agent.\"\n(b) \"Loan\" means all loans and advances of credit authorized under section 47.20, subdivision 1, clauses (1) to (4) and conventional loans as defined under section 47.20, subdivision 2, clause (3) or cooperative apartment loan as defined under section 47.20, subdivision 2, clause (4).\n(c) \"Escrow account\" means escrow, agency, or similar account for the payment of taxes or insurance premiums with respect to a mortgaged one-to-four family, owner-occupied residence located in this state.\n(d) \"Person\" means an individual, corporation, business trust, partnership or association, or any other legal entity.\nIf the servicing of mortgage loans financing one-to-four family owner-occupied residences located in this state is sold or assigned to another person:\n(1) the selling lender shall notify the mortgagor of the sale no more than ten days after the actual date of transfer. The notification must include the name, address, and telephone number of the person who will assume responsibility for servicing and accept payments for the mortgage loan and the notification must also include a detailed written financial breakdown, including but not limited to, interest rate, monthly payment amount, and current escrow balance;\n(2) the purchasing lender shall issue corrected coupon or payment books, if used, and shall provide notification to the mortgagor within 20 days after the first payment to the purchasing lender is due, of the name, address, and telephone number of the person from whom the mortgagor can receive information regarding the servicing of the loan, and shall inform the mortgagor of any changes made regarding the mortgage escrow accounts or servicing requirements including, but not limited to, interest rate, monthly payment amount, and current escrow balance; and\n(3) the purchasing lender shall respond within 15 business days to a written request for information from a mortgagor. A written response must include the telephone number of the company representative who can assist the mortgagor.\nEach lender requiring funds of a mortgagor to be paid into an escrow account for payment of taxes or insurance premiums with respect to a mortgaged one-to-four family owner-occupied residence located in this state shall make payments for the taxes or insurance from the escrow account in a timely manner as these obligations become due provided that funds paid into the account by the mortgagor are sufficient for the payment. If there is a shortage of funds, the lender shall promptly notify the mortgagor of the shortage. If the lender fails to make timely payments, the lender is liable to the mortgagor for actual damages caused by the failure to pay the amounts when due and is subject to penalties provided in subdivision 4, except that the lender may present any legal defense in any subsequent hearing. The lender is permitted to make a payment on behalf of the mortgagor even though there are not sufficient funds in a particular account to cover the payment.\nIf a lender fails to comply with the requirements of subdivisions 2 and 3, the lender is liable to the mortgagor for actual damages caused by the violation. In addition, the lender is liable to the mortgagor for $500 per occurrence if the violation of subdivision 2 or 3 was due to the lender's failure to exercise reasonable care.",
	"repealed": false
}