{
	"id": "216C.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.19",
	"title": "216C.19 ENERGY CONSERVATION.",
	"text": "After consultation with the commissioner and the commissioner of public safety, the commissioner of transportation shall adopt rules under chapter 14 establishing minimum energy efficiency standards for street, highway, and parking lot lighting. The standards must be consistent with overall protection of the public health, safety, and welfare. No new highway, street, or parking lot lighting may be installed in violation of these rules. Existing lighting equipment, excluding roadway sign lighting, with lamps with initial efficiencies less than 70 lumens per watt must be replaced when worn out with light sources using lamps with initial efficiencies of at least 70 lumens per watt.\nBeginning July 1, 1980, the use of outdoor display lighting shall be limited as provided in subdivision 3. For purposes of this section, \"outdoor display lighting\" shall include building facade lighting, other decorative lighting, and all billboards and advertising signs except those which identify a commercial establishment which is open for business at that hour.\nThe commissioner shall adopt rules, pursuant to chapter 14, setting standards covering permissible hours of operation, quantity, and efficiency of outdoor display lighting and defining \"outdoor display lighting.\"\nThe commissioner may investigate promotional practices by energy suppliers and, pursuant to chapter 14, may promulgate rules to limit such practices in order to reduce the rate of growth of energy demand.\nAfter July 1, 1974, no new natural gas outdoor lighting shall be installed in the state. However, the installation and use of natural gas outdoor lighting that is equipped with either an automatic daytime shutoff device or is otherwise capable of being switched on and off, is permitted.\nBeginning April 20, 1977, no person shall use a decorative gas lamp in Minnesota except as provided in this subdivision and in subdivisions 5 and 7. The commissioner shall grant a permanent variance allowing a homeowner who received a variance in 1977 to operate a decorative gas lamp or lamps at the homeowner's principal place of residence. The variance shall be valid for the life of the recipient. The commissioner shall not issue a variance to any other person to use a decorative gas lamp or lamps.\nGas lamps installed prior to April 20, 1977, by or at the request of a municipality, on a public street or right-of-way, may be used as street lighting.\n[Repealed, 2000 c 297 s 5]\nThe commissioner shall conduct studies and make recommendations concerning the purchase and use by the state and its political subdivisions of supplies, motor vehicles and equipment having a significant impact on energy use in order to determine the potential for energy conservation. The commissioner may adopt rules pursuant to chapter 14 to insure that energy use and conservation will be considered in state purchasing and, where appropriate, to require certain minimum energy efficiency standards in purchased products and equipment. No state purchasing of equipment or material use shall occur that is not in conformity with these rules.\n[Repealed, 1996 c 310 s 1]\n[Repealed, 1996 c 310 s 1]\n[Repealed, 1996 c 310 s 1]\nNo new room air conditioner shall be sold or installed or transported for resale into Minnesota unless it has an energy efficiency ratio equal to or greater than the values required by applicable federal laws and the United States Department of Energy regulations codified in Code of Federal Regulations, title 10, including applicable interpretations of the regulations issued by that department.\nNo new residential\n(1) forced-air-type central furnace;\n(2) cooking appliance manufactured with an electrical supply cord; or\n(3) clothes-drying equipment,\nthat is designed to burn natural gas shall be sold or installed in Minnesota, unless it meets or exceeds the efficiency standards required by applicable federal laws and the United States Department of Energy regulations codified in Code of Federal Regulations, title 10, including applicable interpretations of the regulations issued by that department.\nNo person may sell or install a fluorescent lamp ballast in this state that does not comply with the energy efficiency standards for fluorescent lamp ballasts adopted by the commissioner under subdivision 8.\nNo new lamp may be sold in Minnesota unless it meets or exceeds the minimum efficiency standards required by applicable federal laws and the United States Department of Energy regulations codified in Code of Federal Regulations, title 10, including applicable interpretations of the regulations issued by that department.\nNo new motor covered by this subdivision, excluding those sold as part of an appliance, may be sold or installed in Minnesota unless its nominal efficiency meets or exceeds the values adopted under section 326B.106.\n(a) This subdivision applies to electrically operated unitary and packaged terminal air conditioners and heat pumps, electrically operated water-chilling packages, gas- and oil-fired boilers, and warm air furnaces and combination warm air furnaces and air conditioning units installed in buildings housing commercial or industrial operations.\n(b) No commercial heating, air conditioning, or ventilating equipment covered by this subdivision may be sold or installed in Minnesota unless it meets or exceeds the minimum performance standards established by ASHRAE standard 90.1.\nNo new showerhead, kitchen faucet or kitchen replacement aerator, or lavatory faucet or lavatory replacement aerator may be sold or installed in Minnesota unless it meets or exceeds the efficiency standards required by applicable federal laws and the United States Department of Energy regulations codified in Code of Federal Regulations, title 10, including applicable interpretations of the regulations issued by that department.\nThe commissioner shall adopt rules to implement subdivisions 13 and 16 to 19, including rules governing testing of products covered by those sections. The rules must make allowance for wholesalers, distributors, or retailers who have inventory or stock which was acquired prior to July 1, 1993. The rules must consider appropriate efficiency requirements for motors used infrequently in agricultural and other applications.",
	"repealed": false
}