{
	"id": "477C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/477C.01",
	"title": "477C.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words and terms, for the purposes of this chapter and chapter 423A have the meanings given to them.\n\"Commissioner\" means the commissioner of revenue.\n\"Company\" or \"insurance company\" has the meaning given in section 60A.02, subdivision 4.\n\"Minnesota Aid to Police Premium Report\" means a form for reporting the total gross premiums, less return premiums and dividends, on all direct business received by an insurance company in this state during the preceding calendar year, with reference to insurance written for perils contained in auto insurance coverages as reported to the National Association of Insurance Commissioners and the commissioner of commerce.\n\"Municipal clerk,\" \"municipal clerk-treasurer,\" or \"county auditor\" means:\n(1) the person elected or appointed to the position of municipal clerk, municipal clerk-treasurer, or county auditor or, if there is no such person, the chief financial official or the person primarily responsible for managing the finances of a municipality;\n(2) for a park district, the secretary of the board of park district commissioners;\n(3) for the University of Minnesota, the official designated by the Board of Regents;\n(4) for the Metropolitan Airports Commission, the person designated by the commission;\n(5) for the Departments of Natural Resources and Public Safety, the respective commissioner of the agency; and\n(6) for a tribal police department that exercises state arrest powers under section 626.90, 626.91, 626.92, or 626.93, the person designated by the applicable American Indian tribal government.\n(a) \"Municipality\" means:\n(1) a home rule charter or statutory city;\n(2) an organized town;\n(3) a county;\n(4) a park district subject to chapter 398;\n(5) the University of Minnesota;\n(6) an American Indian tribal government with a tribal police department that exercises state arrest powers under section 626.90, 626.91, 626.92, or 626.93;\n(7) the Metropolitan Airports Commission; and\n(8) the Departments of Natural Resources and Public Safety with respect to peace officers covered under chapter 352B.\n(b) This subdivision only applies to chapter 477C.\n\"Peace officer\" means any person:\n(1) whose primary source of income derived from wages is from direct employment by a municipality as a law enforcement officer on a full-time basis of not less than 30 hours per week;\n(2) who has been employed for a minimum of six months before December 31 preceding the date of the current year's certification under section 477C.02, subdivision 1;\n(3) who is sworn to enforce the general criminal laws of the state and local ordinances;\n(4) who is licensed by the Peace Officers Standards and Training Board and is authorized to arrest with a warrant; and\n(5) who is a member of the State Patrol retirement plan or the public employees police and fire fund.",
	"repealed": false
}