{
	"id": "270C.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.58",
	"title": "270C.58 LIABILITY OF TRANSFEREES AND FIDUCIARIES.",
	"text": "The amounts of the following liabilities are, except as otherwise provided in subdivision 3, assessed, collected, and paid in the same manner and subject to the same provisions and limitations as a deficiency in a tax imposed by chapter 290, including any provisions of law for the collection of taxes:\n(1) the liability, at law or in equity, of a transferee of property of a taxpayer for tax or overpayment of a refund, including interest, additional amounts, and additions to the tax or overpayment provided by law, imposed upon the taxpayer by chapter 290 or provided for in chapter 290A; and\n(2) the liability of a fiduciary under subdivision 2, for the payment of tax from the estate of the taxpayer. The liability may reflect the amount of tax shown on the return or any deficiency in tax.\nA tax imposed by chapter 290 and an overpayment of a refund provided for in chapter 290A, and interest and penalties, is a personal debt of the taxpayer from the time the liability arises, regardless of when the time for discharging the liability by payment occurs. The debt is, in the case of the personal representative of the estate of a decedent and in the case of any fiduciary, that of the individual in the individual's official or fiduciary capacity only, unless the individual has voluntarily distributed the assets held in that capacity without reserving sufficient assets to pay the tax, interest, and penalties, in which event the individual is personally liable for the deficiency.\nThe period of limitation for assessment and collection of any liability of a transferee or fiduciary is as follows:\n(1) In the case of the liability of an initial transferee of the property of the taxpayer, the tax may be assessed within one year after the expiration of the period of limitation of assessment against the taxpayer. The tax may be collected by action brought within one year after the expiration of the period of limitation for the starting of an action against the taxpayer.\n(2) In the case of the liability of the transferee of a transferee of the property of the taxpayer, the tax may be assessed within one year after the expiration of the period of limitation for assessment against the preceding transferee, but only if within 3-1/2 years after the expiration of the period of limitation for assessment against the taxpayer. The tax may be collected by action brought within one year after the expiration of the period of limitation for the starting of an action against the preceding transferee, but only if within four years after the expiration of the period of limitation for bringing an action against the taxpayer; except that if before the expiration of the period of limitation for the assessment of the liability of the transferee a court proceeding for the collection of the tax or liability has been begun against the taxpayer or last preceding transferee, liability of the transferee expires one year after the return of execution in the court proceeding and the period of limitation for collection by action will expire one year after the liability is assessed.\n(3) In the case of the liability of a fiduciary, the tax may be assessed up to one year after the liability arises or not later than the expiration of the period for collection of the tax for which the liability arises, whichever is later, and may be collected by action brought within one year after assessment.\n(4) For the purposes of this subdivision, if the taxpayer is deceased, or in the case of a corporation, has ended its existence, the period of limitation for assessment against the taxpayer will be the period that would be in effect had death or termination of existence not occurred.\nAs used in this subdivision, the term \"transferee\" includes heir, legatee, devisee, and distributee.",
	"repealed": false
}