{
	"id": "120B.305",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.305",
	"title": "120B.305 ASSESSMENT REPORTING REQUIREMENTS.",
	"text": "MS 2023 Supp [Repealed by amendment, 2024 c 109 art 2 s 14]\n(a) Reporting of state assessment results must:\n(1) provide timely, useful, and understandable information on the performance of individual students, schools, school districts, and the state;\n(2) include a growth indicator of student achievement; and\n(3) determine whether students have met the state's academic standards.\n(b) The commissioner must ensure that for annual computer-adaptive assessments:\n(1) individual student performance data and achievement reports are available within three school days of when students take an assessment except in a year when an assessment reflects new performance standards;\n(2) growth information is available for each student from the student's first assessment to each proximate assessment using a constant measurement scale;\n(3) parents, teachers, and school administrators are able to use elementary and middle school student performance data to project students' secondary and postsecondary achievement; and\n(4) useful diagnostic information about areas of students' academic strengths and weaknesses is available to teachers and school administrators for improving student instruction and indicating the specific skills and concepts that should be introduced and developed for students at given performance levels, organized by strands within subject areas, and aligned to state academic standards.\n(c) The commissioner, in consultation with the chancellor of the Minnesota State Colleges and Universities, must establish empirically derived benchmarks on the high school tests that reveal a trajectory toward career and college readiness consistent with section 136F.302, subdivision 1a. The commissioner must disseminate to the public the computer-adaptive assessments and high school test results upon receiving those results.\n(d) A school, school district, or charter school may provide a student's parent access to the student's individual student performance data and achievement report that is made available under paragraph (b), clause (1), when the performance data and report is available to the school, school district, or charter school.\n(a) The commissioner must include the following components in the statewide public reporting system:\n(1) uniform statewide computer-adaptive assessments of all students in grades 3 through 8 and testing at the high school levels that provides appropriate, technically sound accommodations or alternate assessments;\n(2) educational indicators that can be aggregated and compared across school districts and across time on a statewide basis, including consistent attendance, high school graduation rates, and high school drop-out rates by age and grade level;\n(3) state results on the ACT test;\n(4) state results from participation in the National Assessment of Educational Progress so that the state can benchmark its performance against the nation and other states, and, where possible, against other countries, and contribute to the national effort to monitor achievement; and\n(5) comparison of statewide assessment results among school sites and school districts.\n(b) The commissioner shall report test results publicly and to stakeholders, including the performance achievement levels developed from students' unweighted test scores in each tested subject and a listing of demographic factors that strongly correlate with student performance, including student homelessness, as data are available, among other factors. The test results must not include personally identifiable information as defined in Code of Federal Regulations, title 34, section 99.3. The commissioner shall disseminate to schools and school districts a more comprehensive report containing testing information that meets local needs for evaluating instruction and curriculum. The commissioner shall disseminate to charter school authorizers a more comprehensive report containing testing information that contains anonymized data where cell count data are sufficient to protect student identity and that meets the authorizer's needs in fulfilling its obligations under chapter 124E.",
	"repealed": false
}