{
	"id": "97A.126",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.126",
	"title": "97A.126 WALK-IN ACCESS PROGRAM.",
	"text": "A walk-in access program is established to provide public access to wildlife habitat on private land for hunting, bird-watching, nature photography, and similar compatible uses, excluding trapping, as provided under this section. The commissioner may enter into agreements with other units of government and landowners to provide private land hunting access.\n(a) From September 1 to May 31, a person must have a walk-in access validation in possession to hunt, photograph, and watch wildlife on private lands, including agricultural lands, that are posted as being enrolled in the walk-in access program.\n(b) Hunting, bird-watching, nature photography, and similar compatible uses on private lands that are posted as enrolled in the walk-in access program is allowed from one-half hour before sunrise to one-half hour after sunset.\n(c) Access on private lands that are posted as enrolled in the walk-in access program is restricted to nonmotorized use, except by persons with disabilities operating motor vehicles on established trails or field roads who possess a valid permit to shoot from a stationary vehicle under section 97B.055, subdivision 3.\n(d) The general provisions for use of wildlife management areas adopted under sections 86A.06 and 97A.137, relating to overnight use, alcoholic beverages, use of motorboats, firearms and target shooting, hunting stands, abandonment of trash and property, destruction or removal of property, introduction of plants or animals, and animal trespass, apply to use of lands enrolled in the walk-in access program.\n(e) Any use of enrolled lands other than use authorized under this section is prohibited, including:\n(1) harvesting bait, including minnows, leeches, and other live bait;\n(2) training dogs or using dogs for activities other than hunting; and\n(3) constructing or maintaining any building, dock, fence, billboard, sign, hunting blind, or other structure, unless constructed or maintained by the landowner.\nThe fee for a walk-in-access validation is $3.",
	"repealed": false
}