{
	"id": "442A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.05",
	"title": "442A.05 SANITARY DISTRICT ANNEXATION.",
	"text": "(a) A sanitary district annexation may occur under this chapter for any area adjacent to an existing district upon a petition to the chief administrative law judge stating the grounds therefor as provided in this section.\n(b) The proposed annexation area must embrace an area or a group of two or more adjacent areas, whether contiguous or separate, but not situated entirely within the limits of a single municipality. The proposed annexation must promote public health and welfare by providing an adequate and efficient system and means of collecting, conveying, pumping, treating, and disposing of domestic sewage and garbage and industrial wastes within the district. When the chief administrative law judge or the Minnesota Pollution Control Agency finds that there is need throughout the territory for the accomplishment of these purposes, that these purposes can be effectively accomplished on an equitable basis by annexation to a district, and that the creation and maintenance of such annexation will be administratively feasible and in furtherance of the public health, safety, and welfare, the chief administrative law judge shall make an order for sanitary district annexation. An annexation is administratively feasible under this section if the district has the financial and managerial resources needed to deliver adequate and efficient sanitary sewer services within the proposed annexation.\n(c) Notwithstanding paragraph (b), no annexation to a district shall be approved within 25 miles of the boundary of any city of the first class without the approval of the governing body thereof and the approval of the governing body of each and every municipality in the proposed annexation area by resolution filed with the chief administrative law judge.\n(d) If the chief administrative law judge and the Minnesota Pollution Control Agency disagree on the need for a sanitary district annexation, they must determine whether not allowing the sanitary district annexation will have a detrimental effect on the environment. If it is determined that the sanitary district annexation will prevent environmental harm, the sanitary district annexation or connection to an existing wastewater treatment system must occur.\n(a) A proceeding for sanitary district annexation may be initiated by a petition to the chief administrative law judge containing the following:\n(1) a request for proposed annexation to a sanitary district;\n(2) a legal description of the territory of the proposed annexation;\n(3) addresses of every property owner within the existing sanitary district and proposed annexation area boundaries as provided by the county auditor, with certification from the county auditor; two sets of address labels for said owners; and a list of email addresses for said owners, if available;\n(4) a statement showing the existence in such territory of the conditions requisite for annexation to a district as prescribed in subdivision 1;\n(5) a statement of the territorial units represented by and qualifications of the respective signers; and\n(6) the post office address of each signer, given under the signer's signature.\nA petition may consist of separate writings of like effect, each signed by one or more qualified persons, and all such writings, when filed, shall be considered together as a single petition.\n(b) Petitioners must conduct and pay for a public meeting to inform citizens of the proposed annexation to a sanitary district. At the meeting, information must be provided, including a description of the existing sanitary district's structure, bylaws, territory, ordinances, budget, and charges; a description of the existing sanitary district's territory; and a description of the territory of the proposed annexation area. Notice of the meeting must be published for two successive weeks in a qualified newspaper, as defined under chapter 331A, must be published within the territories of the existing sanitary district and proposed annexation area or, if there is no qualified newspaper published within those territories, in a qualified newspaper of general circulation in the territories, and must be posted for two weeks in each territorial unit of the existing sanitary district and proposed annexation area and on the website of the existing sanitary district, if one exists. Notice of the meeting must be mailed or emailed at least three weeks prior to the meeting to all property tax billing addresses for all parcels included in the existing sanitary district and proposed annexation area. The following must be submitted to the chief administrative law judge with the petition:\n(1) a record of the meeting, including copies of all information provided at the meeting;\n(2) a copy of the mailing list provided by the county auditor and used to notify property owners of the meeting;\n(3) a copy of the email list used to notify property owners of the meeting;\n(4) the printer's affidavit of publication of the public meeting notice;\n(5) an affidavit of posting the public meeting notice with information on dates and locations of posting; and\n(6) the minutes or other record of the public meeting documenting the topics discussed; printer's affidavit of publication of each resolution, with a copy of the resolution from the newspaper attached; and the affidavit of resolution posting on the town or existing sanitary district website.\n(c) Every petition must be signed as follows:\n(1) by an authorized officer of the existing sanitary district pursuant to a resolution of the board;\n(2) for each municipality wherein there is a territorial unit of the proposed annexation area, by an authorized officer pursuant to a resolution of the municipal governing body;\n(3) for each organized town wherein there is a territorial unit of the proposed annexation area, by an authorized officer pursuant to a resolution of the town board; and\n(4) for each county wherein there is a territorial unit of the proposed annexation area consisting of an unorganized area, by an authorized officer pursuant to a resolution of the county board or by at least 20 percent of the voters residing and owning land within the unit.\n(d) Each resolution must be published in the official newspaper of the governing body adopting it and becomes effective 40 days after publication, unless within said period there shall be filed with the governing body a petition signed by qualified electors of a territorial unit of the proposed annexation area, equal in number to five percent of the number of electors voting at the last preceding election of the governing body, requesting a referendum on the resolution, in which case the resolution may not become effective until approved by a majority of the qualified electors voting at a regular election or special election that the governing body may call. The notice of an election and the ballot to be used must contain the text of the resolution followed by the question: \"Shall the above resolution be approved?\"\n(e) If any signer is alleged to be a landowner in a territorial unit, a statement as to the signer's landowner status as shown by the county auditor's tax assessment records, certified by the auditor, shall be attached to or endorsed upon the petition.\n(f) At any time before publication of the public notice required in subdivision 4, additional signatures may be added to the petition or amendments of the petition may be made to correct or remedy any error or defect in signature or otherwise except a material error or defect in the description of the territory of the proposed annexation area. If the qualifications of any signer of a petition are challenged, the chief administrative law judge shall determine the challenge forthwith on the allegations of the petition, the county auditor's certificate of land ownership, and such other evidence as may be received.\nDifferent areas may be annexed to a district in a single proceeding upon a joint petition therefor and upon compliance with the provisions of subdivisions 1 and 2 with respect to the area affected so far as applicable.\n(a) Upon receipt of a petition and the record of public meeting required under subdivision 2, the chief administrative law judge shall publish a notice of intent for sanitary district annexation in a newspaper of general circulation within the territories of the existing sanitary district and proposed annexation area, and mail or email information of the publication to each property owner in the affected territory at the owner's address as given by the county auditor. The notice must:\n(1) describe the petition for sanitary district annexation;\n(2) describe the territory affected by the petition;\n(3) allow 30 days for submission of written comments on the petition;\n(4) state that a person who objects to the petition may submit a written request for hearing to the chief administrative law judge within 30 days of the publication of the notice; and\n(5) state that if a timely request for hearing is not received, the chief administrative law judge may make a decision on the petition.\n(b) If 50 or more individual timely requests for hearing are received, the chief administrative law judge must hold a hearing on the petition according to the contested case provisions of chapter 14. The sanitary district or annexation area proposers are responsible for paying all costs involved in publicizing and holding a hearing on the petition.\nIf a hearing is required under subdivision 4, the chief administrative law judge shall designate a time and place for a hearing according to section 442A.13.\n(a) In arriving at a decision, the chief administrative law judge shall consider the following factors:\n(1) administrative feasibility under subdivision 1, paragraph (b);\n(2) public health, safety, and welfare impacts;\n(3) alternatives for managing the public health impacts;\n(4) equities of the petition proposal;\n(5) contours of the petition proposal; and\n(6) public notification of and interaction on the petition proposal.\n(b) Based upon these factors, the chief administrative law judge may order the annexation to the sanitary district on finding that:\n(1) the sanitary district is knowledgeable and experienced in delivering sanitary sewer services to ratepayers and has provided quality service in a fair and cost-effective manner;\n(2) the proposed annexation provides a long-term, equitable solution to pollution problems affecting public health, safety, and welfare;\n(3) property owners within the existing sanitary district and proposed annexation area were provided notice of the proposed district and opportunity to comment on the petition proposal; and\n(4) the petition complied with the requirements of all applicable statutes and rules pertaining to sanitary district annexation.\n(c) The chief administrative law judge may alter the boundaries of the proposed annexation area by increasing or decreasing the area to be included or may exclude property that may be better served by another unit of government. The chief administrative law judge may also alter the boundaries of the proposed annexation area so as to follow visible, clearly recognizable physical features for municipal boundaries.\n(d) The chief administrative law judge may deny sanitary district annexation if the area, or a part thereof, would be better served by an alternative method.\n(e) In all cases, the chief administrative law judge shall set forth the factors that are the basis for the decision.\n(a) After the public notice period or the public hearing, if required under subdivision 4, and based on the petition, any public comments received, and, if a hearing was held, the hearing record, the chief administrative law judge shall make findings of fact and conclusions determining whether the conditions requisite for the sanitary district annexation exist in the territory described in the petition. If the chief administrative law judge finds that conditions exist, the judge may make an order for sanitary district annexation for the territory described in the petition.\n(b) All taxable property within the annexed area shall be subject to taxation for any existing bonded indebtedness or other indebtedness of the district for the cost of acquisition, construction, or improvement of any disposal system or other works or facilities beneficial to the annexed area to such extent as the chief administrative law judge may determine to be just and equitable, to be specified in the order for annexation. The proper officers shall levy further taxes on such property accordingly.\nIf the chief administrative law judge, after conclusion of the public notice period or holding a hearing, if required, determines that the sanitary district annexation in the territory described in the petition is not warranted, the judge shall make an order denying the petition. The chief administrative law judge shall give notice of the denial by mail or email to each signer of the petition. No petition for a sanitary district annexation consisting of the same territory shall be entertained within a year after the date of an order under this subdivision. Nothing in this subdivision precludes action on a petition for a sanitary district annexation embracing part of the territory with or without other territory.\nThe chief administrative law judge shall publish in a newspaper of general circulation within the territory of the proposed district, a notice of the final order for sanitary district annexation, referring to the date of the order and describing the territory of the annexation area, and shall mail or email a notice of final order for sanitary district annexation to each property owner in the affected territory at the owner's address as given by the county auditor. The notice must:\n(1) describe the petition for annexation to the district;\n(2) describe the territory affected by the petition; and\n(3) state that a certified copy of the order shall be delivered to the secretary of state for filing ten days after publication of the notice of the order.\nTen days after mailing notice of the order, the chief administrative law judge shall deliver a certified copy of the order to the secretary of state for filing. Thereupon, the sanitary district annexation is deemed complete, and it shall be conclusively presumed that all requirements of law relating thereto have been complied with. The chief administrative law judge shall also transmit a certified copy of the order for filing to the county auditor of each county and the clerk or recorder of each municipality and organized town wherein any part of the territory of the district, including the newly annexed area, is situated and to the secretary of the district board.",
	"repealed": false
}