{
	"id": "473.551",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.551",
	"title": "473.551 DEFINITIONS.",
	"text": "For the purposes of sections 473.551 to 473.599, the following terms shall have the meanings given in this section.\n\"Cities\" means the cities of Minneapolis, Bloomington, and Richfield.\n\"Commission\" means the Metropolitan Sports Facilities Commission.\n\"Metrodome debt service\" means the principal and interest due each year on all bonds or revenue anticipation certificates issued by the council under section 473.581.\n\"Metropolitan sports area\" means the real estate in the city of Bloomington described in the ownership and operations agreement, and all buildings, structures, improvements and equipment thereon including the met center, owned by the cities on May 17, 1977, the date of enactment of sections 473.551 to 473.595, and since transferred to the commission pursuant to sections 473.551 to 473.595.\n\"Metropolitan Sports Area Commission\" means that commission established by an ownership and operations agreement made and entered into as of August 13, 1954, validated by Laws 1955, Chapter 445, to which the cities were parties on May 17, 1977.\n\"Multipurpose sports facility\" means a single unit sports facility suitable for university or major league professional baseball, football, and soccer.\n\"Sports facility\" or \"sports facilities\" means real or personal property comprising a stadium, stadiums, or arenas suitable for university or major league professional baseball, for university or major league professional football and soccer, or for both, or for university or major league hockey or basketball, or for both, together with adjacent parking facilities, including on the effective date of Laws 1994, chapter 648, the metrodome, the met center, and, upon acquisition by the commission, the basketball and hockey arena.\n\"Metrodome\" means the Hubert H. Humphrey Metrodome located in the city of Minneapolis constructed and owned by the commission and financed by the bonds of the council issued pursuant to sections 473.551 to 473.595, including all real estate, buildings, improvements, and equipment in and on them.\n\"Basketball and hockey arena\" means the indoor arena building currently occupied and utilized for the playing of university or major league basketball, hockey, and other purposes located in the city of Minneapolis, including all improvements and equipment in the arena and the leasehold or other interest in the arena land appurtenant to the arena, but excluding the health club.\n\"Health club\" means that separate portion of the basketball and hockey arena building occupied and utilized by a private sports and health club on the effective date of Laws 1994, chapter 648, the improvements and equipment in and on it, and the leasehold or other interest in the arena land appurtenant to it.\n\"Met Center\" means the real estate in the city of Bloomington presently owned by the commission, formerly utilized for major league hockey, and all buildings, improvements, and equipment in and on it.\n\"Development agreement\" means the second amended and restated development agreement among the Minneapolis Community Development Agency, Northwest Racquet, Swim & Health Clubs, Inc., and the city of Minneapolis dated August 5, 1988, and as amended before the effective date of Laws 1994, chapter 648.\n\"Ground lease\" means the ground lease of the arena land between the Minneapolis Community Development Agency and Northwest Racquet, Swim & Health Clubs, Inc., dated August 5, 1988, and as amended before the effective date of Laws 1994, chapter 648.\n\"Guarantors\" means the individuals who have guaranteed to the Minneapolis Community Development Agency and the city of Minneapolis the performance of the development agreement, ground lease, and certain other obligations pursuant to written guaranty dated February 17, 1988.\n\"Arena land\" means the real estate upon which the basketball and hockey arena and health club have been constructed and any adjacent parcel or parcels which are owned by the city of Minneapolis and subject to the development agreement or the ground lease and all rights, privileges, and easements appertaining to it.\n\"Basketball and hockey arena debt service\" means the principal and interest due each year on all bonds or revenue anticipation certificates issued by the council under section 473.599.",
	"repealed": false
}