{
	"id": "171.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.27",
	"title": "171.27 LICENSE EXPIRATION AND RENEWAL; EXCEPTIONS.",
	"text": "(a) Except as otherwise provided in this section, the expiration date for each driver's license is the birthday of the driver in the fourth year following the date of issuance of the license. The birthday of the driver shall be as indicated on the application for a driver's license. A license may be renewed on or before expiration or within one year after expiration upon application, payment of the required fee, and passing the examination required of all drivers for renewal. Driving privileges shall be extended or renewed on or preceding the expiration date of an existing driver's license unless the commissioner believes that the licensee is no longer qualified as a driver.\n(b) The expiration date for each under-21 license shall be the 21st birthday of the licensee. Upon the licensee attaining the age of 21 and upon the application, payment of the required fee, and passing the examination required of all drivers for renewal, a driver's license shall be issued unless the commissioner determines that the licensee is no longer qualified as a driver.\n(c) The expiration date for each provisional license is two years after the date of application for the provisional license.\n(d) Notwithstanding paragraphs (a) to (c), the expiration date for a license issued to a person with temporary lawful status is the last day of the person's legal stay in the United States, or one year after issuance if the last day of the person's legal stay is not identified.\n(a) For purposes of this subdivision, \"eligible individual\" means:\n(1) a person then or subsequently serving outside Minnesota in active military service, as defined in section 190.05, subdivision 5, in any branch or unit of the armed forces of the United States;\n(2) a person then or subsequently serving outside Minnesota as a volunteer in the Peace Corps;\n(3) a person who is an employee of a federal department or agency and is assigned to foreign service outside of the United States; or\n(4) a person residing outside of Minnesota because the person is a spouse, domestic partner, or dependent under age 26 of a person in clause (1), (2), or (3).\n(b) A valid Minnesota driver's license issued to an eligible individual continues in full force and effect without requirement for renewal until the date one year following the person's separation or discharge from active military or volunteer service, or following the conclusion of assignment to foreign service outside the United States, and until the license holder's birthday in the fourth full year following the person's most recent license renewal or, in the case of a provisional license, until the person's birthday in the third full year following the renewal.",
	"repealed": false
}