{
	"id": "12.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.25",
	"title": "12.25 LOCAL ORGANIZATIONS; DIRECTORS, DUTIES.",
	"text": "Each political subdivision shall establish a local organization for emergency management in accordance with the state emergency management program, but no town shall establish a local organization for emergency management without approval of the state director. Each local organization for emergency management must have a director appointed forthwith: in a city by the mayor, in a town by the town board, and for a public corporation organized and existing under sections 473.601 to 473.679 by its governing body. The local director is directly responsible for the organization, administration, and operation of the local organization for emergency management, subject to the direction and control of the local governing body.\n(a) Each county emergency management organization must have a director and one or more deputy directors. They must be appointed by the county board.\n(b) A county organization for emergency management has jurisdiction throughout the county outside of a city or of a town that has a local emergency management organization.\n(c) In addition to the other powers granted by this subdivision, county organizations shall:\n(1) coordinate the activities of and may assist in the training of emergency management organizations of political subdivisions throughout the county;\n(2) plan for the emergency operations of county government in cooperation with the county attorney, who shall give legal advice to the county organization, and with other appropriate county government officials and private sector representatives;\n(3) acquire equipment necessary in connection with these activities; and\n(4) expend funds provided by the county board out of general revenue funds for such purposes.\nEach local and county organization for emergency management shall perform emergency management functions within the territorial limits of the political subdivision within which it is organized and, in addition, shall conduct these functions outside of its territorial limits as may be required pursuant to sections 12.23, 12.27, and 12.32 or any other applicable law.\nMS 1978 [Repealed, 1979 c 65 s 3]\nWith approval of the state director, two or more political subdivisions may enter into agreements determining the boundaries of the geographic areas of their respective emergency management responsibilities or providing for a common emergency management organization, which for the purposes of this chapter must be a local emergency management organization.",
	"repealed": false
}