{
	"id": "245.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.94",
	"title": "245.94 POWERS OF OMBUDSMAN; REVIEWS AND EVALUATIONS; RECOMMENDATIONS.",
	"text": "(a) The ombudsman may prescribe the methods by which complaints to the office are to be made, reviewed, and acted upon. The ombudsman may not levy a complaint fee.\n(b) The ombudsman is a health oversight agency as defined in Code of Federal Regulations, title 45, section 164.501. The ombudsman may access patient records according to Code of Federal Regulations, title 42, section 2.53. For purposes of this paragraph, \"records\" has the meaning given in Code of Federal Regulations, title 42, section 2.53(a)(1)(i).\n(c) The ombudsman may mediate or advocate on behalf of a client.\n(d) The ombudsman may investigate the quality of services provided to clients and determine the extent to which quality assurance mechanisms within state and county government work to promote the health, safety, and welfare of clients.\n(e) At the request of a client, or upon receiving a complaint or other information affording reasonable grounds to believe that the rights of one or more clients who may not be capable of requesting assistance have been adversely affected, the ombudsman may gather information and data about and analyze, on behalf of the client, the actions of an agency, facility, or program.\n(f) The ombudsman may gather, on behalf of one or more clients, records of an agency, facility, or program, or records related to clinical drug trials from the University of Minnesota Department of Psychiatry, if the records relate to a matter that is within the scope of the ombudsman's authority. If the records are private and the client is capable of providing consent, the ombudsman shall first obtain the client's consent. The ombudsman is not required to obtain consent for access to private data on clients with developmental disabilities and individuals served by the Minnesota Sex Offender Program. The ombudsman may also take photographic or videographic evidence while reviewing the actions of an agency, facility, or program, with the consent of the client. The ombudsman is not required to obtain consent for access to private data on decedents who were receiving services for mental illness, developmental disability, substance use disorder, or emotional disturbance. All data collected, created, received, or maintained by the ombudsman are governed by chapter 13 and other applicable law.\n(g) Notwithstanding any law to the contrary, the ombudsman may subpoena a person to appear, give testimony, or produce documents or other evidence that the ombudsman considers relevant to a matter under inquiry. The ombudsman may petition the appropriate court in Ramsey County to enforce the subpoena. A witness who is at a hearing or is part of an investigation possesses the same privileges that a witness possesses in the courts or under the law of this state. Data obtained from a person under this paragraph are private data as defined in section 13.02, subdivision 12.\n(h) The ombudsman may, at reasonable times in the course of conducting a review, enter and view premises within the control of an agency, facility, or program.\n(i) The ombudsman may attend Direct Care and Treatment Review Board and Special Review Board proceedings; proceedings regarding the transfer of clients, as defined in section 246.50, subdivision 4, between institutions operated by the Direct Care and Treatment executive board; and, subject to the consent of the affected client, other proceedings affecting the rights of clients. The ombudsman is not required to obtain consent to attend meetings or proceedings and have access to private data on clients with developmental disabilities and individuals served by the Minnesota Sex Offender Program.\n(j) The ombudsman shall gather data of agencies, facilities, or programs classified as private or confidential as defined in section 13.02, subdivisions 3 and 12, regarding services provided to clients with developmental disabilities and individuals served by the Minnesota Sex Offender Program.\n(k) To avoid duplication and preserve evidence, the ombudsman shall inform relevant licensing or regulatory officials before undertaking a review of an action of the facility or program.\n(l) The Office of Ombudsman shall provide the services of the Civil Commitment Training and Resource Center.\n(m) The ombudsman shall monitor the treatment of individuals participating in a University of Minnesota Department of Psychiatry clinical drug trial and ensure that all protections for human subjects required by federal law and the Institutional Review Board are provided.\n(n) Sections 245.91 to 245.97 are in addition to other provisions of law under which any other remedy or right is provided.\n(a) In selecting matters for review by the office, the ombudsman shall give particular attention to unusual deaths or injuries of a client or reports of emergency use of manual restraint as identified in section 245D.061, served by an agency, facility, or program, or actions of an agency, facility, or program that:\n(1) may be contrary to law or rule;\n(2) may be unreasonable, unfair, oppressive, or inconsistent with a policy or order of an agency, facility, or program;\n(3) may be mistaken in law or arbitrary in the ascertainment of facts;\n(4) may be unclear or inadequately explained, when reasons should have been revealed;\n(5) may result in abuse or neglect of a person receiving treatment;\n(6) may disregard the rights of a client or other individual served by an agency or facility;\n(7) may impede or promote independence, community integration, and productivity for clients; or\n(8) may impede or improve the monitoring or evaluation of services provided to clients.\n(b) The ombudsman shall, in selecting matters for review and in the course of the review, avoid duplicating other investigations or regulatory efforts.\n(c) The ombudsman shall give particular attention to the death or unusual injury of any individual who is participating in a University of Minnesota Department of Psychiatry clinical drug trial.\nWithin 24 hours after a client suffers death or serious injury, the agency, facility, program director, or lead investigator of a clinical drug trial at the University of Minnesota Department of Psychiatry shall notify the ombudsman of the death or serious injury. The emergency use of manual restraint must be reported to the ombudsman as required under section 245D.061, subdivision 8. The ombudsman is authorized to receive identifying information about a deceased client according to Code of Federal Regulations, title 42, section 2.15, paragraph (b).\n(a) The ombudsman may receive a complaint from any source concerning an action of an agency, facility, or program. After completing a review, the ombudsman shall inform the complainant and the agency, facility, or program. No client may be punished nor may the general condition of the client's treatment be unfavorably altered as a result of an investigation, a complaint by the client, or by another person on the client's behalf. An agency, facility, or program shall not retaliate or take adverse action against a client or other person, who in good faith makes a complaint or assists in an investigation. The ombudsman may classify as confidential, the identity of a complainant, upon request of the complainant.\n(b) The ombudsman shall receive a complaint from any source concerning an action or inaction of the University of Minnesota Department of Psychiatry related to an individual who is enrolled in a department-approved clinical drug trial. No individual participating in the trial may be punished, nor may the general condition of the individual's treatment be unfavorably altered, as a result of an investigation or a complaint by the individual or the individual's advocate. The university shall not retaliate or take adverse action against any person who in good faith makes a complaint or assists in an investigation. The ombudsman may classify the identity of the complainant as confidential, upon request of the complainant.\n(a) If, after reviewing a complaint or conducting an investigation and considering the response of an agency, facility, or program and any other pertinent material, the ombudsman determines that the complaint has merit or the investigation reveals a problem, the ombudsman may recommend that the agency, facility, or program:\n(1) consider the matter further;\n(2) modify or cancel its actions;\n(3) alter a rule, order, or internal policy;\n(4) explain more fully the action in question; or\n(5) take other action.\n(b) At the ombudsman's request, the agency, facility, or program shall, within a reasonable time, inform the ombudsman about the action taken on the recommendation or the reasons for not complying with it.\nIf, after reviewing a complaint or conducting an investigation and considering the response of the clinical drug trial's primary investigator or the Department of Psychiatry, the ombudsman determines that the complaint has merit or the investigation reveals noncompliance with the federal protection of human subjects requirements or the requirements of the Institutional Review Board, the ombudsman shall recommend that the Board of Regents of the University of Minnesota take corrective action to remedy the violations.",
	"repealed": false
}