{
	"id": "340A.402",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.402",
	"title": "340A.402 PERSONS ELIGIBLE.",
	"text": "No retail license may be issued to:\n(1) a person under 21 years of age;\n(2) a person who has had an intoxicating liquor or 3.2 percent malt liquor license revoked within five years of the license application, or to any person who at the time of the violation owns any interest, whether as a holder of more than five percent of the capital stock of a corporation licensee, as a partner or otherwise, in the premises or in the business conducted thereon, or to a corporation, partnership, association, enterprise, business, or firm in which any such person is in any manner interested;\n(3) a person not of good moral character and repute;\n(4) a person who:\n(i) has had a license or registration issued pursuant to chapter 342 or section 151.72, subdivision 5b, revoked;\n(ii) has been convicted of an offense under section 151.72, subdivision 7; or\n(iii) has been convicted under any other statute for the illegal sale of marijuana, cannabis flower, cannabis products, lower-potency hemp edibles, hemp-derived consumer products, or edible cannabinoid products and the sale took place on the premises of a business that sells intoxicating liquor or 3.2 percent malt liquor to customers; or\n(5) a person who has a direct or indirect interest in a manufacturer, brewer, or wholesaler.\nIn addition, no new retail license may be issued to, and the governing body of a municipality may refuse to renew the license of, a person who, within five years of the license application, has been convicted of a felony or a willful violation of a federal or state law or local ordinance governing the manufacture, sale, distribution, or possession for sale or distribution of an alcoholic beverage. The Alcohol and Gambling Enforcement Division or licensing authority may require that fingerprints be taken and forwarded to the Federal Bureau of Investigation for purposes of a criminal history check.\n(a) A retail liquor license may be issued by a city, a county, or the commissioner. The chief of police is responsible for the background checks prior to a city issuing a retail liquor license. A county sheriff is responsible for the background checks prior to the county issuing a retail liquor license and for those cities that do not have a police department. The commissioner is responsible for the background checks prior to the state issuing a retail liquor license.\n(b) The applicant for a retail license must provide the appropriate authority with the applicant's signed, written informed consent to conduct a background check. The appropriate authority is authorized to query the Minnesota criminal history repository for records on the applicant. If the appropriate authority conducts a national criminal history records check, the appropriate authority must obtain fingerprints from the applicant and forward the fingerprints and the required fee to the superintendent of the Bureau of Criminal Apprehension. The superintendent may exchange the fingerprints with the Federal Bureau of Investigation for purposes of obtaining the applicant's national criminal history record information. The superintendent shall return the results of the national criminal history records check to the appropriate authority for the purpose of determining if the applicant is qualified to receive a license.",
	"repealed": false
}