{
	"id": "93.483",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.483",
	"title": "93.483 CONTESTED CASE.",
	"text": "Any person owning property that will be affected by the proposed operation or any federal, state, or local government having responsibilities affected by the proposed operation identified in the application for a permit to mine under section 93.481 may file a petition with the commissioner to hold a contested case hearing on the completed application. To be considered by the commissioner, a petition must be submitted in writing, must contain the information specified in subdivision 2, and must be submitted to the commissioner within 30 days after the application is deemed complete and filed. In addition, the commissioner may, on the commissioner's own motion, order a contested case hearing on the completed application.\n(a) A petition for a contested case hearing must include the following information:\n(1) a statement of reasons or proposed findings supporting the commissioner's decision to hold a contested case hearing pursuant to the criteria in subdivision 3; and\n(2) a statement of the issues proposed to be addressed by a contested case hearing and the specific relief requested or resolution of the matter.\n(b) To the extent known by the petitioner, a petition for a contested case hearing may also include:\n(1) a proposed list of prospective witnesses to be called, including experts, with a brief description of the proposed testimony or a summary of evidence to be presented at a contested case hearing;\n(2) a proposed list of publications, references, or studies to be introduced and relied upon at a contested case hearing; and\n(3) an estimate of time required for the petitioner to present the matter at a contested case hearing.\n(c) A petitioner is not bound or limited to the witnesses, materials, or estimated time identified in the petition if the requested contested case is granted by the commissioner.\n(d) Any person may serve timely responses to a petition for a contested case hearing. The commissioner shall establish deadlines for responses to be submitted.\n(a) The commissioner must grant the petition to hold a contested case hearing or order upon the commissioner's own motion that a contested case hearing be held if the commissioner finds that:\n(1) there is a material issue of fact in dispute concerning the completed application before the commissioner;\n(2) the commissioner has jurisdiction to make a determination on the disputed material issue of fact; and\n(3) there is a reasonable basis underlying a disputed material issue of fact so that a contested case hearing would allow the introduction of information that would aid the commissioner in resolving the disputed facts in order to make a final decision on the completed application.\n(b) The commissioner must make the determination of whether to grant a petition or otherwise order a contested case hearing within 120 days after the commissioner deems the application complete and filed.\nThe applicant may, within 30 days after the application is deemed complete and filed, submit a request for a contested case. Within 30 days of the applicant's request, the commissioner shall grant the petition and initiate the contested case hearing process.\nIf the commissioner decides to hold a contested case hearing, the commissioner shall identify the issues to be resolved and limit the scope and conduct of the hearing in accordance with applicable law, due process, and fundamental fairness. The commissioner may, before granting or ordering a contested case hearing, develop a proposed permit or permit conditions to inform the contested case. The contested case hearing must be conducted in accordance with sections 14.57 to 14.62. The final decision by the commissioner to grant, with or without modifications or conditions, or deny the application after a contested case shall constitute a final order for purposes of section 93.50.",
	"repealed": false
}