{
	"id": "126C.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.65",
	"title": "126C.65 FUND ESTABLISHED; DIVISION INTO ACCOUNTS.",
	"text": "A \"maximum effort school loan fund\" for administration of moneys to be received and disbursed as authorized and required by sections 126C.61 to 126C.72 must be maintained in the state treasury. The fund must be divided into three accounts for the purposes specified in subdivisions 2, 3, 4, and 5.\nMS 2018 [Repealed, 5Sp2020 c 3 art 5 s 40]\nA capital loan account must be maintained out of which loans under section 126C.69 must be made. On November 1 all moneys in the debt service loan account in excess of those for debt service loans then agreed to be made must be transferred to the capital loan account. On July 1, all moneys in the capital loan account in excess of those required for capital loans theretofore agreed to be made must be transferred to the debt service loan account.\nA loan repayment account must be maintained. All principal and interest paid by districts on debt service loans and capital loans made under section 126C.69 must be paid into the account. The state's cost of administering the Maximum Effort School Aid Law must be paid out of this account, to an amount not exceeding $10,000 in any year. As soon as possible in each year after the committee has determined the ratio existing between the correct market value of all taxable property in each school district in the state and the \"market value in money\" of such property as recorded in accordance with section 270C.91, the commissioner of revenue shall prepare a list of all such ratios. The clerical costs of preparing the list must be paid as a cost of administration of the Maximum Effort School Aid Law. The Documents Division of the Department of Administration may publish and sell copies of the list. The sums required to pay the principal of and interest on all school loan bonds as provided in section 126C.72 must be transferred out of the loan repayment account to the state bond fund.\nThe commissioner shall transfer from the loan repayment account to the credit of the debt service loan account on November 1 of each year all money deposited to the credit of the loan repayment account that is not required for the payment of principal and interest and costs as prescribed in subdivision 4 but that is needed for debt service loans in the fiscal year beginning July 1, and those moneys are annually appropriated to that account for the purposes prescribed by the Maximum Effort School Aid Law. Money deposited to the credit of the loan repayment account and not required for the transfers or for the payment of principal and interest due on school loan bonds may be invested and reinvested in securities which are general obligations of the United States or the state of Minnesota. When all school loan bonds have been fully paid with interest accrued thereon, the balance remaining in the account must be transferred to the state bond fund.",
	"repealed": false
}