{
	"id": "62J.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.90",
	"title": "62J.90 PRESCRIPTION DRUG PRICE INFORMATION; DECISION TO CONDUCT COST REVIEW.",
	"text": "(a) The commissioner of health shall provide to the board the information reported to the commissioner by drug manufacturers under section 62J.84, subdivisions 3, 4, and 5. The commissioner shall provide this information to the board within 30 days of the date the information is received from drug manufacturers.\n(b) The board may subscribe to one or more prescription drug pricing files, such as Medispan or FirstDatabank, or as otherwise determined by the board.\n(a) The board, in consultation with the advisory council, shall identify selected prescription drug products based on the following criteria:\n(1) brand name drugs or biologics for which the WAC increases by more than 15 percent or by more than $3,000 during any 12-month period or course of treatment if less than 12 months, after adjusting for changes in the consumer price index (CPI);\n(2) brand name drugs or biologics with a WAC of $60,000 or more per calendar year or per course of treatment;\n(3) biosimilar drugs that have a WAC that is not at least 20 percent lower than the referenced brand name biologic at the time the biosimilar is introduced; and\n(4) generic drugs for which the WAC:\n(i) is $100 or more, after adjusting for changes in the CPI, for:\n(A) a 30-day supply;\n(B) a course of treatment lasting less than 30 days; or\n(C) one unit of the drug, if the labeling approved by the Food and Drug Administration does not recommend a finite dosage; and\n(ii) increased by 200 percent or more during the immediate preceding 12-month period, as determined by the difference between the resulting WAC and the average WAC reported over the preceding 12 months, after adjusting for changes in the CPI.\nThe board is not required to identify all prescription drug products that meet the criteria in this paragraph.\n(b) The board, in consultation with the advisory council and the commissioner of health, may identify prescription drug products not described in paragraph (a) that may impose costs that create significant affordability challenges for the state health care system or for patients, including but not limited to drugs to address public health emergencies.\n(c) The board shall make available to the public the names and related price information of the prescription drug products identified under this subdivision, with the exception of information determined by the board to be proprietary under the standards developed by the board under section 62J.91, subdivision 3, and information provided by the commissioner of health classified as not public data under section 13.02, subdivision 8a, or as trade secret information under section 13.37, subdivision 1, paragraph (b), or as trade secret information under the Defend Trade Secrets Act of 2016, United States Code, title 18, section 1836, as amended.\n(a) The board may initiate a cost review of a prescription drug product identified by the board under this section.\n(b) The board shall consider requests by the public for the board to proceed with a cost review of any prescription drug product identified under this section.\n(c) If there is no consensus among the members of the board on whether to initiate a cost review of a prescription drug product, any member of the board may request a vote to determine whether to review the cost of the prescription drug product.",
	"repealed": false
}