{
	"id": "169.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.51",
	"title": "169.51 CLEARANCE AND MARKER LAMPS.",
	"text": "(a) Every motor vehicle or motor-drawn vehicle designed or used for the transportation of property, or for the transportation of passengers for compensation, shall display lighted lamps, as required in this section.\n(b) Every such vehicle having a width, including load thereon, at any part in excess of 80 inches shall be equipped with four clearance lamps, two located on the front at opposite sides and not more than six inches from the extreme outer edge of the vehicle or load, displaying a white or amber light visible from a distance of 500 feet to the front of the vehicle, and two located on the rear on opposite sides not more than six inches from the extreme outer edge of the vehicle or load, displaying a red light visible from a distance of 500 feet to the rear of the vehicle. The front clearance lamps shall be located at a height of not less than 24 inches above the headlamp centers. The rear clearance lamps shall be in addition to the red rear lamp hereinbefore required.\n(c) Every such vehicle or combination of such vehicles which exceeds 30 feet in overall length shall be equipped with at least four side marker lamps, one on each side near the front and one on each side near the rear. Such lamps shall be at a height of not less than 24 inches above the surface upon which the vehicle stands. The lamps near the front shall display a white or amber light and lamps near the rear shall display a red light, each visible from a distance of 500 feet to the side of the vehicle on which it is located. If the clearance lamps on the right and left sides of the vehicle, as hereinbefore required, display lights visible from a distance of 500 feet at right angles to the right and left side, respectively, of the vehicle, they shall be deemed to meet the requirements as to marker lamps, provided an additional marker lamp, white or amber, is displayed approximately midway between the above specified marker lamps.",
	"repealed": false
}