{
	"id": "176.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.285",
	"title": "176.285 SERVICE OF PAPERS AND NOTICES; ELECTRONIC FILING.",
	"text": "Service of documents shall be by first class United States mail or personal service, except where electronic service is authorized or required under this section and section 176.275. An employee cannot be required to accept electronic service where service on the employee is required. Where service is by mail, service is effected at the time mailed if properly addressed and stamped. If it is so mailed, it is presumed the paper or notice reached the party to be served. However, a party may show by competent evidence that that party did not receive it or that it had been delayed in transit for an unusual or unreasonable period of time. In case of nonreceipt or delay, an allowance shall be made for the party's failure to assert a right within the prescribed time.\n(a) Where a statute or rule authorizes or requires a document to be filed with or served on the office, the document must be filed electronically in the manner and in the format specified by the office. Where a statute or rule authorizes or requires a document to be filed with or served on the commissioner or the Workers' Compensation Court of Appeals, the document must be filed electronically in the manner and format specified by the commissioner. An employee must not be required to file a document electronically at any agency unless the document is filed by an attorney on behalf of the employee.\n(b) If electronic filing of a document is required under this subdivision and a statute or rule requires a copy of the document to be provided or served on another person or party, the document filed electronically with the agency and provided or served on the other person or party must contain the same information in the format required by the agency.\n(c) For purposes of serving on and filing with an agency under this chapter, \"electronic\" and \"electronically\" excludes facsimile and email unless authorized by the agency. A document is deemed filed with an agency on the business day it is accepted for filing on or before 11:59 p.m.\n(a) Where a statute or rule authorizes or requires a person's signature on a document to be filed with or served on an agency, the signature may be an electronic signature, as defined by section 325L.02, or transmitted electronically, if authorized by the agency and if the signature is transmitted in the manner and format specified by the agency. The commissioner may require that a document authorized or required to be filed with the commissioner, department, or division be filed electronically in the manner and format specified by the commissioner, except that an employee must not be required to file a document electronically unless the document is filed by an attorney on behalf of an employee. The department, Workers Compensation Court of Appeals, or office may adopt rules for the certification of signatures. Section 14.125 does not apply to the rulemaking authority under this section.\n(b) If a rehabilitation provider files a rehabilitation plan or other document that requires the signature of the employee, employer, or insurer pursuant to section 176.102, or rules adopted under section 176.102, the rehabilitation provider shall specify whether each party's signature has been obtained. The rehabilitation provider must retain the document with the original signature or signatures of the employee and insurer or self-insured employer for five years after the rehabilitation plan is closed and must make the signed document available to the commissioner or compensation judge upon request.\n(a) The office and a party may electronically serve through the office's case management system a document required to be served on a party or filed with the office on any person with an account in the case management system.\n(b) The commissioner, the Workers' Compensation Court of Appeals, and a party may electronically serve through CAMPUS a document required to be served on a party or filed with the commissioner on any person with an account in CAMPUS under section 176.2612. Service through CAMPUS must be either by secure email or by emailing a notice that the document may be accessed through a web portal. Service of a document through CAMPUS on an attorney for a party is considered to be service on the party, except where service on the employee is specifically required by this chapter.\n(c) An employee must not be electronically served unless the employee has created an account and has agreed to accept electronic service through the office's case management system or CAMPUS.\n(d) The date of electronic service of a document is the date the recipient is sent a document electronically, or the date the recipient is notified that the document is available on a website, whichever occurs first.\nWhen the electronic filing of a legal document with an agency marks the beginning of a prescribed time for another party to assert a right, the prescribed time for another party to assert a right shall be extended by two calendar days when it can be shown that service to another party was by United States mail, and extended by one business day if the document was electronically served on the party in CAMPUS or the office's case management system after 4:30 p.m.\n(a) The commissioner, the chief administrative law judge, and the chief judge of the Workers' Compensation Court of Appeals shall ensure that proof of service of all papers and notices served by their respective agencies is transmitted to the division file in the manner described in section 176.281.\n(b) If a document unrelated to a dispute, such as a first report of injury, is required to be filed with the commissioner and required to be served on the employee or other party, the serving party must retain the proof of service and provide it to the commissioner or compensation judge upon request.\n(a) For purposes of this section, \"payer\" means a workers' compensation insurer, self-insurer employer, or third-party administrator.\n(b) Except as otherwise modified by this chapter, the provisions of chapter 325L apply to electronic signatures and the electronic transmission of documents under this chapter.",
	"repealed": false
}