{
	"id": "53C.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.08",
	"title": "53C.08 MOTOR VEHICLE RETAIL INSTALLMENT CONTRACT.",
	"text": "(a) Every retail installment contract shall be in writing, shall contain all the agreements of the parties, shall be signed by the retail buyer and seller, and a copy signed by the retail buyer shall be furnished to such retail buyer at the time the retail buyer executes the contract. The copy signed by both the retail buyer and retail seller shall be provided to the retail buyer within seven days after delivery of the vehicle. With respect to any contract executed prior to August 1, 1996, which has not been paid in full by the retail buyer, the retail seller shall provide such retail buyer a copy signed by both the retail buyer and retail seller within 120 days after August 1, 1996.\n(b) No provisions for confession of judgment or power of attorney therefor contained in any retail installment contract or contained in a separate agreement relating thereto, shall be valid or enforceable.\n(c) The holder of a precomputed retail installment contract may, if the contract so provides, collect a delinquency and collection charge on each installment in arrears for a period not less than ten days in an amount not in excess of five percent of each installment or $5, whichever is greater. In addition to such delinquency and collection charge, the retail installment contract, whether interest-bearing or precomputed, may provide for the payment of attorneys' fees not exceeding 15 percent of the amount due and payable under such contract where such contract is referred to an attorney not a salaried employee of the holder of the contract for collection plus the court costs.\n(d) Unless written notice has been given to the retail buyer of actual or intended assignment of a retail installment contract, payment thereunder or tender thereof made by the retail buyer to the last known holder of such contract shall be binding upon all subsequent holders or assignees.\n(e) Upon written request from the retail buyer, the holder of the retail installment contract shall give or forward to the retail buyer a written statement of the dates and amounts of payments and the total amount unpaid under such contract. A retail buyer shall be given a written receipt for any payment when made in cash.\nPrior to the execution of a retail installment contract, the seller shall provide to a buyer, and obtain the buyer's signature on, a written disclosure that sets forth the following information:\n(1) a description and the total price of all items sold in the following categories if the contract includes a charge for the item:\n(i) a service contract;\n(ii) an insurance product;\n(iii) a debt cancellation agreement;\n(iv) a theft deterrent device; or\n(v) a surface protection product;\n(2) whether a GPS starter interrupt device is installed on the motor vehicle, regardless of whether the contract includes a charge for the GPS starter interrupt device;\n(3) the amount that would be calculated under the contract as the regular installment payment if charges for the items referenced under clause (1) are not included in the contract;\n(4) the amount that would be calculated under the contract as the regular installment payment if charges for the items referenced under clause (1) are included in the contract; and\n(5) the disclosures required under this subdivision must be in at least ten-point type and must be contained in a single document that is separate from the retail installment contract and any other vehicle purchase documents.\nThe retail installment contract shall contain the following items:\n(1) the cash sale price of the motor vehicle which is the subject matter of the retail installment contract;\n(2) the total amount of the retail buyer's down payment, whether made in money or goods, or partly in money or partly in goods;\n(3) the difference between clauses (1) and (2);\n(4) the amount, if any, included in the transaction but not included in clause (1) to pay the balance of an existing purchase money motor vehicle lien which exceeds the value of the trade-in amount, to discharge an interest in an existing motor vehicle lease, for any insurance, specifying the types of coverage, taxes, fees, and charges that actually are or will be paid to public officials or government agencies, including those for perfecting, releasing, or satisfying a security interest, and any other amount to be financed that is related to the transaction;\n(5) principal balance, which is the sum of clauses (3) and (4);\n(6) the amount of the finance charge;\n(7) the total of payments payable by the retail buyer to the retail seller and the number of installment payments required and the amount of each installment expressed in dollars or percentages, and date of each payment necessary finally to pay the total of payments, which is the sum of clauses (5) and (6).\nProvided, however, that said clauses (1) to (7) inclusive need not be stated in the terms, sequence, or order set forth above. Provided further, that clauses (6) and (7) may be disclosed on the assumption that all scheduled payments under the contract will be made when due.\nIn lieu of the above clauses, the retail seller may give the retail buyer disclosures which satisfy the requirements of the federal Truth-In-Lending Act in effect as of the time of the contract, notwithstanding whether or not that act applies to the transaction.\nEvery retail seller or sales finance company, if a charge for insurance on the motor vehicle is included in a retail installment contract shall within 30 days after execution of the retail installment contract send or cause to be sent to the retail buyer a policy or policies or certificate of insurance, which insurance shall be written by a company authorized to do business in this state, clearly setting forth the amount of the premium, the kind or kinds of insurance and the scope of the coverage and all the terms, exceptions, limitations, restrictions and conditions of the contract or contracts of the insurance. The buyer of a motor vehicle under a retail installment contract shall have the privilege of purchasing such insurance from an agent or broker of the buyer's own selection and selecting an insurance company mutually acceptable to the seller and the buyer; provided, however, that the inclusion of the cost of the insurance premium in the retail installment contract when the buyer selects the agent, broker or company, shall be optional with the seller.\nAny sales finance company hereunder may purchase or acquire from any retail seller any retail installment contract on such terms and conditions as may be mutually agreed upon between them.\nAn acknowledgment by the retail buyer of the delivery of any such copy or notice as required in subdivision 1 contained in the body of the statement or contract shall be conclusive proof of delivery in any action or proceeding by or against any assignee of a retail installment contract.",
	"repealed": false
}