{
	"id": "473J.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.15",
	"title": "473J.15 CRITERIA AND CONDITIONS.",
	"text": "In developing the stadium and entering into related contracts, the authority must follow and enforce the criteria and conditions in this section, provided that a determination by the authority that those criteria or conditions have been met under any agreement or otherwise shall be conclusive.\n(a) The NFL team/private contribution, including stadium builder license proceeds, for stadium costs must be made in cash in the amount of at least $477,000,000.\n(b) Prior to the initial deposit of funds under this section, the team must provide security or other credit worthiness in the amount of $50,000,000, subject to the satisfaction of the authority. Prior to the first issuance of bonds under section 16A.965, the first portion of the NFL team/private contribution in the amount of $50,000,000 must be deposited as costs are incurred to the construction fund to pay for the initial stadium costs.\n(c) After the first $50,000,000 of stadium costs have been paid from the initial NFL team/private contribution, state funds shall be deposited as costs are incurred to the construction fund to pay for the next $50,000,000 of costs of the project. Prior to any state funds being deposited in the construction fund, the NFL team must provide security or a financing commitment reasonably satisfactory to the authority for the balance of the required NFL team/private contribution and for payment of cost overruns if the NFL team assumes responsibility for stadium construction under section 473J.11. Thereafter, budgeted project costs shall be borne by the authority and the NFL team/private contributions in amounts proportionate to their remaining funding commitments.\n(d) In the event the project terminates before the initial $100,000,000 in contributions are expended by the parties under this subdivision, the parties shall be reimbursed in the amounts they have deposited to the construction fund proportionate to project funding percentages, in the amounts of 51 percent by the authority and 49 percent by the NFL team/private contributions.\nThe authority must enter into a long-term lease or use agreement with the NFL team for the NFL team's use of the stadium. The NFL team must agree to play all preseason, regular season, and postseason home games at the stadium. However, the NFL team may play up to three home games outside of the United States during the first 15 years of the lease or use agreement and up to three home games outside of the United States in the next 15 years of the lease or use agreement. Training facilities must remain in Minnesota during the term of the lease or use agreement. The lease or use agreement must be for a term of at least 30 years from the date of substantial completion of the stadium for professional football games. The lease or use agreement may provide options for the NFL team to extend the term for up to four additional periods of five years. The lease or use agreement must include terms for default, termination, and breach of the agreement. Recognizing that the presence of professional football provides to the state of Minnesota and its citizens highly valued, intangible benefits that are virtually impossible to quantify and, therefore, not recoverable in the event of the NFL team owner's breach of contract, the lease and use agreements must provide for specific performance and injunctive relief to enforce provisions relating to use of the stadium for professional football and must not include escape clauses or buyout provisions. The NFL team must not enter into or accept any agreement or requirement with or from any entity that is inconsistent with the NFL team's binding commitment to the 30-year term of the lease or use agreement or that would in any manner dilute, interfere with, or negate the provisions of the lease or use agreement, providing for specific performance or injunctive relief. The legislature conclusively determines, as a matter of public policy, that the lease or use agreement, and any grant agreement under this chapter that includes a specific performance clause:\n(1) explicitly authorizes specific performance as a remedy for breach;\n(2) is made for adequate consideration and upon terms which are otherwise fair and reasonable;\n(3) has not been included through sharp practice, misrepresentation, or mistake;\n(4) if specifically enforced, does not cause unreasonable or disproportionate hardship or loss to the NFL team or to third parties; and\n(5) involves performance in a manner and the rendering of services of a nature and under circumstances that the beneficiary cannot be adequately compensated in damages.\nA lease or use agreement shall include rent and other fees and expenses to be paid by the NFL team. The authority shall agree to provide in the lease or use agreement for the NFL team to receive all NFL and team event-related revenues, including but not limited to, suite revenues, advertising, concessions, signage, broadcast and media, and club seat revenue. The agreement shall also provide that all naming rights to the stadium are retained by the NFL team, subject to the approval of the name or names by the authority consistent with those criteria set out in the lease or use agreement. The agreement shall provide for the authority to receive all general ticket revenues and other event revenues other than from NFL team games, NFL team-owned major league soccer games, and other NFL team events agreed to by the authority.\nUntil 30 years from the date of stadium completion, the NFL team must provide written notice to the authority not less than 180 days prior to any action, including any action imposed upon the NFL team by the NFL, which would result in a breach or default of provisions of the lease or use agreements required to be included under subdivision 3. If this notice provision is violated and the NFL team has already breached or been in default under the required provisions, the authority or the state of Minnesota may specifically enforce the lease or use agreement and Minnesota courts shall fashion equitable remedies so that the NFL team fulfills the conditions of the lease and use agreements.\nThe authority must determine before stadium construction begins that all public and private funding sources for construction, operating expenses, and capital improvements and repairs of the stadium are included in written agreements. The committed funds must be adequate to design, construct, furnish, and equip the stadium, and pay projected operating expenses and the costs of capital improvements and repairs during the term of the lease or use agreement with the NFL team. The NFL team must provide the authority access to NFL team financial or other information, which the authority deems necessary for such determination. Any financial information obtained by the authority under this subdivision is nonpublic data under section 13.02, subdivision 9.\nThe authority must comply with all environmental requirements imposed by regulatory agencies for the stadium, site, and structure, except as provided by section 473J.09, subdivision 11, or by section 473J.17.\n(a) The lease or use agreement must provide that if the NFL team is sold, or an interest in the NFL team is sold after May 15, 2012, a portion of the sale price, determined according to the schedule in paragraph (b), is the public share and must be paid to the state and the city, in amounts proportionate to the expenditures made by the state and from city taxes, respectively, for the purposes of this chapter. If any portion of the public share of the sale price remains after the state and city have been paid, that amount must be deposited in the general fund.\n(b) The portion of the sale price required to be paid under paragraph (a) is:\n(1) 25 percent of the amount in excess of the purchase price of the NFL team by the selling owner or owners for ten years, beginning on May 15, 2012;\n(2) 15 percent during years 11 to 15 after May 15, 2012; and\n(3) ten percent during years 16 to 20 after May 15, 2012.\nThereafter, no portion of the sale price is required to be paid under paragraph (a).\n(c) The agreement must provide exceptions for sales to members of the owners' families and entities and trusts beneficially owned by family members, sales to employees of equity interests aggregating up to ten percent, sales related to capital infusions not distributed to the owners, and sales among existing owners not exceeding 20 percent equity interest in the NFL team.\nA notice provision for a material breach shall be agreed to between the authority and the NFL team. In the event there is a material breach by the NFL team under the lease or use agreement, the lease or use agreement must provide the authority access to audited financial statements of the NFL team and other financial information that the authority deems necessary to enforce the terms of any lease or use agreements. Any financial information obtained by the authority under this subdivision is nonpublic data under section 13.02, subdivision 9.\nThe lease or use agreement must provide that the NFL shall retain the Minnesota Vikings' heritage and records, including the name, logo, colors, history, playing records, trophies, and memorabilia in the event of relocation of the NFL team in violation of the lease or use agreement, and shall not permit use of these rights except for a team located in the state of Minnesota.\n(a) To the extent practicable, the authority and the NFL team will build a stadium that is environmentally and energy efficient and will make an effort to build a stadium that is eligible to receive the Leadership in Energy and Environmental Design (LEED) certification or the Green Building Initiative Green Globes certification for environmental design, and to the extent practicable, will strive to make the stadium design architecturally significant.\n(b) To the extent practicable, the stadium design must, to the extent that the costs of following the guidelines have a payback in energy savings in 30 years or less, follow sustainable building guidelines established under section 16B.325. The authority and NFL team must work with local utility companies to establish a base utility cost under the state energy codes and calculate energy cost savings resulting from complying with the guidelines. The authority and NFL team must fully utilize conservation improvement assistance under section 216B.241 and other energy savings programs available to them.\n(c) To the extent practicable, the authority and the team must ensure that the stadium be built with American-made steel that is made from Minnesota iron ore.\nThe authority and the NFL team must secure any necessary approvals to the terms of the lease and use agreement and the design and construction plans for the stadium, including prior approval of the NFL.\nThe lease or use agreement must provide for an agreed-upon number of affordable tickets to the professional sporting events held in the stadium.\nThe authority shall own and retain the exclusive right to sell stadium builder's licenses in the stadium. The authority will retain the NFL team to act as the authority's agent in marketing and selling such licenses.\nThe authority shall, for five years after the first NFL team home game is played in the stadium, grant the NFL team the exclusive right to establish major league soccer at the stadium. The authority and the NFL team may enter into an agreement providing the terms and conditions of such an arrangement, provided:\n(1) if any of the NFL team owners whose family owns at least three percent of the NFL team purchases full or partial ownership in a major league soccer franchise, such franchise may play in the stadium under a use agreement with similar terms as are applicable to the NFL team which shall include rent based on market conditions but not less than a provision of payment of game-day costs and reasonable marginal costs incurred by the authority as a result of the major league soccer team; and\n(2) capital improvements required by a major league soccer franchise must be financed by the owners of the major league soccer team, unless otherwise agreed to by the authority.\nSubject to the prior approval of the authority, which shall not be unreasonably withheld, any of the obligations by the NFL team may be performed by the NFL team, a related entity, or a third party, and the NFL team, any entity related to the NFL team, or third party may receive any revenues to which the NFL team is entitled hereunder; provided, however, the NFL team shall remain liable if any obligations are assigned to a related entity or third party.",
	"repealed": false
}