{
	"id": "72A.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/72A.42",
	"title": "72A.42 ENFORCEMENT AUTHORITY.",
	"text": "Whenever the commissioner believes, from evidence satisfactory to the commissioner, that any company is violating or about to violate the provisions of section 72A.41, the commissioner may, through the attorney general of this state, cause a complaint to be filed in the District Court of Ramsey County to enjoin and restrain such company from continuing such violation or engaging therein or doing any act in furtherance thereof. The court shall have jurisdiction of the proceeding and shall have the power to make and enter an order or judgment awarding such preliminary or final injunctive relief as in its judgment is proper.\nThe attorney general may proceed in the courts of this state or any reciprocal state to enforce an order or decision in any court proceeding or in any administrative proceeding before the commissioner of commerce.\n(a) Definition--In this section:\n(1) \"Reciprocal state\" means any state or territory of the United States the laws of which contain procedures substantially similar to those specified in this section for the enforcement of foreign decrees issued by courts located in other states or territories of the United States, against any insurer incorporated or authorized to do business in said state or territory.\n(2) \"Foreign decree\" means any decree or order in equity or in law, including without being limited thereto, final money judgments for penalties and fines of a court located in a \"reciprocal state,\" including a court of the United States located therein, against any insurer incorporated or authorized to do business in this state.\n(3) \"Qualified party\" means a state regulatory agency acting in its capacity to enforce the insurance laws of its state.\n(b) List of reciprocal states: The commissioner of commerce of this state shall determine which states and territories qualify as reciprocal states and shall maintain at all times an up-to-date list of such states.\n(c) Filing and status of foreign decrees: a copy of any foreign decree authenticated in accordance with the statutes of this state may be filed in the Office of the Court Administrator of District Court of Ramsey County of this state. The court administrator, upon verifying with the commissioner of commerce that the decree or order qualifies as a \"foreign decree\" shall treat the foreign decree in the same manner as a decree of District Court of Ramsey County of this state. A foreign decree so filed has the same effect and shall be deemed as a decree of District Court of Ramsey County of this state, and is subject to the same procedures, defenses and proceedings for reopening, vacating, or staying as a decree of District Court of Ramsey County of this state and may be enforced or satisfied in like manner.\n(d) Notice of filing:\n(1) At the time of the filing of the foreign decree, the attorney general shall make and file with the court administrator an affidavit setting forth the name and last known post office address of the defendant.\n(2) Promptly upon the filing of the foreign decree and the affidavit, the court administrator shall mail notice of the filing of the foreign decree to the defendant at the address given and to the commissioner of commerce of this state and shall make a note of the mailing in the docket. In addition, the attorney general may mail a notice of the filing of the foreign decree to the defendant and to the commissioner of commerce of this state and may file proof of mailing with the court administrator. Lack of mailing notice of filing by the court administrator shall not affect the enforcement proceedings if proof of mailing by the attorney general has been filed.\n(3) No execution or other process for enforcement of a foreign decree filed hereunder shall issue until 30 days after the date the decree is filed.\n(e) Stay:\n(1) If the defendant shows the District Court of Ramsey County that an appeal from the foreign decree is pending or will be taken, or that a stay of execution has been granted, the court may stay enforcement of the foreign decree until the appeal is concluded, the time for appeal expires, or the stay of execution expires or is vacated, upon proof that the defendant has furnished the security for the satisfaction of the decree required by the state in which it was rendered.\n(2) If the defendant shows the District Court of Ramsey County any ground upon which enforcement of a decree of District Court of Ramsey County of this state would be stayed, the court may stay enforcement of the foreign decree for an appropriate period, upon requiring the same security for satisfaction of the decree which is required in this state.\n(f) Fees: Any person filing a foreign decree shall pay to the court administrator as a fee for docketing, transcription or other enforcement proceedings, the amount provided for decrees of the District Court of Ramsey County.",
	"repealed": false
}