{
	"id": "176.351",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.351",
	"title": "176.351 TESTIMONIAL POWERS.",
	"text": "The compensation judge to whom a petition has been assigned for hearing shall administer an oath to each witness. The commissioner may also administer an oath when required in the performance of duties.\nActing with or without the written request of an interested party, the commissioner or compensation judge before whom a hearing is held may issue a subpoena for the attendance of a witness or the production of such books, papers, records and documents as are material in the cause and are designated in the subpoena. The commissioner may also issue a subpoena for the attendance of a witness or the production of such books, papers, records, and documents as are material in the cause pending and are designated in the subpoena.\nA member of the rehabilitation review panel or Medical Services Board or an employee of the department who has conducted an administrative or settlement conference or hearing under section 176.106 or 176.239, or who has certified or has declined to certify a dispute under section 176.081, subdivision 1, paragraph (c), shall not be subpoenaed to testify regarding the conference, hearing, dispute certification, or concerning a mediation session. A member of the rehabilitation review panel, Medical Services Board, or an employee of the department may be required to answer written interrogatories limited to the following questions:\n(a) Were all statutory and administrative procedural rules adhered to in reaching the decision?\n(b) If the answer to question (a) is no, what deviations took place?\n(c) Did the person making the decision consider all the information presented prior to rendering a decision?\n(d) Did the person making the decision rely on information outside of the information presented at the conference or hearing in making the decision?\n(e) If the answer to question (d) is yes, what other information was relied upon in making the decision?\nIn addition, for a hearing with a compensation judge and with the consent of the compensation judge, an employee of the department who conducted an administrative conference, hearing, or mediation session, may be requested to answer written interrogatories relating to statements made by a party at the prior proceeding. These interrogatories shall be limited to affirming or denying that specific statements were made by a party.\nThe commissioner and any employee of the department shall not be subject to a subpoena for purposes of providing expert testimony or describing the nature of assistance or advice provided under this chapter. This prohibition does not apply to: testimony of a department employee in a workers' compensation enforcement proceeding brought by the commissioner; a dispute in which the commissioner or the special compensation fund is a party; or a qualified rehabilitation consultant, qualified rehabilitation consultant intern, or job placement coordinator employed in the department's vocational rehabilitation unit established under section 176.104, who has provided rehabilitation, job placement, or job development services under a rehabilitation plan for an employee with a workers' compensation claim.\nThe person who applies for issuance of a subpoena shall advance the required service and witness fees. The commissioner shall pay for the attendance of witnesses who are subpoenaed by the commissioner. The chief administrative law judge shall pay for the attendance of witnesses who are subpoenaed by a compensation judge. The fees are the same as the service and witness fees in civil actions in district court.\nWhere a person does not comply with an order or subpoena, the commissioner or compensation judge concerned, may apply to the district court in the county in which the petition is pending for issuance of an order compelling obedience. Upon such an application, the district court shall compel obedience to the order or subpoena by attachment proceedings as for contempt in the case of disobedience of a similar order or subpoena issued by the district court.",
	"repealed": false
}