{
	"id": "430.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.12",
	"title": "430.12 BONDS FOR IMPROVEMENTS.",
	"text": "The city council may issue and sell special certificates of indebtedness or special street or parkway improvement bonds as necessary to pay for making improvements and paying damages. The holders of the certificates or bonds are entitled to all amounts realized on any assessment, or, in the council's discretion, the holders of a series of two or more certificates or bonds have those rights against one assessment or against the assessments in two or more different proceedings. The principal and interest will be payable at fixed dates out of the funds collected from the assessments, including interest and penalties, and those funds are pledged for the pro rata payment of the certificates or bonds and related interest as they become due. These certificates or bonds may be made payable to the bearer, with interest coupons attached, and the city council may bind the city to make good deficiencies in the collection up to, but not exceeding, the principal and interest at the rate fixed under this section and for the time specified in section 430.06. If the city, because of this guaranty, redeems a certificate or bond, it is subrogated to the holder's rights. For the purpose of this guaranty, penalties collected must be credited upon deficiencies of principal and interest before the city is liable. These certificates or bonds must be sold at public sale or by sealed proposals at a meeting after at least two weeks' published notice, to the purchaser who will pay the par value at the lowest interest rate. The certificates or bonds must be drawn accordingly.\nThe rate of interest may not exceed seven percent per year, payable annually or semiannually. The city clerk shall certify to the county auditor the rate of interest determined at the first bond sale held for any improvement under this chapter, and interest must be computed on the assessments at this annual rate, in accordance with section 430.06. If the rate of interest determined at any subsequent bond sale for the same improvement is greater than the rate determined at the first bond sale, the difference between these rates of interest must be a general city charge.\nIf the proceeds of special certificates of indebtedness or special street or parkway improvement bonds are in excess of the amount actually necessary to make the improvements for which they were issued, or if the proceeds are not immediately required for the prosecution or completion of the improvement, the proceeds may meanwhile be used by the city council for other improvements authorized under this chapter, and the proceeds used must be replaced and made good as necessary from the proceeds of special certificates of indebtedness or special bonds issued for other improvements.\nSections 474A.01 to 474A.21 apply to any obligations issued under this section that are subject to limitation under a federal tax law as defined in section 474A.02, subdivision 8.",
	"repealed": false
}