{
	"id": "254B.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/254B.19",
	"title": "254B.19 AMERICAN SOCIETY OF ADDICTION MEDICINE STANDARDS OF CARE.",
	"text": "(a) For each client assigned an ASAM level of care, eligible vendors must implement the standards set by the ASAM for the respective level of care. Additionally, vendors must meet the following requirements:\n(1) For ASAM level 0.5 early intervention targeting individuals who are at risk of developing a substance-related problem but may not have a diagnosed substance use disorder, early intervention services may include individual or group counseling, treatment coordination, peer recovery support, screening brief intervention, and referral to treatment provided according to section 254A.03, subdivision 3, paragraph (c).\n(2) For ASAM level 1.0 outpatient clients, adults must receive up to eight hours per week of skilled treatment services and adolescents must receive up to five hours per week. Services must be licensed according to section 245G.20 and meet requirements under section 256B.0759. Peer recovery and treatment coordination may be provided beyond the hourly skilled treatment service hours allowable per week.\n(3) For ASAM level 2.1 intensive outpatient clients, adults must receive nine to 19 hours per week of skilled treatment services and adolescents must receive six or more hours per week. Vendors must be licensed according to section 245G.20 and must meet requirements under section 256B.0759. Peer recovery services and treatment coordination may be provided beyond the hourly skilled treatment service hours allowable per week. If clinically indicated on the client's treatment plan, this service may be provided in conjunction with room and board according to section 254B.05, subdivision 1a.\n(4) For ASAM level 2.5 partial hospitalization clients, adults must receive 20 hours or more of skilled treatment services. Services must be licensed according to section 245G.20 and must meet requirements under section 256B.0759. Level 2.5 is for clients who need daily monitoring in a structured setting, as directed by the individual treatment plan and in accordance with the limitations in section 254B.05, subdivision 5, paragraph (h). If clinically indicated on the client's treatment plan, this service may be provided in conjunction with room and board according to section 254B.05, subdivision 1a.\n(5) For ASAM level 3.1 clinically managed low-intensity residential clients, programs must provide at least 5 hours of skilled treatment services per week according to each client's specific treatment schedule, as directed by the individual treatment plan. Programs must be licensed according to section 245G.20 and must meet requirements under section 256B.0759.\n(6) For ASAM level 3.3 clinically managed population-specific high-intensity residential clients, programs must be licensed according to section 245G.20 and must meet requirements under section 256B.0759. Programs must have 24-hour staffing coverage. Programs must be enrolled as a disability responsive program as described in section 254B.01, subdivision 4b, and must specialize in serving persons with a traumatic brain injury or a cognitive impairment so significant, and the resulting level of impairment so great, that outpatient or other levels of residential care would not be feasible or effective. Programs must provide, at a minimum, daily skilled treatment services seven days a week according to each client's specific treatment schedule, as directed by the individual treatment plan.\n(7) For ASAM level 3.5 clinically managed high-intensity residential clients, services must be licensed according to section 245G.20 and must meet requirements under section 256B.0759. Programs must have 24-hour staffing coverage and provide, at a minimum, daily skilled treatment services seven days a week according to each client's specific treatment schedule, as directed by the individual treatment plan.\n(8) For ASAM level withdrawal management 3.2 clinically managed clients, withdrawal management must be provided according to chapter 245F.\n(9) For ASAM level withdrawal management 3.7 medically monitored clients, withdrawal management must be provided according to chapter 245F.\n(b) Notwithstanding the minimum daily skilled treatment service requirements under paragraph (a), clauses (6) and (7), ASAM level 3.3 and 3.5 vendors must provide each client at least 30 hours of treatment services per week for the period between January 1, 2024, through June 30, 2024.\nThe license holder must maintain documentation of a formal patient referral arrangement agreement for each of the following ASAM levels of care not provided by the license holder:\n(1) level 1.0 outpatient;\n(2) level 2.1 intensive outpatient;\n(3) level 2.5 partial hospitalization;\n(4) level 3.1 clinically managed low-intensity residential;\n(5) level 3.3 clinically managed population-specific high-intensity residential;\n(6) level 3.5 clinically managed high-intensity residential;\n(7) level withdrawal management 3.2 clinically managed residential withdrawal management; and\n(8) level withdrawal management 3.7 medically monitored inpatient withdrawal management.\nAll services delivered within the ASAM levels of care referenced in subdivision 1, clauses (1) to (7), must have documentation of the evidence-based practices being utilized as referenced in the most current edition of the ASAM Criteria: Treatment Criteria for Addictive, Substance-Related, and Co-Occurring Conditions.\nEligible vendors providing services under ASAM levels of care referenced in subdivision 1, clauses (2) to (7), must have a program outreach plan. The treatment director must document a review and update the plan annually. The program outreach plan must include treatment coordination strategies and processes to ensure seamless transitions across the continuum of care. The plan must include how the provider will:\n(1) increase the awareness of early intervention treatment services, including but not limited to the services defined in section 254A.03, subdivision 3, paragraph (c);\n(2) coordinate, as necessary, with certified community behavioral health clinics when a license holder is located in a geographic region served by a certified community behavioral health clinic;\n(3) establish a referral arrangement agreement with a withdrawal management program licensed under chapter 245F when a license holder is located in a geographic region in which a withdrawal management program is licensed under chapter 245F. If a withdrawal management program licensed under chapter 245F is not geographically accessible, the plan must include how the provider will address the client's need for this level of care;\n(4) coordinate with inpatient acute care hospitals, including emergency departments, hospital outpatient clinics, urgent care centers, residential crisis settings, medical detoxification inpatient facilities, and ambulatory detoxification providers in the area served by the provider to help transition individuals from emergency department or hospital settings and minimize the time between assessment and treatment;\n(5) develop and maintain collaboration with local county and Tribal human services agencies; and\n(6) collaborate with primary care and mental health settings.",
	"repealed": false
}