{
	"id": "123B.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.86",
	"title": "123B.86 EQUAL TREATMENT.",
	"text": "A district shall provide equal transportation within the district for all school children to any school when transportation is deemed necessary by the school board because of distance or traffic condition in like manner and form as provided in sections 123B.88 and 123B.92, when applicable.\n(a) The board of any local district must provide school bus transportation to the district boundary for school children residing in the district at least the same distance from a nonpublic school actually attended in another district as public school pupils are transported in the transporting district. Such transportation must be provided whether or not there is another nonpublic school within the transporting district, if the transportation is to schools maintaining grades or departments not maintained in the district or if the attendance of such children at school can more safely, economically, or conveniently be provided for by such means.\n(b) The school board of any local district may provide school bus transportation to a nonpublic school in another district for school children residing in the district and attending that school, whether or not there is another nonpublic school within the transporting district, if the transportation is to schools maintaining grades or departments not maintained in the district or if the attendance of such children at school can more safely, economically, or conveniently be provided for by such means. If the board transports children to a nonpublic school located in another district, the nonpublic school must pay the cost of such transportation provided outside the district boundaries.\n(a) When transportation is provided, the scheduling of routes, manner and method of transportation, control and discipline of school children and any other matter relating thereto shall be within the sole discretion, control and management of the board.\n(b) A school board and a nonpublic school may mutually agree to a written plan for the board to provide nonpublic pupil transportation to nonpublic school students.\n(c) A school board that provides pupil transportation through the school's employees may transport nonpublic school students according to the plan and retain the nonpublic pupil transportation aid attributable to that plan. A nonpublic school may make a payment to the school district to cover additional transportation services agreed to in the written plan for nonpublic pupil transportation services not required under sections 123B.84 to 123B.87.\n(d) A school board that contracts for pupil transportation services may enter into a contractual arrangement with a school bus contractor according to the written plan adopted by the school board and the nonpublic school to transport nonpublic school students and retain the nonpublic pupil transportation aid attributable to that plan for the purposes of paying the school bus contractor. A nonpublic school may make a payment to the school district to cover additional transportation services agreed to in the written plan for nonpublic pupil transportation services included in the contract that are not required under sections 123B.84 to 123B.87.\n(e) The school district must report the number of nonpublic school students transported and the nonpublic pupil transportation expenditures incurred under paragraph (b) in the form and manner specified by the commissioner.\nThe commissioner of education may amend rules relating to equal transportation.",
	"repealed": false
}