{
	"id": "462C.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/462C.071",
	"title": "462C.071 SINGLE-FAMILY MORTGAGE BONDS; LIMITATIONS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Existing housing\" means single-family housing that (i) has been previously occupied prior to the first day of the origination period; or (ii) has been available for occupancy for at least 12 months but has not been previously occupied.\n(c) \"Metropolitan area\" means the metropolitan area as defined in section 473.121, subdivision 2.\n(d) \"New housing\" means single-family housing that has not been previously occupied.\n(e) \"Origination period\" means the period that loans financed with the proceeds of qualified mortgage revenue bonds are available for the purchase of single-family housing. The origination period begins when financing actually becomes available to the borrowers for loans.\n(f) \"Redevelopment area\" means a compact and contiguous area within which the city finds by resolution that 70 percent of the parcels are occupied by buildings, streets, utilities, or other improvements and more than 25 percent of the buildings, not including outbuildings, are structurally substandard to a degree requiring substantial renovation or clearance.\n(g) \"Single-family housing\" means dwelling units eligible to be financed from the proceeds of qualified mortgage revenue bonds under federal law.\n(h) \"Structurally substandard\" means containing defects in structural elements or a combination of deficiencies in essential utilities and facilities, light, ventilation, fire protection including adequate egress, layout and condition of interior partitions, or similar factors, which defects or deficiencies are of sufficient total significance to justify substantial renovation or clearance.\nDuring the first ten months of an origination period, a city may make loans financed with proceeds of mortgage bonds for the purchase of existing housing. Loans financed with the proceeds of mortgage bonds for new housing in the metropolitan area may be made during the first ten months of an origination period only if at least one of the following conditions is met:\n(1) the new housing is located in a redevelopment area;\n(2) the new housing is replacing a structurally substandard structure or structures;\n(3) the new housing is located on a parcel purchased by the city or conveyed to the city under section 282.01, subdivision 1;\n(4) the new housing is part of a housing affordability initiative, other than those financed with the proceeds from the sale of bonds, in which federal, state, or local assistance is used to substantially improve the terms of the financing or to substantially write down the purchase price of the new housing; or\n(5) the new housing is located in a city that has entered into a housing affordability agreement with the Metropolitan Council.\nUpon expiration of the first ten-month period, a city may make loans financed with the proceeds of mortgage bonds for the purchase of new and existing housing.\nCities shall initiate steps in the nonmetropolitan areas of the state similar to those required for the metropolitan area under subdivision 2 to encourage loans for existing housing or for new housing under the conditions specified in subdivision 2.\nA city located within the metropolitan area must submit to the Metropolitan Council the resolution adopted by the governing body of the city finding an area to be a redevelopment area and a map of the redevelopment area.\nA city may not make available, provide set-asides, or commit to make available proceeds of mortgage bonds for the exclusive use of builders or developers for loans to eligible purchasers for new housing except for new housing described in subdivision 2, clauses (1) to (3). This prohibition is in effect for the total origination period.\nA city that provides loans for new housing financed with the proceeds of mortgage bonds shall report to the chairs of the appropriate housing-related standing committees or divisions of the state senate and house of representatives by January 1 of each year detailing new housing activity financed with the proceeds of mortgage bonds, including a description of affordable housing initiatives, the number of loans, the average purchase price, average borrower income, and steps taken to encourage loan activity as required in subdivision 3.",
	"repealed": false
}