{
	"id": "97C.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.501",
	"title": "97C.501 MINNOW LICENSES REQUIRED.",
	"text": "(a) A person may not be a minnow retailer without a minnow retailer license except as provided in subdivisions 2, paragraph (d), and 3. A person must purchase a minnow retailer license for each minnow retail outlet operated, except as provided by subdivision 2, paragraph (d).\n(b) A minnow retailer must obtain a minnow retailer's vehicle license for each motor vehicle used by the minnow retailer to transport more than 12 dozen minnows to the minnow retailer's place of business. A minnow retailer is not required to obtain a minnow retailer's vehicle license:\n(1) as provided in subdivision 3;\n(2) if the minnow retailer is licensed as a resort under section 157.16, is transporting minnows purchased from a minnow dealer's place of business directly to the resort, possesses a detailed receipt, including the date and time of purchase, and presents the receipt and minnows for inspection upon request; or\n(3) if minnows are being transported by common carrier and information is provided that allows the commissioner to find out the location of the shipment in the state.\n(a) A person may not be a minnow dealer without a minnow dealer license except as provided in subdivision 3.\n(b) A minnow dealer must obtain a minnow dealer's vehicle license for each motor vehicle used to transport minnows. The serial number, motor vehicle license number, make, and model must be on the license. The license must be conspicuously displayed in the vehicle.\n(c) A minnow dealer may not transport minnows out of the state without an exporting minnow dealer license. A minnow dealer must obtain an exporting minnow dealer's vehicle license for each motor vehicle used to transport minnows out of the state. The serial number, motor vehicle license number, make, and model must be on the license. The license must be conspicuously displayed in the vehicle.\n(d) A person with a minnow dealer's license may sell minnows at one retail outlet. A minnow dealer must obtain a minnow retailer license for each additional retail outlet operated. A minnow dealer operating a retail outlet under a minnow dealer's license must list the following information for the retail outlet: name of the business; city; state; zip code; and legal description or fire number. The retail outlet name and location may be changed by making application to the commissioner.\n(e) A minnow dealer may designate employees as helpers who are authorized to take, buy, sell, and transport minnows on behalf of the minnow dealer. The employees designated as helpers must be listed on the minnow dealer's license, and a copy of the license designating the employee as a helper must be in the helper's possession when acting on behalf of the minnow dealer. The minnow dealer may add and delete helpers listed on the dealer's license within a license year by notifying the commissioner in writing of the change to the license. Employees who are acting under the direction and control of the minnow dealer but who are not designated as helpers may not buy or sell minnows on behalf of the minnow dealer. This paragraph does not apply to employees selling minnows at the retail outlet location under paragraph (d).\nA resident under age 18 may take leeches, sell leeches at retail, and transport leeches without a minnow retailer or dealer license.\n(a) A nonresident must obtain an exporting minnow dealer's vehicle license for the motor vehicle used to transport minnows. The serial number, motor vehicle license number, make, and model must be on the license. The license must be conspicuously displayed in the vehicle.\n(b) Only one nonresident exporting minnow dealer vehicle license may be issued to a nonresident exporting minnow dealer.",
	"repealed": false
}