{
	"id": "383B.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.77",
	"title": "383B.77 HENNEPIN COUNTY HOUSING AND REDEVELOPMENT AUTHORITY.",
	"text": "The Hennepin County Housing and Redevelopment Authority is created in the county of Hennepin. It shall have all of the powers and duties of a housing and redevelopment authority under sections 469.001 to 469.047. For the purposes of applying the municipal housing and redevelopment act to Hennepin County, the county has all of the powers and duties of a city, the county board has all the powers and duties of a governing body, the chair of the county board has all of the powers and duties of a mayor, and, notwithstanding section 469.008, the area of operation includes the area within the territorial boundaries of the county.\nThis section does not limit or restrict any existing housing and redevelopment authority or prevent a municipality from creating an authority. For purposes of this subdivision, \"housing and redevelopment authority\" includes any municipal department, agency, or authority of the city of Minneapolis which exercises the powers of a housing and redevelopment authority pursuant to section 469.003 or other law. The county authority shall notify a municipal authority by January 31 of each year as to the activities the county authority plans to participate in within the municipality. The municipal authority shall notify the county authority within 45 days of the date of the notice from the county authority, if the municipal authority does not consent to the activities of the county authority. If a city housing and redevelopment authority requests the county housing and redevelopment authority to exercise any power or perform any function of the municipal authority, the county authority may do so.\nIf a housing or redevelopment project is undertaken in Hennepin County pursuant to this section, the governing body of the city must approve the project before it is undertaken.\nNotwithstanding section 469.003, subdivision 5, the Hennepin County Housing and Redevelopment Authority shall consist of seven commissioners.",
	"repealed": false
}