{
	"id": "525.313",
	"url": "https://www.revisor.mn.gov/statutes/cite/525.313",
	"title": "525.313 CLEARANCE FOR MEDICAL ASSISTANCE CLAIMS.",
	"text": "(a) The court shall not enter a decree of descent until the petitioner has filed a clearance for medical assistance claims under this section, and until any medical assistance claims filed under this section have been paid, settled, or otherwise finally disposed of.\n(b) After filing the petition, the petitioner or the petitioner's attorney shall apply to the county agency in the county in which the petition is pending for a clearance of medical assistance claims. The application must state the decedent's name, date of birth, and Social Security number; the name, date of birth, and Social Security number of any predeceased spouse of the decedent; the names and addresses of the devisees and heirs; and the name, address, and telephone number of the petitioner or the attorney making the application on behalf of the petitioner, and include a copy of the notice of hearing.\n(c) The county agency shall determine whether the decedent or any of the decedent's predeceased spouses received medical assistance under chapter 256B or general assistance medical care formerly codified under chapter 256D giving rise to a claim under section 256B.15. If there are no claims, the county agency shall issue the petitioner a clearance for medical assistance claims stating no medical assistance claims exist. If there is a claim, the county agency shall issue the petitioner a clearance for medical assistance claims stating that a claim exists and the total amount of the claim. The county agency shall mail the completed clearance for medical assistance claims to the applicant within 15 working days after receiving the application without cost to the applicant or others.\n(d) The petitioner or attorney shall file the certificate in the proceedings for the decree of descent as soon as practicable after it is received. Notwithstanding any rule or law to the contrary, if a medical assistance claim appears in a clearance for medical assistance claims, then:\n(1) the claim shall be a claim against the decedent's property which is the subject of the petition. The county agency issuing the certificate shall be the claimant. The filing of the clearance for medical assistance claims in the proceeding for a decree of descent constitutes presentation of the claim;\n(2) the claim shall be an unbarred and undischarged claim and shall be payable, in whole or in part, from the decedent's property which is the subject of the petition, including the net sale proceeds from any sale of property free and clear of the claim under this section;\n(3) the claim may be allowed, denied, appealed, and bear interest as provided for claims in estates under chapter 524; and\n(4) the county agency may collect, compromise, or otherwise settle the claim with the estate, the petitioner, or the assignees of the property on whatever terms and conditions are deemed appropriate.\n(e) Any of the decedent's devisees, heirs, successors, assigns, or their successors and assigns, may apply for a partial decree of descent to facilitate the good faith sale of their interest in any real or personal property described in the petition free and clear of any medical assistance claim any time before the entry of a decree of descent under section 525.312. The applicant must prove an interest in the property as provided under section 525.312. The court may enter a partial decree of descent any time after it could hear and decide the petition for a decree of descent. A partial decree of descent shall assign the interests in the real and personal property described in the application to the parties entitled to the property free and clear of any and all medical assistance claims. The net sale proceeds from the sale shall be:\n(1) substituted in the estate according to this section for the property sold;\n(2) paid over to and held by the petitioner pending the entry of a decree of descent;\n(3) used for payment of medical assistance claims; and\n(4) distributed according to the decree of descent after any medical assistance claims are paid.\n(f) The clearance for medical assistance claims must:\n(1) include the case name, case number, and district court in which the proceeding for a decree of descent is pending;\n(2) include the name, date of birth, and Social Security number of the decedent and any of the decedent's predeceased spouses;\n(3) state whether there are medical assistance claims against the decedent, or a predeceased spouse, and the total amount of each claim; and\n(4) include the name, address, and telephone number of the county agency giving the clearance for medical assistance claims. The certificate shall be signed by the director of the county agency or the director's designee. The signature of the director or the director's designee does not require an acknowledgment.\n(g) All recoveries under this section are recoveries under section 256B.15.\n(h) For purposes of this section and chapter 256B, all property identified in the petition and all subsequent amendments to the petition shall constitute an estate.\n(i) No clearance for medical assistance claims is required under this section and section 525.312 in an action for a decree of descent proceeding in which all of the following apply to the decedent whose property is the subject of the proceeding:\n(1) the decedent's estate was previously probated in this state;\n(2) the previous probate was not a special administration or summary proceeding; and\n(3) the decedent's property, which is the subject of the petition for a decree of descent, was omitted from the previous probate.",
	"repealed": false
}