{
	"id": "518A.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.46",
	"title": "518A.46 PROCEDURES FOR CHILD AND MEDICAL SUPPORT ORDERS AND PARENTAGE ORDERS IN THE EXPEDITED PROCESS.",
	"text": "This section applies in cases in which support rights are assigned under section 518A.81, subdivision 2, or where the public authority is providing services under an application for child support services.\n(a) The county attorney shall review and approve as to form and content all pleadings and other legal documents prepared by nonattorney employees of the county agency for use in the expedited child support process.\n(b) Under the direction of, and in consultation with, the county attorney, nonattorney employees of the county agency shall have authority to perform the following legal duties:\n(1) meet and confer with parties by mail, telephone, electronic, or other means regarding legal issues;\n(2) explain to parties the purpose, procedure, and function of the expedited child support process and the role and authority of nonattorney employees of the county agency regarding legal issues;\n(3) prepare pleadings, including, but not limited to, summonses and complaints, notices, motions, subpoenas, orders to show cause, proposed orders, administrative orders, and stipulations and agreements;\n(4) issue administrative subpoenas;\n(5) prepare judicial notices;\n(6) negotiate settlement agreements;\n(7) attend and participate as a witness in hearings and other proceedings and, if requested by the child support magistrate, present evidence, agreements and stipulations of the parties, and any other information deemed appropriate by the magistrate;\n(8) participate in such other activities and perform such other duties as delegated by the county attorney; and\n(9) exercise other powers and perform other duties as permitted by statute or court rule.\n(c) Nonattorney employees of the county agency may perform the following duties without direction from the county attorney:\n(1) gather information on behalf of the public authority;\n(2) prepare financial worksheets;\n(3) obtain income information from the Department of Employment and Economic Development and other sources;\n(4) serve documents on parties;\n(5) file documents with the court;\n(6) meet and confer with parties by mail, telephone, electronic, or other means regarding nonlegal issues;\n(7) explain to parties the purpose, procedure, and function of the expedited child support process and the role and authority of nonattorney employees of the county agency regarding nonlegal issues; and\n(8) perform such other routine nonlegal duties as assigned.\n(d) Performance of the duties prescribed in paragraphs (b) and (c) by nonattorney employees of the county agency does not constitute the unauthorized practice of law for purposes of section 481.02.\n(a) In cases involving establishment or modification of a child support order, the initiating party shall include the following information, if known, in the pleadings:\n(1) names, addresses, and dates of birth of the parties;\n(2) Social Security numbers of the parties and the minor children of the parties, which information shall be considered private information and shall be available only to the parties, the court, and the public authority;\n(3) other support obligations of the obligor;\n(4) names and addresses of the parties' employers;\n(5) gross income of the parties as calculated in section 518A.29;\n(6) amounts and sources of any other earnings and income of the parties;\n(7) health insurance coverage of parties;\n(8) types and amounts of public assistance received by the parties, including Minnesota family investment plan, child care assistance, medical assistance, title IV-E foster care, or other form of assistance as defined in section 518A.81, subdivision 1; and\n(9) any other information relevant to the computation of the child support obligation under section 518A.34.\n(b) For all matters scheduled in the expedited process, whether or not initiated by the public authority, the nonattorney employee of the public authority shall file with the court and serve on the parties the following information:\n(1) information pertaining to the income of the parties available to the public authority from the Department of Employment and Economic Development;\n(2) a statement of the monthly amount of child support, medical support, child care, and arrears currently being charged the obligor on Minnesota IV-D cases;\n(3) a statement of the types and amount of any public assistance, as defined in section 518A.81, subdivision 1, received by the parties; and\n(4) any other information relevant to the determination of support that is known to the public authority and that has not been otherwise provided by the parties.\nThe information must be filed with the court or child support magistrate at least five days before any hearing involving child support, medical support, or child care reimbursement issues.\n(a) In cases involving modification of only the medical support portion of a child support order under section 518A.39, subdivision 8, the initiating party shall include the following information, if known, in the pleadings:\n(1) names, addresses, and dates of birth of the parties;\n(2) Social Security numbers of the parties and the minor children of the parties, which shall be considered private information and shall be available only to the parties, the court, and the public authority;\n(3) names and addresses of the parties' employers;\n(4) gross income of the parties as stated in the order being modified;\n(5) health insurance coverage of the parties; and\n(6) any other information relevant to the determination of the medical support obligation under section 518A.41.\n(b) For all matters scheduled in the expedited process, whether or not initiated by the public authority, the nonattorney employee of the public authority shall file with the court and serve on the parties the following information:\n(1) a statement of the monthly amount of child support, medical support, child care, and arrears currently being charged the obligor on Minnesota IV-D cases;\n(2) a statement of the amount of medical assistance received by the parties; and\n(3) any other information relevant to the determination of medical support that is known to the public authority and that has not been otherwise provided by the parties.\nThe information must be filed with the court or child support magistrate at least five days before the hearing on the motion to modify medical support.\nUnder the direction of the county attorney and based on agreement of the parties, nonattorney employees may prepare a stipulation, findings of fact, conclusions of law, and proposed order. The documents must be approved and signed by the county attorney as to form and content before submission to the court or child support magistrate for approval.\n(a) The public authority may take the following actions relating to establishment of paternity or to establishment, modification, or enforcement of support orders, without the necessity of obtaining an order from any judicial or administrative tribunal:\n(1) recognize and enforce orders of child support agencies of other states;\n(2) upon request for genetic testing by a child, parent, or any alleged parent, and using the procedure in paragraph (b), order the child, parent, or alleged parent to submit to blood or genetic testing for the purpose of establishing paternity;\n(3) subpoena financial or other information needed to establish, modify, or enforce a child support order and sanction a party for failure to respond to a subpoena;\n(4) upon notice to the obligor, obligee, and the appropriate court, direct the obligor or other payor to change the payee to the central collections unit under sections 518A.54 to 518A.56;\n(5) order income withholding of child support under section 518A.53 and sanction an employer or payor of funds pursuant to section 393.07, subdivision 9a, for failing to comply with an income withholding notice;\n(6) secure assets to satisfy the debt or arrearage in cases in which there is a support debt or arrearage by:\n(i) intercepting or seizing periodic or lump-sum payments from state or local agencies, including unemployment benefits, workers' compensation payments, judgments, settlements, lotteries, and other lump-sum payments;\n(ii) attaching and seizing assets of the obligor held in financial institutions or public or private retirement funds; and\n(iii) imposing liens in accordance with section 548.091 and, in appropriate cases, forcing the sale of property and the distribution of proceeds;\n(7) for the purpose of securing overdue support, increase the amount of the monthly support payments by an additional amount equal to 20 percent of the monthly support payment to include amounts for debts or arrearages;\n(8) subpoena an employer or payor of funds to provide promptly information on the employment, compensation, and benefits of an individual employed by that employer as an employee or contractor, and sanction an employer or payor of funds pursuant to section 393.07, subdivision 9a, for failure to respond to the subpoena; and\n(9) redirect basic support, medical support, and child care support to a caregiver using the procedures in subdivision 7. As used in this clause, \"caregiver\" means a person or entity now caring for the child:\n(i) as a result of a voluntary placement agreement under section 260C.227 that does not address redirection of child support;\n(ii) as a result of a court-ordered placement that does not address redirection of child support; or\n(iii) receiving public assistance as defined in section 518A.81, subdivision 1, for the child.\n(b) A request for genetic testing by a child, parent, or alleged parent must be supported by a sworn statement by the person requesting genetic testing alleging paternity, which sets forth facts establishing a reasonable possibility of the requisite sexual contact between the parties, or denying paternity, and setting forth facts establishing a reasonable possibility of the nonexistence of sexual contact between the alleged parties. The order for genetic tests may be served anywhere within the state and served outside the state in the same manner as prescribed by law for service of subpoenas issued by the district court of this state. If the child, parent, or alleged parent fails to comply with the genetic testing order, the public authority may seek to enforce that order in district court through a motion to compel testing. No results obtained through genetic testing done in response to an order issued under this section may be used in any criminal proceeding.\n(c) Subpoenas may be served anywhere within the state and served outside the state in the same manner as prescribed by law for service of process of subpoenas issued by the district court of this state. When a subpoena under this subdivision is served on a third-party record keeper, written notice of the subpoena shall be mailed to the person who is the subject of the subpoenaed material at the person's last known address within three days of the day the subpoena is served. This notice provision does not apply if there is reasonable cause to believe the giving of the notice may lead to interference with the production of the subpoenaed documents.\n(d) A person served with a subpoena may make a written objection to the public authority or court before the time specified in the subpoena for compliance. The public authority or the court shall cancel or modify the subpoena, if appropriate. The public authority shall pay the reasonable costs of producing the documents, if requested.\n(e) Subpoenas are enforceable in the same manner as subpoenas of the district court. Upon motion of the county attorney, the court may issue an order directing the production of the records. Failure to comply with the court order may subject the person who fails to comply to civil or criminal contempt of court.\n(f) The administrative actions under this subdivision are subject to due process safeguards, including requirements for notice, opportunity to contest the action, and opportunity to appeal the order to the judge, judicial officer, or child support magistrate.\nThe public authority may share available and relevant information on the parties in order to perform its duties under this section or under supreme court rules governing the expedited child support hearing process under section 484.702, subject to the limitations of sections 257.70; 518.005, subdivision 5; and 518A.82, subdivision 8.\n(a) The public authority must provide written notice of redirection to the obligee, the obligor, and the caregiver. The notice must be mailed to the obligor, obligee, and caregiver at the obligee's, the obligor's, and the caregiver's respective last known address. The notice must state the name of the child or children for whom support will be redirected, to whom the support will be redirected, the date the support will be redirected, and the amount of the support that will be redirected. The notice must also inform the parties of the right to contest the redirection of support according to paragraph (c).\n(b) If fewer than all of the children for whom the support is ordered reside with the caregiver, the public authority must redirect the proportional share of the support for the number of children residing with the caregiver.\n(c) The obligee or obligor may contest the redirection of support on the limited grounds that:\n(1) the child or children do not reside or no longer reside with the caregiver;\n(2) under an out-of-home placement plan under section 260C.212, subdivision 1, that includes a plan for reunification, all or part of the support is needed to maintain the obligee's home; or\n(3) the redirection of support is not in the best interests of the child.\n(d) To contest the redirection, the obligee or obligor must make a written request for a hearing to the public authority within 30 calendar days of the date of the written notice of redirection. The hearing must be held at the earliest practicable time, but no later than 30 calendar days from the date the public authority receives the written request for a hearing. If the public authority receives a timely written request for a hearing, the public authority must schedule a hearing and serve the obligee and the obligor with a notice of hearing at least 14 days before the date of the hearing. The notice must be served personally or by mail at the obligee's and the obligor's respective last known address. The public authority must file with the court the notice of hearing along with the notice of redirection at least five days before the scheduled hearing. The court administrator must schedule these hearings to be heard in the expedited process before a child support magistrate, but may schedule these hearings in district court if the availability of a child support magistrate does not permit a hearing to occur within the time frames of this subdivision.\n(e) If neither the obligee nor the obligor contests the redirection of support under this subdivision, support must be redirected to the caregiver effective the first day of the month following the expiration of the time period to contest under paragraph (d). If the obligee or the obligor contests the redirection of support under paragraph (d), the public authority must not redirect support to the caregiver pending the outcome of the hearing.\n(f) The redirection of the basic support, medical support, and child care support terminates and the public authority must direct support to the obligee if the public authority determines that:\n(1) the caregiver for the child no longer receives public assistance for the child;\n(2) the voluntary placement agreement expires; or\n(3) the court order placing the child is no longer in effect.\n(g) The public authority must notify the obligee, obligor, and caregiver of a termination of the redirection of support by mailing a written notice to each of them at their last known address. The termination is effective the first day of the month that occurs at least 14 calendar days after the date the notice is mailed.",
	"repealed": false
}