{
	"id": "270C.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.69",
	"title": "270C.69 WITHHOLDING BY EMPLOYER OF DELINQUENT TAXES.",
	"text": "(a) The commissioner may, within five years after the date of assessment of the tax, or if a lien has been filed under section 270C.63, within the statutory period for enforcement of the lien, give notice to any employer deriving income which has a taxable situs in this state regardless of whether the income is exempt from taxation, that an employee of that employer is delinquent in a certain amount with respect to any taxes, including penalties, interest, and costs. The commissioner can proceed under this section only if the tax is uncontested or if the time for appeal of the tax has expired. The commissioner shall not proceed under this section until the expiration of 30 days after mailing to the taxpayer, at the taxpayer's last known address, a written notice of (1) the amount of taxes, interest, and penalties due from the taxpayer and demand for their payment, and (2) the commissioner's intention to require additional withholding by the taxpayer's employer pursuant to this section. The effect of the notice shall expire one year after it has been mailed to the taxpayer provided that the notice may be renewed by mailing a new notice which is in accordance with this section. The renewed notice shall have the effect of reinstating the priority of the original claim. The notice to the taxpayer shall be in substantially the same form as that provided in Minnesota Statutes 2022, section 571.72. The notice shall further inform the taxpayer of the wage exemptions contained in Minnesota Statutes 2022, section 550.37, subdivision 14. If no statement of exemption is received by the commissioner within 30 days from the mailing of the notice, the commissioner may proceed under this section. The notice to the taxpayer's employer may be served by mail or by delivery by an agent of the department and shall be in substantially the same form as provided in Minnesota Statutes 2022, section 571.75. Upon receipt of notice, the employer shall withhold from compensation due or to become due to the employee, the total amount shown by the notice, subject to the provisions of Minnesota Statutes 2022, section 571.922. The employer shall continue to withhold each pay period until the notice is released by the commissioner under section 270C.7109. Upon receipt of notice by the employer, the claim of the state of Minnesota shall have priority over any subsequent garnishments or wage assignments. The commissioner may arrange between the employer and the employee for withholding a portion of the total amount due the employee each pay period, until the total amount shown by the notice plus accrued interest has been withheld.\n(b) The \"compensation due\" any employee is defined in accordance with the provisions of Minnesota Statutes 2022, section 571.921. The maximum withholding allowed under this section for any one pay period shall be decreased by any amounts payable pursuant to a garnishment action with respect to which the employer was served prior to being served with the notice of delinquency and any amounts covered by any irrevocable and previously effective assignment of wages; the employer shall give notice to the commissioner of the amounts and the facts relating to such assignments within ten days after the service of the notice of delinquency on the form provided by the commissioner as noted in this section.\n(c) Within ten days after the expiration of such pay period, the employer shall remit to the commissioner, in the manner prescribed by the commissioner, the amount withheld during each pay period under this section. The employer must file all wage levy disclosure forms and remit all wage levy payments by electronic means.\nIf the employee ceases to be employed by the employer before the full amount set forth in a notice of delinquency plus accrued interest has been withheld, the employer shall immediately notify the commissioner in writing of the termination date of the employee and the total amount withheld. No employer may discharge any employee by reason of the fact that the commissioner has proceeded under subdivision 1. If an employer discharges an employee in violation of this provision, the employee shall have the same remedy as provided in section 571.927, subdivision 2.\nSubdivisions 1 and 2 apply to cases in which the employer is the United States or any instrumentality thereof or this state or any municipality or other subordinate unit thereof. The provisions imposing liability on the employer for failure to withhold or remit under section 270C.70 do not apply to such government employers.\nThe commissioner shall refund to the employee excess amounts withheld from the employee under this section. If any excess results from payments by the employer because of payments made under section 270C.70, the excess attributable to the employer's payment shall be refunded to the employer.\nEmployers required to withhold delinquent taxes, penalties, interest, and costs under this section shall not be required to compute any additional interest, costs or other charges to be withheld.\nThe collection remedy provided to the commissioner by this section shall have the same legal effect as if it were a levy made pursuant to section 270C.67.",
	"repealed": false
}