{
	"id": "275.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/275.065",
	"title": "275.065 PROPOSED PROPERTY TAXES; NOTICE.",
	"text": "(a) Notwithstanding any law or charter to the contrary, on or before September 30, each county, home rule charter or statutory city, town, and special taxing district, excluding the Metropolitan Council and the Metropolitan Mosquito Control Commission, shall certify to the county auditor the proposed property tax levy for taxes payable in the following year. For towns, the final certified levy shall also be considered the proposed levy.\n(b) Notwithstanding any law or charter to the contrary, on or before September 15, the Metropolitan Council and the Metropolitan Mosquito Control Commission shall adopt and certify to the county auditor a proposed property tax levy for taxes payable in the following year.\n(c) On or before September 30, each school district that has not mutually agreed with its home county to extend this date shall certify to the county auditor the proposed property tax levy for taxes payable in the following year. Each school district that has agreed with its home county to delay the certification of its proposed property tax levy must certify its proposed property tax levy for the following year no later than October 7. The school district shall certify the proposed levy as:\n(1) a specific dollar amount by school district fund, broken down between voter-approved and non-voter-approved levies and between referendum market value and tax capacity levies; or\n(2) the maximum levy limitation certified by the commissioner of education according to section 126C.48, subdivision 1.\n(d) If the board of estimate and taxation or any similar board that establishes maximum tax levies for taxing jurisdictions within a first class city certifies the maximum property tax levies for funds under its jurisdiction by charter to the county auditor by the date specified in paragraph (a), the city shall be deemed to have certified its levies for those taxing jurisdictions.\n(e) For purposes of this section, \"special taxing district\" means a special taxing district as defined in section 275.066. Intermediate school districts that levy a tax under chapter 124 or 136D, joint powers boards established under sections 123A.44 to 123A.445, and Common School Districts No. 323, Franconia, and No. 815, Prinsburg, are also special taxing districts for purposes of this section.\n(f) At the meeting at which a taxing authority, other than a town, adopts its proposed tax levy under this subdivision, the taxing authority shall announce the time and place of any subsequent regularly scheduled meetings at which the budget and levy will be discussed and at which the public will be allowed to speak. The time and place of those meetings must be included in the proceedings or summary of proceedings published in the official newspaper of the taxing authority under section 123B.09, 375.12, or 412.191.\nIn the case of a taxing authority lying in two or more counties, the home county auditor shall certify the proposed levy and the proposed local tax rate to the other county auditor by October 5, unless the home county has agreed to delay the certification of its proposed property tax levy, in which case the home county auditor shall certify the proposed levy and the proposed local tax rate to the other county auditor by October 10. The home county auditor must estimate the levy or rate in preparing the notices required in subdivision 3, if the other county has not certified the appropriate information. If requested by the home county auditor, the other county auditor must furnish an estimate to the home county auditor.\nMS 1990 [Repealed, 1992 c 511 art 3 s 9]\nIf two or more taxing authorities are in the process of negotiating an agreement for sharing, merging, or consolidating services between those taxing authorities at the time the proposed levy is to be certified under subdivision 1, each taxing authority involved in the negotiation shall certify its total proposed levy as provided in that subdivision, including a notification to the county auditor of the specific service involved in the agreement which is not yet finalized. The affected taxing authorities may amend their proposed levies under subdivision 1 until October 10 for levy amounts relating only to the specific service involved.\nIf a taxing authority fails to certify its proposed levy by the due dates specified under subdivisions 1, 1a, and 1c, the county auditor shall use the authority's previous year's final levy under section 275.07, subdivision 1, for purposes of determining its proposed property tax notices and public advertisements under this section.\nMS 1988 [Repealed, 1Sp1989 c 1 art 9 s 85]\n(a) The county auditor shall prepare and the county treasurer shall deliver after November 10 and on or before November 24 each year, by first class mail to each taxpayer at the address listed on the county's current year's assessment roll, a notice of proposed property taxes. Upon written request by the taxpayer, the treasurer may send the notice in electronic form or by electronic mail instead of on paper or by ordinary mail.\n(b) The commissioner of revenue shall prescribe the form of the notice.\n(c) The notice must inform taxpayers that it contains the amount of property taxes each taxing authority proposes to collect for taxes payable the following year. In the case of a town, or in the case of the state general tax, the final tax amount will be its proposed tax. The notice must clearly state for each city that has a population over 500, county, school district, regional library authority established under section 134.201, metropolitan taxing districts as defined in paragraph (i), and fire protection and emergency medical services special taxing districts established under section 144F.01, the time and place of a meeting for each taxing authority in which the budget and levy will be discussed and public input allowed, prior to the final budget and levy determination. The taxing authorities must provide the county auditor with the information to be included in the notice on or before the time it certifies its proposed levy under subdivision 1. The public must be allowed to speak at that meeting, which must occur after November 24 and must not be held before 6:00 p.m. It must provide a website address and a telephone number for the taxing authority that taxpayers may call if they have questions related to the notice and an address where comments will be received by mail, except that no notice required under this section shall be interpreted as requiring the printing of a personal telephone number or address as the contact information for a taxing authority. If a taxing authority does not maintain a website or public offices where telephone calls can be received by the authority, the authority may inform the county of the lack of a public website or telephone number and the county shall not list a website or telephone number for that taxing authority.\n(d) The notice must state for each parcel:\n(1) the market value of the property as determined under section 273.11, and used for computing property taxes payable in the following year and for taxes payable in the current year as each appears in the records of the county assessor on November 1 of the current year; and, in the case of residential property, whether the property is classified as homestead or nonhomestead. The notice must clearly inform taxpayers of the years to which the market values apply and that the values are final values;\n(2) the items listed below, shown separately by county, city or town, and state general tax, agricultural homestead credit under section 273.1384, school building bond agricultural credit under section 273.1387, voter approved school levy, other local school levy, and the sum of the special taxing districts, and as a total of all taxing authorities:\n(i) the actual tax for taxes payable in the current year; and\n(ii) the proposed tax amount.\nIf the county levy under clause (2) includes an amount for a lake improvement district as defined under sections 103B.501 to 103B.581, the amount attributable for that purpose must be separately stated from the remaining county levy amount.\nIn the case of a town or the state general tax, the final tax shall also be its proposed tax unless the town changes its levy at a special town meeting under section 365.52. If a school district has certified under section 126C.17, subdivision 9, that a referendum will be held in the school district at the November general election, the county auditor must note next to the school district's proposed amount that a referendum is pending and that, if approved by the voters, the tax amount may be higher than shown on the notice. In the case of the city of Minneapolis, the levy for Minneapolis Park and Recreation shall be listed separately from the remaining amount of the city's levy. In the case of the city of St. Paul, the levy for the St. Paul Library Agency must be listed separately from the remaining amount of the city's levy. In the case of Ramsey County, any amount levied under section 134.07 may be listed separately from the remaining amount of the county's levy. In the case of a parcel where tax increment or the fiscal disparities areawide tax under chapter 276A or 473F applies, the proposed tax levy on the captured value or the proposed tax levy on the tax capacity subject to the areawide tax must each be stated separately and not included in the sum of the special taxing districts; and\n(3) the increase or decrease between the total taxes payable in the current year and the total proposed taxes, expressed as a percentage.\nFor purposes of this section, the amount of the tax on homesteads qualifying under the senior citizens' property tax deferral program under chapter 290B is the total amount of property tax before subtraction of the deferred property tax amount.\n(e) The notice must clearly state that the proposed or final taxes do not include the following:\n(1) special assessments;\n(2) levies approved by the voters after the date the proposed taxes are certified, including bond referenda and school district levy referenda;\n(3) a levy limit increase approved by the voters by the first Tuesday after the first Monday in November of the levy year as provided under section 275.73;\n(4) amounts necessary to pay cleanup or other costs due to a natural disaster occurring after the date the proposed taxes are certified;\n(5) amounts necessary to pay tort judgments against the taxing authority that become final after the date the proposed taxes are certified; and\n(6) the contamination tax imposed on properties which received market value reductions for contamination.\n(f) Except as provided in subdivision 7, failure of the county auditor to prepare or the county treasurer to deliver the notice as required in this section does not invalidate the proposed or final tax levy or the taxes payable pursuant to the tax levy.\n(g) If the notice the taxpayer receives under this section lists the property as nonhomestead, and satisfactory documentation is provided to the county assessor by the applicable deadline, and the property qualifies for the homestead classification in that assessment year, the assessor shall reclassify the property to homestead for taxes payable in the following year.\n(h) In the case of class 4 residential property used as a residence for lease or rental periods of 30 days or more, the taxpayer must either:\n(1) mail or deliver a copy of the notice of proposed property taxes to each tenant, renter, or lessee; or\n(2) post a copy of the notice in a conspicuous place on the premises of the property.\nThe notice must be mailed or posted by the taxpayer by November 27 or within three days of receipt of the notice, whichever is later. A taxpayer may notify the county treasurer of the address of the taxpayer, agent, caretaker, or manager of the premises to which the notice must be mailed in order to fulfill the requirements of this paragraph.\n(i) For purposes of this subdivision and subdivision 6, \"metropolitan special taxing districts\" means the following taxing districts in the seven-county metropolitan area that levy a property tax for any of the specified purposes listed below:\n(1) Metropolitan Council under section 473.132, 473.167, 473.249, 473.325, 473.446, 473.521, 473.547, or 473.834;\n(2) Metropolitan Airports Commission under section 473.667, 473.671, or 473.672; and\n(3) Metropolitan Mosquito Control Commission under section 473.711.\nFor purposes of this section, any levies made by the regional rail authorities in the county of Anoka, Carver, Dakota, Hennepin, Ramsey, Scott, or Washington under chapter 398A shall be included with the appropriate county's levy.\n(j) The governing body of a county, city, or school district may, with the consent of the county board, include supplemental information with the statement of proposed property taxes about the impact of state aid increases or decreases on property tax increases or decreases and on the level of services provided in the affected jurisdiction. This supplemental information may include information for the following year, the current year, and for as many consecutive preceding years as deemed appropriate by the governing body of the county, city, or school district. It may include only information regarding:\n(1) the impact of inflation as measured by the implicit price deflator for state and local government purchases;\n(2) population growth and decline;\n(3) state or federal government action; and\n(4) other financial factors that affect the level of property taxation and local services that the governing body of the county, city, or school district may deem appropriate to include.\nThe information may be presented using tables, written narrative, and graphic representations and may contain instruction toward further sources of information or opportunity for comment.\nMS 2002 [Repealed, 1Sp2003 c 21 art 4 s 13]\nThe county auditor must prepare supplemental information to be delivered with the notice of proposed taxes described in subdivision 3. The information must fit on one sheet of paper and contain: for the county, all home rule charter or statutory cities and school districts within the county, the certified levy for the current taxes payable year, the proposed levy for taxes payable in the following year, and the increase or decrease between these two amounts, expressed as a percentage and each listed separately.\nThe supplemental information provided under this subdivision must be sent in electronic form or by email if the taxpayer requests an electronic version of the notice of proposed property taxes under subdivision 3, paragraph (a).\nIn the case of property subject to the areawide tax under section 276A.06, subdivision 7, for both the current year taxes and the proposed tax amounts, the net tax capacity portion of the taxes shown for each taxing jurisdiction must be based on the property's total net tax capacity multiplied by the jurisdiction's actual or proposed net tax capacity tax rate. In addition to the tax amounts shown for each jurisdiction, the statement must include a line showing the \"fiscal disparities adjustment\" equal to the total gross tax payable minus the sum of the tax amounts shown for the individual taxing jurisdictions. The fiscal disparities adjustment may be a negative number. If the fiscal disparities adjustment for either the current year taxes or the proposed tax amount is a negative number, the percentage change must not be shown. In all other respects the statement must fulfill the requirements of subdivision 3.\nIf the reasonable cost of the county auditor's services and the cost of preparing and mailing the notice required in this section exceed the amount distributed to the county by the commissioner of revenue to administer this section, the county may require the taxing authority to reimburse the county for the excess cost. The excess cost must be apportioned between taxing jurisdictions as follows:\n(1) one-third is allocated to the county;\n(2) one-third is allocated to cities and towns within the county; and\n(3) one-third is allocated to school districts within the county.\nThe amounts in clause (2) must be further apportioned among the cities and towns in the proportion that the number of parcels in the city and town bears to the number of parcels in all the cities and towns within the county. The amount in clause (3) must be further apportioned among the school districts in the proportion that the number of parcels in the school district bears to the number of parcels in all school districts within the county.\nMS 1998 [Repealed, 1Sp1989 c 1 art 9 s 85]\nMS 2008 [Repealed, 2009 c 88 art 3 s 10]\n(a) The property tax levy certified under section 275.07 by a city of any population, county, metropolitan special taxing district, regional library district, or school district must not exceed the proposed levy determined under subdivision 1, except by an amount up to the sum of the following amounts:\n(1) the amount of a school district levy whose voters approved a referendum to increase taxes under section 123B.63, subdivision 3, or 126C.17, subdivision 9, after the proposed levy was certified;\n(2) the amount of a city or county levy approved by the voters after the proposed levy was certified;\n(3) the amount of a levy to pay principal and interest on bonds approved by the voters under section 475.58 after the proposed levy was certified;\n(4) the amount of a levy to pay costs due to a natural disaster occurring after the proposed levy was certified, if that amount is approved by the commissioner of revenue under subdivision 6a;\n(5) the amount of a levy to pay tort judgments against a taxing authority that become final after the proposed levy was certified, if the amount is approved by the commissioner of revenue under subdivision 6a;\n(6) the amount of an increase in levy limits certified to the taxing authority by the commissioner of education or the commissioner of revenue after the proposed levy was certified;\n(7) the amount required under section 126C.55;\n(8) the levy to pay emergency debt certificates under section 475.755 authorized and issued after the proposed levy was certified; and\n(9) the amount of unallotment under section 16A.152 that was recertified under section 275.07, subdivision 6.\n(b) This subdivision does not apply to towns and special taxing districts other than regional library districts and metropolitan special taxing districts.\n(c) Notwithstanding the requirements of this section, the employer is required to meet and negotiate over employee compensation as provided for in chapter 179A.\n(a) A taxing authority may appeal to the commissioner of revenue for authorization to levy an amount over the amount of the proposed levy. The taxing authority must provide evidence satisfactory to the commissioner that it has incurred costs for the purposes specified in paragraph (b). The commissioner may approve an increase in the taxing authority's levy of up to the amount of costs incurred or a lesser amount determined by the commissioner. The commissioner's decision is final.\n(b) A levy addition may be made under paragraph (a) for the following costs incurred after the proposed levy is certified: (1) the unreimbursed costs to satisfy judgments rendered against the taxing authority by a court of competent jurisdiction in a tort action in excess of $50,000 or ten percent of the current year's proposed certified levy whichever is less; and (2) the costs incurred in clean up of a natural disaster. For purposes of this subdivision, \"natural disaster\" includes the occurrence or threat of widespread or severe damage, injury, or loss of life or property resulting from causes such as earthquake, fire, flood, windstorm, wave action, oil spill, water contamination, air contamination, or drought.\nMS 2008 [Repealed, 2009 c 88 art 3 s 10]\nMS 2008 [Repealed, 2009 c 88 art 3 s 10]\nAt the time the taxing authority certifies its tax levy under section 275.07, it shall certify to the commissioner of revenue its compliance with this section. The certification must contain the information required by the commissioner of revenue to determine compliance with this section. If the commissioner determines that the taxing authority has failed to substantially comply with the requirements of this section, the commissioner of revenue shall notify the county auditor. The decision of the commissioner is final. When fixing rates under section 275.08 for a taxing authority that has not complied with this section, the county auditor must use the taxing authority's previous year's levy, plus any additional amounts necessary to pay principal and interest on general obligation bonds of the taxing authority for which its taxing powers have been pledged if the bonds were issued before 1989.\nMS 2008 [Repealed, 2009 c 88 art 3 s 10]\nMS 2008 [Repealed, 2009 c 88 art 3 s 10]\nMS 2008 [Repealed, 2009 c 88 art 3 s 10]",
	"repealed": false
}