{
	"id": "59A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/59A.09",
	"title": "59A.09 MAXIMUM FINANCE CHARGE.",
	"text": "No person engaged in the business of financing insurance premiums may charge, contract for, receive or collect a finance charge plus flat service fee with respect to an insurance premium finance agreement other than as permitted by this section.\nThe finance charge shall be computed on the balance of the premiums due, after subtracting the down payment made by the insured in accordance with the premium finance agreement, from the effective date of the insurance coverage, for which the premiums are being advanced, to and including the date when final installment of the premium finance agreement is payable.\nThe finance charge must not exceed five percent in excess of the discount rate on 90-day commercial paper in effect at the Federal Reserve Bank located in the Ninth Federal Reserve District when an insurance premium finance agreement is made or when an additional or subsequent premium is added under an open end agreement. For expenses incurred in servicing the loan including any filing fees, application fee for the examination or investigation of the character of the borrower, comaker or security, and drawing any necessary papers in making the loan, an insurance premium finance company may contract for a flat rate service fee not exceeding the greater of one percent of the amount financed or $20 per premium finance agreement. The flat service fee need not be refunded upon prepayment in full before maturity.\nThe finance charge shall be computed in advance on the principal balance of a premium finance agreement according to the actuarial method on terms payable in substantially equal successive monthly installments.\nNotwithstanding the provisions of any premium finance agreement, any insured may prepay the obligation in full at any time. In such event the insured shall receive a refund credit. The amount of such refund credit shall represent at least as great a proportion of the finance charge as the sum of the periodic balances after the month in which prepayment is made bears to the sum of all periodic balances under the schedule of installments in the agreement. Where the amount of the refund is less than $1, no refund need be made. If, in addition to the finance charge, an additional flat service fee was imposed, the flat service fee need not be refunded nor taken into consideration in computing the refund credit.\nSubdivision 3 applies only to a premium finance agreement in which the related insurance contract is for personal, family, or household use. The rate charged under an agreement made to finance an insurance policy for business, agricultural, or corporate purposes shall be as agreed to by the parties to the agreement.",
	"repealed": false
}