{
	"id": "18.771",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.771",
	"title": "18.771 NOXIOUS WEED CATEGORIES.",
	"text": "(a) For purposes of designation under section 18.79, subdivision 13, noxious weed category means each of the following categories:\n(1) the prohibited-eradicate noxious weeds category;\n(2) the prohibited-control noxious weeds category;\n(3) the restricted noxious weeds category;\n(4) the specially regulated plants category; and\n(5) the county noxious weeds category.\n(b) The \"prohibited-eradicate noxious weeds\" category includes noxious weeds that must be eradicated on all lands within the state. Transportation of the propagating parts of prohibited-eradicate noxious weeds is prohibited except as allowed under section 18.82. Prohibited-eradicate noxious weeds may not be sold or propagated in Minnesota. Noxious weeds that are designated as prohibited-eradicate noxious weeds and placed on the prohibited-eradicate noxious weeds list are plants that are not currently known to be present in Minnesota or are not widely established in the state. All prohibited-eradicate noxious weeds must be eradicated.\n(c) The \"prohibited-control noxious weeds\" category includes noxious weeds that must be controlled on all lands within the state. Transportation of the propagating parts of prohibited-control noxious weeds is prohibited except as allowed under section 18.82. Prohibited-control noxious weeds may not be propagated or sold in Minnesota. Noxious weeds that are designated as prohibited-control noxious weeds and placed on the prohibited-control noxious weeds list are plants that are already established throughout the state or regions of the state. At a minimum, these species must be controlled in a way that prevents spread of these species by seed or vegetative means.\n(d) The \"restricted noxious weeds\" category includes noxious weeds and their propagating parts that may not be imported, sold, or transported in the state, except as allowed by permit under section 18.82. Noxious weeds that are designated as restricted and placed on the restricted list may be plants that are widely distributed in Minnesota and for which a requirement of eradication or control would not be feasible on a statewide basis using existing practices.\n(e) The \"specially regulated plants\" category includes noxious weeds that may be native species or nonnative species that have demonstrated economic value, but also have the potential to cause harm in noncontrolled environments. Plants designated as specially regulated have been determined to pose ecological, economical, or human or animal health concerns. Species-specific management plans or rules that define the use and management requirements for these plants must be developed by the commissioner of agriculture for each plant designated as specially regulated. The commissioner must also take measures to minimize the potential for harm caused by these plants.\n(f) The \"county noxious weeds\" category includes noxious weeds that are designated by individual county boards to be enforced as prohibited noxious weeds within the county's jurisdiction and must be approved by the commissioner of agriculture, in consultation with the Noxious Weed Advisory Committee. Each county board must submit newly proposed county noxious weeds to the commissioner of agriculture for review. Approved county noxious weeds shall also be posted with the county's general weed notice prior to May 15 each year. Counties are solely responsible for developing county noxious weed lists and their enforcement.",
	"repealed": false
}