{
	"id": "481.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/481.01",
	"title": "481.01 BOARD OF LAW EXAMINERS; EXAMINATIONS; ALTERNATIVE DISPUTE FEES.",
	"text": "The supreme court shall, by rule from time to time, prescribe the qualifications of all applicants for admission to practice law in this state, and shall appoint a Board of Law Examiners, which shall be charged with the administration of the rules and with the examination of all applicants for admission to practice law. The board shall consist of not less than three, nor more than seven, attorneys at law, who shall be appointed each for the term of three years and until a successor qualifies. The supreme court may fill any vacancy in the board for the unexpired term and in its discretion may remove any member of it. The board shall have a seal and shall keep a record of its proceedings, of all applications for admission to practice, and of persons admitted to practice upon its recommendation. At least two times a year the board shall hold examinations and report the result of them, with its recommendations, to the supreme court. Upon consideration of the report, the supreme court shall enter an order in the case of each person examined, directing the board to reject or to issue to the person a certificate of admission to practice. The board shall have such officers as may, from time to time, be prescribed and designated by the supreme court. The fee for examination shall be fixed, from time to time, by the supreme court. This fee, and any other fees which may be received pursuant to any rules the supreme court adopts governing the practice of law and court-related alternative dispute resolution practices shall be paid to the commissioner of management and budget and shall constitute a special fund in the state treasury which shall be exempt from section 16A.127. The money in this fund is appropriated annually to the supreme court for the payment of compensation and expenses of the members of the Board of Law Examiners and for otherwise regulating the practice of law. The money in the fund shall never cancel. Payments from it shall be made by the commissioner of management and budget upon vouchers signed by one of the justices of the supreme court. The members of the board shall have compensation and allowances for expenses as may, from time to time, be fixed by the supreme court.",
	"repealed": false
}