{
	"id": "256B.851",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.851",
	"title": "256B.851 COMMUNITY FIRST SERVICES AND SUPPORTS; PAYMENT RATES.",
	"text": "(a) The payment methodologies in this section apply to:\n(1) community first services and supports (CFSS), extended CFSS, and enhanced rate CFSS under section 256B.85; and\n(2) personal care assistance services under section 256B.0625, subdivisions 19a and 19c; extended personal care assistance services as defined in section 256B.0659, subdivision 1; and enhanced rate personal care assistance services under section 256B.0659, subdivision 17a.\n(b) This section does not change existing personal care assistance program or community first services and supports policies and procedures.\n(a) For purposes of this section, the following terms have the meanings given in section 256B.85, subdivision 2, and as follows.\n(b) \"Commissioner\" means the commissioner of human services.\n(c) \"Component value\" means an underlying factor that is built into the rate methodology to calculate service rates and is part of the cost of providing services.\n(d) \"Payment rate\" or \"rate\" means reimbursement to an eligible provider for services provided to a qualified individual based on an approved service authorization.\nWhen initially establishing the base wage component values, the commissioner must use the Minnesota-specific median wage for the standard occupational classification (SOC) codes published by the Bureau of Labor Statistics in the edition of the Occupational Handbook published in March 2021. The commissioner must calculate the base wage component values as follows for:\n(1) personal care assistance services, CFSS, extended personal care assistance services, and extended CFSS. The base wage component value equals the median wage for personal care aide (SOC code 31-1120);\n(2) enhanced rate personal care assistance services and enhanced rate CFSS. The base wage component value equals the product of median wage for personal care aide (SOC code 31-1120) and the value of the enhanced rate under section 256B.0659, subdivision 17a; and\n(3) qualified professional services and CFSS worker training and development. The base wage component value equals the sum of 70 percent of the median wage for registered nurse (SOC code 29-1141), 15 percent of the median wage for health care social worker (SOC code 21-1099), and 15 percent of the median wage for social and human service assistant (SOC code 21-1093).\n(a) The commissioner must multiply the base wage component values in subdivision 3 by one plus the appropriate competitive workforce factor. The product is the total wage component value.\n(b) For personal care assistance services, CFSS, extended personal care assistance services, extended CFSS, enhanced rate personal care assistance services, and enhanced rate CFSS, the initial competitive workforce factor is 4.7 percent.\n(c) For qualified professional services and CFSS worker training and development, the competitive workforce factor is zero percent.\n(a) The commissioner must use the following component values:\n(1) employee vacation, sick, and training factor, 8.71 percent;\n(2) employer taxes and workers' compensation factor, 11.56 percent;\n(3) employee benefits factor, 12.04 percent;\n(4) client programming and supports factor, 2.30 percent;\n(5) program plan support factor, 7.00 percent;\n(6) general business and administrative expenses factor, 13.25 percent;\n(7) program administration expenses factor, 2.90 percent; and\n(8) absence and utilization factor, 3.90 percent.\n(b) For purposes of implementation, the commissioner shall use the following implementation components:\n(1) personal care assistance services and CFSS: 88.19 percent;\n(2) enhanced rate personal care assistance services and enhanced rate CFSS: 88.19 percent; and\n(3) qualified professional services and CFSS worker training and development: 88.19 percent.\n(c) Effective January 1, 2025, for purposes of implementation, the commissioner shall use the following implementation components:\n(1) personal care assistance services and CFSS: 92.08 percent;\n(2) enhanced rate personal care assistance services and enhanced rate CFSS: 92.08 percent; and\n(3) qualified professional services and CFSS worker training and development: 92.08 percent.\n(d) The commissioner shall use the following worker retention components:\n(1) for workers who have provided fewer than 1,001 cumulative hours in personal care assistance services or CFSS, the worker retention component is zero percent;\n(2) for workers who have provided between 1,001 and 2,000 cumulative hours in personal care assistance services or CFSS, the worker retention component is 2.17 percent;\n(3) for workers who have provided between 2,001 and 6,000 cumulative hours in personal care assistance services or CFSS, the worker retention component is 4.36 percent;\n(4) for workers who have provided between 6,001 and 10,000 cumulative hours in personal care assistance services or CFSS, the worker retention component is 7.35 percent; and\n(5) for workers who have provided more than 10,000 cumulative hours in personal care assistance services or CFSS, the worker retention component is 10.81 percent.\n(e) The commissioner shall define the appropriate worker retention component based on the total number of units billed for services rendered by the individual provider since July 1, 2017. The worker retention component must be determined by the commissioner for each individual provider and is not subject to appeal.\n[See Note.]\n(a) The commissioner must determine the rate for personal care assistance services, CFSS, extended personal care assistance services, extended CFSS, enhanced rate personal care assistance services, enhanced rate CFSS, qualified professional services, and CFSS worker training and development as follows:\n(1) multiply the appropriate total wage component value calculated in subdivision 4 by one plus the employee vacation, sick, and training factor in subdivision 5;\n(2) for program plan support, multiply the result of clause (1) by one plus the program plan support factor in subdivision 5;\n(3) for employee-related expenses, add the employer taxes and workers' compensation factor in subdivision 5 and the employee benefits factor in subdivision 5. The sum is employee-related expenses. Multiply the product of clause (2) by one plus the value for employee-related expenses;\n(4) for client programming and supports, multiply the product of clause (3) by one plus the client programming and supports factor in subdivision 5;\n(5) for administrative expenses, add the general business and administrative expenses factor in subdivision 5, the program administration expenses factor in subdivision 5, and the absence and utilization factor in subdivision 5;\n(6) divide the result of clause (4) by one minus the result of clause (5). The quotient is the hourly rate;\n(7) multiply the hourly rate by the appropriate implementation component under subdivision 5. This is the adjusted hourly rate; and\n(8) divide the adjusted hourly rate by four. The quotient is the total adjusted payment rate.\n(b) In processing claims, the commissioner shall incorporate the worker retention component specified in subdivision 5, by multiplying one plus the total adjusted payment rate by the appropriate worker retention component under subdivision 5, paragraph (d).\n(c) The commissioner must publish the total final payment rates.\n[See Note.]\nAny rate adjustments applied to the service rates calculated under this section outside of the cost components and rate methodology specified in this section, including but not limited to those implemented to enable participant-employers and provider agencies to meet the terms and conditions of any collective bargaining agreement negotiated under chapter 179A, shall be applied as changes to the value of component values or implementation components in subdivision 5.\n(a) As determined by the commissioner and in consultation with stakeholders, agencies enrolled to provide services with rates determined under this section must submit requested cost data to the commissioner. The commissioner may request cost data, including but not limited to:\n(1) worker wage costs;\n(2) benefits paid;\n(3) supervisor wage costs;\n(4) executive wage costs;\n(5) vacation, sick, and training time paid;\n(6) taxes, workers' compensation, and unemployment insurance costs paid;\n(7) administrative costs paid;\n(8) program costs paid;\n(9) transportation costs paid;\n(10) staff vacancy rates; and\n(11) other data relating to costs required to provide services requested by the commissioner.\n(b) At least once in any three-year period, a provider must submit the required cost data for a fiscal year that ended not more than 18 months prior to the submission date. The commissioner must provide each provider a 90-day notice prior to its submission due date. If a provider fails to submit required cost data, the commissioner must provide notice to a provider that has not provided required cost data 30 days after the required submission date and a second notice to a provider that has not provided required cost data 60 days after the required submission date. The commissioner must temporarily suspend payments to a provider if the commissioner has not received required cost data 90 days after the required submission date. The commissioner must make withheld payments when the required cost data is received by the commissioner.\n(c) The commissioner must conduct a random validation of data submitted under this subdivision to ensure data accuracy. The commissioner shall analyze cost documentation in paragraph (a) and provide recommendations for adjustments to cost components.\n(d) The commissioner, in consultation with stakeholders, must develop and implement a process for providing training and technical assistance necessary to support provider submission of cost data required under this subdivision.\n(a) The commissioner shall evaluate on an ongoing basis whether the base wage component values and component values in this section appropriately address the cost to provide the service.\n(b) The commissioner shall analyze cost data submitted by provider agencies under subdivision 8 and report recommendations on component values, updated base wage component values, and competitive workforce factors to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over human services policy and finance every two years beginning August 1, 2026. The commissioner shall release cost data in an aggregate form, and cost data from individual providers shall not be released except as provided for in current law.\n(c) Beginning August 1, 2024, and every two years thereafter, the commissioner shall report recommendations to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health and human services policy and finance to update the base wage index in subdivision 3, the competitive workforce factors in subdivision 4, and the component values in subdivision 5 using the most recently available data. In making recommendations, the commissioner shall:\n(1) make adjustments to the competitive workforce factor toward the percent difference between:\n(i) the median wage for personal care aide (SOC code 31-1120); and\n(ii) the weighted average wage for all other SOC codes with the same Bureau of Labor Statistics classifications for education, experience, and training required for job competency;\n(2) not recommend an increase or decrease of the competitive workforce factor from its previous value of more than three percentage points;\n(3) not recommend a competitive workforce factor of less than zero;\n(4) make adjustments to the value of the base wage components based on the most recently available federal wage data; and\n(5) make adjustments to any component values affected by inflation, including but not limited to the client programming and supports factor.\nThe commissioner must assess the long-term impacts of the rate methodology implementation on staff providing services with rates determined under this section, including but not limited to measuring changes in wages, benefits provided, hours worked, and retention. The commissioner must publish evaluation findings in a report to the legislature by August 1, 2028, and once every two years thereafter.\nNothing in this section limits the commissioner's authority over terms and conditions for individual providers in covered programs as defined in section 256B.0711. The commissioner's authority over terms and conditions for individual providers in covered programs remains subject to the state's obligations to meet and negotiate under chapter 179A, as modified and made applicable to individual providers under section 179A.54, and to agreements with any exclusive representative of individual providers, as authorized by chapter 179A, as modified and made applicable to individual providers under section 179A.54. A change in the rate for services within the covered programs defined in section 256B.0711 does not constitute a change in a term or condition for individual providers in covered programs and is not subject to the state's obligation to meet and negotiate under chapter 179A.",
	"repealed": false
}