{
	"id": "325E.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.64",
	"title": "325E.64 ACCESS DEVICES; BREACH OF SECURITY.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Access device\" means a card issued by a financial institution that contains a magnetic stripe, microprocessor chip, or other means for storage of information which includes, but is not limited to, a credit card, debit card, or stored value card.\n(c) \"Breach of the security of the system\" has the meaning given in section 325E.61, subdivision 1, paragraph (d).\n(d) \"Card security code\" means the three-digit or four-digit value printed on an access device or contained in the microprocessor chip or magnetic stripe of an access device which is used to validate access device information during the authorization process.\n(e) \"Financial institution\" means any office of a bank, bank and trust, trust company with banking powers, savings bank, industrial loan company, savings association, credit union, or regulated lender.\n(f) \"Microprocessor chip data\" means the data contained in the microprocessor chip of an access device.\n(g) \"Magnetic stripe data\" means the data contained in the magnetic stripe of an access device.\n(h) \"PIN\" means a personal identification code that identifies the cardholder.\n(i) \"PIN verification code number\" means the data used to verify cardholder identity when a PIN is used in a transaction.\n(j) \"Service provider\" means a person or entity that stores, processes, or transmits access device data on behalf of another person or entity.\nNo person or entity conducting business in Minnesota that accepts an access device in connection with a transaction shall retain the card security code data, the PIN verification code number, or the full contents of any track of magnetic stripe data, subsequent to the authorization of the transaction or in the case of a PIN debit transaction, subsequent to 48 hours after authorization of the transaction. A person or entity is in violation of this section if its service provider retains such data subsequent to the authorization of the transaction or in the case of a PIN debit transaction, subsequent to 48 hours after authorization of the transaction.\nWhenever there is a breach of the security of the system of a person or entity that has violated this section, or that person's or entity's service provider, that person or entity shall reimburse the financial institution that issued any access devices affected by the breach for the costs of reasonable actions undertaken by the financial institution as a result of the breach in order to protect the information of its cardholders or to continue to provide services to cardholders, including but not limited to, any cost incurred in connection with:\n(1) the cancellation or reissuance of any access device affected by the breach;\n(2) the closure of any deposit, transaction, share draft, or other accounts affected by the breach and any action to stop payments or block transactions with respect to the accounts;\n(3) the opening or reopening of any deposit, transaction, share draft, or other accounts affected by the breach;\n(4) any refund or credit made to a cardholder to cover the cost of any unauthorized transaction relating to the breach; and\n(5) the notification of cardholders affected by the breach.\nThe financial institution is also entitled to recover costs for damages paid by the financial institution to cardholders injured by a breach of the security of the system of a person or entity that has violated this section. Costs do not include any amounts recovered from a credit card company by a financial institution. The remedies under this subdivision are cumulative and do not restrict any other right or remedy otherwise available to the financial institution.",
	"repealed": false
}