{
	"id": "245F.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/245F.15",
	"title": "245F.15 STAFF QUALIFICATIONS.",
	"text": "All staff who have direct patient contact must be at least 18 years of age.\nMS 2020 [Repealed, 2022 c 98 art 12 s 21]\nA program director must:\n(1) have at least one year of work experience in direct service to individuals with substance use disorders or one year of work experience in the management or administration of direct service to individuals with substance use disorders;\n(2) have a baccalaureate degree or three years of work experience in administration or personnel supervision in human services; and\n(3) know and understand the requirements of this chapter, sections 253B.04, 253B.051, 626.557, and 626.5572, and chapters 245A, 245C, and 260E.\nAn alcohol and drug counselor must meet the requirements in section 245G.11, subdivision 5.\nEach responsible staff person must know and understand the requirements of this chapter, sections 245A.65, 253B.04, 253B.051, 626.557, and 626.5572, and chapter 260E. In a clinically managed program, the responsible staff person must be a licensed practical nurse employed by or under contract with the license holder. In a medically monitored program, the responsible staff person must be a registered nurse, program director, or physician.\nA technician employed by a program must demonstrate competency, prior to direct patient contact, in the following areas:\n(1) knowledge of the client bill of rights in section 148F.165, and staff responsibilities in sections 144.651 and 253B.03;\n(2) knowledge of and the ability to perform basic health screening procedures with intoxicated patients that consist of:\n(i) blood pressure, pulse, temperature, and respiration readings;\n(ii) interviewing to obtain relevant medical history and current health complaints; and\n(iii) visual observation of a patient's health status, including monitoring a patient's behavior as it relates to health status;\n(3) a current first aid certificate from the American Red Cross or an equivalent organization; a current cardiopulmonary resuscitation certificate from the American Red Cross, the American Heart Association, a community organization, or an equivalent organization; and knowledge of first aid for seizures, trauma, and loss of consciousness; and\n(4) knowledge of and ability to perform basic activities of daily living and personal hygiene.\nRecovery peers must:\n(1) meet the qualifications in section 245I.04, subdivision 18; and\n(2) provide services according to the scope of practice established in section 245I.04, subdivision 19, under the supervision of an alcohol and drug counselor.\nA license holder must have a written policy addressing personal relationships between patients and staff who have direct patient contact. The policy must:\n(1) prohibit direct patient contact between a patient and a staff member if the staff member has had a personal relationship with the patient within two years prior to the patient's admission to the program;\n(2) prohibit access to a patient's clinical records by a staff member who has had a personal relationship with the patient within two years prior to the patient's admission, unless the patient consents in writing; and\n(3) prohibit a clinical relationship between a staff member and a patient if the staff member has had a personal relationship with the patient within two years prior to the patient's admission. If a personal relationship exists, the staff member must report the relationship to the staff member's supervisor and recuse the staff member from a clinical relationship with that patient.",
	"repealed": false
}