{
	"id": "3.9228",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.9228",
	"title": "3.9228 ADULT-USE CANNABIS; COMPACTS TO BE NEGOTIATED.",
	"text": "(a) As used in this section, the following terms have the meanings given.\n(b) \"Adult-use cannabis flower\" means cannabis flower approved for sale to adults under the law of a Minnesota Tribal government or under a compact entered under this section.\n(c) \"Adult-use cannabis product\" means cannabis product approved for sale to adults under the law of a Minnesota Tribal government or under a compact entered under this section.\n(d) \"Cannabis business\" means a cannabis cultivator, manufacturer, retailer, wholesaler, transporter, testing facility, microbusiness, mezzobusiness, event organizer, delivery service, or lower potency hemp edible manufacturer or retailer.\n(e) \"Cannabis industry\" means every item, product, person, process, action, business, or other thing or activity related to cannabis flower or cannabis products and subject to regulation under the law of a Minnesota Tribal government or under a compact entered under this section.\n(f) \"Cannabis product\" means any of the following:\n(1) cannabis concentrate;\n(2) a product infused with cannabinoids (whether artificially derived, or extracted or derived from cannabis plants or cannabis flower) including but not limited to tetrahydrocannabinol; or\n(3) any other product that contains cannabis concentrate.\n(g) \"Minnesota Tribal governments\" means the following federally recognized Indian Tribes located in Minnesota:\n(1) Bois Forte Band;\n(2) Fond Du Lac Band;\n(3) Grand Portage Band;\n(4) Leech Lake Band;\n(5) Mille Lacs Band;\n(6) White Earth Band;\n(7) Red Lake Nation;\n(8) Lower Sioux Indian Community;\n(9) Prairie Island Indian Community;\n(10) Shakopee Mdewakanton Sioux Community; and\n(11) Upper Sioux Indian Community.\n(h) \"Tribal cannabis business\" means a cannabis business licensed by a Minnesota Tribal government, including the business categories identified in paragraph (d), as well as any others that may be provided under the law of a Minnesota Tribal government.\n(i) \"Tribally regulated land\" means:\n(1) all land held in trust by the United States for the benefit of a Minnesota Tribal government (\"trust land\");\n(2) all land held by a Minnesota Tribal government in restricted fee status; and\n(3) all land within the exterior boundaries of the reservation of a Minnesota Tribal government that is subject to the civil regulatory jurisdiction of the Tribal government. For the purposes of this section, land that is subject to the civil regulatory jurisdiction of the Tribal government includes:\n(i) trust land, or fee land held, including leased land, by the Tribe, entities organized under Tribal law, or individual Indians; and\n(ii) land held, including leased land, by non-Indian entities or individuals who consent to the civil regulation of the Tribal government or are otherwise subject to such regulation under federal law.\n(a) The state of Minnesota acknowledges the sovereign right of Minnesota Tribal governments to regulate the cannabis industry and address other matters of cannabis regulation related to the internal affairs of Minnesota Tribal governments or otherwise within their jurisdiction, without regard to whether such Tribal government has entered a compact authorized by this section. The purpose of this section is to provide for the negotiation of compacts to proactively address jurisdictional issues related to the regulation of the cannabis industry. The legislature finds that these agreements will facilitate and promote a cooperative and mutually beneficial relationship between the state and the Tribes regarding the legalization of cannabis. Such cooperative agreements will enhance public health and safety, ensure a lawful and well-regulated cannabis market, encourage economic development, and provide fiscal benefits to both Indian Tribes and the state.\n(b) The governor or the governor's designee shall negotiate in good faith, and has the authority to execute and bind the state to, a compact with any Minnesota Tribal government wishing to enter into such compact regulating adult-use cannabis flower and adult-use cannabis products.\n(a) A compact agreed to under this section may address any issues related to the cannabis industry including adult-use cannabis flower, adult-use cannabis products, extracts, concentrates, and artificially derived cannabinoids that affect the interest of both the state and Minnesota Tribal government or otherwise have an impact on Tribal-state relations. Indian Tribes are not required to enter into compacts pursuant to this section in order to: regulate the cannabis industry, or engage in cannabis businesses or activities on Tribally regulated lands; or participate as a licensee in the state's legal cannabis market.\n(b) The state shall not, as a condition for entering into a compact under this section:\n(1) require any Minnesota Tribal government to waive any right, privilege, or immunity based on their status as independent sovereigns;\n(2) require that any revenue generated by cannabis businesses licensed by a Minnesota Tribal government be subject to any state cannabis gross receipt taxes imposed under section 295.81 or state and local sales or use taxes on sales of cannabis;\n(3) require any taxes collected by Minnesota Tribal governments to be shared in any manner with the state or any subdivisions thereof;\n(4) require a Minnesota Tribal government to consent to state licensing of cannabis businesses on the Tribally regulated land of the Minnesota Tribal government;\n(5) require any Minnesota Tribal government, or any cannabis business licensed by a Minnesota Tribal government pursuant to a compact agreed to under this section, to comply with specific state law or regulations on Tribally regulated land; or\n(6) impose, or attempt to impose, and shall not require or attempt to require any Indian Tribe to impose, any taxes, fees, assessments, and other charges related to the production, processing, sale, purchase, distribution, or possession of adult-use cannabis flower and adult-use cannabis products on Minnesota Tribal governments, or their members, on a reservation or Tribally regulated land.\n(c) Compacts agreed to under this section may allow an exemption from any otherwise applicable tax for: (i) sales to a Minnesota Tribal government, a Tribal cannabis business, or Tribal members, of cannabis flower and adult use cannabis products grown, produced, or processed as provided for in said compacts; or (ii) for activities of Tribal cannabis businesses.\n(a) Without limiting any immunity or exemption that may apply under federal law, the following acts, when performed by a Tribal cannabis business or an employee in the course of their employment for a Tribal cannabis business, pursuant to a compact entered into under this section, do not constitute a criminal or civil offense under state law:\n(1) the cultivation of cannabis flower, and the extraction, processing, or manufacture of adult-use cannabis and artificially derived cannabinoid products, extracts, or concentrates;\n(2) the possession, purchase, and receipt of adult-use cannabis seed, flower, and adult-use cannabis products that are properly packaged and labeled as authorized under a compact entered into pursuant to this section, and the sale, delivery, transport, or distribution of such products to a licensed cannabis business; and\n(3) the delivery, distribution, and sale of adult-use cannabis seed, flower, and adult-use cannabis products as authorized under a compact entered into pursuant to this section and that takes place on, or originates from, the premises of a Tribal cannabis business on Tribally regulated land, to any person 21 years of age or older.\n(b) The following acts, when performed by a patron of a Tribal cannabis business do not constitute a criminal or civil offense under state law: the purchase, possession, or receipt of adult-use cannabis seed, flower, and adult-use cannabis products as authorized under a compact entered into pursuant to this section.\n(c) Without limiting any immunity or exemption that may apply under federal law, actions by a Tribal cannabis business, a Tribal member, employee, or agent of a Minnesota Tribal government or Tribal cannabis business on Tribally regulated land pursuant to Tribal laws governing cannabis, or a compact entered into under this section, do not constitute a criminal or civil offense under state law.\n(d) The following acts, when performed by a state-licensed cannabis business, or an employee of such business, and which would be permitted under the terms of the applicable cannabis business license if undertaken with another state-licensed cannabis business, are permitted under the state license conditions when undertaken with a Tribal cannabis business and do not constitute a criminal or civil offense under state law: the possession, purchase, wholesale and retail sale, delivery, transport, distribution, and receipt of adult-use cannabis, seed, flower, and adult-use cannabis products that are properly packaged and labeled as authorized under a compact entered into pursuant to this section.\n(e) Without limiting any immunity or exemption that may apply under federal law, the following acts, when performed by a Minnesota Tribal government, a Tribal cannabis business licensed by such Tribal government, or an employee of such Tribal government or Tribal cannabis business, regardless of whether the Minnesota Tribal government issuing such license has compacted with the state under this section, do not constitute a criminal or civil offense under state law: purchase, sale, receipt, or delivery (including delivery that involves transit through the state, outside a reservation), of adult-use cannabis flower, seed, or adult-use cannabis product from or to another Minnesota Tribal government or cannabis business licensed by such government.\n(f) Notwithstanding any other provision of law, a state-licensed cannabis testing facility may provide cannabis testing services to a Tribal cannabis business, and the possession or transport of cannabis flower or cannabis products for such purpose by a Tribal cannabis business shall not constitute a criminal or civil offense under state law.\nThe governor shall post any compact entered into under this section on a publicly accessible website.",
	"repealed": false
}