{
	"id": "3.099",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.099",
	"title": "3.099 MEMBERS; COMPENSATION AND EXPENSES, FLEXIBLE SESSIONS.",
	"text": "The compensation of each member of the legislature is due on the first day of the regular legislative session of the term and payable in equal parts on January 15, in the first month of each term and on the first day of each following month during the term for which the member was elected. The compensation of each member of the legislature elected at a special election is due on the day the member takes the oath of office and payable within ten days of taking the oath for the remaining part of the month in which the oath was taken, and then in equal parts on the first day of each following month during the term for which the member was elected.\nEach member shall receive mileage for necessary travel to the place of meeting and returning to the member's residence in the amount and for trips as authorized by the senate for senate members and by the house of representatives for house members.\nEach member shall also receive per diem living expenses during a regular or special session of the legislature in the amounts and for the purposes as determined by the senate for senate members and by the house of representatives for house members.\nOn January 15 in the first month of each term and on the first day of each following month, the secretary of the senate and the chief clerk of the house of representatives shall certify to the commissioner of management and budget, in duplicate, the amount of compensation then payable to each member of their respective houses and its total.\n[Repealed, 1987 c 404 s 191]\nThe senate Committee on Rules and Administration for the senate and the house of representatives Committee on Rules and Legislative Administration for the house of representatives may each designate for their respective body up to five leadership positions to receive up to 140 percent of the compensation of other members.\nAt the commencement of each biennial legislative session, each house of the legislature shall adopt a resolution designating its majority and minority leader.\nThe majority leader is the person elected by the caucus of members in each house which is its largest political affiliation. The minority leader is the person elected by the caucus which is its second largest political affiliation.",
	"repealed": false
}