{
	"id": "151.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.58",
	"title": "151.58 AUTOMATED DRUG DISTRIBUTION SYSTEMS.",
	"text": "This section applies only to the use of automated drug distribution systems located within the facilities specified in subdivision 2. Except as provided in this section, all applicable provisions of this chapter, chapter 152, and Minnesota Rules, chapter 6800, must be followed.\nFor purposes of this section only, the terms defined in this subdivision have the meanings given.\n(a) \"Automated drug distribution system\" or \"system\" means a mechanical system approved by the board that performs operations or activities, other than compounding or administration, related to the storage, packaging, or dispensing of drugs, and collects, controls, and maintains all required transaction information and records.\n(b) \"Health care facility\" means a nursing home licensed under section 144A.02; an assisted living facility licensed under chapter 144G; a home provider licensed under chapter 144A providing centralized storage of medications; a boarding care home licensed under sections 144.50 to 144.58 that is providing centralized storage of medications; or a Minnesota Sex Offender Program facility operated by Direct Care and Treatment.\n(c) \"Managing pharmacy\" means a pharmacy licensed by the board that controls and is responsible for the operation of an automated drug distribution system.\nA pharmacy may use an automated drug distribution system to fill prescription drug orders for patients of a health care facility provided that the policies and procedures required by this section have been approved by the board. The automated drug distribution system may be located in a health care facility that is not at the same location as the managing pharmacy. When located within a health care facility, the system is considered to be an extension of the managing pharmacy.\n(a) At least 60 days prior to the initial use of an automated drug distribution system, the managing pharmacy must provide the board with written notification of the address at which the automated drug distribution system will be located, the manufacturer and model of the automated drug distribution system, and written policies and procedures that govern the operation of the system. The policies and procedures must address the requirements of subdivision 5 and the rules of the board. If the managing pharmacy will be using a system identical to the one for which it has previously provided notification to the board, and will be using identical policies and procedures, it must notify the board of the address at which the automated drug distribution system will be located and the manufacturer and model of the automated drug distribution system at least seven days in advance of using the system.\n(b) The managing pharmacy must notify the board whenever an automated drug distribution system is taken permanently out of service.\n(c) The managing pharmacy must notify the board whenever an automated drug distribution system is replaced. It must also provide the board with new written policies and procedures, unless an identical system is used as the replacement, 60 days prior to the replacement of the system.\n(a) The managing pharmacy and the pharmacist in charge are responsible for the operation of an automated drug distribution system.\n(b) Access to an automated drug distribution system must be limited to pharmacy and nonpharmacy personnel authorized to procure drugs from the system, except that field service technicians may access a system located in a health care facility for the purposes of servicing and maintaining it while being monitored either by the managing pharmacy, or a licensed nurse within the health care facility. In the case of an automated drug distribution system that is not physically located within a licensed pharmacy, access for the purpose of procuring drugs shall be limited to licensed nurses. Each person authorized to access the system must be assigned an individual specific access code. Alternatively, access to the system may be controlled through the use of biometric identification procedures. A policy specifying time access parameters, including time-outs, logoffs, and lockouts, must be in place.\n(c) For the purposes of this section only, the requirements of section 151.215 are met if the following clauses are met:\n(1) a pharmacist employed by and working at the managing pharmacy, or at a pharmacy that is acting as a central services pharmacy for the managing pharmacy, pursuant to Minnesota Rules, part 6800.4075, must review, interpret, and approve all prescription drug orders before any drug is distributed from the system to be administered to a patient. A pharmacy technician may perform data entry of prescription drug orders provided that a pharmacist certifies the accuracy of the data entry before the drug can be released from the automated drug distribution system. A pharmacist employed by and working at the managing pharmacy must certify the accuracy of the filling of any cassettes, canisters, or other containers that contain drugs that will be loaded into the automated drug distribution system, unless the filled cassettes, canisters, or containers have been provided by a repackager registered with the United States Food and Drug Administration and licensed by the board as a manufacturer; and\n(2) when the automated drug dispensing system is located and used within the managing pharmacy, a pharmacist must personally supervise and take responsibility for all packaging and labeling associated with the use of an automated drug distribution system.\n(d) Access to drugs when a pharmacist has not reviewed and approved the prescription drug order is permitted only when a formal and written decision to allow such access is issued by the pharmacy and the therapeutics committee or its equivalent. The committee must specify the patient care circumstances in which such access is allowed, the drugs that can be accessed, and the staff that are allowed to access the drugs.\n(e) In the case of an automated drug distribution system that does not utilize bar coding in the loading process, the loading of a system located in a health care facility may be performed by a pharmacy technician, so long as the activity is continuously supervised, through a two-way audiovisual system by a pharmacist on duty within the managing pharmacy. In the case of an automated drug distribution system that utilizes bar coding in the loading process, the loading of a system located in a health care facility may be performed by a pharmacy technician or a licensed nurse, provided that the managing pharmacy retains an electronic record of loading activities.\n(f) The automated drug distribution system must be under the supervision of a pharmacist. The pharmacist is not required to be physically present at the site of the automated drug distribution system if the system is continuously monitored electronically by the managing pharmacy. A pharmacist on duty within a pharmacy licensed by the board must be continuously available to address any problems detected by the monitoring or to answer questions from the staff of the health care facility. The licensed pharmacy may be the managing pharmacy or a pharmacy which is acting as a central services pharmacy, pursuant to Minnesota Rules, part 6800.4075, for the managing pharmacy.",
	"repealed": false
}