{
	"id": "347.542",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.542",
	"title": "347.542 RESTRICTIONS.",
	"text": "Except as provided in subdivision 3, no person may own a dog if the person has:\n(1) been convicted of a third or subsequent violation of section 347.51, 347.515, or 347.52;\n(2) been convicted of a violation under section 609.205, clause (4);\n(3) been convicted of a gross misdemeanor under section 609.226, subdivision 1;\n(4) been convicted of a violation under section 609.226, subdivision 2; or\n(5) had a dog ordered destroyed under section 347.56 and been convicted of one or more violations of section 347.51, 347.515, 347.52, or 609.226, subdivision 2.\nIf any member of a household is prohibited from owning a dog in subdivision 1, unless specifically approved with or without restrictions by an animal control authority, no person in the household is permitted to own a dog.\nBeginning three years after a conviction under subdivision 1 that prohibits a person from owning a dog, and annually thereafter, the person may request that the animal control authority review the prohibition. The animal control authority may consider such facts as the seriousness of the violation or violations that led to the prohibition, any criminal convictions, or other facts that the animal control authority deems appropriate. The animal control authority may rescind the prohibition entirely or rescind it with limitations. The animal control authority also may establish conditions a person must meet before the prohibition is rescinded, including, but not limited to, successfully completing dog training or dog handling courses. If the animal control authority rescinds a person's prohibition and the person subsequently fails to comply with any limitations imposed by the animal control authority or the person is convicted of any animal violation involving unprovoked bites or dog attacks, the animal control authority may permanently prohibit the person from owning a dog in this state.",
	"repealed": false
}