{
	"id": "115E.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/115E.03",
	"title": "115E.03 DUTY TO PREPARE FOR RESPONSE TO DISCHARGES.",
	"text": "A person who owns or operates a vessel or facility transporting, storing, or otherwise handling hazardous substances or oil or who is otherwise in control of hazardous substances or oil shall be prepared at all times to rapidly and thoroughly recover discharged hazardous substances or oil that were under that person's control and to take all other actions necessary to minimize or abate pollution of land, waters, and air of the state and to protect the public's safety and health.\nThe following persons shall comply with the specific requirements of subdivisions 3 and 4 and section 115E.04:\n(1) persons who own or operate a vessel that is constructed or adapted to carry, or that carried, oil or hazardous substances in bulk as cargo or cargo residue;\n(2) persons who own or operate railroad car rolling stock transporting an aggregate total of more than 100,000 gallons of oil or hazardous substance as cargo in Minnesota in any calendar month;\n(3) persons who own or operate facilities containing 1,000,000 gallons or more of oil or hazardous substance in tank storage at any time;\n(4) persons who own or operate facilities where there is transfer of an average monthly aggregate total of more than 1,000,000 gallons of oil or hazardous substances to or from vessels, tanks, rolling stock, or pipelines, except for facilities where the primary transfer activity is the retail sales of motor fuels;\n(5) persons who own or operate hazardous liquid pipeline facilities through which more than 100,000 gallons of oil or hazardous substance is transported in any calendar month; and\n(6) persons required to demonstrate preparedness under section 115E.05.\nA person described in subdivision 2 shall maintain a level of preparedness that ensures that effective response can reliably be made to worst case discharges.\nA person required to maintain preparedness under subdivision 2 may demonstrate satisfactory preparedness to the commissioner of the lead agency through one or a combination of the following means:\n(1) adequate response personnel and equipment in the usual employ of the person;\n(2) adequate response personnel and equipment available from for-hire cleanup contractors with arrangements made for their deployment;\n(3) adequate response personnel and equipment from a response cooperative or community awareness and emergency response organization meeting guidelines prepared by the lead agency with arrangements made for their deployment; or\n(4) adequate response personnel and equipment of local, state, or federal public sector response organizations with arrangements made for their deployment.\nThe commissioner of transportation may examine the evidence of financial responsibility required under section 1016 of the Oil Pollution Act of 1990 for a vessel and may apply the sanctions in that section.",
	"repealed": false
}