{
	"id": "103I.341",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.341",
	"title": "103I.341 COLLECTION AND ENFORCEMENT OF WELL SEALING COSTS.",
	"text": "The commissioner and the Board of Water and Soil Resources have a governmental services lien under section 514.67 for the costs of sealing a well or boring that the commissioner or board has contracted to be sealed under section 103I.315, subdivision 2; or 103I.335. The lien attaches to the real property where the well or boring is located. The lien is perfected by recording the lien with the county recorder or registrar of titles where the well or boring and the property are located and serving or mailing by return receipt a copy of the lien to the property owner.\nThe commissioner or the Board of Water and Soil Resources may enforce the lien in the manner provided for a judgment lien under chapter 550 or certify the amount to the county auditor, which must be assessed against the property and collected in the same manner as real estate taxes.\n(a) In lieu of certifying the entire amount to be collected, the commissioner or the Board of Water and Soil Resources may have the amount due assessed in seven or less equal annual installments plus interest due at the rate determined by the state court administrator for judgments under section 549.09.\n(b) The interest due is an additional perfected lien on the property without further action by the commissioner or the Board of Water and Soil Resources.\n(c) The interest and the installment due must be entered on the tax lists for the year and collected in the same manner as real estate taxes for that year by collecting one-half of the total of the installment and interest with and as part of the real estate taxes.\nThe amount due and interest of a lien under this section may be paid at any time. When the amount of the lien including accrued interest is paid, the commissioner or board must execute a satisfaction of the lien and record the satisfaction with the county recorder or registrar of titles where the lien was recorded.\nCosts of sealing wells recovered from property owners by the Board of Water and Soil Resources must be deposited in the state treasury and credited to the account from which the amounts were originally appropriated. The amounts are continuously appropriated to the board for sealing wells.",
	"repealed": false
}