{
	"id": "290.0922",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0922",
	"title": "290.0922 MINIMUM FEE; CORPORATIONS; PARTNERSHIPS.",
	"text": "(a) In addition to the tax imposed by this chapter without regard to this section, the franchise tax imposed on a corporation required to file under section 289A.08, subdivision 3, other than a corporation treated as an \"S\" corporation under section 290.9725 for the taxable year includes a tax equal to the following amounts:\n(b) A tax is imposed for each taxable year on a corporation required to file a return under section 289A.12, subdivision 3, that is treated as an S corporation under section 290.9725 and on a partnership required to file a return under section 289A.12, subdivision 3, other than a partnership that derives over 80 percent of its income from farming. The tax imposed under this paragraph is due on or before the due date of the return for the taxpayer due under section 289A.18, subdivision 1. The commissioner shall prescribe the return to be used for payment of this tax. The tax under this paragraph is equal to the following amounts:\n(c) The commissioner shall annually adjust the dollar amounts of both the tax and the property, payrolls, and sales or receipts thresholds in paragraphs (a) and (b) as provided in section 270C.22. The statutory year is taxable year 2019. The tax amounts as adjusted must be rounded to the nearest $10 amount and the threshold amounts must be adjusted to the nearest $10,000 amount. For tax amounts that end in $5, the amount is rounded up to the nearest $10 amount and for the threshold amounts that end in $5,000, the amount is rounded up to the nearest $10,000.\n[See Note.]\nThe following entities are exempt from the tax imposed by this section:\n(1) corporations exempt from tax under section 290.05;\n(2) real estate investment trusts;\n(3) regulated investment companies or a fund thereof;\n(4) entities having a valid election in effect under section 860D(b) of the Internal Revenue Code;\n(5) township mutual insurance companies;\n(6) cooperatives organized under chapter 308A, 308B, or 308C that provide housing exclusively to persons age 55 and over and are classified as homesteads under section 273.124, subdivision 3; and\n(7) a qualified business as defined under section 469.310, subdivision 11, if for the taxable year all of its property is located in a job opportunity building zone designated under section 469.314 and all of its payroll is a job opportunity building zone payroll under section 469.310.\nEntities not specifically exempted by this subdivision are subject to tax under this section, notwithstanding section 290.05.\n[See Note.]\n(a) \"Minnesota sales or receipts\" means the total sales apportioned to Minnesota pursuant to section 290.191, subdivision 5, the total receipts attributed to Minnesota pursuant to section 290.191, subdivisions 6 to 8, and/or the total sales or receipts apportioned or attributed to Minnesota pursuant to any other apportionment formula applicable to the taxpayer.\n(b) \"Minnesota property\" means total Minnesota tangible property as provided in section 290.191, subdivisions 9 to 11, any other tangible property located in Minnesota, but does not include the property of a qualified business as defined under section 469.310, subdivision 11, that is located in a job opportunity building zone designated under section 469.314. Intangible property shall not be included in Minnesota property for purposes of this section. Taxpayers who do not utilize tangible property to apportion income shall nevertheless include Minnesota property for purposes of this section. On a return for a short taxable year, the amount of Minnesota property owned, as determined under section 290.191, shall be included in Minnesota property based on a fraction in which the numerator is the number of days in the short taxable year and the denominator is 365.\n(c) \"Minnesota payrolls\" means total Minnesota payrolls as provided in section 290.191, subdivision 12, but does not include the job opportunity building zone payroll under section 469.310, subdivision 8, of a qualified business as defined under section 469.310, subdivision 11. Taxpayers who do not utilize payrolls to apportion income shall nevertheless include Minnesota payrolls for purposes of this section.\nFor the purposes of this section, a partner's pro rata share of a partnership's property, payroll, and sales or receipts is not included in the property, payroll, and sales or receipts of the partner.",
	"repealed": false
}