{
	"id": "353.032",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.032",
	"title": "353.032 APPLICATION FOR PSYCHOLOGICAL CONDITION TREATMENT.",
	"text": "For the purposes of this section, the following terms have the meanings given:\n(1) \"mental illness\" means diagnosis of a mental illness by a mental health professional, and meeting the criteria for a condition or conditions included in the most recent edition of the Diagnostic and Statistical Manual of Mental Disorders published by the American Psychiatric Association;\n(2) \"employee\" means an individual diagnosed with a mental illness who is a member under section 353.64 or was a member under section 353.64 within the 18 months preceding the date of the application under subdivision 2;\n(3) \"employer\" means an employer of a current or former member of the police and fire plan;\n(4) \"firefighter\" has the meaning given in section 299A.465, subdivision 5, paragraph (c);\n(5) \"mental health professional\" has the meaning given in section 245I.02, subdivision 27;\n(6) \"peace officer\" has the meaning given in section 299A.465, subdivision 5, paragraph (a);\n(7) \"psychological condition\" means a mental illness, as defined in clause (1); and\n(8) \"treatment\" includes but is not limited to active participation in psychological, psychopharmaceutical, and functional neurological approaches and active participation in the International Association of Fire Fighters Center of Excellence for Behavioral Health Treatment and Recovery. Treatment includes utilization of multiple treatment modalities, including chemical dependency treatment when indicated, and evidence-based trauma treatment.\n(a) Notwithstanding any law to the contrary, and except as provided in paragraph (b), the procedure in this section applies to an application for a duty disability by an employee based on a psychological condition.\n(b) The additional procedure in this section does not apply to a duty disability application under paragraph (a) that is also based on a dual diagnosis of a physical condition. An employee with a dual diagnosis may, but is not required to, seek treatment under subdivisions 4 and 7, subject to the procedure in this section.\n(a) An employee who applies for treatment of a psychological condition that was a result of the performance of duties related to the occupation must receive approval for psychological treatment as provided under this subdivision.\n(b) The executive director shall grant approval to an employee who submits, in the form and manner specified by the executive director:\n(1) a report by a mental health professional diagnosing the employee with a mental illness and finding that the employee is currently unable to perform the normal duties of the position held by the employee on the date of the injury, event, or onset of the mental illness on a full- or part-time basis; and\n(2) documentation from the employer certifying the dates the employee was on duty in a position covered under the police and fire plan.\n(c) An employee who receives approval under this subdivision is not considered disabled for the purposes of a duty disability under section 353.656, subdivision 1, unless the employee completes the additional requirements under this section, receives final confirmation under subdivision 6, and applies for disability benefits under section 353.031 before receiving duty disability benefits or related benefits.\n(d) The executive director must notify an employing entity electronically and by mail that an application for psychological condition treatment has been submitted by an employee and request the certification required under paragraph (b), clause (2), from the employing entity within six business days after the application has been received by the executive director.\n(e) An employer shall submit the certification required under paragraph (b), clause (2), within five business days of receiving notice from the executive director, and the employee shall receive approval no later than 14 business days after the employee's application is received by the executive director, whether or not the employer's certification has been submitted. Nothing in this paragraph shall delay the treatment of the psychological condition of the employee.\n(a) Except as provided in paragraph (f), an employee who receives approval under subdivision 3 shall complete up to 24 consecutive weeks of active treatment modalities for the employee's diagnosed mental illness, as provided under this subdivision, before a final confirmation can be made under subdivision 6. Treatment shall be at the direction of a mental health professional using treatment modalities indicated for the treatment of the diagnosed mental illness. An employee shall not be penalized for an interruption in active, consecutive treatment that is not initiated by or resulting from an intentional action of the employee. Subject to the limit under subdivision 9, the employer shall pay for the treatment costs to the extent not paid for by the employee's health insurance and may seek reimbursement.\n(b) The employee's mental health professional must assess the employee's progress in treatment monthly and at the end of the 24 weeks or earlier, including any change to the employee's ability to return to the position held by the employee on the date of the injury, event, or onset of the mental illness, or to another position with the employer which provides salary and employer-provided benefits, including pension benefits, that are equal to or greater than those for the position held by the employee on the date of the injury, event, or onset of the mental illness. A final confirmation under subdivision 6 must be supported by a report from the employee's mental health professional containing an opinion about the employee's prognosis, the duration of the disability, and the expectations for improvement following the treatment. A report that does not contain and support a finding that the employee's disability as a result of a psychological condition will last for at least 12 months must not be relied upon to support approval of duty disability benefits.\n(c) The employee may return to full- or part-time work prior to the completion of the 24 weeks of treatment if the employee's mental health professional determines that they are medically able to do so.\n(d) The employee may return to light duty assignments, subject to availability of a position, prior to the completion of the 24 weeks of treatment, if deemed medically appropriate by the employee's mental health professional and with the employer's approval.\n(e) A fitness for duty presumption shall apply to an employee who is cleared to return to work or light duty under paragraph (c) or (d), except as provided under subdivision 10.\n(f) No employee shall be required to complete treatment under this subdivision more than three times in ten years.\n(a) Subject to subdivision 9, for the period that an employee is seeking psychological condition treatment approval under subdivision 3 or 6, appealing a determination thereof, or receiving treatment under subdivision 4 or 7, the employer shall continue:\n(1) to pay, for a current employee only, the employee's full salary and employer-provided benefits, including any employer contribution to health care and retirement benefits. The employer must proportionally reduce the salary paid to an employee who is otherwise receiving benefits for the disability that provide compensation for all or a portion of the employee's salary for the same time period. Nothing in this paragraph requires an employer to pay more than 100 percent of the employee's salary;\n(2) to provide health insurance benefits to the employee and to the employee's dependents, if the employee was receiving dependent coverage at the time of the injury, event, or onset of the mental illness under the employer's group health plan; and\n(3) to provide any other employment benefits provided to the employee under the employee's currently applicable collective bargaining agreement.\n(b) An employee shall obtain service credit for the treatment period required under subdivision 4 or 7.\n(c) Nothing prevents an employer from providing benefits in addition to those required by this section or otherwise affects an employee's rights with respect to any other employment benefit.\n(d) If an employee is unable to receive treatment through the prescribed treatment program due to circumstances beyond the employee's control, which includes but is not limited to a lack of availability of a mental health facility or a mental health professional, the employee shall continue to receive their regular compensation, benefits, and retirement service credits, until such mental health facility or mental health professional becomes available to the employee for their treatment program. The continuation of salary and benefits allowed under this paragraph must not exceed 30 days beyond the day treatment is prescribed, except that continuation of benefits and salary may be extended beyond 30 days if written documentation from the mental health facility or mental health professional providing the treatment start date is submitted by the employee to the executive director and the employer.\n(a) Following completion of treatment under subdivision 4, the association shall confirm the treatment requirements are satisfied, and make one of the following determinations:\n(1) continue the approval for an additional eight weeks for the employee to complete additional treatment, as provided under subdivision 7;\n(2) terminate the psychological condition treatment because the employee is:\n(i) able to return to full-time work in the position held by the employee on the date of the injury, event, or onset of the mental illness; or\n(ii) able to return to another vacant full-time position with the employer which provides salary and employer-provided benefits, including pension benefits, that are equal to or greater than those for the position held by the employee on the date of the injury, event, or onset of the mental illness, as certified by the employer in the form and manner specified by the executive director; or\n(3) confirm the employee has met the requirements under section 353.032, after which the employee may apply for a duty disability benefit based on a psychological condition under section 353.031.\n(b) After confirmation and application under paragraph (a), clause (3), the association must approve the employee's application for disability benefits if the employee is eligible under section 353.031, at which time the employee is entitled to receive disability benefits as provided under this section and any related benefits. The disability benefit begins to accrue the day following the day on which the employer ceases to continue salary and benefits under subdivision 5 and section 353.656, subdivision 4, paragraph (a).\n(c) Following completion of the additional treatment requirements under subdivision 7, if applicable, the association shall confirm the additional treatment requirements are satisfied, after which, the employee may apply for disability benefits because the employee is eligible under section 353.031, at which time the employee is entitled to receive disability benefits as provided under this section and any related benefits. The disability benefit begins to accrue the day following the day on which the employer ceases to continue salary and benefits under subdivision 5 and section 353.656, subdivision 4, paragraph (a).\n(d) A fitness for duty presumption shall apply to an employee who is determined able to return to work as provided under paragraph (a), clause (2), except as provided under subdivision 10.\n(a) Except as provided in paragraph (g), if, after completing the treatment required under subdivision 4, the mental health professional's report determines that the employee is making progress in treatment, and the employee's prognosis is expected to further improve with additional treatment, the association shall continue the employee's initial approval under subdivision 6, paragraph (a), clause (1), and the employee shall complete up to an additional eight consecutive weeks of active treatment modalities as provided under this subdivision.\n(b) Treatment shall be at the direction of a mental health professional using treatment modalities indicated for the treatment of the employee's diagnosed mental illness. An employee shall not be penalized for an interruption in active, consecutive treatment that is not initiated by or resulting from an intentional action of the employee. Subject to subdivision 9, the employer shall pay for the treatment costs to the extent not paid for by the employee's health insurance and may seek reimbursement.\n(c) The employee's mental health professional must assess the employee's progress in treatment at the end of eight weeks, including any change to the employee's ability to return to the position held by the employee on the date of the injury, event, or onset of the mental illness, or to another position with the employer which provides salary and employer-provided benefits, including pension benefits, that are equal to or greater than those for the position held by the employee on the date of the injury, event, or onset of the mental illness. A final confirmation under subdivision 6, paragraph (b), must be supported by an updated report from the employee's mental health professional containing an opinion about the employee's prognosis, the duration of the disability, and the expectations for improvement following the additional treatment. An updated report that does not contain and support a finding that the employee's disability as a result of a psychological condition will last for at least 12 months must not be relied upon to support approval of duty disability benefits.\n(d) The employee may return to full- or part-time work prior to the completion of the eight weeks of treatment if the employee's mental health professional determines that they are medically able to do so.\n(e) The employee may return to light duty assignments, subject to availability of a position, prior to the completion of the eight weeks of treatment, if deemed medically appropriate by the employee's mental health professional and with the employer's approval.\n(f) A fitness for duty presumption shall apply to an employee who is cleared to return to work or light duty under paragraph (d) or (e), except as provided under subdivision 10.\n(g) No employee shall be required to complete treatment under this subdivision more than three times in ten years.\nA \"health record,\" as defined by section 144.291, subdivision 2, paragraph (c), arising from treatment sought under this section is classified as private data on individuals, as defined by section 13.02, subdivision 12, and must not be accessed by, shared with, or disclosed or disseminated to any individual, private entity, or government entity, including through discovery, search warrant, or subpoena, in any type of investigation or legal action.\n(a) Except as provided in paragraph (c), an employer subject to this section may annually apply by August 1 for the preceding fiscal year to the commissioner of public safety for reimbursement of:\n(1) the treatment costs incurred by the employer under subdivision 4 or 7; and\n(2) the costs incurred to continue salary and benefits as required under subdivision 5.\n(b) An employer must apply for the reimbursement in the form and manner specified by the commissioner of public safety.\n(c) No employer shall be required to pay for the salary, benefits, and treatment costs required under subdivisions 4, 5, and 7 for a single employee more than three times in ten years.\n(a) An employee who is cleared or determined able to return to work or light duty under subdivision 4, paragraph (e); 6, paragraph (c); or 7, paragraph (f), is presumed fit for duty, except as follows:\n(1) an employer may request a fitness for duty exam by an independent medical provider if the exam is completed within six weeks of the employer receiving the determination from the treating mental health professional, and the independent medical provider's report is completed no more than six weeks later;\n(2) an employee found unfit for duty by an independent medical provider under clause (1):\n(i) is presumed eligible for a duty disability, as provided under subdivision 6, paragraph (a), clause (3), if the employee otherwise meets the eligibility requirements under section 353.031; or\n(ii) may appeal the independent medical provider's determination by requesting an examination under paragraph (c); and\n(3) the fitness-for-duty timeline under this paragraph may be modified by mutual agreement of the employer and employee.\n(b) Nothing in this section shall be deemed to affect the Americans with Disabilities Act, United States Code, title 42, chapter 126; the Family Medical Leave Act, United States Code, title 29, chapter 28; or the Minnesota Human Rights Act, chapter 363A.\n(c) An employee who wishes to appeal the independent medical provider's determination under paragraph (a), clause (2), item (ii), may request an examination by a qualified professional selected by the employee from a panel established by mutual agreement among the League of Minnesota Cities, the Association of Minnesota Counties, the Minnesota Peace and Police Officers Association, the Minnesota Professional Fire Fighters Association, the Minnesota Chiefs of Police Association, and the Minnesota Law Enforcement Association. The panel shall consist of five licensed psychiatrists or psychologists who have expertise regarding psychological or emotional disorders and who are qualified to opine as to the employee's fitness to engage in police or firefighting duties. The agreed upon panel of qualified professionals must be submitted to the executive director and made available for use in the appeal process. If the employee fails to select a qualified professional from the panel within ten days of any notice of appeal, the employing entity may select the qualified professional from the panel. A determination made by a qualified professional under this item is binding and not subject to appeal. This panel may be the same panel as the panel established under section 352B.102, subdivision 10.\nNo later than May 20, 2027, the executive director, in coordination with employers, employees, and mental health professionals, shall submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over labor and pensions regarding the impact of this section on public safety duty disability trends and costs.\nNothing in this section shall be construed to affect the procedures for an employee's claim for workers' compensation benefits under chapter 176 or diminish or delay an employer's or insurer's obligations related to an employee's claim for workers' compensation benefits under chapter 176, except that when an employee receives psychological condition treatment pursuant to an application approved under subdivision 3, the treatment is not compensable under chapter 176.",
	"repealed": false
}