{
	"id": "116C.991",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.991",
	"title": "116C.991 ENVIRONMENTAL REVIEW; SILICA SAND PROJECTS.",
	"text": "(a) Until a final rule is adopted pursuant to Laws 2013, chapter 114, article 4, section 105, paragraph (d), an environmental assessment worksheet must be prepared for any silica sand project that meets or exceeds the following thresholds, unless the project meets or exceeds the thresholds for an environmental impact statement under rules of the Environmental Quality Board and an environmental impact statement must be prepared:\n(1) excavates 20 or more acres of land to a mean depth of ten feet or more during its existence. The local government is the responsible governmental unit; or\n(2) is designed to store or is capable of storing more than 7,500 tons of silica sand or has an annual throughput of more than 200,000 tons of silica sand and is not required to receive a permit from the Pollution Control Agency. The Pollution Control Agency is the responsible governmental unit.\n(b) In addition to the contents required under statute and rule, an environmental assessment worksheet completed according to this section must include:\n(1) a hydrogeologic investigation assessing potential groundwater and surface water effects and geologic conditions that could create an increased risk of potentially significant effects on groundwater and surface water;\n(2) for a project with the potential to require a groundwater appropriation permit from the commissioner of natural resources, an assessment of the water resources available for appropriation;\n(3) an air quality impact assessment that includes an assessment of the potential effects from airborne particulates and dust;\n(4) a traffic impact analysis, including documentation of existing transportation systems, analysis of the potential effects of the project on transportation, and mitigation measures to eliminate or minimize adverse impacts;\n(5) an assessment of compatibility of the project with other existing uses; and\n(6) mitigation measures that could eliminate or minimize any adverse environmental effects for the project.",
	"repealed": false
}