{
	"id": "626.88",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.88",
	"title": "626.88 UNIFORMS; PEACE OFFICERS, SECURITY GUARDS; COLOR.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Peace officer\" means an employee of a political subdivision or state law enforcement agency who is licensed pursuant to sections 626.84 to 626.863 charged with the prevention and detection of crime and the enforcement of the general criminal laws of the state and who has full power of arrest, and shall also include Minnesota state troopers, state conservation officers, park police, and University of Minnesota police officers.\n(c) \"Security guard\" means any person who is paid a fee, wage, or salary to perform one or more of the following functions:\n(1) prevention or detection of intrusion, unauthorized entry or activity, vandalism, or trespass on private property;\n(2) prevention or detection of theft, loss, embezzlement, misappropriation, or concealment of merchandise, money, bonds, stocks, notes, or other valuable documents or papers;\n(3) control, regulation, or direction of the flow or movements of the public, whether by vehicle or otherwise, to assure protection of private property;\n(4) protection of individuals from bodily harm;\n(5) prevention or detection of intrusion, unauthorized entry or activity, vandalism, or trespass on Minnesota National Guard facilities, including, but not limited to, Camp Ripley and Air National Guard air bases; or\n(6) enforcement of policies and rules of the security guard's employer related to crime reduction insofar as such enforcement falls within the scope of security guard's duties.\nThe term \"security guard\" does not include: (i) auditors, accountants, and accounting personnel performing audits or accounting functions; (ii) employees of a firm licensed pursuant to section 326.3381 whose duties are primarily administrative or clerical in nature; (iii) unarmed security personnel; (iv) personnel temporarily employed pursuant to statute or ordinance by political subdivisions to provide protective services at social functions; (v) employees of air or rail carriers.\n(d) \"Bail bondsman\" or \"bail enforcement agent\" means a surety acting as a bonding agent or any person who acts at the direction of a surety for the purpose of arresting a defendant that the surety believes:\n(1) is about to flee;\n(2) will not appear in court as required by the defendant's recognizance; or\n(3) will otherwise not perform the conditions of the recognizance.\n(a) Uniforms for peace officers shall be of uniform colors throughout the state as provided herein. Uniforms for:\n(1) municipal peace officers, including University of Minnesota peace officers and peace officers assigned to patrol duties in parks, shall be blue, brown, or green;\n(2) peace officers who are members of the county sheriffs' office shall be blue, brown, or green;\n(3) state troopers shall be maroon;\n(4) conservation officers shall be green.\n(b) The uniforms of security guards may be any color other than those specified for peace officers.\n(c) The uniforms of a bail bondsman or bail enforcement agent or any person who acts at the direction of a surety may be any color other than those specified for peace officers. A violation of this paragraph is a petty misdemeanor.\n(d) This subdivision shall apply to uniforms purchased subsequent to January 1, 1981.\nSecurity guards employed by the Capitol Complex Security Division of the Department of Public Safety are not required to comply with subdivision 2.",
	"repealed": false
}