{
	"id": "103G.265",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.265",
	"title": "103G.265 WATER SUPPLY; MANAGEMENT.",
	"text": "The commissioner shall develop and manage water resources to assure an adequate supply to meet long-range seasonal requirements for domestic, municipal, industrial, agricultural, fish and wildlife, recreational, power, navigation, and quality control purposes from waters of the state.\nA water-use permit or a plan that requires a permit or the commissioner's approval, involving a diversion of waters of the state of more than 2,000,000 gallons per day average in a 30-day period, to a place outside of this state or from the basin of origin within this state may not be granted or approved until a determination is made by the commissioner that the water remaining in the basin of origin will be adequate to meet the basin's water resources needs during the specified life of the diversion project and, for groundwater, the diversion meets the applicable standards under section 103G.287, subdivision 5.\n[Repealed, 2013 c 114 art 4 s 108]\nA water-use permit or a plan that requires a permit or the commissioner's approval, involving a consumptive use of more than 2,000,000 gallons per day average in a 30-day period, may not be granted or approved until a determination is made by the commissioner that the water remaining in the basin of origin will be adequate to meet the basin's water resources needs during the specified life of the consumptive use and, for groundwater, the consumptive use meets the applicable standards under section 103G.287, subdivision 5.\n(a) A water-use permit or a plan that requires a permit or the commissioner's approval, involving a diversion or consumptive use of waters of the state from the Great Lakes water basin within this state where the diversion or consumptive use of waters would be more than 5,000,000 gallons per day average in a 30-day period, may not be granted or approved until:\n(1) the commissioner has notified and solicited comments on the proposed diversion or consumptive use from the offices of the governors of the Great Lakes states and premiers of the Great Lakes provinces, the appropriate water management agencies of the Great Lakes states and provinces, and the international joint commission;\n(2) the commissioner has considered the comments and concerns of the offices, agencies, and commission to which notice was given under clause (1); and\n(3) the diversion or consumptive use has been approved by the legislature.\n(b) If an objection is made to the proposed diversion or consumptive use by an office, agency, or commission to which notice was given under paragraph (a), clause (1), the commissioner must convene a meeting with the affected office, agency, or commission to investigate and consider the issues involved, and to seek a mutually agreeable solution to be recommended to the commissioner. In making a final decision on the approval of a permit or plan subject to review under this subdivision, the commissioner shall consider the record of the meeting and the recommendation. The commissioner must send notification of the final decision to each office, agency, or commission to which notice was given under paragraph (a), clause (1).",
	"repealed": false
}