{
	"id": "134.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.09",
	"title": "134.09 LIBRARY BOARDS.",
	"text": "When public library service is established, except in any city of the first class operating under a home rule charter, the mayor of the city with the approval of the council for a city library or the board of commissioners for a county library, shall appoint a board of five, seven or nine members from among the residents of the city or county. If the city library is a branch or a member of a regional public library system, as defined in section 134.001, the mayor, with the approval of the city council, may appoint to the city library board, residents of the county, provided that the county is participating in the regional public library system and that the majority of the members of the city library board are residents of the city. The number of members on the board shall be determined by resolution or ordinance adopted by the council or the board of commissioners. Not more than one council member or county commissioner shall at any time be a member of the library board. The appointments shall be made before the first meeting of the library board after the end of the fiscal year.\nIf nine board members are appointed, three shall hold office for one year, three for two years and three for three years. If seven members are appointed, three shall hold office for one year, two for two years, and two for three years; if five are appointed, two shall hold office for one year, two for two years, and one for three years. All terms shall end with the fiscal year. Annually the mayor with the approval of the council, or the board of county commissioners shall appoint board members for the term of three years until their successors qualify a sufficient number of members to fill the places of those whose term or terms expire. A library board member shall not be eligible to serve more than three consecutive three-year terms.\nThe mayor with the approval of the council, or the board of county commissioners may remove any member for misconduct or neglect.\nUpon recommendation of a majority of any library board created under the provisions of subdivision 1, the governing body of the city or county may abolish the library board at the end of any fiscal year provided that the governing body shall simultaneously establish a successor library board of either five, seven or nine members by resolution or ordinance. The appointment of successor board members shall be made as provided in subdivision 1. The terms of successor board members shall be as provided in subdivision 2.",
	"repealed": false
}