{
	"id": "442A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.14",
	"title": "442A.14 DISTRICT BOARD OF MANAGERS.",
	"text": "The governing body of each district shall be a board of managers of five members, who shall be voters residing in the district and who may but need not be officers, members of governing bodies, or employees of the related governmental subdivisions, except that when there are more than five territorial units in a district, there must be one board member for each unit.\nThe terms of the first board members elected after creation of a district shall be so arranged and determined by the electing body as to expire on the first business day in January as follows:\n(1) the terms of two members in the second calendar year after the year in which they were elected;\n(2) the terms of two other members in the third calendar year after the year in which they were elected; and\n(3) the term of the remaining member in the fourth calendar year after the year in which the member was elected. In case a board has more than five members, the additional members shall be assigned to the groups under clauses (1) to (3) to equalize the groups as far as practicable. Thereafter, board members shall be elected successively for regular terms beginning upon expiration of the preceding terms and expiring on the first business day in January of the third calendar year thereafter. Each board member serves until a successor is elected and has qualified.\nIn a district having only one territorial unit, all the members of the board shall be elected by the related governing body. In a district having more than one territorial unit, the members of the board shall be elected by the members of the related governing bodies in joint session except as otherwise provided. The electing bodies concerned shall meet and elect the first board members of a new district as soon as practicable after creation of the district and shall meet and elect board members for succeeding regular terms as soon as practicable after November 1 next preceding the beginning of the terms to be filled, respectively.\nUpon the creation of a district having more than one territorial unit, the chief administrative law judge, on the basis of convenience for joint meeting purposes, shall designate one of the related governing bodies as the central related governing body in the order creating the district or in a subsequent special order, of which the chief administrative law judge shall notify the clerks or recorders of all the related governing bodies. Upon receipt of the notification, the clerk or recorder of the central related governing body shall immediately transmit the notification to the presiding officer of the body. The officer shall thereupon call a joint meeting of the members of all the related governing bodies to elect board members, to be held at such time as the officer shall fix at the regular meeting place of the officer's governing body or at such other place in the district as the officer shall determine. The clerk or recorder of the body must give at least ten days' notice of the meeting by mail to the clerks or recorders of all the other related governing bodies, who shall immediately transmit the notice to all the members of the related governing bodies, respectively. Subsequent joint meetings to elect board members for regular terms must be called and held in like manner. The presiding officer and the clerk or recorder of the central related governing body shall act respectively as chair and secretary of the joint electing body at any meeting thereof, but in case of the absence or disability of either of them, the body may elect a temporary substitute. A majority of the members of each related governing body is required for a quorum at any meeting of the joint electing body.\nNominations for board members may be made by petitions, each signed by ten or more voters residing and owning land in the district, filed with the clerk, recorder, or secretary of the electing body before the election meeting. No person shall sign more than one petition. The electing body shall give due consideration to all nominations but is not limited thereto.\nIn the case of an electing body consisting of a single related governing body, a majority vote of all members is required for an election. In the case of a joint electing body, a majority vote of members present is required for an election. In case of lack of a quorum or failure to elect, a meeting of an electing body may be adjourned to a stated time and place without further notice.\nIn any district having more than one territorial unit, the related governing bodies, instead of meeting in joint session, may elect a board member by resolutions adopted by all of them separately, concurring in the election of the same person. A majority vote of all members of each related governing body is required for the adoption of any such resolution. The clerks or recorders of the other related governing bodies shall transmit certified copies of the resolutions to the clerk or recorder of the central related governing body. Upon receipt of concurring resolutions from all the related governing bodies, the presiding officer and clerk or recorder of the central related governing body shall certify the results and furnish certificates of election as provided for a joint meeting.\nAny vacancy in the membership of a board must be filled for the unexpired term in like manner as provided for the regular election of board members.\nThe presiding and recording officers of the electing body shall certify the results of each election to the county auditor of each county wherein any part of the district is situated and to the clerk or recorder of each related governing body and shall make and transmit to each board member elected a certificate of the board member's election. Upon electing the first board members of a district, the presiding officer of the electing body shall designate a member to serve as temporary chair for purposes of initial organization of the board, and the recording officer of the body shall include written notice thereof to all the board members with their certificates of election.",
	"repealed": false
}