{
	"id": "144.997",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.997",
	"title": "144.997 BIOMONITORING PILOT PROGRAM.",
	"text": "With advice from the advisory panel, and after the program guidelines in subdivision 4 are developed, the commissioner shall implement a biomonitoring pilot program. The program shall collect one biospecimen from each of the voluntary participants. The biospecimen selected must be the biospecimen that most accurately represents body concentration of the chemical of interest. Each biospecimen from the voluntary participants must be analyzed for one type or class of related chemicals. The commissioner shall determine the chemical or class of chemicals to which community members were most likely exposed. The program shall collect and assess biospecimens in accordance with the following:\n(1) 30 voluntary participants from each of three communities that the commissioner identifies as likely to have been exposed to a designated chemical;\n(2) 100 voluntary participants from each of two communities:\n(i) that the commissioner identifies as likely to have been exposed to arsenic; and\n(ii) that the commissioner identifies as likely to have been exposed to mercury; and\n(3) 100 voluntary participants from each of two communities that the commissioner identifies as likely to have been exposed to perfluorinated chemicals, including perfluorobutanoic acid.\n(a) By January 15, 2008, the commissioner shall submit a report on the results of the biomonitoring pilot program to the chairs and ranking members of the committees with jurisdiction over health and environment.\n(b) Following the conclusion of the pilot program, the commissioner shall:\n(1) work with the advisory panel to assess the usefulness of continuing biomonitoring among members of communities assessed during the pilot program and to identify other communities and other designated chemicals to be assessed via biomonitoring;\n(2) work with the advisory panel to assess the pilot program, including but not limited to the validity and accuracy of the analytical measurements and adequacy of the guidelines and protocols;\n(3) communicate the results of the pilot program to the public; and\n(4) after consideration of the findings and recommendations in clauses (1) and (2), and within the appropriations available, develop and implement a base program.\n(a) Participation in the biomonitoring program by providing biospecimens is voluntary and requires written, informed consent. Minors may participate in the program if a written consent is signed by the minor's parent or legal guardian. The written consent must include the information required to be provided under this subdivision to all voluntary participants.\n(b) All participants shall be evaluated for the presence of the designated chemical of interest as a component of the biomonitoring process. Participants shall be provided with information and fact sheets about the program's activities and its findings. Individual participants shall, if requested, receive their complete results. Any results provided to participants shall be subject to the Department of Health Institutional Review Board protocols and guidelines. When either physiological or chemical data obtained from a participant indicate a significant known health risk, program staff experienced in communicating biomonitoring results shall consult with the individual and recommend follow-up steps, as appropriate. Program administrators shall receive training in administering the program in an ethical, culturally sensitive, participatory, and community-based manner.\n(a) The commissioner, in consultation with the advisory panel, shall develop:\n(1) protocols or program guidelines that address the science and practice of biomonitoring to be utilized and procedures for changing those protocols to incorporate new and more accurate or efficient technologies as they become available. The commissioner and the advisory panel shall be guided by protocols and guidelines developed by the Centers for Disease Control and Prevention and the National Biomonitoring Program;\n(2) guidelines for ensuring the privacy of information; informed consent; follow-up counseling and support; and communicating findings to participants, communities, and the general public. The informed consent used for the program must meet the informed consent protocols developed by the National Institutes of Health;\n(3) educational and outreach materials that are culturally appropriate for dissemination to program participants and communities. Priority shall be given to the development of materials specifically designed to ensure that parents are informed about all of the benefits of breastfeeding so that the program does not result in an unjustified fear of toxins in breast milk, which might inadvertently lead parents to avoid breastfeeding. The materials shall communicate relevant scientific findings; data on the accumulation of pollutants to community health; and the required responses by local, state, and other governmental entities in regulating toxicant exposures;\n(4) a training program that is culturally sensitive specifically for health care providers, health educators, and other program administrators;\n(5) a designation process for state and private laboratories that are qualified to analyze biospecimens and report the findings; and\n(6) a method for informing affected communities and local governments representing those communities concerning biomonitoring activities and for receiving comments from citizens concerning those activities.\n(b) The commissioner may enter into contractual agreements with health clinics, community-based organizations, or experts in a particular field to perform any of the activities described under this section.",
	"repealed": false
}