{
	"id": "60B.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.54",
	"title": "60B.54 FOREIGN DOMICILIARY RECEIVERS IN OTHER STATES.",
	"text": "The domiciliary liquidator of an insurer domiciled in a reciprocal state shall be vested by operation of law with the title to all of the property, contracts, and rights of action, and all of the books, accounts, and other records of the insurer located in this state. The date of vesting shall be the date of the filing of the petition, if that date is specified by the domiciliary law for the vesting of property in the domiciliary state; otherwise, the date of vesting shall be the date of entry of the order directing possession to be taken. The domiciliary liquidator shall have the immediate right to recover balances due from agents and to obtain possession of the books, accounts, and other records of the insurer located in this state. The domiciliary liquidator also shall have the right to recover the other assets of the insurer located in this state, subject to section 60B.55, subdivision 2.\nIf a domiciliary liquidator is appointed for an insurer not domiciled in a reciprocal state, the commissioner of this state shall be vested by operation of law with the title to all of the property, contracts, and rights of action, and all of the books, accounts, and other records of the insurer located in this state, at the same time that the domiciliary liquidator is vested with title in the domicile. The commissioner of this state may petition for a conservation or liquidation order under section 60B.52 or 60B.53, or for an ancillary receivership under section 60B.55, or after approval by the District Court for Ramsey County may transfer title to the domiciliary liquidator, as the interests of justice and the equitable distribution of the assets require.\nClaimants residing in this state may file claims with the liquidator or ancillary receiver, if any, in this state or with the domiciliary liquidator, if the domiciliary law permits. The claims must be filed on or before the last date fixed for the filing of claims in the domiciliary liquidation proceedings.",
	"repealed": false
}