{
	"id": "144A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.08",
	"title": "144A.08 PHYSICAL STANDARDS; PENALTY.",
	"text": "The commissioner of health by rule shall establish minimum standards for the construction, maintenance, equipping and operation of nursing homes. The rules shall to the extent possible assure the health, treatment, comfort, safety and well being of nursing home residents.\nNothing in the rules of the commissioner of health shall require that each door entering a sleeping room from a corridor in a nursing home with an approved complete standard automatic fire extinguishing system be constructed or maintained as self-closing or automatically closing.\nA nursing home, or part of a nursing home that includes resident-occupied space, constructed after June 30, 1988, must meet the interior summer design temperature and humidity recommendations in chapter 7 of the 1982 applications of the handbook published by the American Society of Heating, Refrigerating and Air-Conditioning Engineers, Inc., as amended.\nThe controlling persons of a nursing home shall, in accordance with rules established by the commissioner of health, within 14 days of the occurrence, notify the commissioner of health of any change in the physical structure of a nursing home, which change would affect compliance with the rules of the commissioner of health or with sections 144A.01 to 144A.155.\nAny controlling person who establishes, conducts, manages or operates a nursing home which incurs the following number of uncorrected or repeated violations, in any two-year period:\n(1) two or more uncorrected violations or one or more repeated violations which created an imminent risk to direct resident care or safety; or\n(2) four or more uncorrected violations or two or more repeated violations of any nature for which the fines are in the four highest daily fine categories prescribed in rule, is guilty of a misdemeanor.\nThe provisions of this subdivision shall not apply to any controlling person who had no legal authority to affect or change decisions as to the operation of the nursing home which incurred the uncorrected or repeated violations.",
	"repealed": false
}