{
	"id": "326B.153",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.153",
	"title": "326B.153 BUILDING PERMIT FEES.",
	"text": "(a) Fees for building permits submitted as required in section 326B.107 include:\n(1) the fee as set forth in the fee schedule in paragraph (b) or as adopted by a municipality; and\n(2) the surcharge required by section 326B.148.\n(b) The total valuation and fee schedule is:\n(1) $1 to $500, $29.50;\n(2) $501 to $2,000, $28 for the first $500 plus $3.70 for each additional $100 or fraction thereof, to and including $2,000;\n(3) $2,001 to $25,000, $83.50 for the first $2,000 plus $16.55 for each additional $1,000 or fraction thereof, to and including $25,000;\n(4) $25,001 to $50,000, $464.15 for the first $25,000 plus $12 for each additional $1,000 or fraction thereof, to and including $50,000;\n(5) $50,001 to $100,000, $764.15 for the first $50,000 plus $8.45 for each additional $1,000 or fraction thereof, to and including $100,000;\n(6) $100,001 to $500,000, $1,186.65 for the first $100,000 plus $6.75 for each additional $1,000 or fraction thereof, to and including $500,000;\n(7) $500,001 to $1,000,000, $3,886.65 for the first $500,000 plus $5.50 for each additional $1,000 or fraction thereof, to and including $1,000,000; and\n(8) $1,000,001 and up, $6,636.65 for the first $1,000,000 plus $4.50 for each additional $1,000 or fraction thereof.\n(c) Other inspections and fees are:\n(1) inspections outside of normal business hours (minimum charge two hours), $63.25 per hour;\n(2) reinspection fees, $63.25 per hour;\n(3) inspections for which no fee is specifically indicated (minimum charge one-half hour), $63.25 per hour; and\n(4) additional plan review required by changes, additions, or revisions to approved plans (minimum charge one-half hour), $63.25 per hour.\n(d) If the actual hourly cost to the jurisdiction under paragraph (c) is greater than $63.25, then the greater rate shall be paid. Hourly cost includes supervision, overhead, equipment, hourly wages, and fringe benefits of the employees involved.\nFees for the review of building plans, specifications, and related documents submitted as required by section 326B.106 must be paid based on 65 percent of the building permit fee required in subdivision 1.\nSurcharge fees are required for permits issued on all buildings including public buildings and state licensed facilities as required by section 326B.148.\n(a) This subdivision establishes the fee distribution between the state and municipalities contracting for plan review and inspection of public buildings and state licensed facilities.\n(b) If plan review and inspection services are provided by the state building official, all fees for those services must be remitted to the state.\n(c) If plan review services are provided by the state building official and inspection services are provided by a contracting municipality:\n(1) the state shall charge 75 percent of the plan review fee required by the state's fee schedule in subdivision 2; and\n(2) the municipality shall charge 25 percent of the plan review fee required by the municipality's adopted fee schedule, for orientation to the plans, in addition to the permit and other customary fees charged by the municipality.\n(d) If plan review and inspection services are provided by the contracting municipality, all fees for those services must be remitted to the municipality in accordance with their adopted fee schedule.",
	"repealed": false
}