{
	"id": "297E.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.01",
	"title": "297E.01 DEFINITIONS.",
	"text": "Unless otherwise defined in this chapter, or unless the context clearly indicates otherwise, the terms used in this chapter have the meaning given them in chapter 349. The definitions in this section are for tax administration purposes and apply to this chapter.\nFor purposes of this chapter \"bingo\" means the game of bingo as defined in section 349.12, subdivision 4, and as conducted under chapter 349, and any other game that is substantially the same as or similar to that game, including but not limited to a game where:\n(1) players pay compensation for a game sheet, card, or paper that has spaces arranged on it in columns and rows containing printed numbers or figures, or that has spaces in which players are allowed to place their own numbers or figures, or for an electronic, mechanical, or other facsimile of such sheets, cards, or paper;\n(2) numbers or figures are randomly selected for comparison with the numbers or figures on each game sheet, card, paper, or facsimile;\n(3) game winners are those who have a game sheet, card, paper, or facsimile with some or all of the randomly selected numbers or figures displayed thereon, in the same pattern or arrangement that has been previously designated or understood to be a winning pattern or arrangement for the game; and\n(4) game winners receive or are eligible to receive a prize such as money, property, or other reward or benefit.\n\"Commissioner\" means the commissioner of revenue or a person to whom the commissioner has delegated functions.\nFor purposes of this chapter, \"contraband\" means all of the items listed in section 349.2125, and all pull-tab or tipboard deals or portions of deals on which the tax imposed under section 297E.02 has not been paid.\n\"Distributor\" means a distributor as defined in section 349.12, subdivision 11, or a person or linked bingo game provider who markets, sells, or provides gambling product to a person or entity for resale or use at the retail level.\n\"Fiscal year\" means the period from July 1 to June 30.\n\"Gambling product\" means bingo hard cards, bingo paper sheets, linked bingo paper sheets, or electronic linked bingo games; pull-tabs; electronic pull-tab games; tipboards; paddle tickets and paddle ticket cards; raffle tickets; or any other ticket, card, board, placard, device, or token that represents a chance, for which consideration is paid, to win a prize.\n\"Gross receipts\" means all receipts derived from lawful gambling activity including, but not limited to, the following items:\n(1) gross sales of bingo hard cards, paper sheets, linked bingo paper sheets, and electronic linked bingo games before reduction for prizes, expenses, shortages, free plays, or any other charges or offsets;\n(2) the ideal gross of pull-tab, electronic pull-tab games, and tipboard deals or games less the value of unsold and defective tickets and before reduction for prizes, expenses, shortages, free plays, or any other charges or offsets;\n(3) gross sales of raffle tickets and paddle tickets before reduction for prizes, expenses, shortages, free plays, or any other charges or offsets;\n(4) admission, commission, cover, or other charges imposed on participants in lawful gambling activity as a condition for or cost of participation; and\n(5) interest, dividends, annuities, profit from transactions, or other income derived from the accumulation or use of gambling proceeds.\nGross receipts does not include rental proceeds from premises owned by an organization and leased to one or more other organizations for the purposes of conducting lawful gambling.\n\"Ideal gross\" means the total amount of receipts that would be received if every individual ticket in the pull-tab, electronic pull-tab games or tipboard deal, paddlewheel game, and raffle ticket was sold at its face value. In the calculation of ideal gross and prizes, a free play ticket pull-tab or electronic pull-tab shall be valued at face value. Ideal gross also means the total amount of receipts that would be received if every bingo paper sheet, linked bingo paper sheet, and electronic linked bingo games were sold at face value.\n\"Linked bingo game\" means a bingo game played at two or more locations where licensed organizations are authorized to conduct bingo, when there is a common prize pool and a common selection of numbers or symbols conducted at one location, and when the results of the selection are transmitted to all participating locations by satellite, telephone, or other means by a linked bingo game provider.\n\"Linked bingo game provider\" means any person who provides the means to link bingo prizes in a linked bingo game, who provides linked bingo paper sheets to the participating organizations, who provides linked bingo prize management, and who provides the linked bingo game system.\n\"Manufacturer\" means a manufacturer as defined in section 349.12, subdivision 26, or a person or entity who:\n(1) assembles from raw materials, or from subparts or other components, a completed item of gambling product for resale, use, or receipt in Minnesota; or\n(2) sells, furnishes, ships, or imports completed gambling product from outside Minnesota for resale, use, receipt, or storage in Minnesota; or\n(3) being within the state, assembles, produces, or otherwise creates gambling products.\n\"Prize\" means a thing of value, other than a free play, offered or awarded to the winner of a gambling game.\n\"Pull-tab\" is a pull-tab as defined in section 349.12, subdivision 32, or any other gambling ticket or device that is substantially the same as or similar to such a pull-tab, including but not limited to, a ticket or card that:\n(1) has one or more concealed numbers, figures, or symbols, or combination thereof, printed on it;\n(2) may be used in games where the player knows in advance, or can determine in advance, what the predesignated winning numbers, figures, symbols, or combinations are; and\n(3) may be played by revealing the concealed ticket information and comparing that information with the predesignated winning numbers, figures, symbols, or combinations in order to determine a winner.\n\"Raffle\" means a raffle as defined in section 349.12, subdivision 33, and any other game that is played in a manner substantially similar to the play of such a raffle, including but not limited to raffles in which compensation is paid for the chance to win a thing of value, the chance is evidenced by a ticket, card, token, or equivalent item, and the winner is selected by random drawing.\n\"Retail level\" means an activity where gambling product is sold to players or participants in gambling games and where the players or participants give consideration for a chance to win a prize.\n\"Taxpayer\" means a person subject to or liable for a tax imposed by this chapter, a person required to file reports or returns with the commissioner under this chapter, a person required to keep or retain records under this chapter, or a person required by this chapter to obtain or hold a permit.\n\"Ticket\" means a valid token, card, or other tangible voucher, other than bingo cards, sheets, or paper, that grants the holder a chance or chances to participate in a game of gambling.\n\"Tipboard\" means a tipboard as defined in section 349.12, subdivision 34, and any game that is substantially the same as or similar to the game of tipboards authorized under chapter 349, including but not limited to any of the following games:\n(1) a game that consists of one or more boards, placards, or other devices in which (i) the board, placard, or other device has been marked off into a grid or columns in which each section represents a chance to win a prize, (ii) participants pay a consideration to select a section or sections, (iii) all or some of the winning numbers, figures, symbols, or other winning criteria for the game are concealed or otherwise not known by the player at the time the player obtains a chance in the game, and (iv) the numbers, figures, symbols, or other criteria for winning the game are later revealed for comparison with the information on the board, placard, or other device in order to determine a winner;\n(2) a game that consists of one or more boards, placards, or other devices that (i) have tickets attached to or otherwise associated with them, and that have one or more concealed numbers, figures, or combination thereof on the tickets; (ii) participants pay a consideration to obtain the tickets, (iii) all or some of the winning numbers, figures, symbols, or other winning criteria for the game are concealed or otherwise not known by the player at the time the player obtains a chance in the game, and (iv) the numbers, figures, symbols, or other criteria for winning the game are later revealed for comparison with the information on the game tickets in order to determine a winner; or\n(3) a game that consists of a deal or set of tickets that (i) have one or more concealed numbers, figures, or symbols, or combination thereof, on the tickets, (ii) participants pay a consideration to obtain the tickets, (iii) all or some of the winning numbers, figures, symbols, or combination thereof, are concealed or otherwise not known to the player at the time the player obtains the ticket, and (iv) the tickets are used in games where the numbers, figures, symbols, or other winning criteria are later revealed for comparison with the information on the game tickets in order to determine a winner.\n\"Tipboards\" includes any game otherwise described in this subdivision in which the winning chances are determined in whole or in part by the outcome of one or more sporting events. \"Tipboard\" does not include boards, placards, tickets, or other devices lawfully used in connection with the operation of the State Lottery under chapter 349A or the lawful conduct of pari-mutuel betting on horse racing under chapter 240.\n\"Business day\" means Monday through Friday, excluding any holidays as defined in section 645.44.\nUnless specifically defined in this chapter, or unless the context clearly indicates otherwise, the words used in this chapter have the meanings given them in chapter 349.",
	"repealed": false
}