{
	"id": "142E.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.17",
	"title": "142E.17 CHILD CARE RATES.",
	"text": "(a) Beginning October 30, 2023, the maximum rate paid for child care assistance in any county or county price cluster under the child care fund shall be the greater of the 75th percentile of the 2021 child care provider rate survey or the rates in effect at the time of the update.\n(b) Beginning the first full service period on or after January 1, 2025, and every three years thereafter, the maximum rate paid for child care assistance in a county or county price cluster under the child care fund shall be the greater of the 75th percentile of the most recent child care provider rate survey or the rates in effect at the time of the update.\nThe rates under paragraph (a) continue until the rates under this paragraph go into effect.\n(c) For a child care provider located within the boundaries of a city located in two or more of the counties of Benton, Sherburne, and Stearns, the maximum rate paid for child care assistance shall be equal to the maximum rate paid in the county with the highest maximum reimbursement rates or the provider's charge, whichever is less. The commissioner may: (1) assign a county with no reported provider prices to a similar price cluster; and (2) consider county level access when determining final price clusters.\n(d) A rate which includes a special needs rate paid under subdivision 3 may be in excess of the maximum rate allowed under this subdivision.\n(e) The department shall monitor the effect of this paragraph on provider rates. The county shall pay the provider's full charges for every child in care up to the maximum established. The commissioner shall determine the maximum rate for each type of care on an hourly, full-day, and weekly basis, including special needs and disability care.\n(f) If a child uses one provider, the maximum payment for one day of care must not exceed the daily rate. The maximum payment for one week of care must not exceed the weekly rate.\n(g) If a child uses two providers under section 142E.11, subdivision 4, the maximum payment must not exceed:\n(1) the daily rate for one day of care;\n(2) the weekly rate for one week of care by the child's primary provider; and\n(3) two daily rates during two weeks of care by a child's secondary provider.\n(h) Child care providers receiving reimbursement under this chapter must not be paid activity fees or an additional amount above the maximum rates for care provided during nonstandard hours for families receiving assistance.\n(i) If the provider charge is greater than the maximum provider rate allowed, the parent is responsible for payment of the difference in the rates in addition to any family co-payment fee.\n(j) Beginning October 30, 2023, the maximum registration fee paid for child care assistance in any county or county price cluster under the child care fund shall be the greater of the 75th percentile of the most recent child care provider rate survey or the registration fee in effect at the time of the update.\n(k) Maximum registration fees must be set for licensed family child care and for child care centers. For a child care provider located in the boundaries of a city located in two or more of the counties of Benton, Sherburne, and Stearns, the maximum registration fee paid for child care assistance shall be equal to the maximum registration fee paid in the county with the highest maximum registration fee or the provider's charge, whichever is less.\n(a) Legal nonlicensed family child care providers receiving reimbursement under this chapter must be paid on an hourly basis for care provided to families receiving assistance.\n(b) The maximum rate paid to legal nonlicensed family child care providers must be 90 percent of the county maximum hourly rate for licensed family child care providers. In counties or county price clusters where the maximum hourly rate for licensed family child care providers is higher than the maximum weekly rate for those providers divided by 50, the maximum hourly rate that may be paid to legal nonlicensed family child care providers is the rate equal to the maximum weekly rate for licensed family child care providers divided by 50 and then multiplied by 0.90. The maximum payment to a provider for one day of care must not exceed the maximum hourly rate times ten. The maximum payment to a provider for one week of care must not exceed the maximum hourly rate times 50.\n(c) A rate which includes a special needs rate paid under subdivision 3 may be in excess of the maximum rate allowed under this subdivision.\n(d) Legal nonlicensed family child care providers receiving reimbursement under this chapter may not be paid registration fees for families receiving assistance.\nCounties shall reimburse providers for the care of children with disabilities or special needs, at a special rate to be approved by the county for care of these children, subject to the approval of the commissioner.\nA family child care provider or child care center shall be paid a 15 percent differential above the maximum rate established in subdivision 1, up to the actual provider rate, if the provider or center holds a current early childhood development credential or is accredited. For a family child care provider, early childhood development credential and accreditation includes an individual who has earned a child development associate degree, a child development associate credential, a diploma in child development from a Minnesota state technical college, or a bachelor's or post baccalaureate degree in early childhood education from an accredited college or university, or who is accredited by the National Association for Family Child Care or the Competency Based Training and Assessment Program. For a child care center, accreditation includes accreditation that meets the following criteria: the accrediting organization must demonstrate the use of standards that promote the physical, social, emotional, and cognitive development of children. The accreditation standards shall include, but are not limited to, positive interactions between adults and children, age-appropriate learning activities, a system of tracking children's learning, use of assessment to meet children's needs, specific qualifications for staff, a learning environment that supports developmentally appropriate experiences for children, health and safety requirements, and family engagement strategies. Based on an application process developed by the commissioner in conjunction with the commissioners of education and health, the Department of Children, Youth, and Families must accept applications from accrediting organizations on an annual basis. The provider rate differential shall be paid to centers holding an accreditation from an approved accrediting organization beginning on a billing cycle to be determined by the commissioner, no later than the last Monday in February of a calendar year. The commissioner shall annually publish a list of approved accrediting organizations. An approved accreditation must be reassessed by the commissioner every two years. If an approved accrediting organization is determined to no longer meet the approval criteria, the organization and centers being paid the differential under that accreditation must be given a 90-day notice by the commissioner and the differential payment must end after a 15-day notice to affected families and centers as directed in Minnesota Rules, part 3400.0185, subparts 3 and 4. The following accreditations shall be recognized for the provider rate differential until an approval process is implemented: the National Association for the Education of Young Children, the Council on Accreditation, the National Early Childhood Program Accreditation, the National School-Age Care Association, or the National Head Start Association Program of Excellence. For Montessori programs, accreditation includes the American Montessori Society, Association of Montessori International-USA, or the National Center for Montessori Education.\nA family child care provider or child care center shall be paid a 15 percent differential if they hold a three-star Parent Aware rating or a 20 percent differential if they hold a four-star Parent Aware rating. A 15 percent or 20 percent rate differential must be paid above the maximum rate established in subdivision 1, up to the actual provider rate.\nA licensed child care provider or license-exempt center may be paid up to the applicable weekly maximum rate, not to exceed the provider's actual charge, when the following conditions are met:\n(1) the child is age birth to five years, but not yet in kindergarten;\n(2) the child attends a child care provider that qualifies for the rate differential identified in subdivision 3a or 3b; and\n(3) the applicant's activities qualify for at least 30 hours of care per week under sections 142E.04, 142E.08, and 142E.12, and Minnesota Rules, chapter 3400.\nChild care providers receiving reimbursement under this chapter may not charge a rate to clients receiving assistance under this chapter that is higher than the private, full-paying client rate. This subdivision shall not prohibit a child care provider receiving reimbursement under this chapter from providing discounts, scholarships, or other financial assistance to any clients.\nThe county shall inform both the family receiving assistance under this chapter and the child care provider of the payment amount and how and when payment will be received. If the county sends a family a notice that child care assistance will be terminated, the county shall inform the provider that unless the family requests to continue to receive assistance pending an appeal, child care payments will no longer be made. The notice to the provider must not contain any private data on the family or information on why payment will no longer be made.\n(a) A provider shall bill only for services documented according to section 142E.16, subdivision 7. The provider shall bill for services provided within ten days of the end of the service period. Payments under the child care fund shall be made within 21 days of receiving a complete bill from the provider. Counties or the state may establish policies that make payments on a more frequent basis.\n(b) If a provider has received an authorization of care and been issued a billing form for an eligible family, the bill must be submitted within 60 days of the last date of service on the bill. A bill submitted more than 60 days after the last date of service must be paid if the county determines that the provider has shown good cause why the bill was not submitted within 60 days. Good cause must be defined in the county's child care fund plan under section 142E.09, subdivision 3, and the definition of good cause must include county error. Any bill submitted more than a year after the last date of service on the bill must not be paid.\n(c) If a provider provided care for a time period without receiving an authorization of care and a billing form for an eligible family, payment of child care assistance may only be made retroactively for a maximum of three months from the date the provider is issued an authorization of care and a billing form. For a family at application, if a provider provided child care during a time period without receiving an authorization of care and a billing form, a county may only make child care assistance payments to the provider retroactively from the date that child care began, or from the date that the family's eligibility began under section 142E.10, subdivision 7, or from the date that the family meets authorization requirements, not to exceed six months from the date that the provider is issued an authorization of care and a billing form, whichever is later.\n(d) The commissioner may refuse to issue a child care authorization to a certified, licensed, or legal nonlicensed provider; revoke an existing child care authorization to a certified, licensed, or legal nonlicensed provider; stop payment issued to a certified, licensed, or legal nonlicensed provider; or refuse to pay a bill submitted by a certified, licensed, or legal nonlicensed provider if:\n(1) the provider admits to intentionally giving the county materially false information on the provider's billing forms;\n(2) the commissioner finds by a preponderance of the evidence that the provider intentionally gave the county materially false information on the provider's billing forms, or provided false attendance records to a county or the commissioner;\n(3) the provider is in violation of child care assistance program rules, until the agency determines those violations have been corrected;\n(4) the provider is operating after:\n(i) an order of suspension of the provider's license issued by the commissioner;\n(ii) an order of revocation of the provider's license issued by the commissioner; or\n(iii) an order of decertification issued to the provider;\n(5) the provider submits false attendance reports or refuses to provide documentation of the child's attendance upon request;\n(6) the provider gives false child care price information; or\n(7) the provider fails to report decreases in a child's attendance as required under section 142E.16, subdivision 9.\n(e) For purposes of paragraph (d), clauses (3), (5), (6), and (7), the commissioner may withhold the provider's authorization or payment for a period of time not to exceed three months beyond the time the condition has been corrected.\n(f) A county's payment policies must be included in the county's child care plan under section 142E.09, subdivision 3. If payments are made by the state, in addition to being in compliance with this subdivision, the payments must be made in compliance with section 16A.124.\n(g) If the commissioner suspends or refuses payment to a provider under paragraph (d), clause (1) or (2), or sections 142E.50 to 142E.58 and the provider has:\n(1) a disqualification for wrongfully obtaining assistance under section 256.98, subdivision 8, paragraph (c);\n(2) an administrative disqualification under section 142E.51, subdivision 5; or\n(3) a termination under section 142E.51, subdivision 4, paragraph (c), clause (4), or 142E.55;\nthen the provider forfeits the payment to the commissioner or the responsible county agency, regardless of the amount assessed in an overpayment, charged in a criminal complaint, or ordered as criminal restitution.\n[See Note.]\n(a) Licensed child care providers and license-exempt centers must not be reimbursed for more than 25 full-day absent days per child, excluding holidays, in a calendar year, or for more than ten consecutive full-day absent days. \"Absent day\" means any day that the child is authorized and scheduled to be in care with a licensed provider or license-exempt center, and the child is absent from the care for the entire day. Legal nonlicensed family child care providers must not be reimbursed for absent days. If a child attends for part of the time authorized to be in care in a day, but is absent for part of the time authorized to be in care in that same day, the absent time must be reimbursed but the time must not count toward the absent days limit. Child care providers must only be reimbursed for absent days if the provider has a written policy for child absences and charges all other families in care for similar absences.\n(b) Notwithstanding paragraph (a), children with documented medical conditions that cause more frequent absences may exceed the 25 absent days limit, or ten consecutive full-day absent days limit. Absences due to a documented medical condition of a parent or sibling who lives in the same residence as the child receiving child care assistance do not count against the absent days limit in a calendar year. Documentation of medical conditions must be on the forms and submitted according to the timelines established by the commissioner. A public health nurse or school nurse may verify the illness in lieu of a medical practitioner. If a provider sends a child home early due to a medical reason, including, but not limited to, fever or contagious illness, the child care center director or lead teacher may verify the illness in lieu of a medical practitioner.\n(c) Notwithstanding paragraph (a), children in families may exceed the absent days limit if at least one parent: (1) is under the age of 21; (2) does not have a high school diploma or commissioner of education-selected high school equivalency certification; and (3) is a student in a school district or another similar program that provides or arranges for child care, parenting support, social services, career and employment supports, and academic support to achieve high school graduation, upon request of the program and approval of the county. If a child attends part of an authorized day, payment to the provider must be for the full amount of care authorized for that day.\n(d) Child care providers must be reimbursed for up to ten federal or state holidays or designated holidays per year when the provider charges all families for these days and the holiday or designated holiday falls on a day when the child is authorized to be in attendance. Parents may substitute other cultural or religious holidays for the ten recognized state and federal holidays. Holidays do not count toward the absent days limit.\n(e) A family must not be assessed an overpayment for an absent day payment unless (1) there was an error in the amount of care authorized for the family, or (2) all of the allowed full-day absent payments for the child have been paid.\n(f) The provider and family shall receive notification of the number of absent days used upon initial provider authorization for a family and ongoing notification of the number of absent days used as of the date of the notification.\n(g) For purposes of this subdivision, \"absent days limit\" means 25 full-day absent days per child, excluding holidays, in a calendar year; and ten consecutive full-day absent days.\n(h) For purposes of this subdivision, \"holidays limit\" means ten full-day holidays per child, excluding absent days, in a calendar year.\n(i) If a day meets the criteria of an absent day or a holiday under this subdivision, the provider must bill that day as an absent day or holiday. A provider's failure to properly bill an absent day or a holiday results in an overpayment, regardless of whether the child reached, or is exempt from, the absent days limit or holidays limit for the calendar year.",
	"repealed": false
}