{
	"id": "14.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.07",
	"title": "14.07 FORM OF RULE.",
	"text": "(a) The revisor of statutes shall:\n(1) maintain an agency rules drafting department to draft or aid in the drafting of rules or amendments to rules for any agency in accordance with subdivision 3 and the objective or other instructions which the agency shall give the revisor; and,\n(2) prepare and publish an agency rules drafting guide which shall set out the form and method for drafting rules and amendments to rules, and to which all rules shall comply.\n(b) An agency may not contract with an attorney, consultant, or other person either to provide rule drafting services to the agency or to advise on drafting unless the revisor determines that special expertise is required for the drafting and the expertise is not available from the revisor or the revisor's staff.\nNo agency decision to adopt a rule or an emergency, exempt, or expedited rule, including a decision to amend or modify a proposed rule or proposed emergency, exempt, or expedited rule, is effective unless the agency has presented the rule to the revisor of statutes and the revisor has certified that its form is approved.\nIn determining the drafting form of rules the revisor shall:\n(1) minimize duplication of statutory language;\n(2) not permit incorporations into the rules by reference of publications or other documents which are not conveniently available to the public;\n(3) to the extent practicable, use plain language in rules and avoid technical language; and\n(4) amend rules by showing the portion of the rule being amended as necessary to provide adequate notice of the nature of the proposed amendment, as it is shown in the latest compilation or supplement, or, if not yet published in a compilation or supplement, then as the text is shown in the files of the secretary of state, with changes shown by striking and underlining words.\n(a) An agency may incorporate by reference into its rules the text from Minnesota Statutes, Minnesota Rules, United States Statutes at Large, United States Code, Laws of Minnesota, Code of Federal Regulations, the Federal Register, and other publications and documents which are determined by the revisor of statutes, to be conveniently available to the public. If the rule incorporates by reference other publications and documents, the rule must contain a statement of incorporation. The statement of incorporation by reference must include the words \"incorporated by reference\"; must identify by title, author, publisher, and date of publication the standard or material to be incorporated; must state whether the material is subject to frequent change; and must contain a statement of availability. When presented with a rule for certification pursuant to subdivision 2 and this subdivision, the revisor of statutes should indicate in the certification that the rule incorporates by reference text from other publications or documents. If the revisor certifies that the form of a rule is approved, that approval constitutes the revisor's finding that the publication or other document other than one listed by name in this subdivision, and which is incorporated by reference into the rules, is conveniently available to the public.\n(b) For the purposes of paragraph (a), \"conveniently available to the public\" means available for loan or inspection and copying to a person living anywhere in Minnesota through a statewide interlibrary loan system or in a public library without charge except for reasonable copying fees and mailing costs.\n[Repealed, 1984 c 640 s 33]\nThe revisor of statutes may periodically prepare style and form revisions of rules to clarify, modernize, or simplify the text without material change to the rules' substance or effect. Before beginning any revision, the revisor shall consult the agency whose rules will be subject to the revision. After the revision is prepared, the revisor shall present it to the agency and receive its consent to proceed to seek adoption of the revision. Upon receiving consent, the revisor shall seek adoption of the rules in accordance with sections 14.05 to 14.28. However, the need and reasonableness statement and any hearing shall be restricted to the issue of whether any material change in the substance and effect of the rule is proposed by the revisor. The revisor shall mail notice by United States mail or electronic mail of any hearing to the persons registered with the agency whose rules are the subject of the revision. The revisor shall pay all costs to publish notices in the State Register and to replenish the agency's stock of rules which exist at the time the revisor adopts the revised rules.\nThe revisor may approve the form of a rule amendment which does not meet the requirements of subdivision 3, clause (4), if, in the revisor's judgment, the amendment does not change the substance of the rule and the amendment is:\n(a) a relettering or renumbering instruction;\n(b) the substitution of one name for another when an organization or position is renamed;\n(c) the substitution of a reference to Minnesota Statutes for a corresponding reference to Laws of Minnesota;\n(d) the correction of a citation to rules or laws which has become inaccurate since the rule was adopted because of repealing or renumbering of the rule or law cited; or\n(e) the correction of a similar formal defect.\nThis subdivision does not limit the revisor's authority to make the changes described in clauses (a) to (e) during the publication process under section 14.47.",
	"repealed": false
}