{
	"id": "442A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.16",
	"title": "442A.16 DISTRICT STATUS AND POWERS.",
	"text": "Every district shall be a public corporation and a governmental subdivision of the state and shall be deemed to be a municipality or municipal corporation for the purpose of obtaining federal or state grants or loans or otherwise complying with any provision of federal or state law or for any other purpose relating to the powers and purposes of the district for which such status is now or hereafter required by law.\nEvery district shall have the powers and purposes prescribed by this chapter and such others as may now or hereafter be prescribed by law. No express grant of power or enumeration of powers herein shall be deemed to limit the generality or scope of any grant of power.\nExcept as otherwise provided, a power or duty vested in or imposed upon a district or any of its officers, agents, or employees shall not be deemed exclusive and shall not supersede or abridge any power or duty vested in or imposed upon any other agency of the state or any governmental subdivision thereof, but shall be supplementary thereto.\nAll the powers of a district shall be exercised by its board of managers except so far as approval of any action by popular vote or by any other authority may be expressly required by law.\nA district may sue and be sued and may enter into any contract necessary or proper for the exercise of its powers or the accomplishment of its purposes.\nA district may acquire by purchase, gift, or condemnation or may lease or rent any real or personal property within or without the district that may be necessary for the exercise of district powers or the accomplishment of district purposes, may hold the property for such purposes, and may lease, rent out, sell, or otherwise dispose of any property not needed for such purposes.\nA district may accept gifts, grants, or loans of money or other property from the United States, the state, or any person, corporation, or other entity for district purposes; may enter into any agreement required in connection therewith; and may hold, use, and dispose of the money or property according to the terms of the gift, grant, loan, or agreement relating thereto.",
	"repealed": false
}