{
	"id": "245D.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.21",
	"title": "245D.21 FACILITY LICENSURE REQUIREMENTS AND APPLICATION PROCESS.",
	"text": "For purposes of this section, \"facility\" means both a community residential setting and day service facility and the physical plant.\n(a) Physical plants must comply with applicable state and local fire, health, building, and zoning codes.\n(b)(1) The facility must be inspected by a fire marshal or their delegate within 12 months before initial licensure to verify that it meets the applicable occupancy requirements as defined in the State Fire Code and that the facility complies with the fire safety standards for that occupancy code contained in the State Fire Code.\n(2) The fire marshal inspection of a community residential setting must verify the residence is a dwelling unit within a residential occupancy as defined in section 9.117 of the State Fire Code. A home safety checklist, approved by the commissioner, must be completed for a community residential setting by the license holder and the commissioner before the satellite license is reissued.\n(3) The facility shall be inspected according to the facility capacity specified on the initial application form.\n(4) If the commissioner has reasonable cause to believe that a potentially hazardous condition may be present or the licensed capacity is increased, the commissioner shall request a subsequent inspection and written report by a fire marshal to verify the absence of hazard.\n(5) Any condition cited by a fire marshal, building official, or health authority as hazardous or creating an immediate danger of fire or threat to health and safety must be corrected before a license is issued by the department, and for community residential settings, before a license is reissued.\n(c) The facility must maintain in a permanent file the reports of health, fire, and other safety inspections.\n(d) The facility's plumbing, ventilation, heating, cooling, lighting, and other fixtures and equipment, including elevators or food service, if provided, must conform to applicable health, sanitation, and safety codes and regulations.",
	"repealed": false
}