{
	"id": "299N.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/299N.03",
	"title": "299N.03 DEFINITIONS.",
	"text": "The terms used in sections 299N.04 and 299N.05 have the meanings given them in this section.\n\"Board\" means the Board of Firefighter Training and Education established under section 299N.02.\n\"Chief firefighting officer\" means the highest ranking employee or appointed official of a fire department, or the highest ranking employee or appointed official's designee for the purposes of this chapter.\n\"Fire department\" has the meaning given it in section 299F.092, subdivision 6. For purposes of sections 299N.04 and 299N.05, fire department also includes a division of a state agency, regularly charged with the responsibility of providing fire protection to the state or a local government, to include a private, nonprofit fire department directly serving a local government, but does not include industrial fire brigades that do not have a fire department identification number issued by the state fire marshal.\nA \"full-time firefighter\" means a person who is employed and charged with the prevention or suppression of fires within the boundaries of the state on a full-time basis and who is directly engaged in the hazards of firefighting or is in charge of designated fire companies, as defined in section 299N.01, subdivision 2, that are directly engaged in the hazards of firefighting. Full-time firefighter does not include a volunteer, part-time, or paid-on-call firefighter.\n\"Licensed firefighter\" means a full-time firefighter, to include a fire department employee, member, supervisor, state employee, or appointed official, who is licensed by the board and charged with the prevention or suppression of fires within the boundaries of the state. Licensed firefighter may also include a volunteer firefighter.\n\"NFPA 1001 standard\" means the standard for firefighter professional qualifications established by the National Fire Protection Association.\nA \"volunteer firefighter\" means a person who is charged with the prevention or suppression of fires within the boundaries of the state on a volunteer, part-time, or paid-on-call basis. Volunteer firefighter does not include a full-time firefighter.",
	"repealed": false
}