{
	"id": "272.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.02",
	"title": "272.02 EXEMPT PROPERTY.",
	"text": "MS 2012 [Repealed, 2014 c 308 art 9 s 94]\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\nAll public burying grounds are exempt.\nAll public schoolhouses are exempt.\nAll public hospitals are exempt.\nAll academies, colleges, and universities, and all seminaries of learning are exempt.\nAll churches, church property, and houses of worship are exempt.\n(a) Institutions of purely public charity that are exempt from federal income taxation under section 501(c)(3) of the Internal Revenue Code are exempt if they meet the requirements of this subdivision. In determining whether real property is exempt under this subdivision, the following factors must be considered:\n(1) whether the stated purpose of the undertaking is to be helpful to others without immediate expectation of material reward;\n(2) whether the institution of public charity is supported by material donations, gifts, or government grants for services to the public in whole or in part;\n(3) whether a material number of the recipients of the charity receive benefits or services at reduced or no cost, or whether the organization provides services to the public that alleviate burdens or responsibilities that would otherwise be borne by the government;\n(4) whether the income received, including material gifts and donations, produces a profit to the charitable institution that is not distributed to private interests;\n(5) whether the beneficiaries of the charity are restricted or unrestricted, and, if restricted, whether the class of persons to whom the charity is made available is one having a reasonable relationship to the charitable objectives; and\n(6) whether dividends, in form or substance, or assets upon dissolution, are not available to private interests.\nA charitable organization must satisfy the factors in clauses (1) to (6) for its property to be exempt under this subdivision, unless there is a reasonable justification for failing to meet the factors in clause (2), (3), or (5), and the organization provides to the assessor the factual basis for that justification. If there is reasonable justification for failing to meet the factors in clause (2), (3), or (5), an organization is a purely public charity under this subdivision without meeting those factors. After an exemption is properly granted under this subdivision, it will remain in effect unless there is a material change in facts.\n(b) For purposes of this subdivision, a grant is a written instrument or electronic document defining a legal relationship between a granting agency and a grantee when the principal purpose of the relationship is to transfer cash or something of value to the grantee to support a public purpose authorized by law in a general manner instead of acquiring by professional or technical contract, purchase, lease, or barter property or services for the direct benefit or use of the granting agency.\n(c) In determining whether rental housing property qualifies for exemption under this subdivision, the following are not gifts or donations to the owner of the rental housing:\n(1) rent assistance provided by the government to or on behalf of tenants; and\n(2) financing assistance or tax credits provided by the government to the owner on condition that specific units or a specific quantity of units be set aside for persons or families with certain income characteristics.\nAll public property exclusively used for any public purpose is exempt.\nExcept for the taxable personal property enumerated below, all personal property and the property described in section 272.03, subdivision 1, paragraphs (c) and (d), shall be exempt.\nThe following personal property shall be taxable:\n(a) personal property which is part of (1) an electric generating, transmission, or distribution system; (2) a pipeline system transporting or distributing products; or (3) mains and pipes used in the distribution of steam or hot or chilled water for heating or cooling buildings and structures;\n(b) railroad docks and wharves which are part of the operating property of a railroad company as defined in section 270.80;\n(c) personal property defined in section 272.03, subdivision 2, clause (3);\n(d) leasehold or other personal property interests which are taxed pursuant to section 272.01, subdivision 2; 273.124, subdivision 7; or 273.19, subdivision 1; or any other law providing the property is taxable as if the lessee or user were the fee owner;\n(e) manufactured homes and sectional structures, including storage sheds, decks, and similar removable improvements constructed on the site of a manufactured home, sectional structure, park trailer or travel trailer as provided in section 273.125, subdivision 8, paragraph (f); and\n(f) flight property as defined in section 270.071.\nPersonal property used primarily for the abatement and control of air, water, or land pollution is exempt to the extent that it is so used, and real property is exempt if it is used primarily for abatement and control of air, water, or land pollution as part of an agricultural operation, as a part of a centralized treatment and recovery facility operating under a permit issued by the Minnesota Pollution Control Agency pursuant to chapters 115 and 116 and Minnesota Rules, parts 7001.0500 to 7001.0730, and 7045.0020 to 7045.1030, as a wastewater treatment facility and for the treatment, recovery, and stabilization of metals, oils, chemicals, water, sludges, or inorganic materials from hazardous industrial wastes, or as part of an electric generation system. For purposes of this subdivision, personal property includes ponderous machinery and equipment used in a business or production activity that at common law is considered real property.\nAny taxpayer requesting exemption of all or a portion of any real property or any equipment or device, or part thereof, operated primarily for the control or abatement of air, water, or land pollution shall file an application with the commissioner of revenue. The commissioner shall develop an electronic means to notify interested parties when electric power generation facilities have filed an application. The commissioner shall prescribe the content, format, and manner of the application pursuant to section 270C.30, except that a \"law administered by the commissioner\" includes the property tax laws. If an application is made by electronic means, the taxpayer's signature is defined pursuant to section 270C.304, except that a \"law administered by the commissioner\" includes the property tax laws. The Minnesota Pollution Control Agency shall upon request of the commissioner furnish information and advice to the commissioner.\nThe information and advice furnished by the Minnesota Pollution Control Agency must include statements as to whether the equipment, device, or real property meets a standard, rule, criteria, guideline, policy, or order of the Minnesota Pollution Control Agency, and whether the equipment, device, or real property is installed or operated in accordance with it. On determining that property qualifies for exemption, the commissioner shall issue an order exempting the property from taxation. The commissioner shall develop an electronic means to notify interested parties when the commissioner has issued an order exempting property from taxation under this subdivision. The equipment, device, or real property shall continue to be exempt from taxation as long as the order issued by the commissioner remains in effect.\nWetlands are exempt. For purposes of this subdivision, \"wetlands\" means: (i) land described in section 103G.005, subdivision 15a; (ii) land which is mostly under water, produces little if any income, and has no use except for wildlife or water conservation purposes, provided it is preserved in its natural condition and drainage of it would be legal, feasible, and economically practical for the production of livestock, dairy animals, poultry, fruit, vegetables, forage and grains, except wild rice; or (iii) land in a wetland preservation area under sections 103F.612 to 103F.616. \"Wetlands\" under clauses (i) and (ii) include adjacent land which is not suitable for agricultural purposes due to the presence of the wetlands, but do not include woody swamps containing shrubs or trees, wet meadows, meandered water, streams, rivers, and floodplains or river bottoms. Exemption of wetlands from taxation pursuant to this section shall not grant the public any additional or greater right of access to the wetlands or diminish any right of ownership to the wetlands.\nNative prairie lands are exempt. The commissioner of the Department of Natural Resources shall determine lands in the state which are native prairie and shall notify the county assessor of each county in which the lands are located. Pasture land used for livestock grazing purposes shall not be considered native prairie for the purposes of this subdivision. Upon receipt of an application for the exemption provided in this subdivision for lands for which the assessor has no determination from the commissioner of natural resources, the assessor shall refer the application to the commissioner of natural resources who shall determine within 30 days whether the land is native prairie and notify the county assessor of the decision. Exemption of native prairie pursuant to this subdivision shall not grant the public any additional or greater right of access to the native prairie or diminish any right of ownership to it.\nProperty used in a continuous program to provide emergency shelter for victims of domestic abuse is exempt, provided the organization that owns and sponsors the shelter is exempt from federal income taxation pursuant to section 501(c)(3) of the Internal Revenue Code, notwithstanding the fact that the sponsoring organization receives funding under Section 8 of the United States Housing Act of 1937, as amended.\nIf approved by the governing body of the municipality in which the property is located, property not exceeding one acre is exempt if it is owned and operated by any senior citizen group or association of groups that in general limits membership to persons age 55 or older and is organized and operated exclusively for pleasure, recreation, and other nonprofit purposes, no part of the net earnings of which inures to the benefit of any private shareholders; provided the property is used primarily as a clubhouse, meeting facility, or recreational facility by the group or association and the property is not used for residential purposes on either a temporary or permanent basis.\nNotwithstanding the provisions of subdivision 39, and sections 272.01, subdivision 2, and 273.19, subdivision 1, real and personal property used or to be used primarily for the production of hydroelectric or hydromechanical power on a site owned by the federal government, the state, or a local governmental unit and developed and operated pursuant to section 103G.535 is exempt from property tax for all years during which the site is developed and operated under the terms of a lease or agreement authorized by section 103G.535.\nThe following property is exempt if approved by the governing body of the municipality in which the property is located, and if construction is commenced after June 30, 1983:\n(a) a \"direct satellite broadcasting facility\" operated by a corporation licensed by the Federal Communications Commission to provide direct satellite broadcasting services using direct broadcast satellites operating in the 12-ghz. band; and\n(b) a \"fixed satellite regional or national program service facility\" operated by a corporation licensed by the Federal Communications Commission to provide fixed satellite-transmitted regularly scheduled broadcasting services using satellites operating in the 6-ghz. band.\nAn exemption provided by this subdivision shall apply for a period not to exceed five years. When the facility no longer qualifies for exemption, it shall be placed on the assessment rolls as provided in subdivision 38. Before approving a tax exemption pursuant to this subdivision, the governing body of the municipality shall provide an opportunity to the members of the county board of commissioners of the county in which the facility is proposed to be located and the members of the school board of the school district in which the facility is proposed to be located to meet with the governing body. The governing body shall present to the members of those boards its estimate of the fiscal impact of the proposed property tax exemption. The tax exemption shall not be approved by the governing body until the county board of commissioners has presented its written comment on the proposal to the governing body or 30 days have passed from the date of the transmittal by the governing body to the board of the information on the fiscal impact, whichever occurs first.\nReal and personal property owned and operated by a private, nonprofit corporation exempt from federal income taxation pursuant to United States Code, title 26, section 501(c)(3), primarily used in the generation and distribution of hot water for heating buildings and structures, is exempt.\nNotwithstanding section 273.19, state lands that are leased from the Department of Natural Resources under section 92.46 are exempt.\nElectric power distribution lines and their attachments and appurtenances, that are used primarily for supplying electricity to farmers at retail, are exempt.\nTransitional housing facilities are exempt. \"Transitional housing facility\" means a facility that meets the following requirements: (i) provides temporary housing to individuals, couples, or families; (ii) has the purpose of reuniting families and enabling parents or individuals to obtain self-sufficiency, advance their education, get job training, or become employed in jobs that provide a living wage; (iii) provides support services such as child care, work readiness training, and career development counseling; and a self-sufficiency program with periodic monitoring of each resident's progress in completing the program's goals; (iv) provides services to a resident of the facility for at least three months but no longer than three years, except residents enrolled in an educational or vocational institution or job training program. These residents may receive services during the time they are enrolled but in no event longer than four years; (v) is owned and operated or under lease from a unit of government or governmental agency under a property disposition program and operated by one or more organizations exempt from federal income tax under section 501(c)(3) of the Internal Revenue Code.\nThis exemption applies notwithstanding the fact that the sponsoring organization receives financing by a direct federal loan or federally insured loan or a loan made by the Minnesota Housing Finance Agency under the provisions of either Title II of the National Housing Act, as amended, or the Minnesota Housing Finance Agency Law of 1971, chapter 462A, or rules promulgated by the agency pursuant to it, and notwithstanding the fact that the sponsoring organization receives funding under Section 8 of the United States Housing Act of 1937, as amended.\nReal and personal property, including leasehold or other personal property interests, is exempt if it is owned and operated by a corporation of which more than 50 percent of the total voting power of the stock of the corporation is owned collectively by: (i) the Board of Regents of the University of Minnesota, (ii) the University of Minnesota Foundation, an organization exempt from federal income taxation under section 501(c)(3) of the Internal Revenue Code, and (iii) a corporation organized under chapter 317A, which by its articles of incorporation is prohibited from providing pecuniary gain to any person or entity other than the regents of the University of Minnesota; which property is used primarily to manage or provide goods, services, or facilities utilizing or relating to large-scale advanced scientific computing resources to the regents of the University of Minnesota and others.\nAll real and personal property of a wind energy conversion system as defined in section 272.029, subdivision 2, is exempt from property tax except that the land on which the property is located remains taxable. If approved by the county where the property is located, the value of the land on which the wind energy conversion system is located shall be valued in the same manner as similar land that has not been improved with a wind energy conversion system. The land shall be classified based on the most probable use of the property if it were not improved with a wind energy conversion system.\nMS 2016 [Repealed, 1Sp2017 c 1 art 2 s 43]\nPersonal property consisting of solar energy generating systems, as defined in section 272.0295, is exempt. If the real property upon which a solar energy generating system is located is used primarily for solar energy production subject to the production tax under section 272.0295, the real property shall be classified as class 3a. If the real property upon which a solar energy generating system is located is not used primarily for solar energy production subject to the production tax under section 272.0295, the real property shall be classified without regard to the system. If real property contains more than one solar energy generating system that cannot be combined with the nameplate capacity of another solar energy generating system for the purposes of the production tax under section 272.0295, but is in aggregate over one megawatt, then the real property upon which the systems are located shall be classified as class 3a.\n(a) Real and personal property is exempt if it is owned and operated by a private, nonprofit corporation exempt from federal income taxation pursuant to United States Code, title 26, section 501(c)(3), primarily used for an ice arena or ice rink, and used primarily for youth and high school programs.\n(b) Real property is exempt if it is owned and operated by a private, nonprofit corporation exempt from federal income taxation pursuant to United States Code, title 26, section 501(c)(3), and primarily used as a baseball park by amateur baseball players.\nMS 2002 [Repealed, 1Sp2003 c 21 art 4 s 13]\nReal and personal property is exempt if it is located in the Superior National Forest, and owned or leased and operated by a nonprofit organization that is exempt from federal income taxation under section 501(c)(3) of the Internal Revenue Code and primarily used to provide recreational opportunities for veterans with a disability and their families.\nManure pits and appurtenances, which may include slatted floors and pipes, installed or operated in accordance with a permit, order, or certificate of compliance issued by the Minnesota Pollution Control Agency are exempt. The exemption shall continue for as long as the permit, order, or certificate issued by the Minnesota Pollution Control Agency remains in effect.\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a facility containing a cogeneration system as described in section 216B.166, subdivision 2, paragraph (a), is exempt if the cogeneration system has met the following criteria: (i) the system utilizes natural gas as a primary fuel and the cogenerated steam initially replaces steam generated from existing thermal boilers utilizing coal; (ii) the facility developer is selected as a result of a procurement process ordered by the Public Utilities Commission; and (iii) construction of the facility is commenced after July 1, 1994, and before July 1, 1997.\nReal property acquired by a home rule charter city, statutory city, county, town, or school district under a lease purchase agreement or an installment purchase contract during the term of the lease purchase agreement is exempt as long as and to the extent that the property is used by the city, county, town, or school district and devoted to a public use and to the extent it is not subleased to any private individual, entity, association, or corporation in connection with a business or enterprise operated for profit.\nProperty owned by a nonprofit charitable organization that qualifies for tax exemption under section 501(c)(3) of the Internal Revenue Code that is intended to be used as a business incubator in a high-unemployment county, is exempt. As used in this subdivision, a \"business incubator\" is a facility used for the development of nonretail businesses, offering access to equipment, space, services, and advice to the tenant businesses, for the purpose of encouraging economic development, diversification, and job creation in the area served by the organization, and \"high-unemployment county\" is a county that had an average annual unemployment rate of 7.9 percent or greater in 1997. Property that qualifies for the exemption under this subdivision is limited to no more than two contiguous parcels and structures that do not exceed in the aggregate 40,000 square feet. This exemption expires after taxes payable in 2016.\nNotwithstanding any other law to the contrary, real property that meets the following criteria is exempt:\n(i) constitutes a wastewater treatment system that (a) is constructed by a municipality using public funds, (b) operates under a state disposal system permit issued by the Minnesota Pollution Control Agency pursuant to chapters 115 and 116 and Minnesota Rules, chapter 700l, and (c) applies its effluent to land used as part of an agricultural operation;\n(ii) is located within a municipality of a population of less than 10,000;\n(iii) is used for treatment of effluent from a private potato processing facility; and\n(iv) is owned by a municipality and operated by a private entity under agreement with that municipality.\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a simple-cycle combustion-turbine electric generation facility that exceeds 250 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(i) not be owned by a public utility as defined in section 216B.02, subdivision 4;\n(ii) utilize natural gas as a primary fuel;\n(iii) be located within 20 miles of the intersection of an existing 42-inch (outside diameter) natural gas pipeline and a 345-kilovolt high-voltage electric transmission line; and\n(iv) be designed to provide peaking, emergency backup, or contingency services, and have received a certificate of need pursuant to section 216B.243 demonstrating demand for its capacity.\nConstruction of the facility must be commenced after July 1, 1999, and before July 1, 2003. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nMS 2010 [Repealed, 2011 c 112 art 7 s 9]\nFor purposes of the exemptions granted by subdivisions 1 to 33, property owned or operated by a limited liability company consisting of a sole member shall be treated as if owned or operated by that member.\nProperty owned, leased or used by any public elementary or secondary school district for a home, residence or lodging house for any teacher, instructor, or administrator, and any property owned by any public school district which is leased to any person or organization for a nonpublic purpose for one year or more pursuant to section 123B.51, subdivision 4, shall not be included in the exemption provided in subdivisions 1 to 33.\nProperty owned or leased by, or loaned to, a hospital and used principally by such hospital as a recreational or rest area for employees, administrators, or medical personnel shall not be included in the exemption provided in subdivisions 1 to 33.\n(a) Any property, except property taxed as personal property under section 273.125, that is exempt from taxation on January 2 of any year which, due to sale or other reason, loses its exemption prior to July 1 of any year, shall be placed on the current assessment rolls for that year.\nThe valuation shall be determined with respect to its value on January 2 of such year. The classification shall be based upon the use to which the property was put by the purchaser, or in the event the purchaser has not utilized the property by July 1, the intended use of the property, determined by the county assessor, based upon all relevant facts.\n(b) Property, except property taxed as personal property under section 273.125, that is subject to tax on January 2 that is acquired before July 1 of the year is exempt for that assessment year if the property is to be used for an exempt purpose under subdivisions 2 to 8.\n(c) Property which forfeits to the state for nonpayment of real estate taxes on or before December 31 in an assessment year, shall be removed from the assessment rolls for that assessment year. Forfeited property that is repurchased, or sold at a public or private sale, on or before December 31 of an assessment year shall be placed on the assessment rolls for that year's assessment.\nThe holding of property by a political subdivision of the state for later resale for economic development purposes shall be considered a public purpose in accordance with subdivision 8 for a period not to exceed nine years, except that:\n(1) for property located in a city of 20,000 population or under that is located outside of the metropolitan area as defined in section 473.121, subdivision 2, the period must not exceed 15 years; and\n(2) for any property that was acquired on or after January 1, 2000, and on or before December 31, 2010, and is located in a city, the period must not exceed 15 years.\nThe holding of property by a political subdivision of the state for later resale (1) which is purchased or held for housing purposes, or (2) which meets the conditions described in section 469.174, subdivision 10, shall be considered a public purpose in accordance with subdivision 8.\nThe governing body of the political subdivision which acquires property which is subject to this subdivision shall after the purchase of the property certify to the city or county assessor whether the property is held for economic development purposes or housing purposes, or whether it meets the conditions of section 469.174, subdivision 10. If the property is acquired for economic development purposes and buildings or other improvements are constructed after acquisition of the property, and if more than one-half of the floor space of the buildings or improvements which is available for lease to or use by a private individual, corporation, or other entity is leased to or otherwise used by a private individual, corporation, or other entity the provisions of this subdivision shall not apply to the property. This subdivision shall not create an exemption from section 272.01, subdivision 2; 272.68; 273.19; or 469.040, subdivision 3; or other provision of law providing for the taxation of or for payments in lieu of taxes for publicly held property which is leased, loaned, or otherwise made available and used by a private person.\nMS 2000 [Repealed, 2002 c 377 art 10 s 32]\nProperty, including real property, qualifies as exempt pollution abatement property under subdivision 10, if the following conditions are satisfied.\n(a)(1) The property is part of a refuse-derived fuel facility converted from a coal burning electric generation facility and the property consists of:\n(i) boiler modifications necessary to efficient handling and burning of refuse-derived fuel and transfer of the heat produced by combustion of the fuel;\n(ii) ash handling and storage systems, such as vacuum-pneumatic equipment, conveyors, crushers, and storage buildings to remove, convey, process, and temporarily store bottom and fly ash from the burning of refuse-derived fuel;\n(iii) control systems, such as computers, to control the operation of equipment described in clauses (i) to (iv) and other pollution abatement equipment; and\n(iv) equipment to monitor emissions into the air and combustion efficiency; or\n(2) the property is a solid waste resource recovery mass burn facility.\n(b) The facility was constructed and will be operated under a contractual arrangement providing for payment, in whole or part, of the property tax on the property by a political subdivision of the state.\n(a) Property that is leased or rented to a school district is exempt from taxation if it meets the following requirements:\n(1) the lease must be for a period of at least 12 consecutive months;\n(2) the terms of the lease must require the school district to pay a nominal consideration for use of the building;\n(3) the school district must use the property to provide direct instruction in any grade from kindergarten through grade 12; special education for disabled children; adult basic education as described in section 124D.52; preschool and early childhood family education; or community education programs, including provision of administrative services directly related to the educational program at that site; and\n(4) the lease must provide that the school district has the exclusive use of the property during the lease period.\n(b) Property that is leased or rented to a charter school formed and operated under chapter 124E is exempt from taxation if it meets all of the following requirements:\n(1) the lease is for a period of at least 12 consecutive months;\n(2) the property is owned by (i) a nonprofit corporation or association exempt from federal income tax under section 501(c)(2) or (3) of the Internal Revenue Code; (ii) a public school district, college, or university; (iii) a private academy, college, university, or seminary of learning; (iv) a church; or (v) the state or a political subdivision of the state;\n(3) the charter school must use the property to provide (i) direct instruction in any grade from kindergarten through grade 12; (ii) special education for disabled children; or (iii) administrative services directly related to the educational program at that site; and\n(4) except for lease provisions that allow for the shared use of the property by (i) the charter school and another public or private school; (ii) the charter school and a church; or (iii) the charter school and the state or a political subdivision of the state, the lease must provide that the charter school has the exclusive right to use the property during the lease period.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a simple-cycle combustion-turbine electric generation facility that exceeds 250 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) utilize natural gas as a primary fuel;\n(2) be located within 20 miles of parallel existing 16-inch and 12-inch (outside diameter) natural gas pipelines and a 345-kilovolt high-voltage electric transmission line; and\n(3) be designed to provide peaking, emergency backup, or contingency services, and have received a certificate of need under section 216B.243 demonstrating demand for its capacity.\nConstruction of the facility must be commenced after January 1, 2000, and before January 1, 2004. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of an electrical generating facility that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) be designed to utilize biomass as established in section 216B.2424 as a primary fuel source; and\n(2) be constructed for the purpose of generating power at the facility that will be sold pursuant to a contract approved by the Public Utilities Commission in accordance with the biomass mandate imposed under section 216B.2424.\nConstruction of the facility must be commenced after January 1, 2000, and before December 31, 2005. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or facility.\nA newly constructed building that is situated on real property is exempt if it is:\n(1) intended for future residential occupancy;\n(2) on a temporary foundation and intended to be moved;\n(3) not used as a model or for any other business purposes;\n(4) not connected to any utilities; and\n(5) located on land that will not be sold with the building.\nThe exemption under this subdivision is allowable for only one assessment year after the date of the initial construction of the building.\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of an electrical generating facility that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) be designed to utilize poultry litter as a primary fuel source; and\n(2) be constructed for the purpose of generating power at the facility that will be sold pursuant to a contract approved by the Public Utilities Commission in accordance with the biomass mandate imposed under section 216B.2424.\nConstruction of the facility must be commenced after January 1, 2003, and before December 31, 2005. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\nProperty is exempt from taxation if it is owned by a nonprofit charitable or educational organization that qualifies for exemption under section 501(c)(3) of the Internal Revenue Code and meets the following criteria:\n(1) the property is primarily used for storing and exhibiting tools, equipment, and artifacts useful in providing an understanding of local or regional agricultural history. Primary use is determined each year based on the number of days the property is used solely for storage and exhibition purposes;\n(2) the property is limited to a maximum of 40 acres per owner per county, but includes the land and any taxable structures, fixtures, and equipment on the land;\n(3) the property is not used for a revenue-producing activity for more than ten days in each calendar year; and\n(4) the property is not used for residential purposes on either a temporary or permanent basis.\nMS 2004 [Repealed, 2006 c 257 s 23]\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a simple-cycle combustion-turbine electric generation facility of more than 40 megawatts and less than 50 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) utilize natural gas as a primary fuel;\n(2) be located within two miles of parallel existing 36-inch natural gas pipelines and an existing 115-kilovolt high-voltage electric transmission line;\n(3) be designed to provide peaking, emergency backup, or contingency services; and\n(4) satisfy a resource deficiency identified in an approved integrated resource plan filed under section 216B.2422.\nConstruction of the facility must be commenced after January 1, 2001, and before January 1, 2005. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\n(a) Subject to paragraph (b), notwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of an electrical generating facility that meets the requirements of this subdivision is exempt. At the time of construction the facility must:\n(1) have a generation capacity of less than 25 megawatts;\n(2) provide process heating needs in addition to electrical generation; and\n(3) utilize agricultural by-products from the malting process and other biomass fuels as its primary fuel source.\nConstruction of the facility must be commenced after January 1, 2002, and before January 1, 2008. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or facility.\n(b) The exemption under this subdivision is contingent on approval by the governing bodies of the municipality and county in which the electric generation facility is located.\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of an electric generating facility that meets the requirements of this subdivision is exempt. At the time of construction, the facility must (i) be eligible to be designated as an innovative energy project under section 216B.1694, except that, notwithstanding anything to the contrary in section 216B.1694, a project may include gas-fired generating facilities that are adaptable for subsequent incorporation into a facility that uses coal as a primary fuel, provided that this exception applies only to the eligibility for exemption under this section, (ii) be within a tax relief area as defined in section 273.134, (iii) have access to existing railroad infrastructure within less than three miles, (iv) have received by resolution approval from the governing body of the county and township or city in which the proposed facility is to be located for the exemption of personal property under this subdivision, and (v) be designed to host at least 500 megawatts of electrical generation.\nConstruction of the first 100 megawatts of the facility must be commenced after January 1, 2006, and before January 1, 2012. Construction of up to an additional 750 megawatts of generation must be commenced before January 1, 2015. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility. To qualify for an exemption under this subdivision, the owner of the electric generation facility must have an agreement with the host county, township or city, and school district, for payment in lieu of personal property taxes to the host county, township or city, and school district.\n(a) Notwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a combined-cycle combustion-turbine electric generation facility that exceeds 300 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) be designed to utilize natural gas as a primary fuel;\n(2) not be owned by a public utility as defined in section 216B.02, subdivision 4;\n(3) be located within five miles of an existing natural gas pipeline and within four miles of an existing electrical transmission substation;\n(4) be located outside the metropolitan area as defined under section 473.121, subdivision 2; and\n(5) be designed to provide energy and ancillary services and have received a certificate of need under section 216B.243.\n(b) Construction of the facility must be commenced after January 1, 2004, and before January 1, 2007, except that property eligible for this exemption includes any expansion of the facility that also meets the requirements of paragraph (a), clauses (1) to (5), without regard to the date that construction of the expansion commences. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nAll property owned by the Comprehensive Health Association is exempt to the extent provided in section 62E.10, subdivision 1.\nAll property owned by private cemeteries is exempt to the extent provided in section 307.09.\nAll property owned, leased, controlled, used, or occupied for public, governmental, and municipal purposes by the Western Lake Superior Sanitary Board is exempt to the extent provided in section 458D.23.\nUnfinished sale or rental projects are exempt to the extent provided in section 469.155, subdivision 17.\nThe pedestrian skyway system, underground pedestrian concourse, the people mover system, and publicly owned parking structures are exempt to the extent provided in section 469.127.\nAll property acquired and used by a city is exempt to the extent provided in section 471.191, subdivision 4.\nMS 2012 [Repealed, 2014 c 258 s 4]\n(a) Improvements to real property, and personal property, classified under section 273.13, subdivision 24, and located within a job opportunity building zone, designated under section 469.314, are exempt from ad valorem taxes levied under chapter 275.\n(b) Improvements to real property, and tangible personal property, of an agricultural production facility located within an agricultural processing facility zone, designated under section 469.314, is exempt from ad valorem taxes levied under chapter 275.\n(c) For property to qualify for exemption under paragraph (a), the occupant must be a qualified business, as defined in section 469.310.\n(d) The exemption applies beginning for the first assessment year after designation of the job opportunity building zone by the commissioner of employment and economic development. The exemption applies to each assessment year that begins during the duration of the job opportunity building zone. To be exempt, the property must be occupied by July 1 of the assessment year by a qualified business that has signed the business subsidy agreement and relocation agreement, if required, by July 1 of the assessment year. This exemption does not apply to:\n(1) the levy under section 475.61 or similar levy provisions under any other law to pay general obligation bonds; or\n(2) other school district levies included in the debt service levy of the district under section 123B.55.\n(e) Except for property of a business that was exempt under this subdivision for taxes payable in 2008, a business must notify the county assessor in writing of eligibility under this subdivision by July 1 in order to begin receiving the exemption under this subdivision for taxes payable in the following year. The business need not annually notify the county assessor of its continued exemption under this subdivision, but must notify the county assessor immediately if the exemption no longer applies.\nMS 2004 [Repealed, 1Sp2005 c 3 art 7 s 20]\nAn elderly living facility is exempt from taxation if it meets all of the following requirements:\n(1) the facility is located in a city of the first class with a population of more than 350,000;\n(2) the facility is owned and operated by a nonprofit corporation organized under chapter 317A;\n(3) the construction of the facility was commenced after January 1, 2002, and before June 1, 2003;\n(4) the facility consists of two buildings, which are connected to a church that is exempt from taxation under subdivision 6;\n(5) the land for the facility was donated to the nonprofit corporation by the church to which the facility is connected;\n(6) the residents of the facility must be (i) at least 62 years of age or (ii) disabled;\n(7) the facility operates an on-site congregate dining program in which participation by residents is mandatory, and provides assisted living or similar social and physical support services for residents; and\n(8) at least 30 percent of the units in the facility are occupied by persons whose annual income does not exceed 50 percent of median family income for the area.\nThe property is exempt under this subdivision for taxes levied in each year or partial year of the term of the facility's initial permanent financing or 25 years, whichever is later.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\n(a) Notwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a simple-cycle combustion-turbine electric generation facility that exceeds 290 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) be designed to utilize natural gas as a primary fuel;\n(2) not be owned by a public utility as defined in section 216B.02, subdivision 4;\n(3) be located within 15 miles of an existing natural gas pipeline and within five miles of an existing electrical transmission substation;\n(4) be located outside the metropolitan area as defined under section 473.121, subdivision 2;\n(5) be designed to provide peaking capacity energy and ancillary services and have satisfied all of the requirements under section 216B.243; and\n(6) have received, by resolution, the approval from the governing body of the county, city, and school district in which the proposed facility is to be located for the exemption of personal property under this subdivision.\n(b) Construction of the facility must be commenced after January 1, 2005, and before January 1, 2009. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\n(a) Notwithstanding subdivision 9, clause (a), and section 453.54, subdivision 20, attached machinery and other personal property which is part of an electric generation facility that exceeds 150 megawatts of installed capacity and meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) be designed to utilize natural gas as a primary fuel;\n(2) be owned and operated by a municipal power agency as defined in section 453.52, subdivision 8;\n(3) have received the certificate of need under section 216B.243;\n(4) be located outside the metropolitan area as defined under section 473.121, subdivision 2; and\n(5) be designed to be a combined-cycle facility, although initially the facility will be operated as a simple-cycle combustion turbine.\n(b) To qualify under this subdivision, an agreement must be negotiated between the municipal power agency and the host city, for a payment in lieu of property taxes to the host city.\n(c) Construction of the facility must be commenced after January 1, 2004, and before January 1, 2006. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of an existing simple-cycle, combustion-turbine electric generation facility that exceeds 300 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of the construction, the facility must:\n(1) be designed to utilize natural gas as a primary fuel;\n(2) be owned by a public utility as defined in section 216B.02, subdivision 4, and be located at or interconnected with an existing generating plant of the utility;\n(3) be designed to provide peaking, emergency backup, or contingency services;\n(4) satisfy a resource need identified in an approved integrated resource plan filed under section 216B.2422; and\n(5) have received, by resolution, the approval from the governing body of the county and the city for the exemption of personal property under this subdivision.\nConstruction of the facility expansion must be commenced after January 1, 2004, and before January 1, 2005. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\n(a) Notwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a simple-cycle combustion-turbine electric generation facility that exceeds 150 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) utilize natural gas as a primary fuel;\n(2) be owned by an electric generation and transmission cooperative;\n(3) be located within five miles of parallel existing 12-inch and 16-inch natural gas pipelines and a 69-kilovolt high-voltage electric transmission line;\n(4) be designed to provide peaking, emergency backup, or contingency services;\n(5) have received a certificate of need under section 216B.243 demonstrating demand for its capacity; and\n(6) have received by resolution the approval from the governing body of the county and township in which the proposed facility is to be located for the exemption of personal property under this subdivision.\n(b) Construction of the facility must be commenced after July 1, 2005, and before January 1, 2009. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\n(a) Real and personal property described in section 298.25 is exempt to the extent the tax on taconite and iron sulphides under section 298.24 is described in section 298.25 as being in lieu of other taxes on such property. This exemption applies for taxes payable in each year that the tax under section 298.24 is payable with respect to such property.\n(b) Deposits of mineral, metal, or energy resources the mining of which is subject to taxation or the minimum payment under section 298.015 are exempt.\nPersonal and real property that a religious corporation, formed under section 317A.909, necessarily uses for a religious purpose is exempt to the extent provided in section 317A.909, subdivision 3.\nPersonal and real property owned by a corporation formed under section 317A.907 is exempt to the extent provided in section 317A.907, subdivision 7.\nProperty owned by a housing and redevelopment authority described in chapter 469, or by a designated housing authority described in section 469.040, subdivision 5, is exempt to the extent provided in chapter 469.\nProperty of projects of housing and redevelopment authorities are exempt to the extent permitted by section 469.042, subdivision 1.\nProperty of a regional rail authority as defined in chapter 398A is exempt to the extent permitted by section 398A.05.\nProperty owned by the Spirit Mountain Recreation Area Authority is exempt from taxation to the extent provided in Laws 1973, chapter 327, section 6.\nFor purposes of this section, the term \"installed capacity\" means generator nameplate capacity.\nReal and personal property is exempt if it is located in a county in the metropolitan area with a population of less than 500,000 according to the 2000 federal census, and owned or leased and operated by a nonprofit organization, and primarily used to provide recreational opportunities for veterans with a disability and their families.\nMS 2012 [Repealed, 2014 c 308 art 9 s 94]\nMS 2010 [Repealed, 2012 c 294 art 2 s 43]\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property which is part of a 10.3 megawatt run-of-the-river hydroelectric generation facility and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) utilize between 12 and 16 turbine generators at a dam site existing on March 31, 1994;\n(2) be located on land within 3,000 feet of a 13.8 kilovolt distribution substation; and\n(3) be eligible to receive a renewable energy production incentive payment under section 216C.41.\nConstruction of the facility must be commenced after April 30, 2006, and before January 1, 2011. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\n(a) A modular home is exempt if it:\n(1) is owned by a modular home dealer and is located on land owned or leased by that dealer;\n(2) is a single-family model home;\n(3) is not available for sale and is used exclusively as a model;\n(4) is not permanently connected to any utilities except electricity; and\n(5) is situated on a temporary foundation.\n(b) The exemption under this subdivision is allowable for up to five assessment years after the date it becomes located on the property, provided that the modular home continues to meet all of the criteria under this subdivision each year. The owner of a modular model home must notify the county assessor within 60 days that it has been constructed or located on the property and must again notify the assessor if the modular home ceases to meet any of the criteria. If more than one modular home is constructed or situated on a property, the owner must notify the assessor within 60 days for each of the models placed on the property.\n(c) For purposes of this subdivision, a \"modular home\" means a building or structural unit that has been in whole or substantial part manufactured or constructed at an off-site location to be wholly or partially assembled on site as a single-family dwelling. Construction of the modular home must comply with applicable standards adopted in Minnesota Rules authorized under chapter 16B. A modular home does not include a structure subject to the requirements of the National Manufactured Home Construction and Safety Standards Act of 1974 or prefabricated buildings, as defined in section 327.31, subdivision 6.\nAll or a portion of a building used exclusively for a state-approved apprenticeship program through the Department of Labor and Industry is exempt if:\n(1) it is owned by a nonprofit organization or a nonprofit trust, and operated by a nonprofit organization or a nonprofit trust;\n(2) the program participants receive no compensation; and\n(3) it is located:\n(i) in the Minneapolis and St. Paul standard metropolitan statistical area as determined by the 2000 federal census;\n(ii) in a city outside the Minneapolis and St. Paul standard metropolitan statistical area that has a population of 7,400 or greater according to the most recent federal census; or\n(iii) in a township that has a population greater than 1,400 but less than 3,000 determined by the 2000 federal census and the building was previously used by a school and was exempt for taxes payable in 2010.\nUse of the property for advanced skills training of incumbent workers does not disqualify the property for the exemption under this subdivision. This exemption includes up to five acres of the land on which the building is located and associated parking areas on that land, except that if the building meets the requirements of clause (3), item (iii), then the exemption includes up to ten acres of land on which the building is located and associated parking areas on that land. If a parking area associated with the facility is used for the purposes of the facility and for other purposes, a portion of the parking area shall be exempt in proportion to the square footage of the facility used for purposes of apprenticeship training.\nA monosloped, single-pitched roof installed over a feedlot or manure storage area to prevent runoff is exempt.\n(a) Property located in the area of the campus of the former state regional treatment center in the city of Fergus Falls, including the five buildings and associated land that were acquired by the city prior to January 1, 2007, is exempt from ad valorem taxes levied under chapter 275.\n(b) The exemption applies for 15 calendar years from the date specified by resolution of the governing body of the city of Fergus Falls. For the final three assessment years of the duration limit, the exemption applies to the following percentages of estimated market value of the property:\n(1) for the third to the last assessment year of the duration, 75 percent;\n(2) for the second to the last assessment year of the duration, 50 percent; and\n(3) for the last assessment year of the duration, 25 percent.\n(a) Notwithstanding subdivision 9, paragraph (a), attached machinery and other personal property which is part of a simple-cycle combustion-turbine electric generation facility that exceeds 150 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) utilize natural gas as a primary fuel;\n(2) be owned by an electric generation and transmission cooperative;\n(3) be located within one mile of an existing 16-inch natural gas pipeline and a 69-kilovolt and a 230-kilovolt high-voltage electric transmission line;\n(4) be designed to provide peaking, emergency backup, or contingency services;\n(5) have received a certificate of need under section 216B.243 demonstrating demand for its capacity; and\n(6) have received by resolution the approval from the governing bodies of the county and the city in which the proposed facility is to be located for the exemption of personal property under this subdivision.\n(b) Construction of the facility must be commenced after January 1, 2008, and before January 1, 2012. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\nA nursing home licensed under section 144A.02 or a boarding care home certified as a nursing facility under title 19 of the Social Security Act that is exempt from federal income taxation pursuant to section 501(c)(3) of the Internal Revenue Code is exempt from property taxation if the nursing home or boarding care home either:\n(1) is certified to participate in the medical assistance program under title 19 of the Social Security Act; or\n(2) certifies to the commissioner of revenue that it does not discharge residents due to the inability to pay.\nAny real or personal property of a railroad wye connection, including the track, ties, ballast, switch gear, and related improvements, is exempt if it meets all of the following:\n(1) is publicly owned;\n(2) is funded, in whole or in part, by state grants;\n(3) is located within the metropolitan area as defined in section 473.121, subdivision 2;\n(4) includes a single track segment that is no longer than 2,500 feet in length;\n(5) connects intersecting rail lines; and\n(6) is constructed after January 1, 2009.\n(a) Notwithstanding subdivision 9, clause (a), attached machinery and other personal property that is part of an electric generation facility that exceeds 150 megawatts of installed capacity, does not exceed 780 megawatts of summer capacity, and meets the requirements of this subdivision is exempt. At the start of construction, the facility must:\n(1) be designed to utilize natural gas as a primary fuel;\n(2) be owned by an entity other than a public utility as defined in section 216B.02, subdivision 4;\n(3) be located within five miles of two or more interstate natural gas pipelines;\n(4) be located within one mile of an existing electrical transmission substation with operating alternating current voltages of 115 kV, 345 kV, and 500 kV;\n(5) be designed to provide electrical capacity, energy, and ancillary services;\n(6) have satisfied all of the requirements under section 216B.243;\n(7) have executed an interconnection agreement with the Midwest Independent System Operator that does not require the acquisition of more than one mile of new electric transmission right-of-way within the county where the facility is located, and does not provide for any other new routes or corridors for future electric transmission lines in the county where the facility is located;\n(8) be located in a county with an essential services and transmission services ordinance;\n(9) have signed a development agreement with the county board in the county in which the facility is located. The development agreement must be adopted by a two-thirds vote of the county board, and must contain provisions ensuring:\n(i) the facility is designed to use effluent from a wastewater treatment facility as its preferred water source if it includes any combined-cycle units, and will not seek an exemption from legislative approval under section 103G.265, subdivision 3, paragraph (b); and\n(ii) all processed wastewater discharge will be colocated with the outfall of a wastewater treatment facility;\n(10) have signed a development agreement with the township board in the township in which the facility is located containing provisions ensuring that noise and visual impacts of the facility are mitigated. The development agreement must be adopted by a two-thirds vote of the township board; and\n(11) have an agreement with the host county, township, and school district for payment in lieu of personal property taxes to the host county, township, and school district for a total amount not to exceed $600,000 per year for the operating life of the facility. Any amount distributed to the school district is not subject to the deductions under section 126C.21.\n(b) Construction of the facility must begin after March 1, 2010, and before March 1, 2014. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the facility.\nNotwithstanding subdivision 9, clause (a), attached machinery and other personal property that is part of a simple-cycle electric generation facility of more than 40 megawatts and less than 125 megawatts of installed capacity and that meets the requirements of this subdivision is exempt. At the time of construction, the facility must:\n(1) utilize natural gas as a primary fuel;\n(2) be located within two miles of parallel existing 36-inch natural gas pipelines and an existing 115-kilovolt high-voltage electric transmission line;\n(3) be designed to provide peaking, emergency backup, or contingency services;\n(4) satisfy a resource deficiency identified in an approved integrated resource plan filed under section 216B.2422; and\n(5) have an agreement with the host county, township, and school district for payment in lieu of personal property taxes to the host county, township, and school district for the operating life of the facility. Any amount distributed to the school district is not subject to the deductions under section 126C.21.\nConstruction of the facility must be commenced after January 1, 2015, and before January 1, 2019. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\n(a) The first $5,000,000 in market value of an elderly living facility is exempt from taxation if it meets all of the following requirements:\n(1) the facility consists of no more than 75 living units;\n(2) the facility is located in a city of the first class with a population of more than 350,000;\n(3) the facility is owned and operated by a nonprofit corporation organized under chapter 317A;\n(4) the owner of the facility is an affiliate of entities that own and operate assisted living and skilled nursing facilities that:\n(i) are located across a street from the facility;\n(ii) are adjacent to a church that is exempt from taxation under subdivision 6;\n(iii) include a congregate dining program; and\n(iv) provide assisted living or similar social and physical support;\n(5) the residents of the facility must:\n(i) be at least 62 years of age; or\n(ii) have a disability;\n(6) at least 30 percent of the units in the facility are occupied by persons whose annual income does not exceed 50 percent of median family income for the area; and\n(7) before taxes payable in 2010, the facility has received approval of street vacation and land use applications from the city in which it is to be located.\n(b) In this subdivision, \"affiliate\" means any entity directly or indirectly controlling or controlled by or under direct or indirect common control with an entity, and \"control\" means the power to direct management and policies through membership or ownership of voting securities.\n(c) The exemption provided in this subdivision applies to taxes levied in each year or partial year of the term of the facility's initial permanent financing or 25 years, whichever is later.\nLand and buildings used exclusively for county or community fairgrounds as provided in section 383C.164.\n(a) Notwithstanding subdivision 9, clause (a), and section 453.54, subdivision 20, attached machinery and other personal property that is part of a multiple reciprocating engine electric generation facility that adds more than 20 and less than 30 megawatts of installed capacity at a site where there is presently more than ten megawatts and fewer than 15 megawatts of installed capacity and that meets the requirements of this subdivision is exempt from taxation and from payments in lieu of taxation. At the time of construction, the facility must:\n(1) be designed to utilize natural gas as a primary fuel;\n(2) be owned and operated by a municipal power agency as defined in section 453.52, subdivision 8;\n(3) be located within one mile of an existing natural gas pipeline;\n(4) be designed to have black start capability and to furnish emergency backup power service to the city in which it is located;\n(5) satisfy a resource deficiency identified in an approved integrated resource plan filed under section 216B.2422; and\n(6) have received, by resolution, the approval of the governing bodies of the city and county in which it is located for the exemption of personal property provided by this subdivision.\n(b) Construction of the facility must be commenced after December 31, 2011, and before January 1, 2015. Property eligible for this exemption does not include (i) electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility; or (ii) property located on the site on July 20, 2011.\nThe following property used in the business of mining that is subject to the gross proceeds tax under section 298.015 is exempt:\n(1) deposits of ores, metals, and minerals and the lands in which they are contained;\n(2) all real and personal property used in mining, quarrying, producing, or refining ores, minerals, or metals, including lands occupied by or used in connection with the mining, quarrying, production, or ore refining facilities; and\n(3) concentrate.\nThis exemption applies for each year that a person subject to tax under section 298.015 uses the property for mining, quarrying, producing, or refining ores, metals, or minerals.\n(a) Property is exempt that:\n(1) was classified as 3a under section 273.13, subdivision 24, for taxes payable in 2013;\n(2) is located in a city of the first class with a population greater than 300,000 as of the 2010 federal census;\n(3) was on January 2, 2012, and is for the current assessment owned by a federally recognized Indian tribe, or its instrumentality, that is located within the state of Minnesota; and\n(4) is used exclusively for tribal purposes or institutions of purely public charity as defined in subdivision 7.\n(b) For purposes of this subdivision, a \"tribal purpose\" means a public purpose as defined in subdivision 8 and includes noncommercial tribal government activities. Property that qualifies for the exemption under this subdivision is limited to no more than two contiguous parcels and structures that do not exceed in the aggregate 20,000 square feet. Property acquired for single-family housing, market-rate apartments, agriculture, or forestry does not qualify for this exemption. This subdivision expires with taxes payable in 2034.\n(c) Property exempt under this section is exempt from the requirements of section 272.025. Upon the written request of an assessor, all books and records relating to the ownership or use of the property which are reasonably necessary to verify that the property qualifies for exemption shall be made available to the assessor.\n(a) Notwithstanding subdivision 9, clause (a), and section 453.54, subdivision 20, attached machinery and other personal property which is part of an electric generation facility that exceeds five megawatts of installed capacity and meets the requirements of this subdivision is exempt. At the time of construction, the facility must be:\n(1) designed to utilize natural gas as a primary fuel;\n(2) owned and operated by a municipal power agency as defined in section 453.52, subdivision 8;\n(3) designed to utilize reciprocating engines paired with generators to produce electrical power;\n(4) located within the service territory of a municipal power agency's electrical municipal utility that serves load exclusively in a metropolitan county as defined in section 473.121, subdivision 4; and\n(5) designed to connect directly with a municipality's substation.\n(b) Construction of the facility must be commenced after June 1, 2013, and before June 1, 2017. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\n(a) Notwithstanding subdivision 9, clause (a), attached machinery and other personal property that is part of an electric generation facility with more than 35 megawatts and less than 40 megawatts of installed capacity and that meets the requirements of this subdivision is exempt from taxation and payments in lieu of taxation. The facility must:\n(1) be designed to utilize natural gas as a primary fuel;\n(2) be owned and operated by a municipal power agency as defined in section 453.52, subdivision 8;\n(3) be located within 800 feet of an existing natural gas pipeline;\n(4) satisfy a resource deficiency identified in an approved integrated resource plan filed under section 216B.2422;\n(5) be located outside the metropolitan area as defined under section 473.121, subdivision 2; and\n(6) have received, by resolution, the approval of the governing bodies of the city and county in which it is located for the exemption of personal property provided by this subdivision.\n(b) Construction of the facility must have been commenced after January 1, 2015, and before January 1, 2017. Property eligible for this exemption does not include electric transmission lines and interconnections or gas pipelines and interconnections appurtenant to the property or the facility.\n(a) Property is exempt that:\n(1) is located in a city of the first class with a population less than 100,000 as of the 2010 federal census;\n(2) was on January 1, 2016, and is for the current assessment, owned by a federally recognized Indian tribe, or its instrumentality, that is located within the state of Minnesota; and\n(3) is used exclusively as a medical clinic.\n(b) Property that qualifies for the exemption under this subdivision is limited to no more than two contiguous parcels and structures that do not exceed, in the aggregate, 30,000 square feet. Property acquired for single-family housing, market-rate apartments, agriculture, or forestry does not qualify for this exemption. The exemption created by this subdivision expires with taxes payable in 2028.\n(a) Property is exempt that:\n(1) is located in a city of the first class with a population of more than 380,000 as of the 2010 federal census;\n(2) was on January 1, 2016, and is for the current assessment, owned by a federally recognized Indian tribe, or its instrumentality, that is located within the state of Minnesota; and\n(3) is used exclusively as a pharmacy, as defined in section 151.01, subdivision 2.\n(b) Property that qualifies for the exemption under this subdivision is limited to parcels and structures that do not exceed, in the aggregate, 4,000 square feet. Property acquired for single-family housing, market-rate apartments, agriculture, or forestry does not qualify for this exemption.\nThe exemption created by this subdivision expires with taxes payable in 2029.\nProperty used as a licensed child care facility that accepts families participating in the child care assistance program under chapter 142E, and that is owned and operated by a nonprofit charitable organization that qualifies for tax exemption under section 501(c)(3) of the Internal Revenue Code, is exempt. For the purposes of this subdivision, \"licensed child care facility\" means a child care center licensed under Minnesota Rules, chapter 9503, or a facility used to provide licensed family day care or group family day care as defined under Minnesota Rules, chapter 9502.\n(a) Property is exempt that:\n(1) is located in a county with a population greater than 28,000 but less than 29,000 as of the 2010 federal census;\n(2) was on January 2, 2018, and is for the current assessment owned by a federally recognized Indian Tribe or its instrumentality, that is located in Minnesota;\n(3) was on January 2, 2018, erroneously treated as exempt under subdivision 7; and\n(4) is used for the same purpose as the property was used on January 2, 2018.\n(b) The owner of property exempt under paragraph (a) may apply to the county for a refund of any state general tax paid for property taxes payable in 2020 and 2021. The county may prescribe the form and manner of the application. The county auditor must certify to the commissioner of revenue the amount needed for refunds under this section, which the commissioner must pay to the county. An amount necessary for refunds under this paragraph is appropriated from the general fund to the commissioner of revenue in fiscal year 2022. This paragraph expires June 30, 2022.\nAn elderly living facility is exempt from taxation if it meets all of the following requirements:\n(1) the facility is located in a city of the first class with a population of fewer than 110,000;\n(2) the facility is owned and operated by a nonprofit organization with tax exempt status under section 501(c)(3) of the Internal Revenue Code;\n(3) construction of the facility was completed between January 1, 1963, and January 1, 1964;\n(4) the facility is an assisted living facility licensed by the state of Minnesota;\n(5) residents of the facility must be (i) at least 55 years of age, or (ii) disabled; and\n(6) at least 30 percent of the units in the facility are occupied by persons whose annual income does not exceed 50 percent of the median family income for the area.\nFor assessment year 2022 only, an exemption application under this section must be filed with the county assessor by June 15, 2023.",
	"repealed": false
}