{
	"id": "137.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.02",
	"title": "137.02 POWERS AND DUTIES OF BOARD OF REGENTS.",
	"text": "[Repealed, 2014 c 149 s 75]\nThe regents of the university shall have authority to indemnify the officers or the employees of the university against liability arising out of the operation of motor vehicles or other equipment by them while engaged in the performance of their duties as such public officials or employees and to pay out of the public funds the premiums on the indemnity insurance policies insuring such governmental agency against such liability. The regents may defend any such officer or employee, in the name and on behalf of the officer or employee, in any suit brought against the officer or employee to enforce a claim, whether groundless or otherwise, arising out of the operation of a motor vehicle or other equipment in the performance of official duties, and may compromise and settle such claim or suit and pay out of public funds the amount of such settlement or compromise, or the amount of any judgment against such officer or employee based on any such claim without first requiring such officer or employee to settle or pay any such claim. The regents may, in their discretion, pay the premiums of the indemnity insurance policies referred to in this subdivision, insuring such officers or employees against liability for or injury to persons or property, within the limits of this subdivision, and such payment of insurance premiums out of public funds shall in no way impose on the regents any liability.\nThe Board of Regents may use any money not specifically appropriated for other purposes for acquiring land by purchase or condemnation. In case it is desired to use the fund for the acquisition of land by eminent domain, the power of eminent domain shall be exercised in accordance with chapter 117.\nLand must not be purchased and a building must not be purchased, constructed, or erected on land of the University of Minnesota until the regents have first consulted with the chair of the senate Finance Committee and the chair of the house of representatives Ways and Means Committee and obtained their advisory recommendations.\nAll nonacademic employees of the University of Minnesota shall be paid salaries comparable to salaries paid to state employees in the classified civil service.",
	"repealed": false
}