{
	"id": "31.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.04",
	"title": "31.04 INSPECTION AUTHORITY.",
	"text": "For purposes of enforcement of the Minnesota Food Law, the commissioner, or any of the commissioner's authorized agents, is authorized upon presenting appropriate credentials to the owner, operator or agent in charge:\n(1) to enter at reasonable times any factory, warehouse, or establishment in which food is manufactured, processed, packed or held for introduction into commerce or after such introduction or to enter any vehicle being used to transport or hold such food in commerce;\n(2) to inspect at reasonable times and within reasonable limits and in a reasonable manner such factory, warehouse, establishment or vehicle and all pertinent equipment, finished and unfinished materials, containers and labeling therein; and to obtain samples necessary to the enforcement of the Minnesota Food Law; and\n(3) to have access to and to copy all records of carriers in commerce showing the movement in commerce of any food or the holding thereof during or after such movement, and the quantity, shipper and consignee thereof; provided, that evidence obtained under this clause shall not be used in a criminal prosecution of the person from whom obtained; and provided, further, that carriers shall not be subject to the other provisions of the Minnesota Food Law by reason of their receipt, carriage, holding, or delivery of food in the usual course of business as carriers.\nUpon completion of any such inspection of a factory, warehouse, or other establishment and prior to leaving the premises, the authorized agent making the inspection shall give to the owner, operator or agent in charge a report in writing setting forth any conditions or practices observed which in the agent's judgment indicate that any food in such establishment:\n(1) consists in whole or in part of any filthy, putrid, or decomposed substance, or\n(2) has been prepared, packed or held under insanitary conditions whereby it may have become contaminated with filth or whereby it may have been rendered injurious to health.\nA copy of such report shall be sent promptly to the commissioner.\nAn authorized agent making any such inspection of a factory, warehouse or other establishment who has obtained any sample in the course of the inspection, upon completion of the inspection and prior to leaving the premises, shall give to the owner, operator, or agent in charge a receipt describing the samples obtained.\nWhen in the course of any such inspection of a factory or other establishment where food is manufactured, processed or packed, the officer or employee making the inspection obtains a sample of any such food and an analysis is made of such sample for the purpose of ascertaining whether such food consists in whole or in part of any filthy, putrid or decomposed substance or is otherwise unfit for food, a copy of the result of such analysis shall be furnished promptly to the owner, operator or agent in charge.",
	"repealed": false
}