{
	"id": "6.481",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.481",
	"title": "6.481 COUNTY AUDITS.",
	"text": "All the powers and duties conferred and imposed upon the state auditor shall be exercised and performed by the state auditor in respect to the offices, institutions, public property, and improvements of several counties of the state. The state auditor may visit, without previous notice, each county and examine all accounts and records relating to the receipt and disbursement of the public funds and the custody of the public funds and other property. The state auditor shall prescribe and install systems of accounts and financial reports that shall be uniform, so far as practicable, for the same class of offices.\nA county must have an annual financial audit. A county may choose to have the audit performed by the state auditor, or may choose to have the audit performed by a CPA firm meeting the requirements of section 326A.05. The state auditor or a CPA firm may accept the records and audit of the Department of Human Services instead of examining county human service funds, if the audit of the Department of Human Services has been made within any period covered by the auditor's audit of other county records.\nA county audit performed by a CPA firm must meet the standards and be in a form meeting recognized industry auditing standards. The state auditor may require additional information from the CPA firm if the state auditor determines that is in the public interest, but the state auditor must accept the audit unless the state auditor determines the audit or its form does not meet recognized industry auditing standards. The state auditor may make additional examinations as the auditor determines to be in the public interest.\nA copy of the annual audit by the state auditor or by a CPA firm must be available for public inspection in the Office of the State Auditor and in the Office of the County Auditor. If an audit is performed by a CPA firm, data relating to the audit are subject to the same data classifications that apply under section 6.715. A CPA firm conducting a county audit must provide access to data relating to the audit and is liable for unlawful disclosure of the data as if it were a government entity under chapter 13.\nIf an audit conducted by the state auditor or a CPA firm discloses malfeasance, misfeasance, or nonfeasance, the auditor must report this to the county attorney, who shall institute civil and criminal proceedings as the law and the protection of the public interests requires.\nA county audited by the state auditor must pay the state auditor for the costs and expenses of the audit. If the state auditor makes additional examinations of a county whose audit is performed by a CPA firm, the county must pay the auditor for the cost of these examinations. Payments must be deposited in the general fund.\nA county that plans to change to or from the state auditor and a CPA firm must notify the state auditor of this change by August 1 of an even-numbered year. Upon this notice, the following calendar year will be the first year's records that will be subject to an audit by the new entity. A county that changes to or from the state auditor must have two annual audits done by the new entity.",
	"repealed": false
}