{
	"id": "144.4804",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.4804",
	"title": "144.4804 REPORTING RELATING TO TUBERCULOSIS.",
	"text": "A licensed health professional must report to the commissioner or a disease prevention officer within 24 hours of obtaining knowledge of a reportable person as specified in subdivision 3, unless the licensed health professional is aware that the facts causing the person to be a reportable person have previously been reported. Within 72 hours of making a report, excluding Saturdays, Sundays, and legal holidays, the licensed health professional shall submit to the commissioner or to the disease prevention officer a certified copy of the reportable person's medical records relating to the carrier's tuberculosis and status as an endangerment to the public health if the person is reportable under subdivision 3, clause (3), (4), or (5). A reporting facility may designate an infection control practitioner to make reports and to send certified medical records relating to the carrier's tuberculosis and status as an endangerment to the public health under this subdivision.\nA person other than a licensed health professional may report to the commissioner or a disease prevention officer if the person has knowledge of a reportable person as specified in subdivision 3, or has probable cause to believe that a person should be reported under subdivision 3.\nA licensed health professional must report to the commissioner or a disease prevention officer if the licensed health professional has knowledge of:\n(1) a person who has been diagnosed with active tuberculosis;\n(2) a person who is clinically suspected of having active tuberculosis;\n(3) a person who refuses or fails to submit to a diagnostic tuberculosis examination when the person is clinically suspected of having tuberculosis;\n(4) a carrier who has refused or failed to initiate or complete treatment for tuberculosis, including refusal or failure to take medication for tuberculosis or keep appointments for directly observed therapy or other treatment of tuberculosis; or\n(5) a person who refuses or fails to follow contagion precautions for tuberculosis after being instructed on the precautions by a licensed health professional or by the commissioner.\nThe report by a licensed health professional under subdivision 1 or by a person under subdivision 2 must contain the following information, to the extent known:\n(1) the reportable person's name, birth date, address or last known location, and telephone number;\n(2) the date and specific circumstances that cause the person to be a reportable person;\n(3) the reporting person's name, title, address, and telephone number; and\n(4) any other information relevant to the reportable person's case of tuberculosis.\nA licensed health professional who is required to report under subdivision 1 or a person who voluntarily reports in good faith under subdivision 2 is immune from liability in a civil, administrative, disciplinary, or criminal action for reporting under this section.\nA person who knowingly or recklessly makes a false report under this section is liable in a civil suit for actual damages suffered by the person or persons reported and for punitive damages.\nA person who is the subject of a report under subdivision 1 is deemed to have waived any privilege created in section 595.02, subdivision 1, paragraphs (d), (e), (g), (i), (j), and (k), with respect to any information provided under this section.\nIf an emergency medical services person, as defined in section 144.7401, subdivision 4, is exposed to a person with active tuberculosis during the performance of duties, the treatment facility's designated infection control coordinator shall notify the emergency medical services agency's exposure control officer by telephone and by written correspondence. The facility's designated infection control coordinator shall provide the emergency medical services person with information about screening and, if indicated, follow-up.",
	"repealed": false
}