{
	"id": "340A.315",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.315",
	"title": "340A.315 FARM WINERY LICENSE.",
	"text": "The commissioner may issue a farm winery license to the owner or operator of a farm winery located within the state and producing table, sparkling, or fortified wines. Licenses may be issued and renewed for an annual fee of $50, which is in lieu of all other license fees required by this chapter.\nA license authorizes the sale, on the farm winery premises, of table, sparkling, or fortified wines produced by that farm winery at on-sale or off-sale, in retail, or wholesale lots in total quantities not in excess of 75,000 gallons in a calendar year, glassware, wine literature and accessories, cheese and cheese spreads, other wine-related food items, and the dispensing of free samples of the wines offered for sale. Sales at on-sale and off-sale may be made on Sundays between 10:00 a.m. and 12:00 midnight. Labels for each type or brand produced must be registered with the commissioner, without fee prior to sale. A farm winery may provide samples of distilled spirits manufactured pursuant to subdivision 7, on the farm winery premises, but may sell the distilled spirits only through a licensed wholesaler. Samples of distilled spirits may not exceed 15 milliliters per variety.\nExcept as otherwise specified in this section, all provisions of this chapter govern the production, sale, possession, and consumption of table, sparkling, or fortified wines produced by a farm winery.\nIf Minnesota-produced or -grown grapes, grape juice, other fruit bases, or honey is not available in quantities sufficient to constitute a majority of the table, sparkling, or fortified wine produced by a farm winery, the holder of the farm winery license may file an affidavit stating this fact with the commissioner. If the commissioner, after consultation with the commissioner of agriculture, determines this to be true, the farm winery may use imported products and shall continue to be governed by the provisions of this section. The affidavit is effective for a period of one year, after which time the farm winery must use the required amount of Minnesota products as provided by subdivision 1 unless the farm winery holder files a new affidavit with the commissioner.\n[See Note.]\nMS 1988 [Repealed, 1985 c 12 s 2]\nNothing in this section or in any other section of law prevents a farm winery from obtaining a separate on-sale license and operating a business establishment that utilizes that license in conjunction with and within the physical facilities of the winery and its buildings.\nFarm wineries licensed under this section are permitted to manufacture distilled spirits as defined under section 340A.101, subdivision 9, which may exceed 25 percent alcohol by volume, made from Minnesota-produced or Minnesota-grown grapes, grape juice, other fruit bases, or honey. The following conditions pertain:\n(1) no farm winery or firm owning multiple farm wineries may manufacture more than 5,000 gallons of distilled spirits in a given year, and this 5,000 gallon limit is part of the 50,000 gallon limit found in subdivision 2;\n(2) a farm winery may not sell at on-sale, off-sale, or wholesale, a distilled spirit that does not qualify as a Minnesota spirit. For purposes of this section, to qualify as a Minnesota spirit, 50 percent of the distilled spirit must be processed and distilled on premises. Distilled spirits produced or in production prior to July 1, 2017, are not counted as part of the calculations under this clause;\n(3) farm wineries must pay an additional annual fee of $50 to the commissioner before beginning production of distilled spirits; and\n(4) farm wineries may not sell or produce distilled spirits for direct sale to manufacturers licensed under section 340A.301, subdivision 6, paragraph (a).\nFarm wineries licensed under this section are permitted to purchase and use bulk wine, provided that:\n(1) the quantity of bulk wine in any farm winery's annual production shall not exceed ten percent of that winery's annual production;\n(2) the bulk wine under subdivision 4 shall be counted as a portion of the 49 percent of product that need not be Minnesota-grown and may be imported from outside Minnesota; and\n(3) the bulk wine must be blended and not directly bottled.\n\"Bulk wine,\" as used in this subdivision, means fermented juice from grapes, other fruit bases, or honey.\nA farm winery license must be issued for operation of a farm winery on agricultural land, operating under an agricultural classification, zone, or conditional use permit. Farm wineries with licenses issued prior to March 1, 2012, are exempt from this provision.\nA farm winery may store finished wine and distilled spirits in a noncontiguous warehouse location, provided that the chosen location complies with Minnesota Rules, part 7515.0300, subpart 12, and any other state or federal requirements. Cartage of finished goods between the farm winery and warehouse must be continuously in the possession of a motor carrier of property as defined in section 221.012, subdivision 27, or carried in a motor vehicle owned, leased, or rented by the farm winery.\nIf no wholesaler is able to provide bulk wine or bulk distilled spirits, a farm winery may purchase either bulk wine or bulk distilled spirits for purposes allowed under this chapter from any available source allowed under federal law.",
	"repealed": false
}