{
	"id": "549.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/549.41",
	"title": "549.41 GENERAL PROVISIONS; CONSTRUCTION.",
	"text": "The provisions of sections 549.30 to 549.41 may not be waived by a payee.\nAny transfer agreement entered into by a payee who is domiciled in this state must provide that dispute under the transfer agreement, including any claims that the payee has breached the agreement, and must be determined in and under the laws of this state. No such transfer agreement shall authorize the transferee or any other party to confess judgment or consent to entry of judgment against the payee.\nNo transfer of structured settlement payment rights shall extend to any payments that are life contingent unless, prior to the date on which the payee signs the transfer agreement, the transferee has established and has agreed to maintain procedures reasonably satisfactory to the annuity issuer and the structured settlement obligor (1) periodically confirms the payee's survival, and (2) gives the annuity issuer and the structured settlement obligor prompt written notice in the event of the payee's death.\n(a) No payee who proposes to make a transfer of structured settlement payment rights shall incur any penalty, forfeit any application fee or other payment, or otherwise incur any liability to the proposed transferee or any assignee based on any failure of such transfer to satisfy the conditions of sections 549.30 to 549.41.\n(b) Compliance with the requirements set forth in sections 549.30 to 549.41 are solely the responsibility of the transferee in any transfer of structured settlement payment rights and neither the structured settlement obligor nor the annuity issuer, if any, has any responsibility for, or any liability arising from, noncompliance with such requirements or failure to fulfill such conditions.\n(a) Nothing contained in sections 549.30 to 549.41 shall be construed to authorize the transfer of workers' compensation payment rights in contravention of applicable law or to give effect to the transfer of workers' compensation payment rights that is invalid under applicable law.\n(b) Nothing contained in sections 549.30 to 549.41 shall:\n(1) be construed to authorize any transfer of structured settlement payment rights in contravention of any applicable law or to imply that any transfer under a transfer agreement entered into before August 1, 2022, is valid or invalid; or\n(2) affect the validity of any transfer of structured settlement payment rights, whether under a transfer agreement entered into or filed before August 1, 2022, in which the structured settlement obligor and annuity issuer waived or has not asserted their rights under terms of the structured settlement prohibiting or restricting the sale, assignment, or encumbrance of the structured settlement payment rights.\nSections 549.30 to 549.41 apply to any transfer of structured settlement payment rights filed on or after August 1, 2022.",
	"repealed": false
}