{
	"id": "181C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/181C.02",
	"title": "181C.02 NOTICE AND PAY TRANSPARENCY.",
	"text": "(a) Upon initial or subsequent account activation, and annually each year while a driver continues to maintain an account with the TNC, a TNC must provide written notice of compensation, or a compensation policy, if any, to each driver containing the following information:\n(1) the right to legally required minimum compensation under section 181C.03;\n(2) the frequency and manner of a driver's pay;\n(3) the rights and remedies available to a driver for a TNC's failure to comply with legal obligations related to minimum compensation; and\n(4) the driver's right to elect coverage of paid family and medical leave benefits, as provided under chapter 268B.\n(b) Notice under this subdivision must be provided in written plain language and made available in English, Amharic, Arabic, Hmong, Oromo, Somali, and Spanish. TNCs operating in Minnesota must consider updating the languages in which they offer the notice each year.\n(c) The TNC must provide notice to a driver in writing or electronically of any changes to the driver's compensation policy at least 48 hours before the date the changes take effect.\nWhen a TNC alerts a driver of a possible assignment to transport a rider, the ride offer must be available for sufficient time for the driver to review, and the TNC must indicate:\n(1) the estimated travel time and number of miles from the driver's current location to the pickup location for P2;\n(2) the estimated travel time and number of miles for the trip for P3; and\n(3) the estimated total compensation, before any gratuity.\nWithin 24 hours of each trip completion, the TNC must transmit a detailed electronic receipt to the driver containing the following information for each unique trip or portion of a unique trip:\n(1) the date, pickup, and drop-off locations. In describing the pickup and drop-off locations, the TNC shall describe the location by indicating the specific block in which the pick-up and drop-off occurred;\n(2) the time and total mileage traveled from pick up to drop off of a rider or riders for P3;\n(3) the time and total mileage traveled from acceptance of the assignment to completion for P2 and P3;\n(4) total fare or fee paid by the rider or riders; and\n(5) total compensation to the driver, specifying:\n(i) any applicable rate or rates of pay, any applicable price multiplier, or variable pricing policy in effect;\n(ii) any gratuity; and\n(iii) an itemized list of all tolls, fees, or other pass-throughs from the rider charged to the driver.\nEach week, a TNC must transmit a weekly summary to a driver in writing or electronically containing the following information for the preceding calendar week:\n(1) total time the driver logged into the TNC application;\n(2) total time and mileage for P2 and P3 segments;\n(3) total fares or fees paid by riders; and\n(4) total compensation to the driver, including any gratuities.\nTNCs must maintain the trip receipts and weekly summaries required under this section for at least three years.",
	"repealed": false
}