{
	"id": "308B.425",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.425",
	"title": "308B.425 BOARD OF DIRECTORS' MEETINGS.",
	"text": "Meetings of the board may be held from time to time as provided in the articles or bylaws at any place within or without the state that the board may select or by any means described in subdivision 2. If the board fails to select a place for a meeting, the meeting must be held at the principal executive office, unless the articles or bylaws provide otherwise.\n(a) A conference among directors by any means of communication through which the directors may simultaneously hear each other during the conference constitutes a board meeting, if the same notice is given of the conference as would be required by subdivision 3 for a meeting, and if the number of directors participating in the conference would be sufficient to constitute a quorum at a meeting. Participation in a meeting by that means constitutes presence in person at the meeting.\n(b) A director may participate in a board meeting not described in paragraph (a) by any means of communication through which the director, other directors so participating, and all directors physically present at the meeting may simultaneously hear each other during the meeting. Participation in a meeting by that means constitutes presence in person at the meeting.\nUnless the articles or bylaws provide for a different time period, a director may call a board meeting by giving at least ten days' notice or, in the case of organizational meetings, at least three days' notice to all directors of the date, time, and place of the meeting. The notice need not state the purpose of the meeting unless this chapter, the articles, or the bylaws require it.\nIf the day or date, time, and place of a board meeting have been provided in the articles or bylaws, or announced at a previous meeting of the board, no notice is required. Notice of an adjourned meeting need not be given other than by announcement at the meeting at which adjournment is taken.\nA director may waive notice of a meeting of the board. A waiver of notice by a director entitled to notice is effective whether given before, at, or after the meeting, and whether given in writing, orally, or by attendance. Attendance by a director at a meeting is a waiver of notice of that meeting, except where the director objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened and does not participate in the meeting after the objection.\nIf the articles or bylaws so provide, a director may give advance written consent or opposition to a proposal to be acted on at a board meeting. If the director is not present at the meeting, consent or opposition to a proposal does not constitute presence for purposes of determining the existence of a quorum, but consent or opposition must be counted as the vote of a director present at the meeting in favor of or against the proposal and must be entered in the minutes or other record of action at the meeting, if the proposal acted on at the meeting is substantially the same or has substantially the same effect as the proposal to which the director has consented or objected.",
	"repealed": false
}