{
	"id": "290.0695",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0695",
	"title": "290.0695 SHORT LINE RAILROAD INFRASTRUCTURE MODERNIZATION CREDIT.",
	"text": "(a) For purpose of this section, the following terms have the meanings given them.\n(b) \"Eligible taxpayer\" means any railroad that is classified by the United States Surface Transportation Board as a Class II or Class III railroad.\n(c) \"Eligible transferee\" means any taxpayer subject to tax under this chapter or chapter 297I.\n(d) \"Qualified railroad reconstruction or replacement expenditures\" means gross expenditures in the taxable year for maintenance, reconstruction, or replacement of railroad infrastructure, including track, roadbed, bridges, industrial leads and sidings, and track-related structures owned or leased by a Class II or Class III railroad in Minnesota as of January 1, 2021. Qualified railroad reconstruction or replacement expenditures also includes new construction of industrial leads, switches, spurs and sidings and extensions of existing sidings in Minnesota by a Class II or Class III railroad.\n(a) An eligible taxpayer is allowed a credit against tax due under this chapter equal to 50 percent of eligible expenses, not to exceed $3,000 per mile, multiplied by the number of miles of railroad track owned or leased within the state by the eligible taxpayer for which the taxpayer made qualified railroad reconstruction or replacement expenditures as of the close of the taxable year for which the credit is claimed.\n(b) If the amount of the credit determined under this section for any taxable year exceeds the liability for tax under this chapter, the excess is a credit carryover to each of the five succeeding taxable years. The entire amount of the excess unused credit for the taxable year must be carried first to the earliest of the taxable years to which the credit may be carried and then to each successive year to which the credit may be carried. The amount of the unused credit that may be added under this paragraph must not exceed the taxpayer's liability for tax less the credit for the taxable year.\n(c) An eligible taxpayer claiming a credit under this section may not also claim the credit under section 297I.20, subdivision 6, for the same qualified railroad reconstruction or replacement expenditures.\n(a) An eligible taxpayer may transfer the credit allowed under this section by written agreement to an eligible transferee. The amount of the transferred credit is limited to the unused, remaining portion of the credit.\n(b) The eligible taxpayer and the eligible transferee must jointly file a copy of the written transfer agreement with the commissioner within 30 days of the transfer. The written agreement must contain the name, address, and taxpayer identification number of the parties to the transfer; the taxable year the eligible taxpayer incurred the qualified expenditures; the amount of credit being transferred; and the taxable year or years for which the transferred credit may be claimed.\n(c) The commissioner must issue a credit certificate to the transferee within 30 days of the joint filing of a copy of the written transfer agreement with the commissioner.\n(d) In the case of an audit or assessment, the transferee is liable for repayment of credits claimed in excess of the allowed amount.\nCredits granted or transferred to a partnership, a limited liability company taxed as a partnership, an S corporation, or multiple owners of property are passed through to the partners, members, shareholders, or owners, respectively, pro rata to each partner, member, shareholder, or owner based on their share of the entity's assets or as specially allocated in their organizational documents or any other executed agreement, as of the last day of the taxable year.\nFor a nonresident or part-year resident, the credit determined under this section must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\nThis section expires January 1, 2031, for taxable years beginning after December 31, 2030.",
	"repealed": false
}