{
	"id": "352D.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/352D.02",
	"title": "352D.02 COVERAGE.",
	"text": "(a) Employees enumerated in paragraph (c), clauses (2), (3), (4), (6) to (14), and (16) to (18), if they are in the unclassified service of the state or Metropolitan Council and are eligible for coverage under the general state employees retirement plan under chapter 352, are participants in the unclassified program under this chapter.\n(b) Persons referenced in paragraph (c), clause (5), are participants in the unclassified program under this chapter unless the person was eligible to elect different coverage under section 3A.07 and elected retirement coverage by the applicable alternative retirement plan. Persons referenced in paragraph (c), clause (15), are participants in the unclassified program under this chapter for judicial employment in excess of the service credit limit in section 490.121, subdivision 22.\n(c) Enumerated employees and referenced persons are:\n(1) the governor, the lieutenant governor, the secretary of state, the state auditor, and the attorney general;\n(2) an employee in the Office of the Governor, Lieutenant Governor, Secretary of State, State Auditor, Attorney General;\n(3) an employee of the State Board of Investment;\n(4) the head of a department, division, or agency created by statute in the unclassified service, an acting department head subsequently appointed to the position, or an employee enumerated in section 15A.0815 or 15A.083, subdivision 4;\n(5) a member of the legislature;\n(6) an unclassified employee of the legislature or a commission or agency of the legislature who is appointed without a limit on the duration of the employment or a temporary legislative employee having shares in the supplemental retirement fund as a result of former employment covered by this chapter, whether or not eligible for coverage under the Minnesota State Retirement System;\n(7) a person who is employed in a position established under section 43A.08, subdivision 1, clause (3), or in a position authorized under a statute creating or establishing a department or agency of the state, which is at the deputy or assistant head of department or agency or director level;\n(8) the regional administrator, or executive director of the Metropolitan Council, general counsel, division directors, operations managers, and other positions as designated by the council, all of which may not exceed 27 positions at the council and the chair;\n(9) the commissioner, deputy commissioner, and not to exceed nine positions of the Minnesota Office of Higher Education in the unclassified service, as designated by the Minnesota Office of Higher Education before January 1, 1992, or subsequently redesignated with the approval of the board of directors of the Minnesota State Retirement System, unless the person has elected coverage by the individual retirement account plan under chapter 354B;\n(10) the clerk of the appellate courts appointed under article VI, section 2, of the Constitution of the state of Minnesota, the state court administrator and judicial district administrators;\n(11) the chief executive officers of correctional facilities operated by the Department of Corrections and of hospitals and nursing homes operated by Direct Care and Treatment;\n(12) an employee whose principal employment is at the state ceremonial house;\n(13) an employee of the Agricultural Utilization Research Institute;\n(14) an employee of the State Lottery who is covered by the managerial plan established under section 43A.18, subdivision 3;\n(15) a judge who has exceeded the service credit limit in section 490.121, subdivision 22;\n(16) an employee of Enterprise Minnesota, Inc.;\n(17) a person employed by the Minnesota State Colleges and Universities as faculty or in an eligible unclassified administrative position as defined in section 354B.20, subdivision 6, who was employed by the former state university or the former community college system before May 1, 1995, and elected unclassified program coverage prior to May 1, 1995; and\n(18) a person employed by the Minnesota State Colleges and Universities who was employed in state service before July 1, 1995, who subsequently is employed in an eligible unclassified administrative position as defined in section 354B.20, subdivision 6, and who elects coverage by the unclassified program.\n[Repealed, 1995 c 141 art 4 s 31]\n[Repealed, 1991 c 238 art 1 s 26]\nAn employee covered by the general employees retirement plan who is subsequently employed as a full-time unclassified employee of the legislature or any commission or agency of the legislature without a limit on the duration of the employment may elect to transfer accumulated employee and matching employer contributions as provided in section 352D.03.\nAn employee who is a participant in the unclassified program by virtue of employment in a position listed in subdivision 1 may elect to remain in the unclassified program upon subsequent employment in an unlimited, full-time unclassified position that is not listed in subdivision 1. To elect participation in the unclassified program, the employee must give notice to the executive director of the Minnesota State Retirement System within one year of the commencement of employment in an unclassified position that is not listed in subdivision 1. Upon receipt of the notice, the executive director shall transfer to the employee's account in the unclassified program an amount equal to the employer and employee contributions with six percent interest to the regular plan on the employee's behalf from the commencement of employment in the position not listed in subdivision 1 to the receipt of the notice by the executive director.\nA person becoming a participant in the unclassified program prior to July 1, 2010, by virtue of employment in a position specified in subdivision 1, clause (4), and remaining in the unclassified service shall remain a participant in the program even though the position the person occupies is deleted from any of the sections referenced in subdivision 1, clause (4), by subsequent amendment, except that a person is not eligible to elect the unclassified program after separation from unclassified service if on the return of the person to service, that position is not specified in subdivision 1, clause (4). Any person employed in a position specified in subdivision 1 shall cease to participate in the unclassified program in the event that the position is placed in the classified service.\n(a) A person in the unclassified program and referred to in subdivision 1, paragraph (c), clauses (2) to (4), (6) to (14), and (16) to (18), may elect to terminate participation in the unclassified program and be covered by the general state employees retirement plan if the person files an election to transfer to the general state employees retirement plan with the executive director of the Minnesota State Retirement System as provided in paragraph (b) and the person's current employment or appointment:\n(1) began before July 1, 2010, and the person has at least ten years of covered employment; or\n(2) began after June 30, 2010, and the person has no more than seven years of allowable service in the unclassified program.\n(b) An election to transfer must be in writing, on a form provided by the executive director, and delivered to the executive director:\n(1) for persons described in paragraph (a), clause (1), no later than one month following the termination of covered employment; or\n(2) for persons described in paragraph (a), clause (2), by the earlier of (i) the end of the month following the termination of employment in a position covered by the unclassified program, and (ii) the last day of the seventh year of allowable service in the unclassified program.\nFor purposes of this chapter, an employee who does not file an election to transfer with the executive director is deemed to have exercised the option to participate in the unclassified program.\n(c) If the transfer election is made, the executive director shall redeem the employee's total shares and credit to the employee's account in the general employees retirement plan the amount of contributions that would have been credited had the employee been covered by the general employees retirement plan during the employee's entire covered employment. The balance of money redeemed and not credited to the employee's account must be transferred to the general employees retirement plan, except that the executive director must determine:\n(1) the employee contributions paid to the unclassified program; and\n(2) the employee contributions that would have been paid to the general employees retirement plan for the comparable period, if the individual had been covered by that plan.\nIf clause (1) is greater than clause (2), the difference must be refunded to the employee as provided in section 352.22. If clause (2) is greater than clause (1), the difference must be paid by the employee within six months of electing general employees retirement plan coverage or before the effective date of the annuity, whichever is sooner.\n(d) An election under this subdivision to transfer coverage to the general employees retirement plan is irrevocable during any period of covered employment.\n(e) A person referenced in subdivision 1, paragraph (c), clause (1), (5), or (15), who is credited with employee shares in the unclassified program is not permitted to terminate participation in the unclassified program and be covered by the general employees retirement plan.\nWhen any person elects participation in the unclassified program all contributions from the time first eligible to make such an election shall be covered by the program.\n[Repealed, 2004 c 267 art 1 s 9]\nThe provisions of section 352.04, subdivision 8, apply to this section.",
	"repealed": false
}