{
	"id": "270C.728",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.728",
	"title": "270C.728 PUBLICATION OF NAMES OF DELINQUENT TAXPAYERS.",
	"text": "(a) Notwithstanding any other law, the commissioner may publish a list or lists of taxpayers who owe delinquent taxes, and who meet the requirements of paragraph (b).\n(b) For purposes of this section, a taxpayer may be included on a list if:\n(1) the taxes owed remain unpaid at least 180 days after the dates they were due;\n(2) the taxpayer's total liability for the taxes, including penalties, interest, and other charges, is at least $5,000; and\n(3) a tax lien has been filed or a judgment for the liability has been entered against the taxpayer before notice is given under subdivision 3.\n(c) In the case of listed taxpayers that are business entities, the commissioner may also list the names of responsible persons assessed pursuant to section 270C.56 for listed liabilities, who are not protected from publication by subdivision 2, and for whom the requirements of paragraph (b) are satisfied with regard to the personal assessment.\n(d) Before any list is published under this section, the commissioner must certify in writing that each of the conditions for publication as provided in this section has been satisfied, and that procedures were followed to ensure the accuracy of the list and notice was given to the affected taxpayers.\n(a) The commissioner may publish lists of some or all of the taxpayers described in subdivision 1. A list must include the taxpayers with the largest unpaid liabilities of the kind used to define the list, subject to the limitations of paragraphs (b) and (c).\n(b) For the purposes of this section, a tax is not delinquent if:\n(1) an administrative or court action contesting the amount or validity of the taxpayer's liability has been filed or served and is unresolved at the time when notice would be given under subdivision 3;\n(2) an appeal period to contest the liability has not expired; or\n(3) the liability is subject to a payment agreement and there is no delinquency in the payments required under the agreement.\n(c) Unpaid liabilities are not subject to publication if:\n(1) the commissioner is in the process of reviewing or adjusting the liability;\n(2) the taxpayer is a debtor in a bankruptcy proceeding and the automatic stay is in effect;\n(3) the commissioner has been notified that the taxpayer is deceased; or\n(4) the time period for collecting the taxes has expired.\n(a) At least 30 days before publishing the name of a delinquent taxpayer, the commissioner shall mail a written notice to the taxpayer, detailing the amount and nature of each liability and the intended publication of the information listed in subdivision 4 related to the liability. The notice must be mailed by first class and certified mail addressed to the last known address of the taxpayer. The notice must include information regarding the exceptions listed in subdivision 2 and must state that the taxpayer's information will not be published if the taxpayer pays the delinquent obligation, enters into an agreement to pay, or provides information establishing that subdivision 2 prohibits publication of the taxpayer's name.\n(b) After at least 30 days has elapsed since the notice was mailed and the delinquent tax has not been paid and the taxpayer has not proved to the commissioner that subdivision 2 prohibits publication, the commissioner may publish in a list of delinquent taxpayers the information about the taxpayer that is listed in subdivision 4.\nThe list may be published by any medium or method. The list must contain the name, address, type of tax, and period for which payment is due for each liability, including penalties, interest, and other charges owed by each listed delinquent taxpayer.\nThe commissioner shall remove the name of a taxpayer from the list of delinquent taxpayers after the commissioner receives written notice of and verifies any of the following facts about the liability in question:\n(1) the taxpayer has contacted the commissioner and arranged resolution of the liability;\n(2) an active bankruptcy proceeding has been initiated for the liability;\n(3) a bankruptcy proceeding concerning the liability has resulted in discharge of the liability; or\n(4) the commissioner has written off the liability.\nIf the commissioner publishes a name under subdivision 1 in error, the taxpayer whose name was erroneously published has a right to request a retraction and apology. If the taxpayer so requests, the commissioner shall publish a retraction and apology acknowledging that the taxpayer's name was published in error. The retraction and apology must appear in the same medium and the same format as the original list that contained the name listed in error.\nActions against the commissioner or the state of Minnesota arising out of the implementation of this program must be brought under section 270C.275. If an action results in damages awarded to a taxpayer, the damages must be paid out of the department's operating budget rather than in accordance with section 3.736, subdivision 7.",
	"repealed": false
}