{
	"id": "403.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.39",
	"title": "403.39 REGIONAL RADIO BOARDS.",
	"text": "Notwithstanding the provisions of section 471.59, subdivision 1, requiring commonality of powers, two or more counties or a city and one or more counties within a region defined in the statewide radio board's project plan under section 403.36, through action of their governing bodies, by adoption of a joint powers agreement that complies with section 471.59, subdivisions 1 to 5, may establish a regional radio board to implement, maintain, and operate regional and local improvements to the statewide, shared, trunked radio and communication system provided for in section 403.36. Where the governing bodies of the participating units of government of a regional radio board have approved an amendment to the regional radio board's joint powers agreement authorizing the incorporation of a federally recognized Indian tribe into the joint powers agreement, the federally recognized Indian tribe may be incorporated into the joint powers agreement upon the adoption of the joint powers agreement by the tribe's governing body. Membership in a regional radio board shall include one county commissioner appointed by each respective county board party to the joint powers agreement and an elected official from any city party to the joint powers agreement, and may include additional members whose qualifications are specified in the joint powers agreement.\nIn addition to the powers enumerated in section 471.59, a regional radio board, as necessary and convenient to implement regional and local improvements to the statewide, shared, trunked radio and communication system provided for in section 403.36, has the following powers:\n(1) to establish bylaws and other organizational procedures consistent with the terms of the joint powers agreement;\n(2) to apply for and hold licenses for public safety frequencies to be used in regional and local improvements, including a regional data system;\n(3) to set or adopt regional performance and technical standards, subject to review by the Statewide Radio Board, that do not interfere with the backbone or interoperability infrastructure administered by the Statewide Radio Board;\n(4) to enter into contracts necessary to carry out its responsibilities;\n(5) to acquire by purchase, lease, gift, or grant, property, both real and personal, and interests in property necessary for the accomplishment of its purposes and to sell or otherwise dispose of property it no longer requires; and\n(6) to contract with the state of Minnesota, through the commissioner of transportation, for construction, ownership, operation, and maintenance of regional or local improvements to the statewide, shared, trunked radio and communication system.\nWhere a regional radio board has been established in accordance with this section, local governments and other public entities eligible under Code of Federal Regulations, title 47, part 90, to operate upon a statewide, shared public safety radio and communication system within the region covered by the regional radio board must coordinate its implementation through one of the parties to the joint powers agreement. For purposes of grants made available by the Department of Public Safety, a regional radio board is entitled to apply for, receive, and administer grants on behalf of one or more public safety entities operating within the counties who are a party to the joint powers agreement.\nNothing in this section shall limit a regional radio board organized under section 471.59 from expanding the scope of the joint powers agreement to include the joint or cooperative exercise of powers consistent with section 471.59 related to other public safety purposes which may include the joint and cooperative exercise of powers among less than all members of the regional radio board. An amendment to the joint powers agreement expanding the scope of the agreement must be approved by the governing bodies of each of the members of the regional radio board.",
	"repealed": false
}