{
	"id": "97A.341",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.341",
	"title": "97A.341 RESTITUTION FOR WILD ANIMALS ILLEGALLY TAKEN.",
	"text": "A person who kills, injures, or possesses a wild animal in violation of the game and fish laws or section 343.21 is liable to the state for the value of the wild animal as provided in this section. Species afforded protection include members of the following groups as defined by statute or rule: game fish, native rough fish, game birds, big game, small game, fur-bearing animals, minnows, and threatened and endangered animal species. Other animal species may be added by rule of the commissioner as determined after public meetings and notification of the chairs of the environment and natural resources committees in the senate and house of representatives.\n(a) An enforcement officer who arrests a person for killing, injuring, or possessing a wild animal in violation of the game and fish laws or section 343.21 must describe the number, species, and restitution value of wild animals illegally killed, injured, or possessed on the warrant or the notice to appear in court.\n(b) As part of the charge against a person arrested for killing, injuring, or possessing a wild animal in violation of the game and fish laws or section 343.21, the prosecuting attorney must include a demand that restitution be made to the state for the value of the wild animal killed, injured, or possessed. The demand for restitution is in addition to the criminal penalties otherwise provided for the violation.\nIf a person is convicted of or pleads guilty to killing, injuring, or possessing a wild animal in violation of the game and fish laws or section 343.21, the court must require the person to pay restitution to the state for replacement of the wild animal as part of the sentence or state in writing why restitution was not imposed. The court may consider the economic circumstances of the person and, in lieu of monetary restitution, order the person to perform conservation work representing the amount of restitution that will aid the propagation of wild animals. If the court does not order a person to pay restitution, the court administrator must send a copy of the court order to the commissioner.\nThe amount of restitution shall be determined by the court by a preponderance of the evidence. In determining the amount of restitution, the court must consider the value of the wild animal under section 97A.345.\nThe court administrator shall forward restitution collected under this section to the commissioner of management and budget and the commissioner shall credit all money forwarded to the game and fish fund in the state treasury.",
	"repealed": false
}