{
	"id": "3.3005",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.3005",
	"title": "3.3005 FEDERAL MONEY; EXPENDITURE REVIEW.",
	"text": "As used in this section, the term \"state agency\" means all agencies in the executive branch of state government, but does not include the Minnesota Historical Society, the University of Minnesota, or the Minnesota State Colleges and Universities.\nA state agency shall not expend money received by it under federal law for any purpose unless a request to spend federal money from that source for that purpose in that biennium has been submitted by the governor to the legislature as a part of a budget request submitted during or within ten days before the start of a regular legislative session, or unless specifically authorized by law or as provided by this section. A budget request submitted to the legislature according to this subdivision must be submitted at least 20 days before the deadline set by the legislature for legislative budget committees to act on finance bills.\nTwenty days after a governor's budget request that includes a request to spend federal money is submitted to the legislature under subdivision 2, a state agency may expend money included in that request unless, within the 20-day period, a member of the Legislative Advisory Commission requests further review. If a Legislative Advisory Commission member requests further review of a federal funds spending request, the agency may not expend the federal funds until the request has been satisfied and withdrawn, the expenditure is approved in law, or the regular session of the legislature is adjourned for the year.\nIf a request to spend federal money is included in the governor's budget or spending the money is authorized by law but the amount of federal money that has been awarded and requires a state match greater than the amount that was included in the budget request or authorized by law, the federal funds that have been awarded that require an additional state match may be allotted for expenditure after the requirements of subdivision 5 or 6 are met.\nIf a request to spend federal money is included in a governor's budget request and approved according to subdivision 2a, but the purpose for which the money is to be used changes from the time of the request and approval, the amount may be allotted for expenditure after a revised request is submitted according to subdivision 2 or the requirements of subdivision 5 or 6 are met.\nIf a request to spend federal money is included in a governor's budget request and approved according to subdivision 2 or 5 and the amount of money awarded increases after the request is made and authorized, the additional amount may be allotted for expenditure after a revised request is submitted according to subdivision 2, or the requirements of subdivision 4, 5, or 6 are met.\nIf federal money is awarded to the state for expenditure after the deadline in subdivision 2 or while the legislature is not in session, and the availability of money from that source or for that purpose or in that fiscal year could not reasonably have been anticipated and included in the governor's budget request, and an urgency requires that all or part of the money be encumbered or expended before the legislature reconvenes or prior to the end of the 20-day period specified in subdivision 2, it may be allotted to a state agency after the requirements of subdivision 5 are met.\nFederal money that is awarded and becomes available under subdivision 3, 3a, 3b, or 4 may be allotted after the commissioner of management and budget has submitted the request to the members of the Legislative Advisory Commission for their review and recommendation for further review. If a recommendation is not made within ten days, no further review by the Legislative Advisory Commission is required, and the commissioner shall approve or disapprove the request. If a recommendation by any member is for further review the governor shall submit the request to the Legislative Advisory Commission for its review and recommendation. Failure or refusal of the commission to make a recommendation promptly is a negative recommendation.\nIf federal money becomes available to the state for expenditure after the deadline in subdivision 2 or while the legislature is not in session, and subdivision 4 does not apply, a request to expend that federal money may be submitted by the commissioner of management and budget to members of the Legislative Advisory Commission for their review and recommendation. This request must be submitted by the later of October 1 or 100 days before the start of the next legislative session. If any member of the commission makes a negative recommendation or a recommendation for further review on a request during the 20-day period beginning the day the commissioner submits the request, the commissioner shall not approve expenditure of that federal money. If the members of the commission make a positive recommendation or no recommendation, the commissioner may approve the request and the federal money may be allotted for expenditure. The commissioner may submit the request again under subdivision 2 if the request receives a negative recommendation or a recommendation for further review under this subdivision.\nA member of the commission, with written notice to the commissioner, may withdraw a negative recommendation or a recommendation for further review within 20 days of making the recommendation. If all negative recommendations and all recommendations for further review have been withdrawn, the commissioner may approve the expenditure of the federal money.\nApproval of the spending of federal funds under subdivision 2 is for the full term of the availability of the federal funds, up to the end of the biennium that begins July 1 following the submission of the request. Approval of the spending of federal funds under subdivision 3, 3a, 3b, or 6 is for the full term of the availability of the federal funds, up to the end of the current biennium. Approval of the spending for federal funds under subdivision 4 is for the fiscal year for which the urgency exists.\nA request to spend federal funds submitted under this section must include the name of the federal grant, the federal agency from which the funds are available, a federal identification number, a brief description of the purpose of the grant, the amounts expected by fiscal year, an indication if any state match is required, an indication if there is a maintenance of effort requirement, and the number of full-time equivalent positions needed to implement the grant.\nThe commissioner of management and budget may, with written notice, withdraw any request to spend federal money under this section. The commissioner of an agency requesting to expend federal money under this section may, with written notice, withdraw any request to spend federal money under this section that was submitted by the commissioner's agency.",
	"repealed": false
}