{
	"id": "299C.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.72",
	"title": "299C.72 MINNESOTA CRIMINAL HISTORY CHECKS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Applicant for employment\" means an individual who seeks either county or city employment or has applied to serve as a volunteer in the county or city.\n(c) \"Applicant for licensure\" means the individual seeks a license issued by the county or city which is not subject to a federal- or state-mandated background check.\n(d) \"Authorized law enforcement agency\" means the county sheriff for checks conducted for county purposes, the police department for checks conducted for city purposes, or the county sheriff for checks conducted for city purposes where there is no police department.\n(e) \"Criminal history check\" means retrieval of criminal history data via the secure network described in section 299C.46.\n(f) \"Criminal history data\" means adult convictions and adult open arrests less than one year old found in the Minnesota computerized criminal history repository.\n(g) \"Current employee\" means an individual presently employed by either a county or city or who presently serves as a volunteer in the county or city.\n(h) \"Current licensee\" means an individual who has previously sought and received a license, which is still presently valid, issued by a county or city.\n(i) \"Informed consent\" has the meaning given in section 13.05, subdivision 4, paragraph (d).\n(a) The criminal history check authorized by this section shall not be used in place of a statutorily mandated or authorized background check.\n(b) An authorized law enforcement agency may conduct a criminal history check of an individual who is an applicant for employment, current employee, applicant for licensure, or current licensee. Prior to conducting the criminal history check, the authorized law enforcement agency must receive the informed consent of the individual.\n(c) The authorized law enforcement agency may disseminate criminal history data to either the hiring or licensing authority of the city or county requesting checks for applicants, licensees, or current employees. The authorized law enforcement agency and the hiring or licensing authority of the city or county must maintain criminal history data securely and act consistently with section 364.05.",
	"repealed": false
}