{
	"id": "177.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.23",
	"title": "177.23 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following terms, for the purposes of sections 177.21 to 177.35, have the meanings given to them in this section.\n\"Department\" means the Department of Labor and Industry.\n\"Commissioner\" means the commissioner of labor and industry or authorized designee or representative.\n\"Wage\" means compensation due to an employee by reason of employment, payable in:\n(1) legal tender of the United States;\n(2) check on banks convertible into cash on demand at full face value;\n(3) except for instances of written objection to the employer by the employee, direct deposit to the employee's choice of demand deposit account; or\n(4) an electronic fund transfer to a payroll card account that meets all of the requirements of section 177.255, subject to allowances permitted by rules of the department under section 177.28.\n\"Employ\" means to permit to work.\n\"Employer\" means any individual, partnership, association, corporation, business trust, or any person or group of persons acting directly or indirectly in the interest of an employer in relation to an employee.\n\"Employee\" means any individual employed by an employer but does not include:\n(1) two or fewer specified individuals employed at any given time in agriculture on a farming unit or operation who are paid a salary;\n(2) any individual employed in agriculture on a farming unit or operation who is paid a salary greater than the individual would be paid if the individual worked 48 hours at the state minimum wage plus 17 hours at 1-1/2 times the state minimum wage per week;\n(3) an individual under 18 who is employed in agriculture on a farm to perform services other than corn detasseling or hand field work when one or both of that minor hand field worker's parents or physical custodians are also hand field workers;\n(4) for purposes of section 177.24, an individual under 18 who is employed as a corn detasseler;\n(5) any staff member employed on a seasonal basis by an organization for work in an organized resident or day camp operating under a permit issued under section 144.72;\n(6) any individual employed in a bona fide executive, administrative, or professional capacity, or a salesperson who conducts no more than 20 percent of sales on the premises of the employer;\n(7) any individual who renders service gratuitously for a nonprofit organization;\n(8) any individual who serves as an elected official for a political subdivision or who serves on any governmental board, commission, committee or other similar body, or who renders service gratuitously for a political subdivision;\n(9) any individual employed by a political subdivision to provide police or fire protection services or employed by an entity whose principal purpose is to provide police or fire protection services to a political subdivision;\n(10) any individual employed by a political subdivision who is ineligible for membership in the Public Employees Retirement Association under section 353.01, subdivision 2b, clause (1), (2), (4), or (9), item (i);\n(11) any driver employed by an employer engaged in the business of operating taxicabs;\n(12) any individual engaged in babysitting as a sole practitioner;\n(13) for the purpose of section 177.25, any individual employed on a seasonal basis in a carnival, circus, fair, or ski facility;\n(14) any individual under 18 working less than 20 hours per workweek for a municipality as part of a recreational program;\n(15) any individual employed by the state as a natural resource manager 1, 2, or 3 (conservation officer);\n(16) any individual in a position for which the United States Department of Transportation has power to establish qualifications and maximum hours of service under United States Code, title 49, section 31502;\n(17) any individual employed as a seafarer. The term \"seafarer\" means a master of a vessel or any person subject to the authority, direction, and control of the master who is exempt from federal overtime standards under United States Code, title 29, section 213(b)(6), including but not limited to pilots, sailors, engineers, radio operators, firefighters, security guards, pursers, surgeons, cooks, and stewards;\n(18) any individual employed by a county in a single-family residence owned by a county home school as authorized under section 260B.060 if the residence is an extension facility of that county home school, and if the individual as part of the employment duties resides at the residence for the purpose of supervising children as defined by section 260C.007, subdivision 4; or\n(19) nuns, monks, priests, lay brothers, lay sisters, ministers, deacons, and other members of religious orders who serve pursuant to their religious obligations in schools, hospitals, and other nonprofit institutions operated by the church or religious order.\n\"Occupation\" means any occupation, service, trade, business, industry, or branch or group of industries or employment or class of employment in which employees are gainfully employed.\n\"Gratuities\" means monetary contributions received directly or indirectly by an employee from a guest, patron, or customer for services rendered and includes an obligatory charge assessed to customers, guests or patrons which might reasonably be construed by the guest, customer, or patron as being a payment for personal services rendered by an employee and for which no clear and conspicuous notice is given by the employer to the customer, guest, or patron that the charge is not the property of the employee.\nWith respect to any caretaker, manager, or other on-site employee of a residential building or buildings whose principal place of residence is in the residential building, including a caretaker, manager, or other on-site employee who receives a principal place of residence as full or partial compensation for duties performed for an employer, the term \"hours worked\" includes time when the caretaker, manager, or other on-site employee is performing any duties of employment, but does not mean time when the caretaker, manager, or other on-site employee is on the premises and available to perform duties of employment and is not performing duties of employment.\nWith respect to an individual who is (1) employed to provide companionship services to individuals who, because of age or infirmity, are unable to care for their own needs; (2) employed to stay overnight in the home of such an aged or infirm individual; and (3) paid the minimum wage or more for at least four hours associated with the overnight stay, the term \"hours\" for the purposes of requiring the payment of minimum wages and overtime premiums under sections 177.24 and 177.25, shall not include nighttime hours, from 10:00 p.m. to 9:00 a.m., up to a total of eight hours per night, during which the employee is available to perform duties for the aged or infirm individual, but is not in fact performing such duties and is free to sleep and otherwise engage in normal private pursuits in the aged or infirm individual's home. For the purposes of this subdivision, the term \"companionship services\" is defined in Code of Federal Regulations, title 29, sections 552.6 and 552.106 as of March 1, 1984.\n\"Large employer\" means an enterprise whose annual gross volume of sales made or business done is not less than $500,000, exclusive of excise taxes at the retail level that are separately stated, and covered by the Minnesota Fair Labor Standards Act, sections 177.21 to 177.35.\n\"Small employer\" means an enterprise whose annual gross volume of sales made or business done is less than $500,000, exclusive of excise taxes at the retail level that are separately stated, and covered by the Minnesota Fair Labor Standards Act, sections 177.21 to 177.35.",
	"repealed": false
}