{
	"id": "152.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.18",
	"title": "152.18 DISCHARGE AND DISMISSAL.",
	"text": "(a) A court may defer prosecution as provided in paragraph (c) for any person found guilty, after trial or upon a plea of guilty, of a violation of section 152.023, subdivision 2, 152.024, subdivision 2, 152.025, subdivision 2, or 152.027, subdivision 2, 3, 4, or 6, paragraph (d), for possession of a controlled substance, who:\n(1) has not previously participated in or completed a diversion program authorized under section 401.065;\n(2) has not previously been placed on probation without a judgment of guilty and thereafter been discharged from probation under this section; and\n(3) has not been convicted of a felony violation of this chapter, including a felony-level attempt or conspiracy, or been convicted by the United States or another state of a similar offense that would have been a felony under this chapter if committed in Minnesota, unless ten years have elapsed since discharge from sentence.\n(b) The court must defer prosecution as provided in paragraph (c) for any person found guilty of a violation of section 152.025, subdivision 2, who:\n(1) meets the criteria listed in paragraph (a), clauses (1) to (3); and\n(2) has not previously been convicted of a felony offense under any state or federal law or of a gross misdemeanor under section 152.025.\n(c) In granting relief under this section, the court shall, without entering a judgment of guilty and with the consent of the person, defer further proceedings and place the person on probation upon such reasonable conditions as it may require and for a period, not to exceed the maximum sentence provided for the violation. The court may give the person the opportunity to attend and participate in an appropriate program of education regarding the nature and effects of alcohol and drug abuse as a stipulation of probation. Upon violation of a condition of the probation, the court may enter an adjudication of guilt and proceed as otherwise provided. The court may, in its discretion, dismiss the proceedings against the person and discharge the person from probation before the expiration of the maximum period prescribed for the person's probation. If during the period of probation the person does not violate any of the conditions of the probation, then upon expiration of the period the court shall discharge the person and dismiss the proceedings against that person. Discharge and dismissal under this subdivision shall be without court adjudication of guilt, but a not public record of it shall be retained by the Bureau of Criminal Apprehension for the purpose of use by the courts in determining the merits of subsequent proceedings against the person. The not public record may also be opened only upon court order for purposes of a criminal investigation, prosecution, or sentencing. Upon receipt of notice that the proceedings were dismissed, the Bureau of Criminal Apprehension shall notify the arresting or citing law enforcement agency and direct that agency to seal its records related to the charge. Upon request by law enforcement, prosecution, or corrections authorities, the bureau shall notify the requesting party of the existence of the not public record and the right to seek a court order to open it pursuant to this section. The court shall forward a record of any discharge and dismissal under this subdivision to the bureau which shall make and maintain the not public record of it as provided under this subdivision. The discharge or dismissal shall not be deemed a conviction for purposes of disqualifications or disabilities imposed by law upon conviction of a crime or for any other purpose.\nFor purposes of this subdivision, \"not public\" has the meaning given in section 13.02, subdivision 8a.\n[Repealed, 1996 c 408 art 9 s 10]\nAny person who has been found guilty of a violation of section 152.09 with respect to a small amount of marijuana which violation occurred prior to April 11, 1976, and whose conviction would have been a petty misdemeanor under the provisions of section 152.15, subdivision 2, clause (5) in effect on April 11, 1978, but whose conviction was for an offense more serious than a petty misdemeanor under laws in effect prior to April 11, 1976, may petition the court in which the person was convicted to expunge from all official records, other than the nonpublic record retained by the Department of Public Safety pursuant to section 152.15, subdivision 2, clause (5), all recordation relating to the person's arrest, indictment or information, trial and conviction of an offense more serious than a petty misdemeanor. The court, upon being satisfied that a small amount was involved in the conviction, shall order all the recordation expunged. No person as to whom an order has been entered pursuant to this subdivision shall be held thereafter under any provision of any law to be guilty of perjury or otherwise giving a false statement by reason of the person's failure to recite or acknowledge conviction of an offense greater than a petty misdemeanor, unless possession of marijuana is material to a proceeding.",
	"repealed": false
}