{
	"id": "32D.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/32D.23",
	"title": "32D.23 RECOMBINANT BOVINE GROWTH HORMONE LABELING.",
	"text": "Products offered for wholesale or retail sale in this state that contain milk, cream, or any product or by-product of milk or cream that have been processed and handled pursuant to this section may be labeled with an rBGH statement that is not false or misleading and in accordance with the federal labeling standards. Products offered for wholesale or retail sale in this state need not contain any further label information relative to the use of rBGH in milk production.\n(a) A dairy plant purchasing milk or cream to be used in products labeled with rBGH claims pursuant to subdivision 1 must provide an affidavit from each producer that states that all cows used in the producer's dairy operations have not and will not be treated with rBGH, without advanced written notice of at least 30 days.\n(b) The affidavit must be signed by the producer or authorized representative. Affidavits must be kept on file for not less than two years after receiving written notice that rBGH use status will change.\n(c) If a plant chooses to process and handle only milk or milk products sourced from cows who have not been treated with rBGH, the plant, as an alternative to providing individual producer affidavits, may provide one affidavit to certify that the plant has procedures in place to verify that all producers are not using rBGH. A copy of the written procedure that describes this verification process must also be provided with the plant affidavit.\n(d) All affidavits and corresponding records must be available for inspection by the commissioner.\n(e) Dairy plants supplying milk or cream to a processor or manufacturer of a product to be labeled pursuant to subdivision 1, for use in that product, shall supply a certification to that processor or manufacturer stating that producers of the supplied milk or cream have executed and delivered affidavits pursuant to this subdivision.\nMilk or cream from non-rBGH-treated cows used in manufacturing or processing of products labeled pursuant to subdivision 1 must be kept fully separate from any other milk or cream through all stages of storage, transportation, and processing until the milk or resulting dairy products are in final packaged form in a properly labeled container. Records of the separation must be kept by the dairy plant and product processor or manufacturer at all stages and made available to the commissioner for inspection.",
	"repealed": false
}