{
	"id": "94.342",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.342",
	"title": "94.342 CLASSES OF LAND.",
	"text": "All land owned by the state and controlled or administered by the commissioner or by any division of the Department of Natural Resources shall be known as class A land for the purposes of sections 94.341 to 94.347. Class A land shall include school, swamp, internal improvement, and other land granted to the state by acts of Congress, state forest land, tax-forfeited land held by the state free from any trust in favor of taxing districts, and other land acquired by the state in any manner and controlled or administered as aforesaid; but this enumeration shall not be deemed exclusive.\nAll lands heretofore or hereafter acquired by the state through tax forfeiture, held subject to a trust in favor of taxing districts, and under the control of county authorities for classification, appraisal, and sale shall be known as class B land for the purposes of sections 94.341 to 94.347.\n(a) Land bordering on or adjacent to any meandered or other public waters and withdrawn from sale by law is riparian land. Riparian land may not be given in exchange unless:\n(1) expressly authorized by the legislature;\n(2) through the same exchange the state acquires land on the same or other public waters in the same general vicinity affording at least equal opportunity for access to the waters and other riparian use by the public;\n(3) Class A land is being exchanged for class A land; or\n(4) the exchange is an agency of the United States and the state land given in exchange bordering on public waters shall be subject to reservations by the state for public travel along the shores as provided by section 92.45, unless waived as provided in paragraph (b), and that there shall be reserved by the state additional rights of public use upon suitable portions of state land as the commissioner of natural resources, with the approval of the Land Exchange Board, may deem necessary or desirable for camping, hunting, fishing, access to the water, and other public uses.\n(b) For class B or riparian land that is contained within that portion of the Superior National Forest that is designated as the Boundary Waters Canoe Area Wilderness, the condition that state land given in exchange bordering on public waters must be subject to the public travel reservations provided in section 92.45, may be waived by the Land Exchange Board upon the recommendation of the commissioner of natural resources and, if the land is class B land, the additional recommendation of the county board in which the land is located.\nLand specifically designated by law as a state park may not be given in exchange unless the land is school trust land that is exchanged for class A land located outside a state park.\nSchool trust land may be exchanged with other class A land only if the school trust lands director is appointed as temporary trustee of the school trust land for purposes of the exchange. The Legislative Permanent School Fund Commission shall provide independent legal counsel to review exchanges.\n(a) When making a land exchange, a goal of the Land Exchange Board shall be to reunite the surface interest with the mineral interest whenever possible.\n(b) If mineral interests are severed in an exchange, the Land Exchange Board must consider the impact of severed mineral interests on minerals management.\nNotwithstanding subdivision 3, any state-owned riparian land within the Boundary Waters Canoe Area Wilderness may be given in exchange for nonriparian land outside the Boundary Waters Canoe Area Wilderness.",
	"repealed": false
}