{
	"id": "580.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.041",
	"title": "580.041 FORECLOSURE ADVICE AND REDEMPTION RIGHTS NOTICE TO OWNERS.",
	"text": "[Renumbered subd 1b]\nThis section applies to foreclosure of mortgages by advertisement under this chapter and foreclosure of mortgages by action under chapter 581 on property consisting of one to four family dwelling units, one of which the owner occupies as the owner's principal place of residency when the notice of pendency under section 580.032 or the lis pendens for a foreclosure under chapter 581 is recorded.\nThe foreclosure advice notice required by this section must be in 14-point boldface type and must be printed on colored paper that is other than the color of the notice of foreclosure required by sections 580.03 and 580.04 and the notice of redemption rights required by this section, and that does not obscure or overshadow the content of the notice. The title of the notice must be in 20-point boldface type. The notice must be on its own page. The foreclosure advice notice required by this section must be delivered with the notice of foreclosure required by sections 580.03 and 580.04. The foreclosure advice notice required by this section also must be delivered with each subsequent written communication regarding the foreclosure mailed to the mortgagor by the foreclosing party up to the day of foreclosure sale. A foreclosing mortgagee will be deemed to have complied with this section if it sends the foreclosure advice notice required by this section at least once every 60 days up to the date of the foreclosure sale. The foreclosure advice notice required by this section must not be published.\nThe notice of redemption rights required by this section must be in 14-point boldface type and must be printed on colored paper that is other than the color of the notice of foreclosure required by sections 580.03 and 580.04 and the foreclosure advice notice required by this section, and that does not obscure or overshadow the content of the notice. The title of the notice must be in 20-point boldface type. The notice must be on its own page. The notice of redemption rights must be delivered with the notice of foreclosure required by sections 580.03 and 580.04. The notice of redemption rights required by this section must not be published.\nThe foreclosure advice notice required by this section must appear substantially as follows:\n\"Help For Homeowners in Foreclosure\nAS OF [insert date], this lender says that you owe $[insert dollar amount] to bring your mortgage up to date (or \"reinstate\" your mortgage). You must pay this amount, plus interest and other costs, to keep your house from going through a sheriff's sale. The sheriff's sale is scheduled for [insert date] at [insert time] at [insert place].\nMortgage foreclosure is a complex process. People may contact you with advice and offers to help \"save\" your home.\nRemember: It is important that you learn as much as you can about foreclosure and your situation. Find out about all your options before you make any agreements with anyone about the foreclosure of your home.\nGetting Help\nAs soon as possible, you should contact your lender at the above number to talk about things you might be able to do to prevent foreclosure. You should also consider contacting the foreclosure prevention counselor in your area. A foreclosure prevention counselor can answer your questions, offer free advice, and help you create a plan which makes sense for your situation.\nContact the Minnesota Home Ownership Center at 651-659-9336 or 866-462-6466 or www.hocmn.org or contact the United States Department of Housing and Urban Development at 1-800-569-4287 or www.hud.gov to get the phone number and location of the nearest certified counseling organization. Call today. The longer you wait, the fewer options you may have for a desirable result.\"\nThe notice of redemption rights required by this section must appear substantially as follows:\n\"What Happens After the Foreclosure Sale\nAfter the sheriff's sale, you have the right to \"redeem.\" Redeem means that you pay the amount bid for your house at the sheriff's sale, plus interest and costs, to keep your house. You can keep living in your home for a period of time after the foreclosure sale. This is called a \"redemption period.\" The redemption period is [insert number of months] months after the sheriff's sale.\nAt the end of the redemption period, if you do not redeem or sell, you will have to leave your home. If you do not leave, the person or company that bid on your home at the sheriff's sale has the right to file an eviction against you in court.\nBe Careful of Foreclosure Scams\nBe careful! After the foreclosure sale, people may approach you to buy your house or ask you to transfer your house to them for little or no money.\nBefore you give up the rights to your house or sign any documents (including a deed), be sure you know how much the house sold for at the sheriff's sale and decide if you can save the house by paying the amount of the bid, plus interest and costs.\nHow to Find Out How Much Your House Sold For at the Foreclosure Sale\nThe amount you need to pay to redeem your house may be less than the amount you owed on the mortgage before the sale. You can learn what this amount is (and who the winning bidder at the sale was) by attending the sheriff's sale or by contacting the sheriff's office after the sale.\nYou Can Also Sell Your House\nDuring the redemption period, if you sell your home, you must sell it for enough to pay off the winning bidder from the sheriff's sale and pay interest, fees, and other claims against the property. If there is any money left from the sale of the house after all these debts are paid, you can keep the money. You can also enter into a \"short sale.\" A short sale is an agreement in which the lender agrees to accept less than the full amount you owe on the mortgage.\nGet More Information and Advice\nFor more information and advice, contact an attorney or a mortgage foreclosure prevention counselor. You can find a mortgage foreclosure prevention counselor by contacting the Minnesota Home Ownership Center at 651-659-9336 or 866-462-6466 or www.hocmn.org or contact the United States Department of Housing and Urban Development at 1-800-569-4287 or www.hud.gov to get the phone number and location of the nearest certified counseling organization.\"\nAny person may establish compliance with or inapplicability of this section by recording, with the county recorder or registrar of titles, an affidavit by a person having knowledge of the facts, stating that the notice required by this section has been delivered in compliance with this section or that this section is not applicable because the property described in the notice of foreclosure did not consist of one to four family dwelling units, one of which was occupied by the owner as the owner's principal place of residency. The affidavit and a certified copy of a recorded affidavit shall be prima facie evidence of the facts stated in the affidavit. The affidavit may be recorded regarding any foreclosure sale, including foreclosure sales which occurred prior to August 1, 2005, and may be recorded separately or as part of the record of a foreclosure.\nNo mortgage foreclosure sale under this chapter shall be invalid because of failure to comply with this section unless an action to invalidate the sale is commenced and a notice of lis pendens is filed with the county recorder or registrar of titles within one year after the last day of the redemption period of the mortgagor, the mortgagor's personal representatives, or assigns. This subdivision shall not affect any action or proceeding pending on August 1, 2005, or which is commenced before February 1, 2006, in any court of this state, provided a notice of lis pendens of the action is filed with the county recorder or registrar of titles before February 1, 2006.",
	"repealed": false
}