{
	"id": "237.066",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.066",
	"title": "237.066 STATE GOVERNMENT PRICING PLANS.",
	"text": "A state government or Tribal government telecommunications pricing plan is authorized and found to be in the public interest as it will:\n(1) provide and ensure availability of high-quality, technologically advanced telecommunications services at a reasonable cost to the state or Tribal government; and\n(2) further the state telecommunications goals as set forth in section 237.011.\nA state government or Tribal government telecommunications pricing plan may be available to serve individually or collectively: state agencies; Tribal governments; educational institutions, including public schools and Tribal schools complying with section 120A.05, subdivision 9, 11, 13, or 17, and nonpublic schools complying with sections 120A.22, 120A.24, and 120A.41; private colleges; public corporations; and political subdivisions of the state or a Tribal Nation. Plans shall be available to carry out the commissioner of administration's duties under sections 16E.17 and 16E.18 and shall also be available to those entities not using the commissioner for contracting for telecommunications services.\nNotwithstanding section 237.09, 237.14, 237.60, subdivision 3, or 237.74, a telephone company or a telecommunications carrier may, individually or in cooperation with other telephone companies or telecommunications carriers, develop and offer basic or advanced telecommunications services at discounted or reduced rates as a state government or Tribal government telecommunications pricing plan. Any telecommunications services provided under any state government or Tribal government telecommunications pricing plan shall be used exclusively by the entities described in subdivision 2 subject to the plan solely for the entities' own use and shall not be made available to any other entities by resale, sublease, or in any other way.\nA telephone company or telecommunications carrier providing telecommunications services under a state government or Tribal government telecommunications pricing plan is not required to provide any other person or entity those services at the rates made available to the state or Tribal government.\n(a) The terms and conditions of any state government or Tribal government telecommunications pricing plan must be submitted to the commission for review and approval within 90 days before implementation to:\n(1) ensure that the terms and conditions benefit the state or Tribal Nation and not any private entity;\n(2) ensure that the rates for any telecommunications service in any state government or Tribal government telecommunications pricing plan are at or below any applicable tariffed rates; and\n(3) ensure that the state telecommunications or Tribal government pricing plan meets the requirements of this section and is in the public interest.\n(b) The commission shall reject any state government or Tribal government telecommunications pricing plan that does not meet the criteria in paragraph (a).",
	"repealed": false
}