{
	"id": "168B.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/168B.035",
	"title": "168B.035 TOWING AUTHORIZED.",
	"text": "For purposes of this section, \"towing authority\" means:\n(1) any local authority authorized by section 169.04 to enforce the traffic laws, and a private towing company authorized by a local authority; or\n(2) an authorized employee of the Department of Transportation's freeway service patrol within the department's eight-county metropolitan district.\n(a) A towing authority may not tow a motor vehicle from public property unless a peace officer or parking enforcement officer has prepared, in addition to the parking citation, a written towing report describing the motor vehicle and the reasons for towing.\n(b) Within the Department of Transportation's eight-county metropolitan district, an authorized employee of the department's freeway service patrol may order a tow from a trunk highway after preparing a written towing report provided by the Minnesota State Patrol. A citation need not be issued before the employee orders a tow.\n(c) Except in cases where an accident or traffic hazard to the traveling public exists, the department employee shall ensure that if the tower requested to remove the vehicle by the owner arrives before the tower requested by the department, the tower requested by the owner is given the opportunity to actually conduct and complete all towing operations requested.\n(a) A towing authority may not tow a motor vehicle because:\n(1) the vehicle displays registration validation stickers that have been expired for less than 90 days;\n(2) the vehicle is at a parking meter on which the time has expired; or\n(3) the vehicle is identified in conjunction with a citation to the vehicle owner or lessee for (i) a violation under section 169.06, subdivision 10, or (ii) a violation under section 169.14, subdivision 13.\n(b) A towing authority may tow a motor vehicle, notwithstanding paragraph (a), if:\n(1) the vehicle is parked in violation of snow emergency regulations;\n(2) the vehicle is parked in a rush-hour restricted parking area;\n(3) the vehicle is blocking a driveway, alley, or fire hydrant;\n(4) the vehicle is parked in a bus lane, or at a bus stop, during hours when parking is prohibited;\n(5) the vehicle is parked within 30 feet of a stop sign and visually blocking the stop sign;\n(6) the vehicle is parked in a disability transfer zone or disability parking space without a disability parking certificate or disability license plates;\n(7) the vehicle is parked in an area that has been posted for temporary restricted parking (i) at least 12 hours in advance in a home rule charter or statutory city having a population under 50,000, or (ii) at least 24 hours in advance in another political subdivision;\n(8) the vehicle is parked within the right-of-way of a controlled-access highway or within the traveled portion of a public street when travel is allowed there;\n(9) the vehicle is unlawfully parked in a zone that is restricted by posted signs to use by fire, police, public safety, or emergency vehicles;\n(10) the vehicle is unlawfully parked on property at the Minneapolis-St. Paul International Airport owned by the Metropolitan Airports Commission;\n(11) a law enforcement official has probable cause to believe that the vehicle is stolen, or that the vehicle constitutes or contains evidence of a crime and impoundment is reasonably necessary to obtain or preserve the evidence;\n(12) the driver, operator, or person in physical control of the vehicle is taken into custody and the vehicle is impounded for safekeeping;\n(13) a law enforcement official has probable cause to believe that the owner, operator, or person in physical control of the vehicle has failed to respond to five or more citations for parking or traffic offenses;\n(14) the vehicle is unlawfully parked in a zone that is restricted by posted signs to use by taxicabs;\n(15) the vehicle is unlawfully parked and prevents egress by a lawfully parked vehicle;\n(16) the vehicle is parked, on a school day during prohibited hours, in a school zone on a public street where official signs prohibit parking; or\n(17) the vehicle is a junk, abandoned, or unauthorized vehicle, as defined in section 168B.011, and subject to immediate removal under this chapter.\n(c) A violation under section 169.06, subdivision 10, or 169.14, subdivision 13, is not a traffic offense under paragraph (b), clause (13).\n(a) For purposes of this subdivision:\n(1) \"road\" includes the roadway, a lane for vehicular traffic, shoulder, on-ramp, and off-ramp of a street or highway, including a parkway; and\n(2) \"obstructions\" includes motor vehicles, debris, personal property, and cargo.\n(b) Within the Department of Transportation's eight-county metropolitan district, the department and the State Patrol may move, remove, or cause to remove obstructions from a road if:\n(1) there has been a traffic incident involving a collision, accident, or spilled load;\n(2) the obstructions block a road or aggravate an emergency on a road; and\n(3) the department cooperates with the State Patrol and private towing or recovery companies authorized by the State Patrol concerning towing of the vehicle and removal of other obstructions.\n(c) The State Patrol shall make a reasonable effort to contact the owner of the motor vehicle or other obstructions before undertaking an action under this subdivision.\n(d) The department shall make a reasonable effort to allow the owner of the motor vehicle to arrange for its removal, taking into account any time delay and safety issues, and shall give due consideration to having the vehicle towed by a licensed towing service capable of safely moving the vehicle.\n(e) Towing charges accrued by the owner or owners of the vehicle must be reasonable for the type of vehicle removed and the circumstances surrounding its removal.\nThis section does not restrict the authority of the owner of private property to authorize under chapter 168B the towing of a motor vehicle unlawfully parked on the private property.\nThe owner or driver of a motor vehicle towed in violation of this section is entitled to recover from the towing authority the greater of $100 or two times the actual damages sustained as a result of the violation. Damages recoverable under this subdivision include but are not limited to costs of recovering the vehicle, including time spent and transportation costs.",
	"repealed": false
}