{
	"id": "326B.435",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.435",
	"title": "326B.435 PLUMBING BOARD.",
	"text": "(a) The Plumbing Board shall consist of 14 members. Twelve members shall be appointed by the governor with the advice and consent of the senate and shall be voting members. Appointments of members by the governor shall be made in accordance with section 15.066. If the senate votes to refuse to consent to an appointment of a member made by the governor, the governor shall appoint a new member with the advice and consent of the senate. One member shall be the commissioner of labor and industry or the commissioner of labor and industry's designee, who shall be a voting member. One member shall be the commissioner of health or the commissioner of health's designee, who shall not be a voting member. Of the 12 appointed members, the composition shall be as follows:\n(1) two members shall be municipal plumbing inspectors, one from the metropolitan area and one from greater Minnesota;\n(2) one member shall be a licensed professional engineer specializing in plumbing designs or systems;\n(3) two members shall be commercial/industrial plumbing contractors, one from the metropolitan area and one from greater Minnesota;\n(4) one member shall be a residential plumbing contractor;\n(5) two members shall be commercial/industrial journeyworkers, one from the metropolitan area and one from greater Minnesota;\n(6) one member shall be a residential plumbing journeyworker;\n(7) one member shall be a water conditioning contractor;\n(8) one member shall be a municipal public water supply system operator or superintendent; and\n(9) one member shall be a public member as defined by section 214.02.\nOne of the municipal plumbing inspectors shall be appointed for an initial term to end on December 31, 2010. The other municipal plumbing inspector shall be appointed for an initial term to end on December 31, 2011. The professional engineer shall be appointed for an initial term to end on December 31, 2011. One of the commercial/industrial plumbing contractors shall be appointed for an initial term to end on December 31, 2010. The other commercial/industrial plumbing contractor shall be appointed for an initial term to end on December 31, 2011. The residential plumbing contractor shall be appointed for an initial term to end on December 31, 2010. One of the commercial/industrial plumbing journeyworkers shall be appointed for an initial term to end on December 31, 2011. The other commercial/industrial plumbing journeyworker shall be appointed for an initial term to end on December 31, 2010. The residential plumbing journeyworker shall be appointed for an initial term to end on December 31, 2011. The water conditioning contractor shall be appointed for an initial term to end on December 31, 2011. The municipal public water supply system operator or superintendent shall be appointed for an initial term to end on December 31, 2010. The public member shall be appointed for a term to end December 31, 2010.\n(b) The licensed professional engineer must possess a current Minnesota professional engineering license and maintain the license for the duration of their term. All other appointed members, except for the water conditioning contractor, the public member, and the municipal public water supply system operator or superintendent, must possess a current plumbing license issued by the Department of Labor and Industry and maintain that license for the duration of their term. The water conditioning contractor must be licensed as a water conditioning contractor by the Department of Labor and Industry and maintain the license for the duration of the term on the board. All appointed members must be residents of Minnesota at the time of and throughout the member's appointment. The term of any appointed member that does not maintain membership qualification status shall end on the date of the status change and the governor shall appoint a new member. It is the responsibility of the member to notify the board of the member's status change.\n(c) For appointed members, except the initial terms designated in paragraph (a), each term shall be three years with the terms ending on December 31. Members appointed by the governor shall be limited to three consecutive terms. The governor shall, all or in part, reappoint the current members or appoint replacement members with the advice and consent of the senate. Midterm vacancies shall be filled for the remaining portion of the term. Vacancies occurring with less than six months time remaining in the term shall be filled for the existing term and the following three-year term. Members may serve until their successors are appointed but in no case later than July 1 in a year in which the term expires unless reappointed.\n(a) The board shall have the power to:\n(1) elect its chair, vice-chair, and secretary;\n(2) adopt bylaws that specify the duties of its officers, the meeting dates of the board, and containing such other provisions as may be useful and necessary for the efficient conduct of the business of the board;\n(3) adopt the Plumbing Code that must be followed in this state and any Plumbing Code amendments thereto. The Plumbing Code shall include the minimum standards described in sections 326B.43, subdivision 1, and 326B.52, subdivision 1. The board shall adopt the Plumbing Code and any amendments thereto pursuant to chapter 14 and as provided in subdivision 6, paragraphs (b), (c), and (d);\n(4) review requests for final interpretations and issue final interpretations as provided in section 326B.127, subdivision 5;\n(5) adopt rules that regulate the licensure, certification, or registration of plumbing contractors, journeyworkers, unlicensed individuals, master plumbers, restricted master plumbers, restricted journeyworkers, restricted plumbing contractors, backflow prevention rebuilders and testers, water conditioning contractors, and water conditioning installers, and other persons engaged in the design, installation, and alteration of plumbing systems or engaged in or working at the business of water conditioning installation or service, or engaged in or working at the business of medical gas system installation, maintenance, or repair, except for those individuals licensed under section 326.02, subdivisions 2 and 3. The board shall adopt these rules pursuant to chapter 14 and as provided in subdivision 6, paragraphs (e) and (f);\n(6) adopt rules that regulate continuing education for individuals licensed as master plumbers, journeyworker plumbers, restricted master plumbers, restricted journeyworker plumbers, registered unlicensed individuals, water conditioning masters, and water conditioning journeyworkers, and for individuals certified under sections 326B.437 and 326B.438. The board shall adopt these rules pursuant to chapter 14 and as provided in subdivision 6, paragraphs (e) and (f);\n(7) refer complaints or other communications to the commissioner, whether oral or written, as provided in subdivision 8, that allege or imply a violation of a statute, rule, or order that the commissioner has the authority to enforce pertaining to code compliance, licensure, or an offering to perform or performance of unlicensed plumbing services;\n(8) approve per diem and expenses deemed necessary for its members as provided in subdivision 3;\n(9) approve license reciprocity agreements;\n(10) select from its members individuals to serve on any other state advisory council, board, or committee; and\n(11) recommend the fees for licenses, registrations, and certifications.\nExcept for the powers granted to the Plumbing Board, the Board of Electricity, and the Board of High Pressure Piping Systems, the commissioner of labor and industry shall administer and enforce the provisions of this chapter and any rules promulgated pursuant thereto.\n(b) The board shall comply with section 15.0597, subdivisions 2 and 4.\n(c) The commissioner shall coordinate the board's rulemaking and recommendations with the recommendations and rulemaking conducted by the other boards created pursuant to this chapter. The commissioner shall provide staff support to the board. The support includes professional, legal, technical, and clerical staff necessary to perform rulemaking and other duties assigned to the board. The commissioner of labor and industry shall supply necessary office space and supplies to assist the board in its duties.\n(a) Members of the board may be compensated at a rate of $55 a day spent on board activities, when authorized by the board, plus expenses in the same manner and amount as authorized by the commissioner's plan adopted under section 43A.18, subdivision 2. Members who, as a result of time spent attending board meetings, incur child care expenses that would not otherwise have been incurred, may be reimbursed for those expenses upon board authorization.\n(b) Members who are state employees or employees of the political subdivisions of the state must not receive the daily payment for activities that occur during working hours for which they are compensated by the state or political subdivision. However, a state or political subdivision employee may receive the daily payment if the employee uses vacation time or compensatory time accumulated in accordance with a collective bargaining agreement or compensation plan for board activities. Members who are state employees or employees of the political subdivisions of the state may receive the expenses provided for in this subdivision unless the expenses are reimbursed by another source. Members who are state employees or employees of political subdivisions of the state may be reimbursed for child care expenses only for time spent on board activities that are outside their working hours.\n(c) The board shall adopt internal standards prescribing what constitutes a day spent on board activities for purposes of making daily payments under this subdivision.\n(a) An appointed member of the board may be removed by the governor at any time (1) for cause, after notice and hearing, or (2) after missing three consecutive meetings. The chair of the board shall inform the governor of an appointed member missing the three consecutive meetings. After the second consecutive missed meeting and before the next meeting, the secretary of the board shall notify the appointed member in writing that the member may be removed for missing the next meeting. In the case of a vacancy on the board, the governor shall, with the advice and consent of the senate, appoint a person to fill the vacancy for the remainder of the unexpired term.\n(b) Vacancies shall be filled pursuant to section 15.0597, subdivisions 5 and 6.\nNotwithstanding any law to the contrary, when a membership on the board becomes vacant within three months after being filled through the appointments process, the governor may, upon notification to the office of secretary of state, choose a new member from the applications on hand and need not repeat the process.\n(a) The board shall elect annually from its members a chair, vice-chair, and secretary. A quorum of the board shall consist of a majority of members of the board qualified to vote on the matter in question. All questions concerning the manner in which a meeting is conducted or called that is not covered by statute shall be determined by Robert's Rules of Order (revised) unless otherwise specified by the bylaws.\n(b) Except as provided in paragraph (c), each plumbing code amendment considered by the board that receives an affirmative two-thirds or more majority vote of all of the voting members of the board shall be included in the next plumbing code rulemaking proceeding initiated by the board. If a plumbing code amendment considered, or reconsidered, by the board receives less than a two-thirds majority vote of all the voting members of the board, the plumbing code amendment shall not be included in the next plumbing code rulemaking proceeding initiated by the board.\n(c) If the plumbing code amendment considered by the board is to replace the Minnesota Plumbing Code with a model plumbing code, then the amendment may only be included in the next plumbing code rulemaking proceeding if it receives an affirmative two-thirds or more majority vote of all the voting members of the board.\n(d) The board may reconsider plumbing code amendments during an active plumbing code rulemaking proceeding in which the amendment previously failed to receive a two-thirds majority vote or more of all the voting members of the board only if new or updated information that affects the plumbing code amendment is presented to the board. The board may also reconsider failed plumbing code amendments in subsequent plumbing code rulemaking proceedings.\n(e) Each proposed rule and rule amendment considered by the board pursuant to the rulemaking authority specified in subdivision 2, paragraph (a), clauses (5) or (6), that receives an affirmative majority vote of all the voting members of the board shall be included in the next rulemaking proceeding initiated by the board. If a proposed rule or rule amendment considered, or reconsidered, by the board receives less than an affirmative majority vote of all the voting members of the board, the proposed rule or rule amendment shall not be included in the next rulemaking proceeding initiated by the board.\n(f) The board may reconsider proposed rules or rule amendments during an active rulemaking proceeding in which the amendment previously failed to receive an affirmative majority vote of all the voting members of the board only if new or updated information that affects the proposed rule or rule amendment is presented to the board. The board may also reconsider failed proposed rules or rule amendments in subsequent rulemaking proceedings.\n(a) The board shall hold meetings at such times as the board shall specify. Notice and conduct of all meetings shall be pursuant to chapter 13D and in such a manner as the bylaws may provide.\n(b) If compliance with section 13D.02 is impractical, the board may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the board participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the board can hear clearly all discussion and testimony and all votes of members of the board and, if needed, receive those services required by sections 15.44 and 15.441;\n(3) at least one member of the board is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\nEach member of the board participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\nIf telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the board, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The board may require the person making such a connection to pay for documented costs that the board incurs as a result of the additional connection.\nIf telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the board shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and that a person may monitor the meeting electronically from a remote location. Any person monitoring the meeting electronically from a remote location may be required to pay documented costs incurred by the board as a result of the additional connection. The timing and method of providing notice is governed by section 13D.04.\n(a) The board shall promptly forward to the commissioner the substance of any complaint or communication it receives, whether written or oral, that alleges or implies a violation of a statute, rule, or order that the commissioner has the authority to enforce pertaining to the license or registration of any person authorized by the department to provide plumbing services, the performance or offering to perform plumbing services requiring licensure by an unlicensed person, or plumbing code compliance. Each complaint or communication that is forwarded to the commissioner shall be submitted on a form provided by the commissioner.\n(b) The commissioner shall advise the board of the status of the complaint within 90 days after the board's written submission is received, or within 90 days after the board is provided with a written request for additional information or documentation from the commissioner or the commissioner's designee, whichever is later. The commissioner shall advise the board of the disposition of a complaint referred by the board within 180 days after the board's written submission is received. The commissioner shall annually report to the board a summary of the actions taken in response to complaints referred by the board.\nThe board is subject to chapter 13, the Minnesota Government Data Practices Act, and shall protect from unlawful disclosure data classified as not public.\nThe board shall make and preserve all records necessary to a full and accurate knowledge of its official activities in accordance with section 15.17.",
	"repealed": false
}