{
	"id": "383B.158",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.158",
	"title": "383B.158 DESIGN-BUILD CONTRACTS.",
	"text": "(a) In sections 383B.158 to 383B.1584, the definitions in this subdivision apply.\n(b) \"Best value\" describes a result intended in acquiring design-build services. Best value determination must include price and must measure a responder's qualifications, experience, prior performance, and responses to technical and qualitative criteria.\n(c) \"County board\" means the Hennepin County Board of Commissioners.\n(d) \"Design-build selection panel\" means the individuals appointed by the county to advise the county administrator and county board in preparing and conducting the design-build selection process. At least three members of the committee must be individuals who are not county employees, a minimum of two members must be professionally licensed under chapter 326, and at least one must be or must have been a commercial contractor. No committee member shall have personal financial interest in the project or with any of the design-build proposals.\n(e) \"Design-build contract\" means a single contract, which may be in phases, between the county and a design-builder to furnish the architectural or engineering and related design services as well as the labor, materials, supplies, equipment, and construction services for a project.\n(f) \"Design-build firm\" means a proprietorship, partnership, limited liability partnership, joint venture, corporation, or any type of limited liability company, professional corporation, or any legal entity.\n(g) \"Design-builder\" means the design-build firm that proposes to design and build a project governed by the procedures of this section.\n(h) \"Design professional\" means a person who holds or employs individuals who hold a license under chapter 326 and who is required to be registered under Minnesota law.\n(i) \"Primary designer\" means the designer who is to have primary design responsibility for a project, and does not include designers who are merely consulted by the county and do not have substantial design responsibility, or designers who will or may be employed or consulted by the primary designer.\n(j) \"Project\" means an undertaking for the county to design, construct, erect, or remodel a building or facility, or to design, construct, or reconstruct a county road, bridge, or multimodal transportation facility or other infrastructure relating to a county roadway or multimodal transportation.\n(k) \"Proposal\" means an offer by a design-builder to enter into a design-build contract for a project in response to a request for proposals, including a phase-one or phase-two proposal.\n(l) \"Request for proposals\" or \"RFP\" means the document or publication through which the county solicits proposals from prequalified design-builders to design and construct a design-build project.\n(m) \"Request for qualifications\" or \"RFQ\" means a document to prequalify and short-list potential design-builders for a project.\nNotwithstanding section 471.345 or any other law to the contrary, the county board may solicit and award a design-build contract for a project on the basis of a best value selection process as provided in this section. In exercising the authority granted in this section and sections 383B.1581 to 383B.1584, the county may also utilize the design-build procedures available to the Department of Transportation.\n(a) The number of design-build contracts awarded by the county board must not be more than ten percent of its total projects in any fiscal year.\n(b) The board may not enter into a design-build contract under this section unless the county has as employees at least one of each of the following, each of whom must be licensed and registered under state law: an architect, a mechanical engineer, and a civil engineer. In addition, the county must employ a full-time project manager with at least five years of construction management experience.\n(a) The county board shall, by resolution, adopt implementation procedures consistent with this section for the award of design-build contracts.\n(b) The implementation procedures must, at a minimum, govern:\n(1) the establishment of a design-build selection panel appointed by the county to advise the county administrator and the county board in preparing and conducting the design-build selection process, including a recommendation for the selection of a design-build proposal it considers to be of best value to the public;\n(2) preparing requests for proposals, including procedures for determining the appropriate content for each request for proposal;\n(3) standards to be used to qualify or prequalify design-builders;\n(4) preparing and submitting proposals;\n(5) establishing procedures for evaluating proposals in as objective a manner as possible;\n(6) establishing safeguards during the procurement process to preserve confidential information and proprietary information supplied by those submitting proposals in accordance with chapter 13, including, but not limited to, an offeror's price, technical solutions, innovative or unique technology, and innovative or unique use of commercially available items; and\n(7) awarding and executing design-build contracts.\n(a) A design-builder shall employ, or have as a partner, member, officer, coventurer, or subcontractor, a person duly licensed and registered to provide the design services required to complete the project and do business in this state.\n(b) A design-builder may enter into a contract with the county to provide professional or construction services that the design-builder is not licensed, registered, or qualified to perform, so long as the design-builder provides the services through subcontracts with licensed, registered, or otherwise qualified persons in accordance with this section.\n(c) This section does not intend to limit or eliminate the responsibility or liability owed by a professional on a design-build project to the county or other parties under other law.",
	"repealed": false
}