{
	"id": "152.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/152.37",
	"title": "152.37 FINANCIAL EXAMINATIONS; PRICING REVIEWS.",
	"text": "A medical cannabis manufacturer shall maintain detailed financial records in a manner and format approved by the commissioner, and shall keep all records updated and accessible to the commissioner when requested.\nA medical cannabis manufacturer shall submit the results of an annual certified financial audit to the commissioner no later than May 1 of each year for the calendar year beginning January 2015. The annual audit shall be conducted by an independent certified public accountant and the costs of the audit are the responsibility of the medical cannabis manufacturer. Results of the audit shall be provided to the medical cannabis manufacturer and the commissioner. The commissioner may also require another audit of the medical cannabis manufacturer by a certified public accountant chosen by the commissioner with the costs of the audit paid by the medical cannabis manufacturer.\n(a) The commissioner or designee may examine the business affairs and conditions of any medical cannabis manufacturer, including but not limited to a review of the financing, budgets, revenues, sales, and pricing.\n(b) An examination may cover the medical cannabis manufacturer's business affairs, practices, and conditions including but not limited to a review of the financing, budgets, revenues, sales, and pricing. The commissioner shall determine the nature and scope of each examination and in doing so shall take into account all available relevant factors concerning the financial and business affairs, practices, and conditions of the examinee. The costs incurred by the department in conducting an examination shall be paid for by the medical cannabis manufacturer.\n(c) When making an examination under this section, the commissioner may retain attorneys, appraisers, independent economists, independent certified public accountants, or other professionals and specialists as designees. A certified public accountant retained by the commissioner may not be the same certified public accountant providing the certified annual audit in subdivision 2.\n(d) The commissioner shall make a report of an examination conducted under this section and provide a copy to the medical cannabis manufacturer. The commissioner shall then post a copy of the report on the department's website. All working papers, recorded information, documents, and copies produced by, obtained by, or disclosed to the commissioner or any other person in the course of an examination, other than the information contained in any commissioner official report, made under this section are private data on individuals or nonpublic data, as defined in section 13.02.",
	"repealed": false
}