{
	"id": "309.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/309.515",
	"title": "309.515 EXEMPTIONS.",
	"text": "Subject to the provisions of subdivision 2, sections 309.52 and 309.53 shall not apply to any of the following:\n(a) Charitable organizations:\n(1) which did not receive total contributions in excess of $25,000, exclusive of the direct cost of prizes given to the public by the charitable organization in connection with lawful gambling conducted in compliance with chapter 349, from the public within or without this state during the accounting year last ended, and\n(2) which do not plan to receive total contributions in excess of such amount from the public within or without this state during any accounting year, and\n(3) whose functions and activities, including fundraising, are performed wholly by persons who are unpaid for their services, and\n(4) none of whose assets or income inure to the benefit of or are paid to any officer.\nFor purposes of this chapter, a charitable organization shall be deemed to receive in addition to contributions solicited from the public by it, the contributions solicited from the public by any other person and transferred to it. Any organization constituted for a charitable purpose receiving an allocation from a community chest, united fund or similar organization shall be deemed to have solicited that allocation from the public.\n(b) A religious society or organization which is exempt from filing a federal annual information return pursuant to Internal Revenue Code, section 6033(a)(2)(A)(i) and (iii), and Internal Revenue Code, section 6033(a)(2)(C)(i).\n(c) Any educational institution which is under the general supervision of the commissioner of education, the Board of Trustees of the Minnesota State Colleges and Universities, or the University of Minnesota or any educational institution which is accredited by the University of Minnesota or the North Central Association of Colleges and Secondary Schools, or by any other national or regional accrediting association.\n(d) A fraternal, patriotic, social, educational, alumni, professional, trade or learned society which limits solicitation of contributions to persons who have a right to vote as a member. The term \"member\" shall not include those persons who are granted a membership upon making a contribution as the result of a solicitation.\n(e) A charitable organization soliciting contributions for any person specified by name at the time of the solicitation if all of the contributions received are transferred to the person named with no restrictions on the person's expenditure of it and with no deductions whatsoever.\n(f) A private foundation, as defined in section 509(a) of the Internal Revenue Code of 1954, which did not solicit contributions from more than 100 persons during the accounting year last ended.\n(g) An auctioneer licensed and bonded under chapter 330 who is conducting a live auction who has no access to the proceeds of the auction is not subject to the registration and reporting requirements of this chapter, and is not considered a professional fundraiser for the purposes of subdivision 2.\nWhere any such group or association or person soliciting for the benefit of such group or association described in subdivision 1, clauses (a) and (d), employs a professional fundraiser to solicit or assist in the solicitation of contributions, sections 309.52 and 309.53 shall apply and such group or association or person shall file a registration statement as provided in section 309.52 and an annual report as provided in section 309.53.\n[Repealed, 1987 c 336 s 47]",
	"repealed": false
}