{
	"id": "462.352",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.352",
	"title": "462.352 DEFINITIONS.",
	"text": "For the purposes of sections 462.351 to 462.364 the terms defined in this section have the meanings given them.\n\"Airport safety zone\" has the meaning given in section 394.22, subdivision 1a.\n\"Municipality\" means any city, including a city operating under a home rule charter, and any town.\n\"Planning agency\" means the planning commission or the planning department of a municipality.\nMS 1978 [Repealed, 1980 c 566 s 35]\n\"Comprehensive municipal plan\" means a compilation of policy statements, goals, standards, and maps for guiding the physical, social and economic development, both private and public, of the municipality and its environs, and may include, but is not limited to, the following: statements of policies, goals, standards, a land use plan, including proposed densities for development, a community facilities plan, a transportation plan, and recommendations for plan execution. A comprehensive plan represents the planning agency's recommendations for the future development of the community.\n\"Land use plan\" means a compilation of policy statements, goals, standards, and maps, and action programs for guiding the future development of private and public property. The term includes a plan designating types of uses for the entire municipality as well as a specialized plan showing specific areas or specific types of land uses, such as residential, commercial, industrial, public or semipublic uses or any combination of such uses. A land use plan may also include the proposed densities for development.\n\"Transportation plan\" means a compilation of policy statements, goals, standards, maps and action programs for guiding the future development of the various modes of transportation of the municipality and its environs, such as streets and highways, mass transit, railroads, air transportation, trucking and water transportation, and includes a major thoroughfare plan.\n\"Community facilities plan\" means a compilation of policy statements, goals, standards, maps and action programs for guiding the future development of the public or semipublic facilities of the municipality such as recreational, educational and cultural facilities.\n\"Capital improvement program\" means an itemized program setting forth the schedule and details of specific contemplated public improvements by fiscal year, together with their estimated cost, the justification for each improvement, the impact that such improvements will have on the current operating expense of the municipality, and such other information on capital improvements as may be pertinent.\n\"Official map\" means a map adopted in accordance with section 462.359, which may show existing and proposed future streets, roads, highways, and airports of the municipality and county, the area needed for widening of existing streets, roads, and highways of the municipality and county, and existing and future county state aid highways and state trunk highway rights-of-way. An official map may also show the location of existing and future public land and facilities within the municipality. In counties in the metropolitan area as defined in section 473.121, official maps may for a period of up to five years designate the boundaries of areas reserved for purposes of soil conservation, water supply conservation, flood control, and surface water drainage and removal, including appropriate regulations protecting those areas against encroachment by buildings or other physical structures or facilities.\n\"Governing body\" in the case of cities means the council by whatever name known, and in the case of a town, means the town board.\n\"Subdivision\" means the separation of an area, parcel, or tract of land under single ownership into two or more parcels, tracts, lots, or long-term leasehold interests where the creation of the leasehold interest necessitates the creation of streets, roads, or alleys, for residential, commercial, industrial, or other use or any combination thereof, except those separations:\n(1) where all the resulting parcels, tracts, lots, or interests will be 20 acres or larger in size and 500 feet in width for residential uses and five acres or larger in size for commercial and industrial uses;\n(2) creating cemetery lots;\n(3) resulting from court orders, or the adjustment of a lot line by the relocation of a common boundary.\n\"Plat\" means the drawing or map of a subdivision prepared for filing of record pursuant to chapter 505 and containing all elements and requirements set forth in applicable local regulations adopted pursuant to section 462.358 and chapter 505.\n\"Subdivision regulation\" means an ordinance adopted pursuant to section 462.358 regulating the subdivision of land.\n\"Official controls\" or \"controls\" means ordinances and regulations which control the physical development of a city, county or town or any part thereof or any detail thereof and implement the general objectives of the comprehensive plan. Official controls may include ordinances establishing zoning, subdivision controls, site plan regulations, sanitary codes, building codes and official maps.\n\"Preliminary approval\" means official action taken by a municipality on an application to create a subdivision which establishes the rights and obligations set forth in section 462.358 and the applicable subdivision regulation. In accordance with section 462.358, and unless otherwise specified in the applicable subdivision regulation, preliminary approval may be granted only following the review and approval of a preliminary plat or other map or drawing establishing without limitation the number, layout, and location of lots, tracts, blocks, and parcels to be created, location of streets, roads, utilities and facilities, park and drainage facilities, and lands to be dedicated for public use.\nMS 2000 [Repealed, 2001 c 7 s 91]\n\"Urban growth area\" means the identified area around an urban area within which there is a sufficient supply of developable land for at least a prospective 20-year period, based on demographic forecasts and the time reasonably required to effectively provide municipal services to the identified area.",
	"repealed": false
}