{
	"id": "116.993",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.993",
	"title": "116.993 SMALL BUSINESS ENVIRONMENTAL-IMPROVEMENT LOAN PROGRAM.",
	"text": "A small business environmental-improvement revolving loan program is established to provide loans to small businesses for the purpose of capital equipment purchases that will meet or exceed environmental rules and regulations or for investigation and cleanup of contaminated sites. The small business environmental-improvement revolving loan program replaces the small business environmental loan program in Minnesota Statutes 1996, section 116.991, and the hazardous waste generator loan program in Minnesota Statutes 1996, section 115B.223.\nTo be eligible for a loan under this section, a borrower must:\n(1) be a small business corporation, sole proprietorship, partnership, or association;\n(2) be a potential emitter of pollutants to the air, ground, or water;\n(3) need capital for equipment purchases that will meet or exceed environmental regulations or need capital for site investigation and cleanup;\n(4) have less than 100 full-time equivalent employees; and\n(5) have an after tax profit of less than $500,000.\nThe commissioner of the Pollution Control Agency may give priority to applicants that include, but are not limited to, those subject to Clean Air Act standards adopted under United States Code, title 42, section 7412, those undergoing site investigation and remediation, those involved with facility wide environmental compliance and pollution prevention projects, and those determined by the commissioner to be small business outreach priorities. The commissioner shall decide whether to award a loan to an eligible borrower based on:\n(1) the applicant's financial need;\n(2) the applicant's ability to secure and repay the loan; and\n(3) the expected environmental benefit.\nThe commissioner shall appoint a screening committee to evaluate applications and determine loan awards. The committee shall have diverse expertise in air quality, water quality, solid and hazardous waste management, site response and cleanup, pollution prevention, and financial analysis.\nNumbers of applications accepted, evaluated, and awarded are based upon the available money in the small business environmental-improvement loan account.\nA loan made under this section must include:\n(1) an interest rate that is at or below one-half the prime rate, not to exceed five percent;\n(2) a term of payment of not more than seven years; and\n(3) an amount not less than $1,000 or exceeding $75,000.",
	"repealed": false
}