{
	"id": "62L.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.14",
	"title": "62L.14 BOARD OF DIRECTORS.",
	"text": "The association shall exercise its powers through a board of 13 directors. Four directors must be public members appointed by the commissioner. The public directors must not be employees of or otherwise affiliated with any member of the association. The nonpublic directors must be representative of the membership of the association and must be officers, employees, or directors of the members during their term of office. No member of the association may have more than three directors. Directors are automatically removed if they fail to satisfy this qualification.\nOn or before July 1, 1992, the commissioner shall appoint an interim board of directors of the association who shall serve until the annual meeting in 1994. Except for the public directors, the commissioner's initial appointments must be equally apportioned among the following three categories: accident and health insurance companies, nonprofit health service plan corporations, and health maintenance organizations. Thereafter, members of the association shall elect the board of directors in accordance with this chapter and the plan of operation, subject to approval by the commissioner. Members of the association may vote in person or by proxy. The public directors shall continue to be appointed by the commissioner to terms meeting the requirements of subdivision 3.\nAfter the annual meeting in 1994, each director shall serve a three-year term, except that the board shall make appropriate arrangements to stagger the terms of the directors so that approximately one-third of the terms expire each year. Each director shall hold office until expiration of the director's term or until the director's successor is duly elected or appointed and qualified, or until the director's death, resignation, or removal.\nA director may resign at any time by giving written notice to the commissioner. The resignation takes effect at the time the resignation is received unless the resignation specifies a later date. A nonpublic director may be removed at any time, with cause, by the members. If a vacancy occurs for a public director, the commissioner shall appoint a new public director for the duration of the unexpired term.\nA majority of the directors constitutes a quorum for the transaction of business. If a vacancy exists by reason of death, resignation, or otherwise, a majority of the remaining directors constitutes a quorum.\nOn or before January 1, 1993, the board or the interim board shall develop a plan of operation and reasonable operating rules to assure the fair, reasonable, and equitable administration of the association. The plan of operation must include the development of procedures for selecting an administering carrier, establishment of the powers and duties of the administering carrier, and establishment of procedures for collecting assessments from members, including the imposition of interest penalties for late payments of assessments. The plan of operation must be submitted to the commissioner for review and approval and must be submitted to the members for approval at the first meeting of the members. The board of directors may subsequently amend, change, or revise the plan of operation without approval by the members.\nPublic directors may be reimbursed by the association for reasonable and necessary expenses incurred by them in performing their duties as directors and may be compensated by the association at a rate of up to $55 per day spent on authorized association activities.\nThe board may elect officers and establish committees as provided in the bylaws of the association. Officers have the authority and duties in the management of the association as prescribed by the bylaws and determined by the board of directors.\nApproval by a majority of the directors present is required for any action of the board. The majority vote must include one vote from a director representing an accident and health insurance company, one vote from a director representing a health service plan corporation, one vote from a director representing a health maintenance organization, and one vote from a public director.",
	"repealed": false
}