{
	"id": "375.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.21",
	"title": "375.21 CONTRACTS OF COUNTY BOARDS.",
	"text": "When required by the dollar limitations of section 471.345, a contract for work or labor, or to purchase furniture, fixtures, or other property, or to construct or repair roads, bridges, or buildings shall be made by a county board only after advertising for bids or proposals in a qualified legal newspaper of the county. For the purchase of property or for work and labor, two weeks' published notice that proposals will be received, stating the time and place, shall be given. For the construction or repair of roads, bridges, or buildings, three weeks' published notice shall be given. The notice shall state the time and place of awarding the contract and contain a brief description of the work. Every contract shall be awarded to the lowest responsible bidder and duly executed in writing. The person to whom a contract is awarded for work or labor or for the construction or repair of roads, bridges, or buildings shall give a sufficient bond to the board for its faithful performance. If no satisfactory bid is received, the board may readvertise.\nAn advertised standard requirement price contract for supplies or services established by competitive bids may contain an escalation clause and may provide for a negotiated price increase or decrease. The escalation or negotiated change shall be based upon a demonstrable industrywide or regional increase or decrease in the vendor's costs.\nEvery contract made without compliance with this section is void.\nIn case of an emergency arising from the destruction or impassability of roads or bridges by floods, rain or snow, or other casualty, or from the breaking or damaging of any property in the county, if the public health, safety, or welfare would suffer by delay, contracts for purchase or repairs may be made without advertising for bids, but in that case the action of the board shall be recorded in its official proceedings.\nThis section does not apply to Hennepin County.\nAs an alternative to the procurement method described in subdivision 1, a county board may award a contract for construction, building, alteration, improvement, or repair work to the vendor or contractor offering the best value under a request for proposals as described in section 16C.28, subdivision 1, paragraph (a), clause (2), and paragraph (c).\nMS 1965 [Repealed, 1967 c 364 s 2]\nMS 1965 [Repealed, 1967 c 364 s 2]",
	"repealed": false
}