{
	"id": "524.5-112",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-112",
	"title": "524.5-112 TERMINATION OF OR CHANGE IN GUARDIAN'S OR CONSERVATOR'S APPOINTMENT.",
	"text": "(a) The appointment of a guardian or conservator terminates upon the death, resignation, or removal of the guardian or conservator or upon termination of the guardianship or conservatorship. A resignation of a guardian or conservator is effective when approved by the court. A parental or spousal appointment as guardian under an informally probated will terminates if the will is later denied probate in a formal proceeding. Termination of the appointment of a guardian or conservator does not affect the liability of either for previous acts or the obligation to account for money and other assets of the person subject to guardianship or conservatorship.\n(b) A person subject to guardianship, person subject to conservatorship, or interested person may petition for removal of a guardian or conservator on the ground that removal would be in the best interest of the person subject to guardianship or conservatorship or for other good cause. A guardian or conservator may petition for permission to resign. A petition for removal or permission to resign may include a request for appointment of a successor guardian or conservator.\n(c) The court may appoint an additional guardian or conservator at any time, to serve immediately or upon some other designated event, and may appoint a successor guardian or conservator in the event of a vacancy or make the appointment prior to a vacancy, to serve when a vacancy occurs. An additional or successor guardian or conservator may file an acceptance of appointment at any time after the appointment, but in no case later than 30 days after the occurrence of the vacancy or other designated event. The additional or successor guardian or conservator becomes eligible to act on the occurrence of the vacancy or designated event, or the filing of the acceptance of appointment, whichever occurs last. A successor guardian or conservator succeeds to the predecessor's powers, and a successor conservator succeeds to the predecessor's title to the assets of the person subject to conservatorship.",
	"repealed": false
}