{
	"id": "124D.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.041",
	"title": "124D.041 RECIPROCITY WITH ADJOINING STATES.",
	"text": "(a) The commissioner may enter into an agreement with the designated authority from an adjoining state to establish an enrollment options program between Minnesota and the adjoining state. Any agreement entered into pursuant to this section must specify the following:\n(1) for students who are not residents of Minnesota, the enrollment options program applies only to a student whose resident school district borders Minnesota;\n(2) the commissioner must negotiate equal, reciprocal rates with the designated authority from the adjoining state;\n(3) if the adjoining state sends more students to Minnesota than Minnesota sends to the adjoining state, the adjoining state must pay the state of Minnesota the rate agreed upon under clause (2) for the excess number of students sent to Minnesota;\n(4) if Minnesota sends more students to the adjoining state than the adjoining state sends to Minnesota, the state of Minnesota will pay the adjoining state the rate agreed upon under clause (2) for the excess number of students sent to the adjoining state;\n(5) the application procedures for the enrollment options program between Minnesota and the adjoining state;\n(6) the reasons for which an application for the enrollment options program between Minnesota and the adjoining state may be denied; and\n(7) that a Minnesota school district is not responsible for transportation for any resident student attending school in an adjoining state under the provisions of this section. A Minnesota school district may, at its discretion, provide transportation services for such a student.\n(b) Any agreement entered into pursuant to this section may specify additional terms relating to any student in need of special education and related services pursuant to chapter 125A, including early childhood special education services. Any additional terms must apply equally to both states.\n(a) Any student from an adjoining state enrolled in Minnesota pursuant to this section is included in the receiving school district's average daily membership and pupil units according to section 126C.05 as if the student were a resident of another Minnesota school district attending the receiving school district under section 124D.03.\n(b) Any Minnesota resident student enrolled in an adjoining state pursuant to this section is included in the resident school district's average daily membership and pupil units according to section 126C.05 as if the student were a resident of the district attending another Minnesota school district under section 124D.03.\n(c) A prekindergarten child from an adjoining state whose family resides at a Minnesota address as assigned by the United States Postal Service and is receiving early childhood special education services from a Minnesota school district is considered enrolled in a Minnesota school district.\n(a) The Department of Education must establish procedures relating to the application process, the collection or payment of funds under the provisions of any agreement established pursuant to this section, and the collection of data necessary to implement any agreement established pursuant to this section.\n(b) Notwithstanding sections 124D.04 and 124D.05, if an agreement is established between Minnesota and an adjoining state pursuant to this section, the provisions of this section and the agreement shall apply to all enrollment transfers between Minnesota and the adjoining state, and provisions of sections 124D.04 and 124D.05 to the contrary, including provisions relating to tuition payments, shall not apply.\n(c) Notwithstanding paragraph (a), any payments to adjoining states under this section shall be made according to section 127A.45, subdivision 16.\n(d) Notwithstanding paragraph (b), sections 124D.04, subdivision 6, paragraph (b), and 124D.05, subdivision 2a, the provisions of this section and the agreement shall not apply to: (1) enrollment transfers between Minnesota and a school district in an adjoining state enrolling fewer than 150 pupils that is exempted from participation in the program under the laws of the adjoining state; or (2) enrollment transfers between Minnesota and a school district in an adjoining state under a board agreement initiated in fiscal year 2009 to serve students in grade levels discontinued by the resident district.",
	"repealed": false
}