{
	"id": "144.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.34",
	"title": "144.34 INVESTIGATION AND CONTROL OF OCCUPATIONAL DISEASES.",
	"text": "Any physician, advanced practice registered nurse, or physician assistant having under professional care any person whom the physician, advanced practice registered nurse, or physician assistant believes to be suffering from poisoning from lead, phosphorus, arsenic, brass, silica dust, carbon monoxide gas, wood alcohol, or mercury, or their compounds, or from anthrax or from compressed-air illness or any other disease contracted as a result of the nature of the employment of such person shall within five days mail to the Department of Health a report stating the name, address, and occupation of such patient, the name, address, and business of the patient's employer, the nature of the disease, and such other information as may reasonably be required by the department. The department shall prepare and furnish the physicians, advanced practice registered nurses, and physician assistants of this state suitable blanks for the reports herein required. No report made pursuant to the provisions of this section shall be admissible as evidence of the facts therein stated in any action at law or in any action under the Workers' Compensation Act against any employer of such diseased person. The Department of Health is authorized to investigate and to make recommendations for the elimination or prevention of occupational diseases which have been reported to it, or which shall be reported to it, in accordance with the provisions of this section. The department is also authorized to study and provide advice in regard to conditions that may be suspected of causing occupational diseases. Information obtained upon investigations made in accordance with the provisions of this section shall not be admissible as evidence in any action at law to recover damages for personal injury or in any action under the Workers' Compensation Act. Nothing herein contained shall be construed to interfere with or limit the powers of the Department of Labor and Industry to make inspections of places of employment or issue orders for the protection of the health of the persons therein employed. When upon investigation the commissioner of health reaches a conclusion that a condition exists which is dangerous to the life and health of the workers in any industry or factory or other industrial institutions the commissioner shall file a report thereon with the Department of Labor and Industry.",
	"repealed": false
}