{
	"id": "142D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/142D.08",
	"title": "142D.08 VOLUNTARY PREKINDERGARTEN PROGRAM FOR ELIGIBLE FOUR-YEAR-OLD CHILDREN.",
	"text": "A district, a charter school, a group of districts, a group of charter schools, or a group of districts and charter schools may establish a voluntary prekindergarten program for eligible four-year-old children. The purpose of a voluntary prekindergarten program is to support children and their families and prepare them for success in kindergarten and beyond.\n[See Note.]\n(a) A voluntary prekindergarten program provider must:\n(1) provide instruction through play-based learning to foster children's social and emotional development, cognitive development, physical and motor development, and language and literacy skills, including the native language and literacy skills of English learners, to the extent practicable;\n(2) assess each child's progress toward the state's early learning standards when the child enters and again before the child leaves the program using a commissioner-approved formative, developmentally appropriate assessment and report results and demographic data to the department in a form and manner prescribed by the commissioner;\n(3) provide comprehensive program content aligned with the state early learning standards, including the implementation of curriculum, assessment, and intentional instructional strategies that support transition to kindergarten through grade 3 academic standards;\n(4) provide instructional content and activities that are of sufficient length and intensity to address learning needs including offering a program with at least 350 hours of instruction per school year for a prekindergarten student;\n(5) provide voluntary prekindergarten instructional staff salaries comparable to the salaries of local kindergarten through grade 12 instructional staff;\n(6) coordinate appropriate kindergarten transition with families, prekindergarten programs offered by Head Start, licensed center and licensed family child care, community-based organizations, and school district kindergarten programs;\n(7) involve parents in program decision-making and transition planning by implementing parent engagement strategies that include culturally and linguistically responsive activities in prekindergarten through third grade that are aligned with early childhood family education under section 142D.10;\n(8) coordinate with relevant community-based services, including health and social service agencies, to ensure children have access to comprehensive services;\n(9) coordinate with all relevant school district programs and services including early childhood special education, homeless students, and English learners;\n(10) ensure staff-to-child ratios of one-to-ten and a maximum group size of 20 children;\n(11) provide high-quality coordinated professional development, training, and coaching for staff in school districts and in prekindergarten programs offered by Head Start, licensed center and licensed family child care providers, and community-based organizations that is informed by a measure of adult-child interactions and enables teachers to be highly knowledgeable in early childhood curriculum content, assessment, native and English language development programs, and instruction; and\n(12) implement strategies that support the alignment of professional development, instruction, assessments, and prekindergarten through grade 3 curricula.\n(b) A voluntary prekindergarten program must have teachers knowledgeable in early childhood curriculum content, assessment, native and English language programs, and instruction, and licensed according to section 122A.261.\n[See Note.]\nA district or charter school may contract with a charter school, Head Start program, licensed center and licensed family child care, or a community-based organization to provide eligible children with developmentally appropriate services that meet the program requirements in subdivision 2. Components of a mixed-delivery plan include strategies for recruitment, contracting, and monitoring of fiscal compliance and program quality.\n[See Note.]\n(a) An eligible child means a child who:\n(1) is four years of age as of September 1 in the calendar year in which the school year commences; and\n(2) meets at least one of the following criteria:\n(i) qualifies for free or reduced-priced meals;\n(ii) qualifies for the rate at application specified in section 142E.10, subdivision 1, paragraph (a), clause (2), in the current calendar year;\n(iii) is an English language learner as defined by section 124D.59, subdivision 2;\n(iv) is American Indian;\n(v) has experienced homelessness in the last 24 months, as defined under the federal McKinney-Vento Homeless Assistance Act, United States Code, title 42, section 1143a;\n(vi) was identified as having a potential risk factor that may influence learning through health and developmental screening under sections 142D.09 to 142D.093;\n(vii) is in foster care; is in kinship care, including children receiving Northstar kinship care assistance under sections 142A.60 to 142A.612; or is in need of child protection services;\n(viii) has a parent who is a migrant or seasonal agricultural laborer under section 181.85;\n(ix) has a parent who is incarcerated; or\n(x) is defined as at-risk by the school district.\n(b) School districts and charter schools must use state funding for eligible children to the extent it is available. A child may participate in a voluntary prekindergarten program on a fee-for-service basis if the child does not meet the eligibility criteria in paragraph (a) or state funding is not available. A school district or charter school must adopt a sliding-fee schedule based upon family income and must waive a fee for a participant unable to pay.\n(c) Each eligible child must complete a health and developmental screening within 90 days of program enrollment under sections 142D.09 to 142D.093, and provide documentation of required immunizations under section 121A.15.\n(d) A child with an individualized education program may not be excluded from participation in a program under this section if all other eligibility requirements are satisfied and the individualized education program team determines that with reasonable accommodations the child can fully participate and make progress toward their goals and objectives.\n[See Note.]\n(a) To qualify for program approval for fiscal year 2026, a district or charter school must submit an application to the commissioner by January 30, 2025. Thereafter, the commissioner must accept applications and approve programs every four years. To qualify for program approval after fiscal year 2026, a school district or charter school must submit an application to the commissioner by January 30 of the fiscal year prior to the fiscal year in which the program will be implemented. The application must include:\n(1) a description of the proposed program, including the number of hours per week the program will be offered at each school site or mixed-delivery location;\n(2) an estimate of the number of eligible children to be served in the program at each school site or mixed-delivery location; and\n(3) a statement of assurances signed by the superintendent or charter school director that the proposed program meets the requirements of subdivision 2.\n(b) The commissioner must review all applications by March 1 of the fiscal year in which the applications are received and determine whether each application meets the requirements of paragraph (a).\n(c) The commissioner must divide all applications for new or expanded voluntary prekindergarten programs under this section meeting the requirements of paragraph (a) and school readiness plus programs into five groups as follows: the Minneapolis school district; the St. Paul school district; other school districts located in the metropolitan equity region as defined in section 126C.10, subdivision 28; school districts located in the rural equity region as defined in section 126C.10, subdivision 28; and charter schools. Within each group, the applications must be ordered by rank using a sliding scale based on the following criteria:\n(1) concentration of kindergarten students eligible for free or reduced-price meals by school site on October 1 of the previous school year. A school site may contract to partner with a community-based provider or Head Start under subdivision 3 or establish an early childhood center and use the concentration of kindergarten students eligible for free or reduced-price meals from a specific school site as long as those eligible children are prioritized and guaranteed services at the mixed-delivery site or early education center. For school district programs to be operated at locations that do not have free and reduced-price meals concentration data for kindergarten programs for October 1 of the previous school year, including mixed-delivery programs, the school district average concentration of kindergarten students eligible for free or reduced-price meals must be used for the rank ordering;\n(2) presence or absence of a three- or four-star Parent Aware rated program within the school district or close proximity of the district. School sites with the highest concentration of kindergarten students eligible for free or reduced-price meals that do not have a three- or four-star Parent Aware program within the district or close proximity of the district shall receive the highest priority, and school sites with the lowest concentration of kindergarten students eligible for free or reduced-price meals that have a three- or four-star Parent Aware rated program within the district or close proximity of the district shall receive the lowest priority; and\n(3) whether the district has implemented a mixed delivery system.\n[See Note.]\n(a) Beginning July 1, 2024, the participation limit specified in subdivision 6 must be initially allocated as follows:\n(1) a school site or mixed delivery site must receive the same number of seats the site received in fiscal year 2024; and\n(2) the remaining seats must be allocated among the five groups identified under subdivision 5, paragraph (c), based on each group's percentage share of the statewide kindergarten enrollment on October 1 of the previous year.\n(b) Within each group:\n(1) the seats must be first allocated to any school sites and mixed delivery sites approved for aid in the previous year or allocation period; and\n(2) any remaining seats must be allocated among school sites in priority order, as determined under subdivision 5, paragraph (c), until the group's share of seats are allocated.\n(c) If a group's entire share of seats is not allocated under paragraphs (a) and (b), then the remaining seats must be allocated to the highest priority school sites and mixed delivery sites in the state, as designated under subdivision 5, paragraph (c), not funded in the allocation under paragraphs (a) and (b).\n(d) Once a school site or a mixed delivery site is approved for aid under subdivision 5 and is allocated seats under this subdivision, it shall remain eligible for aid and seats if it continues to meet program requirements, regardless of changes in the concentration of students eligible for free or reduced-price meals.\n(e) If the total number of participants approved based on applications submitted under subdivision 5, paragraph (a), is less than the participation limit under subdivision 6, the commissioner must notify all school districts and charter schools of the amount that remains available within 30 days of the initial application deadline under subdivision 5, paragraph (a), and complete a second round of allocations based on applications received within 60 days of the initial application deadline.\n(f) Procedures for approving applications submitted under paragraph (e) shall be the same as specified in subdivision 5, and the allocations shall be made to the highest priority school sites in the state as designated under subdivision 5, paragraph (c), not funded in the initial allocation under paragraphs (a) and (b).\n(g) For nonapplication years, the commissioner must annually review the distribution of seat allocations and may redistribute them between sites within a district at their request and between districts for the year in which a district will not utilize their full allocation.\n(a) Notwithstanding section 126C.05, subdivision 1, paragraph (c), the pupil units for a voluntary prekindergarten program for an eligible school district or charter school must not exceed 60 percent of the kindergarten pupil units for that school district or charter school under section 126C.05, subdivision 1, paragraph (d).\n(b) In reviewing applications under subdivision 5 and allocating seats under subdivision 5a, the commissioner must limit the total number of participants in the voluntary prekindergarten and school readiness plus programs under section 142D.07, to not more than 7,160 participants for fiscal year 2024 and 12,360 participants for fiscal year 2025 and later.\nAn eligible school district or charter school must record expenditures attributable to voluntary prekindergarten pupils according to guidelines prepared by the commissioner of education under section 127A.17.\nThe commissioner and the commissioner of education shall enter into an agreement under which the commissioner of education shall distribute funds appropriated for programs under this section.",
	"repealed": false
}