{
	"id": "176.129",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.129",
	"title": "176.129 CREATION OF SPECIAL COMPENSATION FUND.",
	"text": "The special compensation fund is created for the purposes provided for in this chapter and chapter 182. The commissioner of management and budget is the custodian of the special compensation fund. Sums paid to the commissioner pursuant to this section shall be deposited with the commissioner of management and budget for the benefit of the fund and used to pay the benefits under this chapter and administrative costs pursuant to subdivision 11. Any interest or profit accruing from investment of these sums shall be credited to the special compensation fund. Subject to the provisions of this section, all the powers, duties, functions, obligations, and rights vested in the special compensation fund immediately prior to January 1, 1984, are transferred to and vested in the special compensation fund recreated by this section. All rights and obligations of employers with regard to the special compensation fund which existed immediately prior to January 1, 1984, continue, subject to the provisions of this section.\nInterest earned on revenue collected by the special compensation fund shall be deposited into the special compensation fund.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Paid indemnity losses\" means gross benefits paid for temporary total disability, economic recovery compensation, permanent partial disability, temporary partial disability, impairment compensation, permanent total disability, retraining compensation paid to the employee as provided by section 176.102, subdivision 11, or dependency benefits, exclusive of medical and supplementary benefits. In the case of policy deductibles, paid indemnity losses includes all benefits paid, including the amount below deductible limits.\n(c) \"Standard workers' compensation premium\" means the data service organization's designated statistical reporting pure premium after excluding retrospective rating plan adjustments, other individual risk rating plan adjustments such as schedule rating, premium credits for small and large deductible coverage, and other deviations from the data service organization's designated statistical reporting pure premiums and experience rating plan modification factors but prior to the application of premium discounts, policyholder dividends, other premium adjustments, and expense constants.\n[Repealed, 2000 c 447 s 28]\n(a) On or before April 1 of each year, all self-insured employers shall report paid indemnity losses and insurers shall report paid indemnity losses and standard workers' compensation premium in the form and manner prescribed by the commissioner. On June 1 of each year, the commissioner shall determine the total amount needed to pay all estimated liabilities, including administrative expenses, of the special compensation fund for the following fiscal year. The commissioner shall assess this amount against self-insured employers and insurers. The total amount of the assessment must be allocated between self-insured employers and insured employers based on paid indemnity losses for the preceding calendar year, as provided by paragraph (b). The method of assessing self-insured employers must be based on paid indemnity losses, as provided by paragraph (c). The method of assessing insured employers is based on standard workers' compensation premium, as provided by paragraph (c). Each insurer shall collect the assessment through a policyholder surcharge as provided by paragraph (d). On or before June 30 of each year, the commissioner shall provide notification to each self-insured employer and insurer of amounts due. Each self-insured employer and each insurer shall pay at least one-half of the amount due to the commissioner for deposit into the special compensation fund on or before August 1 of the same calendar year. The remaining balance is due on February 1 of the following calendar year. Each insurer must pay the full amount due as stated in the commissioner's notification, regardless of the amount the insurer actually collects from the policyholder surcharge.\n(b) The portion of the total assessment that is allocated to self-insured employers is the proportion that paid indemnity losses made by all self-insured employers bore to the total paid indemnity losses made by all self-insured employers and insured employers during the preceding calendar year. The portion of the total assessment that is allocated to insured employers is the proportion that paid indemnity losses made on behalf of all insured employers bore to the total paid indemnity losses made by all self-insured employers and insured employers during the preceding calendar year.\n(c) The portion of the total assessment allocated to self-insured employers that shall be paid by each self-insured employer must be based upon paid indemnity losses made by that self-insured employer during the preceding calendar year. The portion of the total assessment allocated to insured employers that is paid by each insurer must be based on standard workers' compensation premium earned in the state by that insurer during the current calendar year. If the current calendar year earned standard workers' compensation premium is not available, the commissioner shall estimate the portion of the total assessment allocated to insured employers that is paid by each insurer using the earned standard workers' compensation premium from the preceding calendar year. The commissioner shall then perform a reconciliation and final determination of the portion of the total assessment to be paid by each insurer when the earned standard workers' compensation premium for the current calendar year is calculable, but the final determination must not be made after December 1 of the following calendar year. An employer who has ceased to be self-insured shall continue to be liable for assessments based on paid indemnity losses arising out of injuries occurring during periods when the employer was self-insured, unless the self-insured employer has purchased a replacement policy covering those losses. An insurer who assumes a self-insured employer's obligation under a replacement policy shall separately report and pay assessments based on indemnity losses paid by the insurer under the replacement policy. The replacement policy may provide for reimbursement of the assessment to the insurer by the self-insured employer.\n(d) Insurers shall collect the assessments from their insured employers through a surcharge based on standard workers' compensation premium for each employer. Assessments when collected do not constitute an element of loss for the purpose of establishing rates for workers' compensation insurance but for the purpose of collection are treated as separate costs imposed on insured employers. The policyholder surcharge is included in the definition of gross premium as defined in section 297I.01 only for premium tax purposes. An insurer may cancel a policy for nonpayment of the policyholder surcharge. The policyholder surcharge is excluded from the definition of premium for all other purposes, except as otherwise provided in this paragraph.\n(e) For purposes of this section, the workers' compensation assigned risk plan established under section 79.252, shall report and pay assessments on standard workers' compensation premium in the same manner as an insurer.\n[Repealed, 2002 c 262 s 23]\n[Repealed, 2002 c 262 s 23]\n[Repealed, 2002 c 262 s 23]\n[Repealed, 1984 c 432 art 2 s 55]\nThe Workers' Compensation Division, a compensation judge, the Workers' Compensation Court of Appeals, or a district court in cases before them shall direct the distribution of benefits provided by this chapter. These benefits are payable in the same manner as other payments of compensation.\nIn case deposit is or has been made pursuant to subdivision 2a by mistake or inadvertence, or under circumstances that justice requires a refund, the commissioner of management and budget is authorized to refund the deposit under order of the commissioner, a compensation judge, the Workers' Compensation Court of Appeals, or a district court. Claims for refunds must be submitted to the commissioner within three years of the date of reconciliation and final determination under subdivision 2a. There is appropriated to the commissioner from the fund an amount sufficient to make the refund and payment.\nThe commissioner is the administrator of the special compensation fund. The special fund shall be designated a party in an action regarding any right, obligation, and liability of the special fund. The commissioner of management and budget, as custodian, does not have standing in an action determining any right, obligation, or liability of the special fund. As requested by the commissioner, the attorney general shall represent the special fund in all legal matters in which the special fund has an interest. The commissioner may designate one or more division employees to appear on behalf of the special fund in proceedings under this chapter. The division employees so designated need not be attorneys-at-law.\nIn addition to powers granted to the special compensation fund by this chapter the fund may do the following:\n(1) sue and be sued in its own name;\n(2) intervene in or commence an action under this chapter or any other law, including, but not limited to, intervention or action as a subrogee to the division's right in a third-party action, any proceeding under this chapter in which liability of the special compensation fund is an issue, or any proceeding which may result in other liability of the fund or to protect the legal right of the fund;\n(3) enter into settlements including but not limited to structured, annuity purchase agreements with appropriate parties under this chapter. Notwithstanding any other provision of this chapter, any settlement may provide that the fund partially or totally denies liability for payment of benefits, and no determination of employer insurance status and liability under section 176.183, subdivision 2, shall be required for approval of the stipulation for a settlement;\n(4) contract with another party to administer the special compensation fund;\n(5) take any other action which an insurer is permitted by law to take in operating within this chapter; and\n(6) conduct a financial audit of indemnity claim payments, premium, and assessments reported to the fund. This may be contracted by the fund to a private auditing firm.\nSums paid to the commissioner pursuant to this section shall be in the manner prescribed by the commissioner. The commissioner may impose a penalty payable to the commissioner for deposit in the assigned risk safety account of up to 15 percent of the amount due under this section but not less than $1,000 in the event payment is not made or reports are not submitted in the manner prescribed. In addition to a penalty under this subdivision, in the event payment is not made within six months of the due date, the commissioner shall refer the self-insured employer or insurer's file to the Department of Commerce for consideration of license or permit revocation.\nThe accounting, investigation, and legal costs necessary for the administration of the programs financed by the special compensation fund shall be paid from the fund during each biennium commencing July 1, 1981. Staffing and expenditures related to the administration of the special compensation fund shall be approved through the regular budget and appropriations process. All sums recovered by the special compensation fund as a result of action under section 176.061, or recoveries of payments made by the special compensation fund under section 176.183 or 176.191, or sums recovered under chapter 182, shall be credited to the special compensation fund.\nThe commissioner shall report biennially to the governor and to the legislature as to the financial status of the special compensation fund. The report shall include a statement of the receipts and the disbursements for the period covered.\n(a) All employers and insurers shall make reports to the commissioner as required for the proper administration of this section and Minnesota Statutes 1990, section 176.131, and Minnesota Statutes 1994, section 176.132. Employers and insurers may not be reimbursed from the special compensation fund for any periods unless the employer or insurer is up to date with all past due and currently due assessments, penalties, and reports to the special compensation fund under this section. The commissioner may allow an offset of the reimbursements due an employer or insurer pursuant to Minnesota Statutes 1990, section 176.131, and Minnesota Statutes 1994, section 176.132, against the assessment due under the section or against any other debt owed to the special compensation fund by the employer or insurer.\n(b) Except as provided in paragraph (c), the special compensation fund shall not reimburse an insolvent insurer for subsequent injury or supplementary benefits after a declaration of bankruptcy or order of liquidation or insolvency is issued for the insurer, even if the benefits were paid before the declaration or order. This does not limit the claim distribution or set-off authority of a court, trustee, or liquidator under federal bankruptcy law or under chapter 60B or a similar law in another jurisdiction. For purposes of this paragraph, subsequent injury benefits are the benefits paid pursuant to Minnesota Statutes 1990, section 176.131, and supplementary benefits are the benefits paid pursuant to Minnesota Statutes 1994, section 176.132.\n(c) The special compensation fund shall reimburse an insolvent insurer for subsequent injury or supplemental benefits after a declaration of bankruptcy or order of liquidation or insolvency to an insolvent insurer who has filed for reimbursement from the special compensation fund before June 1, 2013. This includes reimbursement for any past, pending, or future claims that may arise out of the insolvent insurer's coverage.",
	"repealed": false
}