{
	"id": "245C.033",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.033",
	"title": "245C.033 GUARDIANS AND CONSERVATORS; MALTREATMENT AND STATE LICENSING AGENCY CHECKS.",
	"text": "Requests for maltreatment data submitted pursuant to section 524.5-118 must include information regarding whether the guardian or conservator has been a perpetrator of substantiated maltreatment of a vulnerable adult under section 626.557 or a minor under chapter 260E. If the guardian or conservator has been the perpetrator of substantiated maltreatment of a vulnerable adult or a minor, the commissioner must include a copy of any available public portion of the investigation memorandum under section 626.557, subdivision 12b, or any available public portion of the investigation memorandum under section 260E.30.\n(a) Requests for state licensing agency data submitted pursuant to section 524.5-118 must include information from a check of state licensing agency records.\n(b) The commissioner shall provide the court with licensing agency data for licenses directly related to the responsibilities of a guardian or conservator if the guardian or conservator has a current or prior affiliation with the:\n(1) Lawyers Responsibility Board;\n(2) State Board of Accountancy;\n(3) Board of Social Work;\n(4) Board of Psychology;\n(5) Board of Nursing;\n(6) Board of Medical Practice;\n(7) Department of Education;\n(8) Department of Commerce;\n(9) Board of Chiropractic Examiners;\n(10) Board of Dentistry;\n(11) Board of Marriage and Family Therapy;\n(12) Department of Human Services;\n(13) Peace Officer Standards and Training (POST) Board; or\n(14) Professional Educator Licensing and Standards Board.\n(c) The commissioner shall provide to the court the electronically available data maintained in the agency's database, including whether the guardian or conservator is or has been licensed by the agency and whether a disciplinary action or a sanction against the individual's license, including a condition, suspension, revocation, or cancellation, is in the licensing agency's database.\n(a) For requests paid directly by the guardian or conservator, requests for maltreatment and state licensing agency data checks must be submitted by the guardian or conservator to the commissioner on the form or in the manner prescribed by the commissioner. Upon receipt of a signed informed consent and payment under section 245C.10, the commissioner shall complete the maltreatment and state licensing agency checks. Upon completion of the checks, the commissioner shall provide the requested information to the courts on the form or in the manner prescribed by the commissioner.\n(b) For requests paid by the court based on the in forma pauperis status of the guardian or conservator, requests for maltreatment and state licensing agency data checks must be submitted by the court to the commissioner on the form or in the manner prescribed by the commissioner. The form will serve as certification that the individual has been granted in forma pauperis status. Upon receipt of a signed data request consent form from the court, the commissioner shall initiate the maltreatment and state licensing agency checks. Upon completion of the checks, the commissioner shall provide the requested information to the courts on the form or in the manner prescribed by the commissioner.\nAll data obtained by the commissioner for maltreatment and state licensing agency checks completed under this section is classified as private data on individuals, as defined in section 13.02, subdivision 12.",
	"repealed": false
}