{
	"id": "303.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/303.25",
	"title": "303.25 FOREIGN TRUST ASSOCIATIONS, POWERS.",
	"text": "Any foreign trust association may accept appointment and act as executor of the will or administrator of the estate of any decedent who was a resident of this state at the time of death, as trustee of any trust created by a resident of this state by will or otherwise, and as guardian of any resident of this state or conservator of the resident's estate, if banking or trust associations or corporations organized under the laws of this state or national banking associations maintaining their principal offices in this state are permitted to act as executors, administrators, trustees, guardians, or conservators in the state in which the foreign trust association maintains its principal office. Any foreign trust association may accept appointment and act as executor of the will or administrator of the estate of a decedent, who was a resident of the state in which the foreign trust association maintains its principal office at the time of death, in ancillary probate proceedings in this state, as trustee of any trust created by the decedent by will or otherwise of property situated in this state, and as guardian or conservator in ancillary proceedings in this state with respect to the property of a resident of the other state if banking or trust associations or corporations organized under the laws of this state and national banking associations maintaining their principal offices in this state are permitted to act as executors, administrators, trustees, guardians, or conservators in the state in which the foreign trust association maintains its principal office.\nBefore accepting appointment or acting as executor, administrator, trustee, guardian, or conservator, a foreign trust association shall appoint the secretary of state, a successor or successors in office, its true and lawful attorney upon whom may be served all legal process in any action or proceeding against it, or in which it may be a party, in relation to or involving any acts or defaults by it as executor, administrator, trustee, guardian, or conservator. This appointment is irrevocable. Service upon the attorney is as valid and binding as if due personal service had been made upon the foreign trust association.\nBefore accepting appointment or acting as executor, administrator, trustee, guardian, or conservator, every foreign trust association shall file a bond with a court of competent jurisdiction in an amount as the court directs, with sufficient sureties, conditioned upon the faithful discharge of its duties as executor, administrator, trustee, guardian, or conservator, or, in lieu of the bond, shall deposit securities with the commissioner of management and budget in the same manner and in the same amount as would be required under section 48A.03, subdivision 2, of a trust company organized under the laws of this state. This deposit shall be maintained until the foreign trust association shall cease to act as an executor, administrator, trustee, guardian, or conservator under this section. However, except as otherwise ordered by a court of competent jurisdiction, the requirements of this subdivision do not apply to a trustee with respect to a trust created otherwise than by will if the trust instrument requests or directs that a bond need not be required of the trustee.\nAny foreign trust association acting as executor, administrator, trustee, guardian, or conservator has the rights, authority, and duties that a natural person resident in this state duly acting as executor, administrator, trustee, guardian, or conservator has under the laws of this state.\nA foreign trust may solicit business within this state if banking or trust associations or corporations organized under the laws of this state or national banking associations maintaining their principal offices in this state may solicit business in the state in which the foreign trust association maintains its principal office. For purposes of this subdivision, solicitation of business includes the activities authorized for state or national banking associations exercising fiduciary powers maintaining their principal offices in this state considered a representative trust office established under section 48A.14. A foreign trust association must follow the procedures in section 48A.18 to establish a trust office and the procedures in section 48A.19 to establish a representative trust office.\nService of process under this section may be made by delivering a copy to the secretary of state personally or by filing the same in the secretary of state's office, accompanied by one additional copy for each person so served, and by the mailing by the secretary of state of a copy by certified mail, not later than the business day following the day of the service, to each person so served at the address of each person as shown by the records in the Office of the Secretary of State.",
	"repealed": false
}