{
	"id": "41B.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/41B.04",
	"title": "41B.04 LOAN RESTRUCTURING PROGRAM.",
	"text": "The authority may enter into agreements or programs with eligible agricultural lenders for the restructuring of mortgage loans on real property located in Minnesota which is farmed by Minnesota residents, on such terms and conditions as the authority determines are not inconsistent with sections 41B.01 to 41B.23. This section governs the programs of the authority.\nThe authority may implement a program to restructure agricultural loans and to purchase loan participation interests in qualified restructuring loans made by eligible agricultural lenders to eligible borrowers. Each such purchase shall be made only upon determination by or on behalf of the authority that the loan is a qualified restructuring loan as provided in this section.\nLoans must comply with the following criteria:\n(a) Each loan must be for the purpose of developing the state's agricultural resources and must be an extension of credit on real estate security. The loan may be secured by eligible security in addition to real estate. The security interests granted by the eligible borrower must be senior and prior to any other security interest in the pledged assets.\n(b) No loan may be made to finance activities of the borrower which are not an agricultural use as defined in section 40A.02, subdivision 3.\n(c) A participation interest in a restructuring loan may be purchased by the authority only if the eligible agricultural lender has determined and has certified to the authority that the borrower is an eligible borrower who has the reasonable ability to make timely payment of principal and interest on the loan when due over the term of the loan. The eligible agricultural lender shall further certify to the authority that the loan is a qualified agricultural loan.\nNotwithstanding Minnesota Rules, part 1653.0031, and other law to the contrary, a person who farms land located in a county that has been the subject of a state or federal disaster declaration may participate in a loan restructuring program under this section even if the person has a debt-to-asset ratio under 50 percent. The person must apply to participate in the program within 18 months of the disaster declaration.\nThe authority shall exercise its best efforts to assure that credit made available through the loan restructuring program is made available throughout the agricultural areas of the state, and that the number or amount of loans are not unduly concentrated in any one area of the state.\nThe authority shall exercise its best efforts to assure that the program provides the maximum feasible benefits to as many eligible borrowers as is reasonably possible.\n[Repealed, 1987 c 396 art 1 s 32]\n(a) The eligible agricultural lender or borrower shall propose restructuring a loan to the authority. Within 30 days of receiving adequate information concerning a proposal, the authority and the eligible lender shall notify the borrower of their determination of eligibility. An eligible agricultural lender shall then expeditiously draft the loan restructuring agreement which must be consistent with this section and documents previously approved by the authority.\n(b) An eligible borrower may participate in the restructured loan or the homestead redemption loan, but not both loans.\nWith respect to loans that are eligible for restructuring under sections 41B.01 to 41B.23 and upon acceptance by the authority, the authority shall enter into a participation agreement or other financial arrangement whereby it shall participate in a restructured loan to the extent of 45 percent of the primary principal or $625,000, whichever is less. The authority's portion of the loan must be protected during the authority's participation by the first mortgage held by the eligible lender to the extent of its participation in the loan.\n(a) For a deferred restructured loan, all payments on the primary and secondary principal, all payments of interest on the secondary principal, and an agreed portion of the interest payable to the eligible agricultural lender on the primary principal must be deferred to the end of the term of the loan.\n(b) Interest on secondary principal must accrue at a below market interest rate.\n(c) At the conclusion of the term of the restructured loan, the borrower owes primary principal, secondary principal, and deferred interest on primary and secondary principal. However, part of this balloon payment may be forgiven following an appraisal by the lender and the authority to determine the current market value of the real estate subject to the mortgage. If the current market value of the land after appraisal is less than the amount of debt owed by the borrower to the lender and authority on this obligation, that portion of the obligation that exceeds the current market value of the real property must be forgiven by the lender and the authority in the following order:\n(1) deferred interest on secondary principal;\n(2) secondary principal;\n(3) deferred interest on primary principal;\n(4) primary principal as provided in an agreement between the authority and the lender; and\n(5) accrued but not deferred interest on primary principal.\n(d) For an amortized restructured loan, payments must include installments on primary principal and interest on the primary principal. An amortized restructured loan must be amortized over a time period and upon terms to be established by the authority by rule.\n(e) A borrower may prepay the restructured loan, with all primary and secondary principal and interest and deferred interest at any time.\n(f) The authority may not participate in refinancing a restructured loan at the conclusion of the restructured loan.\nUnless the authority determines that it is not in the best interests of the restructured loan program, the interest rate per annum on the portion of the restructured loan represented by the participation interest purchased by the authority must be that rate of interest determined by the authority to be necessary to provide for the timely payment of principal and interest when due on bonds or other obligations issued by the authority, and to provide for the reasonable and necessary costs of issuing, carrying, administering, and securing the bonds or notes and to pay the costs incurred and to be incurred by the authority in the implementation of the program. The interest rate per annum borne by the primary principal portion of the restructuring loan retained by the eligible agricultural lender must be a rate of interest approved by the authority. The authority may specify the points, fees, and other charges which the eligible agricultural lender may charge to the eligible borrower.\nThe eligible lender shall administer the loans and shall bear all costs of the loan administration. Ordinary costs of administration include appraisals, litigation, abstracts of title, and similar costs.\nLoans restructured under this section may not be assigned to anyone other than a borrower meeting the eligibility requirements of section 41B.03, subdivision 1, and any other requirements imposed or approved by the authority. If such an assignment is contemplated, the borrower must obtain prior written approval of the eligible lender and the administration and the assignee shall thereafter be subject to the same terms and conditions and events of default as the original borrower. If assigned to some other party, the eligible agricultural lender may exercise its foreclosure remedies as provided by its contracts and by law.\n[Repealed, 1987 c 396 art 1 s 32]\n[Repealed, 1987 c 396 art 1 s 32]\n[Repealed, 1987 c 396 art 1 s 32]\n[Repealed, 1987 c 396 art 1 s 32]\nThe authority may impose a reasonable nonrefundable application fee for each application and an origination fee for each loan issued under the loan restructuring program. The origination fee is 1.5 percent of the authority's participation interest in the loan and the application fee is $50. The authority may review the fees annually and make adjustments as necessary. The fees must be deposited in the state treasury and credited to the Rural Finance Authority administrative account established in section 41B.03.",
	"repealed": false
}