{
	"id": "72C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/72C.05",
	"title": "72C.05 COVER SHEET.",
	"text": "All insurance policies or contracts described in section 72C.11, clauses (a) and (b) issued, amended or renewed after July 1, 1978 and before the filing requirements of section 72C.10 take effect shall contain as the first page or first page of text, if it is preceded by a title page or pages, a cover sheet or sheets as provided in this section.\nThe cover sheet or sheets shall be printed in legible type and readable language, as provided in section 72C.06, and shall contain at least the following:\n(a) A brief statement that the policy is a legal contract between the policy owner and the company;\n(b) The statement \"READ YOUR POLICY CAREFULLY. This cover sheet provides only a brief outline of some of the important features of your policy. This is not the insurance contract and only the actual policy provisions will control. The policy itself sets forth, in detail, the rights and obligations of both you and your insurance company. IT IS THEREFORE IMPORTANT THAT YOU READ YOUR POLICY CAREFULLY.\"; and\n(c) An index of the major provisions of the policy or contract and the pages on which they are found which may include the following items:\n(1) the person or persons insured by the policy;\n(2) the applicable events, occurrences, conditions, losses or damages covered by the policy;\n(3) the limitations or conditions on the coverage of the policy;\n(4) definitional sections of the policy;\n(5) provisions governing the procedure for filing a claim under the policy;\n(6) provisions governing cancellation, renewal, or amendment of the policy by either the insurer or the policy owner;\n(7) any options under the policy; and\n(8) provisions governing the insurer's duties and powers in the event that suit is filed against the insured.\nThe cover sheet may include, either as part of the index or as a separate section, a brief summary of the extent and types of coverage in the policy.\nNo cover sheet shall be used unless it has been filed with and approved by the commissioner. The cover sheet shall be deemed approved 30 days after filing unless disapproved by the commissioner within the 30-day period, subject to a reasonable extension of time as the commissioner may require by notice given within the 30-day period. The commissioner shall disapprove any cover sheet which does not meet the requirements of this section. Any disapproval shall be delivered to the insurer in writing, stating the grounds therefor.\nIn lieu of the cover sheet required by this section, the insurer may file a policy or contract with the commissioner under the provisions of sections 72C.06 to 72C.08.",
	"repealed": false
}