{
	"id": "260E.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.12",
	"title": "260E.12 REQUIRED ACTIONS OF THE RESPONSIBLE AGENCY AND LAW ENFORCEMENT UPON RECEIVING REPORT.",
	"text": "(a) The police department or the county sheriff shall immediately notify the local welfare agency or agency responsible for child protection reports under this chapter orally and in writing when a report is received.\n(b) Written reports received by a police department or the county sheriff shall be forwarded immediately to the local welfare agency or the agency responsible for assessing or investigating the report. The police department or the county sheriff may keep copies of reports received by them.\n(c) The county sheriff and the head of each local welfare agency, agency responsible for child protection reports, and police department shall designate a person within the agency, department, or office who is responsible for ensuring that the notification duties of this section are carried out. If the alleged maltreatment occurs on tribal land, the local welfare agency or agency responsible for child protection reports and the local police department or county sheriff shall immediately notify the tribe's social services agency and tribal law enforcement orally and in writing when a report is received. When a police department or county determines that a child has been the subject of maltreatment by a person licensed by the Professional Educator Licensing and Standards Board or the Board of School Administrators, the department or sheriff shall, in addition to other duties under this section, immediately inform the licensing board.\n(d) If a child is the victim of an alleged crime under subdivision 2, paragraph (c), the law enforcement agency shall immediately notify the local welfare agency, which shall offer appropriate social services for the purpose of safeguarding and enhancing the welfare of the maltreated child.\n(a) The local welfare agency or agency responsible for child protection reports shall immediately notify the local police department or the county sheriff orally and in writing when a report is received.\n(b) Copies of written reports received by a local welfare agency or the agency responsible for assessing or investigating the report shall be forwarded immediately to the local police department or the county sheriff.\n(c) Receipt by a local welfare agency of a report or notification of a report of kidnapping under section 609.25 or depriving another of custodial or parental rights under section 609.26 shall not be construed to invoke the duties under this chapter except notification of law enforcement and the offer of services under section 260E.20, subdivision 1, paragraph (a), as appropriate.\n(a) If a local welfare agency receives a report under section 260E.06 and fails to notify the local police department or county sheriff as required by subdivision 2, the person within the agency who is responsible for ensuring that notification is made shall be subject to disciplinary action in keeping with the agency's existing policy or collective bargaining agreement on discipline of employees.\n(b) If a local police department or a county sheriff receives a report under section 260E.06 and fails to notify the local welfare agency as required by subdivision 1, the person within the police department or county sheriff's office who is responsible for ensuring that notification is made shall be subject to disciplinary action in keeping with the agency's existing policy or collective bargaining agreement on discipline of employees.",
	"repealed": false
}