{
	"id": "256M.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/256M.20",
	"title": "256M.20 DUTIES OF COMMISSIONER OF HUMAN SERVICES.",
	"text": "Each year the commissioner shall allocate funds to each county with an approved service plan according to section 256M.40 and service plans under section 256M.30. The funds shall be used to address the needs of vulnerable children and adults. The commissioner, in consultation with counties, shall provide technical assistance and evaluate county performance in achieving outcomes.\nThe commissioner shall:\n(1) provide necessary information and assistance to each county for establishing baselines and desired improvements on safety, permanency, and well-being for vulnerable children and adults;\n(2) provide training, technical assistance, and other supports to each county board to assist in needs assessment, planning, implementation, and monitoring of outcomes and service quality;\n(3) use data collection, evaluation of service outcomes, and the review and approval of county service plans to supervise county performance in the delivery of services;\n(4) specify requirements for reports, including fiscal reports to account for funds distributed;\n(5) request waivers from federal programs as necessary to implement this section; and\n(6) have authority under sections 14.055 and 14.056 to grant a variance to existing state rules as needed to eliminate barriers to achieving desired outcomes.\nThe commissioner shall establish and maintain a monitoring program designed to reduce the possibility of noncompliance with federal laws, regulations, and performance standards that may result in federal fiscal sanctions. If a county is not complying with federal law or federal regulation and the noncompliance may result in federal fiscal sanctions, the commissioner may withhold a portion of the county's share of state and federal funds for that program. The amount withheld must be equal to the percentage difference between the level of compliance maintained by the county and the level of compliance required by the federal regulations, multiplied by the county's share of state and federal funds for the program. The state and federal funds may be withheld until the county is found to be in compliance with all federal laws or federal regulations applicable to the program. If a county remains out of compliance for more than six consecutive months, the commissioner may reallocate the withheld funds to counties that are in compliance with the federal regulations.\nThe commissioner must comply with the following procedures when reducing county funds under subdivision 3.\n(a) The commissioner shall notify the county, by certified mail, of the statute, rule, federal law, or federal regulation with which the county has not complied.\n(b) The commissioner shall give the county 30 days to demonstrate to the commissioner that the county is in compliance with the statute, rule, federal law, or federal regulation cited in the notice or to develop a corrective action plan to address the problem. Upon request from the county, the commissioner shall provide technical assistance to the county in developing a corrective action plan. The county shall have 30 days from the date the technical assistance is provided to develop the corrective action plan.\n(c) The commissioner shall take no further action if the county demonstrates compliance with the statute, rule, federal law, or federal regulation cited in the notice.\n(d) The commissioner shall review and approve or disapprove the corrective action plan within 30 days after the commissioner receives the corrective action plan.\n(e) If the commissioner approves the corrective action plan submitted by the county, the county has 90 days after the date of approval to implement the corrective action plan.\n(f) If the county fails to demonstrate compliance or fails to implement the corrective action plan approved by the commissioner, the commissioner may reduce the county's share of state or federal funds according to subdivision 3.",
	"repealed": false
}