{
	"id": "284.251",
	"url": "https://www.revisor.mn.gov/statutes/cite/284.251",
	"title": "284.251 DETERMINATION OF LIEN AGAINST LAND IN FAVOR OF STATE.",
	"text": "Upon a judgment in any court declaring that a proceeding to forfeit land to the state for nonpayment of taxes is invalid, unless the forfeiture is declared invalid because the land was exempt from taxation at the time the taxes were assessed or because all taxes were paid prior to the time of the supposed forfeiture, and if the land involved has not been sold by the state as provided by law, the court entering the judgment shall, upon such notice and hearing as it may determine, declare and adjudge a lien against the land in favor of the state in an amount to be determined in accordance with this section, based upon the following facts:\n(1) The amount of all taxes, special assessments, penalties, interest and costs, if any, which were due against the land at the time of the supposed forfeiture;\n(2) The amount of all subsequent taxes and special assessments that would have been assessed against the land but for the supposed forfeiture;\n(3) The value of the improvements made on the land by the state prior to the time the action to test the validity of the forfeiture proceeding was begun;\n(4) The net rental income from the land and the net profit from the sale of products therefrom after deducting all expenses incurred in the production of the rentals or profits, received by the state, or its agencies, prior to the time that the action to test the validity of the forfeiture proceeding was begun.\nExcept as otherwise herein provided, the court shall thereupon declare and adjudge a lien in favor of the state upon the land for the total amount of the foregoing items numbered (1) to (3), with interest on the respective items thereof from the time the same accrued or were paid by the state, as the case may be, at six percent per annum, less the amount of item number (4).\nSuch lien may be enforced by an action in the district court of the county in which the land involved or some part thereof is situated, which action shall be begun and conducted in the same manner as provided by law for the enforcement of a judgment by execution as provided by chapter 550 except as herein otherwise provided.\nWhen lands shall be sold in any such proceeding to satisfy a lien adjudged in favor of the state, the sheriff shall pay the proceeds of such sale, after payment of costs, to the county auditor, who shall note upon the tax records the receipt of such sum and the purpose thereof, pursuant to the judgment of the court, which sum shall be apportioned in the manner provided in section 282.08, for the apportionment of the net proceeds from the sale or rental of forfeited land.\nAt any sale of such land to satisfy a lien adjudged in favor of the state, the county auditor, with the approval of the county board, may bid in the land in the name of the state, paying the amount required out of the forfeited tax sale fund, and if the land be sold to the state and be not redeemed, it shall be held and disposed of as in case of lands forfeited for taxes.",
	"repealed": false
}