{
	"id": "609.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.76",
	"title": "609.76 GAMBLING; GROSS MISDEMEANOR; FELONY.",
	"text": "Whoever does any of the following may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both:\n(1) maintains or operates a gambling place or operates a bucket shop;\n(2) intentionally participates in the income of a gambling place or bucket shop;\n(3) conducts a lottery, or, with intent to conduct a lottery, possesses facilities for doing so;\n(4) sets up for use for the purpose of gambling, or collects the proceeds of, any gambling device or bucket shop;\n(5) except as provided in section 299L.07, manufactures, sells, offers for sale, or otherwise provides, in whole or any part thereof, any gambling device including those defined in section 349.30, subdivision 2;\n(6) with intent that it be so used, manufactures, sells, or offers for sale any facility for conducting a lottery, except as provided by section 299L.07; or\n(7) receives, records, or forwards bets or offers to bet or, with intent to receive, record, or forward bets or offers to bet, possesses facilities to do so.\nWhoever engages in sports bookmaking is guilty of a felony.\nWhoever cheats in a game, as described in this subdivision, is subject to the following penalties:\n(i) if the person holds a license related to gambling or is an employee of the licensee, the person is guilty of a felony; and\n(ii) any other person is guilty of a gross misdemeanor. Any person who is a repeat offender is guilty of a felony.\nA person cheats in a game by intentionally:\n(1) altering or misrepresenting the outcome of a game or event on which wagers have been made, after the outcome is determined, but before the outcome is revealed to the players;\n(2) placing, canceling, increasing, or decreasing a bet after acquiring knowledge, not available to other players, of the outcome of the game or subject of the bet, or of events affecting the outcome of the game or subject of the bet;\n(3) claiming or collecting money or anything of value from a game or authorized gambling establishment not won or earned from the game or authorized gambling establishment;\n(4) manipulating a gambling device or associated equipment to affect the outcome of the game or the number of plays or credits available on the game; or\n(5) otherwise altering the elements of chance or methods of selection or criteria which determine the result of the game or amount or frequency of payment of the game.\n(a) Whoever uses or possesses a probability-calculating or outcome-affecting device at an authorized gambling establishment is guilty of a felony. For purposes of this subdivision, a \"probability-calculating\" or \"outcome-affecting\" device is any device to assist in:\n(1) projecting the outcome of a game other than pari-mutuel betting authorized by chapter 240;\n(2) keeping track of or counting cards used in a game;\n(3) analyzing the probability of the occurrence of an event relating to a game other than pari-mutuel betting authorized by chapter 240; or\n(4) analyzing the strategy for playing or betting in a game other than pari-mutuel betting authorized by chapter 240.\nFor purposes of this section, a book, graph, periodical, chart, or pamphlet is not a \"probability-calculating\" or \"outcome-affecting\" device.\n(b) Whoever uses, or possesses with intent to use, a key or other instrument for the purpose of opening, entering, and affecting the operation of any game or gambling device or for removing money, chips, tokens, or other contents from therein, is guilty of a felony. This paragraph does not apply to an agent or employee of an authorized gambling establishment acting within the scope of employment.\nWhoever intentionally uses counterfeit chips or tokens to play a game at an authorized gambling establishment as defined in section 609.75, subdivision 5, designed to be played with or operated by chips or tokens is guilty of a felony. For purposes of this subdivision, counterfeit chips or tokens are chips or tokens not approved by the government regulatory agency for use in an authorized gambling activity.\n(a) Whoever manufactures, sells, distributes, or otherwise provides cards, chips, tokens, dice, or other equipment or devices intended to be used to violate this section, is guilty of a felony.\n(b) Whoever intentionally marks, alters, or otherwise modifies lawful associated equipment or gambling devices for the purpose of violating this section is guilty of a felony.\nWhoever instructs another person to violate the provisions of this section, with the intent that the information or knowledge conveyed be used to violate this section, is guilty of a felony.\nThe value of chips or tokens approved for use in a game designed to be played with or operated by chips or tokens, as the term \"value\" is used in section 609.52, is the amount or denomination shown on the face of the chip or token representing United States currency. Chips used in tournament play at a card club at a class A facility have no United States currency value.",
	"repealed": false
}