{
	"id": "179A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.19",
	"title": "179A.19 ILLEGAL STRIKES.",
	"text": "Except as authorized by section 179A.18, all strikes by public employees are illegal. Except as provided in this section, no unfair labor practice or violation of sections 179A.01 to 179A.25 by a public employer gives public employees a right to strike. Those factors may be considered, however, by the court in mitigation of or retraction of any penalties provided by this section.\nNotwithstanding any other law, public employees who strike in violation of this section may have their appointment or employment terminated by the employer effective the date the violation first occurs. The termination shall be made by serving written notice upon the employee. Service may be made by certified mail.\nFor purposes of this section, an employee who is absent from any portion of a work assignment without permission, or who abstains wholly or in part from the full performance of duties without permission from the employer on a day when a strike not authorized by this section occurs is prima facie presumed to have engaged in an illegal strike on that day.\nA public employee who knowingly participates in a strike in violation of this section and whose employment has been terminated under this section may subsequently be appointed or reappointed, employed or reemployed, but the employee shall be on probation for two years with respect to the civil service status, tenure of employment, or contract of employment to which the employee was previously entitled.\nNo employee is entitled to any daily pay, wages, reimbursement of expenses, or per diem for the days on which the employee engaged in a strike.\n(a) Any public employee is entitled to request the opportunity to establish that the employee did not violate this section. The request shall be filed in writing with the officer or body having the power to remove the employee, within ten days after notice of termination is served upon the employee. The employing officer or body shall within ten days commence a proceeding at which the employee shall be entitled to be heard for the purpose of determining whether the provisions of this section have been violated by the public employee. If there are contractual grievance procedures, laws or rules establishing proceedings to remove the public employee, the hearing shall be conducted in accordance with whichever procedure the employee elects. The election shall be binding and shall terminate any right to the alternative procedures. The same proceeding may include more than one employee's employment status if the employees' defenses are identical, analogous, or reasonably similar. The proceedings shall be undertaken without unnecessary delay.\n(b) Any person whose termination is sustained in the administrative or grievance proceeding may appeal in accordance with chapter 14.\nAn employee organization which has been found pursuant to section 179A.13 to have violated this section: (1) shall lose its status, if any, as exclusive representative; and (2) may not be so certified by the commissioner for a period of two years following the finding. No employer may deduct employee payments to any such organization for a period of two years.",
	"repealed": false
}