{
	"id": "21.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.74",
	"title": "21.74 EXCEPTIONS.",
	"text": "The provisions of section 21.73 shall not apply to:\n(1) agricultural seeds and grains, or screenings, not intended for feeding purposes;\n(2) weed-seed infested agricultural seeds and grains, or screenings, being transported upon any public highway to or from a cleaning or processing establishment for cleaning or processing, which same are carried or transported in such vehicles or containers as will prevent the leaking or scattering thereof;\n(3) weed-seed infested agricultural seeds and grains, or screenings, which have first been devitalized by grinding, heating, chemical treatment, or any other suitable method;\n(4) the sale of weed-seed infested agricultural seeds and grains, or screenings, to each other by jobbers, manufacturers, or processors who mix or grind concentrated commercial feeding stuff for sale; provided that the restrictions applying to clause (2), are complied with;\n(5) the sale of weed-seed infested agricultural seeds and grains, or screenings, by any vendor to a consumer, provided that the restrictions set forth in clauses (2) and (3) are complied with. However, where the vendor is not equipped to devitalize weed seeds, the vendor may sell weed-seed infested agricultural seeds, grains, or screenings only to a consumer who holds a permit issued by the commissioner for such a purchase. The commissioner shall issue such a permit annually to a consumer only if the consumer has the necessary facilities for devitalization, as determined by the commissioner, or has access to such facilities. The consumer shall devitalize such weed-seed infested agricultural seeds, grains, or screenings. The commissioner may revoke a permit after due notice and a hearing if the consumer does not comply with the provisions of this clause. The provisions of this clause shall not apply to the sale at a farm auction of a vendors agricultural seeds or grains for feeding or processing purposes. \"Farm auction\" for the purpose of this clause means the final sale at auction of the personal property of the farmer to the highest bidder. However, if such agricultural seeds and grains are sold under variety names, and in such manner and at such prices as to indicate that it is intended to use the seeds and grains for seeding purposes, the seeds and grains are then subject to all laws relating to cleaning, testing, and labeling of agricultural seed as set forth in the agricultural seed laws and the agricultural weed laws of the state of Minnesota and such rules as have been promulgated by the commissioner of agriculture thereunder; and\n(6) weed-seed infested agricultural seed and grains or screenings, produced by the farmer and fed on the farmer's own farm, provided it does not contain restricted or prohibited noxious weed seeds in excess of the legal limit.",
	"repealed": false
}