{
	"id": "256S.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.01",
	"title": "256S.01 GENERALLY.",
	"text": "The commissioner is authorized to apply for a home and community-based services waiver for the elderly, authorized under section 1915(c) of the Social Security Act, to obtain federal financial participation to expand the availability of services for persons who are eligible for medical assistance. The commissioner may apply for additional waivers or pursue other federal financial participation that is advantageous to the state for funding home care services for the elderly who are eligible for medical assistance. The provision of waiver services to an elderly person receiving medical assistance must comply with the criteria for service definitions and provider standards approved in the elderly waiver.\nThe commissioner shall comply with the requirements in the federally approved transition plan for the elderly waiver authorized under this chapter.\n(a) Services and supports provided under this chapter must meet the requirements in United States Code, title 42, section 1396n.\n(b) Services and supports provided under this chapter must promote consumer choice and be arranged and provided consistent with individualized, written support plans.\nReimbursement for the services provided to a participant under this chapter and under the elderly waiver must be made from the medical assistance account through the invoice processing procedures of the department's Medicaid Management Information System (MMIS), only with the approval of the participant's case manager.\nThe budget for the state share of the Medicaid expenditures under this chapter must be forecasted with the medical assistance budget, and shall be consistent with the elderly waiver.\nThe state of Minnesota, or a county, managed care plan, county-based purchasing plan, or tribal government under contract to administer the elderly waiver, is not liable for damages, injuries, or liabilities sustained as a result of the participant, the participant's family, or the participant's authorized representatives purchasing direct supports or goods with funds received through consumer-directed community supports under the elderly waiver. Liabilities include, but are not limited to, workers' compensation liability, Federal Insurance Contributions Act under United States Code, title 26, subtitle c, chapter 21, or Federal Unemployment Tax Act under Internal Revenue Code, chapter 23.",
	"repealed": false
}