{
	"id": "177.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/177.43",
	"title": "177.43 CONTRACTS FOR STATE PROJECTS; PENALTY.",
	"text": "Any contract which provides for a project must state that:\n(1) no laborer or mechanic employed directly on the project work site by the contractor or any subcontractor, agent, or other person doing or contracting to do all or a part of the work of the project, is permitted or required to work more hours than the prevailing hours of labor unless paid for all hours in excess of the prevailing hours at a rate of at least 1-1/2 times the hourly basic rate of pay; and\n(2) a laborer or mechanic may not be paid a lesser rate of wages than the prevailing wage rate in the same or most similar trade or occupation in the area.\nThis section does not apply to wage rates and hours of employment of laborers or mechanics who process or manufacture materials or products or to the delivery of materials or products by or for commercial establishments which have a fixed place of business from which they regularly supply processed or manufactured materials or products. This section applies to laborers or mechanics who deliver mineral aggregate such as sand, gravel, or stone which is incorporated into the work under the contract by depositing the material substantially in place, directly or through spreaders, from the transporting vehicle.\nThe contract must specifically state the prevailing wage rates, prevailing hours of labor, and hourly basic rates of pay. The contracting authority shall incorporate into its proposals and all contracts the applicable wage determinations for the contract along with contract language provided by the commissioner of labor and industry to notify the contractor and all subcontractors of the applicability of sections 177.41 to 177.44. Failure to incorporate the determination or provided contract language into the contracts shall make the contracting authority liable for making whole the contractor or subcontractor for any increases in the wages paid, including employment taxes and reasonable administrative costs based on the appropriate prevailing wage due to the laborers or mechanics working on the project. The contract must also provide that the contracting agency shall demand, and the contractor and subcontractor shall furnish to the contracting agency, copies of any or all payrolls not more than 14 days after the end of each pay period. The payrolls must contain all the data required by section 177.30. The contracting authority may examine all records relating to wages paid laborers or mechanics on work to which sections 177.41 to 177.44 apply.\nThe prevailing wage rates, prevailing hours of labor, and hourly basic rates of pay for all trades and occupations required in any project must be ascertained before the state asks for bids. The commissioner of labor and industry shall investigate as necessary to ascertain the information. Each contractor and subcontractor performing work on a public project shall keep the information posted on the project in at least one conspicuous place for the information of the employees working on the project. A person aggrieved by a final determination of the commissioner may petition the commissioner for reconsideration of findings. A person aggrieved by a decision of the commissioner after reconsideration may, within 20 days after the decision, petition the commissioner for a public hearing in the manner of a contested case under sections 14.57 to 14.61.\nIt is a misdemeanor for an officer or employee of the state to execute a contract for a project without complying with this section, or for a contractor, subcontractor, or agent to pay any laborer, worker, or mechanic employed directly on the project site a lesser wage for work done under the contract than the prevailing wage rate as stated in the contract. This misdemeanor is punishable by a fine of not more than $700, or imprisonment for not more than 90 days, or both. Each agent or subcontractor shall furnish to the contractor evidence of compliance with this section. Each day a violation of this section continues is a separate offense.\nThe Department of Labor and Industry shall enforce this section. The department may demand, and the contractor and subcontractor shall furnish to the department, copies of any or all payrolls. The department may examine all records relating to wages paid laborers or mechanics on work to which sections 177.41 to 177.44 apply. The department shall employ at least three investigators to perform on-site project reviews, receive and investigate complaints of violations of this section, and conduct training and outreach to contractors and contracting authorities for public works projects financed in whole or in part with state funds.\nUpon issuing a compliance order to an employer pursuant to section 177.27, subdivision 4, for violation of sections 177.41 to 177.44, the commissioner shall issue a withholding order to the contracting authority ordering the contracting authority to withhold payment of sufficient sum to the prime or general contractor on the project to satisfy the back wages assessed or otherwise cure the violation, and the contracting authority must withhold the sum ordered until the compliance order has become a final order of the commissioner and has been fully paid or otherwise resolved by the employer.\nDuring an investigation of a violation of sections 177.41 to 177.44 which the commissioner reasonably determines is likely to result in the finding of a violation of sections 177.41 to 177.44 and the issuance of a compliance order pursuant to section 177.27, subdivision 4, the commissioner may notify the contracting authority of the determination and the amount expected to be assessed and the contracting authority shall give the commissioner 90 days' prior notice of the date the contracting authority intends to make final payment.\nThis section does not apply to a contract, or work under a contract, under which:\n(1) the estimated total cost of completing the project is less than $2,500 and only one trade or occupation is required to complete it, or\n(2) the estimated total cost of completing the project is less than $25,000 and more than one trade or occupation is required to complete it.",
	"repealed": false
}