{
	"id": "145.929",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.929",
	"title": "145.929 HEALTH CARE GRANTS FOR THE UNINSURED.",
	"text": "(a) A dental provider is eligible for a grant under this section if:\n(1) the provider is a nonprofit organization not affiliated with a hospital or medical group that offers free or reduced-cost oral health care to low-income patients under the age of 21 with family incomes below 275 percent of the federal poverty guidelines who do not have insurance coverage for oral health care services;\n(2) the provider is eligible for critical access dental provider payments under section 256B.76, subdivision 4; and\n(3) more than 80 percent of the dental provider's patient encounters per year are with patients who are uninsured or covered by medical assistance or MinnesotaCare.\n(b) Grants shall be distributed by the commissioner of health to each eligible provider based on the proportion of that provider's number of low-income uninsured patients under the age of 21 served in the reporting year to the total number of low-income uninsured patients under the age of 21 served by all eligible providers, except that no single eligible provider shall receive less than two percent or more than 30 percent of the total appropriation provided under this subdivision. If the number of eligible providers is such that the minimum of two percent cannot be provided to each eligible provider, the commissioner shall limit eligibility for the subsidy to the top 20 eligible oral health providers.\nA community mental health program is eligible for a grant under this section if it is a community mental health center established under section 245.62, or a nonprofit community mental health clinic that is designated as an essential community provider under section 62Q.19, and the center or clinic offers free or reduced-cost mental health care to low-income patients under the age of 21 with family incomes below 275 percent of the federal poverty guidelines who do not have health insurance coverage. The grants shall be distributed by the commissioner of health to each eligible mental health center or clinic based on the proportion of that mental health center's or clinic's number of low-income uninsured patients under the age of 21 served in the reporting year to the total number of low-income uninsured patients under the age of 21 served by all mental health centers and clinics eligible for a grant under this subdivision, except that no single eligible provider shall receive less than two percent or more than 30 percent of the total appropriation provided under this subdivision.\n(a) The commissioner of health shall establish a grant program for hospitals for the purpose of defraying underpayments associated with the emergency medical assistance program. Grants shall be made for the services provided beginning July 1, 2014, to an individual who is enrolled in emergency medical assistance, and when an emergency medical assistance reimbursement claim is in excess of $50,000.\n(b) Hospitals seeking a grant from this program must submit an application that includes the number and dollar amount of hospital claims for emergency medical assistance in excess of $50,000 to the commissioner in a form prescribed by the commissioner. Grant payments shall be in proportion to the total hospital emergency medical assistance claims submitted by all applicant hospitals each state fiscal year. Claims for inpatient hospital, outpatient services, and hospital emergency department services shall be considered when determining the value of the grants.\nThe commissioner of health may use data submitted by organizations seeking a grant under this section, without further verification, for purposes of determining eligibility for a grant and allocating grant money among eligible organizations. The chief executive or chief financial officer must certify that the data submitted is accurate and that no changes were made in the organization's accounting and record-keeping practices or policies for providing free or reduced-cost care to uninsured patients for the purpose of creating eligibility or increasing the organization's allocation. The commissioner may audit or verify the data submitted. Grant funds must be used to defray the organization's costs of providing care and services to uninsured patients as identified under subdivision 1, 2, or 3. An organization must not receive more than one grant under subdivision 1, 2, or 3, even though the organization is potentially eligible for a grant under two or more subdivisions. Organizations eligible for a grant under this section may join together to submit a combined application provided the data submitted is certified by each individual organization.",
	"repealed": false
}