{
	"id": "3.922",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.922",
	"title": "3.922 INDIAN AFFAIRS COUNCIL.",
	"text": "The state Indian Affairs Council is created to consist of the following members:\n(1) one member of each of the following federally recognized tribes, designated by the elected tribal president or chairperson of the governing bodies of:\nthe Fond du Lac Band;\nthe Grand Portage Band;\nthe Mille Lacs Band;\nthe White Earth Band;\nthe Bois Forte (Nett Lake) Band;\nthe Leech Lake Band;\nthe Red Lake Nation;\nthe Upper Sioux Community;\nthe Lower Sioux Community;\nthe Shakopee Mdewakanton Sioux Community;\nthe Prairie Island Mdewakanton Dakota Community;\n(2) a member of the governor's official staff designated by the governor;\nthe commissioner of education;\nthe commissioner of human services;\nthe commissioner of natural resources;\nthe commissioner of human rights;\nthe commissioner of employment and economic development;\nthe commissioner of corrections;\nthe commissioner of the Minnesota Housing Finance Agency;\nthe commissioner of Iron Range resources and rehabilitation;\nthe commissioner of health;\nthe commissioner of transportation;\nthe commissioner of veterans affairs;\nthe commissioner of administration;\nEach of the commissioners listed in this clause may designate a staff member to serve on the council instead of the commissioner;\n(3) two members of the house of representatives, appointed by the speaker; and\n(4) two members of the senate, appointed by its Subcommittee on Committees.\nMembers appointed to represent the house of representatives or the senate shall no longer serve on the council when they are no longer members of the bodies which they represent and their offices shall be vacant. A member who is a designee of a tribal president or chairperson shall cease to be a member at the end of the term of the designating tribal president or chairperson. Only members of the council designated under clause (1) shall vote.\n[Repealed by amendment, 2007 c 130 s 1]\nCompensation of members appointed under subdivision 1, clause (1), is as provided in section 15.0575. Because the council performs functions that are not purely advisory, the expiration dates provided in section 15.059 do not apply. Expenses of the council must be approved by two of any three members of the council designated by the council and then be paid in the same manner as other state expenses. The chair shall inform the commissioner of management and budget in writing of the names of the persons authorized to approve expenses.\nMeetings may be called by the chair or at the written request of five members of the council. A majority of the voting members of the council is a quorum.\nThe council shall annually elect a chair and other officers as it may deem necessary. The chair may appoint subcommittees necessary to fulfill the duties of the council. It shall also employ and prescribe the duties of employees and agents as it deems necessary at the direction of elected tribal leaders. The compensation of the executive director of the council is as provided by section 43A.18. All employees are in the unclassified service. Appropriations and other funds of the council are subject to chapter 16C. The council may contract in its own name. Contracts must be approved by a majority of the members of the council with the approval of elected tribal leaders and executed by the chair and the executive director. The council may apply for, receive, and spend in its own name, grants and gifts of money consistent with the powers and duties specified in this section. The council shall maintain its primary office in Bemidji. It shall also maintain personnel and office space in St. Paul.\nThe primary duties of the council are to:\n(1) analyze and make recommendations to tribal elected leaders and to members of the legislature and the governor on legislation and information on programs, proposals, and projects of importance to tribal governments and nontribal Indian organizations;\n(2) assist in establishing Indian advisory councils in cooperation with state agencies that deliver services to the federally recognized tribes in Minnesota and the urban Indian communities;\n(3) assist state agencies in defining what groups, organizations, committees, councils, or individuals are eligible for delivery of their respective services;\n(4) assist in ensuring the provision of resources and the delivery of services to the federally recognized tribes in Minnesota and the urban Indian communities;\n(5) recommend to tribal governments and the state government the means to enhance the delivery of services to the members of federally recognized tribes in Minnesota by local, state, and national units of government;\n(6) assist state agencies in implementing and updating studies of services delivered to the federally recognized tribes in Minnesota and urban Indian communities;\n(7) provide, for the benefit of all levels of state government, a continuing liaison between state governmental bodies and elected tribal leaders;\n(8) interact with private organizations involved with Indian people that develop and implement programs to assist Indian people, when such programs may affect state agencies and departments;\n(9) develop educational programs, community organization programs, leadership development programs, motivational programs, and business development programs for Indian persons who have been, are, or may be subject to prejudice and discrimination;\n(10) review data provided by the commissioner of children, youth, and families under section 260C.215, subdivision 5, and present recommendations to elected tribal leaders on the out-of-home placement of Indian children; and\n(11) prepare a proposed agenda for the annual summit of elected tribal leaders, legislative leaders, and the governor.\nIn carrying out these objectives and to ascertain the needs of members of federally recognized tribes in Minnesota and urban Indian community members, the council shall have the right to confer with state officials and other governmental units and have access to records as necessary to obtain needed information. The council also shall have the right to call upon various state departments for technical advice and service as needed to fulfill its purposes.\nAn advisory board on urban Indians shall advise the council on the unique problems and concerns of Minnesota Indians who reside in urban areas of the state. The board must be appointed by the council at the direction of the elected tribal leadership and consist of six Indians residing in the vicinity of Minneapolis, St. Paul, Bemidji, and Duluth. At least one member of the board must be a resident of each city. The terms, compensation, and removal of members are as provided in section 15.059.\n[Repealed, 1997 c 7 art 2 s 67]\nNotwithstanding other law, the council does not have authority to adopt, amend, or repeal rules or to adjudicate contested cases or appeals. Rules adopted before July 1, 2001, may continue in effect until amended or repealed by law.\nThe council shall prepare and submit a report to the governor and legislature by November 15 of each year. The report shall summarize the activities of the council since its last report, list receipts and expenditures, identify the major problems and issues confronting American Indian people, make recommendations to address issues, and list the specific objectives that the council seeks to attain during the biennium. The council shall report on outcome measures.",
	"repealed": false
}