{
	"id": "219.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.055",
	"title": "219.055 INCIDENT EMERGENCY RESPONSE; PREPAREDNESS AND INFORMATION.",
	"text": "(a) The definitions in section 115E.01 apply to this section except as otherwise provided in this subdivision. For purposes of this section, the following terms have the meanings given.\n(b) \"Applicable emergency manager\" means an emergency manager having jurisdiction along the routes over which oil or other hazardous substance cargo is transported by a rail carrier.\n(c) \"Applicable fire department officer\" means a fire chief or other senior officer of a fire department having jurisdiction along the routes over which oil or other hazardous substance cargo is transported by a rail carrier.\n(d) \"Emergency manager\" means the director of a local organization for emergency management under section 12.25.\n(e) \"Hazardous substance\" means any material identified in the definition of hazardous substance under section 115B.02, subdivision 8, or Code of Federal Regulations, title 49, section 171.8.\n(f) \"Incident commander\" means the official who has responsibility under National Incident Management System guidelines for all aspects of emergency response operations at an incident scene.\n(g) \"Rail carrier\" means a railroad company that:\n(1) is defined as a common carrier under section 218.011, subdivision 10;\n(2) is classified by federal law or regulation as a Class I railroad, Class I rail carrier, Class II railroad, Class II rail carrier, Class III railroad, or Class III rail carrier; and\n(3) operates unit trains or a train with at least one rail car carrying oil or hazardous substance cargo in this state.\n(h) \"Unit train\" has the meaning given in section 115E.01, subdivision 11d.\nWithin ten business days of receiving a written request, a rail carrier must provide a traffic review to the commissioner of public safety, a requesting emergency manager, or a fire chief having jurisdiction along the routes over which oil or other hazardous substances are transported. The traffic review under this subdivision must include information on the types and volumes of oil or other hazardous substances transported through the requester's jurisdiction during the prior calendar year.\n(a) Each railroad must offer training to each fire department and each local organization for emergency management under section 12.25 having jurisdiction along routes over which the railroad transports oil or other hazardous substances. Refresher training must be offered to each fire department and local organization for emergency management at least once every three years after initial training under this subdivision.\n(b) The training must address methods to identify rail cars and hazardous substance contents, responder safety issues, rail response tactics, public notification and evacuation considerations, environmental contamination response, railroad response personnel and resources coordination at an incident, and other protocols and practices for safe initial local response as required under section 115E.042, subdivision 4, including the notification requirements and the responsibilities of an incident commander during a rail incident involving oil or other hazardous substances, as provided in section 115E.042, subdivisions 3 and 4.\nUpon written request, a rail carrier must provide to the commissioner of public safety, an emergency manager, or a fire chief having jurisdiction along the routes over which oil or other hazardous substances are transported:\n(1) a complete copy of prevention and response plans submitted under section 115E.042, subdivision 6; and\n(2) a copy of the data and information, including risk assessment information, used to develop the rail carrier's route analysis as required under Code of Federal Regulations, title 49, section 172.820, or successor requirements.\n(a) Each railroad must communicate at least annually with each applicable emergency manager, safety representatives of railroad employees governed by the Railway Labor Act, and each applicable fire department officer along the routes over which oil or other hazardous substances are transported, in order to:\n(1) ensure coordination of emergency response activities between the railroad and local responders;\n(2) assist emergency managers in identifying and assessing local rail-specific threats, hazards, and risks; and\n(3) assist railroads in obtaining information from emergency managers regarding specific local natural and technical hazards and threats in the local area that may impact rail operations or public safety.\n(b) The coordination under paragraph (a), clauses (2) and (3), must include identification of increased risks and potential special responses due to high population concentration, critical local infrastructure, key facilities, significant venues, sensitive natural environments, and other factors identified by railroads, emergency managers, and fire departments.\n(c) The commissioner of public safety must compile and make available to railroads a list of applicable emergency managers and applicable fire chiefs, which must include contact information. The commissioner must make biennial updates to the list of emergency managers and fire chiefs and make the list of updated contact information available to railroads.\n(a) Within 30 days of receiving a written request, a rail carrier must be available to meet with the commissioner of public safety, a requesting emergency manager, or a fire chief having jurisdiction along the routes over which oil or other hazardous substances are transported concerning emergency response planning and coordination.\n(b) At a meeting held under this subdivision, a rail carrier must provide:\n(1) a review of the rail carrier's emergency response planning and capability, including railroad response timelines and resources to provide:\n(i) technical advice and recommendations;\n(ii) trained response personnel;\n(iii) specialized equipment; and\n(iv) any other available resources to support an incident commander who conducts a public safety emergency response under the National Incident Management System; and\n(2) inventory information on emergency responses involving oil or other hazardous substances, consisting of:\n(i) equipment owned by the rail carrier, including equipment type and location;\n(ii) the rail carrier's response personnel, including contact information and location; and\n(iii) resources available to the rail carrier through contractual agreements.\n(a) The commissioner of public safety must, through the Minnesota Fusion Center, receive and disseminate emergency response information as provided through the AskRail application or other wireless communication device application described in paragraphs (b) and (c) under section 7302 of the FAST Act of 2015, Public Law 114-94, and federal regulations adopted under that section.\n(b) By July 1, 2024, the state fire marshal and the Division of Homeland Security and Emergency Management, along with interested emergency management organizations and fire chiefs, may encourage the adoption of the AskRail application or other wireless communication device application for incorporation into emergency response capabilities and to provide information on the transportation of oil or other hazardous substances by rail.\n(c) On and after July 1, 2024, all rail carriers subject to this section and section 115E.042 must collectively provide information on the transportation of oil or other hazardous substances in a digital format through a wireless communication device application.\n(d) By March 1, 2025, the commissioner of public safety must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation and public safety policy and finance regarding the effectiveness of efforts to adopt the AskRail application or other wireless communication device application required under paragraph (c).\n(a) For purposes of this subdivision, \"tabletop exercise\" and \"full-scale exercise\" have the meanings given in section 115E.042, subdivision 1a.\n(b) By July 1, 2025, each rail carrier, upon request, must conduct one tabletop public safety emergency exercise in each emergency management region, as established by the Division of Homeland Security and Emergency Management, where the rail carrier transports oil or other hazardous substances. After July 1, 2025, each rail carrier, upon request, must conduct one tabletop public safety emergency exercise every two years and must alternate emergency management regions where the exercise is conducted.\n(c) Exercises conducted by a railroad under this subdivision must include at least one representative from the Department of Public Safety, the regional program coordinator from the Division of Homeland Security and Emergency Management where the exercise is conducted, local emergency management organizations, fire departments, and local units of government that each have jurisdiction along the routes over which oil or hazardous substances are transported by railroad. Each exercise conducted under this subdivision must be attended by safety representatives of railroad employees governed by the Railway Labor Act, United States Code, title 45, section 151, et seq.\n(d) To the extent feasible, a rail carrier may conduct tabletop public safety exercises concurrently with the exercises required in subdivision 7.\n(e) If the commissioner of the Pollution Control Agency requires a rail carrier to conduct a tabletop public safety emergency response exercise as part of the annual exercise requirements in section 115E.042, subdivision 5, the rail carrier is not required to conduct an additional public safety emergency response exercise in the emergency management region where the exercise took place for that calendar year. If a rail carrier opts to conduct a full-scale exercise, the rail carrier is not required to conduct an additional tabletop public safety emergency exercise in that calendar year if the tabletop exercise occurs after the full-scale exercise is completed.\n(a) For purposes of this subdivision, \"tabletop exercise\" and \"full-scale exercise\" have the meanings given in section 115E.042, subdivision 1a.\n(b) By July 1, 2025, each rail carrier, upon request, must conduct one tabletop incident commander response site exercise in each emergency management region, as established by the Division of Homeland Security and Emergency Management, where the rail carrier transports oil or other hazardous substances. After July 1, 2025, each rail carrier, upon request, must conduct one tabletop incident commander response site exercise every two years and must alternate emergency management regions where the exercise is conducted.\n(c) Exercises conducted by a railroad under this subdivision must include at least one representative from the Department of Public Safety, the regional program coordinator from the Division of Homeland Security and Emergency Management where the exercise is being conducted, local emergency management organizations, fire departments, and local units of government that each have jurisdiction along the routes over which oil or hazardous substances are transported by railroad. Each exercise conducted under this subdivision must be attended by safety representatives of railroad employees governed by the Railway Labor Act, United States Code, title 45, section 151, et seq.\n(d) To the extent feasible, a rail carrier may conduct tabletop incident commander response site exercises concurrently with the exercises required in subdivision 6.\n(e) If the commissioner of the Pollution Control Agency requires a rail carrier to conduct a tabletop incident commander response site exercise as part of the annual exercise requirements in section 115E.042, subdivision 5, the rail carrier is not required to conduct an additional exercise in the emergency management region where the exercise took place for that calendar year.\n(a) For purposes of this subdivision, \"full-scale exercise\" has the meaning given in section 115E.042, subdivision 1a.\n(b) On and after July 1, 2023, each Class I railroad, Class I rail carrier, Class II railroad, or Class II rail carrier must, upon request, conduct a full-scale exercise every five years. Upon notification by the commissioner of public safety or the commissioner of the Pollution Control Agency, a Class III railroad or Class III rail carrier that transports oil or other hazardous substances by rail in Minnesota must participate in the full-scale exercise if the exercise occurs in the emergency management region along the routes where the Class III railroad or Class III rail carrier transports oil or other hazardous substances. To the extent feasible, a rail carrier may not conduct consecutive full-scale exercises in the same emergency management region.\n(c) A full-scale exercise must be conducted under the time limits provided for a response to a confirmed discharge of oil or hazardous substances under section 115E.042, subdivision 4. The administration of a full-scale exercise must be conducted under the requirements of section 115E.042, subdivision 5, paragraphs (c) and (d). If the commissioner of the Pollution Control Agency requires a rail carrier to participate in a full-scale exercise as provided under section 115E.042, subdivision 5, a rail carrier may conduct the full-scale exercise with any other rail carrier that carries oil or hazardous substances in the emergency management region where the full-scale exercise is to take place.\n(d) Each full-scale exercise conducted under this section must be attended by safety representatives of railroad employees governed by the Railway Labor Act, United States Code, title 45, section 151, et seq.\n(e) A rail carrier must provide by telephone a qualified company representative with knowledge of the rail carrier's response resources during the exercises.\n(a) Any data provided under subdivisions 2 to 8 to an emergency manager, incident commander, emergency first responder, fire chief, or the commissioner of public safety are nonpublic data, as defined under section 13.02, subdivision 9.\n(b) Any prevention and response plan data created under section 115E.042, subdivision 6, that is in the possession of an emergency manager, incident commander, emergency first responder, or fire chief are nonpublic data, as defined in section 13.02, subdivision 9.",
	"repealed": false
}