{
	"id": "260C.325",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.325",
	"title": "260C.325 GUARDIAN.",
	"text": "(a) When the court terminates parental rights of both parents or of the only known living legal parent, the court shall order the guardianship of the child to:\n(1) the commissioner of children, youth, and families;\n(2) a licensed child-placing agency; or\n(3) an individual who is willing and capable of assuming the appropriate duties and responsibilities to the child.\n(b) The court shall order guardianship of a child to the commissioner of children, youth, and families when the responsible county social services agency had legal responsibility for planning for the permanent placement of the child and the child was in foster care under the legal responsibility of the responsible county social services agency at the time the court orders guardianship to the commissioner. The court shall not order guardianship to the commissioner under any other circumstances, except as provided in subdivision 3.\n[Repealed, 2001 c 178 art 1 s 43]\n(a) If upon petition for guardianship by a reputable person, including but not limited to the responsible social services agency as agent of the commissioner of children, youth, and families, and upon hearing in the manner provided in section 260C.163, the court finds that both parents or the only known legal parent are or is deceased and no appointment has been made or petition for appointment filed pursuant to sections 524.5-201 to 524.5-317, the court shall order the guardianship of the child transferred to:\n(1) the commissioner of children, youth, and families; or\n(2) an individual who is willing and capable of assuming the appropriate duties and responsibilities to the child.\n(b) The court shall order guardianship of a child to the commissioner of children, youth, and families only if there is no individual who is willing and capable of assuming the appropriate duties and responsibilities to the child.\n(a) A guardian appointed under this section has legal custody of the child and the right to visit the child in foster care, the adoptive placement, or any other suitable setting at any time prior to finalization of the adoption of the child. When the child is under the guardianship of the commissioner, the responsible social services agency, as agent of the commissioner, has the right to visit the child.\n(b) When the guardian is a licensed child-placing agency, the guardian shall make all major decisions affecting the child, including, but not limited to, giving consent, when consent is legally required, to the marriage, enlistment in the armed forces, medical, surgical, or psychiatric treatment, or adoption of the child.\n(c) When the commissioner is appointed guardian, the duties of the commissioner of children, youth, and families are established under sections 260C.601 to 260C.635.\n(d) A guardianship created under this section shall not include the guardianship of the estate of the child.\n(e) The commissioner of children, youth, and families, through the responsible social services agency, or a licensed child-placing agency who is a guardian or who has authority and responsibility for planning for the adoption of the child under section 259.25 or 259.47, has the duty to make reasonable efforts to finalize the adoption of the child.",
	"repealed": false
}