{
	"id": "515B.4-116",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.4-116",
	"title": "515B.4-116 RIGHTS OF ACTION; ATTORNEY'S FEES.",
	"text": "(a) In addition to any other rights to recover damages, attorney's fees, costs or expenses, whether authorized by this chapter or otherwise, if a declarant, an association, or any other person violates any provision of this chapter, or any provision of the declaration, bylaws, or rules and regulations any person or class of persons adversely affected by the failure to comply has a claim for appropriate relief. Subject to the requirements of section 515B.3-102, the association shall have standing to pursue claims on behalf of the unit owners of two or more units.\n(b) The court may award reasonable attorney's fees and costs of litigation to the prevailing party. Punitive damages may be awarded for a willful failure to comply.\n(c) As a condition precedent to any construction defect claim, the parties to the claim must submit the matter to mediation before a mutually agreeable neutral third party. For the purposes of this section, mediation has the meaning given under the General Rules of Practice, rule 114.02 (7). If the parties are not able to agree on a neutral third-party mediator from the roster maintained by the Minnesota Supreme Court, the parties may petition the district court in the jurisdiction in which the common interest community is located to appoint a mediator. The applicable statute of limitations and statute of repose for an action based on breach of a warranty imposed by this section, or any other action in contract, tort, or other law for any injury to real or personal property or bodily injury or wrongful death arising out of the alleged construction defect, is tolled from the date that any party makes a written demand for mediation under this section until the latest of the following:\n(1) five business days after mediation is completed; or\n(2) 180 days.\nNotwithstanding the foregoing, mediation shall not be required prior to commencement of a construction defect claim if the parties have completed home warranty dispute resolution under section 327A.051.\n(d) The remedies provided for under this chapter are not exclusive and do not abrogate any remedies under other statutes or the common law, notwithstanding whether those remedies are referred to in this chapter.",
	"repealed": false
}