{
	"id": "383B.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.32",
	"title": "383B.32 UNCLASSIFIED AND CLASSIFIED SERVICE.",
	"text": "The officers and employees of the county of Hennepin and all of its agencies, boards, commissions, authorities, or committees heretofore or hereafter created, supported in whole or in part by the taxation of the county of Hennepin, come within the provisions of sections 383B.26 to 383B.42, and the positions are hereby divided into the unclassified and classified service.\n(a) The unclassified service comprises:\n(1) officers chosen by election or appointment to fill an elective office;\n(2) members of boards and commissions appointed by the county board;\n(3) physicians, medical residents, interns, and students in training;\n(4) nonsalaried attending medical staff;\n(5) special sheriff's deputies serving without pay;\n(6) seasonal, temporary, provisional, intermittent, and emergency positions;\n(7) positions funded by specific governmental or nongovernmental grants of intermittent or limited funding duration;\n(8) the director or principal administrative officer of a department appointed pursuant to sections 383B.101 to 383B.103; or appointed by the county board; or appointed for a term pursuant to law;\n(9) chief deputy or principal assistant and secretary for each elected official;\n(10) examiner of titles and deputy examiners;\n(11) chief public safety services deputy sheriff, a chief adult detention and court services deputy sheriff, a chief administrative deputy sheriff, a chief community relations deputy sheriff, and a chief investigations deputy sheriff;\n(12) public defender;\n(13) county medical examiner;\n(14) office staff appointed by the county administrator pursuant to sections 383B.101 to 383B.103; and\n(15) county administrator.\n(b) Notwithstanding any contrary provision of other law, any person coming within paragraph (a), clause (8), who, on August 1, 2000, is in the classified service, remains in the classified service until vacating the position. After that, an appointee to a position described in paragraph (a), clause (8), is in the unclassified service.\nThe human resources director shall establish a compensation plan in accordance with section 383B.31, paragraph (c), clause (2), for those employees in the unclassified service identified in subdivision 2, paragraph (a), clauses (3), (4), (6), (8), (9), (10), (11), (13), and (14).\nThe positions in the unclassified service enumerated in subdivision 2, paragraph (a), clauses (3), (4), (8), (9), (10), (11), (13), and (14), shall not have permanent tenure but shall have all other benefits provided for in sections 383B.26 to 383B.42. The term of office of any position established by another statute shall be as provided in it.\nNotwithstanding any contrary provision of other law, the board may, by rule, establish an employee benefit system for certain managerial classifications as identified by the director and approved by the board and county board which may differ from those for other county employees.\nThe classified service shall include all other positions now existing or hereafter created and all employees holding such positions unless specifically placed in the unclassified service by sections 383B.32 to 383B.46. The provisions of section 393.07, subdivision 5, are hereby superseded insofar as they may be inconsistent.",
	"repealed": false
}