{
	"id": "103C.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.201",
	"title": "103C.201 FORMING SOIL AND WATER CONSERVATION DISTRICTS.",
	"text": "(a) A petition must be signed by at least 50 resident owners in an area proposed to be organized into a district and filed with the state board requesting that a soil and water conservation district be organized to function in the area described in the petition. The petition must state:\n(1) the proposed name of the district;\n(2) that there is need, in the interest of the public health, safety, and welfare, for a district in the described area;\n(3) a description of the area proposed to be organized as a district, which need not be by metes and bounds or legal subdivision, but may be by general description that identifies the area;\n(4) a request that the state board define the boundaries for the district;\n(5) a request for a referendum to be held in the defined territory on the question of the creation of a district in the territory; and\n(6) a request by the state board to determine that a district be established.\n(b) If more than one petition is filed covering parts of the same area, the state board may consolidate the petitions.\n(a) By 30 days after a petition has been filed with the state board, the state board may give due notice of a proposed hearing, to be held by the state board or a designated agent, on:\n(1) the question of the desirability and necessity, in the interest of the public health, safety, and welfare, for the establishment of a district;\n(2) the appropriate boundaries of the district;\n(3) the propriety of the petition and other proceedings taken under this section; and\n(4) other questions relevant to clauses (1), (2), and (3).\n(b) Residents in the area described in the petition and in the area considered for addition to the described area and other interested parties may attend the hearing and be heard. If after a hearing, the state board determines it may be desirable to include in the proposed district area outside the area where notice of the hearing was given, the hearing must be adjourned and due notice of the continued hearing must be given throughout the entire area considered for inclusion in the district, and the continued hearing held.\n(a) After the hearing is complete, if the state board determines, on the information presented at the hearing and other relevant information, that there is a need, in the interest of the public health, safety, and welfare, for a district to function in the area considered at the hearing, the state board shall make and record the determination and define the district boundaries by metes and bounds or by legal subdivisions. In making the determination and in defining the boundaries, the state board shall consider the public policy in section 103C.005, and:\n(1) the topography of the area considered and of the state;\n(2) the composition of its soils;\n(3) the distribution of erosion;\n(4) the prevailing land use practices;\n(5) the desirability and necessity of including within the boundaries the particular lands under consideration;\n(6) the benefits the lands may receive from being included;\n(7) the relation of the proposed area to existing watersheds and agricultural regions and other soil and water conservation districts organized or proposed for organization; and\n(8) other relevant physical, geographical, and economic factors.\n(b) The area included in a district need not be contiguous.\n(a) If the state board determines, after the hearing and consideration of the information, that there is not a need for a district to function in the area, the state board must make and record the determination and deny the petition.\n(b) Subsequent petitions to establish a district in substantially the same area may not be filed until six months after the date of the denial of a petition.\n(a) After the state board has made and recorded a determination that there is a need for a district in a particular area and has defined the boundaries, the state board shall consider whether the operation of a district within the boundaries is administratively feasible. To assist the state board to determine the feasibility, the state board shall schedule the referendum at the next general election and shall cooperate with county election officials to accomplish the election in the most expedient manner.\n(b) The question shall be submitted by ballots with:\n(1) the words printed \"For creation of a soil and water conservation district of the lands described below in the county (or counties) of ........... and ..........\" and \"Against establishment of a soil and water conservation district of the lands described below in the county (or counties) of ........ and ........\";\n(2) a square before each proposition and a direction to insert an X mark in the square before one proposition or the other as the voter may favor or oppose establishment of the district; and\n(3) the boundaries of the proposed district.\n(c) Only eligible voters residing within the boundaries of the proposed district may vote in the referendum.\nThe state board shall pay the expenses for the notices and the conduct of the hearing. The state board shall schedule the referendum at the next general election and shall cooperate with county election officials to accomplish the election in the most expedient manner. Informalities in the conduct of a referendum or in a matter related to it do not invalidate the referendum or its result if notice of it has been given substantially as provided by this section and the referendum has been fairly conducted.\n(a) The state board shall publish the result of the referendum and then determine whether the operation of a district in the defined boundaries is administratively feasible. In making the determination, the state board must consider the policy in section 103C.005, and:\n(1) the attitudes of the land occupiers in the defined boundaries;\n(2) the number of eligible voters who voted in the referendum;\n(3) the proportion of the votes cast in the referendum in favor of establishing the district to the total number of votes cast;\n(4) the approximate wealth and income of the land occupiers of the proposed district;\n(5) the probable expense of carrying on erosion-control operations and related water quality improvements within the district; and\n(6) other relevant economic and social factors. The state board may not determine that the operation of the proposed district within the defined boundaries is administratively feasible unless a majority of the votes cast in the referendum on establishment of the district have been cast in favor of establishing the district.\n(b) If the state board determines that the operation of the district is not administratively feasible, the state board shall record the determination and deny the petition. Six months after the date of entry of a determination by the state board that operation of a proposed district is not administratively feasible, a new petition may be filed and a new proceeding started.\n(c) If the state board determines that the operation of the district is administratively feasible, it shall record the determination and proceed with the establishment and organization of the district.\n(a) The district shall be a governmental subdivision of this state and a public body corporate and politic after the actions in this subdivision are taken.\n(b) If the state board determines that the operation of the proposed district within the defined boundaries is administratively feasible, the state board must appoint supervisors to act as the district board within 30 days after the district is established. A majority of the supervisors' terms must expire after the next general election following the supervisors' appointments and the remaining supervisors' terms expire after the second general election following the supervisors' appointments.\n(c) The appointed supervisors shall sign and present an application to the secretary of state with the following recitals:\n(1) a petition for the establishment of a district was filed with the state board;\n(2) the proper proceedings were taken relating to the petition;\n(3) the application is being filed to complete the organization of the district as a governmental subdivision and a public body, corporate or politic;\n(4) the state board has appointed the signers as supervisors;\n(5) the name and official residence of each supervisor, with a certified copy of the supervisor's appointment;\n(6) the term of office of each supervisor;\n(7) the name proposed for the district; and\n(8) the location of the principal office of the district board.\n(d) The application shall be subscribed and sworn to by each supervisor before an officer authorized by state law to take oaths. The officer shall certify upon the application that the officer has personal knowledge of the supervisors, that they are the supervisors named in the application, and that each supervisor has signed the application in the officer's presence.\n(a) The application shall be accompanied by a certified statement of recitals by the state board, that:\n(1) a petition was filed, notice issued, and hearing held;\n(2) the state board determined that there is need, in the interest of the public health, safety, and welfare, for a district to function in the proposed area;\n(3) the state board defined the district's boundaries;\n(4) notice was given and a referendum held on the question of establishing a district;\n(5) a majority of the votes cast in the referendum were in favor of establishing a district; and\n(6) after the referendum the state board determined that the operation of the proposed district is administratively feasible.\n(b) The certified statement shall prescribe the boundaries of the district as defined by the state board.\n(a) The secretary of state shall examine the application of the supervisors and certified statement of the state board and, on finding that the name proposed for the district is not identical to the name of another district in the state, and is not so similar as to lead to confusion or uncertainty, the secretary of state shall receive, file, and record the application and statement.\n(b) If the secretary of state finds that the name proposed for the district is identical with the name of another district, or so similar as to lead to confusion and uncertainty, the secretary of state shall certify the fact to the state board. The state board shall submit to the secretary of state a new name for the district that does not have the defect. Upon receipt of a new name, free of defect, the secretary of state shall record the application and statement, with the new name.\n(c) After the application and statement have been made, filed, and recorded, the district is a governmental subdivision of the state.\n(d) The secretary of state shall issue to the supervisors a certificate, under the seal of the state, of the organization of the district and record the certificate with the application and statement.\n(e) The boundaries of the district consist of the area determined by the state board but may not include area in another district. The area of a home rule charter or statutory city within the boundaries of a district is included in the district. If there is a question of whether an area is within or outside of a district, the state board shall determine whether the area of a city is included.\nIn a suit, action, or proceeding involving the validity of, enforcement of, or relating to, a contract, proceeding, or action of a district, the district is considered to have been established in accordance with this section upon proof of the issuance of the certificate by the secretary of state. A copy of the certificate, certified by the secretary of state, is admissible in evidence in the suit, action, or proceeding and is proof of its filing and contents.",
	"repealed": false
}