{
	"id": "144.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.225",
	"title": "144.225 DISCLOSURE OF INFORMATION FROM VITAL RECORDS.",
	"text": "Except as otherwise provided for in this section and section 144.2252, information contained in vital records shall be public information. Physical access to vital records shall be subject to the supervision and regulation of the state registrar and employees pursuant to rules promulgated by the commissioner in order to protect vital records from loss, mutilation or destruction and to prevent improper disclosure of vital records which are confidential or private data on individuals, as defined in section 13.02, subdivisions 3 and 12.\n(a) Except as otherwise provided in this subdivision, data pertaining to the birth of a child to a woman who was not married to the child's father when the child was conceived nor when the child was born, including the original record of birth and the certified vital record, are confidential data. At the time of the birth of a child to a woman who was not married to the child's father when the child was conceived nor when the child was born, the mother may designate demographic data pertaining to the birth as public. Notwithstanding the designation of the data as confidential, it may be disclosed:\n(1) to a parent or guardian of the child;\n(2) to the child when the child is 16 years of age or older, except as provided in clause (3);\n(3) to the child if the child is a homeless youth;\n(4) under paragraph (b), (e), or (f); or\n(5) pursuant to a court order. For purposes of this section, a subpoena does not constitute a court order.\n(b) Data pertaining to the birth of a child that are not accessible to the public become public data if 100 years have elapsed since the birth of the child who is the subject of the data, or as provided under section 13.10, whichever occurs first.\n(c) If a child is adopted, data pertaining to the child's birth are governed by the provisions relating to adoption and birth records, including sections 13.10, subdivision 5; 144.218, subdivision 1; and 144.2252.\n(d) The name and address of a mother under paragraph (a) and the child's date of birth may be disclosed to the county social services, Tribal health department, or public health member of a family services collaborative for purposes of providing services under section 142D.15.\n(e) The commissioner of human services shall have access to birth records for: the purposes of administering medical assistance and the MinnesotaCare program; and other public health purposes as determined by the commissioner of health.\n(f) Tribal child support programs shall have access to birth records for child support enforcement purposes.\n(g) The commissioner of children, youth, and families shall have access to birth records for child support enforcement purposes and other public health purposes as determined by the commissioner of health.\nInformation from which an identification of risk for disease, disability, or developmental delay in a mother or child can be made, that is collected in conjunction with birth registration or fetal death reporting, is private data as defined in section 13.02, subdivision 12. The commissioner may disclose to a tribal health department or community health board, as defined in section 145A.02, subdivision 5, health data associated with birth registration which identifies a mother or child at high risk for serious disease, disability, or developmental delay in order to assure access to appropriate health, social, or educational services. Notwithstanding the designation of the private data, the commissioner of human services shall have access to health data associated with birth registration for:\n(1) purposes of administering medical assistance and the MinnesotaCare program; and\n(2) for other public health purposes as determined by the commissioner of health.\nNotwithstanding the designation of certain of this data as confidential under subdivision 2 or private under subdivision 2a, the commissioner shall give the commissioners of human services and children, youth, and families access to birth record data and data contained in recognitions of parentage prepared according to section 257.75 necessary to enable the commissioners of human services and children, youth, and families to identify a child who is subject to threatened injury, as defined in section 260E.03, subdivision 23, by a person responsible for the child's care, as defined in section 260E.03, subdivision 17. The commissioners shall be given access to all data included on official birth records.\nNo person shall prepare or issue any vital record which purports to be an original, certified copy, or copy of a vital record except as authorized in sections 144.211 to 144.227 or the rules of the commissioner.\nThe state registrar may permit persons performing medical research access to the information restricted in subdivision 2 or 2a if those persons agree in writing not to disclose private or confidential data on individuals.\nWhen a resident of another state is born or dies in this state, the state registrar shall send a report of the birth or death to the state of residence.\n(a) Except as otherwise provided in this subdivision, the named identity of a group purchaser as defined in section 62J.03, subdivision 6, collected in association with birth registration is nonpublic data as defined in section 13.02.\n(b) The commissioner may publish, or by other means release to the public, the named identity of a group purchaser as part of an analysis of information collected from the birth registration process. Analysis means the identification of trends in prenatal care and birth outcomes associated with group purchasers. The commissioner may not reveal the named identity of the group purchaser until the group purchaser has had 21 days after receipt of the analysis to review the analysis and comment on it. In releasing data under this subdivision, the commissioner shall include comments received from the group purchaser related to the scientific soundness and statistical validity of the methods used in the analysis. This subdivision does not authorize the commissioner to make public any individual identifying data except as permitted by law.\n(c) A group purchaser may contest whether an analysis made public under paragraph (b) is based on scientifically sound and statistically valid methods in a contested case proceeding under sections 14.57 to 14.62, subject to appeal under sections 14.63 to 14.68. To obtain a contested case hearing, the group purchaser must present a written request to the commissioner before the end of the time period for review and comment. Within ten days of the assignment of an administrative law judge, the group purchaser must demonstrate by clear and convincing evidence the group purchaser's likelihood of succeeding on the merits. If the judge determines that the group purchaser has made this demonstration, the data may not be released during the contested case proceeding and through appeal. If the judge finds that the group purchaser has not made this demonstration, the commissioner may immediately publish, or otherwise make public, the nonpublic group purchaser data, with comments received as set forth in paragraph (b).\n(d) The contested case proceeding and subsequent appeal is not an exclusive remedy and any person may seek a remedy pursuant to section 13.08, subdivisions 1 to 4, or as otherwise authorized by law.\n(a) The state registrar or local issuance office shall issue a certified birth or death record or a statement of no vital record found to an individual upon the individual's proper completion of an attestation provided by the commissioner and payment of the required fee:\n(1) to a person who is:\n(i) the subject of the vital record;\n(ii) a child of the subject;\n(iii) the spouse of the subject;\n(iv) a parent of the subject;\n(v) the grandparent or grandchild of the subject;\n(vi) if the requested record is a death record, a sibling of the subject;\n(vii) the legal custodian, guardian or conservator, or health care agent of the subject;\n(viii) a personal representative, by sworn affidavit of the fact that the certified copy is required for administration of the estate;\n(ix) a successor of the subject, as defined in section 524.1-201, if the subject is deceased, by sworn affidavit of the fact that the certified copy is required for administration of the estate;\n(x) if the requested record is a death record, a trustee of a trust by sworn affidavit of the fact that the certified copy is needed for the proper administration of the trust;\n(xi) a person or entity who demonstrates that a certified vital record is necessary for the determination or protection of a personal or property right, pursuant to rules adopted by the commissioner; or\n(xii) an adoption agency in order to complete confidential postadoption searches as required by section 259.83;\n(2) to any local, state, tribal, or federal governmental agency upon request if the certified vital record is necessary for the governmental agency to perform its authorized duties;\n(3) to an attorney representing the subject of the vital record or another person listed in clause (1), upon evidence of the attorney's license;\n(4) pursuant to a court order issued by a court of competent jurisdiction. For purposes of this section, a subpoena does not constitute a court order; or\n(5) to a representative authorized by a person under clauses (1) to (4).\n(b) The state registrar or local issuance office shall also issue a certified death record to an individual described in paragraph (a), clause (1), items (ii) to (xi), if, on behalf of the individual, a licensed mortician furnishes the registrar with a properly completed attestation in the form provided by the commissioner within 180 days of the time of death of the subject of the death record. This paragraph is not subject to the requirements specified in Minnesota Rules, part 4601.2600, subpart 5, item B.\nThe commissioner shall maintain a standardized format for certified birth records and death records issued by the state registrar and local issuance offices. The format shall incorporate security features in accordance with this section.",
	"repealed": false
}