{
	"id": "48A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/48A.07",
	"title": "48A.07 TRUST COMPANY OR BANK; SPECIAL POWERS AND DUTIES AS FIDUCIARY.",
	"text": "A trust company, or bank that holds a certificate as provided in section 48.37, may exercise the powers and privileges set forth in this section.\n(a) The bank or trust company may take and hold in trust any real or personal property, wherever situated, by order, judgment, or decree of a court, or by gift, grant, assignment, transfer, devise, legacy, or bequest from, or by lawful contract with, a public or private corporation or an individual or copartnership. It may manage this real or personal property upon the terms and conditions declared or imposed.\n(b) The bank or trust company may act as agent for the signatures, countersignatures, registration, transfer, or redemption of certificates of stock, bonds, coupons, or other evidences of indebtedness.\n(c) The bank or trust company may act as trustee under mortgages in the form of trust deeds.\n(d) The bank or trust company may act as general or special agent or attorney in fact in the acquisition, management, sale, assignment, transfer, encumbrance, conveyance, or other disposition of real or personal property, in the collection of rents, payment of taxes, and generally as the representative of a person, corporation, or copartnership.\n(e) The bank or trust company may guarantee the title to securities sold and transferred by it.\nThe bank or trust company may take and hold on deposit or for safekeeping, money, bonds, stocks, or other securities, or personal property, that: (1) is given to it by a public officer or a trustee or other legal representative or a public or private corporation or a person; or (2) is authorized, ordered, or otherwise required by law to be deposited in a safe depository or paid into any court of record. If a court orders the deposit, and the depositor takes the receipt of the bank or trust company for it, the depositor and the depositor's sureties are relieved from liability on the deposits while they are held by the bank or trust company. With respect to trust companies only, deposits do not include checking or savings accounts, certificates of deposit, or other liabilities not relating to its fiduciary activities, except as may be authorized by sections 47.23 and 48A.04.\nThe bank or trust company may act as assignee under an assignment for the benefit of creditors, or be appointed as a trustee, receiver, guardian, executor, or administrator, and may accept and perform any other lawful trust conferred by a court or by a corporation or individual. No oath or security is required of a bank or trust company accepting or performing a trust under this subdivision.\nThe judge or court having jurisdiction may direct an executor, administrator, guardian, assignee, receiver, or other trustee to deposit with the bank or trust company any securities belonging to the trust subject to the order of the trustee when countersigned by the judge of the court. The court may fix the security to be given by the trustee with reference only to the remainder of the trust estate. Securities may not be withdrawn and no part of the principal or interest of the securities may be collected without a court order. However, an officer of the bank or trust company, upon satisfactory proof that additional security has been furnished by the trustee or that the estate or fund has been so reduced that the deposit is no longer required, may withdraw securities or collect the principal of or interest on the securities.\n(a) The bank or trust company may, in its discretion, retain and continue an investment and security or securities coming into its possession in a fiduciary capacity.\n(b) In the absence of an express prohibition in the trust instrument, the trustee may acquire and retain securities of an open-end or closed-end management company or unit investment trust registered under the federal Investment Company Act of 1940. The fact that the banking institution or an affiliate of the banking institution, is providing services to the investment company or trust as investment advisor, sponsor, broker, distributor, custodian, transfer agent, registrar, or otherwise, and receiving compensation for the services does not preclude the trustee from investing in the securities of that investment company or trust. The banking institution shall disclose to all current income beneficiaries of the trust the rate, formula, and method of the compensation. This paragraph does not alter the degree of care and judgment required of trustees by section 501C.0901.\n(c) Except as otherwise provided in this subdivision, a bank or trust company shall invest an amount not less than $500 received by it as representative or trustee or by order of the court, not required for the purposes of the trust and not to be accounted for within one year, as provided in this subdivision, in authorized securities then held by it or specially procured by it. Except as may be otherwise provided in the governing will, trust agreement, court order, or other instrument, any amount in any one trust account, may be invested in certificates of deposit or savings accounts in the same bank, or any other bank or banks if the certificates of deposit or savings accounts are fully insured by the Federal Deposit Insurance Corporation and receive the prevailing rate of interest on the certificates or savings accounts.\n(d) Where funds are invested in authorized securities, as defined by law, the provisions of section 48.24 limiting the amount of liability of a person, corporation, or copartnership, with reference to a percentage of the capital and surplus of the bank, does not apply.\n(e) A bank or trust company may invest all money received by it in trust in authorized securities. It is responsible to the owner or cestui que trust for the validity, regularity, quality, value, and genuineness of these investments and securities at the time they are made. It is also responsible to the owner or cestui que trust for the safekeeping of these securities and evidences of them. When special directions are given in an order, judgment, decree, will, or other written instrument as to the particular manner or the particular class or kind of securities or property in which an investment must be made, the bank or trust company must follow these directions and is not responsible for the performance of the trust. In all other cases it may invest funds held in any trust capacity in authorized securities using its best judgment in the selection of them, and is responsible for the validity, regularity, quality, and value of them at the time made, and for their safekeeping.\n(f) As the sole trustee or one of two or more cotrustees, it may invest in fractional parts of, as well as in whole, securities, or may commingle funds for investment. If it invests in fractional parts of securities or commingles funds for investment, all of the fractional parts of the securities, or the whole of the funds so commingled must be owned and held by the bank or trust company in its several trust capacities. The bank or trust company is liable for the administration of these trusts in all respects as though separately invested. Not more than $100,000, at the cost price of the investments, may be invested for any one trust at any one time in fractional parts or as commingled funds for investment by a bank or trust company having capital and surplus of less than $500,000, unless the authority to invest in fractional parts or as commingled funds is given in the order, judgment, decree, will, or other written instrument governing the trust. Funds so commingled for investment must be designated collectively as a common trust fund. The trust company or bank shall maintain the common trust fund in conformity with the rules and regulations prevailing from time to time of the federal governmental agency that regulates the collective investment of trust funds by national banks. It may, in its discretion, retain and continue an investment and security or securities coming into its possession in any fiduciary capacity. Paragraphs (a) to (f) apply whether a corporate trustee is acting alone or with an individual cotrustee.\n(g) Notwithstanding the provisions of paragraph (f), a bank or trust company may:\n(1) establish and maintain common trust funds for the collective investment of funds held in a fiduciary capacity by it or by another bank or trust company that is owned or controlled by a corporation that owns or controls the bank or trust company; and\n(2) as a fiduciary or cofiduciary, invest funds that it holds for investment in common trust funds established and maintained according to clause (1) if the investment is not prohibited by the instrument, judgment, decree, or order creating the fiduciary relationship. This section applies to fiduciary relationships now in existence or hereafter created.\nTo the extent not inconsistent with this paragraph, the provisions of paragraph (f) relating to common trust funds apply to the establishment and maintenance of common trust funds under this paragraph.\n(h) A bank or trust company is entitled to reasonable compensation for the faithful performance of its duties and discharge of its trust, including all necessary expenses and interest at the legal rate, or the amount that has been or may be agreed upon by the parties. No compensation or commission paid or agreed to be paid by it for the negotiation of a loan, or the execution of a trust, is considered interest within the meaning of the law, and no excess over the legal rate of interest is considered usury.",
	"repealed": false
}