{
	"id": "148E.240",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.240",
	"title": "148E.240 REPORTING REQUIREMENTS.",
	"text": "The board has grounds to take action under sections 148E.255 to 148E.270 when a social worker fails to report to the board within 90 days:\n(1) having been disciplined, sanctioned, or found to have violated a state, territorial, provincial, or foreign licensing agency's laws or rules;\n(2) having been convicted of committing a felony, gross misdemeanor, or misdemeanor reasonably related to the practice of social work;\n(3) having had a finding or verdict of guilt, whether or not the adjudication of guilt is withheld or not entered, of committing a felony, gross misdemeanor, or misdemeanor reasonably related to the practice of social work;\n(4) having admitted to committing, or entering a no contest plea to committing, a felony, gross misdemeanor, or misdemeanor reasonably related to the practice of social work; or\n(5) having been denied licensure by a state, territorial, provincial, or foreign licensing agency.\nThe board has grounds to take action under sections 148E.255 to 148E.270 when an applicant or licensee fails to submit with an application the following information:\n(1) the dates and dispositions of any malpractice settlements or awards made relating to the social work services provided by the applicant or licensee; or\n(2) the dates and dispositions of any civil litigations or arbitrations relating to the social work services provided by the applicant or licensee.\nAn applicant or licensee must report to the appropriate health-related licensing board conduct by a licensed health professional which would constitute grounds for disciplinary action under the statutes and rules enforced by that board.\nAn applicant or licensee must report to the board conduct by an unlicensed person which constitutes the practice of social work, as defined in section 148E.010, except when the unlicensed person is exempt from licensure according to section 148E.065.\nThe board has grounds to take action under sections 148E.255 to 148E.270 when an applicant or licensee fails to report to the board conduct by:\n(1) another licensee or applicant which the applicant or licensee has reason to believe may reasonably constitute grounds for disciplinary action under this section; or\n(2) an unlicensed person that constitutes the practice of social work when a license is required to practice social work.\n(a) A licensee must comply with the duty to warn established by section 148.975.\n(b) For purposes of this subdivision, \"licensee\" includes interns and students.\nAn applicant or licensee must comply with the reporting of maltreatment of minors established by chapter 260E.\nAn applicant or licensee must comply with the reporting of maltreatment of vulnerable adults established by section 626.557.\nThe board may issue subpoenas according to section 148E.245 and chapter 214 for the production of any reports required by this section or any related documents.",
	"repealed": false
}