{
	"id": "149A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.30",
	"title": "149A.30 RECIPROCAL LICENSING.",
	"text": "The commissioner may issue a license to practice mortuary science to a person who holds a current license or other credential from another jurisdiction if the commissioner determines that the requirements for that license or other credential are substantially similar to the requirements under this chapter. The individual seeking reciprocal licensing must:\n(1) attain a passing score on the Minnesota state licensing examination;\n(2) submit to the commissioner the documentation described in section 149A.20, subdivision 7, clauses (1) and (5); and\n(3) pay the appropriate licensing fee.\nWhen, in the determination of the commissioner, all of the requirements of this subdivision have been met, the commissioner shall, based on all the information available, grant or deny licensure. If the commissioner grants licensure, the applicant shall be notified and the license shall issue and remain valid for a period prescribed on the license, but not to exceed one calendar year from the date of issuance of the license. If the commissioner denies licensure, the commissioner must notify the applicant, in writing, of the denial and provide the specific reason for denial.\n[Repealed, 2013 c 108 art 12 s 109]\nAll reciprocal licenses to practice mortuary science issued by the commissioner shall be valid for one calendar year, beginning on January 1 and ending on December 31 regardless of the date of issuance. Fees shall not be prorated.\nEach reciprocal license to practice mortuary science must be conspicuously displayed at all times in the holder's place of business. Conspicuous display means in a location where a member of the general public within the holder's place of business will be able to observe and read the license.\nA reciprocal license to practice mortuary science is not assignable or transferable and shall not be valid for any person other than the person named.\nAny change of license information must be reported to the commissioner, on forms provided by the commissioner, no later than 30 calendar days after the change occurs. Failure to report changes is grounds for disciplinary action.\nAll information submitted to the commissioner by an applicant for reciprocal licensure is classified as licensing data under section 13.41, subdivision 2, with the exception of the name and address of the applicant. Upon issuance of a license to practice mortuary science, all application information becomes licensing data under section 13.41, subdivision 5.",
	"repealed": false
}