{
	"id": "62A.316",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.316",
	"title": "62A.316 BASIC MEDICARE SUPPLEMENT PLAN; COVERAGE.",
	"text": "(a) The basic Medicare supplement plan must have a level of coverage that will provide:\n(1) coverage for all of the Medicare Part A inpatient hospital coinsurance amounts, and 100 percent of all Medicare part A eligible expenses for hospitalization not covered by Medicare, after satisfying the Medicare Part A deductible;\n(2) coverage for the daily co-payment amount of Medicare Part A eligible expenses for the calendar year incurred for skilled nursing facility care;\n(3) coverage for the coinsurance amount, or in the case of outpatient department services paid under a prospective payment system, the co-payment amount, of Medicare eligible expenses under Medicare Part B regardless of hospital confinement, subject to the Medicare Part B deductible amount;\n(4) 80 percent of the hospital and medical expenses and supplies incurred during travel outside the United States as a result of a medical emergency;\n(5) coverage for the reasonable cost of the first three pints of blood, or equivalent quantities of packed red blood cells as defined under federal regulations under Medicare Parts A and B, unless replaced in accordance with federal regulations;\n(6) 100 percent of the cost of immunizations not otherwise covered under Part D of the Medicare program and routine screening procedures for cancer screening including mammograms and pap smears;\n(7) 80 percent of coverage for all physician prescribed medically appropriate and necessary equipment and supplies used in the management and treatment of diabetes not otherwise covered under Part D of the Medicare program. Coverage must include persons with gestational, type I, or type II diabetes. Coverage under this clause is subject to section 62A.3093, subdivision 2;\n(8) coverage of cost sharing for all Medicare Part A eligible hospice care and respite care expenses; and\n(9) coverage for cost sharing for Medicare Part A or B home health care services and medical supplies subject to the Medicare Part B deductible amount.\n(b) The following benefit riders must be offered with this plan:\n(1) coverage for all of the Medicare Part A inpatient hospital deductible amount;\n(2) 100 percent of the Medicare Part B excess charges coverage for all of the difference between the actual Medicare Part B charges as billed, not to exceed any charge limitation established by the Medicare program or state law, and the Medicare-approved Part B charge;\n(3) coverage for all of the Medicare Part B annual deductible; and\n(4) preventive medical care benefit coverage for the following preventative health services not covered by Medicare:\n(i) an annual clinical preventive medical history and physical examination that may include tests and services from item (ii) and patient education to address preventive health care measures;\n(ii) preventive screening tests or preventive services, the selection and frequency of which is determined to be medically appropriate by the attending physician.\nReimbursement shall be for the actual charges up to 100 percent of the Medicare-approved amount for each service, as if Medicare were to cover the service as identified in American Medical Association current procedural terminology (AMA CPT) codes, to a maximum of $120 annually under this benefit. This benefit shall not include payment for a procedure covered by Medicare.\n(c) A basic Medicare supplement plan must provide the benefits contained in this section, but must not provide coverage for 100 percent or any portion of the Medicare Part B deductible to a newly eligible individual.",
	"repealed": false
}