{
	"id": "299L.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/299L.01",
	"title": "299L.01 DIVISION OF ALCOHOL AND GAMBLING ENFORCEMENT.",
	"text": "(a) For the purposes of this chapter, the terms defined in this subdivision have the meanings given them.\n(b) \"Division\" means the Division of Alcohol and Gambling Enforcement.\n(c) \"Commissioner\" means the commissioner of public safety.\n(d) \"Director\" means the director of alcohol and gambling enforcement.\n(e) \"Manufacturer\" means a person who assembles from raw materials or subparts a gambling device for sale or use in Minnesota.\n(f) \"Distributor\" means a person who sells, offers to sell, or otherwise provides a gambling device to a person in Minnesota.\n(g) \"Used gambling device\" means a gambling device five or more years old from the date of manufacture.\n(h) \"Test\" means the process of examining a gambling device to determine its characteristics or compliance with the established requirements of any jurisdiction.\n(i) \"Testing facility\" means a person in Minnesota who is engaged in the testing of gambling devices for use in any jurisdiction.\nEffective October 1, 1996, the duties and powers of the Division of Gambling Enforcement are transferred to the Division of Alcohol and Gambling Enforcement in the Department of Public Safety, under the control and supervision of a director appointed by the commissioner and serving at the commissioner's pleasure in the unclassified service. The director must be a person who is licensed or eligible to be licensed as a peace officer under sections 626.84 to 626.863.\nThe director shall employ in the Division of Alcohol and Gambling Enforcement personnel, in the classified service, necessary to carry out the duties under this chapter. The director shall request the Bureau of Criminal Apprehension to perform background checks on persons who are finalists for employment with the division but may employ personnel pending completion of the background check.\n(a) The director and any person employed by the division may not have a direct or indirect financial interest in:\n(1) a class A or B licensee of the Racing Commission;\n(2) a lottery retailer under contract with the State Lottery;\n(3) a person who is under a lottery procurement contract with the State Lottery;\n(4) a bingo hall, manufacturer, or distributor licensed under chapter 349; or\n(5) a manufacturer or distributor licensed under this chapter.\n(b) The director or an employee of the Division of Alcohol and Gambling Enforcement may not participate in the conducting of lawful gambling under chapter 349.",
	"repealed": false
}