{
	"id": "424A.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.095",
	"title": "424A.095 INVESTMENTS.",
	"text": "(a) The special fund assets of a relief association governed by sections 424A.091 to 424A.096 must be invested in securities that are authorized investments under section 356A.06, subdivision 6 or 7, whichever applies.\n(b) The governing board of the association may select and appoint a qualified private firm to measure management performance and return on investment, and the firm must use the formula or formulas developed by the state board under section 11A.04, clause (11).\n(a) Annually, the state auditor must provide an investment report to each relief association that has complied with the reporting requirements under section 356.219, subdivisions 1 and 3. The investment report must contain the following information:\n(1) the relief association's average annual rates of return for at least the previous one-, three-, five-, ten-, 15-, and 20-year periods for which the state auditor has investment information;\n(2) the relief association's asset allocation;\n(3) the average annual one-year and ten-year benchmark rates of return;\n(4) the average annual one-year and ten-year rates of return for the statewide volunteer firefighter plan;\n(5) the one-year and ten-year average annual rates of return for the State Board of Investment supplemental investment fund; and\n(6) a graphical comparison between:\n(i) the relief association's average annual rates of return for the previous year and for the previous multiyear periods provided under clause (1); and\n(ii) the average annual rates of return for the same periods for the supplemental investment fund's balanced fund or any successor fund.\n(b) The state auditor shall select the benchmark rates of return based on the best practice in the industry.\n(c) An officer of the relief association's board of trustees must certify to the state auditor that the board reviewed the investment report. The certification must accompany the audited financial statements or detailed financial statement under section 424A.014, subdivision 1 or 2, whichever applies. A copy of the report must be kept on file by the relief association and must be available for inspection by any member of the public.",
	"repealed": false
}