{
	"id": "169.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.59",
	"title": "169.59 WARNING LIGHTS.",
	"text": "Any vehicle may be equipped with not more than two side cowl or fender lamps, one on each side which shall emit a white light without glare.\nAny vehicle may be equipped with not more than one running board courtesy lamp on each side thereof, which shall emit a white or yellow light without glare.\nAny vehicle may be equipped with not more than two backup lamps, either separately or in combination with another lamp, and not more than two rear cornering lamps, except that the lamps must not be continuously lighted when the vehicle is in forward motion, nor shall it project a glaring light.\nAny vehicle may be equipped with lamps which may be used for the purpose of warning the operators of other vehicles of the presence of a vehicular traffic hazard requiring the exercise of unusual care in approaching, overtaking, or passing, and when so equipped may display such warning in addition to any other warning signals required by this section or section 169.50, subdivision 1 or 3; 169.56, subdivision 1, 2, 3, or 4; 169.57, subdivision 1; or 169.64, subdivision 3. The lamps used to display such warnings to the front shall be mounted at the same level and as widely spaced laterally as practicable, and shall display simultaneous flashing white or amber lights, or any shade of color between white and amber. The lamps used to display such warnings to the rear shall be mounted at the same level and as widely spaced laterally as practicable, and shall show simultaneously flashing amber or red lights, or any shade of color between amber and red. Instead of a pair of lamps that flash simultaneously, either one or two strobe lights or rotating beacon lights with an amber or yellow lens may be used both to the front and rear of the vehicle. These warning lights shall be visible from a distance of not less than 500 feet under normal atmospheric conditions at night.",
	"repealed": false
}