{
	"id": "260.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/260.031",
	"title": "260.031 REFEREE.",
	"text": "The chief judge of the judicial district may appoint one or more suitable persons to act as referees. All referees are subject to the administrative authority and assignment power of the chief judge of the district as provided in section 484.69, subdivision 3, and are not limited to assignment to juvenile court. Referees shall hold office at the pleasure of the judges of the district court and shall be learned in the law, except that persons holding the office of referee on January 1, 1983, may continue to serve under the terms and conditions of their appointment. The compensation of a referee shall be fixed by the judge, approved by the county board and payable from the general revenue funds of the county not otherwise appropriated. Part time referees holding office in the Second Judicial District pursuant to this subdivision shall cease to hold office on July 31, 1984.\nThe judge may direct that any case or class of cases shall be heard in the first instance by the referee in the manner provided for the hearing of cases by the court.\nUpon the conclusion of the hearing in each case, the referee shall transmit to the judge all papers relating to the case, together with findings and recommendations in writing. Notice of the findings of the referee together with a statement relative to the right of rehearing shall be given to the minor, parents, guardian, or custodian of the minor whose case has been heard by the referee, and to any other person that the court may direct. This notice may be given at the hearing, or by certified mail or other service directed by the court.\nThe minor and the minor's parents, guardians, or custodians are entitled to a hearing by the judge of the juvenile court if, within three days after receiving notice of the findings of the referee, they file a request with the court for a hearing. The court may allow such a hearing at any time.\nIn case no hearing before the judge is requested, or when the right to a hearing is waived, the findings and recommendations of the referee become the decree of the court when confirmed by an order of the judge. The final order of the court shall, in any event, be proof of such confirmation, and also of the fact that the matter was duly referred to the referee.",
	"repealed": false
}