{
	"id": "204D.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.28",
	"title": "204D.28 UNITED STATES SENATE VACANCY; MANNER OF FILLING.",
	"text": "Every vacancy in the office of United States senator shall be filled in the manner provided in this section.\nThe definitions in subdivisions 3 to 5 apply to this section.\n\"Vacancy\" means a vacancy in the Office of United States Senator.\n\"November election\" means:\n(a) the state general election in even-numbered years; or\n(b) the first Tuesday after the first Monday in November of odd-numbered years.\n\"Regular state primary\" means:\n(a) the state primary at which candidates are nominated for offices elected at the state general election; or\n(b) a primary held on the second Tuesday in August of odd-numbered years.\nEvery vacancy shall be filled for the remainder of the term by a special election held pursuant to this subdivision; except that no special election shall be held in the year before the term expires.\nThe special election shall be held at the next November election if the vacancy occurs at least 11 weeks before the regular state primary preceding that election. If the vacancy occurs less than 11 weeks before the regular state primary preceding the next November election, the special election shall be held at the second November election after the vacancy occurs.\nA special primary shall be held at the regular state primary preceding the November election at which the special election is held.\nThe secretary of state shall issue an official notice of any special election required to be held pursuant to this section not later than 16 weeks before the special primary, except that if the vacancy occurs 16 weeks or less before the special primary, the secretary of state shall issue the notice no later than two days after the vacancy occurs. The notice shall state the office to be filled, the opening and closing dates for filing of candidacy and the dates of the special primary and special election. For the purposes of those provisions of sections 204D.17 to 204D.27 that apply generally to special elections, this notice shall be used in place of the writ of the governor.\nThe time for filing of affidavits and nominating petitions for candidates to fill a vacancy at a special election shall open 12 weeks before the special primary or on the day the secretary of state issues notice of the special election, whichever occurs later. Filings shall close ten weeks before the special primary. A candidate filing for the office of United States senator to fill a vacancy at a special election when both offices of United States senator are required to be placed on the same ballot must specify on the affidavit of candidacy the expiration date of the term of the office that the candidate is seeking.\nWhen the names of candidates for both offices of United States senator are required to be placed on the same ballot, the expiration date of the term of each office shall be printed on the ballot in the office heading opposite the name of each candidate for nomination or election to that office.\nThe governor may make a temporary appointment to fill any vacancy. An appointee shall hold office until a successor is elected and qualified at a special election or until a successor is elected pursuant to subdivision 12.\nAn individual who is elected to the office of United States senator for a regular six-year term when the office is vacant or is filled by an individual appointed pursuant to subdivision 11, shall also succeed to the office for the remainder of the unexpired term.\nExcept as otherwise provided in this section, all of the provisions of sections 204D.22 to 204D.27 that apply generally to other special elections apply to a special election held pursuant to this section.",
	"repealed": false
}