{
	"id": "272.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.03",
	"title": "272.03 DEFINITIONS.",
	"text": "(a) For the purposes of taxation, but not for chapter 297A, \"real property\" includes the land itself, rails, ties, and other track materials annexed to the land, and all buildings, structures, and improvements or other fixtures on it, bridges of bridge companies, and all rights and privileges belonging or appertaining to the land, and all mines, iron ore and taconite minerals not otherwise exempt, quarries, fossils, and trees on or under it.\n(b) A building or structure shall include the building or structure itself, together with all improvements or fixtures annexed to the building or structure, which are integrated with and of permanent benefit to the building or structure, regardless of the present use of the building, and which cannot be removed without substantial damage to itself or to the building or structure.\n(c)(i) Real property does not include tools, implements, machinery, and equipment attached to or installed in real property for use in the business or production activity conducted thereon, regardless of size, weight or method of attachment, and mine shafts, tunnels, and other underground openings used to extract ores and minerals taxed under chapter 298 together with steel, concrete, and other materials used to support such openings.\n(ii) The exclusion provided in clause (i) shall not apply to machinery and equipment includable as real estate by paragraphs (a) and (b) even though such machinery and equipment is used in the business or production activity conducted on the real property if and to the extent such business or production activity consists of furnishing services or products to other buildings or structures which are subject to taxation under this chapter.\n(iii) The exclusion provided in clause (i) does not apply to the exterior shell of a structure which constitutes walls, ceilings, roofs, or floors if the shell of the structure has structural, insulation, or temperature control functions or provides protection from the elements, unless the structure is primarily used in the production of biofuels, wine, beer, distilled beverages, or dairy products. Such an exterior shell is included in the definition of real property even if it also has special functions distinct from that of a building, or if such an exterior shell is primarily used for the storage of ingredients or materials used in the production of biofuels, wine, beer, distilled beverages, or dairy products, or for the storage of finished biofuels, wine, beer, distilled beverages, or dairy products.\n(d) The term real property does not include tools, implements, machinery, equipment, poles, lines, cables, wires, conduit, and station connections which are part of a telephone communications system, regardless of attachment to or installation in real property and regardless of size, weight, or method of attachment or installation.\nFor the purposes of taxation, \"personal property\" includes:\n(1) All goods, chattels, money and effects;\n(2) All ships, boats, and vessels belonging to inhabitants of this state and all capital invested therein;\n(3) All improvements upon land the fee of which is vested in the United States, and all improvements upon land the title to which is vested in any corporation whose property is not subject to the same mode and rule of taxation as other property;\n(4) All stock of nursery operators, growing or otherwise;\n(5) All gas, electric, and water mains, pipes, conduits, subways, poles, and wires of gas, electric light, water, heat, or power companies, and all tracks, roads, conduits, poles, and wires of street railway, plank road, gravel road, and turnpike companies;\n(6) All credits over and above debts owed by the creditor;\n(7) The income of every annuity, unless the capital of the annuity is taxed within this state;\n(8) All public stocks and securities;\n(9) All personal estate of moneyed corporations, whether the owners reside within or without the state;\n(10) All shares in foreign corporations owned by residents of this state; and\n(11) All shares in banks organized under the laws of the United States or of this state.\nFor the purposes of chapters 270 to 284, unless a different meaning is indicated by the context, the words, phrases, and terms defined in this section have the meanings given them.\n\"Money\" or \"moneys\" means gold and silver coin, treasury notes, bank notes, and other forms of currency in common use, and every deposit which any person owning the same, or holding in trust and residing in this state, is entitled to withdraw in money on demand.\n\"Credits\" includes every claim and demand for money or other valuable thing, and every annuity or sum of money receivable at stated periods, due or to become due, and all claims and demands secured by deed or mortgage, due or to become due, upon which the mortgage registration tax has not been paid, and all shares of stock in corporations 75 percent or more of the real or tangible personal property of which is not taxable in this state.\n(a) \"Tract,\" \"lot,\" \"parcel,\" and \"piece or parcel\" of land means any contiguous quantity of land in the possession of, owned by, or recorded as the property of, the same claimant or person.\n(b) Notwithstanding paragraph (a), property that is owned by a utility, leased for residential or recreational uses for terms of 20 years or longer, and separately valued by the assessor, will be treated for property tax purposes as separate parcels.\n\"Town\" or \"district\" means town, city, or ward, as the case may be.\n\"Market value\" means the usual selling price at the place where the property to which the term is applied shall be at the time of assessment; being the price which could be obtained at a private sale or an auction sale, if it is determined by the assessor that the price from the auction sale represents an arm's-length transaction. The price obtained at a forced sale shall not be considered.\n\"Person\" means an individual, association, estate, trust, partnership, firm, company, or corporation.\n\"Merchant\" includes every person who owns, or possesses or controls with authority to sell, any goods, merchandise, or other personal property within the state, purchased within or without the state with a view to sale at an advanced price or profit, or which has been consigned to the person from any place without the state for sale within the state.\n\"Manufacturer\" includes every person who purchases, receives, or holds personal property for the purpose of adding to its value by any process of manufacturing, refining, rectifying, or by the combination of different materials, with a view of making gain or profit thereby.\nMS 1969 [Repealed, 1971 c 427 s 26]\nUnless specifically defined otherwise, \"Internal Revenue Code\" means the Internal Revenue Code as defined in section 289A.02, subdivision 7.\n\"Estimated market value\" means the assessor's determination of market value, including the effects of any orders made under section 270.12 or chapter 274, for the parcel. The provisions of section 273.032 apply for certain uses in determining the total estimated market value for the taxing jurisdiction.\n\"Taxable market value\" means estimated market value for the parcel as reduced by market value exclusions, deferments of value, or other adjustments required by law, that reduce market value before the application of classification rates.",
	"repealed": false
}