{
	"id": "611.46",
	"url": "https://www.revisor.mn.gov/statutes/cite/611.46",
	"title": "611.46 INCOMPETENT TO STAND TRIAL AND CONTINUING SUPERVISION.",
	"text": "(a) If the court finds the defendant incompetent and the charges have not been dismissed, the court shall order the defendant to participate in a program to assist the defendant in attaining competency. The court may order participation in a competency attainment program provided outside of a jail, a jail-based competency attainment program, or an alternative program. The court must determine the least-restrictive program appropriate to meet the defendant's needs and public safety. In making this determination, the court must consult with the forensic navigator and consider any recommendations of the court examiner. The court shall not order a defendant to participate in a jail-based program or a state-operated treatment program if the highest criminal charge is a targeted misdemeanor.\n(b) If the court orders the defendant to a locked treatment facility or jail-based program, the court must calculate the defendant's custody credit and cannot order the defendant to a locked treatment facility or jail-based program for a period that would cause the defendant's custody credit to exceed the maximum sentence for the underlying charge.\n(c) The court may only order the defendant to participate in competency attainment at an inpatient or residential treatment program under this section if the head of the treatment program determines that admission to the program is clinically appropriate and consents to the defendant's admission. The court may only order the defendant to participate in competency attainment at a state-operated treatment facility under this section if the Direct Care and Treatment executive board or a designee determines that admission of the defendant is clinically appropriate and consents to the defendant's admission. The court may require a competency program that qualifies as a locked facility or a state-operated treatment program to notify the court in writing of the basis for refusing consent for admission of the defendant in order to ensure transparency and maintain an accurate record. The court may not require personal appearance of any representative of a competency program. The court shall send a written request for notification to the locked facility or state-operated treatment program and the locked facility or state-operated treatment program shall provide a written response to the court within ten days of receipt of the court's request.\n(d) If the defendant is confined in jail and has not received competency attainment services within 30 days of the finding of incompetency, the court shall review the case with input from the prosecutor and defense counsel and may:\n(1) order the defendant to participate in an appropriate competency attainment program that takes place outside of a jail;\n(2) order a conditional release of the defendant with conditions that include but are not limited to a requirement that the defendant participate in a competency attainment program when one becomes available and accessible;\n(3) make a determination as to whether the defendant is likely to attain competency in the reasonably foreseeable future and proceed under section 611.49; or\n(4) upon a motion, dismiss the charges in the interest of justice.\n(e) The court may order any hospital, treatment facility, or correctional facility that has provided care or supervision to a defendant in the previous two years to provide copies of the defendant's medical records to the competency attainment program or alternative program in which the defendant was ordered to participate. This information shall be provided in a consistent and timely manner and pursuant to all applicable laws.\n(f) If at any time the defendant refuses to participate in a competency attainment program or an alternative program, the head of the program shall notify the court and any entity responsible for supervision of the defendant.\n(g) At any time, the head of the program may discharge the defendant from the program or facility. The head of the program must notify the court, prosecutor, defense counsel, and any entity responsible for the supervision of the defendant prior to any planned discharge. Absent emergency circumstances, this notification shall be made five days prior to the discharge if the defendant is not being discharged to jail or a correctional facility. Upon the receipt of notification of discharge or upon the request of either party in response to notification of discharge, the court may order that a defendant who is subject to bail or unmet conditions of release be returned to jail upon being discharged from the program or facility. If the court orders a defendant returned to jail, the court shall notify the parties and head of the program at least one day before the defendant's planned discharge, except in the event of an emergency discharge where one day notice is not possible. The court must hold a review hearing within seven days of the defendant's return to jail. The forensic navigator must be given notice of the hearing and be allowed to participate.\n(h) If the defendant is discharged from the program or facility under emergency circumstances, notification of emergency discharge shall include a description of the emergency circumstances and may include a request for emergency transportation. The court shall make a determination on a request for emergency transportation within 24 hours. Nothing in this section prohibits a law enforcement agency from transporting a defendant pursuant to any other authority.\n(a) Upon a finding of incompetency, if the defendant is entitled to release, the court must determine whether the defendant requires pretrial supervision. The court must weigh public safety risks against the defendant's interests in remaining free from supervision while presumed innocent in the criminal proceedings. The court may use a validated and equitable risk assessment tool to determine whether supervision is necessary.\n(b) If the court determines that the defendant requires pretrial supervision, the court shall direct the forensic navigator to conduct pretrial supervision and report violations to the court. The forensic navigator shall be responsible for the supervision of the defendant until ordered otherwise by the court.\n(c) Upon application by the prosecutor, forensic navigator, other entity or its designee assigned to supervise the defendant, or court services alleging that the defendant violated a condition of release and is a risk to public safety, the court shall follow the procedures under Rules of Criminal Procedure, rule 6. Any hearing on the alleged violation of release conditions shall be held no more than 15 days after the date of issuance of a summons or within 72 hours if the defendant is apprehended on a warrant.\n(d) If the court finds a violation, the court may revise the conditions of release and bail as appropriate pursuant to Minnesota Rules of Criminal Procedure and must consider the defendant's need for ongoing access to a competency attainment program or alternative program under this section.\n(e) The court must review conditions of release and bail on request of any party and may amend the conditions of release or make any other reasonable order upon receipt of information that the pretrial detention of a defendant has interfered with the defendant attaining competency.\n(a) If the court orders a defendant to participate in a competency attainment program that takes place outside of a jail, or an alternative program that the court has determined is providing appropriate competency attainment services to the defendant, the court shall specify whether the program is provided in a locked treatment facility.\n(b) If the court finds that the defendant continues to be incompetent at a review hearing held after the initial determination of competency, the court must hold a review hearing pursuant to section 611.49 and consider any changes to the defendant's conditions of release or competency attainment programming to restore the defendant's competency in the least restrictive program appropriate.\n(a) A defendant is eligible to participate in a jail-based competency attainment program when the underlying charge is a gross misdemeanor or felony and either:\n(1) the defendant has been found incompetent, the defendant has not met the conditions of release ordered pursuant to rule 6.02 of Minnesota Rules of Criminal Procedure, including posting bail, and either a court examiner has recommended jail-based competency attainment as the least restrictive setting to meet the person's needs, or the court finds that after a reasonable effort by the forensic navigator, there has not been consent by another secure setting to the defendant's placement; or\n(2) the defendant is in custody and is ordered to a competency attainment program that takes place outside of a jail, a jail-based competency attainment program is available within a reasonable distance to the county where the defendant is being held, and the court ordered a time-limited placement in a jail-based program until transfer to a competency attainment program that takes place outside of a jail.\n(b) A defendant may not be ordered to participate in a jail-based competency attainment program for more than 90 days without a review hearing. If after 90 days of the order to a jail-based program the defendant has not attained competency, the court must review the case with input from the prosecutor and defense counsel and may:\n(1) order the defendant to participate in an appropriate competency attainment program that takes place outside of a locked facility; or\n(2) determine whether, after a reasonable effort by the forensic navigator, there is consent to the defendant's placement by another locked facility. If court determines that a locked facility is the least restrictive program appropriate and no appropriate locked facility is available, it may order the defendant to the jail-based program for an additional 90 days.\n(c) Nothing in this section prohibits the court from ordering the defendant transferred to a competency attainment program that takes place outside of a jail if the court determines that transition is appropriate, or the defendant satisfies the conditions of release or bail. Before the defendant is transferred to a competency attainment program that takes place outside of a jail or an alternative program, the court shall notify the prosecutor and the defense counsel, and the provisions of subdivision 2 shall apply.\n(a) A defendant is eligible to participate in an alternative program if the defendant has been found incompetent, the defendant is entitled to release, and a competency attainment program outside of a jail is not available.\n(b) As soon as the forensic navigator has reason to believe that no competency attainment program outside of a jail will be available within a reasonable time, the forensic navigator shall determine if there are available alternative programs that are likely to assist the defendant in attaining competency. The court may order the defendant to participate in an appropriate alternative program identified by the forensic navigator and must notify the prosecutor and the defense counsel of the order.\n(c) If at any time while the defendant is participating in an alternative program, an appropriate competency attainment program that takes place outside of a jail becomes available, the forensic navigator must notify the court. The court must notify the prosecutor and the defense counsel and must order the defendant to participate in an appropriate competency attainment program, unless the court determines that the defendant is receiving appropriate competency attainment services in the alternative program. If appropriate and in the public interest, the court may order the defendant to participate in the competency attainment program and an alternative program.\n(d) At any time, the head of the alternative program or the forensic navigator may notify the court that the defendant is receiving appropriate competency attainment services in the alternative program, and recommend that remaining in the alternative program is in the best interest of the defendant and the defendant's progress in attaining competency. The court may order the defendant to continue programming in the alternative program and proceed under subdivision 3.\n(e) If after 90 days of the order to an alternative program the defendant has not attained competency and the defendant is not participating in a competency attainment program, the court must hold a review hearing pursuant to section 611.49.\n(a) The court examiner must provide an updated report to the court at least once every six months, unless the court and the parties agree to a longer period that is not more than 12 months, as to the defendant's competency and a description of the efforts made to restore the defendant to competency.\n(b) At any time, the head of the program may notify the court and recommend that a court examiner provide an updated competency examination and report.\n(c) The court shall provide copies of the report to the prosecutor, defense counsel, and the facility or program where the defendant is being served.\n(d) The report may make recommendations for continued services to ensure continued competency. If the defendant is found guilty, these recommendations may be considered by the court in imposing a sentence, including any conditions of probation.\nThe prosecutor or defense counsel may request a hearing on the court examiner's competency opinion by filing written objections to the competency report no later than ten days after receiving the report. All parties are entitled to notice before the hearing. If the hearing is held, it shall conform with the procedures of section 611.44.\n(a) The court must determine whether the defendant is competent based on the updated report from the court examiner no more than 14 days after receiving the report.\n(b) If the court finds the defendant competent, the court must enter an order and the criminal proceedings shall resume.\n(c) If the court finds the defendant incompetent, the court may order the defendant to continue participating in a program as provided in this section.\n(d) Counsel for the defendant may bring a motion to dismiss the proceedings in the interest of justice at any stage of the proceedings.",
	"repealed": false
}