{
	"id": "144.615",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.615",
	"title": "144.615 BIRTH CENTERS.",
	"text": "(a) For purposes of this section, the following definitions have the meanings given them.\n(b) \"Birth center\" means a facility licensed for the primary purpose of performing low-risk deliveries that is not a hospital or licensed as part of a hospital and where births are planned to occur away from the mother's usual residence following a low-risk pregnancy.\n(c) \"CABC\" means the Commission for the Accreditation of Birth Centers.\n(d) \"Low-risk pregnancy\" means a normal, uncomplicated prenatal course as determined by documentation of adequate prenatal care and the anticipation of a normal, uncomplicated labor and birth, as defined by reasonable and generally accepted criteria adopted by professional groups for maternal, fetal, and neonatal health care.\n(a) Beginning January 1, 2011, no birth center shall be established, operated, or maintained in the state without first obtaining a license from the commissioner of health according to this section.\n(b) A license issued under this section is not transferable or assignable and is subject to suspension or revocation at any time for failure to comply with this section.\n(c) A birth center licensed under this section shall not assert, represent, offer, provide, or imply that the center is or may render care or services other than the services it is permitted to render within the scope of the license or the accreditation issued.\n(d) The license must be conspicuously posted in an area where patients are admitted.\nFor new birth centers planning to begin operations after January 1, 2011, the commissioner may issue a temporary license to the birth center that is valid for a period of six months from the date of issuance. The birth center must submit to the commissioner an application and applicable fee for licensure as required under subdivision 4. The application must include the information required in subdivision 4, clauses (1) to (3) and (5) to (7), and documentation that the birth center has submitted an application for accreditation to the CABC. Upon receipt of accreditation from the CABC, the birth center must submit to the commissioner the information required in subdivision 4, clause (4), and the applicable fee under subdivision 8. The commissioner shall issue a new license.\nAn application for a license to operate a birth center and the applicable fee under subdivision 8 must be submitted to the commissioner on a form provided by the commissioner and must contain:\n(1) the name of the applicant;\n(2) the site location of the birth center;\n(3) the name of the person in charge of the center;\n(4) documentation that the accreditation described under subdivision 6 has been issued, including the effective date and the expiration date of the accreditation, and the date of the last site visit by the CABC;\n(5) the number of patients the birth center is capable of serving at a given time;\n(6) the names and license numbers, if applicable, of the health care professionals on staff at the birth center; and\n(7) any other information the commissioner deems necessary.\nThe commissioner may refuse to grant or renew, or may suspend or revoke, a license on any of the grounds described under section 144.55, subdivision 6, paragraph (a), clause (2), (3), or (4), or upon the loss of accreditation by the CABC. The applicant or licensee is entitled to notice and a hearing as described under section 144.55, subdivision 7, and a new license may be issued after proper inspection of the birth center has been conducted.\n(a) To be eligible for licensure under this section, a birth center must be accredited by the CABC or must obtain accreditation within six months of the date of the application for licensure. If the birth center loses its accreditation, the birth center must immediately notify the commissioner.\n(b) The center must have procedures in place specifying criteria by which risk status will be established and applied to each woman at admission and during labor.\n(c) Upon request, the birth center shall provide the commissioner of health with any material submitted by the birth center to the CABC as part of the accreditation process, including the accreditation application, the self-evaluation report, the accreditation decision letter from the CABC, and any reports from the CABC following a site visit.\n(a) The following limitations apply to the services performed at a birth center:\n(1) surgical procedures must be limited to those normally accomplished during an uncomplicated birth, including episiotomy and repair; and\n(2) no general or regional anesthesia may be administered.\n(b) Notwithstanding paragraph (a), local anesthesia may be administered at a birth center if the administration of the anesthetic is performed within the scope of practice of a health care professional.\n(a) The biennial license fee for a birth center is $365.\n(b) The temporary license fee is $365.\n(c) Fees shall be collected and deposited according to section 144.122.\n(a) Except as provided in paragraph (b), a license issued under this section expires two years from the date of issue.\n(b) A temporary license issued under subdivision 3 expires six months from the date of issue and may be renewed for one additional six-month period.\n(c) An application for renewal shall be submitted at least 60 days prior to expiration of the license on forms prescribed by the commissioner of health.\nAll health records maintained on each client by a birth center are subject to sections 144.292 to 144.298.\n(a) The commissioner of health, in consultation with the commissioner of human services and representatives of the licensed birth centers, the American College of Obstetricians and Gynecologists, the American Academy of Pediatrics, the Minnesota Hospital Association, and the Minnesota Ambulance Association, shall evaluate the quality of care and outcomes for services provided in licensed birth centers, including, but not limited to, the utilization of services provided at a birth center, the outcomes of care provided to both mothers and newborns, and the numbers of transfers to other health care facilities that are required and the reasons for the transfers. The commissioner shall work with the birth centers to establish a process to gather and analyze the data within protocols that protect the confidentiality of patient identification.\n(b) The commissioner of health shall report the findings of the evaluation to the legislature by January 15, 2014.",
	"repealed": false
}