{
	"id": "245.802",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.802",
	"title": "245.802 FACILITIES FOR PEOPLE WITH MENTAL ILLNESS; RULES.",
	"text": "[Repealed, 1987 c 333 s 20]\n[Repealed, 1987 c 333 s 20]\nAfter June 30, 1989, no residential facility licensed by the commissioner of human services or the commissioner of health, other than facilities specifically licensed for people with mental illness, may have more than four residents with a diagnosis of mental illness. The commissioner of health, with the cooperation of the commissioner of human services, shall monitor licensed boarding care, board and lodging, and supervised living facilities to assure that this requirement is met. By January 1, 1989, the commissioner of health shall recommend to the legislature an appropriate mechanism for enforcing this requirement.\n[Repealed, 1987 c 333 s 20]\nThe commissioner shall:\n(1) provide in rule for various levels of care to address the residential treatment needs of persons with mental illness;\n(2) review Category I and II programs established in Minnesota Rules, parts 9520.0500 to 9520.0670 to ensure that the categories of programs provide a continuum of residential service programs for persons with mental illness;\n(3) provide in rule for a definition of the term \"treatment\" as used in relation to persons with mental illness;\n(4) adjust funding mechanisms by rule as needed to reflect the requirements established by rule for services being provided;\n(5) review and recommend staff educational requirements and staff training as needed; and\n(6) review and make changes in rules relating to residential care and service programs for persons with mental illness as the commissioner may determine necessary.\n[Repealed, 1987 c 333 s 20]\n[Repealed, 1987 c 333 s 20]\nThe commissioner of human services shall study the housing needs of people with mental illness and shall articulate a continuum of services from residential treatment as the most intensive service through housing programs as the least intensive. The commissioner shall develop recommendations for implementing the continuum of services and shall present the recommendations to the legislature by January 31, 1988.",
	"repealed": false
}