{
	"id": "260C.503",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.503",
	"title": "260C.503 PERMANENCY PROCEEDINGS.",
	"text": "(a) Except for children in foster care pursuant to chapter 260D, where the child is in foster care or in the care of a noncustodial or nonresident parent, the court shall commence proceedings to determine the permanent status of a child by holding the admit-deny hearing required under section 260C.507 not later than 12 months after the child is placed in foster care or in the care of a noncustodial or nonresident parent. Permanency proceedings for children in foster care pursuant to chapter 260D shall be according to section 260D.07.\n(b) Permanency proceedings for a foster child who is colocated with a parent in a licensed residential family-based substance use disorder treatment program shall be conducted according to section 260C.190.\n(a) The responsible social services agency must ask the county attorney to immediately file a termination of parental rights petition when:\n(1) the child has been subjected to egregious harm as defined in section 260C.007, subdivision 14;\n(2) the child is determined to be the sibling of a child who was subjected to egregious harm;\n(3) the child is an abandoned infant as defined in section 260C.301, subdivision 2, paragraph (a), clause (2);\n(4) the child's parent has lost parental rights to another child through an order involuntarily terminating the parent's rights;\n(5) the parent has committed sexual abuse as defined in section 260E.03, against the child or another child of the parent;\n(6) the parent has committed an offense that requires registration as a predatory offender under section 243.166, subdivision 1b, paragraph (a) or (b); or\n(7) another child of the parent is the subject of an order involuntarily transferring permanent legal and physical custody of the child to a relative under this chapter or a similar law of another jurisdiction.\nThe county attorney shall file a termination of parental rights petition unless the conditions of paragraph (d) are met.\n(b) When the termination of parental rights petition is filed under this subdivision, the responsible social services agency shall identify, recruit, and approve an adoptive family for the child. If a termination of parental rights petition has been filed by another party, the responsible social services agency shall be joined as a party to the petition.\n(c) If criminal charges have been filed against a parent arising out of the conduct alleged to constitute egregious harm, the county attorney shall determine which matter should proceed to trial first, consistent with the best interests of the child and subject to the defendant's right to a speedy trial.\n(d) The requirement of paragraph (a) does not apply if the responsible social services agency and the county attorney determine and file with the court:\n(1) a petition for transfer of permanent legal and physical custody to a relative under sections 260C.505 and 260C.515, subdivision 4, including a determination that adoption is not in the child's best interests and that transfer of permanent legal and physical custody is in the child's best interests; or\n(2) a petition under section 260C.141 alleging the child, and where appropriate, the child's siblings, to be in need of protection or services accompanied by a case plan prepared by the responsible social services agency documenting a compelling reason why filing a termination of parental rights petition would not be in the best interests of the child.\n(a) For purposes of this section, the date of the child's placement in foster care is the earlier of the first court-ordered placement or 60 days after the date on which the child has been voluntarily placed in foster care by the child's parent or guardian. For purposes of this section, time spent by a child in the home of the noncustodial parent pursuant to court order under section 260C.178 or under the protective supervision of the responsible social services agency in the home of the noncustodial parent pursuant to an order under section 260C.201, subdivision 1, counts towards the requirement of a permanency hearing under this section. Time spent on a trial home visit counts towards the requirement of a permanency hearing under this section and the permanency progress review required under section 260C.204.\n(b) For the purposes of this section, 12 months is calculated as follows:\n(1) during the pendency of a petition alleging that a child is in need of protection or services, all time periods when a child is placed in foster care or in the home of a noncustodial parent are cumulated; and\n(2) if a child has been placed in foster care within the previous five years under one or more previous petitions, the lengths of all prior time periods when the child was placed in foster care within the previous five years are cumulated. If a child under this clause has been in foster care for 12 months or more, the court, if it is in the best interests of the child and for compelling reasons, may extend the total time the child may continue out of the home under the current petition up to an additional six months before making a permanency determination.\n(c) If the child is on a trial home visit 12 months after the child was placed in foster care or in the care of a noncustodial parent, the responsible social services agency may file a report with the court regarding the child's and parent's progress on the trial home visit and the agency's reasonable efforts to finalize the child's safe and permanent return to the care of the parent in lieu of filing the petition required under section 260C.505. The court shall make findings regarding the reasonable efforts of the agency to finalize the child's return home as the permanency disposition order in the best interests of the child. The court may continue the trial home visit to a total time not to exceed six months as provided in section 260C.201, subdivision 1, paragraph (a), clause (3). If the court finds the agency has not made reasonable efforts to finalize the child's return home as the permanency disposition order in the child's best interests, the court may order other or additional efforts to support the child remaining in the care of the parent. If a trial home visit ordered or continued at permanency proceedings under sections 260C.503 to 260C.521 terminates, the court shall commence or recommence permanency proceedings under this chapter no later than 30 days after the child is returned to foster care or to the care of a noncustodial parent.\nWhen a child is placed in a qualified residential treatment program as defined in section 260C.007, subdivision 26d, the responsible social services agency must submit evidence to the court as specified in section 260C.712.",
	"repealed": false
}