{
	"id": "60A.208",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.208",
	"title": "60A.208 BROKER ASSOCIATION.",
	"text": "Surplus lines brokers may associate and the commissioner may register the association for one or more of the following purposes:\n(a) advising the commissioner as to the availability of nonadmitted insurance coverage and market practices and standards for nonadmitted insurers and brokers;\n(b) collecting and furnishing records and statistics; or\n(c) submitting recommendations regarding administration of sections 60A.195 to 60A.209.\n(a) Each association shall file with the commissioner for approval all of the following:\n(1) a copy of the association's constitution and articles of agreement or association, or the association's certificate of incorporation and bylaws and any rules governing the association's activities; and\n(2) an agreement that, as a condition of continued registration under subdivision 1, the commissioner may examine the association.\n(b) Each association shall file with the commissioner and keep current all of the following:\n(1) a list of members; and\n(2) the name and address of a resident of this state upon whom notices or orders of the commissioner or process issued by the commissioner may be served.\nThe commissioner may refuse to register, or may suspend or revoke the registration of an association for any of the following reasons:\n(a) it reasonably appears that the association will not be able to carry out the purposes of sections 60A.195 to 60A.209;\n(b) the association fails to maintain and enforce rules which will assure that members of the association and persons associated with those members comply with sections 60A.195 to 60A.209, other applicable chapters of the insurance laws and rules promulgated under either;\n(c) the rules of the association do not assure a fair representation of its members in the selection of directors and in the administration of its affairs;\n(d) the rules of the association do not provide for an equitable allocation of reasonable dues, fees, and other charges among members;\n(e) the rules of the association impose a burden on competition; or\n(f) the association fails to meet other applicable requirements prescribed in sections 60A.195 to 60A.209.\nAn association shall deny membership to any person who is not a broker.\nNo broker may be compelled to join an association as a condition of receiving a license or continuing to be licensed under sections 60A.195 to 60A.209.\nEach association shall annually file a certified audited financial statement.\nAn association may submit reports and make recommendations to the commissioner regarding the financial condition of any eligible surplus lines insurer. These reports and recommendations shall not be considered to be public information. There shall not be liability on the part of, or a cause of action of any nature shall not arise against, eligible surplus lines insurers, the association or its agents or employees, the directors, or the commissioner or authorized representatives of the commissioner, for statements made by them in any reports or recommendations made under this subdivision.\n(a) Upon request from the association, the commissioner may approve the levy of an assessment of not more than one-half of one percent of premiums charged pursuant to sections 60A.195 to 60A.209 for operation of the association to the extent that the operation relieves the commissioner of duties otherwise required of the commissioner pursuant to sections 60A.195 to 60A.209. Any assessment so approved may be subtracted from the premium tax owed by the broker under chapter 297I.\n(b) The association may revoke the membership and the commissioner may revoke the license in this state, of any broker who fails to pay an assessment when due, if the assessment has been approved by the commissioner.",
	"repealed": false
}