{
	"id": "326.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/326.56",
	"title": "326.56 LICENSES, CERTIFICATES OF REGISTRATION; RENEWALS.",
	"text": "For the purposes of this section the terms defined in this subdivision shall have the meanings ascribed to them.\n(1) \"Active military service\" has the meaning given in section 190.05, subdivision 5.\n(2) \"Employment essential to the prosecution of a war or to the national defense\" means employment by the federal government of the United States of America, or any of its agencies, or by a federal government contractor or subcontractor in work connected with the prosecution of a war or for the defense of the United States or its allies.\n(3) \"Outside of the United States\" means outside of the territorial limits of the 50 states of the United States and the District of Columbia.\n(a) Notwithstanding any other provision of statutes, any person required by law to be licensed or registered by the state of Minnesota in order to carry on or practice a trade, employment, occupation or profession within this state who is also required by law to renew the license or certificate of registration at stated intervals and to pay a fee for such renewal on or before a specified date, or be subject to revocation of the license or certificate or other penalties, and who has been ordered into active military service, or who has been engaged, or shall hereafter be engaged, in employment outside of the United States essential to the prosecution of a war or to the national defense, whose license or certificate of registration was effective at the time of the person's entry into active military service or engagement in the employment, is hereby exempted from the payment of all renewal fees and from the filing of any application for renewal, which but for this section would have been required as a condition of the renewal of the license or certificate, during the time the person has been in active military service or that employment, and from any penalties for nonpayment or late payment, and is hereby exempted from further payment of such renewal fees and from the making of any application for renewal during the period the person shall remain in active military service or the employment, and for six months thereafter. The license or certificate in the meantime shall remain in full force and effect, and if it has been canceled or revoked solely on the basis of nonpayment of renewal fees or failure to apply for a renewal, it shall be reinstated upon the application of the licensee or registrant or by anyone on the person's behalf without the payment of any penalties or costs. Any such person may within six months from the date of release from active military service, or from the date of return within the boundaries of the United States if the person has been engaged in the essential employment, make application for a renewal of the license or certificate without penalty and in the same manner as if the person had made application therefor at the time or time specified by existing laws, irrespective of whether the license or certificate has expired or is due to expire within that time period.\n(b) The phrase \"license or certificate of registration\" in paragraph (a) includes, but is not limited to, a license or certificate of registration for a trade, employment, occupation, or profession for which the state requires firearms and use of force training. Any compensatory job-related education or training considered necessary by the licensee's or registrant's employer must be provided and paid for by the employer and must not be permitted to delay the licensee's or registrant's reemployment.",
	"repealed": false
}