{
	"id": "216C.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.43",
	"title": "216C.43 ENERGY IMPROVEMENT FINANCING PROGRAM FOR LOCAL GOVERNMENT.",
	"text": "The commissioner shall administer this section. A local government may enter into contracts for the purposes of this section with the commissioner, the primary contractor, other contracted technical service providers, and participating financial institutions.\nA local government may elect to participate in the program. The commissioner may prioritize and target technical services offered under subdivision 4 to local governments that the commissioner determines offer the greatest potential for cost-effective energy improvement projects.\nThe commissioner may enter into a contract for the delivery of technical services, financial management, marketing, and administrative services necessary for implementation of the program.\nThe commissioner shall offer technical services to targeted local governments to conduct energy project studies. The commissioner may contract with one or more qualified technical service providers to conduct energy project studies for targeted local governments. The commissioner may require full or partial reimbursement of costs for technical services provided to a local government, subject to terms and conditions specified and agreed to by contract before the delivery of technical services. A local government may independently procure technical services to conduct an energy project study, but the energy project study must be reviewed and approved by the commissioner to qualify an energy improvement project for a financing agreement under subdivision 6 or a supplemental cash flow agreement under subdivision 7.\nProgram activities must be implemented to encourage statewide participation of engineers, architects, energy auditors, contractors, and other technical service providers. The commissioner may provide training on energy project study requirements and procedures to technical service providers.\nThe commissioner shall solicit proposals from private financial institutions and may enter into a standard project financing agreement with one or more financial institutions. A standard project financing agreement must specify terms and conditions uniformly available to all participating public entities for financing to implement energy improvement projects under this section. A local government may choose to finance an energy improvement project by means other than a standard project financing agreement, but a supplemental cash flow agreement under subdivision 7 must not be offered unless the commissioner determines that the other financing means creates no greater potential obligation under a supplemental cash flow agreement than would be created through a standard project financing agreement.\n(a) The commissioner may offer a supplemental cash flow agreement to a participating local government for qualifying energy improvement projects. The term of a supplemental cash flow agreement may not exceed 15 years. Terms and conditions of a supplemental cash flow agreement must be agreed to by contract prior to a local government entering into a financing agreement.\n(b) A supplemental cash flow agreement must include, but is not limited to:\n(1) specification of methods and procedures to measure and verify energy cost savings;\n(2) obligations of the local government to operate and maintain the energy improvements;\n(3) procedures to modify the supplemental cash flow agreement if the local government modifies operating characteristics of its building or facility in a manner that adversely affects energy cost savings;\n(4) interest charged on the loan, which may not exceed the interest on the related financial agreement; and\n(5) procedures for resolution of disputes.\n(c) The commissioner must limit aggregate exposure to liability for payments under existing supplemental cash flow agreements to an amount no more than the appropriation available to make those payments.\nA local government may submit to the commissioner, on a form prescribed by the commissioner, an application for a financing agreement authorization and supplemental cash flow agreement for energy improvement projects. The commissioner shall approve an energy improvement project for a supplemental cash flow agreement and authorize eligibility for a financing agreement if the commissioner determines that:\n(1) the application has been approved by the governing body or agency head of the local government;\n(2) the project is technically and economically feasible;\n(3) the local government has made adequate provision for the operation and maintenance of the project;\n(4) the project proposer has fully explored the use of conservation investment plan opportunities under section 216B.241 with the utilities providing gas and electric service to the project;\n(5) the project is calculated to result in a positive cash flow in each year the financing agreement is in effect; and\n(6) adequate money will be available to the commissioner to fulfill the supplemental cash flow agreement.\nEnergy improvement projects under this section are not subject to section 123B.71.\nProgram costs incurred by the commissioner or a public entity that are not direct costs to implement energy improvement projects may be paid with program money appropriated under subdivision 10.\nPetroleum violation escrow funds appropriated to the commissioner by Laws 1988, chapter 686, article 1, section 38, for state energy loan programs for schools, hospitals, and public buildings, and reappropriated by Laws 2007, chapter 57, article 2, section 30, are appropriated to the commissioner for the purposes of this section and are available until spent. The commissioner may transfer up to $1,000,000 of this appropriation to the commissioner of administration for the purposes of section 16B.322.\nA utility or association may count toward its energy-savings goals under section 216B.241, subdivision 1c, the energy savings resulting from its investment in an energy improvement project.\nBeginning January 15, 2009, and each year thereafter, the commissioner shall submit to the chairs and ranking minority members of the senate and house of representatives committees on energy finance a report containing, at a minimum, the following information regarding projects implemented under this section:\n(1) the total number of projects;\n(2) the amount of calculated and, if available, actual energy savings for each project;\n(3) the cost of each project; and\n(4) the total amount paid for technical services provided under subdivision 4 for each project.",
	"repealed": false
}