{
	"id": "103H.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/103H.201",
	"title": "103H.201 HEALTH RISK LIMITS.",
	"text": "(a) If groundwater quality monitoring results show that there is a degradation of groundwater, the commissioner of health may promulgate health risk limits under subdivision 2 for substances degrading the groundwater.\n(b) Health risk limits shall be determined by two methods depending on their toxicological end point.\n(c) For systemic toxicants that are not carcinogens, the adopted health risk limits shall be derived using United States Environmental Protection Agency risk assessment methods using a reference dose, a drinking water equivalent, and a relative source contribution factor.\n(d) For toxicants that are known or probable carcinogens, the adopted health risk limits shall be derived from a quantitative estimate of the chemical's carcinogenic potency published by the United States Environmental Protection Agency or determined by the commissioner to have undergone thorough scientific review.\n(a) Health risk limits shall be adopted by rule.\n(b) If the commissioner determines that emergency conditions exist and the public health and welfare require the health risk limits to be adopted as soon as possible, the commissioner shall promulgate the adopted health risk limits notwithstanding chapter 14 but the adopted health risk limits adopted under this paragraph are only effective for one year.\n(a) The commissioner shall review each adopted health risk limit at least every four years.\n(b) The commissioner may revise health risk limits under subdivision 2.\n(a) Notwithstanding and in lieu of subdivision 2, until November 1, 1994, the commissioner may adopt recommended allowable limits, and related toxicological end points, established by the commissioner on or before February 15, 1994, as health risk limits under this subdivision. Before a recommended allowable limit is adopted as an adopted health risk limit under this subdivision, the commissioner shall:\n(1) publish in the State Register and disseminate through the Minnesota Extension Service and through soil and water conservation districts notice of intent to adopt a recommended allowable limit as an adopted health risk limit for specific substances and shall solicit information on the health impacts of the substance;\n(2) publish the recommended allowable limit in the State Register and disseminate through the Minnesota Extension Service and through soil and water conservation districts allowing 60 days for public comment; and\n(3) publish the adopted recommended allowable limit in the State Register and, at the same time, make available a summary of the public comments received and the commissioner's responses to the comments.\n(b) A recommended allowable limit adopted by the commissioner as an adopted health risk limit under this subdivision may be challenged in the manner provided in sections 14.44 and 14.45.\n(c) During the comment period under paragraph (a), clause (2), 25 or more persons may submit a written request for a public hearing as provided under section 14.25 for any health risk limits as adopted under this subdivision.",
	"repealed": false
}