{
	"id": "184B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/184B.03",
	"title": "184B.03 INSPECTION.",
	"text": "(a) An amusement ride must be inspected at least once annually by a certified amusement ride inspector. The certified amusement ride inspector must be either:\n(1) an employee of the insurance company that insures the amusement ride; or\n(2) an independent inspection service provider that the insurance company or owner, or the State Agricultural Society, has contracted with, or an employee of the independent inspection service provider. If the certified amusement ride inspector is not an employee or agent of the insurance company that insures the amusement ride, then the independent inspection service provider must, before performing the inspection, provide proof of liability insurance in the amount of $1,000,000 to the insurance company or owner, or the State Agricultural Society, with whom the independent service provider has contracted.\n(b) Amusement rides that are not operated in Minnesota on a continual year-round basis must be inspected in the same calendar year and prior to July 1, or the first operation in Minnesota, whichever is earlier. Amusement rides that did not pass an inspection required by this section in the previous year must be inspected before being operated in Minnesota.\n(c) If an inspection reveals that an amusement ride does not meet the current American Society for Testing and Materials (ASTM) Standards on Amusement Rides and Devices, F 846-92 and F 893-04, the insurer or independent inspection service provider must notify the owner of all defects.\n(d) No person shall operate an amusement ride unless: (1) the amusement ride passed the most recent annual inspection required by this section; or (2) all defects identified during the most recent annual inspection have been corrected and the amusement ride passed a reinspection.\n(e) All inspections and reinspections required by this section must include evaluation consistent with the current ASTM Standards on Amusement Rides and Devices, F 846-92 and F 893-04. All owners and operators must permit reasonable inspection of an amusement ride by the certified amusement ride inspector selected by the insurer or independent inspection service provider.\n(f) The inspections required by this section are in addition to any other inspections required or permitted by law.\n(g) Before the amusement ride is operated, an owner of an amusement ride must file with each sponsor, lessor, landowner, or other person who has contracted for the amusement ride to be offered to any riders an inspection affidavit attesting that the amusement ride passed the most recent inspection or reinspection required by this section. The inspection affidavit shall identify the amusement ride by name, manufacturer, and serial number, the date inspection was performed, and the inspector's name and certification number.\n(h) An owner of an amusement ride, or the State Agricultural Society on its behalf, must also file the affidavit of inspection with the commissioner not later than ten days after the completion of each inspection, required by this section, that the amusement ride passes.\nNo person shall operate an amusement ride unless a daily inspection consistent with the current ASTM Standards on Amusement Rides and Devices, F 770-93, has been performed according to this section on the day of operation. At a minimum, an owner or operator who is 18 years of age or older, or certified amusement ride inspector shall perform the daily inspections required by ASTM Standards on Amusement Rides and Devices, F 770-93, sections 4.1.4.1 and 4.1.4.4, before the ride is put into operation that day. Other daily inspections required by ASTM Standards on Amusement Rides and Devices, F 770-93, sections 4.1.4.2 and 4.1.4.3, shall be performed by an owner or operator of the amusement ride or certified amusement ride inspector before the ride is put into operation that day. Each daily inspection shall be recorded in a daily logbook kept for each amusement ride. An owner of the amusement ride, or the State Agricultural Society on its behalf, shall maintain the record of daily inspections for a period of not less than three years, and shall make the record of daily inspections available to the commissioner upon request. An owner or operator shall not knowingly operate, or permit to be operated, an amusement ride that has not passed the most recent daily inspection.\nAn amusement ride that has been modified or altered in a manner that changes its dynamics or control system from the original manufacturer's design or specification since its last annual inspection must be inspected by a certified amusement ride inspector before it may be operated.\nAn amusement ride must be inspected by a certified amusement ride inspector and approved by the commissioner before it may be operated following a serious injury or illness involving the ride. A \"serious injury or illness\" has the meaning given it in section 184B.045.\nThe owner of an amusement ride must make the ride available for inspections at all reasonable times and places requested by the commissioner or a law enforcement agency.",
	"repealed": false
}