{
	"id": "514.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.011",
	"title": "514.011 NOTICE.",
	"text": "Every person who enters into a contract with the owner for the improvement of real property and who has contracted or will contract with any subcontractors or material suppliers to provide labor, skill or materials for the improvement shall include in any written contract with the owner the notice required in this subdivision and shall provide the owner with a copy of the written contract. If no written contract for the improvement is entered into, the notice must be prepared separately and delivered personally or by certified mail to the owner or the owner's authorized agent within ten days after the work of improvement is agreed upon. The notice, whether included in a written contract or separately given, must be in at least 10-point bold type, if printed, or in capital letters, if typewritten and must state as follows:\n\"(a) Any person or company supplying labor or materials for this improvement to your property may file a lien against your property if that person or company is not paid for the contributions.\n(b) Under Minnesota law, you have the right to pay persons who supplied labor or materials for this improvement directly and deduct this amount from our contract price, or withhold the amounts due them from us until 120 days after completion of the improvement unless we give you a lien waiver signed by persons who supplied any labor or material for the improvement and who gave you timely notice.\"\nA person who fails to provide the notice shall not have the lien and remedy provided by this chapter.\nThe notice required by this subdivision is not required of any person who is an owner of the improved real estate, to any corporate contractor of which the owner of the improved real estate is an officer or controlling shareholder, to any contractor who is an officer or controlling shareholder of a corporation which is the owner of the improved real estate, or to any corporate contractor managed or controlled by substantially the same persons who manage or control a corporation which is the owner of the improved real estate.\n(a) Every person who contributes to the improvement of real property so as to be entitled to a lien pursuant to section 514.01, except a party under direct contract with the owner must, as a necessary prerequisite to the validity of any claim or lien, cause to be given to the owner or the owner's authorized agent, either by personal delivery or by certified mail, not later than 45 days after the lien claimant has first furnished labor, skill or materials for the improvement, a written notice in at least 10-point bold type, if printed, or in capital letters, if typewritten, which shall state:\n\"This notice is to advise you of your rights under Minnesota law in connection with the improvement to your property.\nAny person or company supplying labor or materials for this improvement may file a lien against your property if that person or company is not paid for the contributions.\nIf we are not paid by your contractor, we can file a claim against your property for the price of our services.\nYou have the right to pay us directly and deduct this amount from the contract price, or withhold the amount due us from your contractor until 120 days after completion of the improvement unless your contractor gives you a lien waiver signed by me (us).\nWe may not file a lien if you paid your contractor in full before receiving this notice.\"\n(b) A person entitled to a lien does not lose the right to the lien for failure to strictly comply with this subdivision if a good faith effort is made to comply, unless the owner or another lien claimant proves damage as a direct result of the failure to comply.\nA contractor who contracts with any subcontractors or material suppliers to provide labor, skill or materials for the improvement shall upon request provide the subcontractor or material supplier with the name and address of the owner within 10 days of the initial request. Any contractor who fails to supply the information requested pursuant to this subdivision, is liable for any actual damages sustained or expenses incurred by the subcontractor or material supplier because of the contractor's failure to provide the information, plus reasonable attorney fees and costs.\nMS 1980 [Repealed, 1981 c 213 s 4]\nThe notice required by this section shall not be required to be given where the contractor is managed or controlled by substantially the same persons who manage or control the owner of the improved real estate.\nThe notice required by this section shall not be required to be given in connection with an improvement to real property consisting of or providing more than four family units when the improvement is wholly residential in character.\nThe notice required by this section shall not be required to be given in connection with an improvement to real property which is not in agricultural use and which is wholly or partially nonresidential in use if the work or improvement:\n(a) is to provide or add more than 5,000 total usable square feet of floor space; or\n(b) is an improvement to real property where the existing property contains more than 5,000 total usable square feet of floor space; or\n(c) is an improvement to real property which contains more than 5,000 square feet and does not involve the construction of a new building or an addition to or the improvement of an existing building.\nFor the purposes of this subdivision, \"agricultural use\" shall have the meaning given to it in section 473H.02, subdivision 3.\nFor the purposes of clause (c), improvements include, but are not limited to, clearing, excavating, grading, filling in, landscaping, well digging, drilling or repairing, paving, surfacing or striping parking lots, digging or repairing a ditch, drain, or reservoir.\nFor the purposes of this section, \"owner\" means the owner of any legal or equitable interest in real property whose interest in the property (1) is known to one who contributes to the improvement of the real property, or (2) has been recorded or filed for record if registered land, and who enters into a contract for the improvement of the real property.\nMS 1989 [Repealed, 1989 c 160 s 4]",
	"repealed": false
}