{
	"id": "216B.1636",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1636",
	"title": "216B.1636 RECOVERY OF ELECTRIC UTILITY INFRASTRUCTURE COSTS.",
	"text": "(a) \"Electric utility\" means a public utility as defined in section 216B.02, subdivision 4, that furnishes electric service to retail customers.\n(b) \"Electric utility infrastructure costs\" or \"EUIC\" means costs for electric utility infrastructure projects that were not included in the electric utility's rate base in its most recent general rate case.\n(c) \"Electric utility infrastructure projects\" means projects owned by an electric utility that:\n(1) replace or modify existing electric utility infrastructure, including utility-owned buildings, if the replacement or modification is shown to conserve energy or use energy more efficiently, consistent with section 216B.241, subdivision 1c; or\n(2) conserve energy or use energy more efficiently by using waste heat recovery converted into electricity as defined in section 216B.241, subdivision 1, paragraph (o).\n(a) The commission may approve an electric utility's petition for a rate schedule to recover EUIC under this section. An electric utility may petition the commission to recover a rate of return, income taxes on the rate of return, incremental property taxes, if any, plus incremental depreciation expense associated with EUIC.\n(b) The filing is subject to the following:\n(1) an electric utility may submit a filing under this section no more than once per year; and\n(2) an electric utility must file sufficient information to satisfy the commission regarding the proposed EUIC or be subject to denial by the commission. The information includes, but is not limited to:\n(i) the location, description, and costs associated with the project;\n(ii) evidence that the electric utility infrastructure project will conserve energy or use energy more efficiently than similar utility facilities currently used by the electric utility;\n(iii) the proposed schedule for implementation;\n(iv) a description of the costs, and salvage value, if any, associated with the existing infrastructure replaced or modified as a result of the project;\n(v) the proposed rate design and an explanation of why the proposed rate design is in the public interest;\n(vi) the magnitude and timing of any known future electric utility projects that the utility may seek to recover under this section;\n(vii) the magnitude of EUIC in relation to the electric utility's base revenue as approved by the commission in the electric utility's most recent general rate case, exclusive of fuel cost adjustments;\n(viii) the magnitude of EUIC in relation to the electric utility's capital expenditures since its most recent general rate case;\n(ix) the amount of time since the utility last filed a general rate case and the utility's reasons for seeking recovery outside of a general rate case;\n(x) documentation supporting the calculation of the EUIC; and\n(xi) a cost and benefit analysis showing that the electric utility infrastructure project is in the public interest.\n(c) Upon approval of the proposed projects and associated EUIC rate schedule, the utility may implement the electric utility infrastructure projects.\nThe commission may issue orders necessary to implement and administer this section.",
	"repealed": false
}