{
	"id": "504B.114",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.114",
	"title": "504B.114 PET DECLAWING AND DEVOCALIZATION PROHIBITED.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Animal\" has the meaning given in section 343.20, subdivision 2.\n(c) \"Application for occupancy\" means all phases of the process of applying for the right to occupy a real property, including but not limited to filling out applications, interviewing, and submitting references.\n(d) \"Claw\" means a hardened keratinized modification of the epidermis or a hardened keratinized growth that extends from the end of the digits of certain mammals, birds, reptiles, and amphibians that is commonly referred to as a claw, talon, or nail.\n(e) \"Declawing\" means performing, procuring, or arranging for any procedure, such as an onychectomy, tendonectomy, or phalangectomy, to remove or prevent the normal function of an animal's claw or claws.\n(f) \"Devocalizing\" means performing, procuring, or arranging for any surgical procedure, such as a vocal cordectomy, to remove an animal's vocal cords or to prevent the normal function of an animal's vocal cords.\nA landlord who allows an animal on the premises shall not:\n(1) advertise the availability of a real property for occupancy in a manner designed to discourage application for occupancy of that real property because an applicant's animal has not been declawed or devocalized;\n(2) refuse to allow the occupancy of a real property, refuse to negotiate the occupancy of a real property, or otherwise make unavailable or deny to another person the occupancy of a real property because of that person's refusal to declaw or devocalize an animal; or\n(3) require a tenant or occupant of real property to declaw or devocalize an animal allowed on the premises.\nAny requirement or lease provision that violates this subdivision is void and unenforceable.\n(a) A city attorney, a county attorney, or the attorney general may bring an action in district court to obtain injunctive relief for a violation of this section and to enforce the civil penalties provided in this subdivision.\n(b) In addition to any other penalty allowed by law, a violation of subdivision 2, clause (1), shall result in a civil penalty of not more than $1,000 per advertisement, to be paid to the entity that is authorized to bring the action under this section.\n(c) In addition to any other penalty allowed by law, a violation of subdivision 2, clause (2) or (3), shall result in a civil penalty of not more than $1,000 per animal, to be paid to the entity that is authorized to bring the action under this section.",
	"repealed": false
}