{
	"id": "278.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/278.14",
	"title": "278.14 REFUNDS OF MISTAKENLY BILLED TAXES.",
	"text": "A county must pay a refund of a mistakenly billed tax as provided in this section. As used in this section, \"mistakenly billed tax\" means an amount of property tax that was billed, to the extent the amount billed exceeds the accurate tax amount due to a misclassification of the owner's property under section 273.13 or a mathematical error in the calculation of the tax on the owner's property, together with any penalty or interest paid on that amount. This section applies only to taxes payable in the current year and the two prior years. As used in this section, \"mathematical error\" is limited to an error in:\n(1) converting the market value of a property to tax capacity or to a referendum market value;\n(2) application of the tax rate as computed by the auditor under sections 275.08, subdivisions 1b, 1c, and 1d; 276A.06, subdivisions 4 and 5; and 473F.07, subdivisions 4 and 5, to the property's tax capacity or referendum market value; or\n(3) calculation of or eligibility for a credit.\nThe remedy provided under this section does not apply to a misclassification under section 273.13 that is due to the failure of the property owner to apply for the correct classification as required by law.\nA refund of mistakenly billed tax must be paid upon verification of a claim made in a written application by the owner of the property or upon discovery of the mistakenly billed tax by the county. Refunds of overpayments will be made as provided in section 278.12.\nIf the county rejects a claim by a property owner under subdivision 2, it must notify the property owner of that decision within 90 days of receipt of the claim. The property owner may appeal that decision to the Tax Court within 60 days after receipt of a notice from the county of the decision. Relief granted by the Tax Court is limited to current year taxes, and taxes in the two prior years.",
	"repealed": false
}