{
	"id": "571.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.73",
	"title": "571.73 PROPERTY ATTACHABLE BY GARNISHMENT; GOOD FAITH REQUIREMENT.",
	"text": "Except as provided in subdivision 4 and section 571.79, service of the garnishment summons upon the garnishee shall obligate the garnishee to retain possession and control of the disposable earnings, indebtedness, money, and property of the debtor specified in subdivision 3, except that the garnishee shall not retain possession and control of disposable earnings, indebtedness, money, or property of the debtor in the garnishee's possession or under the garnishee's control in excess of 110 percent of the amount claimed by the creditor in the garnishment summons.\nThe garnishee is not liable to the debtor, creditor, or other person for wrongful retention if the garnishee retains disposable earnings, indebtedness, money, or property of the debtor or any other person, pending the garnishee's disclosure or consistent with the disclosure the garnishee makes, if the garnishee has a good faith belief that the property retained is subject to the garnishment summons. In addition, the garnishee may, at any time before or after disclosure, proceed under rule 67 of the Minnesota Rules of Civil Procedure for the District Courts to make deposit into court. No garnishee is liable for damages if the garnishee complies with the provisions of this chapter.\nSubject to the exemptions provided by sections 550.37 and 571.922 and any other applicable statute, the service of a garnishment summons under this chapter attaches:\n(1) except as otherwise provided in clause (4), all unpaid nonexempt disposable earnings owed or to be owed by the garnishee and earned or to be earned by the debtor within the pay period in which the garnishment summons is served and within all subsequent pay periods whose paydays occur within the 90 days after the date of service of the garnishment summons. \"Payday\" means the day upon which the garnishee pays earnings to the debtor in the ordinary course of business. If the debtor has no regular paydays, \"payday\" means the 15th day and the last day of each month;\n(2) all other nonexempt indebtedness, money, or other property due or belonging to the debtor and owing by the garnishee or in the possession or under the control of the garnishee at the time of service of the garnishment summons, whether or not the same has become payable. The garnishee shall not be compelled to pay or deliver the same before the time specified by any agreement unless the agreement was fraudulently contracted to defeat a garnishment or other collection remedy;\n(3) all other nonexempt intangible or tangible personal property of the debtor in the possession or under the control of the garnishee at the time of service of the garnishment summons, including property of any kind due from or in the hands of an executor, administrator, personal representative, receiver, or trustee, and all written evidences of indebtedness whether or not negotiable or not yet underdue or overdue; and\n(4) for a garnishment on a judgment for child support by a county, all unpaid nonexempt disposable earnings owed or to be owed by the garnishee and earned or to be earned by the debtor within the pay period in which the garnishment summons is served and within all subsequent pay periods until the judgment is satisfied.\nThe following property is not subject to attachment by garnishment:\n(1) any indebtedness, money, or other property due to the debtor, unless at the time of the garnishment summons the same is due absolutely or does not depend upon any contingency;\n(2) any judgment in favor of the debtor against the garnishee, if the garnishee or the garnishee's property is liable on an execution levy upon the judgment;\n(3) any debt owed by the garnishee to the debtor for which any negotiable instrument has been issued or endorsed by the garnishee;\n(4) any indebtedness, money, or other property due to the debtor where the debtor is a bank, savings bank, trust company, credit union, savings association, or industrial loan and thrift companies with deposit liabilities;\n(5) any indebtedness, money, or other property due to the debtor with a cumulative value of less than $10; and\n(6) any disposable earnings, indebtedness, money, or property that is exempt under Minnesota or federal law.",
	"repealed": false
}