{
	"id": "245.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.03",
	"title": "245.03 DEPARTMENT OF HUMAN SERVICES ESTABLISHED; COMMISSIONER.",
	"text": "There is created a Department of Human Services. A commissioner of human services shall be appointed by the governor under the provisions of section 15.06. The commissioner shall be selected on the basis of ability and experience in welfare and without regard to political affiliations. The commissioner may appoint up to two deputy commissioners.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible, including the authority to consolidate different nonentitlement grant programs, having similar functions or serving similar populations, as may be determined by the commissioner, while protecting the original purposes of the programs. Nonentitlement grant funds consolidated by the commissioner shall be reflected in the department's biennial budget. With approval of the commissioner, vendors who are eligible for funding from any of the commissioner's granting authority under section 256.01, subdivision 2, paragraph (a), clause (6), may submit a single application for a grant agreement including multiple awards;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(6) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1; and\n(7) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department.",
	"repealed": false
}