{
	"id": "13.3806",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.3806",
	"title": "13.3806 PUBLIC HEALTH DATA CODED ELSEWHERE.",
	"text": "The sections referred to in this section are codified outside this chapter. Those sections classify data on public health as other than public, place restrictions on access to government data, or involve data sharing.\nData gathered by the commissioner of health to identify the body of a person believed to have died due to a declared emergency as defined in section 12.03, subdivision 1e, the circumstances of death, and disposition of the body are classified in and may be released according to section 12.381, subdivision 2.\n(a) Encounter data. Data on providers required to submit encounter data to a private entity designated by the commissioner of health under section 62U.04, subdivision 4, are classified under section 62U.04, subdivision 4, paragraph (c).\n(b) Pricing data. Pricing data required to be submitted to the commissioner of health by certain health plan companies and third-party administrators under section 62U.04, subdivision 5, are classified under section 62U.04, subdivision 5, paragraph (c).\nData practices provisions regarding the health information exchange are contained in section 62J.498, subdivision 2, paragraphs (b), (c), (d), and (e).\nUse of data collected by the commissioner of health under sections 176.234, 268.19, and 270B.14, subdivision 11, is governed by section 144.0525.\nData held by the commissioner of health in connection with public health studies are classified under section 144.053.\n(a) Parents' Social Security numbers; birth record. Parents' Social Security numbers provided for a child's birth record are classified under section 144.215, subdivision 4.\n(b) Foundling registration. The report of the finding of an infant of unknown parentage is classified under section 144.216, subdivision 2.\n(c) New record of birth. In circumstances in which a new record of birth may be issued under section 144.218, the original record of birth is classified as provided in that section.\n(d) Vital records. Physical access to vital records is governed by section 144.225, subdivision 1.\n(e) Birth record of child of unmarried parents. Access to the birth record of a child whose parents were not married to each other when the child was conceived or born is governed by sections 144.225, subdivisions 2 and 4, and 257.73.\n(f) Health data for birth registration. Health data collected for birth registration or fetal death reporting are classified under section 144.225, subdivision 2a.\n(g) Birth record; sharing. Sharing of birth record data and data prepared under section 257.75, is governed by section 144.225, subdivision 2b.\n(h) Group purchaser identity for birth registration. Classification of and access to the identity of a group purchaser collected in association with birth registration is governed by section 144.225, subdivision 6.\nInformation collected for the birth defects information system is governed by section 144.2217.\n(a) Student health data. Data collected for the health record of a school child are governed by section 144.29.\n(b) Tuberculosis screening. Access to health records of persons enrolled in or employed by a school or school district for tuberculosis screening purposes is governed by section 144.441, subdivision 8.\nAccess to health records is governed by sections 144.291 to 144.298 and 299A.85, subdivision 8.\nSharing of immunization data is governed by section 144.3351.\nSharing of information regarding the hepatitis B infection status of a newborn's mother is governed by section 144.3352.\nData identifying a person and the person's human leukocyte antigen type which is maintained by a government entity are classified under section 144.336, subdivision 1.\nData in a health directive issued by the commissioner of health or a community health board are classified in section 144.4186.\nData in a directive issued by the commissioner of health under section 144.4195, subdivision 2, to isolate or quarantine a person or group of persons are classified in section 144.4195, subdivision 6.\nData collected by the commissioner of health in connection with a tuberculosis health threat are classified under section 144.4813.\nEpidemiologic data that identify individuals are classified under section 144.6581.\nData on individuals with a brain or spinal injury or who sustain major trauma that are collected by the commissioner of health are classified under sections 144.6071 and 144.665.\nData on individuals collected by the cancer reporting system are classified pursuant to section 144.69.\nData sharing between the emergency medical services agency and facilities is governed by section 144.7402, subdivision 3.\nInformation concerning test results is governed by section 144.7411.\nData on individuals exposed to lead in their residences are classified under sections 144.9502, subdivision 9, and 144.9504, subdivision 2.\n[Repealed, 2016 c 158 art 4 s 5]\n[Repealed, 2001 c 211 s 4]\nAccess to and classification of medical data and health records related to maternal death studies are governed by section 145.901.\nDisclosure of data related to hazardous substance exposure is governed by section 145.94.\nData on patients in information and reports related to the designation and redesignation of trauma hospitals is classified under section 144.605, subdivision 9.\nData collected under the registry program authorized under sections 152.22 to 152.37 are governed by sections 152.25, subdivision 1; 152.28, subdivision 2; and 152.37, subdivision 3.",
	"repealed": false
}