{
	"id": "458A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/458A.02",
	"title": "458A.02 AREA; COMMISSION.",
	"text": "There is hereby created a St. Cloud Metropolitan Transit Commission, hereinafter referred to as \"the commission.\" The St. Cloud transit area is composed of the city of St. Cloud, the city of Waite Park, the city of Sauk Rapids, which together may hereinafter be referred to as \"the transit area.\" Each of such cities, statutory cities, or townships are entitled to appoint, by resolution of the governing body of such municipality, one representative member to the commission, except that the city of St. Cloud shall appoint two members. Each representative member shall be entitled to one vote. Each representative member shall be a commissioner. The commission may, by agreement authorized by a majority of the members present at a meeting duly convened, include new municipalities in the transit area or, provided, that each new inclusion of a municipality shall entitle such municipality to one representative member on the commission.\nThe terms of the first transit commissioners shall expire on July 1 in the respective calendar years following 1969 as follows: one commissioner representing the city of St. Cloud in the first calendar year; one commissioner representing the city of Waite Park in the second calendar year; one commissioner representing the city of Sauk Rapids, and one commissioner representing the city of St. Cloud in the third calendar year. In the event that the membership of the commission is increased by the inclusion of additional municipalities as provided in subdivision 1, the initial terms of the new members shall be resolved by a rule of the commission. Succeeding terms of all commissioners shall be three years. Each member shall serve until a successor has been selected and has qualified unless tenure is terminated by resignation, removal, death, or otherwise as provided by law.\nAny vacancy in a commission membership, except a vacancy occurring by reason of the withdrawal of a municipality, shall be filled for the unexpired term in like manner as provided for selection of the regular incumbent. Any vacancy occurring by reason of the withdrawal of a municipality shall not be filled.\nThe first commissioners shall be selected as hereinbefore provided within 60 days after July 1, 1969. A successor to each commissioner shall be so selected at any time within 60 days before the expiration of a term. A selection to fill a vacancy shall be made within 60 days after the occurrence of the vacancy.\nA certificate of the selection of every commissioner, stating the term for which selected, shall be made by the selecting municipality or its presiding and recording officers, with approval appended by other authority, if required, and filed with the secretary of state. Counterparts thereof shall be furnished to the commissioner and the secretary of the commission.\nNo commissioner and no officer or employee of the commission having administrative or policy-making authority shall:\n(a) have any private financial interest, directly or indirectly, in any contract, work, or business of the commission or any public transit system subject to regulation by the commission;\n(b) be in the employ of or hold any stock, bond, investment, or other financial interest in or private business relationship to any operator of a public transit system in the transit area.\nAny violation of the provisions of this subdivision shall be a gross misdemeanor, and upon conviction thereof the defendant shall be deemed to be automatically removed from the position upon or under the commission forthwith, and shall be disqualified from holding such position.",
	"repealed": false
}