{
	"id": "268B.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.23",
	"title": "268B.23 LIEN; LEVY; SETOFF; AND CIVIL ACTION.",
	"text": "(a) Any amount due under this chapter, from an applicant or an employer, becomes a lien upon all the property, within this state, both real and personal, of the person liable, from the date of assessment. For the purposes of this section, \"date of assessment\" means the date the obligation was due.\n(b) The lien is not enforceable against any purchaser, mortgagee, pledgee, holder of a Uniform Commercial Code security interest, mechanic's lien, or judgment lien creditor, until a notice of lien has been filed with the county recorder of the county where the property is situated, or in the case of personal property belonging to a nonresident person in the Office of the Secretary of State. When the notice of lien is filed with the county recorder, the fee for filing and indexing is as provided in sections 272.483 and 272.484.\n(c) Notices of liens, lien renewals, and lien releases, in a form prescribed by the commissioner, may be filed with the county recorder or the secretary of state by mail or personal delivery. The filing officer, whether the county recorder or the secretary of state, must endorse and index a printout of the notice as if the notice had been mailed or delivered.\n(d) County recorders and the secretary of state must enter information on lien notices, renewals, and releases into their respective database system.\n(e) The lien imposed on personal property, even though properly filed, is not enforceable against a purchaser of tangible personal property purchased at retail or personal property listed as exempt in sections 550.37, 550.38, and 550.39.\n(f) A notice of lien filed has priority over any security interest arising under chapter 336, article 9, that is perfected prior in time to the lien imposed by this subdivision, but only if:\n(1) the perfected security interest secures property not in existence at the time the notice of lien is filed; and\n(2) the property comes into existence after the 45th calendar day following the day the notice of lien is filed, or after the secured party has actual notice or knowledge of the lien filing, whichever is earlier.\n(g) The lien is enforceable from the time the lien arises and for ten years from the date of filing the notice of lien. A notice of lien may be renewed before expiration for an additional ten years.\n(h) The lien is enforceable by levy under subdivision 2 or by judgment lien foreclosure under chapter 550.\n(i) The lien may be imposed upon property defined as homestead property in chapter 510 but may be enforced only upon the sale, transfer, or conveyance of the homestead property.\n(j) The commissioner may sell and assign to a third party the commissioner's right of redemption in specific real property for liens filed under this subdivision. The assignee is limited to the same rights of redemption as the commissioner, except that in a bankruptcy proceeding, the assignee does not obtain the commissioner's priority. Any proceeds from the sale of the right of redemption are credited to the family and medical benefit insurance account.\n(a) If any amount due under this chapter, from an applicant or an employer, is not paid when due, the amount may be collected by the commissioner by direct levy upon all property and rights of property of the person liable for the amount due except property exempt from execution under section 550.37. For the purposes of this section, \"levy\" includes the power of distraint and seizure by any means.\n(b) In addition to a direct levy, the commissioner may issue a warrant to the sheriff of any county who must proceed within 60 calendar days to levy upon the property or rights to property of the delinquent person within the county, except property exempt under section 550.37. The sheriff must sell that property necessary to satisfy the total amount due, together with the commissioner's and sheriff's costs. The sales are governed by the law applicable to sales of like property on execution of a judgment.\n(c) Notice and demand for payment of the total amount due must be mailed to the delinquent person at least ten calendar days before action being taken under paragraphs (a) and (b).\n(d) If the commissioner has reason to believe that collection of the amount due is in jeopardy, notice and demand for immediate payment may be made. If the total amount due is not paid, the commissioner may proceed to collect by direct levy or issue a warrant without regard to the ten calendar day period.\n(e) In executing the levy, the commissioner must have all of the powers provided in chapter 550 or any other law that provides for execution against property in this state. The sale of property levied upon and the time and manner of redemption is as provided in chapter 550. The seal of the court is not required. The levy may be made whether or not the commissioner has commenced a legal action for collection.\n(f) Where any assessment has been made by the commissioner, the property seized for collection of the total amount due must not be sold until any determination of liability has become final. No sale may be made unless a portion of the amount due remains unpaid for a period of more than 30 calendar days after the determination of liability becomes final. Seized property may be sold at any time if:\n(1) the delinquent person consents in writing to the sale; or\n(2) the commissioner determines that the property is perishable or may become greatly reduced in price or value by keeping, or that the property cannot be kept without great expense.\n(g) Where a levy has been made to collect the amount due and the property seized is properly included in a formal proceeding commenced under sections 524.3-401 to 524.3-505 and maintained under full supervision of the court, the property may not be sold until the probate proceedings are completed or until the court orders.\n(h) The property seized must be returned if the owner:\n(1) gives a surety bond equal to the appraised value of the owner's interest in the property, as determined by the commissioner; or\n(2) deposits with the commissioner security in a form and amount the commissioner considers necessary to insure payment of the liability.\n(i) If a levy or sale would irreparably injure rights in property that the court determines superior to rights of the state, the court may grant an injunction to prohibit the enforcement of the levy or to prohibit the sale.\n(j) Any person who fails or refuses to surrender without reasonable cause any property or rights to property subject to levy is personally liable in an amount equal to the value of the property or rights not so surrendered, but not exceeding the amount due.\n(k) If the commissioner has seized the property of any individual, that individual may, upon giving 48 hours notice to the commissioner and to the court, bring a claim for equitable relief before the district court for the release of the property upon terms and conditions the court considers equitable.\n(l) Any person in control or possession of property or rights to property upon which a levy has been made who surrenders the property or rights to property, or who pays the amount due is discharged from any obligation or liability to the person liable for the amount due with respect to the property or rights to property.\n(m) The notice of any levy may be served personally or by mail.\n(n) The commissioner may release the levy upon all or part of the property or rights to property levied upon if the commissioner determines that the release will facilitate the collection of the liability, but the release does not prevent any subsequent levy. If the commissioner determines that property has been wrongfully levied upon, the commissioner must return:\n(1) the specific property levied upon, at any time; or\n(2) an amount of money equal to the amount of money levied upon, at any time before the expiration of nine months from the date of levy.\n(o) Regardless of section 52.12, a levy upon a person's funds on deposit in a financial institution located in this state, has priority over any unexercised right of setoff of the financial institution to apply the levied funds toward the balance of an outstanding loan or loans owed by the person to the financial institution. A claim by the financial institution that it exercised its right to setoff before the levy must be substantiated by evidence of the date of the setoff, and verified by an affidavit from a corporate officer of the financial institution. For purposes of determining the priority of any levy under this subdivision, the levy is treated as if it were an execution under chapter 550.\n(a) Upon certification by the commissioner to the commissioner of management and budget, or to any state agency that disburses its own funds, that a person, applicant, or employer has a liability under this chapter, and that the state has purchased personal services, supplies, contract services, or property from that person, the commissioner of management and budget or the state agency must set off and pay to the commissioner an amount sufficient to satisfy the unpaid liability from funds appropriated for payment of the obligation of the state otherwise due the person. No amount may be set off from any funds exempt under section 550.37 or funds due an individual who receives assistance under chapter 256.\n(b) All funds, whether general or dedicated, are subject to setoff.\n(c) Regardless of any law to the contrary, the commissioner has first priority to setoff from any funds otherwise due from the department to a delinquent person.\n(a) Any amount due under this chapter, from an applicant or employer, may be collected by civil action in the name of the state of Minnesota. Civil actions brought under this subdivision must be heard as provided under section 16D.14. In any action, judgment must be entered in default for the relief demanded in the complaint without proof, together with costs and disbursements, upon the filing of an affidavit of default.\n(b) Any person that is not a resident of this state and any resident person removed from this state, is considered to appoint the secretary of state as its agent for the acceptance of process in any civil action. The commissioner must file process with the secretary of state, together with a payment of a fee of $15 and that service is considered sufficient service and has the same force and validity as if served personally within this state. Notice of the service of process, together with a copy of the process, must be sent by certified mail to the person's last known address. An affidavit of compliance with this subdivision, and a copy of the notice of service must be appended to the original of the process and filed in the court.\n(c) No court filing fees, docketing fees, or release of judgment fees may be assessed against the state for actions under this subdivision.\nNo injunction or other legal action to prevent the determination, assessment, or collection of any amounts due under this chapter, from an applicant or employer, are allowed.",
	"repealed": false
}