{
	"id": "574.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/574.261",
	"title": "574.261 PUBLIC WORK; SECURITY.",
	"text": "With the approval of the commissioner of administration and if the amount of the contract is not more than $5,000 a person may make a contract with the state to do public work and in place of giving the bonds required by section 574.26, submit to the commissioner of administration for deposit with the commissioner of management and budget (1) a certified check or cashier's check in the same amount as is required for a performance bond as security to protect the state, and (2) a certified or cashier's check in the same amount as is required for a payment bond for all persons furnishing labor and materials under or to perform the contract. The deposits are security for the payment, as they become due, of all just claims for labor and materials and for the performance and completion of the contract according to its terms.\nWhenever Laws 1994, chapter 419, or other law or home rule charter requires a performance bond from a contractor doing a public work project of under $50,000 for a public body, the public body may permit the contractor to provide, in place of the performance bond, an irrevocable bank letter of credit in the same amount as required for the bond and subject to the same conditions as the bond.\nA person entitled to the protection of the deposit in place of a payment bond and wishing to take advantage of its benefits shall, no later than 120 days after the person's last contribution of labor and materials was furnished to the public work that is the subject of the contract, notify in writing the commissioner of administration and the commissioner of management and budget of the person's claim, giving the names of the parties involved and the amount and nature of the claim. If an action is commenced to obtain the benefit of the deposit in place of a payment bond, a judgment must not be entered within 30 days after giving the notice of the claim and the state or any person entitled to the protection of the deposit may be admitted on its motion as a party to the action and the court shall determine the rights of all parties in the premises. In such suit in which the commissioner of management and budget is a party, the court may order the commissioner to make payment among the parties to the suit entitled to payment. If the amount of the deposit is insufficient to pay the claims in full, the court may direct that they be paid on a prorated basis. The deposit in place of a payment bond made with the commissioner under this section shall be held by the commissioner for 120 days after the last item of labor and materials was furnished to the public work that is the subject of the contract. If a claim is not filed within the 120-day period, the deposit shall be returned to the person making it. If a claim is filed within the 120-day period, the deposit shall be disbursed by the commissioner of management and budget under an order of the court.\nMoney deposited with the commissioner of management and budget under this section is annually appropriated to the commissioner of management and budget to carry out this section.",
	"repealed": false
}