{
	"id": "518.552",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.552",
	"title": "518.552 MAINTENANCE.",
	"text": "In a proceeding for dissolution of marriage or legal separation, or in a proceeding for maintenance following dissolution of the marriage by a court which lacked personal jurisdiction over the absent spouse and which has since acquired jurisdiction, the court may grant a maintenance order for either spouse if it finds that the spouse seeking maintenance:\n(a) lacks sufficient property, including marital property apportioned to the spouse, to provide for reasonable needs of the spouse considering the standard of living established during the marriage, especially, but not limited to, a period of training or education;\n(b) is unable to provide adequate self-support, after considering the standard of living established during the marriage and all relevant circumstances; or\n(c) is the custodian of a child whose condition or circumstances make it appropriate that the custodian not be required to seek employment outside the home.\nThe maintenance order shall be in amounts and for periods of time, either transitional or indefinite, as the court deems just, without regard to marital misconduct, and after considering all relevant factors including:\n(a) the financial resources of the party seeking maintenance, including marital property apportioned to the party, and the party's ability to meet needs independently, including the extent to which a provision for support of a child living with the party includes a sum for that party as custodian;\n(b) the time necessary to acquire sufficient education or training to enable the party seeking maintenance to find appropriate employment, and the probability, given the party's age and skills, of completing education or training and becoming fully or partially self-supporting;\n(c) the standard of living established during the marriage and the extent to which the standard of living was funded by debt;\n(d) the duration of the marriage and the earnings, seniority, benefits, and other employment opportunities forgone by the spouse seeking maintenance to support the other spouse or children and the length of absence from employment and the extent to which any education, skills, or experience have become outmoded and earning capacity has become permanently diminished;\n(e) the age, and physical, mental, or chemical health of both spouses;\n(f) the ability of the spouse from whom maintenance is sought to meet needs while meeting those of the spouse seeking maintenance;\n(g) the contribution of a spouse in furtherance of the other party's employment or business; and\n(h) the need and ability of each spouse to prepare for retirement and the anticipated time of retirement.\n(a) A maintenance award may be transitional or indefinite. An award of temporary maintenance issued before August 1, 2024, is deemed transitional maintenance. An award of permanent maintenance issued before August 1, 2024, is deemed indefinite maintenance. Maintenance awarded during the pendency of an initial proceeding for dissolution or legal separation pursuant to section 518.131 is deemed temporary maintenance.\n(b) For purposes of this subdivision, \"length of the marriage\" means the period from the date of the marriage until the date of the commencement of the action.\n(c) The court must determine the duration of maintenance based on the length of the marriage as follows:\n(1) when the length of the marriage is less than five years, it is rebuttably presumed that no maintenance should be awarded;\n(2) when the length of the marriage is at least five years and less than 20 years, it is rebuttably presumed that transitional maintenance should be awarded with a duration of no longer than one-half the length of the marriage if the factors set forth in subdivision 1 support an award of maintenance; and\n(3) when the length of the marriage is 20 years or more, it is rebuttably presumed that indefinite maintenance should be awarded if the factors set forth in subdivision 1 support an award of maintenance.\nSection 518.145, subdivision 2, applies to awards of spousal maintenance.\nThe parties may expressly preclude or limit modification of maintenance through a stipulation, if the court makes specific findings that the stipulation is fair and equitable, is supported by consideration described in the findings, and that full disclosure of each party's financial circumstances has occurred. The stipulation must be made a part of the judgment and decree or a post-decree stipulated order. The parties may restore the court's authority or jurisdiction to award or modify maintenance through a binding stipulation.\nUnless otherwise agreed in writing or expressly provided in the decree, the obligation to pay future maintenance is terminated upon the death of either party or the remarriage of the party receiving maintenance.\n(a) Upon the motion of either of the parties, the court may modify the amount and duration of maintenance and may issue an order that the court might have issued in the original proceeding, except as otherwise provided in this subdivision.\n(b) The terms of a maintenance order may be modified upon a showing of one or more of the following circumstances that make the terms of the existing order unreasonable and unfair:\n(1) substantially increased or decreased gross income of an obligor or obligee;\n(2) substantially increased or decreased need of an obligor or obligee; or\n(3) substantial changes in the federal or state tax laws that affect spousal maintenance.\n(c) Upon a motion to modify maintenance, including a motion to extend the duration of a maintenance award, the court shall apply, in addition to all other relevant factors, the factors for an award of maintenance under subdivisions 1 to 3 that exist at the time of the motion.\n(d) Unless the court adopts an alternative effective date under paragraph (f), a modification of maintenance, including interest that accrued pursuant to section 548.091, may be made retroactive:\n(1) for any period during which the petitioning party has a motion for modification that is pending;\n(2) from the date that the notice of the motion to modify was served on the responding party;\n(3) from the date that the notice of the motion to modify was served on the public authority if public assistance is being received; or\n(4) from the date that the notice of the motion to modify was served on the county attorney if the county attorney is the attorney of record.\n(e) The court need not hold an evidentiary hearing on a motion to modify maintenance.\n(f) The court may select an alternative effective date for a maintenance order if the parties enter into a binding agreement for an alternative effective date. The court's adoption of an alternative effective date under this paragraph must not be considered a retroactive modification of maintenance.\n(a) Spousal maintenance may be modified pursuant to subdivision 5b based on the cohabitation by the maintenance obligee with another adult following dissolution of the marriage. The modification may consist of a reduction, suspension, reservation, or termination of maintenance. In determining if maintenance should be modified due to cohabitation, the court shall consider:\n(1) whether the obligee would marry the cohabitant but for the maintenance award;\n(2) the economic benefit the obligee derives from the cohabitation;\n(3) the length of the cohabitation and the likely future duration of the cohabitation; and\n(4) the economic impact on the obligee if maintenance is modified and the cohabitation ends.\n(b) The court must not modify a maintenance award based solely on cohabitation if a marriage between the obligee and the cohabitant would be prohibited under section 517.03, subdivision 1, clause (2) or (3). A modification under this subdivision must be precluded or limited to the extent the parties have entered into a private agreement under subdivision 5.\n(c) A motion to modify a spousal maintenance award on the basis of cohabitation may not be brought within one year of the date of entry of the decree of dissolution or legal separation that orders spousal maintenance, unless the parties have agreed in writing that a motion may be brought or the court finds that failing to allow the motion to proceed would create an extreme hardship for one of the parties.\n(a) If a party retires, spousal maintenance may be modified. The modification of maintenance may consist of a reduction, suspension, reservation, or termination of maintenance.\n(b) In determining if maintenance should be modified due to a party's retirement, the court shall consider:\n(1) whether the retirement is in good faith or is an unjustifiable self-limitation of income;\n(2) whether the party has attained the age to receive the party's full retirement benefits under section 216 of the Social Security Act, United States Code, title 42, section 416, or the customary age for retirement in the party's occupation;\n(3) whether a party has reasonably and prudently managed the party's assets since the dissolution of the marriage; and\n(4) the financial resources available to both parties.\n(c) It is presumed that when a party has attained the age to receive the party's full retirement benefits under section 216 of the Social Security Act, United States Code, title 42, section 416, or the customary age for retirement in the party's occupation, the party will use both income and assets to meet the party's needs.\n(d) A party must not be presumed to have retired in bad faith or to have unjustifiably self-limited the party's income in the event that the party's retirement is occurring on or after the date the party attains the age to receive full retirement benefits under section 216 of the Social Security Act, United States Code, title 42, section 416, or the customary age for retirement in the party's occupation.\n(e) A motion to modify maintenance due to retirement may be brought before a party actually retires provided that the moving party specifies the date by which the party's retirement will occur. The court may then make the modification effective as of the actual date of retirement.\nThe state court administrator's office shall prepare and make available to court administrators, obligors, and persons to whom spousal maintenance is owed a form to be submitted in support of a motion for a modification of an order for maintenance or for contempt of court.",
	"repealed": false
}