{
	"id": "142A.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.65",
	"title": "142A.65 RELATIVE CUSTODY ASSISTANCE.",
	"text": "This section may be cited as the \"Relative Custody Assistance Act.\"\nThe provisions of this section apply to those situations in which the legal and physical custody of a child is established with a relative or important friend with whom the child has resided or had significant contact according to section 260C.515, subdivision 4, by a district court order issued on or after July 1, 1997, but on or before November 26, 2014, or a tribal court order issued on or after July 1, 2005, but on or before November 26, 2014, when the child has been removed from the care of the parent by previous district or tribal court order.\nFor purposes of this section, the terms defined in this subdivision have the meanings given them.\n(a) \"MFIP standard\" means the transitional standard used to calculate assistance under the MFIP program, or, if permanent legal and physical custody of the child is given to a relative custodian residing outside of Minnesota, the analogous transitional standard or standard of need used to calculate assistance under the TANF program of the state where the relative custodian lives.\n(b) \"Local agency\" means the county social services agency or tribal social services agency with legal custody of a child prior to the transfer of permanent legal and physical custody.\n(c) \"Permanent legal and physical custody\" means permanent legal and physical custody ordered by a Minnesota Juvenile Court under section 260C.515, subdivision 4.\n(d) \"Relative\" has the meaning given in section 260C.007, subdivision 26b or 27.\n(e) \"Relative custodian\" means a person who has permanent legal and physical custody of a child. When siblings, including half-siblings and stepsiblings, are placed together in permanent legal and physical custody, the person receiving permanent legal and physical custody of the siblings is considered a relative custodian of all of the siblings for purposes of this section.\n(f) \"Relative custody assistance agreement\" means an agreement entered into between a local agency and a person who has been or will be awarded permanent legal and physical custody of a child.\n(g) \"Relative custody assistance payment\" means a monthly cash grant made to a relative custodian pursuant to a relative custody assistance agreement and in an amount calculated under subdivision 7.\n(h) \"Remains in the physical custody of the relative custodian\" means that the relative custodian is providing day-to-day care for the child and that the child lives with the relative custodian; absence from the relative custodian's home for a period of more than 120 days raises a presumption that the child no longer remains in the physical custody of the relative custodian.\n(a) When a local agency seeks a court order under section 260C.515, subdivision 4, to establish permanent legal and physical custody of a child with a relative or important friend with whom the child has resided or had significant contact, or if such an order is issued by the court, the local agency shall perform the duties in this subdivision.\n(b) As soon as possible after the local agency determines that it will seek to establish permanent legal and physical custody of the child or, if the agency did not seek to establish custody, as soon as possible after the issuance of the court order establishing custody, the local agency shall inform the relative custodian about the relative custody assistance program, including eligibility criteria and payment levels. Anytime prior to, but not later than seven days after, the date the court issues the order establishing permanent legal and physical custody of the child, the local agency shall determine whether the eligibility criteria in subdivision 6 are met to allow the relative custodian to receive relative custody assistance. Not later than seven days after determining whether the eligibility criteria are met, the local agency shall inform the relative custodian of its determination and of the process for appealing that determination under subdivision 9.\n(c) If the local agency determines that the relative custodian is eligible to receive relative custody assistance, the local agency shall prepare the relative custody assistance agreement and ensure that it meets the criteria of subdivision 6.\n(d) The local agency shall make monthly payments to the relative custodian as set forth in the relative custody assistance agreement. On a quarterly basis and on a form to be provided by the commissioner, the local agency shall make claims for reimbursement from the commissioner for relative custody assistance payments made.\n(e) For a relative custody assistance agreement that is in place for longer than one year, and as long as the agreement remains in effect, the local agency shall send an annual affidavit form to the relative custodian of the eligible child within the month before the anniversary date of the agreement. The local agency shall monitor whether the annual affidavit is returned by the relative custodian within 30 days following the anniversary date of the agreement. The local agency shall review the affidavit and any other information in its possession to ensure continuing eligibility for relative custody assistance and that the amount of payment made according to the agreement is correct.\n(f) When the local agency determines that a relative custody assistance agreement should be terminated or modified, it shall provide notice of the proposed termination or modification to the relative custodian at least ten days before the proposed action along with information about the process for appealing the proposed action.\n(a) A relative custody assistance agreement will not be effective, unless it is signed by the local agency and the relative custodian no later than 30 days after the date of the order establishing permanent legal and physical custody, and on or before November 26, 2014, except that a local agency may enter into a relative custody assistance agreement with a relative custodian more than 30 days after the date of the order if it certifies that the delay in entering the agreement was through no fault of the relative custodian and the agreement is signed and in effect on or before November 26, 2014. There must be a separate agreement for each child for whom the relative custodian is receiving relative custody assistance.\n(b) Regardless of when the relative custody assistance agreement is signed by the local agency and relative custodian, the effective date of the agreement shall be the date of the order establishing permanent legal and physical custody.\n(c) If MFIP is not the applicable program for a child at the time that a relative custody assistance agreement is entered on behalf of the child, when MFIP becomes the applicable program, if the relative custodian had been receiving custody assistance payments calculated based upon a different program, the amount of relative custody assistance payment under subdivision 7 shall be recalculated under the Minnesota family investment program.\n(d) The relative custody assistance agreement shall be in a form specified by the commissioner and shall include provisions relating to the following:\n(1) the responsibilities of all parties to the agreement;\n(2) the payment terms, including the financial circumstances of the relative custodian, the needs of the child, the amount and calculation of the relative custody assistance payments, and that the amount of the payments shall be reevaluated annually;\n(3) the effective date of the agreement, which shall also be the anniversary date for the purpose of submitting the annual affidavit under subdivision 8;\n(4) that failure to submit the affidavit as required by subdivision 8 will be grounds for terminating the agreement;\n(5) the agreement's expected duration, which shall not extend beyond the child's eighteenth birthday;\n(6) any specific known circumstances that could cause the agreement or payments to be modified, reduced, or terminated and the relative custodian's appeal rights under subdivision 9;\n(7) that the relative custodian must notify the local agency within 30 days of any of the following:\n(i) a change in the child's status;\n(ii) a change in the relationship between the relative custodian and the child;\n(iii) a change in composition or level of income of the relative custodian's family;\n(iv) a change in eligibility or receipt of benefits under MFIP, or other assistance program; and\n(v) any other change that could affect eligibility for or amount of relative custody assistance;\n(8) that failure to provide notice of a change as required by clause (7) will be grounds for terminating the agreement;\n(9) that the amount of relative custody assistance is subject to the availability of state funds to reimburse the local agency making the payments;\n(10) that the relative custodian may choose to temporarily stop receiving payments under the agreement at any time by providing 30 days' notice to the local agency and may choose to begin receiving payments again by providing the same notice but any payments the relative custodian chooses not to receive are forfeit; and\n(11) that the local agency will continue to be responsible for making relative custody assistance payments under the agreement regardless of the relative custodian's place of residence.\n(a) A local agency shall enter into a relative custody assistance agreement under subdivision 5 if it certifies that the following criteria are met:\n(1) the juvenile court has determined or is expected to determine that the child, under the former or current custody of the local agency, cannot return to the home of the child's parents;\n(2) the court, upon determining that it is in the child's best interests, has issued or is expected to issue an order transferring permanent legal and physical custody of the child; and\n(3) the child either:\n(i) is a member of a sibling group to be placed together; or\n(ii) has a physical, mental, emotional, or behavioral disability that will require financial support.\nWhen the local agency bases its certification that the criteria in clause (1) or (2) are met upon the expectation that the juvenile court will take a certain action, the relative custody assistance agreement does not become effective until and unless the court acts as expected.\n(b) After November 26, 2014, new relative custody assistance agreements must not be executed. Agreements that were signed by all parties on or before November 26, 2014, and were not in effect because the proposed transfer of permanent legal and physical custody of the child did not occur on or before November 26, 2014, must be renegotiated under the terms of Northstar Care for Children in sections 142A.60 to 142A.612.\n(a) The amount of a monthly relative custody assistance payment shall be determined according to the provisions of this paragraph.\n(1) The total maximum assistance rate is equal to the base assistance rate plus, if applicable, the supplemental assistance rate.\n(i) The base assistance rate is equal to the maximum amount that could be received as basic maintenance for a child of the same age under the adoption assistance program.\n(ii) The local agency shall determine whether the child has physical, mental, emotional, or behavioral disabilities that require care, supervision, or structure beyond that ordinarily provided in a family setting to children of the same age such that the child would be eligible for supplemental maintenance payments under the adoption assistance program if an adoption assistance agreement were entered on the child's behalf. If the local agency determines that the child has such a disability, the supplemental assistance rate shall be the maximum amount of monthly supplemental maintenance payment that could be received on behalf of a child of the same age, disabilities, and circumstances under the adoption assistance program.\n(2) The net maximum assistance rate is equal to the total maximum assistance rate from clause (1) less the following offsets:\n(i) if the child is or will be part of an assistance unit receiving an MFIP grant or a grant from a similar program of another state, the portion of the MFIP standard relating to the child as calculated under paragraph (b), clause (2);\n(ii) Supplemental Security Income payments received by or on behalf of the child;\n(iii) veteran's benefits received by or on behalf of the child; and\n(iv) any other income of the child, including child support payments made on behalf of the child.\n(3) The relative custody assistance payment to be made to the relative custodian shall be a percentage of the net maximum assistance rate calculated in clause (2) based upon the gross income of the relative custodian's family, including the child for whom the relative custodian has permanent legal and physical custody. In no case shall the amount of the relative custody assistance payment exceed that which the child could qualify for under the adoption assistance program if an adoption assistance agreement were entered on the child's behalf. The relative custody assistance payment shall be calculated as follows:\n(i) if the relative custodian's gross family income is less than or equal to 200 percent of federal poverty guidelines, the relative custody assistance payment shall be the full amount of the net maximum assistance rate;\n(ii) if the relative custodian's gross family income is greater than 200 percent and less than or equal to 225 percent of federal poverty guidelines, the relative custody assistance payment shall be 80 percent of the net maximum assistance rate;\n(iii) if the relative custodian's gross family income is greater than 225 percent and less than or equal to 250 percent of federal poverty guidelines, the relative custody assistance payment shall be 60 percent of the net maximum assistance rate;\n(iv) if the relative custodian's gross family income is greater than 250 percent and less than or equal to 275 percent of federal poverty guidelines, the relative custody assistance payment shall be 40 percent of the net maximum assistance rate;\n(v) if the relative custodian's gross family income is greater than 275 percent and less than or equal to 300 percent of federal poverty guidelines, the relative custody assistance payment shall be 20 percent of the net maximum assistance rate; or\n(vi) if the relative custodian's gross family income is greater than 300 percent of federal poverty guidelines, no relative custody assistance payment shall be made.\n(b) The following provisions cover the relationship between relative custody assistance and assistance programs:\n(1) The relative custodian of a child for whom the relative custodian is receiving relative custody assistance is expected to seek whatever assistance is available for the child through MFIP or, if the relative custodian resides in a state other than Minnesota, similar programs of that state. If a relative custodian fails to apply for assistance through MFIP or other program for which the child is eligible, the child's portion of the MFIP standard will be calculated as if application had been made and assistance received.\n(2) The portion of the MFIP standard relating to each child for whom relative custody assistance is being received shall be calculated as follows:\n(i) determine the total MFIP standard for the assistance unit;\n(ii) determine the amount that the MFIP standard would have been if the assistance unit had not included the children for whom relative custody assistance is being received;\n(iii) subtract the amount determined in item (ii) from the amount determined in item (i); and\n(iv) divide the result in item (iii) by the number of children for whom relative custody assistance is being received that are part of the assistance unit.\n(3) If a child for whom relative custody assistance is being received is not eligible for assistance through MFIP or similar programs of another state, the portion of MFIP standard relating to that child shall be equal to zero.\nWhen a relative custody assistance agreement remains in effect for more than one year, the local agency shall require the relative custodian to annually submit an affidavit in a form to be specified by the commissioner. The affidavit must be submitted to the local agency each year no later than 30 days after the relative custody assistance agreement's anniversary date. The affidavit shall document the following:\n(1) that the child remains in the physical custody of the relative custodian;\n(2) that there is a continuing need for the relative custody assistance payments due to the child's physical, mental, emotional, or behavioral needs; and\n(3) the current gross income of the relative custodian's family.\nThe relative custody assistance agreement may be modified based on information or documentation presented to the local agency under this requirement and as required by annual adjustments to the federal poverty guidelines.\nA relative custodian who enters or seeks to enter into a relative custody assistance agreement with a local agency has the right to appeal to the commissioner according to section 142A.20 when the local agency establishes, denies, terminates, or modifies the agreement. Upon appeal, the commissioner may review only:\n(1) whether the local agency has met the legal requirements imposed by this chapter for establishing, denying, terminating, or modifying the agreement;\n(2) whether the amount of the relative custody assistance payment was correctly calculated under the method in subdivision 7;\n(3) whether the local agency paid for correct time periods under the relative custody assistance agreement;\n(4) whether the child remains in the physical custody of the relative custodian;\n(5) whether the local agency correctly modified the amount of the supplemental assistance rate based on a change in the child's physical, mental, emotional, or behavioral needs, or based on the relative custodian's failure to provide documentation, after the local agency has requested such documentation, that the child continues to have physical, mental, emotional, or behavioral needs that support the current amount of relative custody assistance; and\n(6) whether the local agency correctly modified or terminated the amount of relative custody assistance based on a change in the gross income of the relative custodian's family or based on the relative custodian's failure to provide documentation of the gross income of the relative custodian's family after the local agency has requested such documentation.\nFor the purposes of the Unitary Residency Act under chapter 256G, time spent by a child in the custody of a relative custodian receiving payments under this section is not excluded time. A child is a resident of the county where the relative custodian is a resident.\n(a) Payment of relative custody assistance under a relative custody assistance agreement is subject to the availability of state funds and payments may be reduced or suspended on order of the commissioner if insufficient funds are available.\n(b) A local agency may not seek and the commissioner shall not provide reimbursement for the administrative costs associated with performing the duties described in subdivision 4.\n(c) For the purposes of determining eligibility or payment amounts under MFIP, relative custody assistance payments shall be excluded in determining the family's available income.\n(d) For expenditures made on or before December 31, 2014, upon receipt from a local agency of a claim for reimbursement, the commissioner shall reimburse the local agency in an amount equal to 100 percent of the relative custody assistance payments provided to relative custodians.\n(e) For expenditures made on or after January 1, 2015, upon receipt from a local agency of a claim for reimbursement, the commissioner shall reimburse the local agency as part of the Northstar Care for Children fiscal reconciliation process under section 142A.611.",
	"repealed": false
}