{
	"id": "49.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/49.37",
	"title": "49.37 STOCKHOLDERS TO APPROVE; CERTIFICATE OF CONSOLIDATION OR MERGER.",
	"text": "Either before or after the consolidation or merger agreement has been approved by the commissioner of commerce, it must be submitted to the stockholders of each corporation at a meeting thereof called, and it does not become binding upon the corporation until it has been approved at each of the meetings required by this section by the vote or ballot of the stockholders, holding at least a majority of the amount of stock of the respective corporations, or a higher percentage as may be required by the certificate of incorporation of the corporations. Proof of the holding of these meetings and the results thereof must be submitted to the commissioner of commerce. After the agreement called for by sections 49.33 to 49.41 has been approved by the stockholders of the respective corporations and by the commissioner of commerce, the latter shall issue a certificate reciting that the corporations have complied with the provisions of sections 49.34 to 49.41 and declaring the consolidation or merger of these corporations and the name of the consolidated or surviving corporation, the amount of capital stock thereof, the names of the first board of directors, and the place of business of the consolidated or surviving corporation, which must be within the city where any of the constituent corporations have been previously authorized to have their places of business. Upon the issuing of this certificate and the filing of it for record in the Office of the Secretary of State, the incorporation is deemed to be complete in the case of the consolidation, and the assets of the constituent corporations merged into the survivor in the case of a merger, and the consolidated or surviving corporation shall, from the date of this certificate, have the term of corporate existence as may be specified in it, not exceeding the longest unexpired term of any constituent corporation. The certificate of the commissioner of commerce is prima facie evidence that all of the provisions of sections 49.34 to 49.41 have been complied with, and is conclusive evidence of the existence of the consolidated or surviving corporation.",
	"repealed": false
}