{
	"id": "62M.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.06",
	"title": "62M.06 APPEALS OF ADVERSE DETERMINATIONS.",
	"text": "(a) A utilization review organization must have written procedures for appeals of adverse determinations. The right to appeal must be available to the enrollee and to the attending health care professional.\n(b) The enrollee shall be allowed to review the information relied upon in the course of the appeal, present evidence and testimony as part of the appeals process, and receive continued coverage pending the outcome of the appeals process. This paragraph does not apply to grandfathered plans as defined under section 62A.011, subdivision 1c. Nothing in this paragraph shall be construed to limit or restrict the appeal rights of state public health care program enrollees provided under section 256.045 and Code of Federal Regulations, title 42, section 438.420 (d).\n(a) When an adverse determination for a health care service is made prior to or during an ongoing service requiring review and the attending health care professional believes that the determination warrants an expedited appeal, the utilization review organization must ensure that the enrollee and the attending health care professional have an opportunity to appeal the determination over the telephone on an expedited basis. In such an appeal, the utilization review organization must ensure reasonable access to its consulting physician or health care provider.\n(b) The utilization review organization shall notify the enrollee and attending health care professional by telephone of its determination on the expedited appeal as expeditiously as the enrollee's medical condition requires, but no later than 72 hours after receiving the expedited appeal.\n(c) If the adverse determination is not reversed through the expedited appeal, the utilization review organization must include in its notification the right to submit the appeal to the external appeal process described in section 62Q.73 and the procedure for initiating the process. This information must be provided in writing to the enrollee and the attending health care professional as soon as practical.\n(a) The utilization review organization must establish procedures for appeals to be made either in writing or by telephone.\n(b) A utilization review organization shall notify in writing the enrollee, attending health care professional, and claims administrator of its determination on the appeal within 15 days after receipt of the notice of appeal. If the utilization review organization cannot make a determination within 15 days due to circumstances outside the control of the utilization review organization, the utilization review organization may take up to four additional days to notify the enrollee, attending health care professional, and claims administrator of its determination. If the utilization review organization takes any additional days beyond the initial 15-day period to make its determination, it must inform the enrollee, attending health care professional, and claims administrator, in advance, of the extension and the reasons for the extension.\n(c) The documentation required by the utilization review organization may include copies of part or all of the medical record and a written statement from the attending health care professional.\n(d) Prior to upholding the adverse determination for clinical reasons, the utilization review organization shall conduct a review of the documentation by a physician who did not make the adverse determination.\n(e) The process established by a utilization review organization may include defining a period within which an appeal must be filed to be considered. The time period must be communicated to the enrollee and attending health care professional when the adverse determination is made.\n(f) An attending health care professional or enrollee who has been unsuccessful in an attempt to reverse an adverse determination shall, consistent with section 72A.285, be provided the following:\n(1) a complete summary of the review findings;\n(2) qualifications of the reviewers, including any license, certification, or specialty designation; and\n(3) the relationship between the enrollee's diagnosis and the review criteria used as the basis for the decision, including the specific rationale for the reviewer's decision.\n(g) In cases of appeal to reverse an adverse determination for clinical reasons, the utilization review organization must ensure that a physician of the utilization review organization's choice in the same or a similar specialty as typically manages the medical condition, procedure, or treatment under discussion is reasonably available to review the case.\n(h) If the adverse determination is not reversed on appeal, the utilization review organization must include in its notification the right to submit the appeal to the external review process described in section 62Q.73 and the procedure for initiating an appeal under the external process.\nIf the utilization review organization and the claims administrator are separate entities, the utilization review organization must notify, either electronically or in writing, the appropriate claims administrator for the health benefit plan of any adverse determination that is reversed on appeal.",
	"repealed": false
}