{
	"id": "484.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.013",
	"title": "484.013 HOUSING CALENDAR CONSOLIDATION PROGRAM.",
	"text": "(a) A program is established in the Second and Fourth Judicial Districts to consolidate the hearing and determination of matters related to residential rental housing and to ensure continuity and consistency in the disposition of cases.\n(b) Outside the Second and Fourth Judicial Districts, a district court may establish the program described in paragraph (a) in counties that it specifies in the district.\nThe housing calendar program may consolidate the hearing and determination of all proceedings under chapter 504B; criminal and civil proceedings related to violations of any state, county or city health, safety, housing, building, fire prevention or housing maintenance code; escrow of rent proceedings; and actions for rent abatement. A proceeding under sections 504B.281 to 504B.371 may not be delayed because of the consolidation of matters under the housing calendar program.\nThe program must provide for the consolidation of landlord-tenant damage actions and actions for rent at the request of either party. A court may not consolidate claims unless the plaintiff has met the applicable jurisdictional and procedural requirements for each cause of action. A request for consolidation of claims by the plaintiff does not require mandatory joinder of defendant's claims, and a defendant is not barred from raising those claims at another time or forum.\nThe chief judge of district court may appoint a referee for the housing calendar program. The referee must be learned in the law. The referee must be compensated according to the same scale used for other referees in the district court. Section 484.70, subdivision 6, does not apply to the housing calendar program.\nThe duties and powers of the referee in the housing calendar program are as follows:\n(1) to hear and report all matters within the jurisdiction of the housing calendar program and as may be directed to the referee by the chief judge; and\n(2) to recommend findings of fact, conclusions of law, temporary and interim orders, and final orders for judgment.\nAll recommended orders and findings of the referee are subject to confirmation by a judge.\nUpon the conclusion of the hearing in each case, the referee shall transmit to the district court judge, the court file together with the referee's recommended findings and orders in writing. The recommended findings and orders of the referee become the findings and orders of the court when confirmed by the district court judge. The order of the court is proof of the confirmation.\nReview of a recommended order or finding of the referee by a district court judge may be had by notice served and filed within ten days of effective notice of the recommended order or finding. The notice of review must specify the grounds for the review and the specific provisions of the recommended findings or orders disputed, and the district court judge, upon receipt of the notice of review, shall set a time and place for the review hearing.\nThe chief judge of the district must establish procedures for the implementation of the program, including designation of a location for the hearings. The chief judge may also appoint other staff as necessary for the program.\n[Repealed, 2006 c 260 art 5 s 54]",
	"repealed": false
}