{
	"id": "256B.0644",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0644",
	"title": "256B.0644 REIMBURSEMENT UNDER OTHER STATE HEALTH CARE PROGRAMS.",
	"text": "(a) A vendor of medical care, as defined in section 256B.02, subdivision 7, and a health maintenance organization, as defined in chapter 62D, must participate as a provider or contractor in the medical assistance program and MinnesotaCare as a condition of participating as a provider in health insurance plans and programs or contractor for state employees established under section 43A.18, the public employees insurance program under section 43A.316, for health insurance plans offered to local statutory or home rule charter city, county, and school district employees, the workers' compensation system under section 176.135, and insurance plans provided through the Minnesota Comprehensive Health Association under sections 62E.01 to 62E.19. The limitations on insurance plans offered to local government employees shall not be applicable in geographic areas where provider participation is limited by managed care contracts with the Department of Human Services. This section does not apply to dental service providers providing dental services outside the seven-county metropolitan area.\n(b) For providers other than health maintenance organizations, participation in the medical assistance program means that:\n(1) the provider accepts new medical assistance and MinnesotaCare patients;\n(2) for providers other than dental service providers, at least 20 percent of the provider's patients are covered by medical assistance and MinnesotaCare as their primary source of coverage; or\n(3) for dental service providers providing dental services in the seven-county metropolitan area, at least ten percent of the provider's patients are covered by medical assistance and MinnesotaCare as their primary source of coverage, or the provider accepts new medical assistance and MinnesotaCare patients who are children with special health care needs. For purposes of this section, \"children with special health care needs\" means children up to age 18 who: (i) require health and related services beyond that required by children generally; and (ii) have or are at risk for a chronic physical, developmental, behavioral, or emotional condition, including: bleeding and coagulation disorders; immunodeficiency disorders; cancer; endocrinopathy; developmental disabilities; epilepsy, cerebral palsy, and other neurological diseases; visual impairment or deafness; Down syndrome and other genetic disorders; autism; fetal alcohol syndrome; and other conditions designated by the commissioner after consultation with representatives of pediatric dental providers and consumers.\n(c) Patients seen on a volunteer basis by the provider at a location other than the provider's usual place of practice may be considered in meeting the participation requirement in this section. The commissioner shall establish participation requirements for health maintenance organizations. The commissioner shall provide lists of participating medical assistance providers on a quarterly basis to the commissioner of management and budget, the commissioner of labor and industry, and the commissioner of commerce. Each of the commissioners shall develop and implement procedures to exclude as participating providers in the program or programs under their jurisdiction those providers who do not participate in the medical assistance program. The commissioner of management and budget shall implement this section through contracts with participating health and dental carriers.\n(d) A volunteer dentist who has signed a volunteer agreement under section 256B.0625, subdivision 9a, shall not be considered to be participating in medical assistance or MinnesotaCare for the purpose of this section.",
	"repealed": false
}