{
	"id": "60D.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/60D.15",
	"title": "60D.15 DEFINITIONS.",
	"text": "For purposes of this chapter, the terms in subdivisions 2 to 10 have the meanings given them, unless the context otherwise requires.\nAn \"affiliate\" of, or person \"affiliated\" with, a specific person, is a person that directly, or indirectly through one or more intermediaries, controls, or is controlled by, or is under common control with, the person specified.\nThe term \"commissioner\" means the commissioner of commerce, the commissioner's deputies, or the Commerce Department, as appropriate.\nThe term \"control,\" including the terms \"controlling,\" \"controlled by,\" and \"under common control with,\" means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through the ownership of voting securities, by contract other than a commercial contract for goods or nonmanagement services, or otherwise, unless the power is the result of an official position with, corporate office held by, or court appointment of, the person. Control is presumed to exist if any person, directly or indirectly, owns, controls, holds with the power to vote, or holds proxies representing, ten percent or more of the voting securities of any other person. This presumption may be rebutted by a showing made in the manner provided by section 60D.19, subdivision 11, that control does not exist in fact. The commissioner may determine, after furnishing all persons in interest notice and opportunity to be heard and making specific findings of fact to support such determination, that control exists in fact, notwithstanding the absence of a presumption to that effect.\n\"Enterprise risk\" means an activity, circumstance, event, or series of events involving one or more affiliates of an insurer that, if not remedied promptly, is likely to have a material adverse effect upon the financial condition or liquidity of the insurer or its insurance holding company system as a whole, including, but not limited to, anything that would cause the insurer's risk-based capital to fall into company action level as set forth in sections 60A.50 to 60A.696 or would cause the insurer to be in hazardous financial condition in accordance with the standards of section 60G.20.\n\"Groupwide supervisor\" means the regulatory official authorized to engage in conducting and coordinating groupwide supervision activities who is determined or acknowledged by the commissioner under section 60D.217 to have sufficient significant contacts with the internationally active insurance group.\nAn \"insurance holding company system\" consists of two or more affiliated persons, one or more of which is an insurer.\nThe term \"insurer\" means a company qualified and licensed by the commissioner to transact the business of insurance, but does not include an insurance solicitor, agent, or agency. The term also does not include:\n(1) agencies, authorities, or instrumentalities of the United States, its possessions and territories, the Commonwealth of Puerto Rico, the District of Columbia, or a state or political subdivision of a state; or\n(2) nonprofit medical and hospital service associations.\n\"Internationally active insurance group\" means an insurance holding company system that (1) includes an insurer registered under section 60D.19; and (2) meets the following criteria: (i) premiums written in at least three countries, (ii) the percentage of gross premiums written outside the United States is at least ten percent of the insurance holding company system's total gross written premiums, and (iii) based on a three-year rolling average, the total assets of the insurance holding company system are at least $50,000,000,000 or the total gross written premiums of the insurance holding company system are at least $10,000,000,000.\nA \"person\" is an individual, a corporation, a partnership, an association, a joint stock company, a trust, an unincorporated organization, any similar entity or any combination of the foregoing acting in concert, but does not include any joint venture partnership exclusively engaged in owning, managing, leasing, or developing real or tangible personal property.\nA \"security holder\" of a specified person is one who owns any security of the person, including common stock, preferred stock, debt obligations, and any other security convertible into or evidencing the right to acquire any security of the person.\nA \"subsidiary\" of a specified person is an affiliate controlled by the person directly or indirectly through one or more intermediaries.\nThe term \"voting security\" includes any security convertible into or evidencing a right to acquire a voting security.",
	"repealed": false
}