{
	"id": "88.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/88.49",
	"title": "88.49 CONTRACTS.",
	"text": "[Repealed, 1Sp2015 c 4 art 4 s 150]\n[Repealed, 1Sp2015 c 4 art 4 s 150]\nAll the provisions of a recorded contract for an auxiliary forest are deemed covenants running with the land from the date of the filing of the contract for record.\nUpon the filing of the contract for record, the land described in the contract shall become, and during the life of the contract remain, an auxiliary forest entitled to all the benefits and subject to all the restrictions of sections 88.49 to 88.53. These sections are part of the obligation of the contract and are inviolate, subject only to the police power of the state, to the power of eminent domain, and to laws of the state enacted subsequent to the execution of the contract. Laws enacted subsequent to the date of execution of the contract are applicable to the contract, so long as the laws do not impair the contract rights of the signatories of the contract or their successors or assigns.\n(a) If the owner fails to faithfully fulfill and perform the contract, any provision of the contract, any requirement of sections 88.49 to 88.53, or any rule the commissioner adopts under those sections, the commissioner may cancel the contract. The commissioner shall give the owner 60 days' notice of a hearing at which the owner may appear and show cause, if any, why the contract should not be canceled. The commissioner shall then determine whether the contract should be canceled and make an order to that effect. The commissioner shall give the owner notice of the commissioner's determination and order. If the commissioner determines that the contract should be canceled and the owner does not appeal the determination as provided in subdivision 7, the commissioner shall send notice of the cancellation to the auditor of the county and to the town clerk of the town affected and file with the recorder a certified copy of the order. The recorder shall note the cancellation upon the record, and the land described in the contract shall cease to be an auxiliary forest and, together with the timber on the land, become liable for all taxes and assessments that would have been levied against the land from the time of the making of the contract, notwithstanding provisions of the statutes of limitation to the contrary. The amount of taxes paid under section 88.51, subdivision 1, together with interest on such taxes and assessments at six percent per annum, but without penalties, must be subtracted from the tax owed by the owner.\n(b) The commissioner may cancel the contract upon written application of the owner.\n(c) The commissioner shall cancel the contract if the owner has successfully applied under the Sustainable Forest Incentive Act, sections 290C.01 to 290C.11, and has paid to the county treasurer the tax difference between the amount that would have been paid had the land under contract been subject to the Minnesota Tree Growth Tax Law and the Sustainable Forest Incentive Act from the date of the recording of the contract and the amount actually paid under section 88.51, subdivision 1, and Minnesota Statutes 2014, section 88.51, subdivision 2. The sustainable forest tax difference is net of the incentive payment of section 290C.07. If the amount that would have been paid if the land under contract had been under the Minnesota Tree Growth Tax Law and the Sustainable Forest Incentive Act from the date the contract was filed is less than the amount actually paid under the contract, the cancellation shall be made without further payment by the owner.\n(d) If the execution of the contract creating an auxiliary forest is procured through fraud or deception on the county board, the commissioner, or any other person or body representing the state, may cancel it upon suit brought by the attorney general at the direction of the commissioner. This cancellation has the same effect as the cancellation of a contract by the commissioner.\n(a) For the purpose of levying taxes, the county auditor shall, immediately upon receiving notice of the cancellation of a contract creating an auxiliary forest, direct the local assessor to assess the lands within the forest, excluding the value of merchantable timber and minerals and other things of value taxed under the provisions of Minnesota Statutes 2014, section 88.51, subdivision 2, for each of the years the lands were included within the auxiliary forest. The local assessor shall make the assessment and certify the same to the county auditor. The county auditor shall levy a tax on the assessable value of the land, fixed by section 273.13, for each of the years the land was within an auxiliary forest, at the rate at which other real estate within the taxing district was taxed in those years. The tax is a first and prior lien upon the land and upon all timber and forest products growing, grown, or cut on the land and removed from the land. These taxes must be enforced in the same manner as other taxes on real estate are enforced and the lien of the tax on forest products cut or removed from this land must be enforced by the seizure and sale of the forest products.\n(b) No person shall, after the mailing by the commissioner, as provided in subdivision 5, of notice of hearing on the cancellation of the contract making lands an auxiliary forest, cut or remove from these lands any timber or forest products growing, grown, or cut thereon until all taxes levied under this subdivision are paid, or, if the levy is not completed, until the owner has given a bond payable to the county, with sureties approved by the county auditor, in the amount the county auditor deems ample for the payment of all taxes that may be levied under this subdivision, conditioned for the payment of the taxes.\n(c) Any person who violates this subdivision is guilty of a felony.\n(a) The owner may appeal from any cancellation order of the commissioner to the district court of the county where the land is located by serving notice of appeal on the commissioner and filing the same with the court administrator of the district court within 30 days after the date of mailing notice of such order.\n(b) The appeal must be tried between the state of Minnesota and the owner by the court as a suit for the rescission of a contract is tried, and the judgment of the court is substituted for the cancellation order of the commissioner, and is final.\nIf cause for the cancellation of a contract exists, the commissioner may, in lieu of canceling the contract, perform the terms and conditions that the owner was required to perform, except that the commissioner may not pay any taxes that the owner was required to have paid by law. The commissioner may use any available moneys appropriated for the maintenance of the commissioner's division and any other lawful means to perform all other terms and conditions required to maintain the auxiliary forest status. The commissioner shall, on December 1 each year, certify to the auditor of each county the amount of moneys expended on and the value of services rendered for land in the county since December 1 of the preceding year. The county auditor shall assess and levy the amount shown by this certificate against the lands described. This amount bears interest at the rate of six percent per annum and is a lien upon the lands described. The collection of the tax must be enforced in the same manner as taxes levied under section 88.52, subdivision 1, and if the tax is not sooner paid, it must be added to, and the payment enforced with, the yield tax imposed under section 88.52, subdivision 2.\n(a) Land needed for other purposes may be withdrawn from an auxiliary forest. The owner may submit a verified application in a form prescribed by the commissioner of natural resources to the county board of the county in which the land is situated, describing the land and stating the purpose of withdrawal. The county board shall consider the application and hear any matter offered in support of or in opposition to the application. The county board shall make proper record of its action upon the application. If the application is rejected, the county board shall prepare a written statement stating the reasons for the rejection within 30 days of the date of rejection. If the application is rejected, the county auditor shall, within 30 days of the rejection, endorse the rejection on the application and return it, together with a copy of the written statement prepared by the county board stating the reasons for rejection to the applicant. The rejected application and written statement must be sent to the owner by certified mail at the address given in the application.\n(b) If the application is disapproved as to only a part of the lands described, the county auditor shall notify the applicant in the same manner as if the application were rejected. The applicant may amend the application within 60 days after the notice is mailed. If it is not amended, the application is deemed rejected.\n(c) If the county board determines that the land proposed to be withdrawn is needed and is suitable for the purposes set forth in the application, and that the remaining land in the auxiliary forest is suitable and sufficient for the purposes of the auxiliary forest as provided by law, the board may, in its discretion, grant the application, subject to the approval of the commissioner. Upon such approval by both the county board and the commissioner, the county auditor shall notify the applicant and the commissioner. Upon notice from the county auditor, the commissioner shall cause to be prepared a supplemental contract executed by the commissioner on behalf of the state and by the owner of the fee title or the holder of a state deed and by all other persons having any liens on the land and witnessed and acknowledged as provided by law for the execution of recordable deeds of conveyance. Notices sent by certified mail to the owner in fee at the address given in the application is deemed notice to all persons executing the supplemental contract. The supplemental contract must be prepared by the director of the Division of Forestry on a recordable form approved by an attorney appointed by the commissioner. Every supplemental contract must be approved by the Executive Council. The commissioner shall submit the supplemental contract to the owner of the land. If the owner indicates to the commissioner an unwillingness to execute the supplemental contract, or if the owner or any of the persons with an interest in the land or a lien upon the land fail to execute the contract within 60 days from the time of submission of the contract to the owner for execution, all proceedings relating back to the withdrawal of the land from an auxiliary forest shall be at an end. When the supplemental contract is executed, it must be recorded in the office of the county recorder at the expense of the owner or, if the title to the land is registered, the supplemental contract must be recorded with the registrar of titles. At the time the contract is recorded with the county recorder, the owner, at the owner's expense, shall record with the county recorder a certificate from the county attorney to the effect that no change in record title to the land has occurred, that no liens or other encumbrances have been placed on the land, and that no taxes have accrued on the land since the making of the previous certificate. The county attorney must furnish this certificate without further compensation. Upon execution and recording of the supplemental contract, the land described in the supplemental contract that is to be withdrawn from the auxiliary forest ceases to be part of the auxiliary forest, and the owner is liable to taxes and assessments of the withdrawn portion together with the timber on the withdrawn portion in like manner as upon cancellation of an auxiliary forest contract.\nNotwithstanding subdivisions 6 and 9, or section 88.491, subdivision 2, if an owner trades land under auxiliary forest contract for land owned by a governmental unit and the owner agrees to use the land received in trade from the governmental unit for the production of forest products, upon resolution of the county board, no taxes and assessments shall be levied against the land traded, except that any current or delinquent annual taxes or yield taxes due on that land while it was under the auxiliary forest provision must be paid prior to the land exchange. The land received from the governmental unit in the land trade automatically qualifies for inclusion in the Sustainable Forest Incentive Act.\n[Repealed, 1Sp2015 c 4 art 4 s 150]\nThe title to the land in an auxiliary forest or any part of an auxiliary forest is subject to transfer in the same manner as the title to other real estate, subject to the auxiliary forest contract and to applicable provisions of law. If the ownership of an auxiliary forest is divided into two or more parts by any transfer or transfers of title and the owners of all the parts desire to have the parts made separate auxiliary forests, the owners may join in a verified application to the county board of the county in which the forest is situated in a form prescribed by the commissioner of natural resources. If the county board determines that each of the parts into which the forest has been divided is suitable and sufficient for a separate auxiliary forest as provided by law, it may grant the application, subject to the approval of the commissioner. Upon approval, the commissioner shall prepare a new auxiliary forest contract for each part transferred, with like provisions and for the remainder of the same term as the prior contract in force for the entire forest at the time of the transfer, and shall also prepare a modification of the prior contract, eliminating the part or parts of the land transferred but otherwise leaving the remaining land subject to all the provisions of the contract. The new contract or contracts and modification of the prior contract must be executed and otherwise dealt with in like manner as provided for a supplemental auxiliary forest contract in subdivision 9, but no such instrument must take effect until all of them have been executed, filed, and recorded or registered. When all the instruments take effect, the owner of the forest prior to the transfer is divested of all rights and relieved from all liabilities under the contract then in force with respect to the parts transferred except those as may have existed or accrued at the time of the taking effect of such instruments, and thereafter the several tracts into which the forest has been divided and the respective owners thereof are subject to the new contract or contracts or the modified prior contract relating thereto, as the case may be, as provided for an original auxiliary forest contract. The provisions of this subdivision shall not supersede or affect the application of any other provision of law to any auxiliary forest which is divided by transfer of title unless the procedure herein authorized is fully consummated.",
	"repealed": false
}