{
	"id": "238.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.35",
	"title": "238.35 USE OF EXISTING EASEMENT; RESTRICTIONS.",
	"text": "There is a long-standing legislative policy in the state of Minnesota to provide for the dedication or other provision of easements and public rights-of-way required by public utilities and cable communications systems. Except for applicable governmental rules, these easements do not include any limitation on the type, number, or size of cables or related cable communication system components. There is a public understanding and acceptance of the need of public utilities and cable communications systems to have the ability to use existing utility easements and public rights-of-way in order to provide new and improved cable communications services made possible by technological developments and to make changes to the cables or related cable communication systems components. Changing technology has caused and will continue to cause over time the development of new cable communications services requiring changing uses of existing utility easements and public rights-of-way. Cable communications systems have a need to use existing utility easements and public rights-of-way in order to deliver their services to the public. The addition of cable communications system components does not constitute an unanticipated or added burden on the real estate subject to the easements or public rights-of-way.\nFor purposes of this section, the term \"utility easement\" includes all utility easements or general purpose easements dedicated on a recorded plat to the public or to the state or to any political subdivision thereof; all deeded easements to the public or to the state or to any political subdivision thereof which are for general or utility purposes; all easements acquired by condemnation or prescription by the state or any political subdivision thereof which are for general or utility purposes; and all easements in favor of any public service corporation for telephone or electric transmission purposes.\nThe state or any county, city, township, agency, or political subdivision thereof, or any individual, partnership, venture, or corporation which is licensed, franchised, or authorized thereby to establish and operate a cable communications system may utilize any existing utility easement in accordance with the provisions of this section to install, maintain, and remove cable communications system components without the payment of additional compensation to the owners or occupants of the real estate subject to the easement, other than the owner of the utility easement or its successors or assigns.\n(a) As a condition of using any utility easement, a cable communications system is subject to any burdens, duties, or obligations specified in the easement of the grantee of the easement.\n(b) Subject to any applicable rights and obligations of sections 237.162 and 237.163 and any local right-of-way ordinance adopted under those statutes, a person operating a cable communications system shall restore the real estate, and any landscaping or improvements thereon, to the condition they were in prior to entry within 30 days of completing the installation of the cables and related cable communications system components upon that real estate and to make changes to the cables or related cable communication systems components. Changing technology has caused and will continue to cause over time the development of new cable communications services requiring changing uses of existing utility easements. Restoration which cannot be completed during the winter months must be accomplished as promptly as weather conditions permit.",
	"repealed": false
}