{
	"id": "471.463",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.463",
	"title": "471.463 CONSTRUCTION MANAGER AT RISK.",
	"text": "(a) For purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Construction manager at risk\" means a person who is selected by a municipality to act as a construction manager to manage the construction process, including but not limited to responsibility for the price, schedule, and workmanship of the construction performed according to the procedures in this section.\n(c) \"Construction manager at risk contract\" means a contract for construction of a project between a construction manager at risk and a municipality, which shall include a guaranteed maximum price, construction schedule, and workmanship of the construction performed.\n(d) \"Guaranteed maximum price\" means the maximum amount that a construction manager at risk is paid pursuant to a contract to perform a defined scope of work.\n(e) \"Guaranteed maximum price contract\" means a contract under which a construction manager or subcontractor is paid on the basis of the actual cost to perform the work specified in the contract plus an amount for overhead and profit, the sum of which must not exceed the guaranteed maximum price in the contract.\n(f) \"Municipality\" has the meaning given under section 471.345, subdivision 1.\n(g) \"Past performance\" or \"experience\" does not include the exercise or assertion of a person's legal rights.\n(h) \"Person\" means an individual, corporation, partnership, association, or other legal entity.\n(i) \"Project\" means an undertaking to construct, alter, or enlarge a building, structure, or other improvement, except a street, road, highway, or bridge, by or for a municipality.\n(j) \"Request for proposals\" means the document or publication soliciting proposals for a construction manager at risk contract as provided in this section.\n(k) \"Request for qualifications\" means the document or publication soliciting qualifications for a construction manager at risk contract as provided in this section.\n(l) \"Trade contract work\" means labor, materials, or equipment furnished by contractors or vendors that are incorporated into the completed project or are major components of the means of construction. Work performed by trade contractors involves specific portions of the project, but not the entire project.\nNotwithstanding any other law to the contrary, a municipality may use a construction manager at risk method of project delivery and award a construction manager at risk contract based on the selection criteria described in this section.\n(a) A request for qualifications must be prepared for each construction manager at risk contract as provided in this section. The request for qualifications must contain, at a minimum, the following elements:\n(1) procedures for submitting qualifications, the criteria and subcriteria for evaluating the qualifications and the relative weight for each criteria and subcriteria, and the procedures for making awards in an open, competitive, and objective manner, applying a scoring or trade-off evaluation method, including a reference to the requirements of this section;\n(2) the proposed terms and conditions for the contract;\n(3) the desired qualifications of the construction manager at risk;\n(4) the schedule for commencement and completion of the project;\n(5) any applicable budget limits for the project;\n(6) the requirements for insurance and statutorily required performance and payment bonds; and\n(7) the identification and location of any other information in the possession or control of a municipality that the municipality determines is material, including surveys, soil reports, drawings or models of existing structures, environmental studies, photographs, or references to public records.\n(b) The request for qualifications criteria must not impose unnecessary conditions beyond reasonable requirements to ensure maximum participation of construction managers at risk. The criteria must not consider the collective bargaining status of the construction manager at risk.\n(c) The request for qualifications criteria may include a requirement that the proposer include the cost for the proposer's services.\n(d) Notice of requests for qualifications must be advertised in a manner designated by the municipality.\n(a) In a construction manager at risk selection process, the following apply:\n(1) upon determining to utilize a construction manager at risk for a project, a municipality shall create a selection committee composed of a minimum of three persons, at least one of whom has construction industry expertise; and\n(2) a municipality shall establish procedures for determining the appropriate content of a request for qualifications, as provided in subdivision 3.\n(b) In accordance with the criteria and procedures set forth in the request for qualifications, the selection committee shall evaluate the experience of a proposer as a construction manager at risk, including but not limited to capacity of key personnel, technical competence, capability to perform, past performance of the firm and its employees, safety record and compliance with state and federal law, availability to and familiarity with the project locale, and other appropriate facts submitted by the proposer in response to the request for qualifications.\n(c) A municipality must receive at least two proposals from construction managers or the municipality may:\n(1) solicit new proposals;\n(2) revise the request for qualifications and then solicit new proposals using the revised request for qualifications;\n(3) select another allowed procurement method; or\n(4) reject all proposals.\n(d) The selection committee shall review the qualification of each proposer and create a short list of two to five proposers.\n(e) A municipality shall issue a request for proposals requiring cost and other information as desired from the short-listed proposers.\n(f) The selection committee may conduct formal interviews with the short-listed proposers but shall not disclose any proprietary or confidential information contained in one proposal to another proposer, and shall rank the proposers by applying a scoring or trade-off evaluation method. The scoring or trade-off evaluation method must be described in the request for proposals.\n(a) A municipality shall conduct contract negotiations with the highest ranked proposer to reach an agreement on the cost and terms of the contract. If an agreement cannot be reached with the highest ranked proposer, the municipality may begin negotiations with the next highest ranked proposer. The negotiation process continues until an agreement is reached with a proposer or the municipality rejects all proposals.\n(b) The construction manager at risk shall competitively bid all trade contract work for the project from a list of qualified firms. The list of qualified firms may be limited to qualified Small Business Enterprise firms, Disadvantaged Business Enterprise firms, or both, subject to availability of such qualified firms for the specific work. The list of qualified firms must be based on an open, competitive, and objective prequalification process in which the selection criteria, approved by the municipality, may include but is not limited to the firm's experience as a constructor, including capacity of key personnel, technical competence, capability to perform, past performance of the firm and its employees, safety record and compliance with state and federal law, availability to and familiarity with the project locale, Small Business Enterprise or Disadvantaged Business Enterprise certification, and other considerations as defined by the construction manager at risk and the municipality. The construction manager at risk and the municipality shall jointly determine the composition of the list of qualified firms. With the municipality's approval, upon request, the construction manager at risk may also submit bids for trade contract work if the construction manager at risk does not participate in the municipality's review of the bids or selection decision.\n(c) The construction manager at risk and the municipality shall enter into a guaranteed maximum price contract for the project.",
	"repealed": false
}