{
	"id": "559A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/559A.03",
	"title": "559A.03 DISCLOSURES.",
	"text": "(a) In addition to the disclosures required under sections 513.52 to 513.61, an investor seller must deliver to a prospective purchaser the disclosures specified under this section and instructions for cancellation as provided under section 559A.04, subdivision 2, paragraph (b).\n(b) The disclosures must be affixed to the front of any purchase agreement executed between an investor seller and a prospective purchaser. The investor seller may not enter into a contract for deed with a prospective purchaser earlier than ten calendar days after the execution of the purchase agreement by all parties and provision by the investor seller of the disclosures required under this section and instructions for cancellation as required under section 559A.04, subdivision 2, paragraph (b).\n(c) If there is no purchase agreement, an investor seller must provide the disclosures required under this section to the prospective purchaser no less than ten calendar days before the prospective purchaser executes the contract for deed. The disclosures must be provided in a document separate from the contract for deed. The investor seller may not enter into a contract for deed with a prospective purchaser earlier than ten calendar days after providing the disclosures to the prospective purchaser.\n(d) The first page of the disclosures must contain the disclosures required in subdivisions 2, 3, and 4 of this section, in that order. The title must be centered, be in bold, capitalized, and underlined 20-point type, and read \"IMPORTANT INFORMATION YOU NEED TO KNOW.\" The disclosures required under subdivisions 5 and 6 must follow in subsequent pages in that order.\n(e) The investor seller must acknowledge delivery, and the purchaser must acknowledge receipt, of the disclosures by signing and dating the disclosures. The acknowledged disclosures shall constitute prima facie evidence that the disclosures have been provided as required by this section.\n(a) The investor seller must disclose the amount and due date of, if any, all balloon payments. For purposes of disclosure of a balloon payment, the investor seller may assume that all prior scheduled payments were timely made and no prepayments were made. If there is more than one balloon payment due, each one must be listed separately.\n(b) The disclosure must be in the following form, with the title in 14-point type and the text in 12-point type:\n\"BALLOON PAYMENT\nThis contract contains a lump-sum balloon payment or several balloon payments. When the final balloon payment comes due, you may need to get mortgage or other financing to pay it off (or you will have to sell the property). Even if you are able to sell the property, you may not get back all the money you paid for it.\nIf you can't come up with this large amount - even if you have made all your monthly payments - the seller can cancel the contract.\n(a) The investor seller must disclose to the purchaser the purchase price and the date of earliest acquisition of the property by the investor seller, unless the acquisition occurs more than two years prior to the execution of the contract for deed.\n(b) The disclosure must be in the following form, with the title in 14-point type and the text in 12-point type:\n\"INVESTOR SELLER'S PRICE TO BUY HOUSE BEING SOLD TO BUYER\nDate Investor Seller Acquired Property:\n(date seller acquired ownership)\nPrice Paid by Investor Seller to Acquire the Property:\n$ (total purchase price paid by seller to acquire ownership)\nContract for Deed Purchase Price:\n$ (total sale price to the purchaser under the contract)\"\n(c) For the purposes of this subdivision, unless the acquisition occurred more than one year prior to the execution of the contract for deed, the person who first acquires the property is deemed to be the same person as the investor seller where the person who first acquires the property:\n(1) is owned or controlled, in whole or in part, by the investor seller;\n(2) owns or controls, in whole or in part, the investor seller;\n(3) is under common ownership or control, in whole or in part, with the investor seller;\n(4) is a spouse, parent, child, sibling, grandparent, grandchild, uncle, aunt, niece, nephew, or cousin of the investor seller, or of the natural person who owns or controls, in whole or in part, the investor seller; or\n(5) is an entity owned or controlled, in whole or in part, by a person who is a spouse, parent, child, sibling, grandparent, grandchild, uncle, aunt, niece, nephew, or cousin of the investor seller, or of the natural person who owns or controls, in whole or in part, the investor seller.\n(a) An investor seller must disclose to the prospective purchaser the purchase price, the annual interest rate, the amount of any down payment, and whether the purchaser is responsible for any or all of the following: paying property taxes, acquiring homeowner's insurance, making repairs, and maintaining the property.\n(b) The disclosure must be in the following form, with the title in 14-point type and the text in 12-point type:\n\"COSTS AND ESSENTIAL TERMS\n5. Taxes, Homeowner's Insurance, Repairs and Maintenance:\nYou (seller must circle one):\n(a) An investor seller must provide the prospective purchaser with a general disclosure about contracts for deeds as provided in this subdivision.\n(b) The disclosure must be in the following form, with the title in 18-point type, the titles of the sections in 14-point type and underlined, and the text of each section in 12-point type, with a double space between each section:\n\"KNOW WHAT YOU ARE GETTING INTO BEFORE YOU SIGN\n1. How Contracts for Deed Work\nA contract for deed is a complicated legal arrangement. Be sure you know exactly what you are getting into before you sign a contract for deed. A contract for deed is NOT a mortgage. Minnesota's foreclosure protections do NOT apply.\nYou should get advice from a lawyer or the Minnesota Homeownership Center before you sign the contract. You can contact the Homeownership Center at 1-(866)-462-6466 or go to www.hocmn.org.\n2. What If I Can't Make My Payments?\nIf you don't make your monthly installment payment or the balloon payment, the seller can cancel the contract in only 120 days from the date you missed the payment. If the contract is canceled, you lose your home and all the money you have paid, including any down payment, all the monthly payments, and any improvements to the property you have made.\nIf the contract contains a final lump-sum \"balloon payment,\" you will need to get a mortgage or other financing to pay it off (or you will have to sell the property). If you can't come up with this large amount - even if you have made all your monthly payments - the seller can cancel the contract. Even if you are able to sell the property, you may not get back all the money you have paid for it.\n3. BEFORE YOU SIGN, YOU SHOULD:\nA. Get an Independent, Professional Appraisal of the property to learn what it's worth and make sure you are not overpaying for the house.\nB. Get an Independent, Professional Inspection of the property because you will probably be responsible for maintaining and making repairs on the house.\nC. Buy Title Insurance from a title insurance company or ask a lawyer for a \"title opinion\" to address or minimize potential title problems.\n4. YOUR RIGHTS BEFORE YOU SIGN\nA. Waiting Period After Getting Disclosures There is a 10 calendar day waiting period after you get these disclosures. The contract for deed cannot be signed by you or the seller during that 10 calendar day period.\nB. Canceling a Purchase Agreement You have 10 calendar days after you get these disclosures to cancel your purchase agreement and get back any money you paid.\"\nIn a document separate from all others, an investor seller must provide to the prospective purchaser an amortization schedule consistent with the contract for deed, including the portion of each installment payment that will be applied to interest and to principal and the amount and due date of any balloon payments.\nIf the contract was advertised or primarily negotiated with the purchaser in a language other than English, the investor seller must provide the disclosures required in this section in the language in which the contract was advertised or primarily negotiated.\nThe provisions of this section may not be waived.\nExcept as provided in section 559A.05, subdivision 2, a violation of this section has no effect on the validity of the contract for deed.",
	"repealed": false
}