{
	"id": "47.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.201",
	"title": "47.201 GRADUATED PAYMENT MORTGAGES AND COOPERATIVE APARTMENT LOANS.",
	"text": "For the purposes of this section, the terms defined in this subdivision shall have the meanings given them:\n(1) \"Financial institution\" means a state bank or trust company, a national banking association, a state or federally chartered savings association, a mortgage bank, or savings bank.\n(2) \"Graduated payment home loan\" means a conventional or cooperative apartment loan made pursuant to section 47.20 and subject to the provisions therein, whereunder initial periodic repayments are lower than those under the standard conventional or cooperative apartment loan having equal periodic repayments, and gradually rise to a predetermined point after which they remain constant.\nNotwithstanding the provisions of sections 334.01, subdivision 1, and 51A.37, subdivision 3, paragraph (d), any financial institution is authorized to make graduated payment home loans and purchases representing graduated payment home loans pursuant to such rules as the commissioner of commerce finds to be necessary and proper, if any, at an interest rate not in excess of the maximum lawful interest rate prescribed in section 47.20, subdivision 4a. Notwithstanding the provisions of section 334.01, subdivision 1, where initial repayments of a graduated payment home loan are less than the total accrued outstanding interest, the excess accrued and unpaid interest may be added to the outstanding loan balance on which interest accrues at the contracted rate.\nA graduated payment home loan may provide that periodic repayments of principal and interest on graduated payment home loans may increase in amounts not exceeding the following:\n(a) 7.5 percent annually during a period of five years or less;\n(b) 6.5 percent annually during a period of six years;\n(c) 5.5 percent annually during a period of seven years;\n(d) 4.5 percent annually during a period of eight years;\n(e) 3.5 percent annually during a period of nine years; and\n(f) 3 percent annually during a period of ten years.\nNo graduated payment home loan may provide for principal and interest increases after its first ten years. The increases in payments of principal and interest provided in clauses (a) to (f) are independent and one graduation period may not be used in conjunction with another period.\nPayments of principal and interest may not be changed more than once a year. The first change may not occur until one year after the date of the first payment under the graduated payment home loan.\nBorrowers taking a graduated payment home loan shall have the right to convert, at a time chosen by the borrower, to a standard nongraduated payment conventional loan or cooperative apartment loan. No assessment or penalties shall be made if the borrower chooses to convert at the interest rate and outstanding principal of the graduated payment home loan.\nEach prospective borrower shall receive materials explaining in reasonably simple terms the graduated payment home loan offered and a comparable standard conventional loan or cooperative apartment loan instrument with a fixed interest rate and level payments. The material shall include:\n(a) a comparison of the terms of the graduated payment home loan and a standard conventional loan or cooperative apartment loan;\n(b) payment schedules for both types of instruments and the total payment in dollars over the full term of the loan;\n(c) a description of the conversion option; and\n(d) a prominent statement that borrowers have the option to elect a standard conventional loan or cooperative apartment loan instrument.\nCapitalization of interest resulting from any negative amortization of a graduated payment home loan made by a savings association shall not change the status of the mortgage as a first lien against the property securing the loan pursuant to section 51A.38, subdivision 5. The capitalization of interest in a negative amortization shall not be considered as a loan or debt separate from the graduated payment mortgage contracted for at the time of loan origination.",
	"repealed": false
}