{
	"id": "174.247",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.247",
	"title": "174.247 ANNUAL TRANSIT REPORT.",
	"text": "(a) By February 15 annually, the commissioner must submit a report to the legislature on transit services outside the metropolitan area. Any public transportation system receiving assistance under section 174.24 must provide assistance in creating the report, as requested by the commissioner.\n(b) The report must include, at a minimum, the following:\n(1) a descriptive overview of public transportation in Minnesota;\n(2) a descriptive summary of funding sources and assistance programs;\n(3) a summary of each public transportation system receiving assistance under section 174.24;\n(4) data that identifies use of volunteers in providing transit service;\n(5) financial data that identifies for each public transportation system and for each transit system classification under section 174.24, subdivision 3b:\n(i) the operating and capital costs;\n(ii) each of the funding sources used to provide financial assistance; and\n(iii) for federal funds, the amount from each specific federal program under which funding is provided;\n(6) a summary of the differences in program implementation requirements and aid recipient eligibility between federal aid and state sources of funds; and\n(7) an analysis of public transportation system needs and operating expenditures on an annual basis, which must include a methodology for identifying monetary needs, and calculations of:\n(i) the total monetary needs for all public transportation systems, for the year of the report and the ensuing five years;\n(ii) the total expenditures from local sources for each transit system classification;\n(iii) the comprehensive transit assistance percentage for each transit system classification, which equals (A) the expenditures identified under item (ii), for a transit system classification, divided by (B) the amounts identified under subitem (A), plus the sum of state sources of funds plus federal funds provided to all transit systems in that classification; and\n(iv) the amount of surplus or insufficient funds available for paying capital and operating costs to fully implement the greater Minnesota transit investment plan under section 174.24, subdivision 1a.",
	"repealed": false
}