{
	"id": "16B.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.37",
	"title": "16B.37 REORGANIZATION OF AGENCIES.",
	"text": "To improve efficiency and avoid duplication, the commissioner may transfer personnel, powers, or duties, or any combination of them, from a state agency to another state agency that has been in existence for at least one year prior to the date of transfer. A transfer must have received the prior approval of the governor. The commissioner shall no later than January 15 of each year submit to the legislature a bill making all statutory changes required by reorganization orders issued by the commissioner during the preceding calendar year. For purposes of this section, the Minnesota State Colleges and Universities is a state agency.\nA transfer made pursuant to subdivision 1 must be in the form of a reorganization order. A proposed reorganization order must be submitted to the chairs of the governmental operations committees in the house of representatives and the senate at least 30 days before being filed with the secretary of state. A reorganization order must be filed with the secretary of state, be uniform in format, and be numbered consecutively. An order is effective upon filing with the secretary of state and remains in effect until amended or superseded. Copies of the filed order must be delivered promptly by the commissioner to the secretary of the senate, the chief clerk of the house, and the chairs of the governmental operations committees in the senate and house of representatives. A reorganization order which transfers all or substantially all of the powers or duties or personnel of a department, the Housing Finance Agency, or the Pollution Control Agency is not effective until it is ratified by concurrent resolution or enacted into law.\nThe commissioner of management and budget shall determine the fractional part of the appropriation to the transferor agency that is represented by the transferred personnel, power, or duty, and that part of the appropriation is reappropriated to the transferee agency.\nTo avoid duplication and improve efficiency, the commissioner may direct an agency to do work for another agency or may direct a division or section of an agency to do work for another division or section within the same agency and shall require reimbursement for the work. Reimbursements received by an agency are reappropriated to the account making the original expenditure in accordance with the transfer procedure established by the commissioner of management and budget.\nWith the approval of the governor and by agreement of the heads of the departments or agencies concerned, any appointive subordinate officer or employee of a department or agency may be employed by or assigned to perform duties under another department or agency.",
	"repealed": false
}