{
	"id": "241.275",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.275",
	"title": "241.275 PRODUCTIVE DAY INITIATIVE PROGRAMS; CORRECTIONAL FACILITIES.",
	"text": "(a) As used in this section, \"correctional facility\" includes a community-based day program in which an adult or juvenile offender is placed as part of a sentence or disposition order, if the program provides close supervision of offenders through such means as electronic monitoring and drug and alcohol testing.\n(b) All counties are encouraged to establish a productive day initiative program for adult and juvenile offenders under their jurisdiction. The productive day program shall be designed to motivate offenders to develop basic life and work skills through training and education, thereby creating opportunities for offenders to achieve more successful integration into the community upon their release.\nThe productive day initiative programs may include, but are not limited to, components described in paragraphs (a) to (c).\n(a) The initiative programs may contain programs designed to promote the offender's self-esteem, self-discipline, and economic self-sufficiency by providing structured training and education with respect to basic life skills, including hygiene, personal financial budgeting, literacy, and conflict management.\n(b) The programs may contain individualized educational, vocational, and work programs designed to productively occupy an offender for at least eight hours a day.\n(c) The program administrators may develop correctional industry programs, including marketing efforts to attract work opportunities both inside correctional facilities and outside in the community. Program options may include expanding and reorganizing on-site industry programs, locating off-site industry work areas, community service work programs, and employment programs. To develop innovative work programs, program administrators may enlist members of the business and labor community to help target possible productive enterprises for offender work programs.\n(d) Whenever offenders are assigned to work within the correctional facility or with any state department or agency, local unit of government, or other government subdivision, the program administrator must certify to the appropriate bargaining agent that work performed by offenders will not result in the displacement of current employed workers or workers on seasonal layoff or layoff from a substantially equivalent position, including partial displacement such as reduction in hours of work other than overtime work, wages, or other employment benefits.\nThe administrators of each productive day program shall develop criteria for offender eligibility for the program.\nThe administrators of each of the productive day initiative programs shall develop program evaluation tools to monitor the success of the programs.\n[Repealed, 1999 c 216 art 4 s 17]",
	"repealed": false
}