{
	"id": "572A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/572A.03",
	"title": "572A.03 ARBITRATION PANEL DECISION STANDARDS.",
	"text": "The arbitration panel, based upon the factors in section 572A.02, subdivision 5, shall decide the matter based upon the decision standards in subdivisions 2 to 6.\nFor comprehensive land use planning disputes under section 462.3535, if the arbitrators find that the city's projected estimates found in its comprehensive plan are reasonable with respect to an identified urban growth area, the arbitration panel may order approval of the city plan. If the order is to approve the community-based comprehensive plan, the order shall contain notice directing the county to approve the city plan within ten days of receipt of the arbitration order. The city shall, thereafter, adopt the plan. If the order is to deny the plan, the arbitration order shall state the reasons for the denial in the order and transmit the order to the city and the county. The city shall within 30 days of receipt of the order amend its plan and resubmit the plan to the county for review and approval under this subdivision. The county shall not unreasonably withhold approval of the plan if the resubmitted city plan is in keeping with the arbitration panel's order.\nFor municipal incorporations under section 414.02, the arbitration panel may order the incorporation if it finds that: (1) the property to be incorporated is now, or is about to become, urban or suburban in character; (2) that the existing township form of government is not adequate to protect the public health, safety, and welfare; or (3) the proposed incorporation would be in the best interests of the area under consideration. The panel may deny the incorporation if the area, or a part of it, would be better served by annexation to an adjacent municipality. The panel may alter the boundaries of the proposed incorporation by increasing or decreasing the area to be incorporated so as to include only that property which is now, or is about to become, urban or suburban in character, or may exclude property that may be better served by another unit of government. The panel may also alter the boundaries of the proposed incorporation so as to follow visible, clearly recognizable physical features for municipal boundaries. In all cases, the panel shall set forth the factors which are the basis for the decision.\nFor annexations of unincorporated property under section 414.031 or 414.033, subdivisions 3 and 5, the arbitration panel may order the annexation: (1) if it finds that the subject area is now, or is about to become, urban or suburban in character; (2) if it finds that municipal government in the area proposed for annexation is required to protect the public health, safety, and welfare; or (3) if it finds that the annexation would be in the best interest of the subject area. If only a part of a township is to be annexed, the panel shall consider whether the remainder of the township can continue to carry on the functions of government without undue hardship. The panel shall deny the annexation if it finds that the increase in revenues for the annexing municipality bears no reasonable relation to the monetary value of benefits conferred upon the annexed area. The panel may deny the annexation: (1) if it appears that annexation of all or a part of the property to an adjacent municipality would better serve the interests of the residents of the property; or (2) if the remainder of the township would suffer undue hardship.\nThe panel may alter the boundaries of the area to be annexed by increasing or decreasing the area so as to include only that property which is now or is about to become urban or suburban in character or to add property of that character abutting the area proposed for annexation in order to preserve or improve the symmetry of the area, or to exclude property that may better be served by another unit of government. The panel may also alter the boundaries of the proposed annexation so as to follow visible, clearly recognizable physical features. If the panel determines that part of the area would be better served by another municipality or township, the panel may initiate and approve annexation on its own motion by conducting further hearings. In all cases, the arbitration panel shall set forth the factors that are the basis for the decision.\nFor orderly annexations within a designated area under section 414.0325, which require a hearing, the arbitration panel may order the annexation: (1) if it finds that the subject area is now or is about to become urban or suburban in character and that the annexing municipality is capable of providing the services required by the area within a reasonable time; (2) if it finds that the existing township form of government is not adequate to protect the public health, safety, and welfare; or (3) if it finds that annexation would be in the best interests of the subject area. The panel may deny the annexation if it conflicts with any provision of the joint agreement. The panel may alter the boundaries of the proposed annexation by increasing or decreasing the area so as to include that property within the designated area which is in need of municipal services or will be in need of municipal services.\nIf the annexation is denied, no proceeding for the annexation of substantially the same area may be initiated within two years from the date of the board's order unless the new proceeding is initiated by a majority of the area's property owners and the petition is supported by affected parties to the resolution. In all cases, the arbitration panel shall set forth the factors which are the basis for the decision.\nFor municipal consolidations under section 414.041, the arbitration panel shall consider and may accept, amend, return to the commission for amendment or further study, or reject the commission's findings and recommendations based upon the panel's written determination of what is in the best interests of the affected municipalities. The panel shall order the consolidation if it finds that consolidation will be for the best interests of the municipalities. In all cases, the arbitration panel shall set forth the factors that are the basis for the decision.\nFor detachments of property from a municipality under section 414.06, the arbitration panel may order the detachment if it finds that the requisite number of property owners have signed the petition if initiated by the property owners, that the property is rural in character and not developed for urban residential, commercial, or industrial purposes, that the property is within the boundaries of the municipality and abuts a boundary, that the detachment would not unreasonably affect the symmetry of the detaching municipality, and that the land is not needed for reasonably anticipated future development. The panel shall deny the detachment if it finds that the remainder of the municipality cannot continue to carry on the functions of government without undue hardship. The panel shall have authority to decrease the area of property to be detached and may include only a part of the proposed area to be detached. If the tract abuts more than one township, it shall become a part of each township, being divided by projecting through it the boundary line between the townships. The detached area may be relieved of the primary responsibility for existing indebtedness of the municipality and be required to assume the indebtedness of the township of which it becomes a part, in the proportion that the panel deems just and equitable considering the amount of taxes due and delinquent and the indebtedness of each township and the municipality affected, if any, and for what purpose the indebtedness was incurred, in relation to the benefit inuring to the detached area as a result of the indebtedness and the last net tax capacity of the taxable property in each township and municipality.\nFor concurrent detachment and annexation of incorporated property under section 414.061, subdivisions 4 and 5, the arbitration panel shall order the proposed action if it finds that it will be for the best interests of the municipalities and the property owner. In all cases, the arbitration panel shall set forth the factors which are the basis for the decision.",
	"repealed": false
}