{
	"id": "155A.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/155A.27",
	"title": "155A.27 PRACTITIONER.",
	"text": "A person must hold an individual license to practice in the state as a cosmetologist, esthetician, hair technician, nail technician, eyelash technician, advanced practice esthetician, manager, or instructor.\n(a) Qualifications for licensing in each classification shall be determined by the board and established by rule, and shall include educational and experiential prerequisites.\n(b) A person applying for an individual license to practice as a cosmetologist, hair technician, manager, or instructor must: (1) successfully complete training on the properties of the hair and all hair types and textures, including coil, curl, or wave patterns, hair strand thicknesses, and volumes of hair; and (2) have experience providing services to individuals with hair of all types and textures, including coil, curl, or wave patterns, hair strand thicknesses, and volumes of hair.\n(c) The rules shall require a demonstrated knowledge of procedures necessary to protect the health and safety of the practitioner and the consumer of cosmetology services, including but not limited to infection control, use of implements, apparatuses and other appliances, and the use of chemicals.\n[Repealed, 2014 c 162 s 15]\nAll theory, practical, and Minnesota law and rule testing must be done by a board-approved provider. Appropriate standardized tests shall be used and shall include subject matter relative to the application of Minnesota law. In every case, the primary consideration shall be to safeguard the health and safety of consumers by determining the competency of the applicants to provide the services indicated.\nLicensing of persons without testing may be allowed as determined by rule.\nThe board shall establish temporary licenses for a cosmetologist, hair technician, nail technician, and esthetician in accordance with section 197.4552.\nLicensing in each classification shall be for a period of three years.\nRenewal of license shall be for a period of three years under conditions and process established by rule and subject to continuing education requirements of section 155A.271.\nExamination and licensing fees shall be in the amounts specified in section 155A.25.\n(a) Persons licensed to provide cosmetology services in other states visiting this state for cosmetology demonstrations shall be exempted from the licensing provisions of sections 155A.21 to 155A.36 if services to consumers are in the physical presence of a licensed cosmetologist.\n(b) A person who performs threading shall be exempt from the licensing provisions of sections 155A.21 to 155A.36.\n(c) A person who performs only hairstyling and makeup services shall be exempt from the licensing provisions of sections 155A.21 to 155A.36 if the person has completed a four-hour course in health, safety, and infection-control matters and state law online or in person under section 155A.271, subdivision 1, paragraph (a), from a board-approved continuing education provider, and carries proof of completion of the course when providing these services.\n(a) A nonresident cosmetologist, hair technician, nail technician, esthetician may be licensed in Minnesota if the individual has completed cosmetology school in a state or country with the same or greater school hour requirements, has an active license in that state or country, and has passed a board-approved theory and practice-based examination, the Minnesota-specific written operator examination for cosmetologist, hair technician, nail technician, esthetician. If a test is used to verify the qualifications of trained cosmetologists, the test should be translated into the nonresident's native language within the limits of available resources. Licenses shall not be issued under this subdivision for managers or instructors.\n(b) If an individual has less than the required number of school hours, the individual must have had a current active license in another state or country for at least three years and have passed a board-approved theory and practice-based examination, and the Minnesota-specific written operator examination for cosmetologist, hair technician, nail technician, esthetician. If a test is used to verify the qualifications of trained cosmetologists, the test should be translated into the nonresident's native language within the limits of available resources. Licenses must not be issued under this subdivision for managers or instructors.\n(c) Applicants claiming training and experience in a foreign country shall supply official English-language translations of all required documents from a board-approved source.",
	"repealed": false
}