{
	"id": "12.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.22",
	"title": "12.22 ASSISTANCE, ACCEPTANCE, RULES.",
	"text": "Whenever the federal government, or an agency or officer of the federal government, offers to the state, or through the state to any political subdivision of the state, services, equipment, supplies, materials, or funds by way of gift, grant or loan, for the purposes of emergency management, the state, acting through the governor, or the political subdivision, acting with the consent of the governor and through its governing body, may accept the offer and then may authorize an officer of the state or of the political subdivision, as the case may be, to receive the services, equipment, supplies, materials, or funds on behalf of the state or the political subdivision and subject to the terms of the offer and the rules, if any, of the agency making the offer. However, no money or other funds may be accepted or received as a loan nor any indebtedness incurred except as provided by law.\nWhenever a person offers to the state or to a political subdivision of the state, services, equipment, supplies, materials, real property, or funds by the way of gift, grant, or loan, for purposes of civil emergency management, the state, acting through the governor, or a political subdivision, acting through its governing body, may accept the offer and then may authorize an officer of the state or of the political subdivision, as the case may be, to receive the services, equipment, supplies, materials, real property, or funds on behalf of the state or political subdivision, and subject to the terms of the offer. However, no money or other funds may be accepted or received as a loan nor any indebtedness incurred except as provided by law. Real property so accepted must be treated as, and subject to the same immunities during time of national security emergency as, real property owned by the state.\n(a) Individuals who volunteer to assist a local political subdivision during an emergency or disaster, who register with that subdivision, and who are under the direction and control of that subdivision are considered an employee of that subdivision for purposes of workers' compensation and tort claim defense and indemnification.\n(b) Individuals who volunteer to assist the state during an emergency or disaster, who register with a state agency, and who are under the direction and control of the state agency are considered an employee of the state for purposes of workers' compensation and tort claim defense and indemnification.\n(c) Notwithstanding qualification for volunteer protection under paragraph (a) or (b), a Minnesota Responds Medical Reserve Corps volunteer under sections 145A.04 to 145A.06, responding at the request of the commissioner of health, must receive state workers' compensation benefits and tort claim defense and indemnification as provided in section 145A.06, subdivision 7.\n(a) An entity or an agent acting on behalf of the entity who volunteers without compensation or the expectation of compensation to assist a local jurisdiction during an emergency or disaster, who previously registers with that jurisdiction, and who is under the direction and control of the local jurisdiction is not liable for civil damages or administrative sanctions as a result of good-faith acts or omissions by that entity or agent in rendering emergency care, advice, or assistance.\n(b) An entity or an agent acting on behalf of the entity who volunteers without compensation or the expectation of compensation to assist the state during an emergency or disaster, who previously registers with a state agency, and who is under the direction and control of the state agency is not liable for civil damages or administrative sanctions as a result of good-faith acts or omissions by that entity or agent in rendering emergency care, advice, or assistance.\n(c) This subdivision does not apply if the entity or agent acts in a willful and wanton or reckless manner in providing the care, advice, or assistance.\n(a) The governor may establish rules in accordance with the law for the proper and efficient operation and administration of the emergency management program including methods relating to the establishment and maintenance of personnel standards on a merit basis for all employees of local emergency management agencies. However, the governor shall exercise no authority with respect to the selection, tenure of office, and compensation of any individual employed in accordance with those methods.\n(b) The governor may, by rule, cooperate with the federal government as necessary to qualify for federal aid to carry out the provisions herein expressed. The governor may, by rule, also cooperate with other political units or subdivisions in establishing and maintaining personnel standards on a merit basis.\nNothing in this chapter shall be construed to remove any immunity from, defense to, or limitation on liability provided by the Minnesota Tort Claims Act, the Municipal Tort Claims Act, or other law.",
	"repealed": false
}