{
	"id": "290.0661",
	"url": "https://www.revisor.mn.gov/statutes/cite/290.0661",
	"title": "290.0661 MINNESOTA CHILD TAX CREDIT.",
	"text": "For the purposes of this section, \"qualifying child\" has the meaning given in section 32(c) of the Internal Revenue Code, except:\n(1) excluding individuals who attained the age of 18 or greater in the taxable year; and\n(2) section 32(m) of the Internal Revenue Code does not apply.\nA taxpayer who is a resident of Minnesota is allowed a credit against the tax imposed by this chapter, as provided in this section. To be eligible for the credit under this section, the taxpayer must be eligible for the credit under section 290.0671, except a taxpayer whose earned income was insufficient to claim a credit under that section but who otherwise qualifies to claim the credit is eligible.\nThe credit under this section equals $1,750 per qualifying child.\nThe credits under subdivision 2 and section 290.0671 are phased down jointly. The combined amount of the credits is reduced by 12 percent of earned income or adjusted gross income, whichever is greater, in excess of the phaseout threshold. The phaseout threshold equals:\n(1) $35,000 for a married taxpayer filing a joint return; or\n(2) $29,500 for all other filers.\nFor a part-year resident, the combined amounts of the credit under this section and section 290.0671, after the phaseout in subdivision 4, must be allocated based on the percentage calculated under section 290.06, subdivision 2c, paragraph (e).\nIf the amount of credit which the claimant is eligible to receive under this section exceeds the claimant's tax liability under this chapter, the commissioner shall refund the excess to the claimant. An amount sufficient to pay the refunds required by this section is appropriated to the commissioner from the general fund.\n(a) For taxable years beginning after December 31, 2025, the commissioner of revenue must annually adjust for inflation the credit amount in subdivision 3 as provided in section 270C.22. The adjusted amounts must be rounded to the nearest $60. The statutory year is taxable year 2025.\n(b) For taxable years beginning after December 31, 2023, the commissioner of revenue must annually adjust for inflation the phaseout thresholds in subdivision 4, as provided in section 270C.22. The statutory year is taxable year 2023.\n(a) The commissioner of revenue must establish a process to allow taxpayers to elect to receive one or more advance payments of the credit under this section. The amount of advance payments must be based on the taxpayer and commissioner's estimate of the amount of credits for which the taxpayer would be eligible in the taxable year beginning in the calendar year in which the payments were made. The commissioner must not distribute advance payments to a taxpayer who does not elect to receive advance payments.\n(b) The amount of a taxpayer's credit under this section for the taxable year is reduced by the amount of advance payments received by the taxpayer in the calendar year during which the taxable year began. If a taxpayer's advance payments exceeded the credit the taxpayer was eligible to receive for the taxable year, the taxpayer's liability for tax is increased by the difference between the amount of advance payments received and the credit amount.\n(a) An eligible taxpayer is allowed the greater of the credit allowed under subdivision 2 or the minimum credit described in this subdivision. A taxpayer is eligible for the minimum credit under this subdivision if:\n(1) the taxpayer received an advance payment of the credit under subdivision 8; and\n(2) the combined amount of the taxpayer's credits under subdivision 2 and section 290.0671, after the phaseout in subdivision 4, is greater than $0.\n(b) The credit allowed under this subdivision is equal to 50 percent of the credit received under subdivision 2 in the prior taxable year, unless paragraph (c) applies.\n(c) If a taxpayer is claiming fewer qualifying children in the current taxable year than in the prior taxable year, the minimum credit allowed under this subdivision is equal to 50 percent of credit received under this section in the prior taxable year multiplied by a fraction in which:\n(1) the numerator is the number of qualifying children in the current taxable year; and\n(2) the denominator is the number of qualifying children in the prior taxable year.",
	"repealed": false
}