{
	"id": "147.037",
	"url": "https://www.revisor.mn.gov/statutes/cite/147.037",
	"title": "147.037 LICENSING OF FOREIGN MEDICAL SCHOOL GRADUATES.",
	"text": "The board shall issue a license to practice medicine to any person who satisfies the requirements in paragraphs (a) to (g).\n(a) The applicant shall satisfy all the requirements established in section 147.02, subdivision 1, paragraphs (a), (e), (f), (g), and (h).\n(b) The applicant shall present evidence satisfactory to the board that the applicant is a graduate of a medical or osteopathic school approved by the board as equivalent to accredited United States or Canadian schools based upon its faculty, curriculum, facilities, accreditation, or other relevant data. If the applicant is a graduate of a medical or osteopathic program that is not accredited by the Liaison Committee for Medical Education or the American Osteopathic Association, the applicant may use the Federation of State Medical Boards' Federation Credentials Verification Service (FCVS) or its successor. If the applicant uses this service as allowed under this paragraph, the physician application fee may be less than $200 but must not exceed the cost of administering this paragraph.\n(c) The applicant shall present evidence satisfactory to the board that the applicant has been awarded a certificate by the Educational Council for Foreign Medical Graduates, and the applicant has a working ability in the English language sufficient to communicate with patients and physicians and to engage in the practice of medicine.\n(d) The applicant shall present evidence satisfactory to the board of the completion of one year of graduate, clinical medical training in a program accredited by a national accrediting organization approved by the board. This requirement does not apply to an applicant who is admitted pursuant to the rules of the United States Department of Labor and:\n(1) who was admitted as a permanent immigrant to the United States on or before October 1, 1991, as a person of exceptional ability in the sciences according to Code of Federal Regulations, title 20, section 656.22(d); or\n(2) who holds a valid license to practice medicine in another country and was issued a permanent immigrant visa after October 1, 1991, as a person of extraordinary ability in the field of science or as an outstanding professor or researcher according to Code of Federal Regulations, title 8, section 204.5(h) and (i), or a temporary nonimmigrant visa as a person of extraordinary ability in the field of science according to Code of Federal Regulations, title 8, section 214.2(o).\n(e) The applicant must:\n(1) have passed an examination prepared and graded by the Federation of State Medical Boards, the United States Medical Licensing Examination (USMLE) program in accordance with section 147.02, subdivision 1, paragraph (c), clause (2), or the Medical Council of Canada; and\n(2) if the examination in clause (1) was passed more than ten years ago, either:\n(i) pass the Special Purpose Examination of the Federation of State Medical Boards (SPEX) or the Comprehensive Osteopathic Medical Variable-Purpose Examination of the National Board of Osteopathic Medical Examiners (COMVEX). The applicant must pass the SPEX or COMVEX within no more than three attempts of taking the SPEX, COMVEX, or a combination of the SPEX and COMVEX; or\n(ii) have a current certification by a specialty board of the American Board of Medical Specialties, the American Osteopathic Association, the Royal College of Physicians and Surgeons of Canada, or the College of Family Physicians of Canada; or\n(3) if the applicant fails to meet the requirement established in section 147.02, subdivision 1, paragraph (c), clause (2), because the applicant failed to pass within the permitted three attempts each of steps or levels one, two, and three of the USMLE or the Comprehensive Osteopathic Medical Licensing Examination (COMLEX-USA), the applicant may be granted a license provided the applicant:\n(i) has passed each of steps or levels one, two, and three within no more than four attempts for any of the three steps or levels with passing scores as recommended by the USMLE or COMLEX-USA program;\n(ii) is currently licensed in another state; and\n(iii) has current certification by a specialty board of the American Board of Medical Specialties, the American Osteopathic Association, the Royal College of Physicians and Surgeons of Canada, or the College of Family Physicians of Canada.\n(f) The applicant must not be under license suspension or revocation by the licensing board of the state or jurisdiction in which the conduct that caused the suspension or revocation occurred.\n(g) The applicant must not have engaged in conduct warranting disciplinary action against a licensee or have been subject to disciplinary action other than as specified in paragraph (f). If an applicant does not satisfy the requirements stated in this paragraph, the board may issue a license only on the applicant's showing that the public will be protected through issuance of a license with conditions or limitations the board considers appropriate.\nMS 2020 [Repealed by amendment, 2022 c 99 art 2 s 4]\nThe board may contract with any qualified person or organization for the performance of a review or investigation, including site visits if necessary, of any medical or osteopathic school prior to approving the school under section 147.02, subdivision 1, paragraph (b), or subdivision 1, paragraph (b), of this section. To the extent possible, the board shall require the school being reviewed to pay the costs of the review or investigation.",
	"repealed": false
}