{
	"id": "144G.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.42",
	"title": "144G.42 BUSINESS OPERATION.",
	"text": "The original current license must be displayed at the main entrance of each assisted living facility. The facility must provide a copy of the license to any person who requests it.\nThe facility shall engage in quality management appropriate to the size of the facility and relevant to the type of services provided. \"Quality management activity\" means evaluating the quality of care by periodically reviewing resident services, complaints made, and other issues that have occurred and determining whether changes in services, staffing, or other procedures need to be made in order to ensure safe and competent services to residents. Documentation about quality management activity must be available for two years. Information about quality management must be available to the commissioner at the time of the survey, investigation, or renewal.\n(a) This subdivision does not apply to licensees that are Minnesota counties or other units of government.\n(b) A facility or staff person may not:\n(1) accept a power-of-attorney from residents for any purpose, and may not accept appointments as guardians or conservators of residents; or\n(2) borrow a resident's funds or personal or real property, nor in any way convert a resident's property to the possession of the facility or staff person.\n(c) A facility may not serve as a resident's legal, designated, or other representative.\n(d) Nothing in this subdivision precludes a facility or staff person from accepting gifts of minimal value or precludes acceptance of donations or bequests made to a facility that are exempt from section 501(c)(3) of the Internal Revenue Code.\n(a) A facility may assist residents with household budgeting, including paying bills and purchasing household goods, but may not otherwise manage a resident's property.\n(b) Where funds are deposited with the facility by the resident, the licensee:\n(1) retains fiduciary and custodial responsibility for the funds;\n(2) is directly accountable to the resident for the funds; and\n(3) must maintain records of and provide a resident with receipts for all transactions and purchases made with the resident's funds. When receipts are not available, the transaction or purchase must be documented.\n(c) Subject to paragraph (d), if responsibilities for day-to-day management of the resident funds are delegated to the manager, the manager must:\n(1) provide the licensee with a monthly accounting of the resident funds; and\n(2) meet all legal requirements related to holding and accounting for resident funds.\n(d) The facility must ensure any party responsible for holding or managing residents' personal funds is bonded or obtains insurance in sufficient amounts to specifically cover losses of resident funds and provides proof of the bond or insurance.\nWithin 30 days of the effective date of a facility-initiated or resident-initiated termination of housing or services or the death of the resident, the facility must:\n(1) provide to the resident, resident's legal representative, and resident's designated representative a final statement of account;\n(2) provide any refunds due;\n(3) return any money, property, or valuables held in trust or custody by the facility; and\n(4) as required under section 504B.178, refund the resident's security deposit unless it is applied to the first month's charges.\n(a) The assisted living facility must comply with the requirements for the reporting of maltreatment of vulnerable adults in section 626.557. The facility must establish and implement a written procedure to ensure that all cases of suspected maltreatment are reported.\n(b) The facility must develop and implement an individual abuse prevention plan for each vulnerable adult. The plan shall contain an individualized review or assessment of the person's susceptibility to abuse by another individual, including other vulnerable adults; the person's risk of abusing other vulnerable adults; and statements of the specific measures to be taken to minimize the risk of abuse to that person and other vulnerable adults. For purposes of the abuse prevention plan, abuse includes self-abuse.\nThe facility shall support protection and safety through access to the state's systems for reporting suspected criminal activity and suspected vulnerable adult maltreatment by:\n(1) posting the 911 emergency number in common areas and near telephones provided by the assisted living facility;\n(2) posting information and the reporting number for the Minnesota Adult Abuse Reporting Center to report suspected maltreatment of a vulnerable adult under section 626.557; and\n(3) providing reasonable accommodations with information and notices in plain language.\n(a) The facility must maintain current records of each paid staff member, each regularly scheduled volunteer providing services, and each individual contractor providing services. The records must include the following information:\n(1) evidence of current professional licensure, registration, or certification if licensure, registration, or certification is required by this chapter or rules;\n(2) records of orientation, required annual training and infection control training, and competency evaluations;\n(3) current job description, including qualifications, responsibilities, and identification of staff persons providing supervision;\n(4) documentation of annual performance reviews that identify areas of improvement needed and training needs;\n(5) for individuals providing assisted living services, verification that required health screenings under subdivision 9 have taken place and the dates of those screenings; and\n(6) documentation of the background study as required under section 144.057.\n(b) Each staff record must be retained for at least three years after a paid staff member, volunteer, or contractor ceases to be employed by, provide services at, or be under contract with the facility. If a facility ceases operation, staff records must be maintained for three years after facility operations cease.\n(a) The facility must establish and maintain a comprehensive tuberculosis infection control program according to the most current tuberculosis infection control guidelines issued by the United States Centers for Disease Control and Prevention (CDC), Division of Tuberculosis Elimination, as published in the CDC's Morbidity and Mortality Weekly Report. The program must include a tuberculosis infection control plan that covers all paid and unpaid employees, contractors, students, and regularly scheduled volunteers. The commissioner shall provide technical assistance regarding implementation of the guidelines.\n(b) The facility must maintain written evidence of compliance with this subdivision.\nA facility must follow current state requirements for prevention, control, and reporting of communicable diseases as defined in Minnesota Rules, parts 4605.7040, 4605.7044, 4605.7050, 4605.7075, 4605.7080, and 4605.7090.\n(a) The facility must meet the following requirements:\n(1) have a written emergency disaster plan that contains a plan for evacuation, addresses elements of sheltering in place, identifies temporary relocation sites, and details staff assignments in the event of a disaster or an emergency;\n(2) post an emergency disaster plan prominently;\n(3) provide building emergency exit diagrams to all residents;\n(4) post emergency exit diagrams on each floor; and\n(5) have a written policy and procedure regarding missing residents.\n(b) The facility must provide emergency and disaster training to all staff during the initial staff orientation and annually thereafter and must make emergency and disaster training annually available to all residents. Staff who have not received emergency and disaster training are allowed to work only when trained staff are also working on site.\n(c) The facility must meet any additional requirements adopted in rule.",
	"repealed": false
}