{
	"id": "458D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/458D.07",
	"title": "458D.07 SEWAGE COLLECTION AND DISPOSAL.",
	"text": "In addition to all other powers conferred upon the board in sections 458D.01 to 458D.24, it shall have the powers specified in this section.\nThe board may implement its comprehensive plan, acquire, construct, better, equip, operate and maintain all solid waste disposal sites or facilities within the district. A solid waste disposal site or facility owned by a local government unit or private person may, after payment of just compensation, be acquired or operated by the board.\nExcept as otherwise provided hereafter, should the comprehensive plan provide for the operation of one or more disposal sites or facilities by the district, the district shall acquire, subject to the payment of just compensation, the disposal facility, both real and personal property presently operated by Carlton County, and located in section 9, township 48 north, range 17 west, Carlton County, Minnesota, and the disposal facility, both real and personal property, presently operated by Duluth Disposal Company and located in section 31, township 51, range 14, St. Louis County, Minnesota. Notwithstanding such requirement, the district and Carlton County, or the district and Duluth Disposal Company, or its successors and assigns, as the case may be, may, by agreement, provide for the continued ownership or operation of the disposal facilities referred to above by Carlton County or such company, as the case may be, upon such terms and subject to such conditions as the district and Carlton County or the district and such company may agree.\n(a) Except as provided in paragraph (b), the board shall treat and dispose of solid waste by landfill, incineration or other disposal method subject to the rules and regulations of the agency.\n(b) Ash produced by the fluidized bed sewage sludge incinerators operated by the board is not subject to rules adopted by the agency under section 115A.97, subdivision 3, provided that the ash is disposed of under the rules of the agency relating to the disposal of industrial solid waste.\n(a) The board may provide that every person or local government unit located in the district must dispose of solid waste as provided in the comprehensive plan.\n(b) Upon the adoption of a solid waste plan under section 458D.05, subdivision 2, the plan governs all solid waste management in the district and a public entity, as defined in section 16C.073, subdivision 1, within the district may not:\n(1) enter into a binding agreement governing a solid waste management activity that is inconsistent with that plan, without the consent of the district; or\n(2) develop or implement a solid waste management activity, other than an activity to reduce waste generation or reuse waste materials, that is inconsistent with a solid waste plan that the district is actively implementing, without the consent of the district.\nNothing contained in this chapter shall be construed to permit the district to engage in the collection of solid waste.\nThe district may require recycling and regulate the collection of recyclable materials in the district.\nThe board shall have the right to discharge the effluent from any treatment works operated by it into any waters of the state, subject to the approval of the agency if required, and in accordance with any effluent or water quality standards lawfully adopted by the agency, by any interstate agency or by any federal agency having jurisdiction.\nThe board may require any person or local government unit located in the district to provide for the discharge of any sewage, directly or indirectly, into the district disposal system, or to connect any disposal system or a part thereof with the district disposal system wherever reasonable opportunity therefor is provided; may regulate the manner in which such connections are made; may require any person or local government unit discharging sewage into the disposal system to provide preliminary treatment therefor; may prohibit the discharge into the district disposal system of any substance which it determines will or may be harmful to the system or any persons operating it; and may require any local government unit to discontinue the acquisition, betterment, or operation of any facility for such unit's disposal system wherever and so far as adequate service is or will be provided by the district disposal system.\nThe board may require that any charges, connection fees or other cost recovery techniques imposed by a local government unit on persons discharging sewage directly or indirectly into the district disposal system, comply with applicable state and federal law, including but not limited to state and federal regulations governing grant applications.",
	"repealed": false
}