{
	"id": "137.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.35",
	"title": "137.35 TARGETED BUSINESSES.",
	"text": "(a) The regents may award up to a six percent preference in the amount bid for specified goods and services to small targeted group businesses designated under section 16C.16, subdivision 5.\n(b) The regents may designate a purchase of goods or services for award only to small targeted group businesses designated under section 16C.16, subdivision 5, if the regents determine that at least three small targeted group businesses are likely to bid.\n(c) The regents, as a condition of awarding a construction contract or approving a contract for consultant, professional, or technical services, may set goals that require the prime contractor to subcontract a portion of the contract to small targeted group businesses. The regents must establish a procedure for granting waivers from the subcontracting requirement when qualified small targeted group businesses are not reasonably available. The regents may establish financial incentives for prime contractors who exceed the goals for use of subcontractors and financial penalties for prime contractors who fail to meet goals under this paragraph. The subcontracting requirements of this paragraph do not apply to prime contractors who are small targeted group businesses. At least 75 percent of the value of the subcontracts awarded to small targeted group businesses under this paragraph must be performed by the business to which the subcontract is awarded or by another small targeted group business.\n(d) The regents may award up to a four percent preference in the amount bid on university procurement to small businesses located in an economically disadvantaged area as defined in section 16C.16, subdivision 7.\n(e) The regents may delegate responsibility under this section to university employees.\nThe rules adopted by the commissioner of administration to define small businesses and to set time and other eligibility requirements for participation in programs under sections 16C.16 to 16C.19 apply to this section.\nThe regents are encouraged to purchase from small targeted group businesses designated under section 16C.16 when making purchases that are not subject to competitive bidding procedures.\n[Repealed, 1995 c 212 art 2 s 22]",
	"repealed": false
}