{
	"id": "13A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/13A.02",
	"title": "13A.02 ACCESS TO FINANCIAL RECORDS BY GOVERNMENT AUTHORITIES PROHIBITED.",
	"text": "Except as authorized by this chapter, no government authority may have access to, or obtain copies of, or the information contained in, the financial records of any customer from a financial institution unless the financial records are reasonably described and:\n(1) the customer has authorized the disclosure;\n(2) the financial records are disclosed in response to a search warrant;\n(3) the financial records are disclosed in response to a judicial or administrative subpoena;\n(4) the financial records are disclosed to law enforcement, a lead investigative agency as defined in section 626.5572, subdivision 13, or prosecuting authority that is investigating financial exploitation of a vulnerable adult in response to a judicial subpoena or administrative subpoena under section 388.23; or\n(5) the financial records are disclosed pursuant to section 609.527 or 609.535 or other statute or rule.\nNo financial institution, or officer, employee, or agent of a financial institution, may provide to any government authority access to, or copies of, or the information contained in, the financial records of any customer except in accordance with the provisions of this chapter.\nNothing in this chapter shall require a financial institution to inquire or determine that those seeking disclosure have duly complied with the requirements of this chapter, provided only that the customer authorization, search warrant, subpoena, or written certification pursuant to section 609.527, subdivision 8; 609.535, subdivision 6; 626.557; or other statute or rule, served on or delivered to a financial institution shows compliance on its face.\nWithin 180 days after a government authority obtains access to the financial records of a customer pursuant to a search warrant or a judicial or administrative subpoena, it shall notify the customer of its action unless a delay of notice is obtained pursuant to section 13A.03. The notice shall be sufficient to inform the customer of the name of the government authority or government authorities having had access to the records, the financial records to which access was obtained, and the purpose of the law enforcement inquiry, including transfers of financial records made pursuant to subdivision 5. Notice may be given by providing the customer with a copy of the search warrant or subpoena.\nUpon receipt of a request for financial records made by a government authority, the financial institution shall, unless otherwise provided by law, proceed to assemble the records requested within a reasonable time and be prepared to deliver the records to the government authority upon receipt of the search warrant or subpoena required under this section.\nFinancial records originally obtained pursuant to this chapter may be transferred to another government authority provided the transferred records are pertinent and necessary to the receiving authority in initiating, furthering, or completing a law enforcement inquiry.\nWhen financial records subject to this chapter are transferred to another government authority, the transferring authority shall include the name of the receiving authority and the financial records transferred in the notice required by subdivision 3 of this section or, if the transfer occurs after the notice has been sent to the customer, the transferring authority shall, upon written request by the customer, inform the customer of the name of the government authority to which the financial records were transferred.\nAll financial records obtained by a government authority pursuant to this section are subject to the provisions of section 13.82, subdivision 7.",
	"repealed": false
}