{
	"id": "116A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.02",
	"title": "116A.02 PETITION.",
	"text": "Before any public water or sewer system or combined water and sewer system authorized by sections 116A.01 to 116A.26 is established, a petition therefor shall be filed with the county auditor, if for a system entirely within one county, or with the court administrator of the district court, if for a system within two or more counties. The petition shall be signed by the owners of at least 50 percent of the area, exclusive of the holders of easements for electric or telephone transmission and distribution lines of lands described in the petition as those to be served by the proposed system, and shall state that the system will be of public benefit and utility and will promote the public health and that the petitioners will pay all costs and expenses which may be incurred in case the proceedings are dismissed or for any reason no contract for the construction thereof is let. The petition may be signed by the authorized representative of any municipal corporation or by the commissioner of transportation, or the authorized agent of any public institution or any corporation which may be affected by or assessed for the proposed construction. Petitioners may employ an attorney to represent them in all proceedings pursuant to sections 116A.01 to 116A.26, and said attorney shall be compensated as ordered by the board or court.\nAfter a petition has been filed, no petitioner may withdraw therefrom except with the written consent of all other petitioners filed with the auditor or clerk.\nEach owner who joins in the petition or who prior to June 3, 1977 has signed a petition for such a district, grants to the county or counties or commission, if the system is thereafter established, an easement to use the owner's land within the system area for the purposes of the system in any manner that will not permanently and substantially disturb the owner's use, including the right to enter upon that land temporarily for construction or maintenance of the system, if notice that the petition has the effect of granting the easement is set forth in the petition or is otherwise given in writing to the owner prior to the owner's execution of the petition, or the petition was signed prior to June 3, 1977. Unless an emergency exists, the owner may require one week's notice before entry upon the property is permitted pursuant to this subdivision.\nAny county board, by duly adopted resolution, and without a petition filed therefor, may initiate the proceedings for the establishment of a water or sewer system or combined water and sewer system as provided in sections 116A.01 to 116A.26. The proceedings thereafter shall be the same as for proceedings initiated by petition except that no bond need be filed. If any proceeding initiated by resolution of a county board is dismissed, the county shall pay all expenses connected with such proceeding.\nA county board, or boards if more than one county is involved, by duly adopted resolution, may, without a petition filed therefor and after making such investigations as the board or boards consider necessary, form a water or sewer district or combined water or sewer district within the county or counties and may expend available funds for this purpose without the board or, if more than one county is involved, the court first ordering the establishment of a water or sewer system or combined water and sewer system as provided in sections 116A.01 to 116A.26. Thereafter the county board or court may establish for all or a part of the district one or more water systems or sewer systems or combined water and sewer systems either by petition or on the initiative of the board of any county located in whole or part within the district, as provided in sections 116A.01 to 116A.26, except that no bond need be filed whenever the county board elects to proceed on its own initiative. If a proceeding is initiated by resolution of a county board and is dismissed, the county shall pay the expenses connected with the proceeding.",
	"repealed": false
}