{
	"id": "609.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.101",
	"title": "609.101 SURCHARGE ON FINES, ASSESSMENTS; MINIMUM FINES.",
	"text": "[Repealed, 1998 c 367 art 8 s 26]\nNotwithstanding any other law, when a court sentences a person convicted of violating section 609.221, 609.222, 609.223, 609.2231, 609.224, 609.2242, 609.267, 609.2671, 609.2672, 609.342, 609.343, 609.344, or 609.345, it must impose a fine of not less than 30 percent of the maximum fine authorized by law nor more than the maximum fine authorized by law.\nThe court shall collect the portion of the fine mandated by this subdivision and forward 70 percent of it to a local victim assistance program that provides services locally in the county in which the crime was committed. The court shall forward the remaining 30 percent to the commissioner of management and budget to be credited to the general fund. If more than one victim assistance program serves the county in which the crime was committed, the court may designate on a case-by-case basis which program will receive the fine proceeds, giving consideration to the nature of the crime committed, the types of victims served by the program, and the funding needs of the program. If no victim assistance program serves that county, the court shall forward 100 percent of the fine proceeds to the commissioner of management and budget to be credited to the general fund. Fine proceeds received by a local victim assistance program must be used to provide direct services to crime victims.\nThe minimum fine required by this subdivision is in addition to the surcharge or assessment required by section 357.021, subdivision 6, and is in addition to any sentence of imprisonment or restitution imposed or ordered by the court.\nAs used in this subdivision, \"victim assistance program\" means victim witness programs within county attorney offices or any of the following programs: crime victim crisis centers, victim-witness programs, battered women shelters and nonshelter programs, and sexual assault programs.\n(a) Notwithstanding any other law, when a court sentences a person convicted of a controlled substance crime under sections 152.021 to 152.025 and 152.0262, it must impose a fine of not less than 30 percent of the maximum fine authorized by law nor more than the maximum fine authorized by law.\n(b) The minimum fine required by this subdivision is in addition to the surcharge or assessment required by section 357.021, subdivision 6, and is in addition to any sentence of imprisonment or restitution imposed or ordered by the court.\n(c) The court shall collect the fine mandated by this subdivision and forward 70 percent of it to a local drug abuse prevention or intervention program existing or being implemented in the county in which the crime was committed. The court shall forward the remaining 30 percent to the commissioner of management and budget to be credited to the general fund. If more than one drug abuse prevention or intervention program serves the county in which the crime was committed, the court may designate on a case-by-case basis which program will receive the fine proceeds, giving consideration to the community in which the crime was committed, the funding needs of the program, the number of peace officers in each community certified to teach the program, and the number of children served by the program in each community. If no drug abuse prevention or intervention program serves communities in that county, the court shall forward 100 percent of the fine proceeds to the commissioner of management and budget to be credited to the general fund.\n(d) The minimum fines required by this subdivision shall be collected as are other fines. Fine proceeds received by a local drug abuse prevention or intervention program must be used to support that program, and may be used for salaries of program staff or peace officers certified to teach the program. The program must report receipt and use of money generated under this subdivision to the state court administrator by January 15 of each year. The state court administrator must make this information available upon request.\n(e) As used in this subdivision, \"drug abuse prevention or intervention program\" and \"program\" include:\n(1) the drug abuse resistance education program described in section 299A.33;\n(2) a drug abuse education and prevention program that includes the following components:\n(i) instruction for students enrolled in kindergarten through grade six that is designed to teach students to recognize and resist pressures to experiment with controlled substances and alcohol;\n(ii) provisions for parental involvement;\n(iii) classroom instruction by uniformed law enforcement personnel;\n(iv) the use of positive student leaders to influence younger students not to use drugs; and\n(v) an emphasis on activity-oriented techniques designed to encourage student-generated responses to problem-solving situations; and\n(3) a juvenile court program that:\n(i) provides intervention strategies to reduce drug abuse and criminal behavior in juvenile offenders; and\n(ii) promotes local drug abuse prevention efforts within the community.\nNotwithstanding any other law:\n(1) when a court sentences a person convicted of a felony that is not listed in subdivision 2 or 3, it must impose a fine of not less than 30 percent of the maximum fine authorized by law nor more than the maximum fine authorized by law; and\n(2) when a court sentences a person convicted of a gross misdemeanor or misdemeanor that is not listed in subdivision 2, it must impose a fine of not less than 30 percent of the maximum fine authorized by law nor more than the maximum fine authorized by law, unless the fine is set at a lower amount on a uniform fine schedule established by the Judicial Council in consultation with affected state and local agencies. This schedule shall be promulgated not later than September 1 of each year and shall become effective on January 1 of the next year unless the legislature, by law, provides otherwise.\nThe minimum fine required by this subdivision is in addition to the surcharge or assessment required by section 357.021, subdivision 6, and is in addition to any sentence of imprisonment or restitution imposed or ordered by the court.\n(a) The court may not waive payment of the minimum fine required by this section.\n(b) If the defendant qualifies for the services of a public defender or the court finds on the record that the convicted person is indigent or that immediate payment of the fine would create undue hardship for the convicted person or that person's immediate family, the court may reduce the amount of the minimum fine to not less than $50. Additionally, the court may permit the defendant to perform community work service in lieu of a fine.\n(c) The court also may authorize payment of the fine in installments.",
	"repealed": false
}