{
	"id": "62Q.522",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.522",
	"title": "62Q.522 COVERAGE OF CONTRACEPTIVE METHODS AND SERVICES.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Contraceptive method\" means a drug, device, or other product approved by the Food and Drug Administration to prevent unintended pregnancy.\n(c) \"Contraceptive service\" means consultation, examination, procedures, and medical services related to the prevention of unintended pregnancy, excluding vasectomies. This includes but is not limited to voluntary sterilization procedures, patient education, counseling on contraceptives, and follow-up services related to contraceptive methods or services, management of side effects, counseling for continued adherence, and device insertion or removal.\n(d) \"Medical necessity\" includes but is not limited to considerations such as severity of side effects, difference in permanence and reversibility of a contraceptive method or service, and ability to adhere to the appropriate use of the contraceptive method or service, as determined by the attending provider.\n(e) \"Therapeutic equivalent version\" means a drug, device, or product that can be expected to have the same clinical effect and safety profile when administered to a patient under the conditions specified in the labeling, and that:\n(1) is approved as safe and effective;\n(2) is a pharmaceutical equivalent: (i) containing identical amounts of the same active drug ingredient in the same dosage form and route of administration; and (ii) meeting compendial or other applicable standards of strength, quality, purity, and identity;\n(3) is bioequivalent in that:\n(i) the drug, device, or product does not present a known or potential bioequivalence problem and meets an acceptable in vitro standard; or\n(ii) if the drug, device, or product does present a known or potential bioequivalence problem, it is shown to meet an appropriate bioequivalence standard;\n(4) is adequately labeled; and\n(5) is manufactured in compliance with current manufacturing practice regulations.\n(a) A health plan must provide coverage for contraceptive methods and services.\n(b) A health plan company must not impose cost-sharing requirements, including co-pays, deductibles, or coinsurance, for contraceptive methods or services.\n(c) A health plan company must not impose any referral requirements, restrictions, or delays for contraceptive methods or services.\n(d) A health plan must include at least one of each type of Food and Drug Administration approved contraceptive method in its formulary. If more than one therapeutic equivalent version of a contraceptive method is approved, a health plan must include at least one therapeutic equivalent version in its formulary, but is not required to include all therapeutic equivalent versions.\n(e) For each health plan, a health plan company must list the contraceptive methods and services that are covered without cost-sharing in a manner that is easily accessible to enrollees, health care providers, and representatives of health care providers. The list for each health plan must be promptly updated to reflect changes to the coverage.\n(f) If an enrollee's attending provider recommends a particular contraceptive method or service based on a determination of medical necessity for that enrollee, the health plan must cover that contraceptive method or service without cost-sharing. The health plan company issuing the health plan must defer to the attending provider's determination that the particular contraceptive method or service is medically necessary for the enrollee.\nMS 2023 Supp [Repealed, 2024 c 114 art 1 s 17; 2024 c 127 art 57 s 71]\n[See Note.]\nMS 2023 Supp [Repealed, 2024 c 114 art 1 s 17; 2024 c 127 art 57 s 71]\n[See Note.]",
	"repealed": false
}