{
	"id": "302A.433",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.433",
	"title": "302A.433 SPECIAL MEETINGS OF SHAREHOLDERS.",
	"text": "Special meetings of the shareholders may be called for any purpose or purposes at any time, by:\n(a) the chief executive officer;\n(b) the chief financial officer;\n(c) two or more directors;\n(d) a person authorized in the articles or bylaws to call special meetings; or\n(e) a shareholder or shareholders holding ten percent or more of the voting power of all shares entitled to vote, except that a special meeting for the purpose of considering any action to directly or indirectly facilitate or effect a business combination, including any action to change or otherwise affect the composition of the board of directors for that purpose, must be called by 25 percent or more of the voting power of all shares entitled to vote.\nA shareholder or shareholders holding the voting power specified in subdivision 1, paragraph (e), may demand a special meeting of shareholders by written notice of demand given to the chief executive officer or chief financial officer of the corporation and containing the purposes of the meeting. Within 30 days after receipt of the demand by one of those officers, the board shall cause a special meeting of shareholders to be called and held on notice no later than 90 days after receipt of the demand, all at the expense of the corporation. If the board fails to cause a special meeting to be called and held as required by this subdivision, the shareholder or shareholders making the demand may call the meeting by giving notice as required by section 302A.435, all at the expense of the corporation.\nSpecial meetings shall be held on the date and at the time and place fixed by the chief executive officer, the chief financial officer, the board, or a person authorized by the articles or bylaws to call a meeting, except that a special meeting called by or at the demand of a shareholder or shareholders pursuant to subdivision 2 shall be held in the county where the principal executive office is located. To the extent authorized in the articles or bylaws, the board of directors may determine that a special meeting of the shareholders shall be held solely by means of remote communication in accordance with section 302A.436, subdivision 2.\nThe business transacted at a special meeting is limited to the purposes stated in the notice of the meeting. Any business transacted at a special meeting that is not included in those stated purposes is voidable by or on behalf of the corporation, unless all of the shareholders have waived notice of the meeting in accordance with section 302A.435, subdivision 4.",
	"repealed": false
}