{
	"id": "197.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.61",
	"title": "197.61 VETERANS SERVICE ORGANIZATIONS GRANT PROGRAM.",
	"text": "A veterans service organization grant program is established to provide grants to congressionally chartered veterans service organizations (VSO) to enhance the effectiveness of veterans services. The program shall be administered by the commissioner of veterans affairs.\n(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Accredited representation\" means providing representation under the authority granted by the VA to representatives, agents, and attorneys to assist claimants in the preparation, presentation, and prosecution of claims for VA benefits.\n(c) \"Commissioner\" means the commissioner of veterans affairs or a designee.\n(d) \"Congressionally chartered veterans service organizations\" are organizations that have been granted charters by Congress through the enactment of public laws. Each congressionally chartered VSO is listed in United States Code, title 36, subtitle II: Patriotic and National Organizations.\n(e) \"Department\" means the Department of Veterans Affairs.\n(f) \"Full member\" means a veteran who meets the requirements for membership in a congressionally chartered veterans service organization and is entitled to all of the rights and privileges thereof. Full member does not include an associate or auxiliary member.\n(g) \"VA\" means the United States Department of Veterans Affairs.\nTo be eligible for a grant under subdivision 6, a veterans service organization must provide:\n(1) accredited representation for the preparation and presentation of veteran claims to the United States government for compensation and other benefits to which a veteran is entitled as a result of the veteran's military service;\n(2) a state or department level veterans service officer to provide programs and services to veterans; or\n(3) statewide transportation services to veterans.\n(a) A grant may be used only for the purpose of enhancing the operations of congressionally chartered veterans service organizations.\n(b) The commissioner shall provide a list of qualifying uses for grant expenditures as required in subdivision 5 and shall approve a grant for a qualifying use if there is sufficient grant money remaining in the grant program to cover the full amount of the grant.\nThe commissioner shall develop a list of qualifying uses for grants awarded under this section.\n(a) Each congressionally chartered veterans service organization is eligible to receive an annual grant determined by the commissioner as follows:\n(1) a dollar amount per full member for each organization member to be established by the commissioner. The dollar amount may be adjusted every biennium, subject to available funding; and\n(2) a dollar amount for each organization, established by the commissioner, based on the organization's share of the VA claims workload for veterans and their dependents who reside in Minnesota. The VA claims workload must be reported as a percentage of the state's total VA workload.\n(b) The VA claims workload for each congressionally chartered veterans service organization must be determined by a report supplied by the VA, as adopted by the commissioner.\nIf a congressionally chartered veterans service organization fails to use the grant for a qualified use approved by the commissioner or does not spend the allocated grant money, the commissioner shall seek recovery of the grant from the organization and the organization must repay the grant amount or any unused grant money.",
	"repealed": false
}