{
	"id": "507.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/507.07",
	"title": "507.07 WARRANTY AND QUITCLAIM DEEDS.",
	"text": "Warranty and quitclaim deeds may be substantially in the following forms:\nWARRANTY DEED\nA.B., grantor, of (here insert the place of residence), for and in consideration of (here insert the consideration), conveys and warrants to C.D., grantee, of (here insert the place of residence), the following described real estate in the county of .........................., in the state of Minnesota: (here describe the premises).\nDated this ............... day of ................, .......\n(Signature) ...................................\nEvery such instrument, duly executed as required by law, shall be a conveyance in fee simple of the premises described to the grantee, the grantee's heirs and assigns, with covenants on the part of the grantor, the grantor's heirs and personal representatives, that the grantor is lawfully seized of the premises in fee simple and has good right to convey the same; that the premises are free from all encumbrances; that the grantor warrants to the grantee, the grantee's heirs and assigns, the quiet and peaceable possession thereof; and that the grantor will defend the title thereto against all persons who may lawfully claim the same. Such covenants shall be obligatory upon any grantor, the grantor's heirs and personal representatives, as fully and with like effect as if written at length in such deed.\nQUITCLAIM DEED\nA.B., grantor, of (here insert the place of residence), for the consideration of (here insert the consideration), conveys and quitclaims to C.D., the grantee, of (here insert the place of residence), all interest in the following described real estate in the county of .........................., in the state of Minnesota: (here describe the premises).\nDated this ............... day of ................, .......\n(Signature) ...................................\nEvery such instrument, duly executed, shall be a conveyance to the grantee, the grantee's heirs and assigns, of all right, title, and interest of the grantor in the premises described, but shall not extend to after acquired title, unless words expressing such intention be added.",
	"repealed": false
}