{
	"id": "241.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/241.31",
	"title": "241.31 ESTABLISHMENT AND OPERATION BY MUNICIPALITY.",
	"text": "Notwithstanding any provisions of Minnesota Statutes to the contrary, any city, county or town, or any nonprofit corporation approved by the commissioner of corrections, or any combination thereof may establish and operate a community corrections program for the purpose of providing housing, supervision, treatment, counseling or other correctional services;\n(a) to persons convicted of crime in the courts of this state and placed on probation by such courts pursuant to section 609.135;\n(b) to persons not yet convicted of a crime but under criminal accusation who voluntarily accept such treatment;\n(c) to persons adjudicated a delinquent under chapter 260;\n(d) with the approval of the commissioner of corrections, to persons paroled under chapter 242; and\n(e) with the approval of the commissioner of corrections, to persons paroled under section 243.05 or released under section 241.26.\nCommunity corrections programs established under this section may be administered by a nonprofit corporation, by the political subdivision establishing same, or by a community corrections board organized and composed in the same manner that a community mental health center board is composed and organized under section 245.66.\nThe premises and facilities for any community correctional program may be acquired by purchase, lease, or gift, and may be established and operated in connection with existing public or private institutions or agencies.\nAny political subdivision, as described in subdivision 1, may use unexpended funds, levy additional taxes, accept gifts, grants and subsidies from any lawful source, or make application for federal funds in order to provide the necessary funds for the establishment and operation of a community corrections program.\nThe commissioner of corrections shall establish minimum standards for the size, area to be served, qualifications of staff, ratio of staff to client population, and treatment programs for community corrections programs established pursuant to this section. Plans and specifications for such programs, including proposed budgets must first be submitted to the commissioner for approval prior to the establishment. Community corrections programs must maintain a supply of opiate antagonists, as defined in section 604A.04, subdivision 1, at each correctional site to be administered in compliance with section 151.37, subdivision 12. Each site must have at least two doses of an opiate antagonist on site. Staff must be trained on how and when to administer opiate antagonists.\nWith the approval of the Direct Care and Treatment executive board any city, county, town, or any nonprofit corporation approved by the commissioner of corrections, or any combination thereof, may obtain by lease the use of any building or unit thereof located upon the grounds of a state hospital, and may contract with such state hospital and with community mental health centers for consultative and clinical services.\nFor the purpose of demonstrating the effectiveness of the community corrections programs authorized by this section and to promote the development of such programs the commissioner of corrections may, out of funds appropriated for such purposes, make grants not to exceed 65 percent of the costs of operating such programs, provided however, that the commissioner may make grants of 100 percent of the operating costs of such programs operated by the Indian reservation business committees exercising governmental functions pursuant to congressional charters. Community corrections programs established under the provisions of Laws 1971, chapter 782 must comply with the provisions of subdivision 5 to be eligible to apply for and receive the assistance provided by this subdivision.\nThe commissioner shall review at least annually each program established under Laws 1971, chapter 782 and review its projected annual operating costs to ensure continued compliance with minimum standards, and may withhold funds for noncompliance.",
	"repealed": false
}