{
	"id": "28A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.09",
	"title": "28A.09 INSPECTION FEES FOR VENDING MACHINES.",
	"text": "Every food vending machine is subject to an annual state inspection fee of $25 for each nonexempt machine except nut vending machines which are subject to an annual state inspection fee of $10 for each machine, provided that:\n(1) Food vending machines may be inspected by either a home rule charter or statutory city, or a county, but not both, and if inspected by a home rule charter or statutory city, or a county they shall not be subject to the state inspection fee, but the home rule charter or statutory city, or the county may impose an inspection or license fee of no more than the state inspection fee. A home rule charter or statutory city or county that does not inspect food vending machines shall not impose a food vending machine inspection or license fee.\n(2) Vending machines dispensing only gum balls, hard candy, unsorted candy, or ice manufactured and packaged by another, and water dispensing machines serviced by a cashier, are exempt from the state inspection fee, but may be inspected by the state. A home rule charter or statutory city may impose by ordinance an inspection or license fee of no more than the state inspection fee for nonexempt machines on the vending machines and water dispensing machines described in this paragraph. A county may impose by ordinance an inspection or license fee of no more than the state inspection fee for nonexempt machines on the vending machines and water dispensing machines described in this paragraph which are not located in a home rule charter or statutory city.\n(3) Vending machines dispensing only bottled or canned soft drinks are exempt from the state, home rule charter or statutory city, and county inspection fees, but may be inspected by the commissioner or the commissioner's designee.\nThe commissioner may require that a vending machine must be identified in accordance with rules promulgated pursuant to chapter 14.\nA vending machine inspection account is established in the agricultural fund. Fees paid under subdivision 1 must be deposited in this account. Money in the account, including interest, is appropriated to the commissioner for expenses relating to identifying and inspecting food vending machines under chapters 28 to 34A or rules adopted under one of those chapters.",
	"repealed": false
}