{
	"id": "97C.342",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.342",
	"title": "97C.342 DISEASE-FREE CERTIFICATION; FROZEN OR DEAD FISH BAIT.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"Water body\" means waters identified by a unique Department of Natural Resources public water identification number; a body of water that has defined boundaries and that has no Department of Natural Resources public water identification number; or a section of stream designated by a Kittle number, lock and dam numbering system, or to the upstream and downstream barrier.\n(2) \"Commercial license\" means a license issued under section 97A.475, subdivision 26, 27, 29, or 30.\n(a) Frozen or dead fish on the VHS-susceptible-species list under section 17.4982, subdivision 21b; cisco (all Coregonus, including lake herring and tullibee); and smelt (all Osmerus, Spirincus, Hypomesus, and Allosmerus) being used as bait in waters of the state must originate from water bodies certified disease-free. A water body is certified as disease-free if:\n(1) the water body has been tested for viral hemorrhagic septicemia and the testing indicates the disease is not present; or\n(2) the water body is located within a viral hemorrhagic septicemia-free zone posted on the Department of Natural Resources website.\n(b) Certification for individually tested water bodies is valid for one year from the date of test results. Certification of water bodies within a viral hemorrhagic septicemia-free zone posted on the Department of Natural Resources website is valid for the dates included in the posting. A viral hemorrhagic septicemia-free certification is also referred to as fish health certification.\nAs a part of commercial licensing procedures, a list of water bodies requiring a fish health certification for commercial bait harvest must be provided to the commissioner no later than March 1 of each year, except in 2011 the list must be provided by August 1.\nNotwithstanding section 16A.1283, the commissioner may by written order published in the State Register, establish fees for the services and testing required to issue health certifications for a water body. The fees must be set in an amount that does not recover significantly more or less than the costs of providing services to health certify a water body. The fees are not subject to the rulemaking provisions of chapter 14 and sections 14.125 and 14.386 do not apply. The services covered under this subdivision include:\n(1) cost of collecting the species for testing;\n(2) fish health inspection and certification, including initial tissue sample collection, basic fish health assessment, and fish disease testing; and\n(3) administrative overhead for tracking and documentation of testing.\nA commercial licensee harvesting from a certified disease-free water body must obtain a live fish importation, transportation, and stocking permit to move fish from that source. A live fish importation, transportation, and stocking permit may be used for multiple shipments within a 30-day term period if the source and destination remain the same. The commercial licensee must contact the department within 24 hours of exercising the permit. Permits may be issued through the department's regional offices or St. Paul office and must be obtained prior to moving fish as approved for movement from these certified disease-free water bodies.\nA commercial licensee harvesting bait under this section must maintain records on forms provided by the commissioner for each lot of frozen or dead fish for sale as bait. The records must include the lot number for each batch of frozen or dead fish, water body health certification documentation, transportation permit number, and other information as specified on the reporting form. The commercial licensee must enter required records onto forms within 24 hours of packaging and labeling each lot of fish. The commercial licensee must retain records for three years following the year of creation. All records required to be retained must be open to inspection by the commissioner at any reasonable time.\nFrozen or dead fish from certified disease-free water bodies that are being sold as bait must be labeled. The seller of the product is responsible for making sure the items are labeled according to this section. Each container or package of frozen or dead fish bait must have the following information:\n(1) Department of Natural Resources certified water body number;\n(2) Department of Natural Resources transportation permit number;\n(3) lot number;\n(4) date of harvest from water body;\n(5) date of packaging and labeling;\n(6) bait store or vendor name where purchased; and\n(7) disease-free certification date.\nA person on, or taking wild animals in, waters of the state with frozen or dead fish bait must possess all labeling as prescribed under subdivision 7. The person must retain the labeling until the bait is used and no longer in the person's possession.",
	"repealed": false
}