{
	"id": "60B.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.35",
	"title": "60B.35 ASSESSMENTS.",
	"text": "As soon as practicable but not more than two years from the date of an order of liquidation under section 60B.21 of an insurer issuing assessable policies, the liquidator shall make a report to the court setting forth:\n(a) the reasonable value of the assets of the insurer;\n(b) the insurer's probable total liabilities; and\n(c) the probable aggregate amount of the assessment necessary to pay all claims of creditors and expenses in full, including expenses of administration and costs of collecting the assessment.\n(a) Upon the basis of the report provided in subdivision 1, including any supplements and amendments thereto, the court may levy ex parte one or more assessments against all members of the insurer who are subject to assessment.\n(b) Subject to any applicable legal limits on assessability, the aggregate assessment shall be for the amount that the sum of the probable liabilities, the expenses of administration, and the estimated cost of collection of the assessment exceeds the value of existing assets, with due regard being given to assessments that cannot be collected economically.\nAfter levy of assessment under subdivision 2, the court shall issue an order directing each member who has not paid the assessment pursuant to the order to show cause why the liquidator shall not have a judgment therefor. If a member of the insurer also appears to be indebted to the insurer apart from the assessment, the court, upon application of the liquidator, may also direct the member to show cause why the member should not pay the other indebtedness. Liability for such indebtedness shall be determined in the same manner and at the same time as the liability to pay the assessment.\nThe liquidator shall give notice of the order to show cause by publication if so directed by the court and by first class mail to each member liable thereunder mailed at least 20 days before the return day of the order to show cause to the last known address as it appears on the records of the insurer.\n(a) If a member does not appear and serve duly verified objections upon the liquidator upon the return day of the order to show cause under subdivision 3, the court shall make an order adjudging the member liable for the amount of the assessment against the member and other indebtedness, pursuant to subdivision 3, together with costs, and the liquidator shall have a judgment against the member therefor.\n(b) If on such return day, the member appears and serves duly verified objections upon the liquidator, the court may hear and determine the matter or may appoint a referee to hear it and make such order as the facts warrant. Any order made by a referee under this clause shall have the same force and effect as if it were a judgment of the court, subject to review by the court upon application within 30 days.\nThe liquidator may enforce any order or collect any judgment under subdivision 5 by any lawful means.",
	"repealed": false
}