{
	"id": "246C.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.09",
	"title": "246C.09 OFFICE OF EXECUTIVE MEDICAL DIRECTOR.",
	"text": "The Office of Executive Medical Director within Direct Care and Treatment is established.\nThe executive board shall appoint, and unless otherwise established by law, set the salary of a licensed physician to serve as executive medical director to assist in establishing and maintaining the medical policies of Direct Care and Treatment. The executive board may place the executive medical director's position in the unclassified service if the position meets the criteria of section 43A.08, subdivision 1a. The executive medical director must be a psychiatrist certified by the Board of Psychiatry.\nThe executive medical director shall:\n(1) oversee the clinical provision of inpatient mental health services provided in the state's regional treatment centers;\n(2) recruit and retain psychiatrists to serve on the Direct Care and Treatment medical staff established in subdivision 4;\n(3) consult with the executive board, the chief executive officer, and community mental health center directors to develop standards for treatment and care of patients in state-operated service programs;\n(4) develop and oversee a continuing education program for members of the medical staff; and\n(5) participate and cooperate in the development and maintenance of a quality assurance program for state-operated services that assures that residents receive continuous quality inpatient, outpatient, and postdischarge care.\n(a) The executive medical director shall establish a Direct Care and Treatment medical staff which shall be under the clinical direction of the Office of Executive Medical Director.\n(b) The executive medical director, in conjunction with the medical staff, shall:\n(1) establish standards and define qualifications for physicians who care for residents in state-operated services;\n(2) monitor the performance of physicians who care for residents in state-operated services; and\n(3) recommend to the executive board changes in procedures for operating state-operated service facilities that are needed to improve the provision of medical care in those facilities.",
	"repealed": false
}