{
	"id": "398.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/398.34",
	"title": "398.34 ORDINANCES.",
	"text": "The county board of any county may enact ordinances relating to the county park system or to any county park or other unit subject to the provisions of sections 398.31 to 398.36 as hereinafter provided. Before acting on any such ordinance the county board shall hold a public hearing upon the proposal therefor upon at least three weeks' notice given by the county auditor by publication in the official newspaper of the county, stating briefly the subject matter and the general purpose of the proposed ordinance. The proposed ordinance may be amended by the county board before enactment in any manner not inconsistent with the terms of the notice of hearing thereon. Every such ordinance, upon enactment, shall be signed by the chair of the county board, attested by the county auditor, filed by the auditor, and published in the official proceedings of the board. Thereupon the ordinance shall take effect, subject to the further provisions of this section in the case of an ordinance affecting public waters. Every ordinance shall be recorded by the county auditor in an ordinance book with a notation of the date of publication. Such record or a certified copy thereof shall be prima facie evidence of the contents of the ordinance and of compliance with all requirements of law relating to the enactment and taking effect thereof.\nBy ordinance adopted as hereinbefore provided the county board may prescribe regulations, not inconsistent with law, for the protection and use of any county park or parks or other units subject to the provisions of sections 398.31 to 398.36, including any waters lying within the boundaries of such a park or unit, and, in the case of waters extending beyond such boundaries, including also any part of such waters lying within 300 feet of that part of the shore thereof lying within such boundaries; provided, that no provision of any such ordinance affecting public waters shall be valid except with the approval of the commissioner of natural resources. In case any provision of a proposed ordinance affects any public waters, notice of the hearing thereon with a copy of such provision shall be mailed by the county auditor to the commissioner of natural resources at least three weeks before the date of the hearing. Unless written approval of such provision by the commissioner of natural resources is filed with the county auditor at or before the hearing, it shall be stricken from the proposed ordinance, and, if incorporated therein, shall have no force or effect; provided, that the invalidity of such a provision shall not affect the validity of any other provision of an ordinance.\nEvery ordinance relating to any matter specified in subdivision 2 shall have the force and effect of law, and a violation of any provision thereof shall be a misdemeanor. The provisions of such ordinances shall not supersede any applicable provision of an ordinance of any city, but shall be supplementary thereto. All fines collected for violations of ordinances enacted hereunder shall be deposited in the county park fund.",
	"repealed": false
}