{
	"id": "340A.601",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.601",
	"title": "340A.601 ESTABLISHMENT OF MUNICIPAL LIQUOR STORES.",
	"text": "A city having a population of not more than 10,000 may establish, own, and operate a municipal liquor store which may sell at retail alcoholic beverages and (1) in the case of a municipal liquor store that sells at off-sale only, all items that may lawfully be sold in an exclusive liquor store under section 340A.412, subdivision 14, or (2) in the case of a municipal liquor store that sells at on-sale only, or at on- and off-sale, any item that may lawfully be sold in an establishment with an on-sale intoxicating liquor license. A municipal liquor store may also offer recorded or live entertainment and make available coin-operated amusement devices.\nA city which has established a municipal liquor store may continue to operate it notwithstanding a subsequent change in population.\nA city which established a liquor store prior to July 1, 1967, may continue to own and operate it.\nA city may not establish or operate a municipal liquor store or issue an on-sale or off-sale liquor license until two years after its incorporation. This restriction does not apply to a newly incorporated statutory city which had formerly been a town or is made up of a major geographic portion of what had formerly been a town, which town had the powers of a statutory city under section 368.01.\nA city owning and operating a municipal liquor store may issue on-sale liquor licenses to hotels, clubs, and restaurants. A city issuing on-sale licenses under this subdivision may continue to operate the municipal liquor store or may resume operation of a municipal liquor store previously discontinued.\nThe number of on-sale licenses issued under this section by a city is governed by section 340A.413.\nA city may not issue licenses under this section, other than a license issued to a club under section 340A.404, subdivision 1, clause (4), until authorized by the voters of the city voting on the question at a special election called for that purpose.\nA city which did not permit the sale of intoxicating liquor within its boundaries as of June 30, 1969, or was incorporated after that date may issue on-sale licenses for the sale of intoxicating liquor in accordance with subdivision 5.\nA city which has issued retail intoxicating liquor licenses may not establish a municipal liquor store until one year after publishing a notice of its intention in the city's legal newspaper. The city must provide in the notice if the municipality will be engaging in the sale of intoxicating liquor to the exclusion of all private interests.",
	"repealed": false
}