{
	"id": "103B.245",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.245",
	"title": "103B.245 SPECIAL TAX DISTRICT; LOCAL GOVERNMENT UNIT.",
	"text": "(a) Any local government unit planning for water management under sections 103B.231 and 103B.235 may establish a watershed management tax district in the territory within the watershed, for the purpose of paying the costs of the planning required under sections 103B.231 and 103B.235.\n(b) Any local government unit which has part of its territory within a watershed for which a plan has been adopted in accordance with section 103B.231 and which has a local water management plan adopted in accordance with section 103B.235 may establish a watershed management tax district in the territory within the watershed or a subwatershed unit in the watershed, for the purpose of paying capital costs of the water management facilities described in the capital improvement program of the plans and for the purpose of paying for normal and routine maintenance of the facilities.\n(c) A county or counties required by section 103B.231, subdivision 3, to prepare, adopt, and implement a watershed plan shall apportion the costs of planning, capital improvements, and maintenance proportionate to benefits. The county may apportion the costs among the subwatershed units in the watershed, or among the statutory and home rule charter cities and towns having territory in the watershed, and for this purpose may establish more than one watershed management tax district in the watershed.\n(d) Notification of new watershed management tax districts established under this subdivision must be made to the county auditor by July 1 in order to be effective for taxes payable in the following year.\nThe district shall be established by ordinance adopted after a hearing. Notice of the time, place, and purpose of the hearing shall be published for two successive weeks in the official newspaper of the local government unit, ending at least seven days before the day of the hearing. The ordinance shall describe with particularity the territory or area to be included in the district. After adoption, the ordinance shall be filed with the county auditor and county recorder. The district may be dissolved by following the procedures prescribed for the establishment of the district.\nAfter adoption of the ordinance under subdivision 2, a local government unit may annually levy a tax on all taxable property in the district for the purposes for which the tax district is established. The tax may not exceed 0.02418 percent of estimated market value on taxable property located in rural towns other than urban towns, unless allowed by resolution of the town electors. The proceeds of the tax shall be paid into a fund reserved for these purposes. Any proceeds remaining in the reserve fund at the time the tax is terminated or the district is dissolved shall be transferred and irrevocably pledged to the debt service fund of the local unit to be used solely to reduce tax levies for bonded indebtedness of taxable property in the district.\nAfter adoption of the ordinance under subdivision 2, and after a contract for the construction of all or part of an improvement has been entered into or the work has been ordered done by day labor, the local government unit may issue obligations in the amount it deems necessary to pay in whole or in part the capital cost incurred and estimated to be incurred in making the project. The obligations shall be payable out of the proceeds of the tax levied pursuant to subdivision 3. The local unit may by resolution of its governing body adopted prior to the sale of obligations pledge the full faith, credit and taxing power of the local unit to assure payment of the principal and interest in the event the proceeds of the tax levy in the district are insufficient to pay principal and interest. The amount of any taxes which are required to be levied outside of the territory of the tax district or taken from the general funds of the local unit to pay principal and interest on the obligations shall be reimbursed to the local unit from taxes levied within the territory of the tax district. Obligations shall be issued in accordance with chapter 475, except that an election is not required and the amount of any obligations shall not be included in determining the net indebtedness of the local unit under the provisions of any law or charter limiting indebtedness.",
	"repealed": false
}