{
	"id": "245.4889",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4889",
	"title": "245.4889 CHILDREN'S MENTAL HEALTH GRANTS.",
	"text": "(a) The commissioner is authorized to make grants from available appropriations to assist:\n(1) counties;\n(2) Indian tribes;\n(3) children's collaboratives under section 142D.15 or 245.493; or\n(4) mental health service providers.\n(b) The following services are eligible for grants under this section:\n(1) services to children with emotional disturbances as defined in section 245.4871, subdivision 15, and their families;\n(2) transition services under section 245.4875, subdivision 8, for young adults under age 21 and their families;\n(3) respite care services for children with emotional disturbances or severe emotional disturbances who are at risk of residential treatment or hospitalization, who are already in out-of-home placement in family foster settings as defined in chapter 142B and at risk of change in out-of-home placement or placement in a residential facility or other higher level of care, who have utilized crisis services or emergency room services, or who have experienced a loss of in-home staffing support. Allowable activities and expenses for respite care services are defined under subdivision 4. A child is not required to have case management services to receive respite care services. Counties must work to provide access to regularly scheduled respite care;\n(4) children's mental health crisis services;\n(5) child-, youth-, and family-specific mobile response and stabilization services models;\n(6) mental health services for people from cultural and ethnic minorities, including supervision of clinical trainees who are Black, indigenous, or people of color;\n(7) children's mental health screening and follow-up diagnostic assessment and treatment;\n(8) services to promote and develop the capacity of providers to use evidence-based practices in providing children's mental health services;\n(9) school-linked mental health services under section 245.4901;\n(10) building evidence-based mental health intervention capacity for children birth to age five;\n(11) suicide prevention and counseling services that use text messaging statewide;\n(12) mental health first aid training;\n(13) training for parents, collaborative partners, and mental health providers on the impact of adverse childhood experiences and trauma and development of an interactive website to share information and strategies to promote resilience and prevent trauma;\n(14) transition age services to develop or expand mental health treatment and supports for adolescents and young adults 26 years of age or younger;\n(15) early childhood mental health consultation;\n(16) evidence-based interventions for youth at risk of developing or experiencing a first episode of psychosis, and a public awareness campaign on the signs and symptoms of psychosis;\n(17) psychiatric consultation for primary care practitioners; and\n(18) providers to begin operations and meet program requirements when establishing a new children's mental health program. These may be start-up grants.\n(c) Services under paragraph (b) must be designed to help each child to function and remain with the child's family in the community and delivered consistent with the child's treatment plan. Transition services to eligible young adults under this paragraph must be designed to foster independent living in the community.\n(d) As a condition of receiving grant funds, a grantee shall obtain all available third-party reimbursement sources, if applicable.\n(e) The commissioner may establish and design a pilot program to expand the mobile response and stabilization services model for children, youth, and families. The commissioner may use grant funding to consult with a qualified expert entity to assist in the formulation of measurable outcomes and explore and position the state to submit a Medicaid state plan amendment to scale the model statewide.\nTo apply for a grant, an applicant organization shall submit an application and budget for the use of the money in the form specified by the commissioner. The commissioner shall make grants only to entities whose applications and budgets are approved by the commissioner. In awarding grants, the commissioner shall give priority to applications that indicate plans to collaborate in the development, funding, and delivery of services with other agencies in the local system of care. The commissioner shall specify requirements for reports, including quarterly fiscal reports under section 256.01, subdivision 2, paragraph (o). The commissioner shall require collection of data and periodic reports that the commissioner deems necessary to demonstrate the effectiveness of each service.\n(a) By November 1, 2016, and biennially thereafter, the commissioner of human services shall provide sufficient information to the members of the legislative committees having jurisdiction over mental health funding and policy issues to evaluate the use of funds appropriated under this section. The commissioner shall provide, at a minimum, the following information:\n(1) the amount of funding for children's mental health grants, what programs and services were funded in the previous two years, and outcome data for the programs and services that were funded; and\n(2) the amount of funding for other targeted services and the location of services.\n(b) This subdivision expires January 1, 2032.\nRespite care services under subdivision 1, paragraph (b), clause (3), include hourly or overnight stays at a licensed foster home or with a qualified and approved family member or friend and may occur at a child's or provider's home. Respite care services may also include the following activities and expenses:\n(1) recreational, sport, and nonsport extracurricular activities and programs for the child including camps, clubs, lessons, group outings, sports, or other activities and programs;\n(2) family activities, camps, and retreats that the family does together and provide a break from the family's circumstance;\n(3) cultural programs and activities for the child and family designed to address the unique needs of individuals who share a common language, racial, ethnic, or social background; and\n(4) costs of transportation, food, supplies, and equipment directly associated with approved respite care services and expenses necessary for the child and family to access and participate in respite care services.",
	"repealed": false
}