{
	"id": "116U.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/116U.25",
	"title": "116U.25 EXPLORE MINNESOTA TOURISM COUNCIL.",
	"text": "(a) The director shall be advised by the Explore Minnesota Tourism Council consisting of up to 35 voting members appointed by the governor for four-year terms, including:\n(1) the director of Explore Minnesota Tourism who serves as the chair;\n(2) fourteen representatives of statewide associations representing bed and breakfast establishments, golf, festivals and events, counties, convention and visitor bureaus, lodging, resorts, trails, campgrounds, restaurants, craft beverage establishments, chambers of commerce, chambers of commerce for underrepresented communities, and Tribal nations;\n(3) one representative from each of the tourism marketing regions of the state as designated by the office;\n(4) ten representatives of the tourism business representing transportation, retail, travel agencies, tour operators, travel media, convention facilities, arts and culture, sports, outdoor recreation, and tourism business owners from underrepresented communities;\n(5) one or more ex officio nonvoting members including at least one from the University of Minnesota Tourism Center;\n(6) four legislators, two from each house, one each from the two largest political party caucuses in each house, appointed according to the rules of the respective houses; and\n(7) other persons, if any, as designated from time to time by the governor.\n(b) The council shall act to serve the broader interests of tourism in Minnesota by promoting activities that support, maintain, and expand the state's domestic and international travel market, thereby generating increased visitor expenditures, tax revenue, and employment.\n(c) Filling of membership vacancies is as provided in section 15.059. The terms of one-half of the members shall be coterminous with the governor and the terms of the remaining one-half of the members shall end on the first Monday in January one year after the terms of the other members. Members may serve until their successors are appointed and qualify. Members are not compensated. A member may be reappointed.\n(d) The council shall meet at least four times per year and at other times determined by the council.\n(e) If compliance with section 13D.02 is impractical, the Explore Minnesota Tourism Council may conduct a meeting of its members by telephone or other electronic means so long as the following conditions are met:\n(1) all members of the council participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the council can hear clearly all discussion and testimony and all votes of members of the council and, if needed, receive those services required by sections 15.44 and 15.441;\n(3) at least one member of the council is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\n(f) Each member of the council participating in a meeting by telephone or other electronic means is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\n(g) If telephone or other electronic means is used to conduct a meeting, the council, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location. The council may require the person making such a connection to pay for documented marginal costs that the council incurs as a result of the additional connection.\n(h) If telephone or other electronic means is used to conduct a regular, special, or emergency meeting, the council shall provide notice of the regular meeting location, of the fact that some members may participate by telephone or other electronic means, and of the provisions of paragraph (g). The timing and method of providing notice is governed by section 13D.04.",
	"repealed": false
}