{
	"id": "144.1493",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1493",
	"title": "144.1493 NURSING GRANT PROGRAM.",
	"text": "A nursing grant program is established under the supervision of the commissioner of health and the administration of the Metropolitan Healthcare Foundation's Project LINC to provide grants to Minnesota health care facility employees seeking to complete a baccalaureate or master's degree in nursing.\nThe Metropolitan Healthcare Foundation's Project LINC shall administer the grant program and award grants to eligible health care facility employees. To be eligible to receive a grant, a person must be:\n(1) an employee of a health care facility located in Minnesota, whom the facility has recommended to the Metropolitan Healthcare Foundation's Project LINC for consideration;\n(2) working part time, up to 32 hours per pay period, for the health care facility, while maintaining full salary and benefits;\n(3) enrolled full time in a Minnesota school or college of nursing to complete a baccalaureate or master's degree in nursing; and\n(4) a resident of the state of Minnesota.\nThe grant must be awarded for one academic year but is renewable for a maximum of six semesters or nine quarters of full-time study, or their equivalent. The grant must be used for tuition, fees, and books. Priority in awarding grants shall be given to persons with the greatest financial need. The health care facility may require its employee to commit to a reasonable postprogram completion of employment at the health care facility as a condition for the financial support the facility provides.\nThe commissioner shall distribute money each year to the Metropolitan Healthcare Foundation's Project LINC to be used to award grants under this section, provided that the commissioner shall not distribute the money unless the Metropolitan Healthcare Foundation's Project LINC matches the money with an equal amount from nonstate sources. The Metropolitan Healthcare Foundation's Project LINC shall expend nonstate money prior to expending state money and shall return to the commissioner all state money not used each year for nursing program grants to be redistributed under this section. The Metropolitan Healthcare Foundation's Project LINC shall report to the commissioner on its program activity as requested by the commissioner.",
	"repealed": false
}