{
	"id": "142A.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.30",
	"title": "142A.30 CHILD SUPPORT OBLIGOR COMMUNITY SERVICE WORK EXPERIENCE PROGRAM.",
	"text": "The commissioner of children, youth, and families may contract with a county that operates a community work experience program or a judicial district Department of Corrections that operates a community work experience program to include child support obligors who are physically able to work and fail to pay child support as participants in the community work experience program.\n(a) Except as provided in paragraph (f), a person ordered to participate in a work program under section 518A.72 shall do so if services are available.\n(b) A person may not be required to participate for more than 32 hours per week in the program under this section.\n(c) A person may not be required to participate for more than six weeks for each finding of contempt.\n(d) If a person is required by a governmental entity to participate in another work or training program, the person may not be required to participate in a program under this section in a week for more than 32 hours minus the number of hours the person is required to participate in the other work or training program in that week.\n(e) If a person is employed, the person may not be required to participate in a program under this section in a week for more than 80 percent of the difference between 40 hours and the number of hours actually worked in the unsubsidized job during that week, to a maximum of 32 hours.\n(f) A person who works an average of 32 hours or more per week in an unsubsidized job is not required to participate in a program under this section.\nIf a person does not complete six weeks of participation in a program under this section, the county operating the program shall inform the court administrator, by affidavit, of that noncompletion.\n(a) This subdivision applies to payment of any claims resulting from an alleged injury or death of a child support obligor participating in a community work experience program established and operated by a county or a judicial district department of corrections under this section.\n(b) Claims that are subject to this section must be investigated by the county agency responsible for supervising the work to determine whether the claimed injury occurred, whether the claimed medical expenses are reasonable, and whether the loss is covered by the claimant's insurance. If insurance coverage is established, the county agency shall submit the claim to the appropriate insurance entity for payment. The investigating county agency shall submit all valid claims, in the amount net of any insurance payments, to the commissioner of children, youth, and families.\n(c) The commissioner of children, youth, and families shall submit all claims for impairment compensation to the commissioner of labor and industry. The commissioner of labor and industry shall review all submitted claims and recommend to the commissioner of children, youth, and families an amount of compensation comparable to what would be provided under the impairment compensation schedule of section 176.101, subdivision 2a.\n(d) The commissioner of children, youth, and families shall approve a claim of $1,000 or less for payment if appropriated funds are available, if the county agency responsible for supervising the work has made the determinations required by this section, and if the work program was operated in compliance with the safety provisions of this section. The commissioner shall pay the portion of an approved claim of $1,000 or less that is not covered by the claimant's insurance within three months of the date of submission. On or before February 1 of each year, the commissioner shall submit to the appropriate committees of the senate and the house of representatives a list of claims of $1,000 or less paid during the preceding calendar year and shall be reimbursed by legislative appropriation for any claims that exceed the original appropriation provided to the commissioner to operate this program. Unspent money from this appropriation carries over to the second year of the biennium, and any unspent money remaining at the end of the second year must be returned to the general fund. On or before February 1 of each year, the commissioner shall submit to the appropriate committees of the senate and the house of representatives a list of claims in excess of $1,000 and a list of claims of $1,000 or less that were submitted to but not paid by the commissioner of children, youth, and families, together with any recommendations of appropriate compensation. These claims shall be heard and determined by the appropriate committees of the senate and house of representatives and, if approved, paid under the legislative claims procedure.\n(e) Compensation paid under this section is limited to reimbursement for reasonable medical expenses and impairment compensation for disability in like amounts as allowed in section 176.101, subdivision 2a. Compensation for injuries resulting in death shall include reasonable medical expenses and burial expenses in addition to payment to the participant's estate in an amount not to exceed the limits set forth in section 466.04. Compensation may not be paid under this section for pain and suffering, lost wages, or other benefits provided in chapter 176. Payments made under this section must be reduced by any proceeds received by the claimant from any insurance policy covering the loss. For the purposes of this section, \"insurance policy\" does not include the medical assistance program authorized under chapter 256B.\n(f) The procedure established by this section is exclusive of all other legal, equitable, and statutory remedies against the state, its political subdivisions, or employees of the state or its political subdivisions. The claimant may not seek damages from any state or county insurance policy or self-insurance program.\n(g) A claim is not valid for purposes of this subdivision if the local agency responsible for supervising the work cannot verify to the commissioner of children, youth, and families:\n(1) that appropriate safety training and information is provided to all persons being supervised by the agency under this subdivision; and\n(2) that all programs involving work by those persons comply with federal Occupational Safety and Health Administration and state Department of Labor and Industry safety standards.\nA claim that is not valid because of failure to verify safety training or compliance with safety standards may not be paid by the commissioner of children, youth, and families or through the legislative claims process and must be heard, decided, and paid, if appropriate, by the local government unit responsible for supervising the work of the claimant.\nA county shall reimburse a person for reasonable transportation costs incurred because of participation in a program under this section, up to a maximum of $25 per month.\nThe commissioner shall pay a county $200 for each person who participates in the program under this section in that county. The county is responsible for any additional costs of the program.",
	"repealed": false
}