{
	"id": "270C.395",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.395",
	"title": "270C.395 TIMELY MAILING TREATED AS TIMELY FILING AND PAYING.",
	"text": "When a document, including a return, claim, or statement, is required to be filed, or a payment is required to be made to the commissioner within a prescribed period, or on or before a prescribed date, and if the document or payment is delivered by electronic means or by United States mail after the period or the date to the place prescribed for filing or payment, then the date of delivery or of payment is the date of the confirmation time-and-date stamp of the transaction, if delivered by electronic means, or the date of the United States postmark stamped on the cover in which the document or payment is mailed, if delivered by United States mail, as the case may be.\nSubdivision 1 applies only if:\n(1) the postmark date falls within the prescribed period or on or before the prescribed date,\n(i) for filing (including any extension granted for the filing) of the document, or\n(ii) for making the payment (including any extension granted for making the payment); and\n(2) the document or payment was within the time prescribed in clause (1), deposited in the mail in the United States in an envelope or other appropriate wrapper, postage prepaid, properly addressed to the office of the Department of Revenue with which the document is required to be filed or to which payment is required to be made.\nThe confirmation numbers and confirmation time-and-date stamps received by the taxpayer following electronic payment or filing are proof of the payment authorization and filing dates. Only the postmark of the United States Postal Service, rather than those of private postage meters, qualifies as proof of timely mailing under this section. If the document or payment is sent by United States registered mail, the date of registration shall be treated as the postmark date. If the document or payment is sent by United States certified mail and the sender's receipt is postmarked by the postal employee to whom the envelope containing such document or payment is presented, the date of the United States postmark on the receipt shall be treated as the postmark date of the document or payment.\nIn any case in which the document or payment is not treated as timely filed or paid under this section, the date of receipt by the commissioner, and not the postmark date, shall govern for purposes of determining the amount of any penalties for late filing or payment.\nA reference in this section to the United States mail shall be treated as including a reference to any designated delivery service, and any reference in this section to a postmark by the United States Postal Service shall be treated as including a reference to any date recorded or marked by any designated delivery service in accordance with section 7502(f) of the Internal Revenue Code.",
	"repealed": false
}