{
	"id": "43A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.02",
	"title": "43A.02 DEFINITIONS.",
	"text": "Unless the language or context indicates that a different meaning is intended, the following terms, for the purposes of this chapter, have the meanings given them in this section.\n\"Accommodation fund\" means the fund created under section 16B.4805 for reimbursing state agencies for eligible expenses incurred in providing reasonable accommodations to state employees with disabilities.\n\"Agency\" means a department, commission, board, institution, or other employing entity of the civil service, in which all positions are under the same appointing authority.\n\"Allocation\" means the assignment of an individual position to an appropriate class on the basis of the kind, difficulty, or responsibility of the work performed in the position.\n\"Americans With Disabilities Act\" or \"ADA\" means the Americans with Disabilities Act of 1990, as amended, United States Code, title 42, sections 12101 to 12117.\n\"Applicant\" means a person who has satisfied the minimum requirements for application established by the commissioner.\n\"Applicant pool\" means those applicants who satisfy any limits on consideration for the position under section 43A.10, subdivision 6a, and who have been determined to meet the minimum qualifications for a vacant position.\n\"Appointing authority\" means a person or group of persons empowered by the constitution, statute, or executive order to employ persons in or to make appointments to positions in the civil service.\n\"Appointment\" means the act of filling a vacancy by placement of a person in a civil service position through selection from a finalist pool or a noncompetitive or qualifying process including transfer, demotion or reinstatement.\n\"Balanced class\" means any class in which no more than 80 percent of the incumbents are male and no more than 70 percent of the incumbents are female.\n[Repealed, 2004 c 207 s 31]\n[Repealed, 2004 c 207 s 31]\n\"Change in allocation\" means reclassification resulting from abrupt, management-imposed changes in the duties and responsibilities of a position.\n\"Civil service\" means all employees in the legislative, judicial and executive branches of state government and all positions in the classified and unclassified services as provided in sections 43A.07 and 43A.08.\n\"Class\" means one or more positions sufficiently similar with respect to duties and responsibilities that the same descriptive title may be used with clarity to designate each position allocated to the class and the same schedule of pay can be applied with equity to all positions in the class under the same or substantially the same employment conditions.\n\"Classified service\" means all positions now existing or hereafter created in the civil service and not specifically designated unclassified pursuant to section 43A.08.\n\"Commissioner\" means the commissioner of management and budget.\n\"Commissioner's plan\" means the plan required by section 3.855 regarding total compensation and terms and conditions of employment, including grievance administration, for employees of the executive branch who are not otherwise provided for in this chapter or other law.\n\"Comparability of the value of the work\" means the value of the work measured by the composite of the skill, effort, responsibility, and working conditions normally required in the performance of the work.\n[Repealed, 2004 c 207 s 31]\n[Repealed, 2004 c 207 s 31]\n\"Declassified position\" means a position which is removed from the classified service and placed in the unclassified service.\n\"Department\" means the Department of Management and Budget.\n\"Digital accessibility\" means information and communication technology, including products, devices, services, and content that are designed and built so people with disabilities can use or participate in them, as defined by the accessibility standard adopted under section 16E.03, subdivision 9. Any statutory reference to accessible or accessibility in the context of information and communication technology includes digital accessibility.\n[Repealed, 2004 c 207 s 31]\n[Repealed, 2004 c 207 s 31]\n\"Employee\" means any person currently occupying, or on leave from, a civil service position.\n\"Executive branch\" means heads of all agencies of state government, elective or appointive, established by statute or constitution and all employees of those agency heads who have within their particular field of responsibility statewide jurisdiction and who are not within the legislative or judicial branches of government. The executive branch also includes employees of the Department of Iron Range Resources and Rehabilitation. The executive branch does not include agencies with jurisdiction in specifically defined geographical areas, such as regions, counties, cities, towns, municipalities, or school districts, the University of Minnesota, the Public Employees Retirement Association, the Minnesota State Retirement System, the Teachers Retirement Association, the Minnesota Historical Society, and all of their employees, and any other entity which is incorporated, even though it receives state funds.\n\"Female-dominated class\" means any class in which more than 70 percent of the incumbents are female.\n\"Finalist pool\" means those members of the applicant pool who have been determined to best meet all the qualifications for a vacant position and who may be legally appointed to the position.\n\"Goal unit\" means, for the purposes of affirmative action, the group of jobs in an agency or agency subdivision assigned to one of the federal Equal Employment Opportunity (EEO) occupation categories applicable to state employment.\n\"Intermittent employee\" means an employee who works an irregular and uncertain schedule which alternately begins, ceases and begins again as the needs of the agency require.\n\"Intern\" means an individual who, for a work experience, is receiving academic credit from or is fulfilling an academic requirement of, an accredited educational institution.\n\"Judicial branch\" means all judges of the appellate courts, all employees of the appellate courts, including commissions, boards, and committees established by the supreme court, the Board of Law Examiners, the law library, the Office of the State Public Defender, district public defenders and their employees, all judges of all courts of law, district court referees, judicial officers, court reporters, law clerks, district administration employees under section 484.68, court administrator or employee of the court in a judicial district under section 480.181, subdivision 1, paragraph (b), guardian ad litem program employees, and other agencies placed in the judicial branch by law. Judicial branch does not include district administration or public defenders or their employees in the Second and Fourth Judicial Districts, court administrators not under section 480.181, subdivision 1, paragraph (b), or their staff under chapter 485, or other employees within the court system whose salaries are paid by the county, other than employees who remain on the county payroll under section 480.181, subdivision 2.\n\"Layoff list\" means a list of former permanent or probationary employees of a job class who are eligible to be recalled to that class under the provisions of a collective bargaining agreement or plan established under section 43A.18.\n\"Legislative branch\" means all legislators and all employees of the legislature, legislative committees or commissions.\n\"Male-dominated class\" means any class in which more than 80 percent of the incumbents are male.\n\"Managerial\" means those positions designated pursuant to section 43A.18, subdivision 3 as being accountable for determining, securing, and allocating human, financial, and other resources needed to accomplish objectives. Positions in this category also are accountable for determining overall objectives, priorities, and policies within a program area. Higher level positions in this category handle significant and involved relationships with governmental leadership. Incumbents of these positions have the authority to exercise discretionary powers on a regular basis.\nFor purposes of chapter 15A the term \"officer\" may be used interchangeably with the term \"employee\" within the executive branch.\n\"Permanent status\" means the state or condition achieved by an employee in the classified service who has successfully completed an initial probationary period or a probationary period required following reinstatement or reemployment, or whose probationary period is waived through specific statutory direction.\n\"Position\" means a group of duties and responsibilities assigned or delegated by competent authority, requiring the full-time or less than full-time employment of one person.\n\"Probationary period,\" part of the selection process, means a working period following unlimited appointment to a position in the classified service, during which the employee is required to demonstrate ability to perform the duties and fulfill the responsibilities of the position.\nFor affirmative action purposes, \"protected groups\" means females, persons with disabilities, and members of the following minorities: Black, Hispanic, Asian or Pacific Islander, and American Indian or Alaskan native.\n\"Qualifying appointment\" means the selection, from other than a finalist pool, of an applicant who has demonstrated through a selection process that the applicant meets minimum job-related requirements.\n\"Reallocation\" means reclassification resulting from significant changes over a period of time in the duties and responsibilities of a position.\n\"Reasonable accommodation\" has the meaning given under section 363A.08, subdivision 6.\n\"Reclassification\" means changing the allocation of a position to a higher, lower or equivalent class.\n[Repealed, 2004 c 207 s 31]\n\"Total compensation\" means salaries, cash payments and employee benefits including paid time off, group insurance benefits, and other direct and indirect items of compensation with the exception of retirement plans.\n\"Unclassified service\" means all positions designated not being classified pursuant to section 43A.08.\n\"Unlimited appointment\" means an appointment for which there is no specified maximum duration.",
	"repealed": false
}