{
	"id": "383E.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/383E.07",
	"title": "383E.07 PERSONNEL BOARD OF APPEALS.",
	"text": "Anoka County may establish a personnel board of appeals to review disciplinary appeals as provided in this section.\nThe county personnel board of appeals has three members appointed by the county board. Each member of the county personnel board of appeals must be a resident of the county. A member of the county personnel board of appeals must not be an Anoka County employee, hold any elected or appointed Anoka County office, or be a candidate for any Anoka County office.\nMembers of the first personnel board of appeals serve for terms beginning on a date set by resolution of the county board as follows: one must be appointed for a one-year term, one for a two-year term, and one for a three-year term. Thereafter, each member serves a three-year term, except that upon expiration of a member's term that member continues to serve until the county board has appointed a successor.\nThe county board may remove a member of the personnel board of appeals for cause. In addition to the provisions of section 351.02, a position on the personnel board of appeals becomes vacant when a member files as a candidate for any Anoka County office, accepts employment with Anoka County, or takes any elected or appointed Anoka County office.\nThe county board must appoint, as soon as practicable, a person to complete the unexpired term of any member who is removed from or vacates the member's position before expiration of that member's term.\nThe county board must provide by resolution for compensation of members of the personnel board of appeals. The county must reimburse members of the personnel board of appeals for actual and necessary expenses.\nThe county personnel board of appeals must hear all appeals relating to discharge, suspension without pay, demotion for cause, salary decrease, and other related disciplinary actions.\nExcept as otherwise provided in this subdivision, the personnel board of appeals must hear an appeal of a disciplinary action within 30 working days of receiving the appeal. The hearing may be held at a later date if the personnel board of appeals, the appointing authority, and the employee agree. The personnel board of appeals may accept, reject, or modify the disciplinary action, and then must report its decision to the county human resources director. The human resources director must serve a copy of the decision on the employee and the appointing authority. Service may be by personal service or by mail to the last known address of each party. Service by mail is complete upon mailing. The decision of the personnel board of appeals is final and is effective on the date of service.\nThe appointing authority or the employee may appeal the decision by filing a petition for writ of certiorari with the court of appeals within 30 days after service of the decision on the parties. The court of appeals must decide the appeal on the personnel board of appeals' record of the matter. The court of appeals may reverse the personnel board of appeals' decision if the court finds no evidence upon which the personnel board of appeals could have reached its decision or if the personnel board of appeals abused its discretion.\nAnoka County, not the personnel board of appeals, is the proper party to an appeal or any other litigation arising out of this section. The personnel board of appeals cannot sue or be sued. The Anoka County attorney must represent the county in any litigation arising under this section.\nProcedures for discipline and discharge of employees covered by collective bargaining agreements are governed by the agreements to the extent the agreements are inconsistent with this section. An employee cannot use both the procedure provided by this section and the grievance procedure provided in chapter 179A.",
	"repealed": false
}