{
	"id": "240.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.27",
	"title": "240.27 EXCLUSION OF CERTAIN PERSONS.",
	"text": "The commission may exclude from any and all licensed racetracks in the state a person who:\n(1) has been convicted of a felony under the laws of any state or the United States;\n(2) has had a license suspended, revoked, or denied by the commission or by the racing authority of any other jurisdiction; or\n(3) is determined by the commission, on the basis of evidence presented to it, to be a threat to the public safety or the integrity of racing or card playing in Minnesota.\nAn order to exclude an unlicensed person from any or all licensed racetracks in the state must be made by the commission following a public hearing of which the person to be excluded must have had at least five days' notice. If present at the hearing, the person must be permitted to show cause why the exclusion should not be ordered. An appeal of the order may be made in the same manner as other appeals under section 240.20.\nUpon issuing an order excluding a person from any or all licensed racetracks, the commission shall send a copy of the order to the excluded person and to all racetracks or teleracing facilities named in it, along with other information as it deems necessary to permit compliance with the order.\nIt is a gross misdemeanor for a person named in an exclusion order to enter, attempt to enter, or be on the premises of a racetrack named in the order while it is in effect, and for a person licensed to conduct racing or operate a racetrack knowingly to permit an excluded person to enter or be on the premises.\nA licensed racetrack may eject and exclude from its premises any person for any lawful reason. If a licensed racetrack excludes a person for a suspected or potential violation of law or rule, or if a licensed racetrack excludes any person for more than five days, the licensed racetrack shall provide the person's name and reason for the exclusion to the commission within 72 hours.",
	"repealed": false
}