{
	"id": "256B.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.501",
	"title": "256B.501 RATES FOR COMMUNITY-BASED SERVICES FOR PERSONS WITH DISABILITIES.",
	"text": "For the purposes of this section, the following terms have the meanings given them.\n(a) \"Commissioner\" means the commissioner of human services.\n(b) \"Facility\" means a facility licensed as a developmental disability residential facility under section 252.28, licensed as a supervised living facility under chapter 144, and certified as an intermediate care facility for persons with developmental disabilities. The term does not include a state regional treatment center.\n(c) \"Habilitation services\" means health and social services directed toward increasing and maintaining the physical, intellectual, emotional, and social functioning of persons with developmental disabilities. Habilitation services include therapeutic activities, assistance, training, supervision, and monitoring in the areas of self-care, sensory and motor development, interpersonal skills, communication, socialization, reduction or elimination of maladaptive behavior, community living and mobility, health care, leisure and recreation, money management, and household chores.\n(d) \"Services during the day\" means services or supports provided to a person that enables the person to be fully integrated into the community. Services during the day must include habilitation services, and may include a variety of supports to enable the person to exercise choices for community integration and inclusion activities. Services during the day may include, but are not limited to: supported work, support during community activities, community volunteer opportunities, adult day care, recreational activities, and other individualized integrated supports.\n(e) \"Waivered service\" means home or community-based service authorized under United States Code, title 42, section 1396n(c), as amended through December 31, 1987, and defined in the Minnesota state plan for the provision of medical assistance services. Waivered services include, at a minimum, case management, family training and support, developmental training homes, supervised living arrangements, semi-independent living services, respite care, and training and habilitation services.\nThe commissioner shall establish procedures and rules for determining rates for care of residents of intermediate care facilities for persons with developmental disabilities which qualify as providers of medical assistance and waivered services. The procedures shall specify the costs that are allowable for payment through medical assistance. The commissioner may use experts from outside the department in the establishment of the procedures.\nThe commissioner shall establish, by rule, procedures for determining rates for care of residents of intermediate care facilities for persons with developmental disabilities. In developing the procedures, the commissioner shall include:\n(1) cost containment measures that assure efficient and prudent management of capital assets and operating cost increases which do not exceed increases in other sections of the economy;\n(2) limits on the amounts of reimbursement for property and new facilities;\n(3) requirements to ensure that the accounting practices of the facilities conform to generally accepted accounting principles;\n(4) incentives to reward accumulation of equity;\n(5) rule revisions which:\n(i) combine the program, maintenance, and administrative operating cost categories, and professional liability and real estate insurance expenses into one general operating cost category;\n(ii) eliminate the maintenance and administrative operating cost category limits and account for disallowances under the rule existing on July 1, 1995, in the revised rule. If this provision is later invalidated, the total administrative cost disallowance shall be deducted from economical facility payments in item (iii);\n(iii) establish an economical facility incentive that rewards facilities that provide all appropriate services in a cost-effective manner and penalizes reductions of either direct service wages or standardized hours of care per resident;\n(iv) establish a best practices award system that is based on outcome measures and that rewards quality, innovation, cost-effectiveness, and staff retention;\n(v) establish compensation limits for employees on the basis of full-time employment and the developmentally disabled client base of a provider group or facility. The commissioner may consider the inclusion of hold harmless provisions;\n(vi) establish overall limits on a high cost facility's general operating costs. The commissioner shall consider groupings of facilities that account for a significant variation in cost. The commissioner may differentiate in the application of these limits between high and very high cost facilities. The limits, once established, shall be indexed for inflation and may be rebased by the commissioner;\n(vii) utilize the client assessment information obtained from the application of the provisions in subdivision 3g for the revisions in items (iii), (iv), and (vi); and\n(viii) develop cost allocation principles which are based on facility expenses; and\n(6) appeals procedures that satisfy the requirements of section 256B.50.\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\nFor rate years beginning on or after October 1, 1990, the commissioner shall index a facility's allowable operating costs in the program, maintenance, and administrative operating cost categories by using Data Resources, Inc., forecast for change in the Consumer Price Index-All Items (U.S. city average) (CPI-U). The commissioner shall use the indices as forecasted by Data Resources, Inc., in the first quarter of the calendar year in which the rate year begins. For fiscal years beginning after June 30, 1993, the commissioner shall not provide automatic inflation adjustments for intermediate care facilities for persons with developmental disabilities. The commissioner of management and budget shall include annual inflation adjustments in operating costs for intermediate care facilities for persons with developmental disabilities as a budget change request in each biennial detailed expenditure budget submitted to the legislature under section 16A.11. The commissioner shall use the Consumer Price Index-All Items (United States city average) (CPI-U) as forecasted by Data Resources, Inc., to take into account economic trends and conditions for changes in facility allowable historical general operating costs and limits. The forecasted index shall be established for allowable historical general operating costs as follows:\n(1) the CPI-U forecasted index for allowable historical general operating costs shall be determined in the first quarter of the calendar year in which the rate year begins and shall be based on the 21-month period from the midpoint of the facility's reporting year to the midpoint of the rate year following the reporting year; and\n(2) for rate years beginning on or after October 1, 1995, the CPI-U forecasted index for the overall operating cost limits and for the individual compensation limit shall be determined in the first quarter of the calendar year in which the rate year begins and shall be based on the 12-month period between the midpoints of the two reporting years preceding the rate year.\n[Repealed, 1995 c 207 art 7 s 43]\n[Repealed, 1995 c 207 art 7 s 43]\n[Repealed, 1995 c 207 art 7 s 43]\n[Repealed, 1999 c 245 art 3 s 51]\n[Repealed, 2014 c 262 art 4 s 9]\nSubdivision 3c does not apply to facilities whose payment rates are governed by Minnesota Rules, part 9553.0075.\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 2014 c 262 art 4 s 9]\nWhen establishing a rate for services during the day, the commissioner shall ensure that these services comply with active treatment requirements for persons residing in an ICF/DD as defined under federal regulations and shall ensure that services during the day for eligible persons are not provided by the person's residential service provider, unless the person or the person's legal representative is offered a choice of providers and agrees in writing to provision of services during the day by the residential service provider, consistent with the individual service plan. The individual service plan for individuals who choose to have their residential service provider provide their services during the day must describe how health, safety, protection, and habilitation needs will be met, including how frequent and regular contact with persons other than the residential service provider will occur. The individualized service plan must address the provision of services during the day outside the residence.\nIn establishing rates for waivered services the commissioner shall consider the need for flexibility in the provision of those services to meet individual needs identified by the screening team.\nThe commissioner shall adjust the limits of the established average daily reimbursement rates for waivered services to include the cost of home care services that may be provided to waivered services recipients. This adjustment must be used to maintain or increase services and shall not be used by county agencies for inflation increases for waivered services vendors. Home care services referenced in this section are those listed in section 256B.0651, subdivision 2. The average daily reimbursement rates established in accordance with the provisions of this subdivision apply only to the combined average, daily costs of waivered and home care services and do not change home care limitations under sections 256B.0651 to 256B.0654 and 256B.0659. Waivered services recipients receiving home care as of June 30, 1992, shall not have the amount of their services reduced as a result of this section.\nThe average daily reimbursement rates established by the commissioner for waivered services shall be adjusted to include the additional costs of services eligible for waiver funding under title XIX of the Social Security Act and for which there is no housing support payment available. The adjustment to the waiver rates shall be based on county reports of service costs that are no longer eligible for housing support payments. No adjustment shall be made for any amount of reported payments that prior to July 1, 1992, exceeded the housing support rate limits established in section 256I.05 and were reimbursed through county funds.\nUpon the request of a recipient receiving services under the community-based waiver for persons with developmental disabilities, or the recipient's legal representative, a county agency shall screen the recipient for appropriate and necessary services and shall place the recipient on and off the waiver as needed in order to allow the recipient access to short-term care as available in an intermediate care facility for persons with developmental disabilities.\n[Repealed, 1987 c 403 art 5 s 22]\nThe reimbursement rule changes in paragraphs (a) to (e) apply to Minnesota Rules, parts 9553.0010 to 9553.0080, and this section, and are effective for rate years beginning on or after October 1, 1993, unless otherwise specified.\n(a) The maximum efficiency incentive shall be $1.50 per resident per day.\n(b) If a facility's capital debt reduction allowance is greater than 50 cents per resident per day, that facility's capital debt reduction allowance in excess of 50 cents per resident day shall be reduced by 25 percent.\n(c) Beginning with the biennial reporting year which begins January 1, 1993, a facility is no longer required to have a certified audit of its financial statements. The cost of a certified audit shall not be an allowable cost in that reporting year, nor in subsequent reporting years unless the facility submits its certified audited financial statements in the manner otherwise specified in this subdivision. A nursing facility which does not submit a certified audit must submit its working trial balance.\n(d) In addition to the approved pension or profit-sharing plans allowed by the reimbursement rule, the commissioner shall allow those plans specified in Internal Revenue Code, sections 403(b) and 408(k).\n(e) The commissioner shall allow as workers' compensation insurance costs under this section, the costs of workers' compensation coverage obtained under the following conditions:\n(1) a plan approved by the commissioner of commerce as a Minnesota group or individual self-insurance plan as provided in sections 79A.03;\n(2) a plan in which:\n(i) the facility, directly or indirectly, purchases workers' compensation coverage in compliance with section 176.181, subdivision 2, from an authorized insurance carrier;\n(ii) a related organization to the facility reinsures the workers' compensation coverage purchased, directly or indirectly, by the facility; and\n(iii) all of the conditions in clause (4) are met;\n(3) a plan in which:\n(i) the facility, directly or indirectly, purchases workers' compensation coverage in compliance with section 176.181, subdivision 2, from an authorized insurance carrier;\n(ii) the insurance premium is calculated retrospectively, including a maximum premium limit, and paid using the paid loss retro method; and\n(iii) all of the conditions in clause (4) are met;\n(4) additional conditions are:\n(i) the reserves for the plan are maintained in an account controlled and administered by a person which is not a related organization to the facility;\n(ii) the reserves for the plan cannot be used, directly or indirectly, as collateral for debts incurred or other obligations of the facility or related organizations to the facility;\n(iii) if the plan provides workers' compensation coverage for non-Minnesota facilities, the plan's cost methodology must be consistent among all facilities covered by the plan, and if reasonable, is allowed notwithstanding any reimbursement laws regarding cost allocation to the contrary;\n(iv) central, affiliated, corporate, or nursing facility costs related to their administration of the plan are costs which must remain in the nursing facility's administrative cost category, and must not be allocated to other cost categories; and\n(v) required security deposits, whether in the form of cash, investments, securities, assets, letters of credit, or in any other form are not allowable costs for purposes of establishing the facilities payment rate; and\n(5) any costs allowed pursuant to clauses (1) to (3) are subject to the following requirements:\n(i) if the facility is sold or otherwise ceases operations, the plan's reserves must be subject to an actuarially based settle up after 36 months from the date of sale or the date on which operations ceased. The facility's medical assistance portion of the total excess plan reserves must be paid to the state within 30 days following the date on which excess plan reserves are determined;\n(ii) any distribution of excess plan reserves made to or withdrawals made by the facility or a related organization are applicable credits and must be used to reduce the facility's workers' compensation insurance costs in the reporting period in which a distribution or withdrawal is received; and\n(iii) if the plan is audited pursuant to the Medicare program, the facility must provide a copy of Medicare's final audit report, including attachments and exhibits, to the commissioner within 30 days of receipt by the facility or any related organization. The commissioner shall implement the audit findings associated with the plan upon receipt of Medicare's final audit report. The department's authority to implement the audit findings is independent of its authority to conduct a field audit.\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 1997 c 203 art 7 s 29]\nAn ICF/DD with crisis services developed under the authority of Laws 1992, chapter 513, article 9, section 40, shall have its operating cost per diem calculated according to paragraphs (a) and (b).\n(a) Effective for services rendered from April 1, 1996, to September 30, 1996, and for rate years beginning on or after October 1, 1996, the maintenance limitation in Minnesota Rules, part 9553.0050, subpart 1, item A, subitem (2), shall be calculated to reflect capacity as of October 1, 1992. The maintenance limit shall be the per diem limitation otherwise in effect adjusted by the ratio of licensed capacity days as of October 1, 1992, divided by resident days in the reporting year ending December 31, 1993.\n(b) Effective for rate years beginning on or after October 1, 1996, the operating cost per service unit, for purposes of the cost per service unit limit in subdivision 5b, paragraph (d), clauses (7) and (8), shall be calculated after excluding the costs directly identified to the provision of outreach crisis services and a four-bed crisis unit.\n(c) The efficiency incentive paid to an ICF/DD shall not be increased as a result of this subdivision.\n[Repealed, 2014 c 262 art 4 s 9]\n[Repealed, 1987 c 403 art 5 s 22]\n[Repealed, 1987 c 403 art 5 s 22]\n[Repealed, 2013 c 108 art 13 s 14]\nCommunity-based crisis services authorized by the commissioner or the commissioner's designee for a resident of an intermediate care facility for persons with developmental disabilities (ICF/DD) reimbursed under this section shall be paid by medical assistance in accordance with paragraphs (a) to (g).\n(a) \"Crisis services\" means the specialized services listed in clauses (1) to (3) provided to prevent the recipient from requiring placement in a more restrictive institutional setting such as an inpatient hospital or regional treatment center and to maintain the recipient in the present community setting.\n(1) The crisis services provider shall assess the recipient's behavior and environment to identify factors contributing to the crisis.\n(2) The crisis services provider shall develop a recipient-specific intervention plan in coordination with the service planning team and provide recommendations for revisions to the individual service plan if necessary to prevent or minimize the likelihood of future crisis situations. The intervention plan shall include a transition plan to aid the recipient in returning to the community-based ICF/DD if the recipient is receiving residential crisis services.\n(3) The crisis services provider shall consult with and provide training and ongoing technical assistance to the recipient's service providers to aid in the implementation of the intervention plan and revisions to the individual service plan.\n(b) \"Residential crisis services\" means crisis services that are provided to a recipient admitted to an alternative, state-licensed site approved by the commissioner, because the ICF/DD receiving reimbursement under this section is not able, as determined by the commissioner, to provide the intervention and protection of the recipient and others living with the recipient that is necessary to prevent the recipient from requiring placement in a more restrictive institutional setting.\n(c) Residential crisis services providers must maintain a license from the commissioner for the residence when providing crisis services for short-term crisis intervention, and must not be located in a private residence.\n(d) Payment rates shall be established consistent with county negotiated crisis intervention services.\n(e) Payment for residential crisis services is limited to 21 days, unless an additional period is authorized by the commissioner or part of an approved regional plan.\n(f) Payment for crisis services shall be made only for services provided while the ICF/DD receiving reimbursement under this section has executed a cooperative agreement with the crisis services provider to implement the intervention plan and revisions to the individual service plan as necessary to prevent or minimize the likelihood of future crisis situations, to maintain the recipient in the present community setting, and to prevent the recipient from requiring a more restrictive institutional setting.\n(g) Payment to the ICF/DD receiving reimbursement under this section shall be made for up to 18 therapeutic leave days during which the recipient is receiving residential crisis services, if the ICF/DD is otherwise eligible to receive payment for a therapeutic leave day under Minnesota Rules, part 9505.0415. Payment under this paragraph shall be terminated if the commissioner determines that the ICF/DD is not meeting the terms of the cooperative service agreement under paragraph (f) or that the recipient will not return to the ICF/DD.\n[Repealed, 1987 c 403 art 5 s 22]\nTo implement this section, the commissioner shall promulgate rules in accordance with chapter 14.\n(a) The provisions of Minnesota Rules, part 9553.0075, except as modified under this subdivision, shall apply to newly constructed or established facilities that are certified for medical assistance on or after May 1, 1990.\n(b) For purposes of establishing payment rates under this subdivision and Minnesota Rules, parts 9553.0010 to 9553.0080, the term \"newly constructed or newly established\" means a facility (1) for which a need determination has been approved by the commissioner under sections 252.28 and 252.291; (2) whose program is newly licensed under chapter 245D and certified under Code of Federal Regulations, title 42, section 442.400, et seq.; and (3) that is part of a proposal that meets the requirements of section 252.291, subdivision 2, paragraph (a), clause (2). The term does not include a facility for which a need determination was granted solely for other reasons such as the relocation of a facility; a change in the facility's name, program, number of beds, type of beds, or ownership; or the sale of a facility, unless the relocation of a facility to one or more service sites is the result of a closure of a facility under section 252.292, in which case clause (3) shall not apply. The term does include a facility that converts more than 50 percent of its licensed beds from class A to class B residential or class B institutional to serve persons discharged from state regional treatment centers on or after May 1, 1990, in which case clause (3) does not apply.\n(c) Newly constructed or newly established facilities that are certified for medical assistance on or after May 1, 1990, shall be allowed the capital asset investment per bed limits as provided in clauses (1) to (4).\n(1) The 1990 calendar year investment per bed limit for a facility's land must not exceed $5,700 per bed for newly constructed or newly established facilities in Hennepin, Ramsey, Anoka, Washington, Dakota, Scott, Carver, Chisago, Isanti, Wright, Benton, Sherburne, Stearns, St. Louis, Clay, and Olmsted Counties, and must not exceed $3,000 per bed for newly constructed or newly established facilities in other counties.\n(2) The 1990 calendar year investment per bed limit for a facility's depreciable capital assets must not exceed $44,800 for class B residential beds, and $45,200 for class B institutional beds.\n(3) The investment per bed limit in clause (2) must not be used in determining the three-year average percentage increase adjustment in Minnesota Rules, part 9553.0060, subpart 1, item C, subitem (4), for facilities that were newly constructed or newly established before May 1, 1990.\n(4) The investment per bed limits in clause (2) and Minnesota Rules, part 9553.0060, subpart 1, item C, subitem (2) shall be adjusted annually beginning January 1, 1991, and each January 1 following, as provided in Minnesota Rules, part 9553.0060, subpart 1, item C, subitem (2), except that the index utilized will be the Bureau of the Census: Composite Fixed-Weighted Price Index as published in the Survey of Current Business.\n(d) A newly constructed or newly established facility's interest expense limitation as provided for in Minnesota Rules, part 9553.0060, subpart 3, item F, on capital debt for capital assets acquired during the interim or settle-up period, shall be increased by 2.5 percentage points for each full .25 percentage points that the facility's interest rate on its mortgage is below the maximum interest rate as established in Minnesota Rules, part 9553.0060, subpart 2, item A, subitem (2). For all following rate periods, the interest expense limitation on capital debt in Minnesota Rules, part 9553.0060, subpart 3, item F, shall apply to the facility's capital assets acquired, leased, or constructed after the interim or settle-up period. If a newly constructed or newly established facility is acquired by the state, the limitations of this paragraph and Minnesota Rules, part 9553.0060, subpart 3, item F, shall not apply.\n(e) If a newly constructed or newly established facility is leased with an arm's-length lease as provided for in Minnesota Rules, part 9553.0060, subpart 7, the lease agreement shall be subject to the following conditions:\n(1) the term of the lease, including option periods, must not be less than 20 years;\n(2) the maximum interest rate used in determining the present value of the lease must not exceed the lesser of the interest rate limitation in Minnesota Rules, part 9553.0060, subpart 2, item A, subitem (2), or 16 percent; and\n(3) the residual value used in determining the net present value of the lease must be established using the provisions of Minnesota Rules, part 9553.0060.\n(f) All leases of the physical plant of an intermediate care facility for the developmentally disabled shall contain a clause that requires the owner to give the commissioner notice of any requests or orders to vacate the premises 90 days before such vacation of the premises is to take place. In the case of eviction actions, the owner shall notify the commissioner within three days of notice of an eviction action being served upon the tenant. The only exception to this notice requirement is in the case of emergencies where immediate vacation of the premises is necessary to assure the safety and welfare of the residents. In such an emergency situation, the owner shall give the commissioner notice of the request to vacate at the time the owner of the property is aware that the vacating of the premises is necessary. This section applies to all leases entered into after May 1, 1990. Rentals set in leases entered into after that date that do not contain this clause are not allowable costs for purposes of medical assistance reimbursement.\n(g) A newly constructed or newly established facility's preopening costs are subject to the provisions of Minnesota Rules, part 9553.0035, subpart 12, and must be limited to only those costs incurred during one of the following periods, whichever is shorter:\n(1) between the date the commissioner approves the facility's need determination and 30 days before the date the facility is certified for medical assistance; or\n(2) the 12-month period immediately preceding the 30 days before the date the facility is certified for medical assistance.\n(h) The development of any newly constructed or newly established facility as defined in this subdivision and projected to be operational after July 1, 1991, by the commissioner of human services shall be delayed until July 1, 1993, except for those facilities authorized by the commissioner as a result of a closure of a facility according to section 252.292 prior to January 1, 1991, or those facilities developed as a result of a receivership of a facility according to section 245A.12. This paragraph does not apply to state-operated community facilities authorized in section 246C.11.\nEffective July 1, 1998, to September 30, 2000, the commissioner shall make available the appropriate salary adjustment cost per diem calculated in paragraphs (a) to (e) to the total operating cost payment rate of each facility subject to reimbursement under this section and Laws 1993, First Special Session chapter 1, article 4, section 11. The salary adjustment cost per diem must be determined as follows:\n(a) A state-operated community service, and any facility whose payment rates are governed by closure agreements, receivership agreements, or Minnesota Rules, part 9553.0075, are not eligible for a salary adjustment otherwise granted under this subdivision. For purposes of the salary adjustment per diem computation and reviews in this subdivision, the term \"salary adjustment cost\" means the facility's allowable program operating cost category employee training expenses, and the facility's allowable salaries, payroll taxes, and fringe benefits. The term does not include these same salary-related costs for both administrative or central office employees.\nFor the purpose of determining the amount of salary adjustment to be granted under this subdivision, the commissioner must use the reporting year ending December 31, 1996, as the base year for the salary adjustment per diem computation.\n(b) For the rate period beginning July 1, 1998, each facility shall receive a salary adjustment cost per diem equal to its salary adjustment costs multiplied by 3.0 percent, and then divided by the facility's resident days.\n(c) A facility may apply for the salary adjustment per diem calculated under this subdivision. The application must be made to the commissioner and contain a plan by which the facility will distribute the salary adjustment to employees of the facility. For facilities in which the employees are represented by an exclusive bargaining representative, an agreement negotiated and agreed to by the employer and the exclusive bargaining representative, after July 1, 1998, may constitute the plan for the salary distribution. The commissioner shall review the plan to ensure that the salary adjustment per diem is used solely to increase the compensation of facility employees. To be eligible, a facility must submit its plan for the salary distribution by December 31, 1998. If a facility's plan for salary distribution is effective for its employees after July 1, 1998, the salary adjustment cost per diem shall be effective the same date as its plan.\n(d) Additional costs incurred by facilities as a result of this salary adjustment are not allowable costs for purposes of the December 31, 1998, cost report.\n(e) In order to apply for a salary adjustment, a facility reimbursed under Laws 1993, First Special Session chapter 1, article 4, section 11, must report the information referred to in paragraph (a) in the application, in the manner specified by the commissioner.\n(a) For the rate years beginning October 1, 1999, and October 1, 2000, the commissioner shall make available to each facility reimbursed under this section, section 256B.5011, and Laws 1993, First Special Session chapter 1, article 4, section 11, an adjustment to the total operating payment rate. For each facility, total operating costs shall be separated into costs that are compensation related and all other costs. \"Compensation-related costs\" means the facility's allowable program operating cost category employee training expenses and the facility's allowable salaries, payroll taxes, and fringe benefits. The term does not include these same salary-related costs for both administrative or central office employees.\nFor the purpose of determining the adjustment to be granted under this subdivision, the commissioner must use the most recent cost report that has been subject to desk audit.\n(b) For the rate year beginning October 1, 1999, the commissioner shall make available a rate increase for compensation-related costs of 4.6 percent and a rate increase for all other operating costs of 3.2 percent.\n(c) For the rate year beginning October 1, 2000, the commissioner shall make available:\n(1) a rate increase for compensation-related costs of 6.6 percent, 45 percent of which shall be used to increase the per-hour pay rate of all employees except administrative and central office employees by an equal dollar amount and to pay associated costs for FICA, the Medicare tax, workers' compensation premiums, and federal and state unemployment insurance provided that this portion of the compensation-related increase shall be used only for wage increases implemented on or after October 1, 2000, and shall not be used for wage increases implemented prior to that date; and\n(2) a rate increase for all other operating costs of two percent.\n(d) For each facility, the commissioner shall determine the payment rate adjustment using the categories specified in paragraph (a) multiplied by the rate increases specified in paragraph (b) or (c), and then dividing the resulting amount by the facility's actual resident days.\n(e) Any facility whose payment rates are governed by closure agreements, receivership agreements, or Minnesota Rules, part 9553.0075, are not eligible for an adjustment otherwise granted under this subdivision.\n(f) A facility may apply for the compensation-related payment rate adjustment calculated under this subdivision. The application must be made to the commissioner and contain a plan by which the facility will distribute the compensation-related portion of the payment rate adjustment to employees of the facility. For facilities in which the employees are represented by an exclusive bargaining representative, an agreement negotiated and agreed to by the employer and the exclusive bargaining representative constitutes the plan. For the second rate year, a negotiated agreement may constitute the plan only if the agreement is finalized after the date of enactment of all rate increases for the second rate year. The commissioner shall review the plan to ensure that the payment rate adjustment per diem is used as provided in this subdivision. To be eligible, a facility must submit its plan for the compensation distribution by December 31 each year. A facility may amend its plan for the second rate year by submitting a revised plan by December 31, 2000. If a facility's plan for compensation distribution is effective for its employees after October 1 of the year that the funds are available, the payment rate adjustment per diem shall be effective the same date as its plan.\n(g) A copy of the approved distribution plan must be made available to all employees. This must be done by giving each employee a copy or by posting it in an area of the facility to which all employees have access. If an employee does not receive the compensation adjustment described in their facility's approved plan and is unable to resolve the problem with the facility's management or through the employee's union representative, the employee may contact the commissioner at an address or telephone number provided by the commissioner and included in the approved plan.\nThe commissioner of health shall decertify three beds in an intermediate care facility for persons with developmental disabilities with 21 certified beds located in Cottonwood County. The total payment rate shall be $282.62 per bed, per day.",
	"repealed": false
}