{
	"id": "148.261",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.261",
	"title": "148.261 GROUNDS FOR DISCIPLINARY ACTION.",
	"text": "The board may deny, revoke, suspend, limit, or condition the license and registration of any person to practice advanced practice, professional, or practical nursing under sections 148.171 to 148.285, or to otherwise discipline a licensee or applicant as described in section 148.262. The following are grounds for disciplinary action:\n(1) Failure to demonstrate the qualifications or satisfy the requirements for a license contained in sections 148.171 to 148.285 or rules of the board. In the case of a person applying for a license, the burden of proof is upon the applicant to demonstrate the qualifications or satisfaction of the requirements.\n(2) Employing fraud or deceit in procuring or attempting to procure a permit, license, or registration certificate to practice advanced practice, professional, or practical nursing or attempting to subvert the licensing examination process. Conduct that subverts or attempts to subvert the licensing examination process includes, but is not limited to:\n(i) conduct that violates the security of the examination materials, such as removing examination materials from the examination room or having unauthorized possession of any portion of a future, current, or previously administered licensing examination;\n(ii) conduct that violates the standard of test administration, such as communicating with another examinee during administration of the examination, copying another examinee's answers, permitting another examinee to copy one's answers, or possessing unauthorized materials; or\n(iii) impersonating an examinee or permitting an impersonator to take the examination on one's own behalf.\n(3) Conviction of a felony or gross misdemeanor reasonably related to the practice of professional, advanced practice registered, or practical nursing. Conviction as used in this subdivision includes a conviction of an offense that if committed in this state would be considered a felony or gross misdemeanor without regard to its designation elsewhere, or a criminal proceeding where a finding or verdict of guilt is made or returned but the adjudication of guilt is either withheld or not entered.\n(4) Revocation, suspension, limitation, conditioning, or other disciplinary action against the person's professional or practical nursing license or advanced practice registered nursing credential, in another state, territory, or country; failure to report to the board that charges regarding the person's nursing license or other credential are pending in another state, territory, or country; or having been refused a license or other credential by another state, territory, or country.\n(5) Failure to or inability to perform professional or practical nursing as defined in section 148.171, subdivision 14 or 15, with reasonable skill and safety, including failure of a registered nurse to supervise or a licensed practical nurse to monitor adequately the performance of acts by any person working at the nurse's direction.\n(6) Engaging in unprofessional conduct, including, but not limited to, a departure from or failure to conform to board rules of professional or practical nursing practice that interpret the statutory definition of professional or practical nursing as well as provide criteria for violations of the statutes, or, if no rule exists, to the minimal standards of acceptable and prevailing professional or practical nursing practice, or any nursing practice that may create unnecessary danger to a patient's life, health, or safety. Actual injury to a patient need not be established under this clause.\n(7) Failure of an advanced practice registered nurse to practice with reasonable skill and safety or departure from or failure to conform to standards of acceptable and prevailing advanced practice registered nursing.\n(8) Delegating or accepting the delegation of a nursing function or a prescribed health care function when the delegation or acceptance could reasonably be expected to result in unsafe or ineffective patient care.\n(9) Actual or potential inability to practice nursing with reasonable skill and safety to patients by reason of illness, use of alcohol, drugs, chemicals, or any other material, or as a result of any mental or physical condition.\n(10) Adjudication as mentally incompetent, mentally ill, a chemically dependent person, or a person dangerous to the public by a court of competent jurisdiction, within or without this state.\n(11) Engaging in any unethical conduct, including, but not limited to, conduct likely to deceive, defraud, or harm the public, or demonstrating a willful or careless disregard for the health, welfare, or safety of a patient. Actual injury need not be established under this clause.\n(12) Engaging in conduct with a patient that is sexual or may reasonably be interpreted by the patient as sexual, or in any verbal behavior that is seductive or sexually demeaning to a patient, or engaging in sexual exploitation of a patient or former patient.\n(13) Obtaining money, property, or services from a patient, other than reasonable fees for services provided to the patient, through the use of undue influence, harassment, duress, deception, or fraud.\n(14) Revealing a privileged communication from or relating to a patient except when otherwise required or permitted by law.\n(15) Engaging in abusive or fraudulent billing practices, including violations of federal Medicare and Medicaid laws or state medical assistance laws.\n(16) Improper management of patient records, including failure to maintain adequate patient records, to comply with a patient's request made pursuant to sections 144.291 to 144.298, or to furnish a patient record or report required by law.\n(17) Knowingly aiding, assisting, advising, or allowing an unlicensed person to engage in the unlawful practice of advanced practice, professional, or practical nursing.\n(18) Violating a rule adopted by the board, an order of the board, or a state or federal law relating to the practice of advanced practice, professional, or practical nursing, or a state or federal narcotics or controlled substance law.\n(19) Knowingly providing false or misleading information that is directly related to the care of that patient unless done for an accepted therapeutic purpose such as the administration of a placebo.\n(20) Aiding suicide or aiding attempted suicide in violation of section 609.215 as established by any of the following:\n(i) a copy of the record of criminal conviction or plea of guilty for a felony in violation of section 609.215, subdivision 1 or 2;\n(ii) a copy of the record of a judgment of contempt of court for violating an injunction issued under section 609.215, subdivision 4;\n(iii) a copy of the record of a judgment assessing damages under section 609.215, subdivision 5; or\n(iv) a finding by the board that the person violated section 609.215, subdivision 1 or 2. The board shall investigate any complaint of a violation of section 609.215, subdivision 1 or 2.\n(21) Practicing outside the scope of practice authorized by section 148.171, subdivision 5, 10, 11, 13, 14, 15, or 21.\n(22) Making a false statement or knowingly providing false information to the board, failing to make reports as required by section 148.263, or failing to cooperate with an investigation of the board as required by section 148.265.\n(23) Engaging in false, fraudulent, deceptive, or misleading advertising.\n(24) Failure to inform the board of the person's certification or recertification status as a certified registered nurse anesthetist, certified nurse-midwife, certified nurse practitioner, or certified clinical nurse specialist.\n(25) Engaging in clinical nurse specialist practice, nurse-midwife practice, nurse practitioner practice, or registered nurse anesthetist practice without a license and current certification or recertification by a national nurse certification organization acceptable to the board.\n(26) Failing to report employment to the board as required by section 148.211, subdivision 2a, or knowingly aiding, assisting, advising, or allowing a person to fail to report as required by section 148.211, subdivision 2a.\n(a) Except as provided in paragraph (e), the board may not grant or renew a license to practice nursing to any person who has been convicted on or after August 1, 2014, of any of the provisions of section 609.342, subdivision 1 or 1a, 609.343, subdivision 1 or 1a, 609.344, subdivision 1, or subdivision 1a, clauses (c) to (i), or 609.345, subdivision 1, or subdivision 1a, clauses (c) to (i), or a similar statute in another jurisdiction.\n(b) A license to practice nursing is automatically revoked if the licensee is convicted of an offense listed in paragraph (a).\n(c) A license to practice nursing that has been denied or revoked under this subdivision is not subject to chapter 364.\n(d) For purposes of this subdivision, \"conviction\" means a plea of guilty, a verdict of guilty by a jury, or a finding of guilty by the court, unless the court stays imposition or execution of the sentence and final disposition of the case is accomplished at a nonfelony level.\n(e) The board may establish criteria whereby an individual convicted of an offense listed in paragraph (a) may become licensed provided that the criteria:\n(1) utilize a rebuttable presumption that the applicant is not suitable for licensing;\n(2) provide a standard for overcoming the presumption; and\n(3) require that a minimum of ten years has elapsed since the applicant's sentence was discharged.\nThe board shall not consider an application under this paragraph if the board determines that the victim involved in the offense was a patient or a client of the applicant at the time of the offense.\n(a) For purposes of this subdivision, \"reproductive health care services\" has the meaning given in section 147.091, subdivision 1c.\n(b) Notwithstanding subdivision 1, clause (3) or (4), the board shall not refuse to grant a license to an applicant for licensure or impose disciplinary action against a nurse solely on one or more of the following grounds:\n(1) the applicant or nurse provided or assisted in the provision of reproductive health care services in a manner that is lawful in this state and that is within the applicable scope of practice;\n(2) the applicant or nurse was convicted in another jurisdiction of a felony resulting from conduct specified in clause (1); or\n(3) the applicant or nurse was subject to disciplinary action in another jurisdiction or was refused a license to practice advanced practice, professional, or practical nursing in another jurisdiction resulting from conduct specified in clause (1).\n[Repealed, 1976 c 222 s 209]\n[Repealed, 1989 c 194 s 22]\nIn disciplinary actions alleging a violation of subdivision 1, clause (3) or (4), or subdivision 1a, a copy of the judgment or proceeding under the seal of the court administrator or of the administrative agency that entered the same shall be admissible into evidence without further authentication and shall constitute prima facie evidence of the violation concerned.\nThe board may take the following actions if it has probable cause to believe that grounds for disciplinary action exist under subdivision 1, clause (9) or (10):\n(a) It may direct the applicant or nurse to submit to a mental or physical examination or substance use disorder evaluation. For the purpose of this subdivision, when a nurse licensed under sections 148.171 to 148.285 is directed in writing by the board to submit to a mental or physical examination or substance use disorder evaluation, that person is considered to have consented and to have waived all objections to admissibility on the grounds of privilege. Failure of the applicant or nurse to submit to an examination when directed constitutes an admission of the allegations against the applicant or nurse, unless the failure was due to circumstances beyond the person's control, and the board may enter a default and final order without taking testimony or allowing evidence to be presented. A nurse affected under this paragraph shall, at reasonable intervals, be given an opportunity to demonstrate that the competent practice of professional, advanced practice registered, or practical nursing can be resumed with reasonable skill and safety to patients. Neither the record of proceedings nor the orders entered by the board in a proceeding under this paragraph, may be used against a nurse in any other proceeding.\n(b) It may, notwithstanding sections 13.384, 144.651, 595.02, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a registered nurse, advanced practice registered nurse, licensed practical nurse, or applicant for a license without that person's consent. The medical data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (i), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this subdivision and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this subdivision unless the information is false and the provider giving the information knew, or had reason to believe, the information was false. Information obtained under this subdivision is classified as private data on individuals as defined in section 13.02.",
	"repealed": false
}