{
	"id": "256B.0761",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0761",
	"title": "256B.0761 REENTRY DEMONSTRATION WAIVER.",
	"text": "The commissioner must submit a waiver application to the Centers for Medicare and Medicaid Services to implement a medical assistance demonstration project to provide health care and coordination services that bridge to community-based services for individuals confined in state, local, or Tribal correctional facilities, or facilities located outside of the seven-county metropolitan area that have an inmate census with a significant proportion of Tribal members or American Indians, prior to community reentry. The demonstration must be designed to:\n(1) increase continuity of coverage;\n(2) improve access to health care services, including mental health services, physical health services, and substance use disorder treatment services;\n(3) enhance coordination between Medicaid systems, health and human services systems, correctional systems, and community-based providers;\n(4) reduce overdoses and deaths following release;\n(5) decrease disparities in overdoses and deaths following release; and\n(6) maximize health and overall community reentry outcomes.\nNotwithstanding section 256B.055, subdivision 14, individuals are eligible to receive services under this demonstration if they are eligible under section 256B.055, subdivision 3a, 6, 7, 7a, 9, 15, 16, or 17, as determined by the commissioner in collaboration with correctional facilities, local governments, and Tribal governments.\n(a) The commissioner's waiver application is limited to:\n(1) three state correctional facilities to be determined by the commissioner of corrections, one of which must be the Minnesota Correctional Facility-Shakopee;\n(2) two facilities for delinquent children and youth licensed under section 241.021, subdivision 2, identified in coordination with the Minnesota Juvenile Detention Association and the Minnesota Sheriffs' Association;\n(3) four correctional facilities for adults licensed under section 241.021, subdivision 1, identified in coordination with the Minnesota Sheriffs' Association and the Association of Minnesota Counties; and\n(4) one correctional facility owned and managed by a Tribal government or a facility located outside of the seven-county metropolitan area that has an inmate census with a significant proportion of Tribal members or American Indians.\n(b) Additional facilities may be added to the waiver contingent on legislative authorization and appropriations.\n(a) Services must be provided 90 days prior to an individual's release date or, if an individual's confinement is less than 90 days, during the time period between a medical assistance eligibility determination and the release to the community.\n(b) Facilities must offer the following services using either community-based or corrections-based providers:\n(1) case management activities to address physical and behavioral health needs, including a comprehensive assessment of individual needs, development of a person-centered care plan, referrals and other activities to address assessed needs, and monitoring and follow-up activities;\n(2) drug coverage in accordance with section 256B.0625, subdivision 13, including up to a 30-day supply of drugs upon release;\n(3) substance use disorder comprehensive assessments according to section 254B.05, subdivision 5, paragraph (b), clause (2);\n(4) treatment coordination services according to section 254B.05, subdivision 5, paragraph (b), clause (3);\n(5) peer recovery support services according to sections 245I.04, subdivisions 18 and 19, and 254B.05, subdivision 5, paragraph (b), clause (4);\n(6) substance use disorder individual and group counseling provided according to sections 245G.07, subdivision 1, paragraph (a), clause (1), and 254B.05;\n(7) mental health diagnostic assessments as required under section 245I.10;\n(8) group and individual psychotherapy as required under section 256B.0671;\n(9) peer specialist services as required under sections 245I.04 and 256B.0615;\n(10) family planning and obstetrics and gynecology services; and\n(11) physical health well-being and screenings and care for adults and youth.\n(c) Services outlined in this subdivision must only be authorized when an individual demonstrates medical necessity or other eligibility as required under this chapter or applicable state and federal laws.\n(a) Service providers must adhere to applicable licensing and provider standards as required by federal guidance.\n(b) Service providers must be enrolled to provide services under Minnesota health care programs.\n(c) Services must be provided by eligible providers employed by the correctional facility or by eligible community providers under contract with the correctional facility.\n(d) The commissioner must determine whether each facility is ready to participate in this demonstration based on a facility-submitted assessment of the facility's readiness to implement:\n(1) prerelease medical assistance application and enrollment processes for inmates not enrolled in medical assistance coverage;\n(2) the provision or facilitation of all required prerelease services for a period of up to 90 days prior to release;\n(3) coordination among county and Tribal human services agencies and all other entities with a role in furnishing health care and supports to address health-related social needs;\n(4) appropriate reentry planning, prerelease care management, and assistance with care transitions to the community;\n(5) operational approaches to implementing certain Medicaid and CHIP requirements, including applications, suspensions, notices, fair hearings, and reasonable promptness for coverage of services;\n(6) a data exchange process to support care coordination and transition activities; and\n(7) reporting of all requested data to the commissioner of human services to support program monitoring, evaluation, oversight, and all financial data to meet reinvestment requirements.\n(e) Participating facilities must detail reinvestment plans for all new federal Medicaid money expended for reentry services that were previously the responsibility of each facility and provide detailed financial reports to the commissioner.\n(a) Payment rates for services under this section that are approved under Minnesota's state plan agreement with the Centers for Medicare and Medicaid Services are equal to current and applicable state law and federal requirements.\n(b) Case management payment rates are equal to rates authorized by the commissioner for relocation targeted case management under section 256B.0621, subdivision 10.\n(c) Claims for covered drugs purchased through discount purchasing programs, such as the Federal Supply Schedule of the United States General Services Administration or the MMCAP Infuse program, must be no more than the actual acquisition cost plus the professional dispensing fee in section 256B.0625, subdivision 13e. Drugs administered to members must be billed on a professional claim in accordance with section 256B.0625, subdivision 13e, paragraph (e), and submitted with the actual acquisition cost for the drug on the claim line. Pharmacy claims must be submitted with the actual acquisition cost as the ingredient cost field and the dispensing fee in section 256B.0625, subdivision 13e, as the dispensing fee field on the claim with the basis of cost indicator of 08. Providers may establish written protocols for establishing or calculating the facility's actual acquisition drug cost based on a monthly, quarterly, or other average of the facility's actual acquisition drug cost through the discount purchasing program. A written protocol must not include an inflation, markup, spread, or margin to be added to the provider's actual purchase price after subtracting all discounts.\n(a) The commissioner of human services, in collaboration with the commissioner of corrections, must convene a reentry services working group to consider ways to improve the demonstration under this section and related policies for justice-involved individuals.\n(b) The working group must be composed of balanced representation, including:\n(1) people with lived experience; and\n(2) representatives from:\n(i) community health care providers;\n(ii) the Minnesota Sheriffs' Association;\n(iii) the Minnesota Association for County Social Service Administrators;\n(iv) the Association of Minnesota Counties;\n(v) the Minnesota Juvenile Detention Association;\n(vi) the Office of Addiction and Recovery;\n(vii) NAMI Minnesota;\n(viii) the Minnesota Association of Resources for Recovery and Chemical Health;\n(ix) Tribal Nations; and\n(x) the Minnesota Alliance of Recovery Community Organizations.\n(c) The working group must:\n(1) advise on the waiver application, implementation, monitoring, evaluation, and reinvestment plans;\n(2) recommend strategies to improve processes that ensure notifications of the individual's release date, current location, postrelease location, and other relevant information are provided to state, county, and Tribal eligibility systems and managed care organizations;\n(3) consider the value of expanding, replicating, or adapting the components of the demonstration authorized under this section to additional populations;\n(4) consider information technology and other implementation needs for participating correctional facilities; and\n(5) recommend ideas to fund expanded reentry services.",
	"repealed": false
}