{
	"id": "609.5311",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.5311",
	"title": "609.5311 FORFEITURE OF PROPERTY ASSOCIATED WITH CONTROLLED SUBSTANCES.",
	"text": "All controlled substances that were manufactured, distributed, dispensed, or acquired in violation of chapter 152 or 342 are subject to forfeiture under this section, except as provided in subdivision 3 and section 609.5316.\n(a) All personal property and real property, other than homestead property exempt from seizure under section 510.01, that is an instrument or represents the proceeds of a controlled substance offense is subject to forfeiture under this section, except as provided in subdivision 3.\n(b) The Department of Corrections Fugitive Apprehension Unit shall not seize real property for the purposes of forfeiture under paragraph (a).\n(c) Money is the property of an appropriate agency and may be seized and recovered by the appropriate agency if:\n(1) the money is used by an appropriate agency, or furnished to a person operating on behalf of an appropriate agency, to purchase or attempt to purchase a controlled substance; and\n(2) the appropriate agency records the serial number or otherwise marks the money for identification.\nAs used in this paragraph, \"money\" means United States currency and coin; the currency and coin of a foreign country; a bank check, cashier's check, or traveler's check; a prepaid credit card; cryptocurrency; or a money order.\n(a) A conveyance device is subject to forfeiture under this section only if the retail value of the controlled substance is $100 or more and the conveyance device was used in the transportation or exchange of a controlled substance intended for distribution or sale.\n(b) Real property is subject to forfeiture under this section only if the retail value of the controlled substance or contraband is $2,000 or more.\n(c) Property used by any person as a common carrier in the transaction of business as a common carrier is subject to forfeiture under this section only if the owner of the property is a consenting party to, or is privy to, the use or intended use of the property as described in subdivision 2.\n(d) Property is subject to forfeiture under this section only if its owner was privy to the use or intended use described in subdivision 2, or the unlawful use or intended use of the property otherwise occurred with the owner's knowledge or consent.\n(e) Forfeiture under this section of a conveyance device or real property encumbered by a bona fide security interest is subject to the interest of the secured party unless the secured party had knowledge of or consented to the act or omission upon which the forfeiture is based. A person claiming a security interest bears the burden of establishing that interest by clear and convincing evidence.\n(f) Forfeiture under this section of real property is subject to the interests of a good faith purchaser for value unless the purchaser had knowledge of or consented to the act or omission upon which the forfeiture is based.\n(g) Notwithstanding paragraphs (d), (e), and (f), property is not subject to forfeiture based solely on the owner's or secured party's knowledge of the unlawful use or intended use of the property if: (1) the owner or secured party took reasonable steps to terminate use of the property by the offender; or (2) the property is real property owned by the parent of the offender, unless the parent actively participated in, or knowingly acquiesced to, a violation of chapter 152, or the real property constitutes proceeds derived from or traceable to a use described in subdivision 2.\n(h) Money is subject to forfeiture under this section only if it has a total value of $1,500 or more or there is probable cause to believe that the money was exchanged for the purchase of a controlled substance. As used in this paragraph, \"money\" means United States currency and coin; the currency and coin of a foreign country; a bank check, cashier's check, or traveler's check; a prepaid credit card; cryptocurrency; or a money order.\n(i) The Department of Corrections Fugitive Apprehension Unit shall not seize a conveyance device or real property, for the purposes of forfeiture under paragraphs (a) to (g).\n(j) Nothing in this subdivision prohibits the seizure, with or without warrant, of any property or thing for the purpose of being produced as evidence on any trial or for any other lawful purpose.\nAll books, records, and research products and materials, including formulas, microfilm, tapes, and data that are used, or intended for use in the manner described in subdivision 2 are subject to forfeiture.",
	"repealed": false
}