{
	"id": "299A.705",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.705",
	"title": "299A.705 DRIVER AND VEHICLE SERVICES ACCOUNTS.",
	"text": "(a) The driver and vehicle services operating account is created in the special revenue fund. The account consists of all money from the vehicle services fees specified in chapters 168, 168A, and 168D, all money collected under chapter 171, and any other money donated, allotted, transferred, or otherwise provided to the account.\n(b) Funds appropriated from the account must be used by the commissioner of public safety to administer:\n(1) the driver services specified in chapters 169A and 171, including the activities associated with producing and mailing drivers' licenses and identification cards and notices relating to issuance, renewal, or withdrawal of driving and identification card privileges for any fiscal year or years and for the testing and examination of drivers; and\n(2) the vehicle services specified in chapters 168, 168A, and 168D, and section 169.345, including:\n(i) designing, producing, issuing, and mailing vehicle registrations, plates, emblems, and titles;\n(ii) collecting title and registration taxes and fees;\n(iii) transferring vehicle registration plates and titles;\n(iv) maintaining vehicle records;\n(v) issuing disability certificates and plates;\n(vi) licensing vehicle dealers;\n(vii) appointing, monitoring, and auditing deputy registrars; and\n(viii) inspecting vehicles when required by law.\n(c) In conjunction with each forecast under section 16A.103, the submission of the governor's budget under section 16A.11, and the completion of a legislative session, the commissioner of management and budget must publish a supplemental statement for the account. The statement must include:\n(1) categorization of revenue and expenditures for recent, current, and upcoming fiscal years, with breakouts by anticipated expenditures under statutory and direct appropriations;\n(2) specification of the account balance actuals or estimates in each fiscal year; and\n(3) identification of changes in comparison to the most recent prior forecast.\nMS 2022 [Repealed, 2023 c 68 art 4 s 129]\n(a) The driver and vehicle services technology account is created in the special revenue fund, consisting of the technology surcharge collected as specified in chapters 168, 168A, and 171; the filing fee revenue collected under section 168.33, subdivision 7; and any other money donated, allotted, transferred, or otherwise provided to the account.\n(b) Money in the account is annually appropriated to the commissioner of public safety for the development, deployment, and maintenance of the driver and vehicle services information systems.\n(c) By January 15 of each year, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance concerning the account, which must include information on (1) total revenue deposited in the driver and vehicle services technology account, with a breakdown by sources of funds; and (2) an estimate of ongoing system maintenance costs, including a breakdown of the amounts spent by category.\nThe commissioner is prohibited from expending money from driver and vehicle services accounts created in the special revenue fund for any purpose that is not specifically authorized in this section or in the chapters specified in this section.",
	"repealed": false
}