{
	"id": "103E.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.095",
	"title": "103E.095 APPEAL FROM ORDERS DISMISSING OR ESTABLISHING DRAINAGE SYSTEMS.",
	"text": "A party may appeal an order made by the board that dismisses drainage proceedings or establishes or refuses to establish a drainage project to the district court of the county where the drainage proceedings are pending. The appellant must serve notice of the appeal to the auditor within 30 days after the order is filed. After notice of the appeal is served, the appeal may be brought to trial by the appellant or the drainage authority after notifying the other party at least ten days before the trial date.\nThe appeal must be tried by the court without a jury. The court shall examine the entire drainage proceeding and related matters and receive evidence to determine whether the findings made by the board can be sustained. At the trial the findings made by the board are prima facie evidence of the matters stated in the findings, and the board's order is prima facie reasonable. If the court finds that the order appealed is lawful and reasonable, it shall be affirmed. If the court finds that the order appealed is arbitrary, unlawful, or not supported by the evidence, it shall make an order, justified by the court record, to take the place of the appealed order, or remand the order to the board for further proceedings. After the appeal has been determined by the court, the board shall proceed in conformity with the court order.\nIf the order establishing a drainage project is appealed, the trial of appeals related to benefits or damages in the drainage proceeding must be stayed until the establishment appeal is determined. If the order establishing the drainage project is affirmed, appeals related to benefits and damages must then be tried.\nIf an order refusing to establish a drainage project is appealed, and the court, by order, establishes the drainage project, the auditor shall give notice by publication of the filed order. The notice is sufficient if it refers to the drainage project or system by number or other descriptive designation, states the meaning of the order, and states the date the court order was filed. A person may appeal the establishment order to the district court as provided in this section.\nA party aggrieved by a final order or judgment rendered on appeal to the district court may appeal as in other civil cases. The appeal must be made and perfected within 30 days after the filing of the order or entry of judgment.",
	"repealed": false
}