{
	"id": "268B.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.26",
	"title": "268B.26 NOTICE REQUIREMENTS.",
	"text": "(a) Each employer must post in a conspicuous place on each of its premises a workplace notice prepared by the commissioner providing notice of benefits available under this chapter. The required workplace notice must be in English and each language other than English which is the primary language of five or more employees or independent contractors of that workplace, if such notice is available from the department.\n(b) Each employer must issue to each employee not more than 30 days from the beginning date of the employee's employment, or 30 days before premium collection begins, whichever is later, the following written information provided by the department in the primary language of the employee:\n(1) an explanation of the availability of family and medical leave benefits provided under this chapter, including rights to reinstatement and continuation of health insurance;\n(2) the amount of premium deductions made by the employer under this chapter;\n(3) the employer's premium amount and obligations under this chapter;\n(4) the name and mailing address of the employer;\n(5) the identification number assigned to the employer by the department;\n(6) instructions on how to file a claim for family and medical leave benefits;\n(7) the mailing address, email address, and telephone number of the department; and\n(8) any other information required by the department.\nDelivery is made when an employee provides written or electronic acknowledgment of receipt of the information. In cases where an employee refuses to acknowledge receipt, an employer must be able to demonstrate the way the employee had been notified.\n(c) An employer that fails to comply with this section may be issued, for a first violation, a civil penalty of $50 per employee, and for each subsequent violation, a civil penalty of $300 per employee. The employer shall have the burden of demonstrating compliance with this section.\n(d) Employer notice to an employee under this section may be provided in paper or electronic format. For notice provided in electronic format only, the employer must provide employee access to an employer-owned computer during an employee's regular working hours to review and print required notices.\n(e) The department shall prepare a uniform employee notice form for employers to use that provides the notice information required under this section. The commissioner shall prepare the uniform employee notice in the five most common languages spoken in Minnesota.\n(f) Each employer who employs or intends to employ seasonal employees as defined in section 268B.01, subdivision 35, must issue to each seasonal employee a notice that the employee is not eligible to receive paid family and medical leave benefits while the employee is so employed. The notice must be provided at the time an employment offer is made, or within 30 days of November 1, 2025, for the employer's existing seasonal employees, and be in a form provided by the department. Delivery is made when an employee provides written or electronic acknowledgment of receipt of the information, or signs a statement indicating the employee's refusal to sign such acknowledgment.",
	"repealed": false
}