{
	"id": "165.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/165.15",
	"title": "165.15 STILLWATER LIFT BRIDGE ENDOWMENT ACCOUNT.",
	"text": "The Stillwater lift bridge endowment account is established in the state treasury. The account may consist of appropriations made by the state of Minnesota or Wisconsin and may include federal funds. The account may also receive private contributions, gifts, or grants under section 16A.013. Any interest or profit accruing from investment of these sums is credited to the account.\n(a) Income derived from the investment of principal in the account may be used by the commissioner of transportation for operations and routine maintenance of the Stillwater lift bridge, including bridge safety inspections and reactive repairs. No money from this account may be used for any purposes except those described in this section, and no money from this account may be transferred to any other account in the state treasury without specific legislative authorization. Any money transferred from the trunk highway fund may only be used for trunk highway purposes. For the purposes of this section:\n(1) \"Income\" is the amount of interest on debt securities and dividends on equity securities. Any gains or losses from the sale of securities must be added to the principal of the account.\n(2) \"Routine maintenance\" means activities that are predictable and repetitive, but not activities that would constitute major repairs or rehabilitation.\n(b) Investment management fees incurred by the State Board of Investment are eligible expenses for reimbursement from the account.\n(c) The commissioner of transportation has authority to approve or deny expenditures of funds in the account.\nIncome derived from the investment of principal in the account is appropriated annually to the commissioner of transportation for the purposes described in this section.\nThe commissioner of transportation shall ensure that the account complies with the regulations in OMB circulars A87, Cost Principles for State, Local and Indian Tribal Governments, and A122, Cost Principles for Non-Profit Organizations, of the United States Office of Management and Budget (OMB).\nThe State Board of Investment, in consultation with the commissioner of transportation, shall invest money in the account under section 11A.24.\nIf the commissioner determines, in consultation with the State Historic Preservation Office, that it is necessary to demolish the Stillwater lift bridge, the principal in the account may be spent to pay for demolition of the bridge, and is appropriated to the commissioner of transportation only for that purpose, except that only funds originally contributed by the state or federal government can be used to pay for demolition. Any money remaining in the account after demolition must be used to pay for the preservation of other historic bridges in consultation with the State Historic Preservation Office.\nThe account is subject to audit by the legislative auditor.\nMS 2016 [Repealed, 1Sp2017 c 3 art 3 s 144]",
	"repealed": false
}