{
	"id": "524.6-307",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.6-307",
	"title": "524.6-307 DEATH OF OWNER; CREDITORS.",
	"text": "On death of a sole owner or the last to die of all multiple owners, ownership of securities registered in beneficiary form passes to the beneficiary or beneficiaries who survive all owners. On proof of death of all owners and compliance with any applicable requirements of the registering entity, a security registered in beneficiary form may be reregistered in the name of the beneficiary or beneficiaries who survive the death of all owners. Until division of the security after the death of all owners, multiple beneficiaries surviving the death of all owners hold their interests as tenants in common. If no beneficiary survives the death of all owners, the security belongs to the estate of the deceased sole owner or the estate of the last to die of all multiple owners.\nA registration in beneficiary form is not effective against an estate of a deceased sole owner or a deceased last to die of multiple owners to transfer to a beneficiary or beneficiaries sums needed to pay debts, taxes, and expenses of administration, including statutory allowances to the surviving spouse, minor children, and dependent children, if other assets of the estate are insufficient. A TOD beneficiary in whose name a security is registered after the death of the owner is liable to account to the deceased owner's personal representative for securities so registered or their proceeds to the extent necessary to discharge such claims and charges remaining unpaid after the application of the assets of the decedent's estate. A proceeding to assert this liability may not be commenced unless the personal representative has received a written demand by a surviving spouse, a creditor, or one acting for a minor dependent child of the decedent, and a proceeding may not be commenced later than two years following the death of the decedent. A beneficiary against whom the proceeding is brought may elect to transfer to the personal representative the security registered in the name of the beneficiary after the death of the deceased owner if the beneficiary still owns the security, or the net proceeds received by the beneficiary upon disposition of the security by the beneficiary, and that transfer fully discharges the beneficiary from all liability under this subdivision. Amounts or securities recovered by the personal representative must be administered as part of the deceased owner's estate.\nThis subdivision does not affect the right of a registering entity to register a security in the name of the beneficiary, or make a registering entity liable to the estate of a deceased owner, except for a reregistration after a registering entity has received written notice from any claimant to an interest in the security objecting to implementation of a registration in beneficiary form.",
	"repealed": false
}