{
	"id": "216B.2411",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2411",
	"title": "216B.2411 DISTRIBUTED ENERGY RESOURCES.",
	"text": "(a) Any municipality or rural electric association providing electric service and subject to section 216B.241 may, and each public utility may, use five percent of the total amount to be spent on energy conservation improvements under section 216B.241, on:\n(1) projects in Minnesota to construct an electric generating facility that utilizes eligible renewable energy sources as defined in subdivision 2, such as methane or other combustible gases derived from the processing of plant or animal wastes, biomass fuels such as short-rotation woody or fibrous agricultural crops, or other renewable fuel, as its primary fuel source;\n(2) projects in Minnesota to install a distributed generation facility of ten megawatts or less of interconnected capacity that is fueled by natural gas, renewable fuels, or another similarly clean fuel; or\n(3) projects in Minnesota to install a qualifying solar energy project as defined in subdivision 2.\n(b) A municipality, rural electric association, or public utility that offers a program to customers to promote installing qualifying solar energy projects may request authority from the commissioner to exceed the five percent limit in paragraph (a), but not to exceed ten percent, to meet customer demand for installation of qualifying solar energy projects. In considering this request, the commissioner shall consider customer interest in qualifying solar energy and the impact on other customers. A municipality, rural electric association, or public utility may not participate in a qualifying solar energy project on a property unless it is provided evidence that all reasonable cost-effective conservation investments have previously been made to the property.\n(c) For a municipality, rural electric association, or public utility, projects under this section must be considered energy conservation improvements as defined in section 216B.241.\n(a) For the purposes of this section, the terms defined in this subdivision and section 216B.241, subdivision 1, have the meanings given them.\n(b) \"Eligible renewable energy sources\" means fuels and technologies to generate electricity through the use of any of the resources listed in section 216B.1691, subdivision 1, paragraph (c), except that the incineration of wastewater sludge is not an eligible renewable energy source, \"biomass\" has the meaning provided under paragraph (c), and \"solar\" must be from a qualified solar energy project as defined in paragraph (d).\n(c) \"Biomass\" includes:\n(1) methane or other combustible gases derived from the processing of plant or animal material;\n(2) alternative fuels derived from soybean and other agricultural plant oils or animal fats;\n(3) combustion of barley hulls, corn, soy-based products, or other agricultural products;\n(4) wood residue from the wood products industry in Minnesota or other wood products such as short-rotation woody or fibrous agricultural crops;\n(5) landfill gas;\n(6) the predominantly organic components of wastewater effluent, sludge, or related by-products from publicly owned treatment works; and\n(7) mixed municipal solid waste, and refuse-derived fuel from mixed municipal solid waste.\n(d) \"Qualifying solar energy project\" means a qualifying solar thermal project or qualifying solar electric project.\n(e) \"Qualifying solar thermal project\" means a flat plate or evacuated tube that meets the requirements of section 216C.25 with a fixed orientation that collects the sun's radiant energy and transfers it to a storage medium for distribution as energy to heat or cool air or water, but does not include equipment used to heat water at a residential property (1) for domestic use if less than one-half of the energy used for that purpose is derived from the sun or (2) for use in a hot tub or swimming pool.\n(f) \"Qualifying solar electric project\" means:\n(1) solar electric equipment that: (i) meets the requirements of section 216C.25; (ii) has a peak generating capacity of 100 kilowatts or less; and (iii) is used to generate electricity for use in a residential, commercial, or publicly owned property or facility; and\n(2) if applicable, equipment that is used to store the electricity generated by a qualified solar electric project under clause (1) and that is located proximate to the property or facility using the electricity.\n(g) \"Residential property\" means the principal residence of a homeowner at the time the solar equipment is placed in service.\n(a) Electricity generated by a facility constructed with funds provided under this section and using an eligible renewable energy source may be counted toward the renewable energy objectives in section 216B.1691, subject to the provisions of that section, except as provided in paragraph (c).\n(b) Two or more entities may pool resources under this section to provide assistance jointly to proposed eligible renewable energy projects. The entities shall negotiate and agree among themselves for allocation of benefits associated with a project, such as the ability to count energy generated by a project toward a utility's renewable energy objectives under section 216B.1691, except as provided in paragraph (c). The entities shall provide a summary of the allocation of benefits to the commissioner. A utility may spend funds under this section for projects in Minnesota that are outside the service territory of the utility.\n(c) Electricity generated by a solar photovoltaic device constructed with funds provided under this section may be counted toward a public utility's solar energy standard under section 216B.1691, subdivision 2f.",
	"repealed": false
}