{
	"id": "144.148",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.148",
	"title": "144.148 RURAL HOSPITAL CAPITAL IMPROVEMENT GRANT PROGRAM.",
	"text": "(a) For purposes of this section, the following definitions apply.\n(b) \"Eligible rural hospital\" means any nonfederal, general acute care hospital that:\n(1) is either located in a rural area, as defined in the federal Medicare regulations, Code of Federal Regulations, title 42, section 405.1041, or located in a community with a population of less than 15,000, according to United States Census Bureau statistics, outside the seven-county metropolitan area;\n(2) has 50 or fewer beds; and\n(3) is not for profit.\n(c) \"Eligible project\" means a modernization project to update, remodel, or replace aging hospital facilities and equipment necessary to maintain the operations of a hospital, including establishing an electronic health records system.\n(a) The commissioner of health shall award rural hospital capital improvement grants to eligible rural hospitals. Except as provided in paragraph (b), a grant shall not exceed $500,000 per hospital. Prior to the receipt of any grant, the hospital must certify to the commissioner that at least one-quarter of the grant amount, which may include in-kind services, is available for the same purposes from nonstate resources. Notwithstanding any law to the contrary, funds awarded to grantees in a grant agreement do not lapse until expended by the grantee.\n(b) A grant shall not exceed $1,500,000 per eligible rural hospital that also satisfies the following criteria:\n(1) is the only hospital in a county;\n(2) has 25 or fewer licensed hospital beds with a net hospital operating margin not greater than an average of two percent over the three fiscal years prior to application;\n(3) is located in a medically underserved community (MUC) or a health professional shortage area (HPSA);\n(4) is located near a migrant worker employment site and regularly treats significant numbers of migrant workers and their families; and\n(5) has not previously received a grant under this section prior to July 1, 1999.\nEligible hospitals seeking a grant shall apply to the commissioner. Applications must include a description of the problem that the proposed project will address, a description of the project including construction and remodeling drawings or specifications, sources of funds for the project, uses of funds for the project, the results expected, and a plan to maintain or operate any facility or equipment included in the project. The applicant must describe achievable objectives, a timetable, and roles and capabilities of responsible individuals and organization. Applicants must submit to the commissioner evidence that competitive bidding was used to select contractors for the project.\nThe commissioner shall review each application to determine whether or not the hospital's application is complete and whether the hospital and the project are eligible for a grant. In evaluating applications, the commissioner shall score each application on a 100 point scale, assigning: a maximum of 40 points for an applicant's clarity and thoroughness in describing the problem and the project; a maximum of 40 points for the extent to which the applicant has demonstrated that it has made adequate provisions to assure proper and efficient operation of the facility once the project is completed; and a maximum of 20 points for the extent to which the proposed project is consistent with the hospital's capital improvement plan or strategic plan. The commissioner may also take into account other relevant factors. During application review, the commissioner may request additional information about a proposed project, including information on project cost. Failure to provide the information requested disqualifies an applicant.\nThe commissioner shall determine the amount of a grant to be given to an eligible rural hospital based on the relative score of each eligible hospital's application and the funds available to the commissioner. The grant shall be used to update, remodel, or replace aging facilities and equipment necessary to maintain the operations of the hospital. The commissioner may collect, from the hospitals receiving grants, any information necessary to evaluate the program.\n[Repealed by amendment, 1999 c 245 art 2 s 21]\n[Repealed by amendment, 1999 c 245 art 2 s 21]\n[Repealed, 1Sp2001 c 9 art 1 s 62]\nThe commissioner must regard grants or loans awarded to eligible rural hospitals before August 1, 1999, as grants subject to the conditions of this section and not subject to repayment as loans under Minnesota Statutes 1998, section 144.148.",
	"repealed": false
}