{
	"id": "609.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.33",
	"title": "609.33 DISORDERLY HOUSE.",
	"text": "For the purpose of this section, \"disorderly house\" means a building, dwelling, place, establishment, or premises in which actions or conduct habitually occur in violation of laws relating to:\n(1) the sale of intoxicating liquor or 3.2 percent malt liquor;\n(2) gambling;\n(3) prostitution as defined in section 609.321, subdivision 9, or acts relating to prostitution; or\n(4) the sale or possession of controlled substances as defined in section 152.01, subdivision 4.\nNo person may own, lease, operate, manage, maintain, or conduct a disorderly house, or invite or attempt to invite others to visit or remain in the disorderly house. A violation of this subdivision is a gross misdemeanor.\n(a) If a person is convicted of a first violation of subdivision 2, in addition to any sentence of imprisonment authorized by subdivision 2 which the court may impose, the court shall impose a fine of not less than $300 nor more than $3,000.\n(b) If a person is convicted of a second violation of subdivision 2, in addition to any sentence of imprisonment authorized by subdivision 2 which the court may impose, the court shall impose a fine of not less than $500 nor more than $3,000.\n(c) If a person is convicted of a third or subsequent violation of subdivision 2, in addition to any sentence of imprisonment authorized by subdivision 2 which the court may impose, the court shall impose a fine of not less than $1,000 nor more than $3,000.\nEvidence of unlawful sales of intoxicating liquor or 3.2 percent malt liquor, of unlawful possession or sale of controlled substances, of prostitution or acts relating to prostitution, or of gambling or acts relating to gambling, is prima facie evidence of the existence of a disorderly house. Evidence of sales of intoxicating liquor or 3.2 percent malt liquor between the hours of 1:00 a.m. and 8:00 a.m., while a person is within a disorderly house, is prima facie evidence that the person knew it to be a disorderly house.\nSubdivisions 1 to 4 do not prohibit or restrict a local governmental unit from imposing more restrictive provisions.\nWhen a person is charged under this section with owning or leasing a disorderly house, the court may require as a condition of pretrial release that the defendant bring an eviction action against a lessee who has violated the covenant not to allow drugs established by section 504B.171.",
	"repealed": false
}