{
	"id": "176.184",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.184",
	"title": "176.184 INSPECTIONS; ENFORCEMENT.",
	"text": "The commissioner of labor and industry, in order to carry out the purpose of section 176.181, may request satisfactory proof of authority to self-insure workers' compensation liability or satisfactory proof of insurance coverage for workers' compensation liability. If an employer does not provide satisfactory proof as requested within seven working days of the mailing of the request, the commissioner may proceed in accordance with the provisions of subdivisions 2 to 7.\nIn order to carry out the purposes of section 176.181, the commissioner, upon presenting appropriate credentials to the owner, operator, or agent in charge, is authorized to enter without delay and at reasonable times any place of employment and to inspect and investigate during regular working hours and at other reasonable times, within reasonable limits, and in a reasonable manner, any records pertaining to that employer's workers' compensation insurance policy, number of employees, documents governing conditions and benefits of employment, contracts with employees and their authorized representatives, and any other documents which may be relevant to the enforcement of section 176.181 and to question privately any employer, owner, operator, agent, or employee with respect to matters relevant to the enforcement of section 176.181.\nIn making inspections and investigations under this chapter, the commissioner shall have the power to administer oaths, certify official acts, take and cause to be taken depositions of witnesses, issue subpoenas, and compel the attendance of witnesses and production of papers, books, documents, records, and testimony. In case of failure of any person to comply with any subpoena lawfully issued, or on the refusal of any witness to produce evidence or to testify to any matter regarding which the person may be lawfully interrogated, the district court shall, upon application of the commissioner, compel obedience in proceedings for contempt, as in the case of disobedience of the requirements of a subpoena issued by the court or a refusal to testify.\nA representative of the employer and a representative authorized by employees shall be given an opportunity to participate in any conference or discussion held prior to, during, or after any inspection. Where there is no authorized employee representative, the commissioner shall consult with a reasonable number of employees. No employee as a consequence of aiding an inspection shall lose any privilege or payment that the employee would otherwise earn.\n(a) Any employee or representative of an employee who believes that their employer is uninsured against workers' compensation liability, may request an inspection by giving notice to the commissioner of the belief and grounds for the belief. Any notice shall be written, shall set forth with reasonable particularity the grounds for the notice, and shall be signed by the employee or representative of employees. A copy of the notice shall be provided the employer, representative, or agent no later than the time of inspection, except that, upon the request of a person giving the notice, the employee's name and the names of individual employees referred to in the notice shall not appear in the copy or on any record published, released, or made available. If upon receipt of the notification the commissioner determines that reasonable grounds exist to believe that the employer is uninsured against workers' compensation liability, the commissioner shall make an inspection in accordance with this section as soon as practicable. If the commissioner determines that there are not reasonable grounds to believe that a violation exists, the commissioner shall so notify the employee or representative of employees in writing. Upon notification, the employee or the employee representative may request the commissioner to reconsider the determination. Upon receiving the request, the commissioner shall review the determination.\n(b) The commissioner, upon receipt of a report of violation of the mandatory insurance provisions of section 176.181 or 176.185 verified by review of the department's insurance registration records and other relevant information, shall initiate a preliminary investigation to determine if reasonable grounds exist to believe that the employer is uninsured against workers' compensation liability, and upon certification of reasonable belief that the employer is uninsured the commissioner shall make an inspection in accordance with paragraph (a).\nUpon the refusal of an owner, operator, or agent in charge to permit entry as specified in this section, the commissioner may apply for an order in the district court in the county which entry was refused, to compel the employer to permit the commissioner to enter and inspect the place of employment.\nAdvance notice may not be authorized by the commissioner except:\n(1) in circumstances where the inspection can most effectively be conducted after regular business hours or where special preparations are necessary for an inspection;\n(2) where necessary to assure the presence of representatives of the employer and employees or the appropriate personnel needed to aid in the inspection; and\n(3) in other circumstances where the commissioner determines that the giving of advance notice would enhance the probability of an effective and thorough inspection.\nWhen advance notice is given to an employer, notice shall also be given by the commissioner to the authorized representative of employees if the identity of the representative is known to the employer.",
	"repealed": false
}