{
	"id": "154.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/154.07",
	"title": "154.07 BARBER SCHOOLS; REQUIREMENTS.",
	"text": "No barber school shall be approved by the board unless it requires, as a prerequisite to admission, ten grades of an approved school or its equivalent, as determined by educational transcript, high school diploma, high school equivalency certificate, or an examination conducted by the commissioner of education, which shall issue a certificate that the student has passed the required examination, and unless it requires, as a prerequisite to graduation, a course of instruction of at least 1,500 hours of not more than ten hours of schooling in any one working day. The course of instruction must include the following subjects: scientific fundamentals for barbering; hygiene; practical study of the hair, skin, muscles, and nerves; structure of the head, face, and neck; elementary chemistry relating to sanitation; disinfection; sterilization and antiseptics; diseases of the skin, hair, and glands; massaging and manipulating the muscles of the face and neck; haircutting; shaving; trimming the beard; bleaching, tinting and dyeing the hair; and the chemical waving and straightening of hair.\n[Repealed, 1991 c 282 s 23]\nIt is permissible for barber schools to make a reasonable charge for materials used and services rendered by students for work done in the schools by students.\nThere must be one registered instructor of barbering for every 20 students in attendance at the same time. Instruction must not be performed by persons not possessing a certificate of registration as an instructor of barbering or a temporary permit as an instructor of barbering.\nEach barber school must be conducted and operated in one building, or in connecting buildings, and a barber school must not have any department or branch in a building completely separated or removed from the remainder of the barber school.\nAny person may own a barber school provided the person first secures from the board an annual certificate of registration as a barber school, keeps it prominently displayed, and before commencing business:\n(1) files with the secretary of state a bond to the state approved by the attorney general in the sum of $25,000, conditioned upon the faithful compliance of the barber school with sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28, and to pay all judgments that may be obtained against the school, or the owners thereof, on account of fraud, misrepresentation, or deceit practiced by them or their agents; and\n(2) keeps prominently displayed on the exterior a substantial sign indicating that the establishment is a barber school.\nAll barber schools upon receiving students shall immediately apply to the board for student permits upon forms for that purpose furnished by the board.\nAll barber schools shall be operated by a barber with no less than six years of continuous experience as a registered barber in this state or another state or jurisdiction as determined by the board. When a person who owns a barber school does not meet the requirements of this section to operate a barber school, the owner shall notify the board in writing and under oath of the identity of the person designated to operate the barber school and shall notify the board of any change of operator by telephone within 24 hours of such change, exclusive of Saturdays, Sundays, and legal holidays, and shall notify the board in writing and under oath within 72 hours of such change.\nA public technical college or a state institution may operate a barber school provided it has in its employment a qualified instructor holding a current certificate of registration as a barber instructor and provided that it secures from the board an annual certificate of registration and does so in accordance with sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 and the rules of the board for barber schools but without the requirement to file a performance bond with the secretary of state.",
	"repealed": false
}