{
	"id": "256S.205",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.205",
	"title": "256S.205 CUSTOMIZED LIVING SERVICES; DISPROPORTIONATE SHARE RATE ADJUSTMENTS.",
	"text": "(a) For the purposes of this section, the terms in this subdivision have the meanings given.\n(b) \"Application year\" means a year in which a facility submits an application for designation as a disproportionate share facility.\n(c) \"Customized living resident\" means a resident of a facility who is receiving either 24-hour customized living services or customized living services authorized under the elderly waiver, the brain injury waiver, or the community access for disability inclusion waiver.\n(d) \"Disproportionate share facility\" means a facility designated by the commissioner under subdivision 4.\n(e) \"Facility\" means either an assisted living facility licensed under chapter 144G or a setting that is exempt from assisted living licensure under section 144G.08, subdivision 7, clauses (10) to (13).\n(f) \"Rate year\" means January 1 to December 31 of the year following an application year.\n(a) Effective through September 30, 2023, a facility may apply to the commissioner for designation as a disproportionate share facility. Applications must be submitted annually between September 1 and September 30. The applying facility must apply in a manner determined by the commissioner. The applying facility must document each of the following on the application:\n(1) the number of customized living residents in the facility on September 1 of the application year, broken out by specific waiver program; and\n(2) the total number of people residing in the facility on September 1 of the application year.\n(b) Effective October 1, 2023, the commissioner must not process any new applications for disproportionate share facilities after the September 1 through September 30, 2023, application period.\n(c) A facility that receives rate floor payments in rate year 2024 may submit an application under this subdivision to maintain its designation as a disproportionate share facility for rate year 2025.\n(a) Effective through September 30, 2023, only facilities satisfying all of the following conditions on September 1 of the application year are eligible for designation as a disproportionate share facility:\n(1) at least 83.5 percent of the residents of the facility are customized living residents; and\n(2) at least 70 percent of the customized living residents are elderly waiver participants.\n(b) A facility determined eligible for the disproportionate share rate adjustment in application year 2023 and receiving payments in rate year 2024 is eligible to receive payments in rate year 2025 only if the commissioner determines that the facility continues to meet the eligibility requirements under this subdivision as determined by the application process under subdivision 2, paragraph (c).\n(a) By October 15 of each application year, the commissioner must designate as a disproportionate share facility a facility that complies with the application requirements of subdivision 2 and meets the eligibility criteria of subdivision 3.\n(b) An annual designation is effective for one rate year.\n(a) Effective through December 31, 2025, notwithstanding the 24-hour customized living monthly service rate limits under section 256S.202, subdivision 2, and the component service rates established under section 256S.201, subdivision 4, the commissioner must establish a rate floor equal to $141 per resident per day for 24-hour customized living services provided to an elderly waiver participant in a designated disproportionate share facility.\n(b) The commissioner must apply the rate floor to the services described in paragraph (a) provided during the rate year.\nThe value of the rate adjustment under this section must not be included in an elderly waiver client's monthly case mix budget cap.\nThis section expires January 1, 2026.",
	"repealed": false
}