{
	"id": "94.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/94.52",
	"title": "94.52 EXPENDITURE OF STATE'S PERCENTAGE OF PROCEEDS OF SALE OF LAND TO UNITED STATES.",
	"text": "All sums heretofore or that may hereafter be received from the United States government, on account of an Act of Congress approved May 23, 1908 (35 Stat. 260), or any amendments thereof hereafter enacted shall be expended as follows:\nOne-half for public schools and the remainder for public roads in the counties in which the national forests are situated; provided, that any county coming within the provisions of said act of Congress is hereby authorized to borrow money from the federal government or any of its agencies and to use moneys received pursuant to the provisions of said act of Congress or amendments thereto for the purpose of repaying any loan or loans made to such county by the federal government or any of its agencies. In the case of the Superior National Forest, the counties of Cook, Lake, Koochiching, and St. Louis shall share in the distribution of the sum received from that source in the same proportion that the federally owned lands in each county which are within the boundaries of said forest bear to the total number of acres of federally owned lands in said forest area. In the case of the Chippewa National Forest, the counties of Cass, Itasca, and Beltrami shall share in the distribution of the sum received from that source in the same proportion that the federally owned lands in each county, which are within the boundaries of said forest bear to the total number of acres of federally owned lands in said forest area.\n(a) Any distribution made by the state of moneys received from the United States government on account of said act of Congress is hereby legalized and made valid and effective to the same extent as though the method of distribution used was provided for by the legislative enactment prior to the distribution thereof.\n(b) There is hereby appropriated from such moneys in the state treasury not otherwise appropriated to the public schools or the counties as provided by this section, an amount sufficient to make the necessary payments as are provided herein.",
	"repealed": false
}