{
	"id": "124D.995",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.995",
	"title": "124D.995 SCHOOL UNEMPLOYMENT AID.",
	"text": "An account is established in the special revenue fund known as the school unemployment aid account.\nFunds appropriated for school unemployment aid must be transferred to the school unemployment aid account in the special revenue fund.\n(a) Subject to the availability of funds, money in the account is annually appropriated to the commissioner of education to reimburse school districts; charter schools; intermediate school districts and cooperative units under section 123A.24, subdivision 2; the Perpich Center for Arts Education; and the Minnesota State Academies for costs associated with providing unemployment benefits to school employees under section 268.085, subdivision 7, paragraph (b).\n(b) The Perpich Center for Arts Education and the Minnesota State Academies may only apply to the commissioner for reimbursement of unemployment insurance amounts in excess of the amounts specifically identified in their annual agency appropriations.\n(c) If the amount in the account is insufficient, the commissioner must proportionately reduce the aid payment to each recipient. Notwithstanding section 127A.45, subdivision 3, aid payments must be paid 90 percent in the current year and ten percent in the following year on a schedule determined by the commissioner.\nUp to $275,000 is annually appropriated from the account to the commissioner of education for costs associated with administering and monitoring the program under this section. This amount is in addition to any other amount specifically appropriated for this purpose.\nThe commissioner of education must reimburse school districts, charter schools, intermediate school districts and other cooperative units, the Perpich Center for Arts Education, and the Minnesota State Academies in the form and manner specified by the commissioner. The commissioner may establish procedures to ensure that any costs reimbursed under this section are excluded from other school revenue calculations.\nThis section expires on June 30, 2027, and any balance remaining in the account is canceled to the general fund.",
	"repealed": false
}