{
	"id": "41A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.02",
	"title": "41A.02 DEFINITIONS; ACTIONS BY THE STATE.",
	"text": "The definition of each term given in this section applies whenever the term is used in sections 41A.01 to 41A.09.\n\"Agricultural resource\" means any organic matter which is available on a renewable basis from agricultural processes, including agricultural crop, animal, and wood production, waste, and residues.\n\"Minnesota Agricultural and Economic Development Board\" or \"board\" consists of the commissioner of management and budget as chair, the commissioner of agriculture, the commissioner of employment and economic development, the commissioner of the Pollution Control Agency, the president of Enterprise Minnesota, Inc. or the president's designee, and two public members with experience in finance, appointed by Enterprise Minnesota, Inc. The membership terms, compensation, removal, and filling of vacancies of public members of the board are as provided in section 15.0575.\n\"Minnesota agricultural and economic development account\" or \"development account\" means the account created by section 41A.05.\n\"Agricultural resource loan guaranty program\" or \"program\" includes all projects, loan guaranties and bonds approved or issued pursuant to this chapter.\n\"Agricultural resource project\" or \"project\" means (1) any facility, or portion of a facility, located in the state which is operated or to be operated primarily for the production from agricultural resources of marketable products, (2) buildings, equipment, and land used for the commercial production of turkeys or turkey products, (3) a facility or portion of a facility used for the commercial production of fish or of products made from commercially produced fish or native rough fish, as defined in section 97A.015, subdivision 32c, or common carp that are not commercially produced, or (4) real or personal property used or useful in connection with a revenue-producing enterprise, or a combination of two or more revenue-producing enterprises engaged in a business, that is not used for the production of livestock, other than poultry, or for the production of crops, plants, or milk. The land in clause (2) is limited to land on which buildings and equipment are situated and immediately surrounding land used for storage, waste disposal, or other functions directly related to the commercial production of turkeys or turkey products at that project site. The land in clause (2) does not include land used for the growing or raising of crops or the grazing of livestock other than poultry. A project includes a facility or portion of a facility for mixing or producing substances to be mixed with other substances for use as a fuel or as a substitute for petroleum or petrochemical feedstocks.\n\"Applicant\" means any borrower or lender acting on behalf of a borrower or any rural development finance authority organized, or any county exercising the powers of such an authority, pursuant to chapter 362A, which applies to the state for approval of a guaranty of a loan to a borrower or issuance of bonds for a project.\n\"Bonds\" means bonds, notes, or other obligations issued by the board pursuant to this chapter.\n\"Borrower\" means any private individual, company, cooperative, partnership, corporation, association, consortium, or other entity organized for a common business purpose, which is obligated or to be obligated to pay a guaranteed loan or receives a loan of bond proceeds.\n\"Construction\" means construction of a new agricultural resource project, or conversion of a facility to such a project, or expansion or improvement of a project to increase its capacity or efficiency. \"Construction\" includes acquisition of land, easements, buildings, structures, improvements, and equipment and machinery for use in or at the site of a project or on easements adjacent to the project site.\n\"Cost\" of a project means the sum of all obligations paid or to be paid or incurred by the borrower which are reasonably required for the construction and completion of the project, including but not limited to (i) surveys, estimates, plans, specifications, supervision of construction, and other engineering and architectural service; (ii) payments under construction contracts and for payment and performance bonds; (iii) purchase and installation of equipment and machinery; (iv) recording, filing, permit, legal, financial, underwriting, placement, commitment, publication, advertising, and other charges, fees, and expenses incurred for establishing title, mortgage liens, and security interests with respect to the project, for securing permits for construction and approval of the loan guaranty, for establishing the terms of the loan and underlying security agreements, and for offering, selling, or placing with investors and printing and delivering the obligations evidencing the loan; and (v) interest, discount, fees, and expenses accruing with respect to the loan, and taxes and other government charges payable with respect to the project, during construction.\n\"Lender\" means a corporation or any investment or commercial banking institution, savings and loan institution, insurance company, investment company, other financial institution or institutional investor making, purchasing, or participating in a loan or any part of a loan, or a public entity authorized to make agricultural loans.\n\"Loan\" means any obligation to repay money borrowed to finance the construction of a project or to refund or refinance such an obligation.\n\"Loan agreement\" means a written agreement or agreements setting forth the terms and conditions of the obligation of the borrower to the lender and the pledges and covenants made and mortgage lien and other security interests granted for the security of the obligations, including a mortgage, note, indenture, or other agreement however designated.\n\"Loan guaranty\" means a written agreement executed on behalf of the state that guarantees, in accordance with the terms and conditions contained in the agreement or in a loan agreement, the payment of sums of money owing by a borrower to a lender.\n\"State\" actions contemplated in sections 41A.01 to 41A.06 may be taken on behalf of the state by resolutions of the Minnesota Agricultural and Economic Development Board, subject to approval by the governor if required by the governor, or by a member of the board or another state officer in the department headed by the member, pursuant to authority delegated by resolution of the board. Resolutions of the board are effective when approved by the vote of a majority of its members.\n\"Eligible small business\" means:\n(1) an enterprise determined by the board to constitute a small business concern as defined in regulations of the United States Small Business Administration under United States Code, title 15, sections 631 to 647; or\n(2) an enterprise eligible to receive assistance under section 41A.036.\n\"Small business development loan\" means a loan to a business that is an \"eligible small business\" to finance:\n(1) capital expenditures on an interim or long-term basis to acquire or improve land, acquire, construct, rehabilitate, remove, or improve buildings, or to acquire and install fixtures and equipment useful to conduct a small business, including facilities of a capital nature useful or suitable for a business engaged in an enterprise promoting employment including, without limitation, facilities included within the meaning of the term \"project\" as defined in sections 469.153, subdivision 2, and 469.155, subdivision 4;\n(2) working capital; and\n(3) intangible property, such as any patent, copyright, formula, process, design, pattern, know-how, format, or other similar item.",
	"repealed": false
}