{
	"id": "342.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.42",
	"title": "342.42 CANNABIS DELIVERY SERVICE OPERATIONS.",
	"text": "Prior to completing a delivery, a cannabis delivery service shall verify that the customer is at least 21 years of age or is enrolled in the registry program. Section 342.27, subdivision 4, applies to the verification of a customer's age. Registry verification issued by the Division of Medical Cannabis may be considered evidence that the person is enrolled in the registry program.\nThe office by rule shall establish record-keeping requirements for a cannabis delivery service, including but not limited to proof of delivery to individuals who are at least 21 years of age or enrolled in the registry program.\nThe office by rule shall establish limits on the amount of cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products that a cannabis delivery service may transport.\nReceipt of cannabis flower and cannabis products by the cannabis delivery service and a delivery to a customer must be recorded in the statewide monitoring system within the time established by rule.\nCannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products must be transported in a locked, safe, and secure storage compartment that is part of the cannabis delivery service vehicle or in a locked storage container that has a separate key or combination pad. Cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products may not be visible from outside the cannabis delivery service vehicle.\nNo cannabis delivery service vehicle or trailer may contain an image depicting the types of items being transported, including but not limited to an image depicting a cannabis or hemp leaf, or a name suggesting that the cannabis delivery service vehicle is used for transporting cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products.\nOnly a cannabis worker employed by or contracted with the cannabis delivery service and who is at least 21 years of age may transport cannabis flower, cannabis products, lower-potency hemp edibles, and hemp-derived consumer products. All passengers in a cannabis delivery service vehicle must be cannabis workers employed by or contracted with the cannabis delivery service.\nAny cannabis delivery service vehicle is subject to inspection at any time.",
	"repealed": false
}