{
	"id": "256.995",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.995",
	"title": "256.995 SCHOOL-LINKED SERVICES FOR AT-RISK CHILDREN AND YOUTH.",
	"text": "In order to enhance the delivery of needed services to at-risk children and youth and maximize federal funds available for that purpose, the commissioners of human services and education shall design a statewide program of collaboration between providers of health and social services for children and local school districts, to be financed, to the greatest extent possible, from federal sources. The commissioners of health and public safety shall assist the commissioners of human services and education in designing the program.\nThe program shall target at-risk children and youth, defined as individuals, whether or not enrolled in school, who are under 21 years of age and who:\n(1) are school dropouts;\n(2) have failed in school;\n(3) have become pregnant;\n(4) are economically disadvantaged;\n(5) are children of drug or alcohol abusers;\n(6) are victims of physical, sexual, or psychological abuse;\n(7) have committed a violent or delinquent act;\n(8) have experienced mental health problems;\n(9) have attempted suicide;\n(10) have experienced long-term physical pain due to injury;\n(11) are at risk of becoming or have become drug or alcohol abusers or have substance use disorder;\n(12) have experienced homelessness;\n(13) have been excluded or expelled from school under sections 121A.40 to 121A.56; or\n(14) have been adjudicated children in need of protection or services.\nThe program must be designed not to duplicate existing programs, but to enable schools to collaborate with county social service agencies and county health boards and with local public and private providers to assure that at-risk children and youth receive health care, mental health services, family drug and alcohol counseling, and needed social services. Screenings and referrals under this program shall not duplicate screenings under section 142D.091.\nThe program must be designed to take advantage of available federal funding, including the following:\n(1) child welfare funds under United States Code, title 42, sections 620-628 (1988) and United States Code, title 42, sections 651-669 (1988);\n(2) funds available for health care and health care screening under medical assistance, United States Code, title 42, section 1396 (1988);\n(3) social services funds available under United States Code, title 42, section 1397 (1988);\n(4) children's day care funds available under federal transition year child care, the Family Support Act, Public Law 100-485; federal at-risk child care program, Public Law 101-5081; and federal child care and development block grant, Public Law 101-5082; and\n(5) funds available for fighting drug abuse and substance use disorder in children and youth, including the following:\n(i) funds received by the Office of Drug Policy under the federal Anti-Drug Abuse Act and other federal programs;\n(ii) funds received by the commissioner of human services under the federal alcohol, drug abuse, and mental health block grant; and\n(iii) funds received by the commissioner of human services under the Drug-Free Schools and Communities Act.\nThe commissioner of human services shall collaborate with the commissioners of education, health, and public safety to seek the federal waivers necessary to secure federal funds for implementing the statewide school-based program mandated by this section. Each commissioner shall amend the state plans for programs specified in subdivision 3, to the extent necessary to ensure the availability of federal funds for the school-based program.\nWithin 90 days of receiving the necessary federal waivers, the commissioners of human services and education shall implement at least two pilot programs that link health and social services in the schools. One program shall be located in a school district in the seven-county metropolitan area. The other program shall be located in a greater Minnesota school district. The commissioner of human services, in collaboration with the commissioner of education, shall select the pilot programs on a request for proposal basis. The commissioners shall give priority to school districts with some expertise in collocating services for at-risk children and youth. Programs funded under this subdivision must:\n(1) involve a plan for collaboration between a school district and at least two local social service or health care agencies to provide services for which federal funds are available to at-risk children or youth;\n(2) include parents or guardians in program planning and implementation;\n(3) contain a community outreach component; and\n(4) include protocol for evaluating the program.\n[Repealed, 1999 c 86 art 1 s 83]",
	"repealed": false
}