{
	"id": "62L.045",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.045",
	"title": "62L.045 ASSOCIATIONS.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(a) \"Association\" means:\n(1) an association as defined in section 60A.02;\n(2) a group or organization of political subdivisions;\n(3) a service cooperative created under section 123A.21; or\n(4) a joint self-insurance pool authorized under section 471.617, subdivision 2.\n(b) \"Qualified association\" means an association, as defined in this subdivision, that:\n(1) is registered with the commissioner of commerce;\n(2) provides health plan coverage through a health carrier that participates in the small employer market in this state, other than through associations, to the extent that the association purchases health plan coverage rather than self-insures;\n(3) has and adheres to membership and participation criteria and health coverage eligibility criteria that are not designed to disproportionately include or attract small employers that are likely to have low costs of health coverage or to disproportionately exclude or repel small employers that are likely to have high costs of health coverage; and\n(4) permits any small employer that meets its membership, participation, and eligibility criteria to become a member and to obtain health coverage through the association.\n(c) \"Health coverage\" means a health benefit plan as defined in section 62L.02, subdivision 15; or similar self-insured coverage offered, sold, issued, or renewed by an association as defined in paragraph (a) to a small employer.\n(a) A qualified association, as defined in this section, and health coverage offered by it, to it, or through it, to a small employer in this state must comply with the requirements of this chapter regarding guaranteed issue, guaranteed renewal, preexisting condition limitations, treatment of MCHA enrollees, and the definition of dependent, and with section 62A.65, subdivision 5, paragraph (b). They must also comply with all other requirements of this chapter not specifically exempted in paragraph (b).\n(b) A qualified association and a health carrier offering, selling, issuing, or renewing health coverage to, or to cover, a small employer in this state through the qualified association, may, but are not, in connection with that health coverage, required to:\n(1) offer the two small employer plans described in section 62L.05; and\n(2) offer to small employers that are not members of the association, health coverage offered to, by, or through the qualified association.\nAssociations as defined in this section that are not qualified associations; health coverage offered, sold, issued, or renewed by or through them; and the health carriers doing so, must fully comply with this chapter with respect to small employers that are members of the association.\n(a) This subdivision applies to associations as defined in this section, whether qualified associations or not, and is intended to clarify subdivisions 1 to 3.\n(b) This section applies only to associations that provide health coverage to small employers.\n(c) An arrangement between the health carrier and the association, once entered into, must comply with guaranteed issue and guaranteed renewal with respect to members of the association that are small employers and persons covered through them.\n(d) When an arrangement between a health carrier and an association has validly terminated, the health carrier has no continuing obligation to small employers and persons covered through them, except as otherwise provided in:\n(1) section 62A.65, subdivision 5, paragraph (b);\n(2) any other continuation or conversion rights applicable under state or federal law; and\n(3) section 60A.082, relating to group replacement coverage, and rules adopted under that section.\n(e) When an association's arrangement with a health carrier has terminated and the association has entered into a new arrangement with that health carrier or a different health carrier, the new arrangement is subject to section 60A.082 and rules adopted under it, with respect to members of the association that are small employers and persons covered through them.\n(f) An association that offers its members more than one plan of health coverage may have uniform rules restricting movement between the plans of health coverage, if the rules do not discriminate against small employers.\n(g) This chapter does not require or prohibit separation of an association's members into one group consisting only of small employers and another group or other groups consisting of all other members. The association must comply with this section with respect to the small employer group.\n(h) For purposes of this section, \"member\" of an association includes an employer participant in the association.\n(i) For purposes of this section, health coverage issued to, or to cover, a small employer includes a certificate of coverage issued directly to the employer's employees and dependents, rather than to the small employer.\nThe commissioner may require all associations that are subject to this section to register with the commissioner prior to an initial purchase of health coverage under this section.",
	"repealed": false
}