{
	"id": "216B.1614",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1614",
	"title": "216B.1614 ELECTRIC VEHICLE CHARGING TARIFF.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Electric vehicle\" has the meaning given in section 169.011, subdivision 26a.\n(c) \"Public utility\" has the meaning given in section 216B.02, subdivision 4.\n(d) \"Renewable energy\" has the meaning given in section 216B.169, subdivision 2, paragraph (d).\n(a) By February 1, 2015, each public utility selling electricity at retail must file with the commission a tariff that allows a customer to purchase electricity solely for the purpose of recharging an electric vehicle. The tariff must:\n(1) contain either a time-of-day or off-peak rate, as elected by the public utility;\n(2) offer a customer the option to purchase electricity:\n(i) from the utility's current mix of energy supply sources; or\n(ii) entirely from renewable energy sources, subject to the conditions established under section 216B.169, subdivision 2, paragraph (b), and subdivision 3, paragraph (a); and\n(3) be made available to the residential customer class.\n(b) The public utility may, at its discretion, offer the tariff to other customer classes.\n(c) The commission shall, after notice and opportunity for public comment, approve, modify, or reject the tariff. The commission may approve the tariff if the public utility has demonstrated that the tariff:\n(1) appropriately reflects off-peak versus peak cost differences in the rate charged;\n(2) includes a mechanism to allow the recovery of costs reasonably necessary to comply with this section, including costs to inform and educate customers about the financial, energy conservation, and environmental benefits of electric vehicles and to publicly advertise and promote participation in the customer-optional tariff;\n(3) provides for clear and transparent customer billing statements including, but not limited to, the amount of energy consumed under the tariff; and\n(4) incorporates the cost of metering or submetering within the rate charged to the customer.\n(d) Within 60 days of commission approval of a public utility's tariff filed under this section, the public utility shall make the tariff available to customers.\n(e) The utility may at any time propose revisions to a tariff filed under this subdivision based on changing costs or conditions.\nEach public utility providing a tariff under this section shall periodically report to the commission, as established by the commission and on a form prescribed by the commission, the following information, organized on a per-quarter basis:\n(1) the number of customers who have arranged to purchase electricity under the tariff;\n(2) the total amount of electricity sold under the tariff; and\n(3) other data required by the commission.",
	"repealed": false
}