{
	"id": "473.3999",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.3999",
	"title": "473.3999 LIGHT RAIL TRANSIT CONSTRUCTION; COUNCIL AUTHORITY; STAFF ASSISTANCE; PROJECT MANAGER QUALIFICATIONS.",
	"text": "The council may exercise the powers granted in this chapter and in other applicable law, as necessary, to plan, design, acquire, construct, and equip light rail transit facilities in the metropolitan area as defined in section 473.121, subdivision 2.\n(a) Notwithstanding any cooperative agreement between the commissioner of transportation and the council in section 473.3994, subdivision 1a, if the council is the responsible authority, the commissioner of transportation must provide staff and project assistance to the council for review and oversight of the project's development. The council must utilize the Department of Transportation staff and project assistance for:\n(1) the appropriate delivery method selection for the design, planning, acquisition, construction, and equipping of light rail transit projects;\n(2) risk assessment analysis and cost analysis in the planning, designing, and construction of a light rail transit facility or a new light rail transit project, including but not limited to:\n(i) a critical path schedule for the planning and design phases of a project developed jointly by the council and the commissioner of transportation;\n(ii) peer reviews or value engineering reviews at various milestones established in the critical path schedule created under item (i); and\n(iii) council participation in cost estimate reviews by third-party independent cost estimators in conformance with Federal Transit Administration regulations and guidance;\n(3) contractor and subcontractor schedule analysis and contractual requirements, including but not limited to:\n(i) development and review of requests for proposals and bid documents prior to advertisement and solicitation;\n(ii) review of bids submitted prior to the award of bids;\n(iii) review of draft contractual language prior to the execution of project contracts;\n(iv) review of change orders for major cost items exceeding $500,000 and schedule delays of more than 30 calendar days prior to the execution of a change order; and\n(v) participation in any dispute resolution process that may arise to address competing claims or disputes between a contractor and the council;\n(4) light rail transit project cost management and budget analysis for the planning, designing, and construction of a light rail transit facility or new light rail transit project, including but not limited to:\n(i) recommendations to address or manage cost overruns or discrepancies, funding sources, contingency funding sources and availability, and the management of state or county financial resources;\n(ii) recommendations on appropriate contractual enforcement mechanisms and penalties for any council agreement with a contractor for a light rail transit project; and\n(iii) the development of future cost estimates and communication of projected cost increases for a light rail transit project; and\n(5) any other areas of expertise that the Department of Transportation may offer.\n(b) The council must provide the commissioner of transportation all relevant information required by this section.\n(c) Staff from the Department of Transportation providing project assistance to the council must report to the commissioner of transportation. Staff assistance from the Department of Transportation must include at least one licensed professional engineer.\n(d) If the commissioner of transportation provides the council with staff and project assistance for the development of a light rail transit project as provided under this section, the commissioner must submit and detail all recommendations made to the council to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance within 30 days of submitting its recommendations to the council.\n(e) The council must give strong consideration to utilizing input or recommendations developed by the commissioner of transportation. If the council decides against utilizing input or recommendations from the department, the council must reconcile significant deviations to the extent practicable and that portion of the project cannot move forward from the critical path schedule's milestone until the recommendation is reconciled. If the council has sufficient reasoning to justify not utilizing input or recommendations from the department, the council must, within 30 business days, provide written notice and documentation of the decision to the department and the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. The notice and documentation must provide the reasons why the council is not utilizing the input or recommendations provided by the department.\nThe project budget is responsible for costs incurred by the commissioner of transportation for duties required in this section. The council must only use direct appropriations in law or federal sources to pay its portion of light rail transit capital construction costs.\nIf the Metropolitan Council is the responsible authority, the council must select a qualified project manager and lead project engineer with at least ten years' transportation industry experience to lead the planning, design, acquisition, construction, or equipping of a new light rail transit project.",
	"repealed": false
}