{
	"id": "204C.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.06",
	"title": "204C.06 CONDUCT IN AND NEAR POLLING PLACES.",
	"text": "An individual shall be allowed to go to and from the polling place for the purpose of voting without unlawful interference. No one except an election official or an individual who is waiting to register or to vote or an individual who is conducting exit polling shall stand within 100 feet of the building in which a polling place is located.\n(a) \"Exit polling\" is defined as approaching voters in a predetermined pattern as they leave the polling place after they have voted and asking voters to fill out an anonymous, written questionnaire.\n(b) An individual conducting exit polling must present photo identification to the head judge upon arrival at the polling place, along with a letter or credential from the news media.\n(c) A person must not conduct exit polling in a manner that unlawfully interferes with a person going to or from the polling place or allows any person to view another person's responses to the poll.\n(a) Representatives of the secretary of state's office, the county auditor's office, and the municipal or school district clerk's office may be present at the polling place to observe election procedures. Except for these representatives, election judges, sergeants-at-arms, and challengers, an individual may remain inside the polling place during voting hours only while voting or registering to vote, providing proof of residence for an individual who is registering to vote, or assisting a disabled voter or a voter who is unable to read English. During voting hours no one except individuals receiving, marking, or depositing ballots shall approach within six feet of a voting booth, ballot counter, or electronic voting equipment, unless lawfully authorized to do so by an election judge or the individual is an election judge monitoring the operation of the ballot counter or electronic voting equipment.\n(b) Teachers and elementary or secondary school students participating in an educational activity authorized by section 204B.27, subdivision 7, may be present at the polling place during voting hours.\n(c) Each official on duty in the polling place must wear an identification badge that shows their role in the election process. The badge must not show their party affiliation.\nNo individual shall intentionally:\n(a) tear down, mutilate, deface or otherwise damage during the hours of voting any voter instruction poster placed inside or outside of a polling place by an election judge or other election official; or\n(b) remove from the polling place before the time for voting ends any ballots prepared for use at the election or any supplies or conveniences placed in voting booths for use by the voters, except as authorized by law.\nA violation of this subdivision is a gross misdemeanor.\nNo individual shall intentionally:\n(a) remove from a polling place any election file or election register, except as authorized by law;\n(b) damage, deface, or mutilate any ballot, election file, or election register or any item of information contained on it, except as authorized by law; or\n(c) add anything to a ballot, election file, or election register, except as authorized by law.\nA violation of this subdivision is a felony.\nThe election judges may appoint a sergeant-at-arms when necessary to keep the peace or otherwise to assist them. An election judge may request a sergeant-at-arms or a peace officer to arrest or remove from the polling place any individual who, despite a warning to desist, engages in disorderly conduct. A sergeant-at-arms or a peace officer shall not otherwise interfere in any manner with voters.\nExcept when summoned by an election judge to restore the peace or when voting or registering to vote, no peace officer shall enter or remain in a polling place or stand within 50 feet of the entrance of a polling place.\nDuring the time an election is being held it is a misdemeanor to bring intoxicating liquor or 3.2 percent malt liquor into a polling place, to drink intoxicating liquor or 3.2 percent malt liquor in a polling place, or to be intoxicated in a polling place. The election judges shall not permit an obviously intoxicated individual to vote or remain in the polling place for any purpose.\nA news media representative may enter a polling place during voting hours only to observe the voting process. A media representative must present photo identification to the head election judge upon arrival at the polling place, along with either a recognized media credential or written statement from a local election official attesting to the media representative's credentials. A media representative must not:\n(1) approach within six feet of a voter;\n(2) converse with a voter while in the polling place;\n(3) make a list of persons voting or not voting; or\n(4) interfere with the voting process.",
	"repealed": false
}