{
	"id": "349.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.19",
	"title": "349.19 ACCOUNTS, RECORDS, AND REPORTS.",
	"text": "(a) A licensed organization must keep a record of each occasion on which it conducts gambling, including each bingo occasion and each day on which other forms of lawful gambling are conducted. The record must include gross receipts, quantities of free plays if any, expenses, prizes, and gross profit. The board may by rule provide for the methods by which expenses are documented.\n(b) In the case of bingo:\n(1) gross receipts must be compared to the checkers' records for the occasion by a person who did not sell cards for the occasion; and\n(2) the organization must keep a bingo gift certificate log showing each bingo gift certificate number, the face value, the date sold, and the date redeemed.\n(c) Separate records must be kept for bingo and all other forms of lawful gambling.\n(a) Gross receipts from lawful gambling by each organization must be segregated from all other revenues of the conducting organization and placed in a separate gambling bank account.\n(b) All expenditures for allowable expenses, taxes, and lawful purposes must be made from the separate account except (1) in the case of expenditures previously approved by the organization's membership for emergencies as defined by board rule, or (2) when restricted to one electronic fund transaction for the payment of taxes for the organization as a whole, the organization may transfer the amount of taxes related to the conduct of gambling to the general account at the time when due and payable.\n(c) The name and address of the bank, the account number for the separate account, and the names of organization members authorized as signatories on the separate account must be provided to the board when the application is submitted. Changes in the information must be submitted to the board at least ten days before the change is made.\n(d) Except as provided in paragraph (e), gambling receipts must be deposited into the gambling bank account within four business days of completion of the bingo occasion, deal, or game from which they are received.\n(1) A deal of paper pull-tabs is considered complete when either the last pull-tab of the deal is sold or the organization does not continue the play of the deal during the next scheduled period of time in which the organization will conduct pull-tabs.\n(2) A tipboard game is considered complete when the seal on the game flare is uncovered or the organization does not continue the play of the deal during the next scheduled period of time in which the organization will conduct tipboards.\n(e) Gambling receipts from electronic gambling must be recorded on a daily basis and deposited into the gambling bank account:\n(1) when the total net receipts from all electronic games at the premises reach the sum of $2,000; and\n(2) within four business days of the first day of the month immediately following the month during which the receipts were generated.\n(f) Deposit records must be sufficient to allow determination of deposits made from each bingo occasion, deal, or game at each permitted premises.\n(g) The person who accounts for gambling gross receipts and profits may not be the same person who accounts for other revenues of the organization.\nMS 2010 [Repealed, 2012 c 299 art 4 s 66]\nMS 2006 [Repealed, 2007 c 145 s 8]\n(a) All expenditures of gross profits from lawful gambling must be itemized as to payee, purpose, amount, and date of payment.\n(b) Each licensed organization must report monthly to the board in an electronic format prescribed by the board each expenditure or contribution of net profits from lawful gambling. The reports must provide for each expenditure or contribution:\n(1) the name of the recipient of the expenditure or contribution;\n(2) the date the expenditure or contribution was approved by the organization;\n(3) the date, amount, and check number or electronic transfer confirmation number of the expenditure or contribution;\n(4) a brief description of how the expenditure or contribution meets one or more of the purposes in section 349.12, subdivision 25; and\n(5) in the case of expenditures authorized under section 349.12, subdivision 25, paragraph (a), clause (7), whether the expenditure is for a facility or activity that primarily benefits male or female participants.\n(c) Authorization of the expenditures must be recorded in the monthly meeting minutes of the licensed organization.\n(d) Checks or authorizations for electronic fund transfers for expenditures of gross profits must be signed by at least two persons authorized by board rules to sign the checks or authorizations.\n(e) Expenditures of gross profits from lawful gambling for local, state, and federal taxes as identified in section 349.12, subdivision 25, paragraph (a), clause (8), may be transferred electronically from the organization's gambling account directly to bank accounts identified by local, state, or federal agencies if the organization's gambling account monthly bank statement specifically identifies the payee by name, the amount transferred, and the date of the transaction.\n(f) Expenditures of gross profits from lawful gambling for payments for lawful purpose expenditures and allowable expenses may be transferred electronically from the organization's gambling account directly to bank accounts identified by the vendor if the organization's gambling account monthly bank statement specifically identifies the payee by name, the amount transferred, the account number of the account into which the funds were transferred, and the date of the transaction.\n(g) Expenditures of gross profits from lawful gambling for payroll compensation to an employee's account and for the payment of local, state, and federal withholding taxes may be transferred electronically to and from the account of a payroll processing firm provided that the firm:\n(1) is currently registered with and meets the criteria of the Department of Revenue as a third-party bulk filer under section 290.92, subdivision 30;\n(2) is able to provide proof of a third-party audit and an annual report and statement of financial condition;\n(3) is able to provide evidence of a fidelity bond; and\n(4) can provide proof of having been in business as a third-party bulk filer for the most recent three years.\n(h) Electronic payments of taxes, lawful purpose expenditures, and allowable expenses are permitted only if they have been authorized by the membership, the organization maintains supporting documentation, and the expenditures can be verified.\nIf at a bingo occasion a discrepancy of more than $50 is found between the gross receipts as reported by the checkers and the gross receipts determined by adding the cash receipts, the discrepancy must be reported to the board within five days of the bingo occasion.\n(a) A licensed organization must report monthly to the board in an electronic format prescribed by the board and to its membership on its gross receipts, expenses, profits, and expenditure of profits from lawful gambling for each permitted premises. The organization must account for and report on each form of lawful gambling conducted. The organization must include a reconciliation of the organization's profit carryover with its cash balance on hand. All gambling fund expenditures must be reported to the board on a cash basis.\n(b) The organization must report monthly to the commissioner of revenue as required under section 297E.06.\nRecords required to be kept by this section must be preserved by a licensed organization for at least 3-1/2 years and may be inspected by the commissioner of revenue, the board, or the commissioner of public safety at any reasonable time without notice or a search warrant.\nThe board may by rule require each licensed organization to provide copies of forms it files with the United States Department of the Treasury which are required for organizations exempt from income tax.\nUpon termination of a license for any reason, a licensed organization must notify the board in writing within 30 calendar days of the license termination date of its plan for disposal of gambling equipment and distribution of remaining gambling proceeds. Before implementation, a plan must be approved by the board as provided in board rule. The board may accept or reject a plan and order submission of a new plan or amend a proposed plan. The board may specify a time for submission of new or amended plans or for completion of an accepted plan.\nMS 2014 [Repealed, 2015 c 45 s 27]\nAn organization licensed under this chapter must maintain records that account for the assets, liabilities, and fund balance of the organization. The records must also account for the revenues, taxes, prize payouts, expenses, and lawful purpose expenditures of the organization. The records must include a perpetual inventory of games purchased but not yet played and games in play.\nMS 2014 [Repealed, 2015 c 52 s 24]\n(a) The board shall by rule require a licensed organization to require each winner of a paper pull-tab prize of $100 or more to present identification in the form of a driver's license, Minnesota identification card, or other identification the board deems sufficient to allow the identification and tracking of the winner. The rule must require the organization to retain winning paper pull-tabs of $100 or more, and the identification of the winner of the pull-tab, for 3-1/2 years.\n(b) A licensed organization must require each person cashing out an electronic pull-tab device with $600 or more in credits to present identification in the form of a driver's license, Minnesota identification card, or other identification the board deems sufficient to allow the identification and tracking of the winner. The organization must retain the identification of the winner for 3-1/2 years.\n(c) An organization must maintain separate cash banks for each deal of paper pull-tabs unless (1) the licensed organization uses a pull-tab dispensing device, or (2) the organization uses a cash register, of a type approved by the board, which records all sales of paper pull-tabs by separate deals.\n(d) The board shall:\n(1) by rule adopt minimum technical standards for cash registers that may be used by organizations, and shall approve for use by organizations any cash register that meets the standards; and\n(2) before allowing an organization to use a cash register that commingles receipts from several different paper pull-tab games in play, adopt rules that define how cash registers may be used and that establish a procedure for organizations to reconcile all pull-tab games in play at the end of each month.\nA licensed organization which receives a copy of an audit or compliance report must place the audit report or compliance report in the minutes of the next meeting of the organization following receipt of the report. Copies of such minutes must be made available to all members of the organization upon request.\nA licensed organization must report to the board, in an electronic format prescribed by the board, any audit that is required under section 297E.06, subdivision 4, but excluding any requirement that is to be reported as described in section 297E.06, subdivision 4, paragraph (d), at the same time the audit is submitted to the commissioner of revenue.",
	"repealed": false
}