{
	"id": "480A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/480A.09",
	"title": "480A.09 PLACE OF HEARING ORAL ARGUMENT.",
	"text": "Oral argument in appeals from trial courts shall be heard:\n(a) In appeals from trial courts in Hennepin and Ramsey Counties, at a session of the court of appeals in Hennepin or Ramsey County.\n(b) In appeals from trial courts in other counties, at a session of the court of appeals in the judicial district in which the county is located.\nOral arguments on writs of certiorari to review decisions of the unemployment law judges in the Department of Employment and Economic Development shall be heard as provided in this subdivision:\n(1) if the applicant for benefits is a real party in interest in the proceedings and resides in Hennepin or Ramsey County, in one of those counties;\n(2) if the applicant for benefits is a real party in interest in the proceedings and resides elsewhere in the state, in the judicial district of the applicant's residence;\n(3) otherwise, at a place as designated by the appellate administrator.\nOral arguments on petitions to review the validity of administrative rules pursuant to section 14.44 shall be in Hennepin or Ramsey County.\nOral arguments on petitions to review decisions of administrative agencies in contested cases, pursuant to sections 14.63 to 14.68 shall be heard:\n(1) if the petitioner resides outside of Hennepin and Ramsey Counties, but within Minnesota, either at the session of the court of appeals in Hennepin or Ramsey County, or at a session of the court of appeals in the judicial district in which the petitioner resides, as designated by the petitioner in the petition for review;\n(2) if the petitioner resides in Hennepin or Ramsey Counties, or outside of Minnesota, at a session of the court of appeals in Hennepin or Ramsey County.\nIn all other cases, any oral argument shall be heard at a session of the court in Hennepin or Ramsey County.\nBy agreement of the parties and with the approval of the appellate administrator, a case may be heard at a location other than that provided in this section. The Rules of Appellate Procedure may provide for change of the place of hearing upon motion of any party and a showing of good cause.\nThe Rules of Appellate Procedure may provide for the submission of certain cases or classes of cases without oral arguments.",
	"repealed": false
}