{
	"id": "508.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.24",
	"title": "508.24 REGISTRATION RUNS WITH LAND; WITHDRAWAL.",
	"text": "The obtaining of a decree of registration, and the receiving of a certificate of title shall be deemed as an agreement running with the land and binding upon the applicant and successors in the title that the land shall be and forever remain registered land, unless withdrawn therefrom as hereinafter provided, and subject to the provisions of this chapter and to all acts amendatory thereof. All dealings with the land, or any estate or interest therein, and all liens, encumbrances, and charges upon the same, after the land has been registered, and while it remains registered, shall be expressly subject to the terms and provisions of this chapter.\nThe registered owner of land in counties not containing a city of the first class may apply by verified petition to the district court of the county wherein the land is situated for its withdrawal from registration. The application shall be heard by the district court on not less than 20 days' written notice to all persons appearing of record or known to the petitioner to have or claim an interest in the property. The notice shall be served in the manner provided by law for the service of a summons in a civil action in the district court unless otherwise specified by the court. At the hearing any person interested in any manner in the land or who may be affected by its withdrawal from registration, may appear and be heard in favor of or in opposition to the application. After hearing the court may order that the land be withdrawn from registration, subject to encumbrances, liens, and other incidents of title then existing, and if so ordered shall require that a certified copy of the order, a certified copy of the original decree of registration, and certified copies of all undischarged instruments memorialized on the certificate of title, be recorded in the office of the county recorder at the expense of the petitioner. In its order the court shall reconcile any differences in description of the land as originally registered and as described in the last certificate of title. Upon the recording of the instruments and upon filing a certified copy of the order in the office of the registrar of titles, the land shall be withdrawn from registration and become unregistered property.",
	"repealed": false
}