{
	"id": "89.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.71",
	"title": "89.71 FOREST ROADS.",
	"text": "The commissioner shall designate forest roads by written order published in the State Register. Designated forest roads, bridges, and other improvements administered under section 89.002, subdivision 3, are designated to the width of the actual use including ditches, backslopes, fills, and maintained right-of-way, unless otherwise specified in a prior easement of record. The commissioner may undesignate, by written order published in the State Register, all or part of a state forest road that is not needed to carry out forest resource management policy. Designations and undesignations are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply. The commissioner shall maintain and keep current an inventory listing and describing roads in which the state claims a right or property interest for state forest road purposes. The commissioner may file for record with a county recorder or registrar of titles appropriate documents setting forth the state's interest in all or part of any state forest road.\nAdditional rights-of-way and easements, including easements needed for drainage or slopes, may be acquired by the commissioner by purchase or gift and by condemnation for safety or environmental protection on existing roads and to provide access to tracts of public land larger than 1,000 acres having no access, following a public meeting in the area affected. Rights-of-way and easements shall be designated as state forest roads when needed for construction, maintenance, or safety of roads.\nThe commissioner shall develop specifications for the design and construction of state forest roads and shall establish maintenance schedules for forest roads consistent with their intended use.\nIn adopting rules relating to the use of state forest roads, the commissioner may incorporate into the rules, by reference, traffic regulations contained in chapters 169 and 169A.\nThe commissioner may designate a state forest road as a minimum-maintenance forest road to be maintained at a level consistent with the intended use. Designation of a state forest road as a minimum-maintenance forest road is effective on the posting of signs, at entry points to the road and at regular intervals along the road, to the effect that the road is a minimum-maintenance forest road and that the user travels on the road at the user's risk. Posting of the signs is prima facie evidence that adequate notice of minimum-maintenance status has been given to the public. Liability on a road designated under this subdivision is governed by section 160.095, subdivision 4.\nWhen the commissioner undesignates a state forest road and determines that the road is no longer needed for any state purpose, the commissioner may convey by mutual agreement, in the manner provided in section 84.63, the state interest in the road to the United States, the state of Minnesota, or any of its subdivisions, whether or not the road is on state land.\nExcept as otherwise provided, the commissioner is not a road authority under chapters 160 to 168, and chapters 160 to 168 do not apply to forest roads unless specifically made applicable by law or rule.",
	"repealed": false
}