{
	"id": "259.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.41",
	"title": "259.41 ADOPTION STUDY.",
	"text": "(a) An approved adoption study; completed background study, as required under section 245C.33; and written report must be completed before the child is placed in a prospective adoptive home under this chapter, except as allowed by section 259.47, subdivision 6. In an agency placement, the report must be filed with the court at the time the adoption petition is filed. In a direct adoptive placement, the report must be filed with the court in support of a motion for temporary preadoptive custody under section 259.47, subdivision 3, or, if the study and report are complete, in support of an emergency order under section 259.47, subdivision 6. The study and report shall be completed by a licensed child-placing agency and must be thorough and comprehensive. The study and report shall be paid for by the prospective adoptive parent, except as otherwise required under section 142A.03, subdivision 2, paragraph (j), 259.67, or 259.73.\n(b) A placement for adoption with an individual who is related to the child, as defined by section 142B.01, subdivision 15, is subject to a background study required by subdivision 2, paragraph (a), clause (1), items (i) and (ii), and subdivision 3. In the case of a stepparent adoption, a background study must be completed on the stepparent and any children as required under subdivision 3, paragraph (b), except that a child of the stepparent does not need to have a background study complete if they are a sibling through birth or adoption of the person being adopted. The local social services agency of the county in which the prospective adoptive parent lives must initiate a background study unless a child-placing agency has been involved with the adoption. The local social service agency may charge a reasonable fee for the background study. If a placement is being made the background study must be completed prior to placement pursuant to section 259.29, subdivision 1, paragraph (c). Background study results must be filed with the adoption petition according to section 259.22, except in an adult adoption where an adoption study and background study are not needed.\n(c) In the case of a licensed foster parent seeking to adopt a child who is in the foster parent's care, any portions of the foster care licensing process that duplicate requirements of the home study may be submitted in satisfaction of the relevant requirements of this section.\n(a) The adoption study must include at least one in-home visit with the prospective adoptive parent. At a minimum, the study must document the following information about the prospective adoptive parent:\n(1) a background study as required by subdivision 3 and section 245C.33, including:\n(i) an assessment of the data and information provided by section 245C.33, subdivision 4, to determine if the prospective adoptive parent and any other person over the age of 13 living in the home has a felony conviction consistent with subdivision 3 and section 471(a)(2) of the Social Security Act; and\n(ii) an assessment of the effect of any conviction or finding of substantiated maltreatment on the capacity of the prospective adoptive parent to safely care for and parent a child;\n(2) a medical and social history and assessment of current health;\n(3) an assessment of potential parenting skills;\n(4) an assessment of ability to provide adequate financial support for a child; and\n(5) an assessment of the level of knowledge and awareness of adoption issues including, where appropriate, matters relating to interracial, cross-cultural, and special needs adoptions.\n(b) The adoption study is the basis for completion of a written report. The report must be in a format specified by the commissioner and must contain recommendations regarding the suitability of the subject of the study to be an adoptive parent.\n(a) At the time an adoption study is commenced, each prospective adoptive parent must:\n(1) authorize access by the agency to any private data needed to complete the study;\n(2) provide all addresses at which the prospective adoptive parent and anyone in the household over the age of 13 has resided in the previous five years; and\n(3) disclose any names used previously other than the name used at the time of the study.\n(b) When the requirements of paragraph (a) have been met, the agency shall immediately initiate a background study under section 245C.33 to be completed by the commissioner on each person over the age of 13 living in the home. As required under section 245C.33 and Public Law 109-248, a completed background study is required before the approval of any foster or adoptive placement in a related or an unrelated home. The required background study must be completed as part of the home study.\n(c) A home study under paragraph (b) used to consider placement of any child on whose behalf Title IV-E adoption assistance payments are to be made must not be approved if a background study reveals a felony conviction at any time for:\n(1) child abuse or neglect;\n(2) spousal abuse;\n(3) a crime against children, including child pornography; or\n(4) a crime involving violence, including rape, sexual assault, or homicide, but not including other physical assault or battery.\n(d) A home study under paragraph (b) used to consider placement of any child on whose behalf Title IV-E adoption assistance payments are to be made must not be approved if a background study reveals a felony conviction within the past five years for:\n(1) physical assault or battery; or\n(2) a drug-related offense.\nAn agency may update an adoption study and report as needed, regardless of when the original study and report or most recent update was completed. An update must be in a format specified by the commissioner and must verify the continuing accuracy of the elements of the original report and document any changes to elements of the original report. An update to a study and report not originally completed under this section must ensure that the study and report, as updated, meet the requirements of this section. An adoption study is valid if the report has been completed or updated within the previous 12 months.",
	"repealed": false
}