{
	"id": "116.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.072",
	"title": "116.072 ADMINISTRATIVE PENALTIES.",
	"text": "(a) The commissioner may issue an order requiring violations to be corrected and administratively assessing monetary penalties for violations of this chapter and chapters 114C, 115, 115A, 115D, and 115E, any rules adopted under those chapters, and any standards, limitations, or conditions established in an agency permit; and for failure to respond to a request for information under section 115B.17, subdivision 3. The order must be issued as provided in this section.\n(b) A county board may adopt an ordinance containing procedures for the issuance of administrative penalty orders and may issue orders beginning August 1, 1996. Before adopting ordinances, counties shall work cooperatively with the agency to develop an implementation plan for the orders that substantially conforms to a model ordinance developed by the counties and the agency. After adopting the ordinance, the county board may issue orders requiring violations to be corrected and administratively assessing monetary penalties for violations of county ordinances adopted under section 400.16, 400.161, or 473.811 or chapter 115A that regulate solid and hazardous waste and any standards, limitations, or conditions established in a county license issued pursuant to these ordinances. For violations of ordinances relating to hazardous waste, a county's penalty authority is described in subdivisions 2 to 5. For violations of ordinances relating to solid waste, a county's penalty authority is described in subdivision 5a. Subdivisions 6 to 11 apply to violations of ordinances relating to both solid and hazardous waste.\n(c) Monetary penalties collected by a county must be used to manage solid and hazardous waste. A county board's authority is limited to violations described in paragraph (b). Its authority to issue orders under this section expires August 1, 1999.\n(a) The commissioner or county board may issue orders assessing penalties up to $25,000 for violations identified during an inspection or other compliance review.\n(b) In determining the amount of a penalty, the commissioner or county board must consider:\n(1) the willfulness of the violation;\n(2) the gravity of the violation, including damage to humans, animals, air, water, land, or other natural resources of the state;\n(3) the history of past violations;\n(4) the number of violations;\n(5) the economic benefit gained by the person by allowing or committing the violation; and\n(6) other factors as justice may require, if the commissioner or county board specifically identifies the additional factors in the commissioner's or county board's order.\n(c) For a violation after an initial violation, the commissioner or county board must, in determining the amount of a penalty, consider the factors in paragraph (b) and the:\n(1) similarity of the most recent previous violation and the violation to be penalized;\n(2) time elapsed since the last violation;\n(3) number of previous violations; and\n(4) response of the person to the most recent previous violation identified.\nAn order assessing an administrative penalty under this section shall include:\n(1) a concise statement of the facts alleged to constitute a violation;\n(2) a reference to the section of the statute, rule, ordinance, variance, order, stipulation agreement, or term or condition of a permit or license that has been violated;\n(3) a statement of the amount of the administrative penalty to be imposed and the factors upon which the penalty is based; and\n(4) a statement of the person's right to review of the order.\n(a) The commissioner or county board may issue an order assessing a penalty and requiring the violations cited in the order to be corrected within 30 calendar days from the date the order is received.\n(b) The person to whom the order was issued shall provide information to the commissioner or county board before the 31st day after the order was received demonstrating that the violation has been corrected or that appropriate steps toward correcting the violation have been taken. The commissioner or county board shall determine whether the violation has been corrected and notify the person subject to the order of the commissioner's or county board's determination.\n(a) Except as provided in paragraph (b), if the commissioner or county board determines that the violation has been corrected or appropriate steps have been taken to correct the action, the penalty must be forgiven. Unless the person requests review of the order under subdivision 6 or 7 before the penalty is due, the penalty in the order is due and payable:\n(1) on the 31st day after the order was received, if the person subject to the order fails to provide information to the commissioner or county board showing that the violation has been corrected or that appropriate steps have been taken toward correcting the violation; or\n(2) on the 20th day after the person receives the commissioner's or county board's determination under subdivision 4, paragraph (b), if the person subject to the order has provided information to the commissioner or county board that the commissioner or county board determines is not sufficient to show the violation has been corrected or that appropriate steps have been taken toward correcting the violation.\n(b) For a repeated or serious violation, the commissioner or county board may issue an order with a penalty that will not be forgiven after the corrective action is taken. A penalty for a repeated violation that occurs within 36 months after one or more previous violations must be at least ten percent higher than the penalty imposed for the most recent violation, except the amount must not exceed the maximum penalty established in subdivision 2. The penalty is due by 31 days after the order was received unless review of the order under subdivision 6, 7, or 8 has been sought.\n(c) Interest at the rate established in section 549.09 begins to accrue on penalties under this subdivision on the 31st day after the order with the penalty was received.\n(a) A county board's authority to issue a corrective order and assess a penalty for all violations relating to solid waste that are identified during an inspection or other compliance review is as described in this subdivision. The model ordinance described in subdivision 1, paragraph (b), must include provisions for letters or warnings that may be issued following the inspection and before proceeding under paragraph (b).\n(b) For all violations described in paragraph (a), a county attorney or county department with responsibility for environmental enforcement may first issue a notice of violation that complies with the requirements of subdivision 4, except that no penalty may be assessed unless, in the opinion of the county board, the gravity of the violation and its potential for damage to, or actual damage to, public health or the environment is such that a penalty under paragraph (c) or (d) is warranted. In that case the county attorney or department may proceed directly to paragraph (c) or (d).\n(c) If the violations are not corrected, if appropriate steps have not been taken to correct them, or if the county board has determined that the gravity of the violations are such that action under this paragraph is warranted, a county board may issue a corrective order as described in subdivision 4, except that the penalty may not exceed $2,000.\n(d) If the violations are still not corrected, if appropriate steps have not been taken to correct them, or if the county board has determined that the gravity of the violations are such that action under this paragraph is warranted, a county board may issue a corrective order as described in subdivision 4, except that the penalty may not exceed $5,000.\n(e) In determining the amount of the penalty in paragraph (c) or (d), the county board shall be governed by subdivision 2, paragraphs (b) and (c). The penalty assessed under paragraph (c) or (d) shall be due and payable, forgiven, or assessed without forgiveness as described in subdivision 5.\n(a) Within 30 days after receiving an order or within 20 days after receiving notice that the commissioner or county board has determined that a violation has not been corrected or appropriate steps have not been taken, the person subject to an order under this section may request an expedited hearing, utilizing the procedures of Minnesota Rules, parts 1400.8510 to 1400.8612, to review the commissioner's or county board's action. The hearing request must specifically state the reasons for seeking review of the order. The person to whom the order is directed and the commissioner or county board are the parties to the expedited hearing. The commissioner or county board must notify the person to whom the order is directed of the time and place of the hearing at least 20 days before the hearing. The expedited hearing must be held within 30 days after a request for hearing has been filed with the commissioner or county board unless the parties agree to a later date.\n(b) All written arguments must be submitted within ten days following the close of the hearing. The hearing shall be conducted under Minnesota Rules, parts 1400.8510 to 1400.8612, as modified by this subdivision. The Office of Administrative Hearings may, in consultation with the agency, adopt rules specifically applicable to cases under this section.\n(c) The administrative law judge shall issue a report making recommendations about the commissioner's or county board's action to the commissioner or county board within 30 days following the close of the record. The administrative law judge may not recommend a change in the amount of the proposed penalty unless the administrative law judge determines that, based on the factors in subdivision 2, the amount of the penalty is unreasonable.\n(d) If the administrative law judge makes a finding that the hearing was requested solely for purposes of delay or that the hearing request was frivolous, the commissioner or county board may add to the amount of the penalty the costs charged to the agency by the Office of Administrative Hearings for the hearing.\n(e) If a hearing has been held, the commissioner or county board may not issue a final order until at least five days after receipt of the report of the administrative law judge. The person to whom an order is issued may, within those five days, comment to the commissioner or county board on the recommendations and the commissioner or county board will consider the comments. The final order may be appealed in the manner provided in sections 14.63 to 14.69.\n(f) If a hearing has been held and a final order issued by the commissioner or county board, the penalty shall be paid by 30 days after the date the final order is received unless review of the final order is requested under sections 14.63 to 14.69. If review is not requested or the order is reviewed and upheld, the amount due is the penalty, together with interest accruing from 31 days after the original order was received at the rate established in section 549.09.\n(a) Within 30 days after the receipt of an order from the commissioner or a county board or within 20 days of receipt of notice that the commissioner or a county board has determined that a violation has not been corrected or appropriate steps have not been taken, the person subject to an order under this section may file a petition in district court for review of the order in lieu of requesting an administrative hearing under subdivision 6. The petition shall be filed with the court administrator with proof of service on the commissioner or county board. The petition shall be captioned in the name of the person making the petition as petitioner and the commissioner or county board as respondent. The petition shall state with specificity the grounds upon which the petitioner seeks rescission of the order, including the facts upon which each claim is based.\n(b) At trial, the commissioner or county board must establish by a preponderance of the evidence that a violation subject to this section occurred, the petitioner is responsible for the violation, a penalty immediately assessed as provided for under subdivision 5, paragraph (b) or (c), is justified by the violation, and the factors listed in subdivision 2 were considered when the penalty amount was determined and the penalty amount is justified by those factors.\nIn addition to review under subdivision 6 or 7, the commissioner or county board is authorized to enter into mediation concerning an order issued under this section if the commissioner or county board and the person to whom the order is issued both agree to mediation.\n(a) The attorney general on behalf of the state, or the county attorney on behalf of the county, may proceed to enforce penalties that are due and payable under this section in any manner provided by law for the collection of debts.\n(b) The attorney general or county attorney may petition the district court to file the administrative order as an order of the court. At any court hearing, the only issues parties may contest are procedural and notice issues. Once entered, the administrative order may be enforced in the same manner as a final judgment of the district court.\n(c) If a person fails to pay the penalty, the attorney general or county attorney may bring a civil action in district court seeking payment of the penalties, injunctive, or other appropriate relief including monetary damages, attorney fees, costs, and interest.\nIf a person fails to pay a penalty owed under this section, the agency or county board has grounds to revoke or refuse to reissue or renew a permit or license issued by the agency or county board.\nThe authority of the agency or county board to issue a corrective order assessing penalties is in addition to other remedies available under statutory or common law, except that the state or county board may not seek civil penalties under any other provision of law for the violations covered by the administrative penalty order. The payment of a penalty does not preclude the use of other enforcement provisions, under which penalties are not assessed, in connection with the violation for which the penalty was assessed.\n[Repealed, 1999 c 99 s 24]\n(a) Prior to the commissioner proposing an administrative penalty order to a feedlot operator for a violation of feedlot laws or rules, the agency staff who will determine if a penalty is appropriate and who will determine the size of the penalty shall offer to meet with the feedlot operator to discuss the violation, and to allow the feedlot operator to present any information that may affect any agency decisions on the administrative penalty order.\n(b) Notwithstanding subdivision 5, for feedlot law or rule violations for which an administrative penalty order is issued under this section, not less than 75 percent of the penalty must be forgiven if:\n(1) the abated penalty is used for approved measures to mitigate the violation for which the administrative penalty order was issued or for environmental improvements to the farm; and\n(2) the commissioner determines that the violation has been corrected or that appropriate steps are being taken to correct the action.\nTo the extent allowable under federal law, the agency shall not issue an administrative penalty order to the operator of a publicly owned treatment works for violating any effluent limitation unless both of the following conditions have been satisfied:\n(1) 45 days have elapsed since the agency has issued the operator of the treatment works with a notice of violation or an alleged violation letter that describes the violation; and\n(2) the agency provides the operator with a copy of the written summary developed under section 115.03, subdivision 5d, after or at the same time as the notice of violation or alleged violation letter is issued.",
	"repealed": false
}