{
	"id": "508.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/508.52",
	"title": "508.52 CONVEYANCE; CANCELLATION OF OLD AND ISSUANCE OF NEW CERTIFICATE.",
	"text": "An owner of registered land who desires to convey the land, or a portion thereof, in fee, shall execute a deed of conveyance, and record the deed with the registrar. The deed of conveyance shall be recorded and endorsed with the number and place of registration of the certificate of title. Before canceling the outstanding certificate of title the registrar shall show by memorial thereon the registration of the deed on the basis of which it is canceled. The encumbrances, claims, or interests adverse to the title of the registered owner shall be stated upon the new certificate, except so far as they may be simultaneously released or discharged. The registrar shall not carry forward as a memorial on the new certificate of title any memorials of a transfer on death deed if the grantors of the transfer on death deed retain no fee interest in the land covered by the new certificate. The certificate of title shall be marked \"Canceled\" by the registrar, who shall enter in the register a new certificate of title to the grantee and prepare a new certificate of title. The registrar, upon request, shall deliver to the grantee a copy of the new certificate of title. If a deed in fee is for a portion of the land described in a certificate of title, the memorial of the deed entered by the registrar shall include the legal description contained in the deed and the registrar shall enter a new certificate of title to the grantee for the portion of the land conveyed and, except as otherwise provided in this section, issue a residue certificate of title to the grantor for the portion of the land not conveyed. The registrar shall prepare and, upon request, deliver to each of the parties a copy of their respective certificates of title. In lieu of canceling the grantor's certificate of title and issuing a residue certificate to the grantor for the portion of the land not conveyed, the registrar may if the grantor's deed does not divide a parcel of unplatted land, and in the absence of a request to the contrary by the registered owner, mark by the land description on the certificate of title \"Part of land conveyed, see memorials.\" The fee for a residue certificate of title shall be paid to the registrar only when the grantor's certificate of title is canceled after the conveyance by the grantor of a portion of the land described in the grantor's certificate of title. When two or more successive conveyances of the same property are filed for registration on the same day the registrar may enter a certificate in favor of the grantee or grantees in the last of the successive conveyances, and the memorial of the previous deed or deeds entered on the prior certificate of title shall have the same force and effect as though the prior certificate of title had been entered in favor of the grantee or grantees in the earlier deed or deeds in the successive conveyances. The fees for the registration of the earlier deed or deeds shall be the same as the fees prescribed for the entry of memorials. The registrar of titles, with the consent of the transferee, may mark \"See memorials for new owner(s)\" by the names of the registered owners on the certificate of title and also add to the memorial of the transferring conveyance a statement that the memorial shall serve in lieu of a new certificate of title in favor of the grantee or grantees therein noted and may refrain from canceling the certificate of title until the time it is canceled by a subsequent transfer, and the memorial showing such transfer of title shall have the same effect as the entry of a new certificate of title for the land described in the certificate of title; the fee for the registration of a conveyance without cancellation of the certificate of title shall be the same as the fee prescribed for the entry of a memorial.",
	"repealed": false
}