{
	"id": "317A.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.181",
	"title": "317A.181 BYLAWS.",
	"text": "A corporation may, but need not, have bylaws. Bylaws may contain any provision relating to the management or regulation of the affairs of the corporation consistent with law or the articles, including but not limited to:\n(1) the number of directors, and the qualifications, manner of election, powers, duties, and compensation, if any, of directors;\n(2) the qualifications of members;\n(3) different classes of membership;\n(4) the manner of admission, withdrawal, suspension, and expulsion of members;\n(5) property, voting, and other rights and privileges of members;\n(6) the appointment and authority of committees;\n(7) the appointment or election, duties, compensation, and tenure of officers;\n(8) the time, place, and manner of calling, conducting, and giving notice of member, board, and committee meetings, or of conducting mail ballots;\n(9) the making of reports and financial statements to members; or\n(10) the number establishing a quorum for meetings of members and the board.\nInitial bylaws may be adopted under section 317A.171 by a majority of the incorporators or the first board. The bylaws may be amended in the manner provided in the articles or bylaws. In the absence of such provision, a majority of directors may amend or repeal the bylaws.\n(a) Unless reserved by the articles to the members with voting rights, initial bylaws may be adopted under section 317A.171 by a majority of the incorporators or by the first board. Unless reserved by the articles to the members, the power to adopt, amend, or repeal the bylaws is vested in the board. The power of the board is subject to the power of the members with voting rights under paragraph (b) to adopt, amend, or repeal bylaws adopted, amended, or repealed by the board. The bylaws may be amended in the manner provided in the articles or bylaws. In the absence of such provision, the following bylaw amendments are subject to approval by the members with voting rights: fixing a quorum for meetings of members; prescribing procedures for removing directors or filling vacancies in the board; fixing the number of directors or their classifications, qualifications, or terms of office prescribing procedures for removing or adding members; and increasing or decreasing the vote required for a member action. The board may adopt or amend a bylaw provision to increase the number of directors without member approval.\n(b) Unless the articles or bylaws provide otherwise, at least 50 members with voting rights or ten percent of the members with voting rights, whichever is less, may propose a resolution for action by the members to adopt, amend, or repeal bylaws adopted, amended, or repealed by the board. The resolution must contain the provisions proposed for adoption, amendment, or repeal. The limitations and procedures for submitting, considering, and adopting the resolution are the same as provided in section 317A.133, for amendment of the articles, except that board approval is not required.",
	"repealed": false
}