{
	"id": "144.702",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.702",
	"title": "144.702 HOSPITAL AND OUTPATIENT SURGICAL CENTER COSTS.",
	"text": "A hospital or outpatient surgical center may agree to submit its financial, utilization, and services reports to a voluntary, nonprofit reporting organization whose reporting procedures have been approved by the commissioner of health in accordance with this section. Each report submitted to the voluntary, nonprofit reporting organization under this section shall be accompanied by a filing fee.\nThe commissioner of health may approve voluntary reporting procedures consistent with written operating requirements for the voluntary, nonprofit reporting organization which shall be established annually by the commissioner. These written operating requirements shall specify reports, analyses, and other deliverables to be produced by the voluntary, nonprofit reporting organization, and the dates on which those deliverables must be submitted to the commissioner. These written operating requirements shall specify deliverable dates sufficient to enable the commissioner of health to process and report health care cost information system data to the commissioner of human services by August 15 of each year. The commissioner of health shall, by rule, prescribe standards for submission of data by hospitals and outpatient surgical centers to the voluntary, nonprofit reporting organization or to the commissioner. These standards shall provide for:\n(1) the filing of appropriate financial, utilization, and services information with the reporting organization;\n(2) adequate analysis and verification of that financial, utilization, and services information; and\n(3) timely publication of the costs, revenues, and rates of individual hospitals and outpatient surgical centers prior to the effective date of any proposed rate increase. The commissioner of health shall annually review the procedures approved pursuant to this subdivision.\nAny voluntary, nonprofit reporting organization which collects information on costs, revenues, and rates of a hospital or outpatient surgical center located in this state shall file a copy of the information received for each hospital and outpatient surgical center with the commissioner of health within 30 days of completion of the information collection process, together with a summary of the financial information acquired by the organization during the course of its review.\nAny voluntary, nonprofit reporting organization which receives the financial information required by sections 144.695 to 144.703 shall make the information and all summaries and analyses of the information available to the commissioner of health in accordance with procedures prescribed by the commissioner of health.\nIf the reporting and procedures of a voluntary, nonprofit reporting organization have been approved by the commissioner of health those reporting activities of the organization shall be exempt from the provisions of sections 325D.49 to 325D.66.\nFor the purposes of this section \"reporting organization\" means an association or other organization which has as one of its primary functions the collection and dissemination of acute care cost information.\nThe commissioner may require as part of the written operating requirements for the voluntary, nonprofit reporting organization that the organization provide sufficient funds to cover the costs of one professional staff position who will directly administer the health care cost information system.\nThe commissioner may withdraw approval of any voluntary, nonprofit reporting organization for failure on the part of the voluntary, nonprofit reporting organization to comply with the written operating requirements under subdivision 2. Upon the effective date of the withdrawal, all funds collected by the voluntary, nonprofit reporting organization under subdivision 1, but not expended shall be deposited in a revolving fund and are appropriated to the commissioner of health for the purposes of sections 144.695 to 144.703.\nThe commissioner may choose not to renew approval of a voluntary, nonprofit reporting organization if the organization has failed to perform its obligations satisfactorily under the written operating requirements under subdivision 2.",
	"repealed": false
}