{
	"id": "309.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/309.55",
	"title": "309.55 PROHIBITED PRACTICES.",
	"text": "No charitable organization or person acting for a charitable organization shall use the name of any other person (except that of an officer, director or trustee of the charitable organization by or for which contributions are being solicited) in public solicitation literature without the written consent of such other person. Nothing herein contained shall prevent the publication of names of contributors, without their written consent, in an annual or other periodic report issued by a charitable organization for the purpose of reporting to its membership. Nothing in section 309.52 or 309.53 shall require the disclosure in any registration statement or annual report of the names of individual contributors and the amount contributed by each one individually.\nNo charitable organization soliciting contributions shall use a name, symbol or statement so closely related or similar to that used by another charitable organization or governmental agency that the use thereof would tend to confuse or mislead the public.\nRegistration under sections 309.50 to 309.61 shall not be deemed to constitute an endorsement by the state of Minnesota of the charitable organizations so registered, and no person shall directly or indirectly misrepresent the registration hereunder to any donor or prospective donor.\nNo charitable organization and no person acting on behalf of a charitable organization shall use any uniformed personnel of any local, state or federal agency or department to solicit contributions. This subdivision shall not apply to firefighters who solicit contributions in uniform.\nNo charitable organization and no person acting on behalf of a charitable organization shall use or employ any fraud, false pretense, false promise, misrepresentation, misleading statement, misleading name, mark or identification, or deceptive practice, method or device, with the intent that others should rely thereon in connection with any charitable solicitation, including any such actions or omissions designed to confuse or mislead a person to believe that such organization is another organization having the same or like purposes; or to believe that the funds being solicited are or will be used for purposes and programs conducted within or for persons located within the state of Minnesota when such is not the case; or to otherwise present purposes and uses of the funds which are not as provided within the purposes and uses filed upon registration of said organization under this chapter, or if no such registration has been filed, then as provided under the exemption of said organization from federal and state income taxes as an organization formed and operating for charitable purposes as defined herein.\nNo person shall, either as an individual or as agent, officer or employee of a charitable organization sell or otherwise furnish for a consideration to any other person any list of contributors unless the contributor has consented to the transaction.\nNo moneys solicited within the state by any organization subject to this chapter shall be paid or contributed by the soliciting organization to any other charitable organization not registered under this chapter by which it is controlled or with which it is affiliated by contract, franchise or otherwise, whose purposes, policies, articles or bylaws are in conflict with those of the soliciting organization upon any material matter unless such other organization to which such moneys are to be paid or delivered shall agree to be bound by the purposes, policies, articles and bylaws of the soliciting organization.",
	"repealed": false
}