{
	"id": "136F.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.58",
	"title": "136F.58 BOOKSTORES; COURSE MATERIAL ACQUISITION.",
	"text": "A state college or university may operate a bookstore in a state college or university building, or may allocate space in a state college or university building and permit a person or corporation to operate a bookstore without rent at the campus' pleasure and on such conditions as the board may impose. The board may provide insurance, at no cost to the state, for the inventory of a bookstore a state college or university conducts in its building.\n(a) An instructor shall attempt to provide adequate notice to a bookstore of the intention to order required or recommended course material so that the bookstore can provide information for the instructor's consideration prior to placing an order for the course material.\n(b) A bookstore must make reasonable efforts to obtain from publishers or other sources, prior to the time an instructor requests the bookstore to order course material, the following information, including, but not limited to:\n(1) the title, edition, author, and International Standard Book Number (ISBN) of the course material;\n(2) the price for the course material;\n(3) whether the course material is bundled with optional material, whether it can be unbundled, and the price for each bundled and unbundled component;\n(4) whether the material is available in an alternative format and the cost for the alternatively formatted material;\n(5) the availability of the course material currently and in the future;\n(6) changes to the course material from the previous edition, the revision date, availability, and cost for that edition, if available; and\n(7) any known plans for future revisions of the course material.\n(c) An instructor ordering course material through a bookstore shall consider the information received from the bookstore prior to placing the final order.\n(a) Each state college and university shall compile a course schedule indicating each course offered by the state college or university for each term and shall include with the course schedule a list of the required and recommended course materials that specifies, to the extent practicable, the information required in subdivision 3, paragraph (c).\n(b) At the time required by subdivision 3, paragraph (c), a state college or university shall publish course schedules and course material lists on the state college's or university's website.\n(a) An instructor or department shall notify a college or university bookstore of the final order for required and recommended course material at least 45 days prior to the commencement of the term.\n(b) An instructor or department must notify the bookstore, as required in paragraph (a), if a previous edition of the textbook is acceptable as a substitute textbook for the course.\n(c) The bookstore must make reasonable efforts to notify students of the following information concerning the required and recommended course material at least 30 days prior to the commencement of the term for which the course material is required including, but not limited to:\n(1) the title, edition, author, and International Standard Book Number (ISBN) of the course material;\n(2) the retail price charged in the college or university bookstore for the course material, including custom textbooks;\n(3) if applicable, whether a previous edition of the textbook is acceptable as required under this subdivision;\n(4) whether the material is available in an alternative format and the cost for the alternatively formatted material; and\n(5) the most recent copyright date of the printed course material and the copyright date of the most recent prior edition of the course material, if that prior edition is acceptable for class use.\n(d) For purposes of this subdivision, \"custom textbooks\" means course materials that are compiled by a publisher at the direction of a faculty member or, if applicable, the other adopting entity in charge of selecting course materials for courses taught at a state college or university. Custom textbooks may include items such as selections from original instructor materials, previously copyrighted publisher materials, copyrighted third-party works, or elements unique to a specific state college or university.\nThe board shall, to the extent it considers necessary, adopt uniform forms for bookstores to request information under subdivision 2. The board shall encourage faculty to utilize the information received under subdivision 2 to achieve the lowest cost to students for course materials consistent with the academic freedom and choice of the faculty member.",
	"repealed": false
}