{
	"id": "82.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.62",
	"title": "82.62 LICENSING: RENEWAL.",
	"text": "The renewal of a salesperson's license is not effective beyond a date two years after the granting of the salesperson's license unless the salesperson has furnished evidence of compliance with section 82.61. The commissioner shall cancel the license of a salesperson who fails to comply with section 82.61.\n(a) A broker shall renew the license of each eligible salesperson who is and will continue to be associated with the broker. For the purposes of this subdivision, an eligible salesperson is one who has demonstrated compliance with all renewal requirements before June 15 of the renewal year.\n(b) When a broker does not intend to renew the license of an eligible salesperson who is associated with the broker, the broker must notify the salesperson in writing 30 days before June 15 of the renewal year.\n(c) When the broker responsible for the salesperson's license renewal does not renew an eligible salesperson's license before the renewal deadline, the broker shall pay on the salesperson's behalf any additional higher license fees that result.\nA person who has not received notice of approval of renewal may not continue to transact business either as a real estate broker, salesperson, or closing agent after June 30 of the renewal year until approval of renewal is received. Application for renewal of a license is timely submitted if all requirements for renewal, including continuing education requirements, have been completed and reported pursuant to section 45.43, subdivision 1.\nPersons who have failed to make a timely application for renewal of a license and who have not received the renewal license as of July 1 of the renewal year, shall be unlicensed until such time as the license has been issued by the commissioner and is received.\nExcept as provided in section 82.59, subdivision 7, and in section 82.61, paragraphs (i), (j), and (k), no examination shall be required for the renewal of any license, provided, however, any licensee having been licensed as a broker or salesperson in the state of Minnesota and who shall fail to renew the license for a period of two years shall be required by the commissioner to again take an examination.\nIf a license lapses or becomes ineffective due to the licensee's failure to file a timely renewal application or otherwise, the commissioner may institute a revocation or suspension proceeding within two years after the license was last effective and enter a revocation or suspension order as of the last date on which the license was in effect.\nFor individuals who were licensed as a broker prior to 1990, the commissioner may enter into an order to reinstate a license revoked or suspended for a failure to renew under subdivision 6, without necessity for reexamination or additional experience requirements, provided the individual submits payment for all prior past due renewal fees and demonstrates compliance with all continuing education requirements under section 82.61.\nA salesperson's or broker's license that has been canceled for failure of a licensee to complete postlicensing education requirements shall be reinstated without reexamination by completing the required instruction, submitting an application, and paying the fee for a salesperson's or broker's license within two years of the cancellation date.",
	"repealed": false
}