{
	"id": "168.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.11",
	"title": "168.11 REGISTRATION CERTIFICATE.",
	"text": "The registrar shall file such application and, upon approval thereof and upon payment of the motor vehicle tax, as herein provided, together with all arrears and penalties, if any, and upon the delivery to the registrar of the duly endorsed certificate of title of the former owner, as provided in chapter 168A, shall assign to it a distinctive number and issue to the registered owner a registration certificate, which shall contain the full name and date of birth, place of residence, with street and number, if in a city, and post office address of the registered owner, a specific description of the vehicle, and the number assigned, together with a place on the face of the certificate in which the registered owner shall, immediately upon receipt thereof, place the registered owner's signature. The registration certificate shall be retained by the registered owner until expiration. When in administering this chapter convenience or necessity requires, the registration certificate shall be used in lieu of the certificate of title on vehicles exempt from chapter 168A.\nIn the case of motor vehicles taxed under the provisions of section 168.013, subdivision 1e, a nonnegotiable copy of the registration card shall be issued. The owner or driver shall carry said copy in immediate possession at all times when operating the vehicle and shall display the same upon demand of a peace officer, and authorized representative of the department or an officer authorized by law to enforce the laws relating to the operation of motor vehicles upon the public streets and highways. Nothing herein shall be construed to vary the terms or conditions of section 168.013, subdivision 3.\nIf the registrar fails to mail to the registered owner of a motor vehicle a notification of renewal for the motor vehicle at least 30 days before the expiration of the vehicle's registration, and all past due taxes and fees have been paid, the registrar must provide at no charge a written statement to that effect to the registered owner at the owner's request. The registrar must retain in the registrar's files a record sufficient to demonstrate whether any owner of a registered motor vehicle has been notified by mail of the renewal of the registration.",
	"repealed": false
}