{
	"id": "245.4882",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4882",
	"title": "245.4882 RESIDENTIAL TREATMENT SERVICES.",
	"text": "County boards must provide or contract for enough residential treatment services to meet the needs of each child with severe emotional disturbance residing in the county and needing this level of care. Length of stay is based on the child's residential treatment need and shall be reviewed every 90 days. Services must be appropriate to the child's age and treatment needs and must be made available as close to the county as possible. Residential treatment must be designed to:\n(1) help the child improve family living and social interaction skills;\n(2) help the child gain the necessary skills to return to the community;\n(3) stabilize crisis admissions; and\n(4) work with families throughout the placement to improve the ability of the families to care for children with severe emotional disturbance in the home.\nA provider of residential services to children must be licensed under applicable rules adopted by the commissioner and must be clinically supervised by a mental health professional.\n(a) A residential treatment service provider must complete a diagnostic assessment of a child within ten calendar days of the child's admission. If a diagnostic assessment has been completed by a mental health professional within the past 180 days, a new diagnostic assessment need not be completed unless in the opinion of the current treating mental health professional the child's mental health status has changed markedly since the assessment was completed.\n(b) Notwithstanding the timeline requirements under Minnesota Rules, part 2960.0070, subpart 5, item C, subitems (1) and (2), the license holder must complete the screenings required by Minnesota Rules, part 2960.0070, subpart 5, item A, subitems (2), (3), (4), and (6), within ten calendar days. The license holder must complete the screenings required under Minnesota Rules, part 2960.0070, subpart 5, item A, subitems (1) and (5), according to the timelines in Minnesota Rules, part 2960.0070, subpart 5, item C, subitems (1) to (3).\nResidential treatment facilities and regional treatment centers serving children must plan for and assist those children and their families in making a transition to less restrictive community-based services. Discharge planning for the child to return to the community must include identification of and referrals to appropriate home and community supports that meet the needs of the child and family. Discharge planning must begin within 30 days after the child enters residential treatment and be updated every 60 days. Residential treatment facilities must also arrange for appropriate follow-up care in the community. Before a child is discharged, the residential treatment facility or regional treatment center shall provide notification to the child's case manager, if any, so that the case manager can monitor and coordinate the transition and make timely arrangements for the child's appropriate follow-up care in the community.\nNo later than January 1, 1992, the county board shall ensure that placement decisions for residential treatment services are based on the clinical needs of the child. The county board shall ensure that each entity under contract to provide residential treatment services has admission, continued stay, discharge criteria and discharge planning criteria as part of the contract. Contracts shall specify specific responsibilities between the county and service providers to ensure comprehensive planning and continuity of care between needed services according to data privacy requirements. The county board shall ensure that, at least ten days prior to discharge, the operator of the residential treatment facility shall provide written notification of the discharge to the child's parent or caretaker, the local education agency in which the child is enrolled, and the receiving education agency to which the child will be transferred upon discharge. When the child has an individualized education program, the notice shall include a copy of the individualized education program. All contracts for the provision of residential services must include provisions guaranteeing clients the right to appeal under section 245.4887 and to be advised of their appeal rights.\nThe commissioner of human services shall continue efforts to further interagency collaboration to develop a comprehensive system of services, including family community support and specialized residential treatment services for children. The services shall be designed for children with emotional disturbance who exhibit violent or destructive behavior and for whom local treatment services are not feasible due to the small number of children statewide who need the services and the specialized nature of the services required. The services shall be located in community settings.\n(a) A child may be referred for residential treatment services under this section for the purpose of crisis stabilization by:\n(1) a mental health professional as defined in section 245I.04, subdivision 2;\n(2) a physician licensed under chapter 147 who is assessing a child in an emergency department; or\n(3) a member of a mobile crisis team who meets the qualifications under section 256B.0624, subdivision 5.\n(b) A provider making a referral under paragraph (a) must conduct an assessment of the child's mental health needs and make a determination that the child is experiencing a mental health crisis and is in need of residential treatment services under this section.\n(c) A child may receive services under this subdivision for up to 30 days and must be subject to the screening and admissions criteria and processes under section 245.4885 thereafter.",
	"repealed": false
}