{
	"id": "169A.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.52",
	"title": "169A.52 TEST REFUSAL OR FAILURE; LICENSE REVOCATION.",
	"text": "If a person refuses to permit a test, then a test must not be given, but the peace officer shall report the refusal to the commissioner and the authority having responsibility for prosecution of impaired driving offenses for the jurisdiction in which the acts occurred. However, if a peace officer has probable cause to believe that the person has violated section 609.2112, 609.2113, 609.2114, or Minnesota Statutes 2012, section 609.21 (criminal vehicular homicide or injury), a test may be required and obtained despite the person's refusal. A refusal to submit to an alcohol concentration test does not constitute a violation of section 609.50 (obstructing legal process), unless the refusal was accompanied by force or violence or the threat of force or violence.\n(a) If a person submits to a test, the results of that test must be reported to the commissioner and to the authority having responsibility for prosecution of impaired driving offenses for the jurisdiction in which the acts occurred, if the test results indicate:\n(1) an alcohol concentration of 0.08 or more;\n(2) an alcohol concentration of 0.04 or more, if the person was driving, operating, or in physical control of a commercial motor vehicle at the time of the violation; or\n(3) the presence of a controlled substance listed in Schedule I or II or its metabolite, other than marijuana or tetrahydrocannabinols.\n(b) If a person submits to a test and the test results indicate the presence of an intoxicating substance, the results of that test must be reported to the authority having responsibility for prosecution of impaired driving offenses for the jurisdiction in which the acts occurred.\n(a) Upon certification by the peace officer that there existed probable cause to believe the person had been driving, operating, or in physical control of a motor vehicle in violation of section 169A.20 (driving while impaired), and that the person refused to submit to a test, the commissioner shall revoke the person's license or permit to drive, or nonresident operating privilege, even if a test was obtained pursuant to this section after the person refused to submit to testing. The commissioner shall revoke the license, permit, or nonresident operating privilege:\n(1) for a person with no qualified prior impaired driving incidents within the past ten years, for a period of not less than one year;\n(2) for a person under the age of 21 years and with no qualified prior impaired driving incidents within the past ten years, for a period of not less than one year;\n(3) for a person with one qualified prior impaired driving incident within the past ten years, or two qualified prior impaired driving incidents, for a period of not less than two years;\n(4) for a person with two qualified prior impaired driving incidents within the past ten years, or three qualified prior impaired driving incidents, for a period of not less than three years;\n(5) for a person with three qualified prior impaired driving incidents within the past ten years, for a period of not less than four years; or\n(6) for a person with four or more qualified prior impaired driving incidents, for a period of not less than six years.\n(b) Upon certification by the peace officer that there existed probable cause to believe the person had been driving, operating, or in physical control of a commercial motor vehicle with the presence of any alcohol in violation of section 169A.20 (driving while impaired), and that the person refused to submit to a test, the commissioner shall disqualify the person from operating a commercial motor vehicle and shall revoke the person's license or permit to drive or nonresident operating privilege according to the federal regulations adopted by reference in section 171.165, subdivision 2.\n(a) Upon certification by the peace officer that there existed probable cause to believe the person had been driving, operating, or in physical control of a motor vehicle in violation of section 169A.20 (driving while impaired) and that the person submitted to a test and the test results indicate an alcohol concentration of 0.08 or more or the presence of a controlled substance listed in Schedule I or II or its metabolite, other than marijuana or tetrahydrocannabinols, then the commissioner shall revoke the person's license or permit to drive, or nonresident operating privilege:\n(1) for a period of 90 days, or, if the test results indicate an alcohol concentration of twice the legal limit or more, not less than one year;\n(2) if the person is under the age of 21 years, for a period of not less than 180 days or, if the test results indicate an alcohol concentration of twice the legal limit or more, not less than one year;\n(3) for a person with one qualified prior impaired driving incident within the past ten years, or two qualified prior impaired driving incidents, for a period of not less than one year, or if the test results indicate an alcohol concentration of twice the legal limit or more, not less than two years;\n(4) for a person with two qualified prior impaired driving incidents within the past ten years, or three qualified prior impaired driving incidents, for a period of not less than three years;\n(5) for a person with three qualified prior impaired driving incidents within the past ten years, for a period of not less than four years; or\n(6) for a person with four or more qualified prior impaired driving incidents, for a period of not less than six years.\n(b) On certification by the peace officer that there existed probable cause to believe the person had been driving, operating, or in physical control of a commercial motor vehicle with any presence of alcohol and that the person submitted to a test and the test results indicated an alcohol concentration of 0.04 or more, the commissioner shall disqualify the person from operating a commercial motor vehicle under section 171.165 (commercial driver's license disqualification).\n(c) If the test is of a person's blood or urine by a laboratory operated by the Bureau of Criminal Apprehension, or authorized by the bureau to conduct the analysis of a blood or urine sample, the laboratory may directly certify to the commissioner the test results, and the peace officer shall certify to the commissioner that there existed probable cause to believe the person had been driving, operating, or in physical control of a motor vehicle in violation of section 169A.20 and that the person submitted to a test. Upon receipt of both certifications, the commissioner shall undertake the license actions described in paragraphs (a) and (b).\nIf the person is a resident without a license or permit to operate a motor vehicle in this state, the commissioner shall deny to the person the issuance of a license or permit after the date of the alleged violation for the same period as provided in this section for revocation, subject to review as provided in section 169A.53 (administrative and judicial review of license revocation).\nA revocation under this section or a disqualification under section 171.165 (commercial driver's license disqualification) becomes effective at the time the commissioner or a peace officer acting on behalf of the commissioner notifies the person of the intention to revoke, disqualify, or both, and of revocation or disqualification. The notice must advise the person of the right to obtain administrative and judicial review as provided in section 169A.53 (administrative and judicial review of license revocation). If mailed, the notice and order of revocation or disqualification is deemed received three days after mailing to the last known address of the person.\n(a) On behalf of the commissioner, a peace officer requiring a test or directing the administration of a chemical test shall serve immediate notice of intention to revoke and of revocation on a person who refuses to permit a test or on a person who submits to a test the results of which indicate an alcohol concentration of 0.08 or more.\n(b) On behalf of the commissioner, a peace officer requiring a test or directing the administration of a chemical test of a person driving, operating, or in physical control of a commercial motor vehicle shall serve immediate notice of intention to disqualify and of disqualification on a person who refuses to permit a test, or on a person who submits to a test the results of which indicate an alcohol concentration of 0.04 or more.\n(c) The officer shall:\n(1) invalidate the person's driver's license or permit card;\n(2) issue the person a temporary license effective for only seven days; and\n(3) send the notification of this action to the commissioner along with the certificate required by subdivision 3 or 4.\nWhen a nonresident's privilege to operate a motor vehicle in this state has been revoked or denied, the commissioner shall give information in writing of the action taken to the official in charge of traffic control or public safety of the state of the person's residence and of any state in which the person has a license.\n(a) The provisions of this section for revoking a driver's license, permit, or nonresident operating privilege also apply to the operating privilege for an off-road recreational vehicle and a motorboat.\n(b) Upon certification by a peace officer under subdivision 3, paragraph (a), or subdivision 4, paragraph (a) or (c), the commissioner must notify a person that the person is prohibited from operating off-road recreational vehicles and motorboats for the period provided in subdivision 3, paragraph (a), or subdivision 4, paragraph (a).",
	"repealed": false
}