{
	"id": "142G.95",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.95",
	"title": "142G.95 FUNERAL EXPENSES, PAYMENT BY COUNTY AGENCY.",
	"text": "On the death of any person receiving public assistance through MFIP, the county agency shall attempt to contact the decedent's spouse or next of kin. If the agency is not able to contact a spouse or next of kin and the personal preferences of the decedent or the practices of the decedent's faith tradition are not known, the agency shall pay for cremation of the person's remains and the burial or interment if the spouse or next of kin does not want to take possession of the ashes. If the county agency contacts the decedent's spouse or next of kin and it is determined that cremation is not in accordance with the decedent's personal preferences or the practices of the decedent's faith tradition or the personal preferences of the decedent's spouse or the decedent's next of kin, the county agency shall pay an amount for funeral expenses including the transportation of the body into or out of the community in which the deceased resided not exceeding the amount paid for comparable services under section 261.035 plus actual cemetery charges. No cremation, burial, or funeral expenses shall be paid if the estate of the deceased is sufficient to pay such expenses or if the spouse, who was legally responsible for the support of the deceased while living, is able to pay such expenses. Freedom of choice in the selection of a funeral director shall be granted to persons lawfully authorized to make arrangements for the cremation or burial of any such deceased recipient. In determining the sufficiency of such estate, due regard shall be had for the nature and marketability of the assets of the estate. The county agency may grant cremation, burial, or funeral expenses where the sale would cause undue loss to the estate. Any amount paid for cremation, burial, or funeral expenses shall be a prior claim against the estate, as provided in section 524.3-805, and any amount recovered shall be reimbursed to the agency which paid the expenses. The commissioner shall specify requirements for reports, including fiscal reports, according to section 142A.03, subdivision 2, paragraph (o). The state share shall pay the entire amount of county agency expenditures. Benefits shall be issued to recipients by the state or county subject to provisions of section 142A.10.",
	"repealed": false
}