{
	"id": "124D.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.68",
	"title": "124D.68 GRADUATION INCENTIVES PROGRAM.",
	"text": "The legislature finds that it is critical to provide options for children to succeed in school. Therefore, the purpose of this section is to provide incentives for and encourage all Minnesota students who have experienced or are experiencing difficulty in the traditional education system to enroll in alternative programs.\n(a) A pupil under the age of 21 or who meets the requirements of section 120A.20, subdivision 1, paragraph (c), and a pupil with a disability until the pupil is 22 years of age, is eligible to participate in the graduation incentives program, if the pupil:\n(1) performs substantially below the performance level for pupils of the same age in a locally determined achievement test;\n(2) is behind in satisfactorily completing coursework or obtaining credits for graduation;\n(3) is pregnant or is a parent;\n(4) has been assessed as having substance use disorder;\n(5) has been excluded or expelled according to sections 121A.40 to 121A.56;\n(6) has been referred by a school district for enrollment in an eligible program or a program pursuant to section 124D.69;\n(7) is a victim of physical or sexual abuse;\n(8) has experienced mental health problems;\n(9) has experienced homelessness sometime within six months before requesting a transfer to an eligible program;\n(10) speaks English as a second language or is an English learner;\n(11) has withdrawn from school or has been chronically truant; or\n(12) is being treated in a hospital in the seven-county metropolitan area for cancer or other life threatening illness or is the sibling of an eligible pupil who is being currently treated, and resides with the pupil's family at least 60 miles beyond the outside boundary of the seven-county metropolitan area.\n(b) A pupil is eligible to participate in the graduation incentives program under section 124D.68 and in concurrent enrollment courses offered under section 124D.09, subdivision 10, and is funded in the same manner as other pupils under this section if the pupil otherwise qualifies under paragraph (a), is at least 21 years of age and not yet 22 years of age, and:\n(1) is an English learner with a limited or interrupted formal education according to section 124D.59, subdivision 2a; or\n(2) meets three of the following four requirements:\n(i) comes from a home where the language usually spoken is other than English, or usually speaks a language other than English;\n(ii) enters school in the United States after grade 6;\n(iii) functions at least two years below expected grade level in reading and mathematics; and\n(iv) may be preliterate in the English learner's native language.\n(a) A pupil who is eligible according to subdivision 2 may enroll in a state-approved alternative program under sections 123A.05 to 123A.08.\n(b) A pupil who is eligible according to subdivision 2 and who is a high school junior or senior may enroll in postsecondary courses under section 124D.09.\n(c) A pupil who is eligible under subdivision 2, may enroll in any public elementary or secondary education program.\n(d) A pupil who is eligible under subdivision 2, may enroll in any nonpublic, nonsectarian school that has contracted with the serving school district to provide educational services. However, notwithstanding other provisions of this section, only a pupil who is eligible under subdivision 2, paragraph (a), clause (12), may enroll in a contract alternative school that is specifically structured to provide educational services to such a pupil.\n(e) A pupil who is between the ages of 17 and 21 may enroll in any adult basic education programs approved under section 124D.52 and operated under the community education program contained in section 124D.19.\nA pupil who is at least 16 years of age, who is eligible under subdivision 2, and who has been enrolled only in a public school, if the pupil has been enrolled in any school, during the year immediately before transferring under this subdivision, may transfer to any nonpublic school that has contracted with the serving school district to provide nonsectarian educational services. The school must enroll every eligible pupil who seeks to transfer to the school under this program subject to available space.\n(a) Any eligible pupil may apply to enroll in an eligible program. Approval of the resident district is not required for:\n(1) an eligible pupil to enroll in any eligible program in a nonresident district under subdivision 3 or 4 or a state-approved alternative program established under section 123A.05; or\n(2) an eligible pupil under subdivision 2, to enroll in an adult basic education program approved under section 124D.52.\n(b) Notwithstanding paragraph (a), a nonresident district must first approve the enrollment application of any eligible pupil who was expelled under section 121A.45 for a reason stated in section 124D.03, subdivision 1, paragraph (b).\nA district must disseminate information, developed by the department, about the graduation incentives program to residents in the district who are under the age of 21.\nNotwithstanding any provision to the contrary, students may not enroll in a nonresident district under this section if their enrollment in another district would result in a violation of a district's desegregation plan, as mandated and approved by the commissioner of education.\nGeneral education aid and transportation aid attributable to a pupil covered by programs under this section must be paid according to sections 127A.47, subdivision 7, and 123B.92, subdivision 3, respectively.\n(a) For a pupil attending an eligible program full time under subdivision 3, paragraph (d), the department must pay 90 percent of the district's average general education revenue less basic skills revenue to the eligible program and ten percent of the district's average general education revenue less basic skills revenue to the contracting district within 30 days after the eligible program verifies enrollment using the form provided by the department. For a pupil attending an eligible program part time, revenue, excluding compensatory revenue, shall be reduced proportionately, according to the amount of time the pupil attends the program, and the payments to the eligible program and the contracting district shall be reduced accordingly. A pupil for whom payment is made according to this section may not be counted by any district for any purpose other than computation of general education revenue. If payment is made for a pupil under this subdivision, a district shall not reimburse a program under section 124D.69 for the same pupil. The basic skills revenue generated by pupils attending the eligible program according to section 126C.10, subdivision 4, shall be paid to the eligible program.\n(b) The department must pay up to 100 percent of the revenue to the eligible program if there is an agreement to that effect between the school district and the eligible program.\n(c) Notwithstanding paragraphs (a) and (b), for an eligible program that provides chemical treatment services to students, the department must pay 100 percent of the revenue to the eligible program.\nIf for any reason any portion of this section is found by a court to be unconstitutional, the remaining portions of the section shall remain in effect.",
	"repealed": false
}