{
	"id": "103E.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.101",
	"title": "103E.101 DRAINAGE PROCEEDING AND CONSTRUCTION RECORDS.",
	"text": "All maps, plats, charts, drawings, plans, specifications, and other documents that have been filed, received in evidence, or used in connection with a drainage proceeding or construction are subject to the provisions on public records in section 15.17.\nAll maps, plats, profiles, plans, and specifications prepared and used in relation to a proceeding must:\n(1) be uniform;\n(2) have each sheet marked to identify the proceeding by the drainage project and system number;\n(3) show the name of the person preparing the sheet;\n(4) show the date the sheet was prepared; and\n(5) conform to rules and standards prescribed by the director.\nThe auditor or secretary shall keep all orders, exhibits, maps, charts, profiles, plats, plans, specifications, and records of the proceedings. These records may not be removed except when the board makes a written order to remove them. The auditor or secretary shall keep an accurate index of the proceedings and related documents in a readily usable, resilient, and secure manner.\nAll original plats, profiles, records, and field books made by the engineer during the proceedings or the construction of a drainage project are public records and the property of the drainage authority. These public records must be filed with the auditor or secretary under the direction of the drainage authority when construction is completed or when the engineer stops acting for the drainage project, whichever is earlier.\n(a) If, after thorough investigation of drainage system records, a drainage authority finds that records establishing the alignment, cross section, profile, or right-of-way of a drainage system that it administers are lost, destroyed, or otherwise incomplete, it may, by order, reestablish records defining the alignment; cross section; profile; hydraulic structure locations, materials, dimensions, and elevations; or right-of-way of the drainage system as originally constructed or subsequently improved in accordance with this chapter. The procedure for reestablishing drainage system records must involve, at a minimum, investigation and a report of findings by a professional engineer licensed in Minnesota supported by existing records and evidence, including, but not limited to, applicable aerial photographs, soil borings or test pits, culvert dimensions and invert elevations, and bridge design records. The existing and reestablished records together must define the alignment; cross section; profile; hydraulic structure locations, materials, dimensions, and elevations; and right-of-way of the drainage system. Drainage system records reestablished under this subdivision do not interrupt prescriptive occupation.\n(b) The description of a drainage system under this subdivision may be initiated by the drainage authority on its own motion or by any party affected by the drainage system filing a petition. If the system is under the jurisdiction of a county board, the petition must be filed with the auditor. If the system is under the jurisdiction of a joint county drainage authority, the petition must be filed with the auditor of the county with the largest area of property in the drainage system. If the system is under the jurisdiction of a watershed district board, the petition must be filed with the secretary.\n(c) When a drainage authority directs by resolution or when a petition is filed under this subdivision, the drainage authority, in consultation with the auditor or secretary, shall set a time and location for a hearing after the engineer's report is complete. The auditor or secretary shall give notice of the hearing by mail to the commissioner of natural resources, the executive director of the Board of Water and Soil Resources, the petitioner or petitioners, and all property owners benefited or damaged by the drainage system and shall give notice to other interested parties either in a newspaper of general circulation in the drainage system area or by publication on a website of the drainage authority.\n(d) Drainage system records reestablished under this subdivision constitute official drainage system records. A finding of drainage system right-of-way in the applicable order is a defense to a trespass claim and shall be given due weight in any subsequent court proceeding to establish the existence or nature of a property encumbrance.\nCounty boards shall provide the auditor, and watershed district boards shall provide the secretary, with necessary filing and storage facilities to protect the files and records of all proceedings under its jurisdiction. The county boards and watershed district boards may provide for the copying and filing of the documents and records of proceedings by photographic devices as provided for public records under section 15.17. In the event of loss of the originals, the photographic copies are originals after authentication by the auditor or secretary.\n(a) When a watershed district assumes authority for a drainage system according to section 103D.625, the county or joint county board transferring authority shall transfer all of the original records for the drainage system to the watershed district, except as provided in paragraph (b).\n(b) Physical or electronic copies of drainage system records that are authenticated by the county auditor having the original records may be used in place of the originals by the watershed district until the watershed district has necessary records storage facilities to protect the original records or, in the case of a partial transfer of a drainage system, until the entire drainage system is transferred to the watershed district.\nThe record of proceedings under this chapter and of orders made by the drainage authority or the district court in the proceedings, or a certified copy of a record or order, is prima facie evidence of the facts stated in the record or order and of the regularity of all proceedings prior to the making of the order.",
	"repealed": false
}