{
	"id": "394.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/394.301",
	"title": "394.301 CONDITIONAL USE PERMITS.",
	"text": "The board may by ordinance designate certain types of developments, including planned unit developments and certain land development activities as conditional uses under zoning regulations. Conditional uses may be approved upon a showing by an applicant that standards and criteria stated in the ordinance will be satisfied. Such standards and criteria shall include both general requirements for all conditional uses and, insofar as practicable, requirements specific to each designated conditional use.\nConditional use permits shall be issued by the officer administering the official controls only upon the order of the board or the planning commission as designated by ordinance as the approval authority for one or more categories of conditional uses. The planning commission shall in all instances have an opportunity to review conditional uses prior to any final decision by the designated approval authority. Public hearings shall be held in accordance with section 394.26. In connection with ordering the issuance of a conditional use permit the designated approval authority may impose such additional restrictions or conditions as it deems necessary to protect the public interest, including but not limited to matters relating to appearance, lighting, hours of operation and performance characteristics. When appropriate, restrictive covenants may be entered into regarding such matters.\nA conditional use permit shall remain in effect for so long as the conditions agreed upon are observed, provided that nothing in this section shall prevent the board from enacting or amending official controls to change the status of conditional uses.\nA certified copy of any conditional use permit shall be recorded with the county recorder or registrar of titles. The conditional use permit shall include the legal description of the property involved. The board by ordinance shall designate the county official or employee responsible for meeting the requirements of the subdivision.",
	"repealed": false
}