{
	"id": "97C.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.005",
	"title": "97C.005 SPECIAL MANAGEMENT WATERS.",
	"text": "(a) Special management waters are waters that:\n(1) have been subject to special regulations that have been evaluated and proven effective under an experimental waters designation under section 97C.001; or\n(2) are classified by the commissioner for primary use as trophy lakes, family fishing lakes, designated trout lakes, designated trout streams, special species management lakes, and other designated uses.\n(b) The commissioner may designate any waters of the state, including experimental waters, as special management waters. The commissioner shall by rule establish methods and criteria for public participation in the evaluation and designation of waters as special management waters.\n(c) Designation of special management waters under this section is not subject to chapter 14.\n(a) Before the commissioner designates special management waters, notice of the proposed designation must be given, a virtual or in-person meeting must be held, and opportunity to submit public comment must be offered.\n(b) If a water proposed to be designated is a lake with a water area of more than 1,500 acres, or is a stream or river with a reach of more than six miles, a public meeting must also be held in the seven-county metropolitan area unless a virtual meeting is held and notice of the meeting is published in a newspaper of general circulation in the seven-county metropolitan area.\n(c) For proposed special management waters other than designated trout lakes and designated trout streams, before the year that the designation is to become effective, the commissioner must give notice of the proposed designation. The notice must summarize the proposed action and invite public comment. Public comments must be accepted at least through September 30, and the commissioner must consider any public comments received in making a final decision. Notice must include:\n(1) signs of the proposed designation and instructions for submitting comments posted at publicly maintained access points on the water by June 1;\n(2) a list of proposed designations posted on the department's website by June 1, summarizing the proposed action and inviting public comment; and\n(3) a news release issued by the commissioner by July 1, a notice published in a newspaper of general circulation in the area where the waters are located by August 15, and at least one more digital media communication published by August 31.\n(d) A virtual or in-person meeting must be held before September 20 where public comment must be accepted. An in-person meeting, where public comment must be accepted, must be held in the county where the largest portion of the waters is located if:\n(1) a water to be designated is a lake over 5,000 acres or is a stream or river reach over ten miles; or\n(2) a request for an in-person meeting is submitted to the commissioner by August 20 before the year that the designation is to become effective.\n(e) For waters proposed to be designated as trout streams or trout lakes, notice of the proposed designation must be published at least 90 days before the effective date of the designation in a news release issued by the commissioner and in a newspaper of general circulation in the area where the waters are located. In addition, all riparian owners along the waters must be notified at least 90 days before the effective date of the designation.\n(f) The notices required in this subdivision must summarize the proposed action, invite public comment, and specify a deadline for the receipt of public comments. The commissioner shall mail a copy of each required notice to persons who have registered their names with the commissioner for this purpose. The commissioner shall consider any public comments received in making a final decision.\nThe commissioner may, in accordance with the procedures in subdivision 2, paragraphs (c) and (e), or by rule under chapter 14, establish open seasons, limits, methods, and other requirements for taking fish on special management waters. The commissioner may, by written order published in the State Register, amend daily, possession, or size limits to make midseason adjustments based on available harvest, angling pressure, and population data to manage the fisheries in the 1837 Ceded Territory in compliance with the court orders in Mille Lacs Band of Chippewa v. Minnesota, 119 S. Ct. 1187 (1999) and in the state waters of Upper Red Lake. The midseason adjustments in daily, possession, or size limits are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. Before the written order is effective, the commissioner shall attempt to notify persons or groups of persons affected by the written order by public announcement, posting, and other appropriate means as determined by the commissioner.",
	"repealed": false
}