{
	"id": "527.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/527.21",
	"title": "527.21 DEFINITIONS.",
	"text": "For purposes of this chapter:\n(1) \"Adult\" means an individual who has attained the age of 21 years, notwithstanding any law to the contrary.\n(2) \"Benefit plan\" means an employer's plan for the benefit of an employee or partner.\n(3) \"Broker\" means a person lawfully engaged in the business of effecting transactions in securities or commodities for the person's own account or for the account of others.\n(4) \"Conservator\" means a person appointed or qualified by a court to act as general, limited, or temporary guardian of a minor's property or a person legally authorized to perform substantially the same functions.\n(5) \"Court\" means a court that exercises probate jurisdiction.\n(6) \"Custodial property\" means (i) any interest in property transferred to a custodian under this chapter and (ii) the income from and proceeds of that interest in property.\n(7) \"Custodian\" means a person so designated under section 527.29 or a successor or substitute custodian designated under section 527.38.\n(8) \"Financial institution\" means a bank, trust company, savings institution, or credit union, chartered and supervised under state or federal law.\n(9) \"Legal representative\" means an individual's personal representative or conservator.\n(10) \"Member of the minor's family\" means the minor's parent, stepparent, spouse, grandparent, brother, sister, uncle, or aunt, whether of the whole or half blood or by adoption.\n(11) \"Minor\" means an individual who has not attained the age of 21 years, notwithstanding any law to the contrary.\n(12) \"Person\" means an individual, corporation, organization, or other legal entity.\n(13) \"Personal representative\" means an executor, administrator, successor personal representative, or special administrator of a decedent's estate or a person legally authorized to perform substantially the same functions.\n(14) \"State\" includes any state of the United States, the District of Columbia, the Commonwealth of Puerto Rico, and any territory or possession subject to the legislative authority of the United States.\n(15) \"Street name or nominee name\" means registration used by a broker or financial institution for holding securities when not registered in the name of the beneficial owner.\n(16) \"Transfer\" means a transaction that creates custodial property under section 527.29.\n(17) \"Transferor\" means a person who makes a transfer under this chapter.\n(18) \"Trust company\" means a financial institution, corporation, or other legal entity, authorized to exercise general trust powers.",
	"repealed": false
}