{
	"id": "469.029",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.029",
	"title": "469.029 DISPOSAL OF PROPERTY.",
	"text": "In accordance with a redevelopment plan, an authority may make any of its land in a redevelopment project available for use by private individuals, firms, corporations, partnerships, insurance companies, or other private interests, or by public agencies, by sale, lease, or otherwise, or the authority itself may retain property for redevelopment by it. The land shall be made available at a price that shall, except as provided for in subdivisions 9 and 10, take into consideration the estimated fair market or rental value of the cleared land as determined pursuant to section 469.032, for proposed uses in accordance with the redevelopment plan.\nAny such lease or sale may be made without public bidding but only after a public hearing, after published notice, by the authority at least once not less than ten days nor more than 30 days prior to the date of the hearing upon the proposed lease or sale and the provisions thereof. The terms of any such lease shall be fixed by the authority, and the instrument of lease may provide for renewals upon reappraisals and with rentals and other provisions adjusted to the reappraisals. Every such lease or sale shall provide that the lessee or purchaser shall carry out or cause to be carried out the approved project area redevelopment plan or approved modifications thereof and that no use shall be made of any land or real property included in the lease or sale nor any building or structure erected thereon which does not conform to the approved plan or approved modifications thereof. In the instrument of lease or sale the authority may include other terms, conditions, and provisions in the judgment of the authority will provide reasonable assurance of the priority of the obligations of the lease or sale and of conformance to the plan over any other obligations of the lessee or purchaser, and also assurance of the financial and legal ability of the lessee or purchaser to carry out and conform to the plan and the terms and conditions of the lease or sale, to begin the building of any improvements within a period of time which the authority fixes as reasonable. The instrument shall also include the terms, conditions, and specifications concerning buildings, improvements, subleases, or tenancies, maintenance and management, and any other related matters the authority may reasonably impose or approve, including provisions whereby the obligations to carry out and conform to the project area plan shall run with the land. If maximum rentals to be charged to tenants of housing are specified, provision may be made for periodic reconsideration of the rental bases, with a view to proposing modification of the project area plan with respect to the rentals.\nAfter the property in a project area has been assembled by an authority, the authority may transfer by deed to local public bodies those pieces of property which, in accordance with the redevelopment plan, are to be devoted to public uses, other than public housing or redevelopment purposes. Except for property transferred by dedication, gift, or exchange, the transferee body shall pay to the authority the sum agreed upon, and, in the absence of agreement, the sum determined by arbitration. The authority shall reimburse the redevelopment project fund the fair use value of any property in a redevelopment project transferred to a public low-rent housing project.\nThe authority may lease or sell parts of a project area separately to any persons. Any such sale or lease of a part or parts of a project area shall be subject to the provisions of this section, excluding property required for public low-rent housing projects.\nUntil the authority certifies that all building constructions and other physical improvements specified to be done and made by the purchaser of the area have been completed, the purchaser shall not convey the area, or any part thereof, without the consent of the authority. Consent shall not be given unless the grantee or mortgagee of the purchaser is obligated by written instrument to the authority to carry out that portion of the redevelopment plan which falls within the boundaries of the conveyed property, and also that the grantee, the grantee's heirs, representatives, successors, and assigns, shall not convey, lease, or let the conveyed property or any part thereof, or erect or use any building or structure erected thereon, except in conformance with the approved project area redevelopment plan or approved modifications thereof.\nA redevelopment plan may be modified at any time. The modification must be adopted by the authority and the governing body of the political subdivision in which the project is located, upon the notice and after the public hearing required for the original adoption of the redevelopment plan. If the authority determines the necessity of changes in an approved redevelopment plan or approved modification thereof, which changes do not alter or affect the exterior boundaries, and do not substantially alter or affect the general land uses established in the plan, the changes shall not constitute a modification of the redevelopment plan nor require approval by the governing body of the political subdivision in which the project is located.\nAs security for its fulfillment of the agreement with the authority, a purchaser or lessee shall furnish a performance bond, with the surety and in the form and amount the authority may approve, or make any other guaranty the authority deems necessary in the public interest. If the authority finds that the redevelopment is not being carried out or maintained in accordance with the contract terms and conditions, or there is a failure to prosecute the work with diligence, or to assume its completion on time, it shall notify the purchaser or lessee and the surety in writing of the noncompliance. Unless the purchaser or lessee complies with the terms of agreement within 20 days from the date of the notice, the authority may take over the work and may cause the work to be done, and the cost of the work shall be paid by the surety. The authority may take possession of and utilize in completion of the work the materials, appliances, and plant as may be on the site of the work and necessary for it.\nThere shall be no discrimination in the use of any land in a redevelopment project because of race or religious, political, or other affiliations.\nWith or without accordance to a redevelopment plan, an authority may make any of its lands in a project that are vacant, open and undeveloped or lands that contain vacated residential dwelling structures that are substandard as that term is defined in section 469.012, subdivision 1h, available for use by sale, lease, grant, transfer, conveyance, or otherwise to persons or families of low and moderate income. The property shall be made available at a price which may take into consideration the estimated fair market value of the real estate, as determined pursuant to section 469.032, if the low- or moderate-income persons or families have the financial ability or building trade skills, as determined by the authority, to build on the vacant, open and undeveloped land or to repair, improve, or rehabilitate the residential dwelling structures, so as to conform with the applicable state, county, or city, health, housing, building, fire prevention, and housing maintenance codes within a reasonable period of time as determined by the authority. The authority may require an agreement from those persons or families of low or moderate income to build on the lands or to repair, improve, or rehabilitate the residential dwelling structures within a reasonable period of time so as to conform to the codes as a condition to final legal title to the lands and the residential dwelling units. Nothing in Laws 1974, chapter 228, shall prohibit an authority from making rehabilitation loans and grants, pursuant to section 469.012, subdivision 6, or procuring other authorized financial assistance for persons or families of low and moderate income who acquire real property pursuant to this section, in furtherance of the objectives of this section.\nOn or before December 31 each year, each authority shall make a survey of all lands held, owned, or controlled by it to determine what land, including air rights, is in excess of its foreseeable needs. A description of each parcel found to be in excess of foreseeable needs shall be made a matter of public record. Any low- or moderate-income resident or nonprofit housing corporation shall upon request be provided with a list of the parcels without charge. With or without accordance to a redevelopment plan, an authority may make the excess lands available for use as a housing or housing development project by a nonprofit housing corporation by sale, lease, grant, transfer, conveyance, or otherwise. The price may take into consideration the estimated fair market or rental value of the real property, as determined pursuant to section 469.032 and upon terms and conditions, notwithstanding any other provisions of law to the contrary, that the authority deems to be best suited to the development of the parcel for housing available to persons and families of low and moderate income.",
	"repealed": false
}