{
	"id": "641.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/641.12",
	"title": "641.12 COLLECTION OF FEES AND BOARD BILLS.",
	"text": "A county board may require that each person who is booked for confinement at a county or regional jail, and not released upon completion of the booking process, pay a fee to the sheriff's department of the county in which the jail is located to cover costs incurred by the county in the booking of that person. The fee is payable immediately from any money then possessed by the person being booked, or any money deposited with the sheriff's department on the person's behalf. If the person has no funds at the time of booking or during the period of any incarceration, the sheriff shall notify the district court in the county where the charges related to the booking are pending, and shall request the assessment of the fee. Notwithstanding section 609.10 or 609.125, upon notification from the sheriff, the district court must order the fee paid to the sheriff's department as part of any sentence or disposition imposed. If the person is not charged, is acquitted, or if the charges are dismissed, the sheriff shall return the fee to the person at the last known address listed in the booking records.\nAt the end of every month the sheriff of each county shall render to the county auditor a statement showing the name of each fugitive from justice, United States prisoner, one committed from another county or one committed by virtue of any city ordinance, the amount due the county for board of each and from whom, and also of all amounts due for board of prisoners for the preceding month.\n(a) A county board may require that a person convicted of a crime and confined in the county jail, workhouse, or correctional or work farm pay the cost of the person's room, board, clothing, medical, dental, and other correctional services. The board shall establish a schedule to charge persons under this subdivision. The charges may be assessed for any time for which the person receives credit for time served against the sentence imposed as a result of the conviction. The costs may be collected at any time while the person is under sentence or after the sentence has been discharged. During the period of confinement, the costs may be deducted from any money possessed by the person or any money deposited with the local correctional or law enforcement agency on the person's behalf. The board, or local correctional agency or sheriff with authority over the jail, workhouse, or farm, may use any available civil means of debt collection in collecting costs under this subdivision.\n(b) The chief executive officer of the local correctional agency or sheriff shall waive payment of the costs under this subdivision if the officer or sheriff determines that the person does not have the ability to pay the costs, payment of the costs would create undue hardship for the person or the person's immediate family, the prospects for payment are poor, or there are extenuating circumstances justifying waiver of the costs.\n(c) If a person has been ordered by a court to pay restitution, the person shall be obligated to pay the restitution ordered before paying the costs under this subdivision. However, if the person is making reasonable payments to satisfy the restitution obligation, the local correctional agency or sheriff may also collect costs under this section.\n(a) A county board may require that an offender who participates in sentencing to service pay a fee.\n(b) A county board may assess a fee to entities that receive direct benefit from sentencing to service work crews.",
	"repealed": false
}