{
	"id": "354A.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.092",
	"title": "354A.092 SABBATICAL LEAVE.",
	"text": "Any teacher in the coordinated program of the St. Paul Teachers Retirement Fund Association who is granted a sabbatical leave is entitled to receive allowable service credit in the association for periods of sabbatical leave. To obtain the service credit, the teacher on sabbatical leave shall make an employee contribution to the association. No teacher is entitled to receive more than three years of allowable service credit under this section for a period or periods of sabbatical leave during any ten consecutive years. If the teacher granted a sabbatical leave makes the employee contribution for a period of sabbatical leave under this section, the employing unit shall make an employer contribution on behalf of the teacher to the association for that period of sabbatical leave in the manner described in section 354A.12, subdivision 2a. The employee and employer contributions must be in an amount equal to the employee and employer contribution rates in effect for other active members of the association covered by the same program applied to a salary figure equal to the teacher's actual covered salary for the plan year immediately preceding the sabbatical leave period. Payment of the employee contribution authorized under this section must be made by the teacher on or before June 30 of the year next following the year in which the sabbatical leave terminated and must be made without interest. The required employer contributions must be paid by the employing unit within 30 days after notification by the association of the amount due. If the employee contributions for the sabbatical leave period are less than an amount equal to the applicable contribution rate applied to a salary figure equal to the teacher's actual covered salary for the plan year immediately preceding the sabbatical leave period, service credit must be prorated. The prorated service credit must be determined by the ratio between the amount of the actual payment which was made and the full contribution amount payable under this section.",
	"repealed": false
}