{
	"id": "326B.092",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.092",
	"title": "326B.092 FEES.",
	"text": "(a) If the applicant for a license must pass an examination administered by the commissioner in order to obtain the license, then the application for the initial license must be accompanied by an application and examination fee of $50, which is separate from the license fee. The license fee is due after the applicant passes the examination and before the license is issued.\n(b) If the applicant for a Minnesota license holds a license in another state and is seeking Minnesota licensure without examination based on reciprocity, then the application for the Minnesota license must be accompanied by the application and examination fee of $50, which is separate from the license fee. If the commissioner approves the application, then the license fee is due before the license is issued.\nIf the applicant for a license is not required to pass an examination in order to obtain the license, or is required to pass an examination that is not administered by the commissioner, then the license fee must accompany the application for the license. If the application is for a license issued under sections 326B.802 to 326B.885 and is not an application for license renewal, then the contractor recovery fund fee required under section 326B.89, subdivision 3, is due before the license is issued.\nThe department must receive a complete application for license renewal prior to the license expiration date. If the department receives a renewal application after the expiration of the license, then the renewal application must be accompanied by a late fee equal to one-half of the license renewal fee; except that, for the purpose of calculating the late fee only, the license renewal fee shall not include any contractor recovery fund fee required by section 326B.89, subdivision 3.\nIf the department receives a renewal application within two years after expiration of the license, the renewal application must be accompanied by all license renewal fees to cover the period that the license was expired, plus the late fee described in subdivision 3 and the license renewal fee for the current renewal period.\nIf the applicant does not include all required fees with the application, then the application will be incomplete and the department will notify the applicant of the amount of the deficiency.\nApplication and examination fees, license fees, license renewal fees, and late fees are nonrefundable except for:\n(1) license renewal fees received more than two years after expiration of the license, as described in section 326B.094, subdivision 2;\n(2) any overpayment of fees; and\n(3) if the license is not issued or renewed, the contractor recovery fund fee and any additional assessment paid under subdivision 7, paragraph (e).\n(a) The license fee for each license is the base license fee plus any applicable board fee, continuing education fee, and contractor recovery fund fee and additional assessment, as set forth in this subdivision.\n(b) For purposes of this section, \"license duration\" means the number of years for which the license is issued except that if the initial license is not issued for a whole number of years, the license duration shall be rounded up to the next whole number.\n(c) If there is a continuing education requirement for renewal of the license, then a continuing education fee must be included in the renewal license fee. The continuing education fee for all license classifications is $5.\n(d) The base license fee shall depend on whether the license is classified as an entry level, master, journeyworker, or business license, and on the license duration. The base license fee shall be:\n(e) If the license is issued under sections 326B.31 to 326B.59 or 326B.90 to 326B.925, then a board fee must be included in the license fee and the renewal license fee. The board fee for all license classifications shall be: $4 if the license duration is one year; and $8 if the license duration is two years.\n(f) If the application is for the renewal of a license issued under sections 326B.802 to 326B.885, then the contractor recovery fund fee required under section 326B.89, subdivision 3, and any additional assessment required under section 326B.89, subdivision 16, must be included in the license renewal fee.\n(g) Notwithstanding the fee amounts described in paragraphs (d) to (f), for the period October 1, 2021, through September 30, 2023, the following fees apply:",
	"repealed": false
}