{
	"id": "435.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/435.19",
	"title": "435.19 ASSESSMENT ON PUBLIC PROPERTY; EXCEPTION; SUE TO BE PAID.",
	"text": "Any city, however organized, or any town having authority to levy special assessments may levy special assessments against the property of a governmental unit benefited by an improvement to the same extent as if such property were privately owned, but no such assessments, except for storm sewers and drain systems, shall be levied against a governmental unit for properties used or to be used for highway rights-of-way. A \"governmental unit\" means a county, city, town, public corporation, a school district and any other political subdivision, except a city of the first class operating under a home rule charter and the school district, park board or other board or department of such city operating under such charter. If the amount of any such assessment, except one against property of the state, is not paid when due, it may be recovered in a civil action brought by the city or such town against the governmental unit owning the property so assessed.\nIn the case of property owned by the state or any instrumentality thereof, the governing body of the city or town may determine the amount that would have been assessed had the land been privately owned. Such determination shall be made only after the governing body has held a hearing on the proposed assessment after at least two weeks' notice of the hearing has been given by registered or certified mail to the head of the instrumentality, department or agency having jurisdiction over the property. The amount thus determined may be paid by the instrumentality, department or agency from available funds. If no funds are available and such instrumentality, department or agency is supported in whole or in part by appropriations from the general fund, then it shall include in its next budget request the amount thus determined. No instrumentality, department or agency shall be bound by the determination of the governing body and may pay from available funds or recommend payment in such lesser amount as it determines is the measure of the benefit received by the land from the improvement.\nIn the case of property owned by a city of the first class or board or instrumentality thereof, the governing body of any city or town may determine the amount that would have been assessed had the land been privately owned. Such determination shall be made only after the governing body has held a hearing on the proposed assessment after at least two weeks' notice of the hearing has been given by certified mail to the city or its instrumentality operating the property. Such city of the first class or board or instrumentality thereof may pay the amount so determined or such lesser amount as it determines is the measure of the benefit received by the land from the improvement. In addition to any authority now possessed by the park board of any such city of the first class to levy taxes it may levy upon the taxable property of such city a tax sufficient to raise the amount so determined as the benefit to the property owned or operated by such park board.\nWhen any local improvement has been heretofore made and special assessments have been levied to finance all or part of the cost of such improvement under any law or charter not expressly authorizing assessments against public property, any governmental unit or any city of the first class or board or instrumentality of a city of the first class owning property benefited by such improvement may pay to the city or town making the improvement the amount of any benefit received therefrom not in excess of the amount that would have been assessable against such property were it privately owned.\nThis section shall not modify any law or charter provision authorizing the imposition of special assessments against governmental units.",
	"repealed": false
}