{
	"id": "424A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.10",
	"title": "424A.10 STATE SUPPLEMENTAL BENEFIT; FIREFIGHTERS.",
	"text": "For purposes of this section:\n(1) \"qualified recipient\" means a firefighter who receives a lump-sum distribution of pension or retirement benefits from a firefighters relief association or from the statewide volunteer firefighter plan; and\n(2) \"survivor of a deceased active or deferred firefighter\" means the surviving spouse of a deceased active or deferred firefighter or, if none, the surviving child or children of a deceased active or deferred firefighter, or, if none, the designated beneficiary of the deceased active or deferred firefighter, or, if no beneficiary has been designated, the estate of the deceased active or deferred firefighter.\n(a) Upon the payment by a firefighters relief association or by the statewide volunteer firefighter plan of a lump-sum distribution to a qualified recipient, the association or retirement plan, as applicable, must pay a supplemental benefit to the qualified recipient. Notwithstanding any law to the contrary, the relief association must pay the supplemental benefit out of its special fund and the statewide volunteer firefighter plan must pay the supplemental benefit out of the statewide volunteer firefighter plan. This benefit is an amount equal to ten percent of the regular lump-sum distribution that is paid on the basis of the recipient's service as a firefighter. In no case may the amount of the supplemental benefit exceed $1,000. A supplemental benefit under this paragraph may not be paid to a survivor of a deceased firefighter in that capacity.\n(b) Upon the payment by a relief association or the retirement plan of a lump-sum survivor benefit to a survivor of a deceased firefighter, the association or retirement plan, as applicable, must pay a supplemental survivor benefit to the survivor of the deceased firefighter from the special fund of the relief association and the retirement plan must pay a supplemental survivor benefit to the survivor of the deceased firefighter from the retirement fund if chapter 353G so provides. The amount of the supplemental survivor benefit is 20 percent of the survivor benefit, but not to exceed $2,000.\n(c) For purposes of this section, the term \"regular lump-sum distribution\" means the pretax lump-sum distribution excluding any interest that may have been credited during a firefighter's period of deferral.\n(d) An individual may receive a supplemental benefit under paragraph (a) or under paragraph (b), but not under both paragraphs with respect to one lump-sum firefighter benefit.\n(e) If a qualified recipient receives more than one lump-sum distribution, the qualified recipient is eligible to receive a supplemental benefit or supplemental survivor benefit, whichever is applicable, with each lump-sum distribution. Each supplemental benefit shall be calculated pursuant to paragraph (a) or (b), as applicable, and shall be subject to a separate limit.\n(f) Qualified recipients who elect to receive their lump-sum distribution in installments under section 424A.016, subdivision 5, or 424A.02, subdivision 8, are eligible to receive one supplemental benefit calculated on the total lump-sum distribution amount under paragraph (a) or (b), as applicable.\n(a) Each year, to be eligible for state reimbursement of the amount of supplemental benefits paid under subdivision 2 during the preceding calendar year, the firefighters relief association or the statewide volunteer firefighter plan shall apply to the commissioner of revenue by February 15. By March 15, the commissioner shall reimburse the relief association for the amount of the supplemental benefits paid by the relief association to qualified recipients and to survivors of deceased firefighters.\n(b) The commissioner of revenue shall prescribe the form of and supporting information that must be supplied as part of the application for state reimbursement. The commissioner of revenue shall reimburse the relief association by paying the reimbursement amount to the treasurer of the municipality where the association is located and shall reimburse the retirement plan by paying the reimbursement amount to the executive director of the Public Employees Retirement Association. Within 30 days after receipt, the municipal treasurer shall transmit the state reimbursement to the treasurer of the association if the association has filed a financial report with the municipality. If the relief association has not filed a financial report with the municipality, the municipal treasurer shall delay transmission of the reimbursement payment to the association until the complete financial report is filed. If the association has dissolved or has been removed as a trustee of state aid, the treasurer shall deposit the money in a special account in the municipal treasury, and the money may be disbursed only for the purposes and in the manner provided in section 424A.08. When paid to the association, the reimbursement payment must be deposited in the special fund of the relief association and when paid to the retirement plan, the reimbursement payment must be deposited in the retirement fund of the plan.\n(c) A sum sufficient to make the payments is appropriated from the general fund to the commissioner of revenue.\n(a) The supplemental benefit provided by this section is in lieu of the state income tax exclusion for lump-sum distributions of retirement benefits paid to firefighters.\n(b) If the law is modified to exclude or exempt firefighters' lump-sum distributions from state income taxation, the supplemental benefits under this section are no longer payable, beginning with the first calendar year in which the exclusion or exemption is effective. This subdivision does not apply to exemption of all or part of a lump-sum distribution under section 290.032 or 290.0802.\n[Repealed, 2013 c 111 art 6 s 13]",
	"repealed": false
}