{
	"id": "299A.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.79",
	"title": "299A.79 TRAFFICKING STUDY; ANALYSIS AND USE OF DATA.",
	"text": "The commissioner shall analyze the data collected in section 299A.785 to develop a plan to address current trafficking and prevent future trafficking in this state. The commissioner may evaluate various approaches used by other state and local governments to address trafficking. The plan must include, but not be limited to:\n(1) ways to train agencies, organizations, and officials involved in law enforcement, prosecution, and social services;\n(2) ways to increase public awareness of trafficking; and\n(3) procedures to enable the state government to work with nongovernmental organizations to prevent trafficking.\nThe training plan required in subdivision 1 must include:\n(1) methods used in identifying trafficking victims, including preliminary interview techniques and appropriate interrogation methods;\n(2) methods for prosecuting traffickers;\n(3) methods for protecting the rights of trafficking victims, taking into account the need to consider human rights and special needs of women and children trafficking victims; and\n(4) methods for promoting the safety of trafficking victims.\nThe public awareness initiative required in subdivision 1 must address, at a minimum, the following subjects:\n(1) the risks of becoming a trafficking victim;\n(2) common recruitment techniques; use of debt bondage, forced or coerced labor or services, prostitution, and other coercive tactics; and risks of assault, criminal sexual conduct, exposure to sexually transmitted diseases, and psychological harm;\n(3) crime victims' rights; and\n(4) reporting recruitment activities involved in trafficking.\nThe commissioner shall report the plan to the chairs and ranking minority members of the senate and house of representatives committees and divisions having jurisdiction over criminal justice policy and funding by December 15, 2006.",
	"repealed": false
}