{
	"id": "115B.178",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.178",
	"title": "115B.178 ASSOCIATION WITH RELEASE; COMMISSIONER'S DETERMINATION.",
	"text": "(a) The commissioner may issue determinations that certain actions proposed to be taken at real property subject to a release or threatened release of a hazardous substance or pollutant or contaminant will not constitute conduct associating the person with the release or threatened release for the purpose of section 115B.03, subdivision 3, paragraph (a), clause (4). Proposed actions that may be covered by a determination under this section include response actions approved by the commissioner to address the release or threatened release, actions to improve or develop the real property, loans secured by the real property, or other similar actions. A determination may be subject to terms and conditions deemed reasonable by the commissioner. When a person takes actions in accordance with a determination issued under this subdivision, the actions do not associate the person with the release for the purpose of section 115B.03, subdivision 3, paragraph (a), clause (4).\n(b) The commissioner may also issue a determination under paragraph (a) that certain actions taken in the past at the real property did not constitute conduct associating the person requesting the determination with the release or threatened release for purposes of section 115B.03, subdivision 3, paragraph (a), clause (4). The person requesting a determination under this paragraph shall conduct an investigation approved by the commissioner that identifies the nature and extent of the release or threatened release or shall take response actions in accordance with a response action plan approved by the commissioner. Any such determination shall be limited to the represented facts of the past actions and shall not apply to actions that are not represented or disclosed. The determination may be subject to such other terms and conditions as the commissioner deems reasonable.\nSection 115B.177, subdivision 2, applies to a determination by the commissioner under this section.",
	"repealed": false
}