{
	"id": "327C.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.09",
	"title": "327C.09 TERMINATION.",
	"text": "A park owner may recover possession of land upon which a manufactured home is situated only for a reason specified in this section or section 327C.095.\nThe park owner gives ten days' written notice to the resident and to any party holding a security interest in the resident's home known to the park owner that a periodic rental or utilities payment owed to the park owner is overdue, and neither the resident nor the secured party cures the default within ten days of receiving the notice.\nThe resident fails to comply with a local ordinance, state law or state rule relating to manufactured homes within the time the ordinance, state law or state rule provides or, if no time is provided, within a reasonable time after the resident has received written notice of noncompliance.\nThe resident fails to comply with a rule within 30 days after receiving written notice of the alleged noncompliance, except the 30-day notice requirement does not apply to nonpayment of rent. To be effective, the notice must specify the date, approximate time, and nature of the alleged rule violation. Loud noise created by residents, guests, or their equipment is a rule violation. After written notice has been provided for two prior incidents, loud noise is a violation of subdivision 5.\nThe resident acts in the park in a manner which endangers other residents or park personnel, causes substantial damage to the park premises or substantially annoys other residents, and has received 30 days' written notice to vacate, except the park owner may require the resident to vacate immediately if the resident violates this subdivision a second or subsequent time after receipt of the notice. To be effective, the notice must specify the time, date, and nature of the alleged annoyance, damage, or endangerment. A park owner seeking to evict pursuant to this subdivision need not produce evidence of a criminal conviction, even if the alleged misconduct constitutes a criminal offense.\nThe resident has repeatedly committed serious violations of the rental agreement or provisions of a local ordinance or state law or state rule relating to manufactured homes, and the park owner has given the resident written notice of the violations and has given the resident a written warning that any future serious violation will be treated as cause for eviction as provided in this subdivision, and within six months of receiving the warning the resident commits a serious violation of any park rule or any provision of a local ordinance or state law or state rule relating to manufactured homes.\nThe resident's application for tenancy contained a material misstatement which induced the park owner to approve the applicant as a resident, and the park owner discovers and acts upon the misstatement within one year of the time the resident began paying rent.\nThe park owner has specific plans to make improvements to the park premises which will substantially benefit the health and safety of the residents or have been ordered by a government agency, and which necessitate removal of the resident's manufactured home from the park. The park owner must give the resident 90 days' written notice and include in that notice a statement identifying how the improvements will substantially benefit the health and safety of the residents. If another lot is available in the park, the park owner must allow the resident to relocate the home to that lot unless the home, because of its size or local ordinance, is not compatible with that lot.\nMS 1986 [Repealed, 1987 c 179 s 12]",
	"repealed": false
}