{
	"id": "237.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.665",
	"title": "237.665 PROHIBITION AGAINST BILLING FOR UNAUTHORIZED CHARGES.",
	"text": "(a) A telephone company or telecommunications carrier providing local service shall not include on a customer's bill a charge for goods or services on behalf of a third-party service provider unless the third-party service provider has obtained the customer's prior express authorization to include such charges on the customer's bill.\n(b) If a customer of a telephone company or telecommunications carrier notifies the telephone company or telecommunications carrier that an unauthorized charge from a third-party service provider has been included on the customer's bill, then the telephone company or telecommunications carrier shall remove the unauthorized charge. The telephone company or telecommunications carrier shall credit to the customer any amounts paid for the unauthorized charges that were billed by the telephone company or telecommunications carrier during the six months prior to the customer's complaint, unless the third-party service provider can produce within 14 calendar days of the complaint evidence to the customer and the telephone company or the telecommunications carrier of prior express authorization by the customer.\n(c) A third-party service provider meets the prior express authorization requirements of this section only if it obtains or receives a customer's written authorization in the form of a letter of agency, a customer's oral authorization verified by an independent third party, or a copy of an email notice of verification as described in clause (3).\n(1) If the third-party service provider obtains the customer's written authorization in the form of a letter of agency, it must be a separate or easily separable document. The sole purpose of the letter of agency shall be to authorize a charge for goods or services to appear on the customer's telephone bill. The letter of agency must be of sufficient size to be clearly legible and must contain clear and unambiguous language that contains separate statements for each good or service for which the customer is agreeing to be billed. The letter of agency must be signed and dated by the customer.\n(2) If the customer's authorization is oral, the authorization must be verified by an independent third-party verifier. The verification is valid only if:\n(i) the independent third party confirms the customer's identity with information unique to the customer unless the customer refuses, then that fact must be noted; and\n(ii) the independent third party informs the customer that the customer is agreeing to be billed for goods or services that will appear as a charge on the customer's telephone bill.\n(3) If a customer enters a contract via the Internet with a third-party service provider for goods or services which are charged to the bill issued by the customer's telephone company or telecommunications carrier providing local service, the third-party service provider must, within 48 hours of receiving the customer's authorization, send the customer, via email, a notice of verification confirming the authorization. The third-party service provider shall maintain a copy of the notice of verification for the duration of the contract as a record of the customer's express authorization to be charged for the goods or services on the customer's telephone bill for local service.\n(d) For direct-dialed calls, where the call itself represents the service for which the charge is placed on a customer's local telephone bill, such as \"900 number\" services and \"dial around\" services, evidence that the call was placed from the number that is subject to the telephone bill shall be considered sufficient evidence of authorization for that call for billing authorization purposes established in this section. Nothing in this section shall be construed to change a telephone company's or telecommunication carrier's obligations or affect a telephone subscriber's rights under section 325F.692.\n(e) This section does not apply to charges for collect calls.\n(f) Nothing in this section restricts the right of a telephone company or telecommunications carrier to seek to recover from a third-party service provider unauthorized charges credited to the customer by the telephone company or telecommunications carrier.",
	"repealed": false
}