{
	"id": "514.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.02",
	"title": "514.02 NONPAYMENT FOR IMPROVEMENT; PENALTIES AND REMEDIES.",
	"text": "(a) Proceeds of payments received by a person contributing to an improvement to real estate within the meaning of section 514.01 shall be held in trust by that person for the benefit of those persons who furnished the labor, skill, material, or machinery contributing to the improvement. Proceeds of the payment are not subject to garnishment, execution, levy, or attachment. Nothing contained in this subdivision shall require money to be placed in a separate account and not commingled with other money of the person receiving payment or create a fiduciary liability or tort liability on the part of any person receiving payment or entitle any person to an award of punitive damages among persons contributing to an improvement to real estate under section 514.01 for a violation of this subdivision.\n(b) If a person fails to use the proceeds of a payment made to that person for the improvement, for the payment for labor, skill, material, and machinery contributed to the improvement, knowing that the cost of the labor performed, or skill, material, or machinery furnished remains unpaid, and who has not furnished the person making such payment either a valid lien waiver under section 514.07, or a payment bond in the basic amount of the contract price for the improvement, conditioned for the prompt payment to any person entitled thereto for the performance of labor or the furnishing of skill, material, or machinery for the improvement, shall be guilty of theft of the proceeds of the payment and is punishable under section 609.52. For an improvement to residential real estate made by a person licensed, or who should be licensed, under section 326B.805, a shareholder, officer, director, or agent of a corporation who is responsible for the theft shall be guilty of theft of the proceeds.\n(c) The penalties and remedies provided in this section do not apply to a third party who receives a payment in the ordinary course of business.\n(d) For purposes of this section, \"residential real estate\" has the meaning given in section 326B.802.\nA person injured by a violation of subdivision 1 may bring a civil action and recover damages, together with costs and disbursements, including costs of investigation and reasonable attorney fees, and receive other relief as determined by the court, including, without limitation, equitable tracing. A civil action under this subdivision may be brought:\n(1) against the person who committed the theft under subdivision 1; and\n(2) for an improvement to residential real estate made by a person licensed, or who should be licensed, under section 326B.805, against a shareholder, officer, director, or agent of a corporation who is not responsible for the theft but who knowingly receives proceeds of the payment as salary, dividend, loan repayment, capital distribution, or otherwise.\nNotice of nonpayment of the cost of labor, skill, material, and machinery contributing to the improvement of the real estate to the person paid for such improvement may be given by the person who made payment for such improvement, or by any person furnishing the labor, skill, material, or machinery contributing to the improvement and who has not been paid for the contribution. Notice may be given in any reasonable manner. Notice shall be in writing and in any terms that identify the real estate improved and the nonpayment complained of.\nProof that such person failed to pay for labor performed, or skill, material, or machinery furnished within 15 days after receiving notice that the cost of such labor performed, or skill, material, or machinery furnished remains unpaid will be sufficient to sustain a finding that the proceeds of such payment were used for a purpose other than the payment for labor, skill, material, and machinery for such improvement, knowing that the costs of labor performed, or skill, material, or machinery furnished remains unpaid, unless the person;\n(1) Establishes that all proceeds received from the person making such payment have been applied to the cost of labor, skill, material, or machinery furnished for the improvement; or\n(2) Within 15 days after receiving notice shall give a bond or make a deposit with the court administrator of district court, in an amount and form approved by a judge of district court, to hold harmless the owner or person having the improvement made from any claim for payment of anyone furnishing labor, skill, material, or machinery for such improvement.",
	"repealed": false
}