{
	"id": "336.9-705",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-705",
	"title": "336.9-705 EFFECTIVENESS OF ACTION TAKEN BEFORE EFFECTIVE DATE.",
	"text": "(a) Pre-effective date action; one-year perfection period unless reperfected. If action, other than the filing of a financing statement, is taken before Laws 2000, chapter 399, takes effect and the action would have resulted in priority of a security interest over the rights of a person that becomes a lien creditor had the security interest become enforceable before Laws 2000, chapter 399, takes effect, the action is effective to perfect a security interest that attaches under Laws 2000, chapter 399, within one year after Laws 2000, chapter 399, takes effect. An attached security interest becomes unperfected one year after Laws 2000, chapter 399, takes effect unless the security interest becomes a perfected security interest under Laws 2000, chapter 399, before the expiration of that period.\n(b) Pre-effective date filing. The filing of a financing statement before Laws 2000, chapter 399, takes effect is effective to perfect a security interest to the extent the filing would satisfy the applicable requirements for perfection under Laws 2000, chapter 399.\n(c) Pre-effective date filing in jurisdiction formerly governing perfection. Laws 2000, chapter 399, does not render ineffective an effective financing statement that, before Laws 2000, chapter 399, takes effect, is filed and satisfies the applicable requirements for perfection under the law of the jurisdiction governing perfection as provided in Minnesota Statutes 1998, section 336.9-103. However, except as otherwise provided in subsections (d) and (e) and section 336.9-706, the financing statement ceases to be effective at the earlier of:\n(1) the time the financing statement would have ceased to be effective under the law of the jurisdiction in which it is filed; or\n(2) June 30, 2006.\n(d) Continuation statement. The filing of a continuation statement after Laws 2000, chapter 399, takes effect does not continue the effectiveness of the financing statement filed before Laws 2000, chapter 399, takes effect. However, upon the timely filing of a continuation statement after Laws 2000, chapter 399, takes effect and in accordance with the law of the jurisdiction governing perfection as provided in Part 3, the effectiveness of a financing statement filed in the same office in that jurisdiction before Laws 2000, chapter 399, takes effect continues for the period provided by the law of that jurisdiction.\n(e) Application of subsection (c)(2) to transmitting utility financing statement. Subsection (c)(2) applies to a financing statement that, before Laws 2000, chapter 399, takes effect, is filed against a transmitting utility and satisfies the applicable requirements for perfection under the law of the jurisdiction governing perfection as provided in Minnesota Statutes 1998, section 336.9-103, only to the extent that Part 3 provides that the law of a jurisdiction other than the jurisdiction in which the financing statement is filed governs perfection of a security interest in collateral covered by the financing statement.\n(f) Application of part 5. A financing statement that includes a financing statement filed before Laws 2000, chapter 399, takes effect and a continuation statement filed after Laws 2000, chapter 399, takes effect is effective only to the extent that it satisfies the requirements of Part 5 for an initial financing statement.",
	"repealed": false
}