{
	"id": "84.7945",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.7945",
	"title": "84.7945 NONRESIDENTS; STATE TRAIL PASS FOR OFF-HIGHWAY MOTORCYCLES.",
	"text": "(a) A tribal member exempt from registration under section 84.788, subdivision 2, clause (2), or a nonresident, may not operate an off-highway motorcycle on a state or grant-in-aid off-highway motorcycle trail unless the operator carries a valid nonresident off-highway motorcycle state trail pass in immediate possession. The pass must be available for inspection by a peace officer, a conservation officer, or an employee designated under section 84.0835.\n(b) The commissioner of natural resources shall issue a pass upon application and payment of a $20 fee. The pass is valid from January 1 through December 31. Fees collected under this section, except for the issuing fee for licensing agents, shall be deposited in the state treasury and credited to the off-highway motorcycle account in the natural resources fund and, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, must be used for grants-in-aid to counties and municipalities for off-highway motorcycle organizations to construct and maintain off-highway motorcycle trails and use areas.\n(c) A nonresident off-highway motorcycle state trail pass is not required for:\n(1) an off-highway motorcycle that is owned and used by the United States, another state, or a political subdivision thereof that is exempt from registration under section 84.788, subdivision 2;\n(2) a person operating an off-highway motorcycle only on the portion of a trail that is owned by the person or the person's spouse, child, or parent; or\n(3) a nonresident operating an off-highway motorcycle that is registered according to section 84.788.\nThe commissioner may appoint agents to issue and sell nonresident off-highway motorcycle state trail passes. The commissioner may revoke the appointment of an agent at any time. The commissioner may adopt additional rules as provided in section 97A.485, subdivision 11. An agent shall observe all rules adopted by the commissioner for accounting and handling of passes pursuant to section 97A.485, subdivision 11. An agent shall promptly deposit and remit all money received from the sale of the passes, exclusive of the issuing fee, to the commissioner.\nThe commissioner and agents shall issue and sell nonresident off-highway motorcycle state trail passes. The commissioner shall also make the passes available through the electronic licensing system established under section 84.027, subdivision 15.\nIn addition to the fee for a pass, an issuing fee of $1 per pass shall be charged. The issuing fee may be retained by the seller of the pass. Issuing fees for passes issued by the commissioner shall be deposited in the off-highway motorcycle account in the natural resources fund and retained for the operation of the electronic licensing system.\nThe commissioner and agents shall issue a duplicate pass to persons whose pass is lost or destroyed using the process established under section 97A.405, subdivision 3, and rules adopted thereunder. The fee for a duplicate nonresident off-highway motorcycle state trail pass is $2, with an issuing fee of 50 cents.",
	"repealed": false
}