{
	"id": "446A.073",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.073",
	"title": "446A.073 POINT SOURCE IMPLEMENTATION GRANTS.",
	"text": "When money is appropriated for grants under this program, the authority shall award grants up to a maximum of $7,000,000 to governmental units to cover 80 percent of the cost of water infrastructure projects made necessary by:\n(1) a wasteload reduction prescribed under a total maximum daily load plan required by section 303(d) of the federal Clean Water Act, United States Code, title 33, section 1313(d);\n(2) a phosphorus concentration or mass limit which requires discharging one milligram per liter or less at permitted design flow which is incorporated into a permit issued by the Pollution Control Agency;\n(3) any other water quality-based effluent limit established under section 115.03, subdivision 1, paragraph (e), clause (8), and incorporated into a permit issued by the Pollution Control Agency that exceeds secondary treatment limits; or\n(4) a total nitrogen concentration or mass limit that requires discharging ten milligrams per liter or less at permitted design flow.\nApplication for a grant must be made to the authority on forms prescribed by the authority, including a project schedule and cost estimate for the work necessary to comply with the requirements listed in subdivision 1. The Pollution Control Agency shall review and certify to the authority those projects that have plans and specifications approved under section 115.03, subdivision 1, paragraph (f).\nThe authority shall accept applications under this program during the month of July. When a project is certified by the Pollution Control Agency the authority shall reserve money for the project in the order listed on the Pollution Control Agency's project priority list and in an amount based on the cost estimate submitted to the authority when the project is certified or the as-bid costs, whichever is less. Notwithstanding Minnesota Rules, chapter 7077, the Pollution Control Agency may rank a drinking water infrastructure project on the agency's project priority list if the project is necessary to meet an applicable requirement in subdivision 1.\nThe authority must make a grant for an eligible project only after:\n(1) the applicant has submitted the as-bid cost for the water infrastructure project;\n(2) the Pollution Control Agency has certified the grant eligible portion of the project; and\n(3) the authority has determined that the additional financing necessary to complete the project has been committed from other sources.\nDisbursement of a grant must be made for eligible project costs as incurred by the governmental unit and in accordance with a project financing agreement and applicable state and federal laws and rules governing the payments.",
	"repealed": false
}