{
	"id": "518A.735",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.735",
	"title": "518A.735 ENFORCEMENT OF CHILD SUPPORT.",
	"text": "(a) A child support obligee is entitled to recover from the obligor reasonable attorney fees and other collection costs incurred to enforce a child support judgment, as provided in this section. In order to recover collection costs under this section, the arrearages must be at least $500 and must be at least 90 days past due. In addition, the arrearages must be a docketed judgment under sections 548.09 and 548.091. If the obligor pays in full the judgment rendered under section 548.091 within 20 days of receipt of notice of entry of judgment, the obligee is not entitled to recover attorney fees or collection costs under this section.\n(b) Written notice must be provided by any obligee contracting with an attorney or collection entity to enforce a child support judgment to the public authority responsible for child support enforcement, if the public authority is a party or provides services to a party, within five days of signing a contract for services and within five days of receipting any payments received on a child support judgment. Attorney fees and collection costs obtained under this section are considered child support and entitled to the applicable remedies for collection and enforcement of child support.\n(c) The obligee shall serve notice of the obligee's intent to recover attorney fees and collections costs by certified or registered mail on the obligor at the obligor's last known address. The notice must include an itemization of the attorney fees and collection costs being sought by the obligee and inform the obligor that the fees and costs will become an additional judgment for child support unless the obligor requests a hearing on the reasonableness of the fees and costs or to contest the child support judgment on grounds limited to mistake of fact within 20 days of mailing of the notice.\n(d) If the obligor requests a hearing, the only issues to be determined by the court are whether the attorney fees or collection costs were reasonably incurred by the obligee for the enforcement of a child support judgment against the obligor or the validity of the child support judgment on grounds limited to mistake of fact. The fees and costs may not exceed 30 percent of the arrearages. The court may modify the amount of attorney fees and costs as appropriate and shall enter judgment accordingly.\n(e) If the obligor fails to request a hearing within 20 days of mailing of the notice under paragraph (a), the amount of the attorney fees or collection costs requested by the obligee in the notice automatically becomes an additional judgment for child support.\n(f) The commissioner of children, youth, and families shall prepare and make available to the court and the parties forms for use in providing for notice and requesting a hearing under this section.",
	"repealed": false
}