{
	"id": "462A.204",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.204",
	"title": "462A.204 FAMILY HOMELESS PREVENTION AND ASSISTANCE PROGRAM.",
	"text": "The agency may establish a family homeless prevention and assistance program to assist families who are homeless or are at imminent risk of homelessness. The term \"family\" may include single individuals. The agency may make grants to develop and implement family homeless prevention and assistance projects under the program. For purposes of this section, \"families\" means families and persons 24 years of age or younger.\nThe agency shall award grants to counties with a significant number or significant growth in the number of homeless families and that agree to focus their emergency response systems on homeless prevention and the securing of permanent or transitional housing for homeless families. The agency shall take into consideration the extent to which the proposed project activities demonstrate ways in which existing resources in an area may be more effectively coordinated to meet the program objectives specified under this section in awarding grants.\nAt least one grant must be awarded in an area located outside of the metropolitan area. A county, a group of contiguous counties jointly acting together, a Tribe, a group of Tribes, or a community-based nonprofit organization may apply for and receive grants for areas located outside the metropolitan area.\nEach project must be designed to stabilize families in their existing homes, shorten the amount of time that families stay in emergency shelters, and assist families with securing transitional or permanent affordable housing throughout the grantee's area of operation. Each project must include plans for the following:\n(1) use of existing housing stock, including the maintenance of current housing for those at risk;\n(2) leveraging of private and public money to maximize the project impact;\n(3) coordination and use of existing public and private providers of rental assistance, emergency shelters, transitional housing, and affordable permanent housing;\n(4) targeting of direct financial assistance including assistance for rent, utility payments or other housing costs, and support services, where appropriate, to prevent homelessness and repeated episodes of homelessness;\n(5) efforts to address the needs of specific homeless populations;\n(6) identification of outcomes expected from the use of the grant award; and\n(7) description of how the organization will use other resources to address the needs of homeless individuals.\nA grant may be used to prevent or decrease the period of homelessness of families and to decrease the time period that families stay in emergency shelters. Grants may not be used to acquire, rehabilitate, or construct emergency shelters or transitional or permanent housing. Grants may not be used to pay more than 24 months of rental assistance for a family.\nEach grantee shall establish an advisory committee consisting of a homeless advocate, a homeless person or formerly homeless person, a member of the state interagency task force on homelessness, local representatives, if any, of public and private providers of emergency shelter, transitional housing, and permanent affordable housing, and other members of the public not representatives of those specifically described in this sentence. The grantee shall consult on a regular basis with the advisory committee in preparing the project proposal and in the design, implementation, and evaluation of the project. The advisory committee shall assist the grantee as follows:\n(1) designing or refocusing the grantee's emergency response system;\n(2) developing project outcome measurements; and\n(3) assessing the short- and long-term effectiveness of the project in meeting the needs of families who are homeless, preventing homelessness, identifying and developing innovative solutions to the problem of homeless families, and identifying problems and barriers to providing services to homeless families.\nEach grantee shall submit an annual project report to the state Interagency Task Force on Homelessness. The report must include the actual program results compared to program objectives. The state interagency task force shall report on program activities to all state agencies that provide assistance or services to homeless persons.\n(a) The agency in consultation with the Interagency Council on Homelessness may establish a school stability project under the family homeless prevention and assistance program. The purpose of the project is to secure stable housing for families with school-age children who have moved frequently and for unaccompanied youth. For purposes of this subdivision, \"unaccompanied youth\" are minors who are leaving foster care or juvenile correctional facilities, or minors who meet the definition of a child in need of services or protection under section 260C.007, subdivision 6, but for whom no court finding has been made pursuant to that statute.\n(b) The agency shall make grants to family homeless prevention and assistance projects in communities with a school or schools that have a significant degree of student mobility.\n(c) Each project must be designed to reduce school absenteeism; stabilize children in one home setting or, at a minimum, in one school setting; and reduce shelter usage. Each project must include plans for the following:\n(1) targeting of families with children who are eligible for a prekindergarten through grade 12 academic program and are living in overcrowded conditions in their current housing; are paying more than 50 percent of their income for rent; or who lack a fixed, regular, and adequate nighttime residence;\n(2) targeting of unaccompanied youth in need of an alternative residential setting;\n(3) connecting families with the social services necessary to maintain the families' stability in their home, including but not limited to housing navigation, legal representation, and family outreach; and\n(4) one or more of the following:\n(i) provision of rental assistance for a specified period of time, which may exceed 24 months; or\n(ii) provision of support and case management services to improve housing stability, including but not limited to housing navigation and family outreach.\n(d) In selecting projects for funding under this subdivision, preference shall be given to organizations granted funding under section 462A.201, subdivision 2, paragraph (a), clause (4).\n(e) No grantee under this subdivision is required to have an advisory committee as described in subdivision 6.",
	"repealed": false
}