{
	"id": "116.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.06",
	"title": "116.06 DEFINITIONS.",
	"text": "The definitions given in this section shall obtain for the purposes of sections 116.01 to 116.075 except as otherwise expressly provided or indicated by the context.\n\"Air contaminant\" or \"air contamination\" means the presence in the outdoor atmosphere of any dust, fume, mist, smoke, vapor, gas, or other gaseous, fluid, or particulate substance differing in composition from or exceeding in concentration the natural components of the atmosphere.\nMS 1990 [Renumbered subd 4]\n\"Air contaminant treatment facility\" or \"treatment facility\" means any structure, work, equipment, machinery, device, apparatus, or other means for treatment of an air contaminant or combination thereof to prevent, abate, or control air pollution.\nMS 1990 [Renumbered subd 9]\n\"Air pollution\" means the presence in the outdoor atmosphere of any air contaminant or combination thereof in such quantity, of such nature and duration, and under such conditions as would be injurious to human health or welfare, to animal or plant life, or to property, or to interfere unreasonably with the enjoyment of life or property.\n\"Animal unit\" means a unit of measure used to compare differences in the production of animal manure that employs as a standard the amount of manure produced on a regular basis by a slaughter steer or heifer for an animal feedlot or manure storage area calculated by multiplying the number of animals of each type in clauses (1) to (9) by the respective multiplication factor and summing the resulting values for the total number of animal units. For purposes of this chapter, the following multiplication factors apply:\n(1) one mature dairy cow, whether milked or dry:\n(i) over 1,000 pounds, 1.4 animal units; or\n(ii) under 1,000 pounds, 1.0 animal unit;\n(2) one cow and calf pair, 1.2 units;\n(3) one calf, 0.2 unit;\n(4) one slaughter steer, 1.0 animal unit;\n(5) head of feeder cattle or heifer, 0.7 unit;\n(6) one head of swine:\n(i) over 300 pounds, 0.4 animal unit;\n(ii) between 55 pounds and 300 pounds, 0.3 animal unit; and\n(iii) under 55 pounds, 0.05 animal unit;\n(7) one horse, 1.0 animal unit;\n(8) one sheep or lamb, 0.1 animal unit;\n(9) one chicken:\n(i) one laying hen or broiler, if the facility has a liquid manure system, 0.033 animal unit; or\n(ii) one chicken if the facility has a dry manure system:\n(A) over five pounds, 0.005 animal unit; or\n(B) under five pounds, 0.003 animal unit;\n(10) one turkey:\n(i) over five pounds, 0.018 animal unit; or\n(ii) under five pounds, 0.005 animal unit;\n(11) one duck, 0.01 animal unit; and\n(12) for animals not listed in clauses (1) to (8), the number of animal units is the average weight of the animal in pounds divided by 1,000 pounds.\nMS 1990 [Renumbered subd 10]\n\"Assistant commissioner\" means the assistant commissioner of the Minnesota Pollution Control Agency.\nMS 1990 [Renumbered subd 3]\n\"Collection\" of waste has the meaning given it in section 115A.03.\nMS 1990 [Renumbered subd 18]\n\"Deputy commissioner\" means the deputy commissioner of the Minnesota Pollution Control Agency.\nMS 1990 [Renumbered subd 17]\n\"Disposal\" of waste has the meaning given it in section 115A.03.\nMS 1990 [Renumbered subd 14]\n\"Emission\" means a release or discharge into the outdoor atmosphere of any air contaminant or combination thereof.\n[Renumbered subd 23]\n[Renumbered subd 24]\n[Renumbered subd 6]\n[Renumbered subd 19]\n[Renumbered subd 8]\n[Renumbered subd 12]\n[Renumbered subd 13]\n[Renumbered subd 20]\n[Renumbered subd 21]\nMS 1990 [Renumbered subd 22]\n\"Emission facility\" means any structure, work, equipment, machinery, device, apparatus, or other means whereby an emission is caused to occur.\nMS 1990 [Renumbered subd 15]\n\"Hazardous waste\" means any refuse, sludge, or other waste material or combinations of refuse, sludge or other waste materials in solid, semisolid, liquid, or contained gaseous form which because of its quantity, concentration, or chemical, physical, or infectious characteristics may (a) cause or significantly contribute to an increase in mortality or an increase in serious irreversible, or incapacitating reversible illness; or (b) pose a substantial present or potential hazard to human health or the environment when improperly treated, stored, transported, or disposed of, or otherwise managed. Categories of hazardous waste materials include, but are not limited to: explosives, flammables, oxidizers, poisons, irritants, and corrosives. Hazardous waste does not include source, special nuclear, or by-product material as defined by the Atomic Energy Act of 1954, as amended.\nMS 1990 [Renumbered subd 16]\n\"Intrinsic hazard\" of a waste has the meaning given it in section 115A.03.\nMS 1990 [Renumbered subd 11]\n\"Intrinsic suitability\" of a land area or site has the meaning given it in section 115A.03.\nMS 1990 [Renumbered subd 7]\n\"Land pollution\" means the presence in or on the land of any waste in such quantity, of such nature and duration, and under such condition as would affect injuriously any waters of the state, create air contaminants or cause air pollution.\nMS 1990 [Renumbered subd 5]\n\"Noise\" means any sound not occurring in the natural environment, including, but not limited to, sounds emanating from aircraft and highways, and industrial, commercial, and residential sources.\n\"Noise pollution\" means the presence in the outdoor atmosphere of any noise or combination of noises in such quantity, at such levels, of such nature and duration or under such conditions as could potentially be injurious to human health or welfare, to animal or plant life, or to property, or could interfere unreasonably with the enjoyment of life or property.\n\"Pastures\" means areas, including winter feeding areas as part of a grazing area, where grass or other growing plants are used for grazing of livestock and where the concentration of animals allows a vegetative cover to be maintained during the growing season. Pastures also includes agricultural land that is used for growing crops during the growing season and is used for grazing of livestock on vegetation or crop residues during the winter. In either case, a cover of vegetation or crop residues is not required:\n(1) in the immediate vicinity of supplemental feeding or watering devices;\n(2) in associated corrals and chutes where livestock are gathered for the purpose of sorting, veterinary services, loading and unloading trucks and trailers, and other necessary activities related to good animal husbandry practices;\n(3) in associated livestock access lanes used to convey livestock to and from areas of the pasture; and\n(4) in sacrificial areas:\n(i) that are part of a larger pasture system;\n(ii) are used to temporarily accommodate livestock due to an extraordinary situation for as short a time period as possible not to exceed 90 days during the growing season;\n(iii) are used to protect other pasture areas when adverse soil or weather conditions pose a risk of damaging the pastures; and\n(iv) on which the vegetation is naturally restored or replanted after the adverse soil or weather conditions are removed and the livestock are moved to other areas of the pasture.\n\"Person\" means any human being, any municipality or other governmental or political subdivision or other public agency, any public or private corporation, any partnership, firm, association, or other organization, any receiver, trustee, assignee, agent, or other legal representative of any of the foregoing, or any other legal entity, but does not include the Pollution Control Agency.\n\"Potential air contaminant storage facility\" or \"storage facility\" means any structure, work, equipment, device, apparatus, tank, container, or other means for the storage or confinement, either stationary or in transit, of any substance which, if released or discharged into the outdoor atmosphere, might cause air contamination or air pollution.\n\"Processing\" of waste has the meaning given it in section 115A.03.\n\"Sewage sludge\" has the meaning given it in section 115A.03.\n\"Sludge\" means any solid, semisolid, or liquid waste generated from a municipal, commercial, or industrial wastewater treatment plant, water supply treatment plant, or air contaminant treatment facility, or any other waste having similar characteristics and effects.\n\"Solid waste\" means garbage, refuse, sludge from a water supply treatment plant or air contaminant treatment facility, and other discarded waste materials and sludges, in solid, semisolid, liquid, or contained gaseous form, resulting from industrial, commercial, mining, and agricultural operations, and from community activities, but does not include hazardous waste; animal waste used as fertilizer; earthen fill, boulders, rock; concrete diamond grinding and saw slurry associated with the construction, improvement, or repair of a road when deposited on the road project site in a manner that is in compliance with best management practices and rules of the agency; sewage sludge; solid or dissolved material in domestic sewage or other common pollutants in water resources, such as silt, dissolved or suspended solids in industrial wastewater effluents or discharges which are point sources subject to permits under section 402 of the Federal Water Pollution Control Act, as amended, dissolved materials in irrigation return flows; or source, special nuclear, or by-product material as defined by the Atomic Energy Act of 1954, as amended.\n\"Waste\" has the meaning given it in section 115A.03.\n\"Waste management\" has the meaning given it in section 115A.03.",
	"repealed": false
}