{
	"id": "447.47",
	"url": "https://www.revisor.mn.gov/statutes/cite/447.47",
	"title": "447.47 LEASING OUT HOSPITAL, NURSING HOME, RELATED FACILITIES.",
	"text": "(a) The county, city, or hospital district may lease hospital or nursing home facilities to be run by a nonprofit or public corporation as a community hospital or nursing home. The facilities must be open to all residents of the community on equal terms.\n(b) The city, county, or district may lease related medical facilities to any person, firm, association, or corporation, at rent and on conditions agreed.\n(c) The term of the lease must not exceed 30 years. The lessee may be granted an option to renew the lease for an additional term or to purchase the facilities. The terms of renewal or purchase must be provided for in the lease.\n(d) The county, city, or hospital district may by resolution of its governing body agree to pay to the lessee annually, and to include in each annual budget and tax levy for hospital and nursing home purposes, a fixed compensation for services agreed to be performed by the lessee in running the hospital or nursing home as a community facility; for any investment by the lessee of its own funds or funds granted or contributed to it in the construction or equipment of the hospital or nursing home; and for any auxiliary services to be provided or made available by the lessee through other facilities owned or operated by it. Services other than those provided for in the lease agreement may be compensated at rates agreed upon later. The lease agreement must, however, require the lessee to pay a net rental not less than the amount required to pay the principal and interest when due on all revenue bonds issued by the county, city, or hospital district to acquire, improve, and refinance the leased facilities, and to maintain the agreed revenue bond reserve. The lease agreement must not grant the lessee an option to purchase the facilities at a price less than the amount of the bonds issued and interest accrued on them, except bonds and accrued interest paid from the net rentals before the option is exercised.\n(e) To the extent that the facilities are leased under this section for use by persons in private medical or dental or similar practice or other private business, a tax on that use must be imposed just as though the user were the owner of the space. It must be collected as provided in section 272.01, subdivision 2.",
	"repealed": false
}