{
	"id": "256C.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/256C.23",
	"title": "256C.23 DEFINITIONS.",
	"text": "For the purposes of sections 256C.21 to 256C.30, the terms defined in this section shall have the meanings given them, unless the context clearly indicates otherwise.\n\"Culturally affirmative\" describes services that are designed and delivered within the context of the culture, identity, language, communication, and life experiences of persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing.\n\"Linguistically affirmative\" describes services that are designed and delivered within the context of the language and communication experiences of persons who are deaf, persons who are deafblind, and persons who are hard-of-hearing.\n\"Deaf\" means a hearing loss where the person communicates primarily through American Sign Language or another signed language, signing systems in English, Cued Speech, reading and writing, speech reading, or other visual communication.\n\"Hard-of-hearing\" means a hearing loss where the person does not communicate primarily through visual communication.\n\"Deafblind\" means any combination of vision and hearing loss where the person uses visual, auditory, or tactile strategies and skills such as the use of a tactile form of a visual or spoken language to access communication, information from the environment, or other information.\n\"Interpreting services\" means services that include:\n(1) interpreting between a spoken language, such as English, and a visual language, such as American Sign Language or another signed language;\n(2) interpreting between a spoken language and a visual representation of a spoken language, such as Cued Speech or signing systems in English;\n(3) interpreting within one language where the interpreter silently repeats the spoken message, replacing some words or phrases to make the message more readable;\n(4) interpreting using low vision or tactile methods, signing systems, or signed languages for persons who are deafblind; and\n(5) interpreting from one communication mode or language into another communication mode or language that is linguistically and culturally appropriate for the participants in the communication exchange.\n[Repealed, 1Sp2017 c 6 art 1 s 54]\n[Repealed by amendment, 1996 c 392 s 1]\n[Repealed by amendment, 1996 c 392 s 1]\n\"Real-time captioning\" means a method of captioning in which captions are simultaneously prepared and displayed or transmitted at the time of origination by specially trained real-time captioners.\n\"Family and community intervener\" means a person who is specifically trained in deafblindness and works one-on-one with a child who is deafblind to provide critical access to language, communication, people, and the environment.",
	"repealed": false
}