{
	"id": "259.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.23",
	"title": "259.23 JUVENILE COURT, JURISDICTION.",
	"text": "(a) The juvenile court shall have original jurisdiction in all adoption proceedings. The proper venue for an adoption proceeding shall be the county of the petitioner's residence, except as provided in section 260C.621, subdivision 2, for the adoption of children under the guardianship of the commissioner. Transfer of venue under this paragraph shall be according to the rules of adoption court procedure.\n(b) In all adoptions under this chapter, if the petitioner has acquired a new residence in another county and requests a transfer of the adoption proceeding, the court in which an adoption is initiated may transfer the proceeding to the appropriate court in the new county of residence if the transfer is in the best interests of the person to be adopted. The court transfers the proceeding by ordering a continuance and by forwarding to the court administrator of the appropriate court a certified copy of all papers filed, together with an order of transfer. The transferring court also shall forward copies of the order of transfer to the commissioner of children, youth, and families and any agency participating in the proceedings. The judge of the receiving court shall accept the order of the transfer and any other documents transmitted and hear the case; provided, however, the receiving court may in its discretion require the filing of a new petition prior to the hearing.\nThe petition shall be signed by the petitioner and, if married, by the spouse. It shall be verified, and filed in duplicate. The petition shall allege:\n(a) the full name, age and place of residence of petitioner, and if married, the date and place of marriage;\n(b) the date petitioner acquired physical custody of the child and from what person or agency;\n(c) the date of birth of the person to be adopted, if known, and the state and county where born;\n(d) the name of the child's parents, if known, and the guardian if there be one;\n(e) the actual name of the person to be adopted, if known, and any known aliases;\n(f) the name to be given the person to be adopted if a change of name is desired;\n(g) the description and value of any real or personal property owned by the person to be adopted;\n(h) that the petitioner desires that the relationship of parent and child be established between petitioner and the person to be adopted and that adoption is in the best interests of the person to be adopted by the petitioner.\nIn agency placements, the information required in clauses (d) and (e) shall not be required to be alleged in the petition but shall be transmitted to the court by the commissioner of children, youth, and families or the agency.\nThe provisions of subdivision 2 shall be subject to rules of the court made pursuant to section 480.051.",
	"repealed": false
}