{
	"id": "114D.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/114D.35",
	"title": "114D.35 PUBLIC AND STAKEHOLDER PARTICIPATION; SCIENTIFIC REVIEW; EDUCATION.",
	"text": "(a) Public agencies and private entities involved in implementing this chapter must encourage participation by the public and stakeholders, including local citizens, landowners, land managers, and public and private organizations.\n(b) In particular, the commissioner of the Pollution Control Agency must make reasonable efforts to provide timely information to the public and to stakeholders about impaired waters that have been identified by the agency and to inform and consult with the public and stakeholders in developing a WRAPS or TMDL.\n(c) Public agencies and private entities using public funds that are involved in implementing restoration and protection identified in a comprehensive watershed management plan or comprehensive local water management plan must make efforts to inform, consult, and involve the public and stakeholders.\n(d) The commissioner of the Pollution Control Agency and the Board of Water and Soil Resources must coordinate public and stakeholder participation in consultation with local government units. To the extent practicable, implementation of this chapter must be accomplished in cooperation with local, state, federal, and tribal governments and private-sector organizations.\nThe Clean Water Council and public agencies and private entities shall make use of available public and private expertise from educational, research, and technical organizations, including the University of Minnesota and other higher education institutions, to provide appropriate independent expert advice on models, methods, and approaches used in identifying degraded groundwater and impaired waters, developing TMDLs, and implementing prevention and restoration.\nThe Clean Water Council must develop strategies for informing, educating, and encouraging the participation of citizens, stakeholders, and others regarding this chapter. Public agencies are responsible for implementing the strategies.",
	"repealed": false
}