{
	"id": "360.0752",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.0752",
	"title": "360.0752 AIRCRAFT OPERATOR UNDER INFLUENCE OF ALCOHOL, CONTROLLED SUBSTANCE, OR INTOXICATING SUBSTANCE.",
	"text": "As used in this section and section 360.0753:\n(1) \"operate\" includes the acts of all crew members with responsibility to operate the aircraft;\n(2) \"controlled substance\" has the meaning given in section 152.01, subdivision 4; and\n(3) \"intoxicating substance\" has the meaning given in section 169A.03, subdivision 11a.\n(a) It is a crime for any person to operate or attempt to operate an aircraft on or over land or water within this state or over any boundary water of this state under any of the following conditions:\n(1) when the person is under the influence of alcohol;\n(2) when the person is under the influence of a controlled substance;\n(3) when the person is under the influence of a combination of any two or more of the elements named in clauses (1), (2), (6), and (9);\n(4) when the person's alcohol concentration is 0.04 or more;\n(5) when the person's alcohol concentration as measured within two hours of the time of operation or attempted operation is 0.04 or more;\n(6) when the person is under the influence of an intoxicating substance and the person knows or has reason to know that the substance has the capacity to cause impairment;\n(7) when the person's body contains any amount of a controlled substance listed in Schedule I or II, other than marijuana or tetrahydrocannabinols;\n(8) within eight hours of having consumed any alcoholic beverage or used any controlled substance; or\n(9) when the person is under the influence of cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, an artificially derived cannabinoid, or tetrahydrocannabinols, as those terms are defined in section 342.01.\n(b) If proven by a preponderance of the evidence, it shall be an affirmative defense to a violation of paragraph (a), clause (7), that the defendant used the controlled substance according to the terms of a prescription issued for the defendant in accordance with sections 152.11 and 152.12.\nIt is a crime for any person to refuse to submit to a chemical test of the person's blood, breath, or urine under section 360.0753.\nIt is a crime for any person to knowingly permit any individual who is in violation of subdivision 2 to operate any aircraft owned by or in the custody or control of the person.\nA peace officer may lawfully arrest a person for violation of subdivision 2 without a warrant upon probable cause, without regard to whether the violation was committed in the officer's presence. The express grant of arrest powers in this subdivision does not limit the arrest powers of peace officers pursuant to sections 626.65 to 626.70 or section 629.40 in cases of arrests for violation of subdivision 2 or any other provision of law.\nUpon the trial of any prosecution arising out of acts alleged to have been committed by any person arrested for operating or attempting to operate an aircraft in violation of subdivision 2, the court may admit evidence of the presence or amount of alcohol, controlled substances, or intoxicating substances in the person's blood, breath, or urine as shown by an analysis of those items.\nEvidence of the refusal to take a test is admissible into evidence in a prosecution under this section.\nIf proven by a preponderance of the evidence, it shall be an affirmative defense to a violation of subdivision 2, paragraph (a), clause (5), that the defendant consumed a sufficient quantity of alcohol after the time of the violation and before the administration of the evidentiary test to cause the defendant's alcohol concentration to exceed 0.04; provided, that this evidence may not be admitted unless notice is given to the prosecution prior to the omnibus or pretrial hearing in the matter.\nThe foregoing provisions do not limit the introduction of any other competent evidence bearing upon the question whether or not the person violated this section, including tests obtained more than two hours after the alleged violation and results obtained from partial tests on an infrared breath-testing instrument. A result from a partial test is the measurement obtained by analyzing one adequate breath sample, as defined in section 360.0753, subdivision 4, paragraph (b).\n(a) A person who violates subdivision 2, paragraph (a), clause (8), or subdivision 3, is guilty of a misdemeanor.\n(b) A person who violates subdivision 2, paragraph (a), clauses (1) to (7), or subdivision 2a, is guilty of a gross misdemeanor.\n(c) The attorney in the jurisdiction in which the violation occurred who is responsible for prosecution of misdemeanor violations shall also be responsible for prosecution of gross misdemeanor violations of this section.\nWhen a peace officer has reason to believe that a person may be violating or has violated subdivision 2, the officer may require the person to provide a sample of the person's breath for a preliminary screening test using a device approved by the commissioner of public safety or the commissioner of transportation for this purpose. The results of this preliminary screening test shall be used for the purpose of deciding whether to require the tests authorized in section 360.0753, but shall not be used in any court action except to prove that a test was properly required of a person pursuant to section 360.0753. Following the screening test, additional tests may be required of the person pursuant to the provisions of section 360.0753.\nA person who refuses to furnish a sample of the person's breath is subject to the provisions of section 360.0753 unless, in compliance with section 360.0753, the person submits to a blood, breath, or urine test to determine the presence or amount of alcohol, controlled substances, or intoxicating substances.",
	"repealed": false
}