{
	"id": "349.163",
	"url": "https://www.revisor.mn.gov/statutes/cite/349.163",
	"title": "349.163 LICENSING OF MANUFACTURERS.",
	"text": "No manufacturer of gambling equipment may sell any gambling equipment to any person for use or resale within the state, unless the manufacturer has a current and valid license issued by the board under this section and has satisfied other criteria prescribed by the board by rule. A manufacturer licensed under this section may also be licensed as a linked bingo game provider under section 349.1635.\nA manufacturer licensed under this section may not also be directly or indirectly licensed as a distributor under section 349.161.\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\nAn applicant for a manufacturer's license must list on the license application the names and addresses of all subsidiaries, affiliates, and branches in which the applicant has any form of ownership or control, in whole or in part, without regard to whether the subsidiary, affiliate, or branch does business in Minnesota.\nThe annual fee for a manufacturer's license is $10,000.\nMS 1992 [Repealed, 1994 c 633 art 5 s 99]\n(a) A manufacturer may not:\n(1) sell gambling equipment for use or resale within the state to any person not licensed as a distributor, except that gambling equipment used exclusively in a linked bingo game may be sold to a licensed linked bingo provider; or\n(2) sell gambling equipment to a distributor in this state that has the same serial number as another item of gambling equipment of the same type that is sold by that manufacturer for use or resale in this state.\n(b) A manufacturer, affiliate of a manufacturer, or person acting as a representative or agent of a manufacturer may not provide a lessor of gambling premises or an appointed official any compensation, gift, gratuity, premium, contribution, or other thing of value.\n(c) A manufacturer may not sell or otherwise provide a pull-tab or tipboard deal with the symbol required by subdivision 5, paragraph (d), imprinted on the flare to any person other than a licensed distributor unless the manufacturer first renders the symbol permanently invisible.\nA manufacturer may provide to an organization for use at a premises where lawful gambling is conducted by the licensed organization, marketing, promotional, or point-of-sale items or materials for the promotion of lawful gambling, provided the total value of the items or materials provided to the organization does not exceed $250 per year. Any marketing, promotional, or point-of-sale items and materials used for the promotion of lawful gambling may not include items normally purchased by the lessor of a premises in the lessor's business.\nEmployees of the board and the Division of Alcohol and Gambling Enforcement may inspect the books, records, inventory, and business premises of a licensed manufacturer without notice during the normal business hours of the manufacturer. The board may charge a manufacturer for the actual cost of conducting scheduled or unscheduled inspections of the manufacturer's facilities, where the amount charged to the manufacturer for such inspections in any year does not exceed $7,500. The board shall deposit in a separate account in the state treasury all money received as reimbursement for the costs of inspections. Money in the account is appropriated to the board to pay the costs of the inspections.\n(a) A manufacturer may not ship or cause to be shipped into this state or sell for use or resale in this state any deal of paper pull-tabs or tipboards that does not have its own individual flare as required for that deal by this subdivision and rule of the board. A person other than a manufacturer may not manufacture, alter, modify, or otherwise change a flare for a deal of paper pull-tabs or tipboards except as allowed by this chapter or board rules.\n(b) The flare of each paper pull-tab and tipboard game must have affixed to or imprinted at the bottom a bar code that provides all information required by the commissioner of revenue under section 297E.04, subdivision 2.\nThe serial number included in the bar code must be the same as the serial number of the tickets included in the deal. A manufacturer who manufactures a deal of paper pull-tabs must affix to the outside of the box containing that game the same bar code that is affixed to or imprinted at the bottom of a flare for that deal.\n(c) No person may alter the bar code that appears on the outside of a box containing a deal of paper pull-tabs and tipboards. Possession of a box containing a deal of paper pull-tabs and tipboards that has a bar code different from the bar code of the deal inside the box is prima facie evidence that the possessor has altered the bar code on the box.\n(d) The flare of each deal of paper pull-tabs and tipboards sold by a manufacturer for use or resale in Minnesota must have imprinted on it a symbol that is at least one inch high and one inch wide consisting of an outline of the geographic boundaries of Minnesota with the letters \"MN\" inside the outline. The flare must be placed inside the wrapping of the deal which the flare describes.\n(e) Each paper pull-tab and tipboard flare must bear the following statement printed in letters large enough to be clearly legible:\n\"Pull-tab (or tipboard) purchasers -- This pull-tab (or tipboard) game is not legal in Minnesota unless:\n-- an outline of Minnesota with letters \"MN\" inside it is imprinted on this sheet, and\n-- the serial number imprinted on the bar code at the bottom of this sheet is the same as the serial number on the pull-tab (or tipboard) ticket you have purchased.\"\n(f) The flare of each paper pull-tab and tipboard game must have the serial number of the game imprinted on the bar code at the bottom of the flare in numerals at least one-half inch high.\nA disposable sealed placard used for the selection of bingo numbers in a bingo game in this state must have imprinted on it a unique serial and form number and a symbol that is at least one inch high and one inch wide consisting of an outline of the geographic boundaries of Minnesota with the letters \"MN\" inside the outline.\n(a) The board shall require each licensed manufacturer to submit to the board one or more samples of each item of gambling equipment manufactured for use or resale in this state. For purposes of this subdivision, a manufacturer is also required to submit the applicable version of any software necessary to operate electronic devices and related systems.\n(b) The board shall inspect and test all the equipment, including software and software upgrades, it deems necessary to determine the equipment's compliance with law and board rules. Samples required under this subdivision must be approved by the board before the equipment being sampled is shipped into or sold for use or resale in this state. The board shall impose a fee of $30 for each item of gambling equipment that the manufacturer submits for approval or for which the manufacturer requests approval. The board shall impose a fee of $125 for each sample of gambling equipment that it tests.\n(c) The board may require samples of gambling equipment to be tested by an independent testing laboratory prior to submission to the board for approval. All costs of testing by an independent testing laboratory must be borne by the manufacturer. An independent testing laboratory used by a manufacturer to test samples of gambling equipment must be approved by the board before the equipment is submitted to the laboratory for testing.\n(d) The board may request the assistance of the commissioner of public safety and the director of the State Lottery in performing the tests.\nMS 2000 [Repealed, 2002 c 386 art 1 s 12]\nThe board shall not deny approval of a pull-tab or tipboard game solely because the game is similar to or bears the name or image of a licensed commercial product.\nThe board may, after January 1, 1991, by rule require that all pull-tabs sold in Minnesota be manufactured using recycled paper.\nEach sealed grouping of 100 or fewer paddle ticket cards must have its own individual master flare. The manufacturer must affix to or imprint at the bottom of the master flare a bar code that provides all information required by the commissioner of revenue under section 297E.04, subdivision 3.\n(a) A manufacturer may not ship or cause to be shipped into this state or sell for use or resale in this state any raffle board that does not have affixed to or imprinted at the bottom a bar code that provides all information required by the commissioner of revenue under section 297E.04, subdivision 2. A person other than a manufacturer may not manufacture, alter, modify, or otherwise change a raffle board as allowed by this chapter or board rules.\n(b) A raffle board sold by a manufacturer for use or resale in Minnesota must have imprinted on it a symbol that is at least one inch high and one inch wide consisting of an outline of the geographic boundaries of Minnesota with the letters \"MN\" inside the outline and must have the serial number of the board imprinted on the bar code at the bottom of the board in numerals at least one-half inch high.\n(c) A raffle board may not contain more than 200 squares.\nNo licensed manufacturer may refuse to sell gambling equipment to a licensed distributor unless:\n(1) a specific type of gambling equipment sold on an exclusive basis is at issue;\n(2) the manufacturer does not sell gambling equipment to any distributor in Minnesota;\n(3) a Minnesota statute or rule prohibits the sale; or\n(4) the distributor is delinquent on any payment owed to the manufacturer.\nThis subdivision does not apply to application software and those computer programs used by a licensed manufacturer in the production, play, and reporting of board-approved electronic pull-tab games or electronic bingo games.\n(a) A manufacturer that surrenders, withdraws, or otherwise terminates its license must submit to the board, in writing, a termination plan. Termination of a license may occur due to revocation or denial of the license by the board, or by the manufacturer voluntarily quitting its business. Termination plans must be approved by the executive director.\n(b) The license termination plan must include the manufacturer's agreement to accept returned defective equipment and issue credit for defective products up to six months after the license termination date.\n(c) The manufacturer or its designated agent must keep all invoices and other required documentation related to the sale or disposal of gambling equipment for 3-1/2 years after the license has been terminated.\n(a) Beginning July 1, 2024, a licensed distributor may not charge a licensed organization more than 25 percent of gross profits derived from electronic pull-tab games supplied by the licensed distributor.\n(b) A licensed distributor may request a hearing before the board to seek to impose a fee in excess of the limitations established in paragraph (a). Unless otherwise agreed between the licensee and the board, the licensee must submit its request no later than 20 days prior to a scheduled board meeting. The board must grant or deny the licensee's request within 20 days after the hearing is held.\nA manufacturer of electronic pull-tabs licensed under this section must complete and submit an annual system and organization controls audit. The standards of the audit must incorporate and be consistent with standards prescribed by the American Institute of Certified Public Accountants. Audits conducted under this subdivision must be performed by an independent accountant firm licensed in accordance with chapter 326A.",
	"repealed": false
}