{
	"id": "144A.484",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.484",
	"title": "144A.484 INTEGRATED LICENSURE; HOME AND COMMUNITY-BASED SERVICES DESIGNATION.",
	"text": "A home care provider applicant or license holder may apply to the commissioner of health for a home and community-based services designation for the provision of basic support services identified under section 245D.03, subdivision 1, paragraph (b). The designation allows the license holder to provide basic support services that would otherwise require licensure under chapter 245D, under the license holder's home care license governed by sections 144A.43 to 144A.4799.\nAn application for a home and community-based services designation must be made on the forms and in the manner prescribed by the commissioner. The commissioner shall provide the applicant with instruction for completing the application and provide information about the requirements of other state agencies that affect the applicant. Application for the home and community-based services designation is subject to the requirements under section 144A.473.\nA home care provider applicant or licensee applying for the home and community-based services designation or renewal of a home and community-based services designation must submit a fee in the amount specified in subdivision 8.\nA home care provider with a home and community-based services designation must comply with the requirements for home care services governed by this chapter. For the provision of basic support services, the home care provider must also comply with the following home and community-based services licensing requirements:\n(1) service planning and delivery requirements in section 245D.07;\n(2) protection standards in section 245D.06;\n(3) emergency use of manual restraints in section 245D.061; and\n(4) protection-related rights in section 245D.04, subdivision 3, paragraph (a), clauses (5), (7), (8), (12), and (13), and paragraph (b).\nA home care provider with the integrated license-home and community-based services designation may utilize a bill of rights which incorporates the service recipient rights in section 245D.04, subdivision 3, paragraph (a), clauses (5), (7), (8), (12), and (13), and paragraph (b) with the home care bill of rights in section 144A.44.\n(a) The commissioner shall monitor for compliance with the home and community-based services requirements identified in subdivision 4, in accordance with this section and any agreements by the commissioners of health and human services.\n(b) The commissioner shall enforce compliance with applicable home and community-based services licensing requirements as follows:\n(1) the commissioner may deny a home and community-based services designation in accordance with section 144A.473 or 144A.475; and\n(2) if the commissioner finds that the applicant or license holder has failed to comply with the applicable home and community-based services designation requirements, the commissioner may issue:\n(i) a correction order in accordance with section 144A.474;\n(ii) an order of conditional license in accordance with section 144A.475;\n(iii) a sanction in accordance with section 144A.475; or\n(iv) any combination of clauses (i) to (iii).\nA home care provider applicant that has been denied a temporary license will also be denied their application for the home and community-based services designation. The applicant may request reconsideration in accordance with section 144A.473, subdivision 3. A licensed home care provider whose application for a home and community-based services designation has been denied or whose designation has been suspended or revoked may appeal the denial, suspension, revocation, or refusal to renew a home and community-based services designation in accordance with section 144A.475. A license holder may request reconsideration of a correction order in accordance with section 144A.474, subdivision 12.\nThe commissioners of health and human services shall enter into any agreements necessary to implement this section.\n(a) The initial fee for a home and community-based services designation is $155. A home care provider renewing the home and community-based services designation must pay an annual nonrefundable fee, in addition to the annual home care license fee, according to the following schedule and based on revenues from the home and community-based services that require licensure under chapter 245D during the calendar year immediately preceding the year in which the license fee is paid:\n(b) Fees and penalties collected under this section shall be deposited in the state treasury and credited to the state government special revenue fund.",
	"repealed": false
}