{
	"id": "10A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.25",
	"title": "10A.25 SPENDING LIMITS.",
	"text": "The expenditure limits imposed by this section apply only to a candidate who has signed an agreement under section 10A.322 to be bound by them as a condition of receiving a public subsidy for the candidate's campaign.\n(a) In a segment of an election cycle, the principal campaign committee of the candidate must not make campaign expenditures nor permit approved expenditures to be made on behalf of the candidate that result in aggregate expenditures in excess of the following:\n(1) for governor and lieutenant governor, running together, $4,232,700 in the election segment and $1,697,400 in the nonelection segment;\n(2) for attorney general, $725,800 in the election segment and $226,400 in the nonelection segment;\n(3) for secretary of state and state auditor, separately, $483,900 in the election segment and $113,300 in the nonelection segment;\n(4) for state senator, $109,100 in the election segment and $32,800 in a nonelection segment;\n(5) for state representative, $80,300 in the election segment.\n(b) In addition to the amount in paragraph (a), clause (1), a candidate for endorsement for the office of lieutenant governor at the convention of a political party may make campaign expenditures and approved expenditures of five percent of that amount to seek endorsement.\n(c) If a special election cycle occurs during a general election cycle, expenditures by or on behalf of a candidate in the special election do not count as expenditures by or on behalf of the candidate in the general election.\n(d) The expenditure limits in this subdivision for an office are increased by ten percent for a candidate who has not previously held the same office, whose name has not previously been on the primary or general election ballot for that office, and who has not in the past ten years raised or spent more than $750 in a run for any other office whose territory now includes a population that is more than one-third of the population in the territory of the new office. Candidates who qualify for first-time candidate status receive a ten percent increase in the campaign expenditure limit in all segments of the applicable election cycle. In the case of a legislative candidate, the office is that of a member of the house of representatives or senate without regard to any specific district.\nIf a candidate makes expenditures from more than one principal campaign committee for nomination or election to statewide office in the same segment of an election cycle, the amount of expenditures from all of the candidate's principal campaign committees for statewide office for that segment of the election cycle must be aggregated for purposes of applying the limits on expenditures under subdivision 2.\nFor the purposes of this chapter, a candidate for governor and a candidate for lieutenant governor, running together, are considered a single candidate. Except as provided in subdivision 2, paragraph (b), all expenditures made by or all approved expenditures made on behalf of the candidate for lieutenant governor are considered to be expenditures by or approved expenditures on behalf of the candidate for governor.\nThe principal campaign committee of a candidate must not make independent expenditures or disbursements for electioneering communications. If the principal campaign committee of a candidate makes a contribution to an independent expenditure committee or independent expenditure fund on or after January 1 of the year the candidate's office will appear on the ballot, the independent expenditure committee or independent expenditure fund must not make an independent expenditure for that candidate.\n[Repealed by amendment, 1999 c 220 s 30]\nNotwithstanding the limits imposed by subdivision 2, the winning candidate in a contested race in a primary who received fewer than twice as many votes as any one of the candidate's opponents in that primary may make expenditures and permit approved expenditures to be made on behalf of the candidate equal to 120 percent of the applicable limit as set forth in subdivision 2, but no more than 100 percent of the limit until after the primary.\n[Repealed, 2013 c 138 art 1 s 55]\n[Repealed by amendment, 1999 c 220 s 30]\n[Repealed, 1978 c 463 s 109]\n[Repealed, 1978 c 463 s 109]\n(a) After the deadline for filing a spending limit agreement under section 10A.322, a candidate who has agreed to be bound by the expenditure limits imposed by this section as a condition of receiving a public subsidy for the candidate's campaign may choose to be released from the expenditure limits but remain eligible to receive a public subsidy if the candidate has an opponent who has not agreed to be bound by the limits and has received contributions or made or become obligated to make expenditures during that election cycle in excess of the following limits:\n(1) up to the close of the reporting period before the primary election, receipts or expenditures equal to 20 percent of the election segment expenditure limit for that office as set forth in subdivision 2; or\n(2) after the close of the reporting period before the primary election, cumulative receipts or expenditures during that election cycle equal to 50 percent of the election cycle expenditure limit for that office as set forth in subdivision 2.\nBefore the primary election, a candidate's \"opponents\" are only those who will appear on the ballot of the same party in the primary election.\n(b) A candidate who has not agreed to be bound by expenditure limits, or the candidate's principal campaign committee, must file written notice with the board and provide written notice to any opponent of the candidate for the same office within 24 hours of exceeding the limits in paragraph (a). The notice must state only that the candidate or candidate's principal campaign committee has received contributions or made or become obligated to make campaign expenditures in excess of the limits in paragraph (a).\n(c) Upon receipt of the notice, a candidate who had agreed to be bound by the limits may file with the board a notice that the candidate chooses to be no longer bound by the expenditure limits. A notice of a candidate's choice not to be bound by the expenditure limits that is based on the conduct of an opponent in the state primary election may not be filed more than one day after the State Canvassing Board has declared the results of the state primary.\n(d) A candidate who has agreed to be bound by the expenditure limits imposed by this section and whose opponent in the general election has chosen, as provided in paragraph (c), not to be bound by the expenditure limits because of the conduct of an opponent in the primary election is no longer bound by the limits but remains eligible to receive a public subsidy.\n[Renumbered 10A.257, subdivision 1]\n[Renumbered 10A.257, subd 2]\n[Repealed by amendment, 1999 c 220 s 30]",
	"repealed": false
}