{
	"id": "609.763",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.763",
	"title": "609.763 LAWFUL GAMBLING FRAUD.",
	"text": "A person is guilty of a crime and may be sentenced as provided in subdivision 2 if the person does any of the following:\n(1) knowingly claims a lawful gambling prize using altered or counterfeited gambling equipment;\n(2) knowingly claims a lawful gambling prize by means of fraud, deceit, or misrepresentation;\n(3) manipulates any form of lawful gambling or tampers with any gambling equipment with intent to influence the outcome of a game or the receipt of a prize;\n(4) knowingly tampers with or attempts to alter any component or device used in the conduct or play of electronic pull-tabs or electronic linked bingo as authorized under chapter 349 or attempts to convert legal gambling into illegal gambling at an establishment licensed under chapter 340A;\n(5) has unauthorized possession of an electronic pull-tab device, an electronic linked bingo device, or other component used in the conduct of electronic pull-tabs or electronic linked bingo as authorized under chapter 349; or\n(6) knowingly places or uses false information on a prize receipt or on any other form approved for use by the Gambling Control Board or the Alcohol and Gambling Enforcement Division of the Department of Public Safety.\nA person who violates subdivision 1 may be sentenced as follows:\n(1) if the dollar amount involved is $500 or less, the person is guilty of a misdemeanor;\n(2) if the dollar amount involved is more than $500 but not more than $2,500, the person is guilty of a gross misdemeanor; and\n(3) if the dollar amount involved is more than $2,500, the person is guilty of a felony and may be sentenced to imprisonment for not more than three years or to payment of a fine of not more than $6,000, or both.\nIn a prosecution under this section, the dollar amounts involved in violation of subdivision 1 within any 12-month period may be aggregated and the defendant charged accordingly. When two or more offenses are committed by the same person in two or more counties, the defendant may be prosecuted in any county in which one of the offenses was committed for all of the offenses aggregated under this subdivision.",
	"repealed": false
}