{
	"id": "103F.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.211",
	"title": "103F.211 MODEL STANDARDS AND CRITERIA.",
	"text": "The commissioner shall adopt model standards and criteria for the subdivision, use, and development of shoreland in municipalities and areas outside of a municipality. The authority to adopt model standards and criteria is exempt from the 18-month time limit under section 14.125 and does not expire. The standards and criteria must include:\n(1) the area of a lot and length of water frontage suitable for a building site;\n(2) the placement of structures in relation to shorelines and roads;\n(3) the placement and construction of sanitary and waste disposal facilities;\n(4) designation of types of land uses;\n(5) changes in bottom contours of adjacent public waters;\n(6) preservation of natural shorelands through the restriction of land uses;\n(7) variances from the minimum standards and criteria; and\n(8) for areas outside of a municipality only, a model ordinance.\nThe state Departments of Administration, Agriculture, Health, and Employment and Economic Development; the Pollution Control Agency; the Board of Water and Soil Resources; and the Minnesota Historical Society shall provide information and advice necessary to prepare or amend the standards and criteria.\nIn addition to other requirements of chapter 14, the model standards and ordinance adopted under this section, or amendments to them must not be finally adopted unless approved by the commissioners of health and of the Pollution Control Agency.\nThe removal of logs and dead trees and branches from the shoreland is exempt from any permit requirements, unless required by a local government unit. Before a person removes logs or dead trees and branches from publicly owned land or land owned by another, the person must obtain permission from the landowner or manager. Public entities are encouraged to allow for the removal of logs and dead trees and branches that present a safety hazard on land managed by the public entity.",
	"repealed": false
}