{
	"id": "84.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.69",
	"title": "84.69 NATURAL RESOURCES CONSERVATION EASEMENT STEWARDSHIP ACCOUNT.",
	"text": "The natural resources conservation easement stewardship account is created in the special revenue fund. The account consists of money credited to the account and interest and other earnings on money in the account. The State Board of Investment must manage the account to maximize long-term gain. The following revenue must be deposited in the natural resources conservation easement stewardship account:\n(1) contributions to the account or specified for any purpose of the account;\n(2) contributions under subdivision 3; section 84.66, subdivision 11; or other applicable law;\n(3) money appropriated for any of the purposes described in subdivision 2;\n(4) money appropriated for monitoring and enforcement of easements and earnings on the money appropriated that revert to the state under section 97A.056, subdivision 17, or other applicable law; and\n(5) gifts under section 84.085 for conservation easement stewardship.\nFive percent of the balance on July 1 of each year in the natural resources conservation easement stewardship account is annually appropriated to the commissioner of natural resources and may be spent only to cover the costs of managing conservation easements held by the Department of Natural Resources, including costs associated with monitoring, landowner contacts, records storage and management, processing landowner notices, requests for approval or amendments, enforcement, and legal services associated with conservation easement management activities.\nThe commissioner shall seek a financial contribution to the natural resources conservation easement stewardship account for each conservation easement acquired by or assigned to the Department of Natural Resources. Unless otherwise provided by law, the commissioner shall determine the amount of the contribution, which must be an amount calculated to earn sufficient money to meet the costs of managing the conservation easement at a level that neither significantly overrecovers nor underrecovers the costs. In determining the amount of the financial contribution, the commissioner shall consider:\n(1) the estimated annual staff hours needed to manage the conservation easement, taking into consideration factors such as easement type, size, location, and complexity;\n(2) the average hourly wages for the class or classes of employees expected to manage the conservation easement;\n(3) the estimated annual travel expenses to manage the conservation easement;\n(4) the estimated annual miscellaneous costs to manage the conservation easement, including supplies and equipment, information technology support, and aerial flyovers;\n(5) the estimated annualized cost of legal services, including the cost to enforce the easement in the event of a violation; and\n(6) the expected rate of return on investments in the account.",
	"repealed": false
}