{
	"id": "296A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.01",
	"title": "296A.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the terms used in this chapter and sections 239.75 to 239.80 have the meanings given them in this section. The petroleum product definitions and specifications are intended to match the definitions and specifications in sections 41A.09 and 239.761.\n\"Agricultural alcohol gasoline\" means a gasoline-ethanol blend satisfying the provisions of section 239.761, subdivision 4a or 4b, with ethanol derived from agricultural products, such as potatoes, cereal, grains, cheese whey, sugar beets, forest products, or other renewable resources.\n\"Aircraft\" means any contrivance, now or hereafter invented, used or designed for navigation of or flight in the air.\n\"Alternative fuel\" means natural gas; liquefied petroleum gas; hydrogen; coal-derived liquefied fuels; electricity; methanol, denatured ethanol, and other alcohols; mixtures containing 85 percent or more, or other percentage as may be set by regulation by Secretary of the United States Department of Energy, by volume of methanol, denatured ethanol, and other alcohols with gasoline or other fuels; fuels other than alcohol that are derived from biological materials; and other fuels that the Secretary of the United States Department of Energy determines by regulation to be an alternative fuel within the meaning of section 301(2) of the National Energy Policy Act of 1992 and intended for use in motor vehicles.\n\"Alternative fuel vehicle\" means a dedicated, flexible, or dual-fuel vehicle operated primarily on alternative fuel.\n\"ASTM\" means the American Society for Testing and Materials, which is a private organization that utilizes committees of industry representatives and regulators to develop product quality standards and test methods to be used by industries, regulatory agencies, and purchasing agents.\n\"Aviation gasoline\" means any gasoline that is used to produce or generate power for propelling internal combustion engine aircraft.\nAviation gasoline includes any gasoline:\n(1) is invoiced and billed by a producer, manufacturer, refiner, or blender to a distributor or dealer, by a distributor to a dealer or consumer, or by a dealer to consumer, as \"aviation gasoline\" that meets specifications in ASTM specification D910-16 or any other ASTM specification as gasoline appropriate for use in producing or generating power for propelling internal combustion engine aircraft; or\n(2) sold to a dealer of aviation gasoline for dispensing directly into the fuel tank of an aircraft.\n\"Aviation turbine fuel\" and \"jet fuel\" mean blends of hydrocarbons derived from crude petroleum, natural gasoline, and synthetic hydrocarbons, intended for use in aviation turbine engines, and that meet the specifications in ASTM specification D1655-12.\n\"Biodiesel fuel\" has the meaning given in section 239.77, subdivision 1.\n\"Biobutanol\" means isobutyl alcohol produced by fermenting agriculturally generated organic material that is to be blended with gasoline and meets either:\n(1) the initial ASTM Standard Specification for Butanol for Blending with Gasoline for Use as an Automotive Spark-Ignition Engine Fuel once it has been released by ASTM for general distribution; or\n(2) in the absence of an ASTM standard specification, the following list of requirements:\n(i) visually free of sediment and suspended matter;\n(ii) clear and bright at the ambient temperature of 21 degrees Celsius or the ambient temperature, whichever is higher;\n(iii) free of any adulterant or contaminant that can render it unacceptable for its commonly used applications;\n(iv) contains not less than 96 volume percent isobutyl alcohol;\n(v) contains not more than 0.4 volume percent methanol;\n(vi) contains not more than 1.0 volume percent water as determined by ASTM standard test method E203 or E1064;\n(vii) acidity (as acetic acid) of not more than 0.007 mass percent as determined by ASTM standard test method D1613;\n(viii) solvent washed gum content of not more than 5.0 milligrams per 100 milliliters as determined by ASTM standard test method D381;\n(ix) sulfur content of not more than 30 parts per million as determined by ASTM standard test method D2622 or D5453; and\n(x) contains not more than four parts per million total inorganic sulfate.\n\"Bulk purchaser\" means any person not principally engaged in buying and selling petroleum products or combustible gases who receives special fuel for storage and subsequent delivery into the supply tank of an aircraft or a licensed motor vehicle operated by the person.\n\"Bulk storage\" or \"bulk storage facility\" means a single property, or contiguous or adjacent properties used for a common purpose and owned or operated by the same person, on or in which are located one or more stationary tanks that are used singularly or in combination for the storage or containment of more than 1,100 gallons of petroleum.\n\"Casinghead gasoline,\" \"absorption gasoline,\" \"condensation gasoline,\" \"drip gasoline,\" and \"natural gasoline\" mean a low-octane, high-volatility, liquid hydrocarbon by-product of crude oil extraction and pumping, coal gasification, or shipping of natural gas through a pipeline.\n\"Commissioner\" means the commissioner of revenue.\n\"Compressed natural gas\" or \"CNG\" means natural gas, primarily methane, condensed under high pressure and stored in specially designed storage tanks at between 2,000 and 3,600 pounds per square inch. For purposes of this chapter, the energy content of CNG is considered to be 900 BTUs per cubic foot.\n\"Dealer\" means any person, except a distributor, engaged in the business of buying and selling gasoline and other petroleum products in this state.\n\"Dealer of aviation gasoline\" means any person who sells gasoline on the premises of an airport as defined under section 360.013, subdivision 39, to be dispensed directly into the fuel tank of an aircraft.\n\"Diesel fuel oil\" means a petroleum distillate or blend of petroleum distillate and residual fuels that is intended for use as a motor fuel in internal combustion diesel engines and that meets ASTM specification D975-11b.\n\"Distributor\" means any person who (1) receives petroleum products in this state for storage and subsequent distribution by tank car or tank truck or both, (2) produces, manufactures, or refines petroleum products in this state, or (3) imports petroleum products into this state via boat, barge, or pipeline for storage and subsequent delivery at or further transportation from boat, barge, or pipe line terminals in this state.\n\"Dyed fuel\" means motor fuel to which indelible dye has been added, either before or upon withdrawal at a terminal or refinery rack, and which may be sold for exempt purposes. The dye may be either dye required to be added per the EPA or dye that meets other specifications required by the Internal Revenue Service or the commissioner.\n\"EPA\" means the United States Environmental Protection Agency.\n\"ETBE\" means ethyl tertiary butyl ether, or the equivalent term tert-butyl ethyl ether. ETBE is a hydrocarbon compound approved by the EPA for use as an oxygenate in gasoline. ETBE is a liquid at normal atmospheric pressure and temperature. The chemical composition of ETBE is C2H5OC(CH3).\n\"E85\" means a petroleum product that is a blend of agriculturally derived denatured ethanol and gasoline or natural gasoline that contains not more than 85 percent ethanol by volume, but at a minimum must contain greater than 50 percent ethanol by volume. For the purposes of this chapter, the energy content of E85 will be considered to be 82,000 BTUs per gallon. E85 produced for use as a motor fuel in alternative fuel vehicles as defined in subdivision 5 must comply with ASTM specification D5798-11.\n\"Ethanol, denatured\" means ethanol that is to be blended with gasoline, has been agriculturally derived, and complies with ASTM specification D4806-11a. This includes the requirement that ethanol may be denatured only as specified in Code of Federal Regulations, title 27, parts 20 and 21.\n\"For use in motor vehicles\" means for use in producing or generating power for propelling motor vehicles on the public highways of this state or in machinery operated on the public highways of this state for the purpose of constructing, reconstructing, or maintaining those public highways. For purposes of this subdivision, \"public highways\" includes bridges.\n\"Gas turbine fuel oil\" means fuel that contains mixtures of hydrocarbon oils free of inorganic acid and excessive amounts of solid or fibrous foreign matter, intended for use in nonaviation gas turbine engines, and that meets the specifications in ASTM specification D2880-03.\n(a) \"Gasoline\" means:\n(1) all products commonly or commercially known or sold as gasoline regardless of their classification or uses, except casinghead gasoline, absorption gasoline, condensation gasoline, drip gasoline, or natural gasoline that under the requirements of section 239.761, subdivision 3, must not be blended with gasoline that has been sold, transferred, or otherwise removed from a refinery or terminal; and\n(2) any liquid prepared, advertised, offered for sale or sold for use as, or commonly and commercially used as, a fuel in spark-ignition, internal combustion engines, and that when tested by the Weights and Measures Division meets the specifications in ASTM specification D4814-11b.\n(b) Gasoline that is not blended with ethanol must not be contaminated with water or other impurities and must comply with both ASTM specification D4814-11b and the volatility requirements in Code of Federal Regulations, title 40, part 1090.\n(c) After gasoline is sold, transferred, or otherwise removed from a refinery or terminal, a person responsible for the product:\n(1) may blend the gasoline with agriculturally derived ethanol, as provided in subdivision 24;\n(2) must not blend the gasoline with any oxygenate other than denatured, agriculturally derived ethanol;\n(3) must not blend the gasoline with other petroleum products that are not gasoline or denatured, agriculturally derived ethanol;\n(4) must not blend the gasoline with products commonly and commercially known as casinghead gasoline, absorption gasoline, condensation gasoline, drip gasoline, or natural gasoline; and\n(5) may blend the gasoline with a detergent additive, an antiknock additive, or an additive designed to replace tetra-ethyl lead, that is registered by the EPA.\n\"Gasoline blended with nonethanol oxygenate\" means gasoline blended with ETBE, MTBE, or other alcohol or ether, except denatured ethanol, that is approved as an oxygenate by the EPA, and that complies with ASTM specification D4814-11b. Oxygenates, other than denatured ethanol, must not be blended into gasoline after the gasoline has been sold, transferred, or otherwise removed from a refinery or terminal.\n\"Gasoline blended with ethanol\" means a gasoline-ethanol blend satisfying the provisions of section 239.761, subdivision 4a or 4b.\n\"Heating fuel oil\" means a petroleum distillate, blend of petroleum distillates and residuals, or petroleum residual heating fuel that meets the specifications in ASTM specification D396-12.\n\"Highway\" means the entire width between the boundary lines of every way publicly maintained when part of the way is open for the public.\n\"Kerosene\" means a refined petroleum distillate consisting of a homogeneous mixture of hydrocarbons essentially free of water, inorganic acidic and basic compounds, and excessive amounts of particulate contaminants and that meets the specifications in ASTM specification D3699-08.\n\"Licensed motor vehicle\" means (1) any vehicle subject to a motor vehicle registration in which the power is produced with any fuel in an internal combustion engine, and (2) any motor vehicle not subject to a motor vehicle registration on which is mounted a corn shelling, feed grinding, well drilling, or sawing machine.\n\"Liquefied natural gas\" or \"LNG\" means natural gas, primarily methane, which has been condensed through a cryogenic cooling process and is stored in special pressurized and insulated storage tanks. For purposes of this chapter, the energy content of LNG will be considered to be 69,000 BTUs per gallon.\n\"Liquefied petroleum gas,\" \"LPG,\" or \"propane\" means a product made of short hydrocarbon chains and containing primarily propane and butane that is stored in specialized tanks at moderate pressure. For purposes of this chapter, the energy content of LPG or propane will be considered to be 86,000 BTUs per gallon.\n\"Marine gasoline\" means gasoline used in producing and generating power for propelling motorboats used on the waters of this state.\n\"Motor fuel\" means a liquid or gaseous form of fuel, regardless of its composition or properties, used to propel a motor vehicle.\n\"MTBE\" means methyl tertiary butyl ether, or the equivalent term tert-butyl methyl ether. MTBE is a hydrocarbon compound approved by the United States Environmental Protection Agency for use as an oxygenate in gasoline. MTBE is a liquid at normal atmospheric pressure and temperature. The chemical composition of MTBE is (CH3)3COCH3.\n\"M85\" means a petroleum product that is a liquid fuel blend of methanol and gasoline that contains at least 70 percent methanol and not more than 85 percent methanol by volume. For the purposes of this chapter, the energy content of M85 will be considered to be 65,000 BTUs per gallon. M85 produced for use as a motor fuel in alternative fuel vehicles, as defined in subdivision 5, must comply with ASTM specification D5797-07.\n\"Motor vehicle gasoline excise tax\" means the tax imposed on gasoline used in producing and generating power for propelling motor vehicles used on the public highways of this state.\n\"Motor vehicles used on public highways of this state\" means every vehicle operated upon the highways of this state, the power for the operation of which is produced or generated in an internal combustion engine, but does not include tractors used solely for agricultural purposes.\n\"Motorboat\" means any contrivance used or designed for navigation on water other than a seaplane, propelled in any respect by machinery, including detachable motors.\n\"Nonethanol oxygenate\" means ETBE or MTBE, as defined in this section, or other alcohol or ether, except denatured ethanol, that is approved as an oxygenate by the EPA.\n\"Passenger snowmobile\" means a self-propelled vehicle designed for travel on snow or ice, steered by skis or runners, with an enclosed passenger section that provides seating for not less than four nor more than 12 passengers.\n\"Person\" means any individual, firm, trust, estate, partnership, association, cooperative association, joint stock company or corporation, public or private, or any representative appointed by order of any court; or an officer or employee of a corporation, or a member or employee of a partnership, who as such officer, employee, or member is under a duty to perform any act prescribed by this chapter.\n\"Petroleum distillate\" means a hydrocarbon or group of hydrocarbon compounds that have been extracted from petroleum crude oil by a distillation process involving evaporation by heating, and subsequent condensation by cooling.\n\"Petroleum products\" means all of the products defined in subdivisions 2, 7, 8, 8a, 8b, 10, 14, 16, 19, 20, 22 to 26, 28, 32, and 35.\n\"Petroleum residual\" means a heavy hydrocarbon or group of heavy hydrocarbon compounds that do not evaporate during a distillation process.\n(a) Except as otherwise provided in this subdivision, petroleum products brought into this state shall be deemed to be \"received\" in this state at the time and place they are unloaded in this state. When so unloaded such products shall be deemed to be received in this state by the person who is the owner immediately after such unloading; provided, however, that if such owner is not licensed as a distributor in this state and if such products were shipped or delivered into this state by a person who is licensed as a distributor, then such products shall be deemed to be received in this state by the licensed distributor by whom the same were so shipped or delivered.\n(b) Petroleum products produced, manufactured, or refined, at a refinery in this state and stored there, or brought into the state by boat or barge or like form of transportation and delivered at a marine terminal in this state and stored there, or brought into the state by pipeline and delivered at a pipeline terminal in this state and stored there, shall not be considered received until they are withdrawn from such refinery or terminal for sale or use in this state or for delivery or shipment to points within this state.\n(c) When withdrawn such products shall be deemed received by the person who was the owner immediately prior to withdrawal; unless (1) such products are withdrawn for shipment or delivery to another licensed distributor, in which case the licensed distributor to whom such shipment or delivery is made shall be deemed to have received such products in this state, or (2) such products are withdrawn for shipment or delivery to a person not licensed as a distributor, under one or more sale or exchange agreements by or between persons one or more of whom is a licensed distributor, in which case the last purchaser or exchangee under such agreement or agreements, who is licensed as a distributor, shall be deemed to have received such products in this state.\n(d) Petroleum products produced in this state in any manner other than as covered in this subdivision shall be considered received by the producer at the time and place produced.\n\"Refinery\" or \"terminal\" means any petroleum refinery, pipeline terminal, river terminal, storage facility, or other point of origin where petroleum products are manufactured, or imported by rail, truck, barge, or pipe; and held, stored, transferred, offered for distribution, distributed, offered for sale, or sold. For the purpose of restricting petroleum product blending, this definition includes all refineries and terminals within and outside of Minnesota. For the purpose of assessing fees, this definition does not include a licensed distributor's bulk storage facility that is used to store petroleum products for which the petroleum inspection fee charged under chapter 239 is either not due or has been paid.\n\"Special fuel\" means:\n(1) all combustible gases and liquid petroleum products or substitutes including undyed diesel fuel, except gasoline, gasoline blended with ethanol, and agricultural alcohol gasoline which are delivered into the supply tank of a licensed motor vehicle or into storage tanks maintained by an owner or operator of a licensed motor vehicle as a source of supply for such vehicle;\n(2) all combustible gases and liquid petroleum products or substitutes, except gasoline, gasoline blended with ethanol, and agricultural alcohol gasoline, when delivered to a licensed special fuel dealer or to the retail service station storage of a distributor who has elected to pay the special fuel excise tax as provided in this chapter;\n(3) all combustible gases and liquid petroleum products or substitutes, except gasoline, which are used as aviation fuel; or\n(4) dyed fuel that is being used illegally in a licensed motor vehicle.\n\"Special fuel dealer\" means any person engaged in the business of selling and delivering special fuel into the supply tank of an aircraft or a licensed motor vehicle.\n\"Use in licensed motor vehicles\" means use in producing or generating power for propelling licensed motor vehicles on the public highways of this state.\n\"Waters of this state\" means any waters capable of substantial beneficial public use and any waters to which the public has access, which are within the territorial limits of this state including boundary waters.\n\"Wet alcohol\" means agriculturally derived fermentation ethyl alcohol having a purity of at least 50 percent but less than 99 percent.",
	"repealed": false
}