{
	"id": "308B.511",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.511",
	"title": "308B.511 REGULAR MEMBERS' MEETINGS.",
	"text": "Regular members' meetings shall be held annually at a time determined by the board, unless otherwise provided for in the bylaws.\nThe regular members' meeting shall be held at the principal place of business of the cooperative or at another conveniently located place as determined by the bylaws or the board.\nThe officers shall submit reports to the members at the regular members' meeting covering the business of the cooperative for the previous fiscal year that show the condition of the cooperative at the close of the fiscal year.\nAll directors shall be elected at the regular members' meeting for the terms of office prescribed in the bylaws, except for directors elected at district or unit meetings.\n(a) The cooperative shall give notice of regular members' meetings by mailing the regular members' meeting notice to each member at the members' last known post office address or by other notification approved by the board and agreed to by the members. The regular members' meeting notice shall be published or otherwise given by approved method at least two weeks before the date of the meeting or mailed at least 15 days before the date of the meeting.\n(b) The notice shall contain a summary of any bylaw amendments adopted by the board since the last annual meeting.\nA member may waive notice of a meeting of members. A waiver of notice by a member entitled to notice is effective whether given before, at, or after the meeting, and whether given in writing, orally, or by attendance. Attendance by a member at a meeting is a waiver of notice of that meeting, except where the member objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened, or objects before a vote on an item of business because the item may not lawfully be considered at that meeting and does not participate in the consideration of the item at that meeting.",
	"repealed": false
}