{
	"id": "28A.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.152",
	"title": "28A.152 COTTAGE FOODS EXEMPTION.",
	"text": "(a) The licensing provisions of sections 28A.01 to 28A.16 do not apply to the following:\n(1) an individual who prepares and sells food that is not potentially hazardous food, as defined in Minnesota Rules, part 4626.0020, subpart 62, if the following requirements are met:\n(i) the prepared food offered for sale under this clause is labeled to accurately reflect the name and the registration number or address of the individual preparing and selling the food, the date on which the food was prepared, the ingredients and any possible allergens, and the statement \"These products are homemade and not subject to state inspection.\"; and\n(ii) the individual displays at the point of sale a clearly legible sign or placard stating: \"These products are homemade and not subject to state inspection.\"; and\n(2) an individual who prepares and sells home-processed and home-canned food products if the following requirements are met:\n(i) the products are pickles, vegetables, or fruits having an equilibrium pH value of 4.6 or lower or a water activity value of .85 or less;\n(ii) the products are home-processed and home-canned in Minnesota;\n(iii) the individual displays at the point of sale a clearly legible sign or placard stating: \"These products are homemade and not subject to state inspection.\"; and\n(iv) each container of the product sold or offered for sale under this clause is accurately labeled to provide the name and the registration number or address of the individual who processed and canned the goods, the date on which the goods were processed and canned, ingredients and any possible allergens, and the statement \"These products are homemade and not subject to state inspection.\"\n(b) An individual who qualifies for an exemption under paragraph (a), clause (2), is also exempt from the provisions of sections 31.31 and 31.392.\n(c) An individual who qualifies for an exemption under paragraph (a) may organize the individual's cottage food business as a business entity recognized by state law.\n(a) An individual qualifying for an exemption under subdivision 1 may sell the exempt food:\n(1) directly to the ultimate consumer at a community event or farmers' market;\n(2) directly from the individual's home to the ultimate consumer, to the extent allowed by local ordinance; or\n(3) through donation to a community event with the purpose of fundraising for an individual, or fundraising for an educational, charitable, or religious organization.\n(b) If an exempt food product will be delivered to the ultimate consumer upon sale of the food product, the individual who prepared the food product must be the person who delivers the food product to the ultimate consumer.\n(c) Food products exempt under subdivision 1, paragraph (a), clause (2), may not be sold outside of Minnesota.\n(d) Food products exempt under subdivision 1 may be sold over the Internet but must be delivered directly to the ultimate consumer by the individual who prepared the food product. The statement \"These products are homemade and not subject to state inspection.\" must be displayed on the website that offers the exempt foods for purchase.\nAn individual selling exempt foods under this section is limited to total sales with gross receipts of $78,000 or less in a calendar year.\nAn individual who prepares and sells exempt food under subdivision 1 must register annually with the commissioner. The commissioner shall register an individual within 30 days of submitting a complete registration to the commissioner. A registration shall be deemed accepted after 30 days following an individual's complete registration to the commissioner. The annual registration fee is $50. An individual with $5,000 or less in annual gross receipts from the sale of exempt food under this section is not required to pay the registration fee. By January 1, 2022, the commissioner shall adjust the gross receipts amount of this fee exemption based on the consumer price index using 2002 as the index year for the $5,000 gross receipts exemption.\n(a) An individual who sells exempt food under this section and is required to pay the registration fee in subdivision 4 must complete a safe food handling training course that is approved by the commissioner before registering under subdivision 4. The training shall not exceed eight hours and must be completed every three years while the individual is registered under subdivision 4.\n(b) An individual who sells exempt food under this section and is exempt from paying the registration fee in subdivision 4 must satisfactorily complete an online course and exam as approved by the commissioner before registering under subdivision 4. The commissioner shall offer the online course and exam under this paragraph at no cost to the individual.\nThis section does not preempt the application of any business licensing requirement or sanitation, public health, or zoning ordinance of a political subdivision.\nA cottage foods account is created as a separate account in the agricultural fund in the state treasury for depositing money received by the commissioner under this section. Money in the account, including interest, is appropriated to the commissioner for purposes of this section.",
	"repealed": false
}