{
	"id": "473.608",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.608",
	"title": "473.608 POWERS OF CORPORATION.",
	"text": "The corporation, subject to the conditions and limitations prescribed by law, shall possess all the powers as a body corporate necessary and convenient to accomplish the objects and perform the duties prescribed by sections 473.601 to 473.679, including but not limited to those hereinafter specified. These powers, except as limited by section 473.622, may be exercised at any place within 35 miles of the city hall of either Minneapolis or St. Paul, and in the metropolitan area, and in the city of Duluth for the purpose of owning, leasing, constructing, equipping, operating, borrowing money from the state for, or otherwise arranging for financing the facility described in section 116R.02, subdivision 5.\nA state loan to finance the facility described in section 116R.02, subdivision 5, must be made on terms and conditions as the commissioner of management and budget, the commissioner of employment and economic development, and the commission determine to be appropriate. The state loan is not subject to and may not be counted against any limitation on the principal amount of revenue bonds or general obligation revenue bonds that the commission may issue under sections 473.601 to 473.679.\nIt may acquire by lease, purchase, gift, devise, or condemnation proceedings all necessary right, title, and interest in and to lands and personal property required for airports and all other real or personal property required for the purposes contemplated by sections 473.601 to 473.679, within the metropolitan area, pay therefor out of funds obtained as hereinafter provided, and hold and dispose of the same, subject to the limitations and conditions herein prescribed except that the corporation may not acquire by any means lands or personal property for a major new airport. Title to any such property acquired by condemnation or purchase shall be in fee simple, absolute, unqualified in any way, but any such real or personal property or interest therein otherwise acquired may be so acquired or accepted subject to any condition which may be imposed thereon by the grantor or donor and agreed to by the corporation, not inconsistent with the proper use of the property by the corporation for the purposes herein provided. Any properties, real or personal, acquired, owned, leased, controlled, used, and occupied by the corporation for any of the purposes of sections 473.601 to 473.679, are declared to be acquired, owned, leased, controlled, used, and occupied for public, governmental, and municipal purposes, and shall be exempt from taxation by the state or any of its political subdivisions, except to the extent that the property is subject to the sales and use tax under chapter 297A. Nothing contained in sections 473.601 to 473.679, shall be construed as exempting properties, real or personal, leased from the Metropolitan Airports Commission to a tenant or lessee who is a private person, association, or corporation from assessments or taxes.\n(a) The Metropolitan Airports Commission may acquire property, consisting of approximately 27 acres in and around Coldwater Springs in Hennepin County, from the Secretary of the Interior of the United States or any other federal official or agency authorized to transfer the property. If the commission acquires the property, the commission may convey all of its interest in the property, other than the interest permitted to be retained under paragraph (b), to the commissioner of natural resources for park, green space, or similar uses.\n(b) To preserve its ability to conduct current or future aviation operations at the Minneapolis-St. Paul International Airport and to protect the commission from potential liability for those aviation operations, the commission may:\n(1) retain an easement permitting overflight or another similar property interest in the property; or\n(2) impose restrictions on the transferred property's use that would be inconsistent with or may create conflicts with aviation operations.\nIt may exercise the power of eminent domain in the manner provided by chapter 117 for the purpose of acquiring any property which it is herein authorized to acquire by condemnation. The fact that the property so needed has been acquired by the owner under power of eminent domain, or is already devoted to a public use, shall not prevent its acquisition by such corporation by the exercise of the power of eminent domain herein conferred. The corporation may take possession of any such property so to be acquired at any time after the filing of the petition describing the same in condemnation proceedings. It shall not be precluded from abandoning the condemnation of any such property in any case where possession thereof has not been taken. When the airports owned by the affected cities are taken over by the corporation under the provisions of Laws 1943, Chapter 500, all persons who are employees of the public body having the management and control of such airport at the time of the taking of the same, shall preserve their status and be entitled to all the rights and privileges under the provisions of any civil service or pension act contained in any charter of any city under which they had been previously employed, or any applicable law of the state of Minnesota.\nIt may sue and be sued.\nIt may contract and be contracted within any matter connected with any purpose or activity within the powers of the corporation as specified in sections 473.601 to 473.679.\nIt may construct and equip new airports, with all powers of acquisition set out in subdivision 2, pay therefor out of the funds obtained as hereinafter provided, and hold, maintain, operate, regulate, police, and dispose of them or any of them as hereinafter provided. It may not construct, equip, or acquire land for a major new airport to replace the existing Minneapolis-St. Paul International Airport, but it may conduct activities necessary to do long-range planning to make recommendations to the legislature on the need for new airport facilities.\nIn addition to the municipal airports taken over by the corporation under the provisions of Laws 1943, Chapter 500, the corporation may acquire by lease, purchase, gift, devise, or condemnation proceedings any existing airports, equip the same and make additions thereto or improvements thereon, pay therefor out of the funds obtained as hereinafter provided, and hold, maintain, operate, regulate, police, and dispose of them or any of them as hereinafter provided; provided, that said corporation shall have no authority to dispose of nor lease municipally owned airports taken over under the provisions of sections 473.601 to 473.679; and provided further, that the corporation shall not acquire a municipally owned airport without the consent of such municipality.\nIt may contract with the owners of existing privately owned airports for the use, equipment, improvement, maintenance, management, and operation by it of such airports, and thereafter use, equip, improve, maintain, manage, operate, regulate, and police them.\nIt may acquire such air rights over private property as are necessary to insure safe approaches to the landing areas of all airports controlled by it, in the manner provided in subdivision 2 for the acquisition of airport property.\nIt may acquire rights or easements for terms of years, or perpetually, to place, operate, and maintain suitable markings and lights for daytime or nighttime marking of buildings or other structures or obstructions, for the safe operation of aircraft utilizing airports to be acquired or maintained under the provisions of sections 473.601 to 473.679, in the manner provided in subdivision 2 for the acquisition of airport property.\nIt may purchase all supplies and materials necessary in carrying out the purposes of sections 473.601 to 473.679.\nIt may borrow money and issue bonds for the purposes of acquiring property, the acquisition of which is herein authorized, constructing and equipping new airports, acquiring existing airports, equipping them and making additions thereto or improvements thereon, and making capital improvements to any airport constructed or acquired by the corporation, or for the purpose of making payments on principal or interest of bonds heretofore issued by either of the cities or any board of park commissioners of either thereof to secure funds for the acquisition, establishment, construction, enlargement or improvement of any airport taken over by the corporation pursuant to the provisions of section 473.621, payment of which has been assumed by the corporation, in the manner and within the limitations herein specified, and pledge any and all property and income of the corporation acquired or received as herein provided to secure the payment of such bonds, subject to the conditions and limitations herein prescribed, and redeem any such bonds if so provided therein or in the mortgage or deed of trust accompanying them, and may assume the payment of existing bonded indebtedness as specifically provided in sections 473.601 to 473.679.\n(a) The commission may issue general airport revenue bonds, special facilities bonds, and passenger facility charge bonds to fund:\n(1) airports and air navigation facilities;\n(2) other capital improvements at airports managed by the commission;\n(3) noise abatement and natural resource protection measures, regardless of location and ownership;\n(4) transportation and parking improvements related to airports managed by the commission, regardless of location; and\n(5) the refund of any outstanding obligations of the commission.\nThe commission may secure the bonds with available revenue in accordance with generally accepted public financial practices under a resolution of the commission or trust indenture for the bonds. The bonds may not be secured by the full faith and credit of the commission or a pledge of the taxing authority of the commission or of any city in or for which the commission has been created.\n(b) The commission shall notify the commissioner of management and budget, the chair of the Taxes Committee of the house of representatives, and the chair of the Taxes and Tax Laws Committee of the senate of any proposal to issue bonds under this subdivision and provide them an opportunity to review the proposal.\n(c) The commission may obligate itself to establish, revise, and collect rates, fees, charges, and rentals for all airport and air navigation facilities used by or made available to any person, firm, association, or corporation to produce revenues sufficient:\n(1) to pay principal and interest on all obligations of the commission;\n(2) to fund reserves for the bonds;\n(3) to pay other commission expenses in accordance with law.\n(d)(1) Any pledge of revenues under this section is subordinate to the pledge of current revenues to cancel taxes levied for general obligation revenue bonds issued under section 473.665.\n(2) Subject to clause (1), if the bonds meet the conditions of section 473.667, subdivision 7, the commission may pledge revenues to the revenue bonds issued under this subdivision on a parity with the pledge of revenues to general obligation revenue bonds issued under section 473.667. The pledge of revenues to revenue bonds issued under this subdivision may be prior to the obligation under section 473.667, subdivision 6, to repay any deficiency taxes levied for general obligation revenue bonds.\n(3) The commission may pledge revenues of any discrete facility or portions of the airport and air navigation facilities of the commission to the bonds. The commission may establish reserves from any available funds or the proceeds of the bonds and may make other covenants as it deems necessary to protect the holders of the bonds. Passenger facility charge bonds may pledge receipts from passenger facility charges separately or together with a pledge of other revenues.\n(e) The commission may use any powers under chapter 475, except the power to issue general obligation bonds.\nIt may use for the following purposes any available moneys received by it from any source as herein provided, in excess of those appropriated, donated, loaned, or otherwise paid over to the corporation for specific purposes, or received from the sale of bonds, and those required for the payment of any bonds issued by the corporation and interest thereon, according to the terms of such bonds or of any mortgage or trust deed accompanying the same: (a) To pay the necessary incidental expenses of carrying on the business and activities of the corporation as herein authorized; (b) to pay the cost of operating, maintaining, repairing, extending, and improving the properties under the control of the corporation; (c) to pay interest and principal of any bonds heretofore issued by either of the cities or any board of park commissioners of either thereof to secure funds for the acquisition, establishment, construction or enlargement of any airport referred to in section 473.621, subdivision 2, payment of which has been assumed by it, or by the state of Minnesota; (d) if any further such excess moneys remain, to purchase upon the open market at or above or below the face or par value thereof any bonds issued by the corporation as herein authorized; any bonds so purchased to thereupon be canceled.\nIt may accept from the United States or the state of Minnesota, or any of their agencies, moneys or other assistance, whether by gift, loan, or otherwise, for the purpose of carrying out the purposes of sections 473.601 to 473.679, and developing airports and other aeronautic facilities, and may enter into such contracts with the United States or the state of Minnesota, or any of their agencies as it may deem proper and consistent with the purposes of sections 473.601 to 473.679.\nWithout limitation upon any other powers in sections 473.601 to 473.679, it may contract with any person for the use by the person of any property and facilities under its control, for such purposes, and to an extent as will, in the opinion of the commissioners, further the interests of aeronautics in this state and particularly within the metropolitan area, including, but not limited to, the right to lease property or facilities, or any part thereof, for a term not to exceed 99 years, to any person, the national government, or any foreign government, or any department of either, or to the state or any municipality. The corporation shall not have the authority to lease, in its entirety, any municipal airport taken over by it under the provisions of sections 473.601 to 473.679. The commission may contract with any person for the use or lease in accordance with this subdivision of any property and facilities under its control for motel, hotel and garage purposes, and for other purposes as, in the opinion of the commissioners, are desirable to furnish goods, wares, services and accommodations to or for the passengers and other users of airports under the control of the corporation. Nothing in this subdivision shall be interpreted to permit the sale of intoxicating liquor upon the property or facilities except as authorized in chapter 340.\nIt may generally carry on the business of acquiring, establishing, developing, extending, maintaining, operating, and managing airports, with all powers incident thereto except it is expressly prohibited from exercising these powers for the purpose of future construction of a major new airport.\n(1) It may adopt and enforce rules, regulations, and ordinances it deems necessary for the purposes of sections 473.601 to 473.679, including those relating to the internal operation of the corporation and to the management and operation of airports owned or operated by it, subject to sections 473.601 to 473.679. Any person violating any rule, regulation or ordinance is guilty of a misdemeanor.\n(2) The prosecution may be before the district court having jurisdiction over the place where the violation occurs. Every sheriff, police officer, and other peace officer shall arrest offenders. The fines collected shall be paid into the treasury of the corporation. The portion of the fines necessary to cover all costs and disbursements incurred in processing and prosecuting the violations in the court shall be transferred to the court administrator. All persons committed shall be received into any penal institution in the county in which the offense was committed. All persons shall take notice of the rules, regulations, and ordinances without pleading or proof.\n(3) A public hearing need not be held on rules, regulations and ordinances relating to the internal operation of the commission or to the management or operation of airports owned or operated by it unless the rule, regulation or ordinance affects substantial rights.\n(4) When necessary, the corporation may adopt and enforce without a public hearing all other rules, regulations or ordinances, but it shall hold a public hearing within 30 days after their adoption. Prior to the hearing, the corporation shall give at least 15 days' notice by publication in appropriate legal newspapers of general circulation in the metropolitan area and mail a copy of them to all interested parties who have registered their names with the corporation for that purpose. If the rules, regulations, or ordinances are not deemed immediately necessary, the corporation shall hold a public hearing on them after giving the required notice. The rules, regulations, or ordinances shall not be adopted and enforced until after the hearing.\n(5) Notice of the adoption of rules, regulations and ordinances shall, as soon as possible after adoption, be published in appropriate legal newspapers of general circulation in the metropolitan area. Proof of publication and a copy of the rule, regulation, or ordinance shall be filed with the secretary of state. They shall then be in full force and effect.\n(6) Any person substantially interested or affected in rights as to person or property by a rule, regulation or ordinance adopted by the corporation, may petition the corporation for reconsideration, amendment, modification, or waiver of it. The petition shall set forth a clear statement of the facts and grounds upon which it is based. The corporation shall grant the petitioner a public hearing within 30 days after the filing of the petition.\nIt shall have the power to conduct investigations, inquiries and hearings concerning matters covered by the provisions of sections 473.601 to 473.679 and orders, rules and regulations of the commission; and shall hold hearings as required by said sections 473.601 to 473.679. Notice of hearings to all interested parties shall be given as specified in said sections 473.601 to 473.679, in the instances specified, and otherwise in accordance with such rules as the commission may adopt. All hearings shall be open to the public, and shall be conducted by the commission itself or a committee or member thereof designated by the commission for such purposes. Where a hearing is conducted by a committee or a member of the commission, such committee or member shall make a full and complete report thereof, together with a transcript of all testimony and evidence taken at the hearing, to the commission and the commission shall proceed to a determination of the subject matter of said hearing and make its findings and conclusions and order with respect thereto. Any member of the commission conducting or participating in the conduct of any hearing shall have the power to administer oaths and affirmations, to issue subpoenas, and compel the attendance and testimony of witnesses, and the production of papers, books and documents. The commission, or its director, shall upon request of any party to a hearing issue subpoenas to compel the attendance and testimony of witnesses, and the production of papers, books and documents. In case of failure of any witness to comply with any served subpoena, the commission may invoke the aid of any court of this state of general jurisdiction. The court may order the witness to comply with the subpoena and any failure so to do may be punished by the court as a contempt thereof. The testimony and other evidence at any and all hearings shall be taken by a reporter employed by the commission, and any party in interest upon payment to said reporter of the going rates therefor shall be entitled to a transcript thereof. Witnesses shall receive the same fees and mileage as in court actions, and a witness before being required to respond to a subpoena shall be given fees and mileage for one day's attendance.\nThe corporation shall construct an acoustical barrier in or along the perimeter of maintenance areas of the Minneapolis-St. Paul International Airport. It also shall construct acoustical barriers along the perimeter of runways of such airport where it is reasonably necessary, practical and safe to do so according to the standards of the Federal Aviation Administration. All barriers shall conform to specifications approved by the Pollution Control Agency. For purposes of this subdivision, an acoustical barrier is a wall, fence, natural barrier such as an earthen barrier or trees designed to abate noise. The corporation shall also confer and cooperate with any entity which it creates for the purpose of studying and implementing sound abatement programs and with representatives of persons residing in the vicinity of any airport who desire to explore means for relieving the area of the detrimental effects of aircraft noise.\nNotwithstanding the provisions of any other law none of the construction authorized by this subdivision shall be subject to review or approval by the Metropolitan Council.\nMS 1994 [Repealed, 1996 c 310 s 1]\nThe corporation shall establish one joint airport zoning board for each airport operated under its authority in accordance with section 360.063, subdivision 3, paragraph (e). Notwithstanding the provisions of section 360.065, subdivision 1, mailed notice to property owners is not required for hearings concerning adoption of zoning regulations by a joint airport zoning board for Minneapolis-St. Paul International Airport.\nThe commission shall provide, in public areas at the international airport, public pay telephones with telecommunications devices, commonly known as \"TDD's,\" that permit a person who has a communication disability to communicate with others by telephone. The commission shall provide one such telephone on each concourse of the main terminal, one in the main ticketing area of the main terminal, and one in the Humphrey Terminal. The commission shall place signs at strategic locations in and about the terminals indicating where the telephones are available.\nExcept as otherwise provided in this subdivision, the commission may not provide free parking at the Minneapolis-Saint Paul International Airport terminal. The commission may provide free parking to employees and members of the commission who are at the terminal on official business. The commission may provide free parking at the Minneapolis-Saint Paul International Airport terminal for persons who are not employees or members of the commission if those persons are attending a meeting of the commission or performing volunteer work in the terminal. A card or pass issued to provide free parking must have an expiration date of no later than one year after the card or pass is issued. The commission shall require an expired card to be returned to the commission or shall account for it in another manner. The commission shall maintain a record of who receives free parking at the terminal, including the person's name, organization, date, the dollar value of the free parking provided, and the purpose for which the free parking was provided.\nAfter complying with the publication and public comment requirements of United States Code, title 49, section 47524(b), and other applicable federal requirements, the corporation shall prohibit operation at Minneapolis-St. Paul International Airport of aircraft not complying with stage 3 noise levels after December 31, 1999.\nThe corporation shall implement the Minneapolis-St. Paul International Airport year 2010 long-term comprehensive plan.\nThe corporation shall not be required to provide environmental or technical analysis of the new airport alternative in the dual track planning process final environmental impact statement.\nThe corporation shall develop and implement a plan to divert the maximum feasible number of general aviation operations from Minneapolis-St. Paul International Airport to those airports designated by the federal aviation administration as reliever airports for Minneapolis-St. Paul International Airport.\nThe corporation is prohibited from constructing a replacement passenger terminal on the west side of Minneapolis-St. Paul International Airport without legislative approval.\n(a) The corporation must enter into a contract with each affected city that provides the corporation may not construct a third parallel runway at the Minneapolis-St. Paul International Airport without the affected city's approval. The corporation must enter into the contracts by January 1, 1997.\n(b) If a contract with a city as required by this subdivision is not executed by January 1, 1997, as a result of the corporation failing to act in good faith, the amount the corporation must spend for noise mitigation in the affected city is increased by 100 percent of the amount spent in the most recent year in which an expenditure was made for noise mitigation in the affected city.\n(c) A contract entered into by a city and the corporation under this subdivision creates and the contract must provide third-party beneficiary rights on behalf of the affected property owners in the affected cities. These third-party beneficiary rights apply only if a state law changes, supersedes, or invalidates the contract or authorizes or enables the corporation to construct a third parallel runway notwithstanding the contract.\n(d) An \"affected city\" is any city that would experience an increase in the area located within the 60 Ldn noise contour as a result of operations using the third parallel runway.",
	"repealed": false
}