{
	"id": "174.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.375",
	"title": "174.375 ACTIVE TRANSPORTATION ADVISORY COMMITTEE.",
	"text": "(a) The commissioner of transportation must establish an active transportation advisory committee. The advisory committee must make recommendations to the commissioner on items related to:\n(1) active transportation, including safety, education, and development programs;\n(2) the active transportation program under section 174.38; and\n(3) the safe routes to school program under section 174.40.\n(b) The committee must review and analyze issues and needs relating to active transportation on public rights-of-way and identify solutions and goals for addressing identified issues and needs.\n(c) For purposes of this section, \"active transportation\" includes bicycling, pedestrian activities, and other forms of nonmotorized transportation.\n(a) The advisory committee consists of the members specified in this subdivision.\n(b) The commissioner of transportation must appoint up to 18 public members as follows: one member from each of the department's seven greater Minnesota districts; four members from the department's metropolitan district; and no more than seven members at large. Each of the members at large must represent nonmotorized interests or organizations.\n(c) The commissioners of each of the following state agencies must appoint an employee of the agency to serve as a member: administration, education, health, natural resources, public safety, transportation, and pollution control. The chair of the Metropolitan Council must appoint an employee of the council to serve as a member. The director of Explore Minnesota Tourism must appoint an employee of the agency to serve as a member.\n(d) The division administrator of the Federal Highway Administration may appoint an employee of the agency to serve as a member.\n(e) Each member of the committee serves a four-year term at the pleasure of the appointing authority.\n(f) The committee must select a chair from its membership.\n(a) The advisory committee must establish a meeting schedule and meet at least annually.\n(b) The commissioner of transportation must provide department staff support to the advisory committee.\n(a) Members of the advisory committee serve without compensation, but members who are not employees of government agencies must be reimbursed for expenses in the same manner and amount as authorized by the commissioner's plan adopted under section 43A.18, subdivision 2.\n(b) To provide compensation under paragraph (a), the commissioner of transportation may expend the amount necessary from general fund appropriations.\nThe advisory committee must submit an annual report to the commissioner of transportation.\nThe advisory committee expires June 30, 2033.",
	"repealed": false
}