{
	"id": "144A.482",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.482",
	"title": "144A.482 REGISTRATION OF HOME MANAGEMENT PROVIDERS.",
	"text": "(a) For purposes of this section, a home management provider is a person or organization that provides at least two of the following services: housekeeping, meal preparation, and shopping to a person who is unable to perform these activities due to illness, disability, or physical condition.\n(b) A person or organization that provides only home management services may not operate in the state without a current certificate of registration issued by the commissioner of health. To obtain a certificate of registration, the person or organization must annually submit to the commissioner the name, mailing and physical addresses, email address, and telephone number of the person or organization and a signed statement declaring that the person or organization is aware that the home care bill of rights applies to their clients and that the person or organization will comply with the home care bill of rights provisions contained in section 144A.44. A person or organization applying for a certificate must also provide the name, business address, and telephone number of each of the persons responsible for the management or direction of the organization.\n(c) The commissioner shall charge an annual registration fee of $20 for persons and $50 for organizations. The registration fee shall be deposited in the state treasury and credited to the state government special revenue fund.\n(d) A home care provider that provides home management services and other home care services must be licensed, but licensure requirements other than the home care bill of rights do not apply to those employees or volunteers who provide only home management services to clients who do not receive any other home care services from the provider. A licensed home care provider need not be registered as a home management service provider but must provide an orientation on the home care bill of rights to its employees or volunteers who provide home management services.\n(e) An individual who provides home management services under this section must, within 120 days after beginning to provide services, attend an orientation session that provides training on the home care bill of rights and an orientation on the aging process and the needs and concerns of elderly and disabled persons.\n(f) The commissioner may suspend or revoke a provider's certificate of registration or assess fines for violation of the home care bill of rights. Any fine assessed for a violation of the home care bill of rights by a provider registered under this section shall be in the amount established in the licensure rules for home care providers. As a condition of registration, a provider must cooperate fully with any investigation conducted by the commissioner, including providing specific information requested by the commissioner on clients served and the employees and volunteers who provide services. Fines collected under this paragraph shall be deposited in the state treasury and credited to the fund specified in the statute or rule in which the penalty was established.\n(g) The commissioner may use any of the powers granted in sections 144A.43 to 144A.4798 to administer the registration system and enforce the home care bill of rights under this section.",
	"repealed": false
}