{
	"id": "469.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.105",
	"title": "469.105 SALE OF PROPERTY.",
	"text": "An economic development authority may sell and convey property owned by it within the city or an economic development district if it determines that the sale and conveyance are in the best interests of the city or district and its people, and that the transaction furthers its general plan of economic development. This section is not limited by other law on powers of economic development authorities.\nAn authority shall hold a hearing on the sale. At the hearing a taxpayer may testify for or against the sale. At least ten, but not more than 20, days before the hearing the authority shall publish notice of the hearing on the proposed sale in a newspaper. The newspaper must be published and have general circulation in the authority's county and city. The notice must describe the property to be sold and state the time and place of the hearing. The notice must also state that the public may see the terms and conditions of the sale at the authority's office and that at the hearing the authority will meet to decide if the sale is advisable.\nThe authority shall make its findings and decision on whether the sale is advisable and enter its decision on its records within 30 days of the hearing. A taxpayer may appeal the decision by filing a notice of appeal with the district court in the city or economic development district's county and serving the notice on the secretary of the authority, within 20 days after the decision is entered. The only ground for appeal is that the action of the authority was arbitrary, capricious, or contrary to law.\nThe terms and conditions of sale of the property must include the use that the bidder will be allowed to make of it. The authority may require the purchaser to file security to assure that the property will be given that use. In deciding the sale terms and conditions the authority may consider the nature of the proposed use and the relation of the use to the improvement of the authority's city and the business and the facilities of the authority in general. The sale must be made on the authority's terms and conditions. The authority may publish an advertisement for bids on the property at the same time and in the same manner as the notice of hearing required in this section. The authority may award the sale to the bid considered by it to be most favorable considering the price and the specified intended use. The authority may also sell the property at private sale at a negotiated price if after its hearing the authority considers that sale to be in the public interest and to further the aims and purposes of sections 469.090 to 469.108.\nWithin one year from the date of purchase, the purchaser shall devote the property to its intended use or begin work on the improvements to the property to devote it to that use. If the purchaser fails to do so, the authority may cancel the sale and title to the property shall return to it. The authority may extend the time to comply with a condition if the purchaser has good cause. The terms of sale may contain other provisions that the authority considers necessary and proper to protect the public interest. A purchaser must not transfer title to the property within one year of purchase without the consent of the authority.\nA sale made under this section must incorporate in the deed as a covenant running with the land the conditions of sections 469.090 to 469.108 relating to the use of the land. If the covenant is violated the authority may declare a breach of the covenant and seek a judicial decree from the district court declaring a forfeiture and a cancellation of the deed.\nA conveyance must not be made until the purchaser gives the authority plans and specifications to develop the property sold. The authority must approve the plans and specifications in writing. The authority may require preparation of final plans and specifications before the hearing on the sale.",
	"repealed": false
}