{
	"id": "245D.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.061",
	"title": "245D.061 EMERGENCY USE OF MANUAL RESTRAINTS.",
	"text": "The license holder must ensure that emergency use of manual restraints complies with the requirements of this chapter and the license holder's policy and procedures as required under subdivision 9.\nEmergency use of manual restraint must meet the following conditions:\n(1) immediate intervention must be needed to protect the person or others from imminent risk of physical harm; and\n(2) the type of manual restraint used must be the least restrictive intervention to eliminate the immediate risk of harm and effectively achieve safety. The manual restraint must end when the threat of harm ends.\n[Repealed, 2015 c 78 art 6 s 32]\nThe license holder shall monitor a person's health and welfare during an emergency use of a manual restraint. Staff monitoring the procedure must not be the staff implementing the procedure when possible. The license holder shall complete a monitoring form, approved by the commissioner, for each incident involving the emergency use of a manual restraint.\n(a) Within three calendar days after an emergency use of a manual restraint, the staff person who implemented the emergency use must report in writing to the designated coordinator the following information about the emergency use:\n(1) the staff and persons receiving services who were involved in the incident leading up to the emergency use of manual restraint;\n(2) a description of the physical and social environment, including who was present before and during the incident leading up to the emergency use of manual restraint;\n(3) a description of what less restrictive alternative measures were attempted to de-escalate the incident and maintain safety before the manual restraint was implemented that identifies when, how, and how long the alternative measures were attempted before manual restraint was implemented;\n(4) a description of the mental, physical, and emotional condition of the person who was restrained, and other persons involved in the incident leading up to, during, and following the manual restraint;\n(5) whether there was any injury to the person who was restrained or other persons involved in the incident, including staff, before or as a result of the use of manual restraint;\n(6) whether there was a debriefing with the staff, and, if not contraindicated, with the person who was restrained and other persons who were involved in or who witnessed the restraint, following the incident and the outcome of the debriefing. If the debriefing was not conducted at the time the incident report was made, the report should identify whether a debriefing is planned; and\n(7) a copy of the report must be maintained in the person's service recipient record.\n(b) Each single incident of emergency use of manual restraint must be reported separately. For the purposes of this subdivision, an incident of emergency use of manual restraint is a single incident when the following conditions have been met:\n(1) after implementing the manual restraint, staff attempt to release the person at the moment staff believe the person's conduct no longer poses an imminent risk of physical harm to self or others and less restrictive strategies can be implemented to maintain safety;\n(2) upon the attempt to release the restraint, the person's behavior immediately re-escalates; and\n(3) staff must immediately reimplement the restraint in order to maintain safety.\n(a) Within five working days of the emergency use of manual restraint, the license holder must complete and document an internal review of each report of emergency use of manual restraint. The review must include an evaluation of whether:\n(1) the person's service and support strategies developed according to sections 245D.07 and 245D.071 need to be revised;\n(2) related policies and procedures were followed;\n(3) the policies and procedures were adequate;\n(4) there is a need for additional staff training;\n(5) the reported event is similar to past events with the persons, staff, or the services involved; and\n(6) there is a need for corrective action by the license holder to protect the health and welfare of persons.\n(b) Based on the results of the internal review, the license holder must develop, document, and implement a corrective action plan for the program designed to correct current lapses and prevent future lapses in performance by individuals or the license holder, if any. The corrective action plan, if any, must be implemented within 30 days of the internal review being completed.\n(c) The license holder must maintain a copy of the internal review and the corrective action plan, if any, in the person's service recipient record.\n(a) Within five working days after the completion of the internal review required in subdivision 6, the license holder must consult with the expanded support team following the emergency use of manual restraint to:\n(1) discuss the incident reported in subdivision 5, to define the antecedent or event that gave rise to the behavior resulting in the manual restraint and identify the perceived function the behavior served; and\n(2) determine whether the person's support plan addendum needs to be revised according to sections 245D.07 and 245D.071 to positively and effectively help the person maintain stability and to reduce or eliminate future occurrences requiring emergency use of manual restraint.\n(b) The license holder must maintain a written summary of the expanded support team's discussion and decisions required in paragraph (a) in the person's service recipient record.\nWithin five working days of the expanded support team review, the license holder must submit the following to the Department of Human Services, and the Office of the Ombudsman for Mental Health and Developmental Disabilities, as required under section 245.94, subdivision 2a:\n(1) the report required under subdivision 5;\n(2) the internal review and the corrective action plan required under subdivision 6; and\n(3) the summary of the expanded support team review required under subdivision 7.\nThe license holder must develop, document, and implement a policy and procedures that promote service recipient rights and protect health and welfare during the emergency use of manual restraints. The policy and procedures must comply with the requirements of this section and must specify the following:\n(1) a description of the positive support strategies and techniques staff must use to attempt to de-escalate a person's behavior before it poses an imminent risk of physical harm to self or others;\n(2) a description of the types of manual restraints the license holder allows staff to use on an emergency basis, if any. If the license holder will not allow the emergency use of manual restraint, the policy and procedure must identify the alternative measures the license holder will require staff to use when a person's conduct poses an imminent risk of physical harm to self or others and less restrictive strategies would not achieve safety;\n(3) instructions for safe and correct implementation of the allowed manual restraint procedures;\n(4) the training that staff must complete and the timelines for completion, before they may implement an emergency use of manual restraint. In addition to the training on this policy and procedure and the orientation and annual training required in section 245D.09, subdivision 4, the training for emergency use of manual restraint must incorporate the following subjects:\n(i) alternatives to manual restraint procedures, including techniques to identify events and environmental factors that may escalate conduct that poses an imminent risk of physical harm to self or others;\n(ii) de-escalation methods, positive support strategies, and how to avoid power struggles;\n(iii) simulated experiences of administering and receiving manual restraint procedures allowed by the license holder on an emergency basis;\n(iv) how to properly identify thresholds for implementing and ceasing restrictive procedures;\n(v) how to recognize, monitor, and respond to the person's physical signs of distress, including positional asphyxia;\n(vi) the physiological and psychological impact on the person and the staff when restrictive procedures are used;\n(vii) the communicative intent of behaviors; and\n(viii) relationship building;\n(5) the procedures and forms to be used to monitor the emergency use of manual restraints, including what must be monitored and the frequency of monitoring per each incident of emergency use of manual restraint, and the person or position who is responsible for monitoring the use;\n(6) the instructions, forms, and timelines required for completing and submitting an incident report by the person or persons who implemented the manual restraint; and\n(7) the procedures and timelines for conducting the internal review and the expanded support team review, and the person or position responsible for completing the reviews and for ensuring that corrective action is taken or the person's support plan addendum is revised, when determined necessary.",
	"repealed": false
}