{
	"id": "256R.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/256R.26",
	"title": "256R.26 PROPERTY PAYMENT RATE.",
	"text": "A facility's limited URC is the lesser of:\n(1) the facility's recognized URC from the appraisal; or\n(2) the product of (i) the number of the facility's licensed beds three months prior to the beginning of the rate year, (ii) the construction cost per square foot value, and (iii) 1,000 square feet.\nA facility's limited URC ratio is the facility's limited URC as determined in subdivision 1 divided by the facility's URC.\nA facility's limited DRC is the product of the facility's DRC and the facility's limited URC ratio as determined in subdivision 2.\nA facility's land and land improvement value is the facility's limited URC as determined in subdivision 1 multiplied by 0.05.\nA facility's annual fair rental value is the product of:\n(1) the sum of the facility's limited DRC as determined in subdivision 3 and the land and land improvement value as determined in subdivision 4; multiplied by\n(2) the rental rate.\nA facility's fair rental value property rate is the quotient of:\n(1) the facility's annual fair rental value as determined in subdivision 5; divided by\n(2) the product of the facility's capacity days and 0.88.\nA facility's equipment allowance rate is the quotient of:\n(1) the product of (i) the equipment allowance per bed value, (ii) the facility's number of licensed beds, and (iii) the rental rate; divided by\n(2) the product of the facility's capacity days and 0.88.\nExcept as provided in subdivision 9, paragraph (a), a facility's total property payment rate is the sum of the facility's fair rental value property rate as determined in subdivision 6 and the facility's equipment allowance rate as determined in subdivision 7.\n(a) A facility's property payment rate is the property rate established for the facility under sections 256B.431 and 256B.434 until the facility's property rate is transitioned upon completion of any project authorized under section 144A.071, subdivision 3 or 4d; or 144A.073, subdivision 3, to the fair rental value property rate calculated under this chapter.\n(b) Effective the first day of the first month of the calendar quarter after the completion of the project described in paragraph (a), the commissioner shall transition a facility to the property payment rate calculated under this chapter. The initial rate year ends on December 31 and may be less than a full 12-month period. The commissioner shall schedule an appraisal within 90 days of the commissioner receiving notification from the facility that the project is completed. The commissioner shall apply the property payment rate determined after the appraisal retroactively to the first day of the first month of the calendar quarter after the completion of the project.\n(c) Upon a facility's transition to the fair rental value property rates calculated under this chapter, the facility's total property payment rate under subdivision 8 shall be the only payment for costs related to capital assets, including depreciation, interest and lease expenses for all depreciable assets, including movable equipment, land improvements, and land. Facilities with property payment rates established under subdivisions 1 to 8 are not eligible for planned closure rate adjustments under section 256R.40; consolidation rate adjustments under section 144A.071, subdivisions 4c, paragraph (a), clauses (5) and (6), and 4d; single-bed room incentives under section 256R.41; and the property rate inflation adjustment under section 256B.434, subdivision 4. The commissioner shall remove any of these incentives from the facility's existing rate upon the facility transitioning to the fair rental value property rates calculated under this chapter.\nA nursing facility new to the medical assistance program must, upon completion of construction of the nursing facility, have the building and fixed equipment appraised by a property appraisal firm selected by the commissioner or, if not newly constructed, upon entering the medical assistance program. The commissioner shall schedule an appraisal within 90 days of notification from the facility that the facility has become Medicaid certified. The commissioner shall apply the property payment rate determined after the initial appraisal retroactively to the Medicaid certification date.",
	"repealed": false
}