{
	"id": "154.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/154.01",
	"title": "154.01 REGISTRATION MANDATORY.",
	"text": "(a) The registration of the practice of barbering serves the public health and safety of the people of the state of Minnesota by ensuring that individuals seeking to practice the profession of barbering are appropriately trained in the use of the chemicals, tools, and implements of barbering and demonstrate the skills necessary to conduct barber services in a safe, sanitary, and appropriate environment required for infection control.\n(b) No person shall practice, offer to practice, or attempt to practice barbering without a current certificate of registration as a registered barber, issued pursuant to provisions of sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 by the Board of Barber Examiners.\n(c) A registered barber must only provide barbering services in a registered barber shop or barber school, unless prior authorization is given by the board.\n(d) No person shall operate a barber shop unless it is at all times under the direct supervision and management of a registered barber and the owner or operator of the barber shop possesses a current shop registration card, issued to the barber shop establishment address, under sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 by the Board of Barber Examiners.\n(e) No person shall serve, offer to serve, or attempt to serve as an instructor of barbering without a current certificate of registration as a registered instructor of barbering or a temporary permit as an instructor of barbering, as provided for the board by rule, issued under sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 by the Board of Barber Examiners. Barber instruction must be provided in registered barber schools only.\n(f) No person shall operate a barber school unless the owner or operator possesses a current certificate of registration as a barber school, issued under sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 by the Board of Barber Examiners.",
	"repealed": false
}