{
	"id": "149A.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.56",
	"title": "149A.56 LICENSE TO OPERATE A NATURAL ORGANIC REDUCTION FACILITY.",
	"text": "This section is effective July 1, 2025. Except as provided in section 149A.01, subdivision 3, no person shall maintain, manage, or operate a place or premises devoted to or used in the holding and natural organic reduction of a dead human body without possessing a valid license to operate a natural organic reduction facility issued by the commissioner of health.\n(a) A natural organic reduction facility licensed under this section must consist of:\n(1) a building or structure that complies with applicable local and state building codes, zoning laws and ordinances, and environmental standards, and that contains one or more natural organic reduction vessels for the natural organic reduction of dead human bodies;\n(2) a motorized mechanical device for processing the remains in natural reduction; and\n(3) an appropriate refrigerated holding facility for dead human bodies awaiting natural organic reduction.\n(b) A natural organic reduction facility licensed under this section may also contain a display room for funeral goods.\n(a) An applicant for a license to operate a natural organic reduction facility shall submit a completed application to the commissioner. A completed application includes:\n(1) a completed application form, as provided by the commissioner;\n(2) proof of business form and ownership; and\n(3) proof of liability insurance coverage or other financial documentation, as determined by the commissioner, that demonstrates the applicant's ability to respond in damages for liability arising from the ownership, maintenance, management, or operation of a natural organic reduction facility.\n(b) Upon receipt of the application and appropriate fee, the commissioner shall review and verify all information. Upon completion of the verification process and resolution of any deficiencies in the application information, the commissioner shall conduct an initial inspection of the premises to be licensed. After the inspection and resolution of any deficiencies found and any reinspections as may be necessary, the commissioner shall make a determination, based on all the information available, to grant or deny licensure. If the commissioner's determination is to grant the license, the applicant shall be notified and the license shall issue and remain valid for a period prescribed on the license, but not to exceed one calendar year from the date of issuance of the license. If the commissioner's determination is to deny the license, the commissioner must notify the applicant, in writing, of the denial and provide the specific reason for denial.\nA license to operate a natural organic reduction facility is not assignable or transferable and shall not be valid for any entity other than the one named. Each license issued to operate a natural organic reduction facility is valid only for the location identified on the license. A 50 percent or more change in ownership or location of the natural organic reduction facility automatically terminates the license. Separate licenses shall be required of two or more persons or other legal entities operating from the same location.\nEach license to operate a natural organic reduction facility must be conspicuously displayed in the natural organic reduction facility at all times. \"Conspicuous display\" means in a location where a member of the general public within the natural organic reduction facility is able to observe and read the license.\nAll licenses to operate a natural organic reduction facility issued by the commissioner are valid for a period of one calendar year beginning on July 1 and ending on June 30, regardless of the date of issuance.\nAny change of license information must be reported to the commissioner, on forms provided by the commissioner, no later than 30 calendar days after the change occurs. Failure to report changes is grounds for disciplinary action.\nSection 13.41 applies to data collected and maintained by the commissioner pursuant to this section.",
	"repealed": false
}