{
	"id": "477B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/477B.01",
	"title": "477B.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the following words and terms, for the purposes of this chapter and chapters 423A and 424A, have the meanings given to them. The following definitions shall also apply for the purpose of chapter 424A, unless the word or term is defined in chapter 424A, in which case such word or term shall be as defined in chapter 424A for the purpose of chapter 424A.\n\"Apportionment agreement\" means an agreement between two or more fire departments that provide contracted fire protection service to the same municipality and establishes the percentage of the population and the percentage of the estimated market value within the municipality serviced by each fire department.\n\"Commissioner\" means the commissioner of revenue.\n\"Company\" or \"insurance company\" has the meaning given in section 60A.02, subdivision 4.\n\"Estimated market value\" has the meaning given in section 272.03, subdivision 14.\n(a) \"Fire department\" means:\n(1) a municipal fire department;\n(2) an independent nonprofit firefighting corporation;\n(3) a fire department established as or operated by a joint powers entity; or\n(4) a fire protection special taxing district established under chapter 144F or special law.\n(b) This subdivision only applies to this chapter.\n\"Fire department service area\" means the area serviced by a qualifying fire department that meets the requirements of section 477B.02.\n\"Independent nonprofit firefighting corporation\" means an independent nonprofit firefighting corporation that meets the criteria in section 424A.094, subdivision 1, paragraph (a).\n\"Joint powers entity\" means a joint powers entity created under section 471.59.\n\"Minnesota Fire Premium Report\" means a form for reporting by insurance companies of (1) gross direct fire, lightning, sprinkler leakage, and extended coverage premiums received upon risks located or to be performed in this state less return premiums and dividends, and (2) other facts that the commissioner may require.\n\"Municipal clerk\" means the person elected or appointed to the position of municipal clerk or, if there is no such person, the chief financial official, the chief administrative official, or the person primarily responsible for managing the finances of a municipality.\n(a) \"Municipality\" means:\n(1) a home rule charter or statutory city;\n(2) an organized town;\n(3) a joint powers entity;\n(4) a fire protection special taxing district; or\n(5) an American Indian tribal government entity located within a federally recognized American Indian reservation.\n(b) This subdivision only applies to this chapter.\n(a) \"Secretary\" means:\n(1) the secretary of an independent nonprofit firefighting corporation that has a subsidiary incorporated firefighters' relief association or whose firefighters participate in the statewide volunteer firefighter plan; or\n(2) the secretary of a joint powers entity or fire protection special taxing district or, if there is no such person, the person primarily responsible for managing the finances of a joint powers entity or fire protection special taxing district.\n(b) This subdivision only applies to this chapter.\n\"Statewide volunteer firefighter plan\" means the retirement plan established under chapter 353G.",
	"repealed": false
}