{
	"id": "322C.0905",
	"url": "https://www.revisor.mn.gov/statutes/cite/322C.0905",
	"title": "322C.0905 SPECIAL LITIGATION COMMITTEE.",
	"text": "If a limited liability company is named as or made a party in a derivative proceeding, the company may appoint a special litigation committee to investigate the claims asserted in the proceeding and determine whether pursuing the action is in the best interests of the company. If the company appoints a special litigation committee, on motion by the committee made in the name of the company, except for good cause shown, the court shall stay discovery for the time reasonably necessary to permit the committee to make its investigation. This subdivision does not prevent the court from enforcing a person's right to information under section 322C.0410 or, for good cause shown, granting extraordinary relief in the form of a temporary restraining order or preliminary injunction.\nA special litigation committee may be composed of one or more disinterested and independent individuals, who may be members.\nA special litigation committee may be appointed:\n(1) in a member-managed limited liability company:\n(i) by the consent of a majority of the members not named as defendants or plaintiffs in the proceeding; and\n(ii) if all members are named as defendants or plaintiffs in the proceeding, by a majority of the members named as defendants;\n(2) in a manager-managed limited liability company:\n(i) by a majority of the managers not named as defendants or plaintiffs in the proceeding; and\n(ii) if all managers are named as defendants or plaintiffs in the proceeding, by a majority of the managers named as defendants; and\n(3) in a board-managed limited liability company:\n(i) by a majority of governors not named as defendants or plaintiffs in the proceeding; and\n(ii) if all governors are named as defendants or plaintiffs in the proceeding, by a majority of the governors named as defendants.\nAfter appropriate investigation, a special litigation committee may determine that it is in the best interests of the limited liability company that the proceeding:\n(1) continue under the control of the plaintiff;\n(2) continue under the control of the committee;\n(3) be settled on terms approved by the committee; or\n(4) be dismissed.\nAfter making a determination under subdivision 4, a special litigation committee shall file with the court a statement of its determination and its report supporting its determination, giving notice to the plaintiff. The court shall determine whether the members of the committee were disinterested and independent and whether the committee conducted its investigation and made its recommendation in good faith, independently, and with reasonable care, with the committee having the burden of proof. If the court finds that the members of the committee were disinterested and independent and that the committee acted in good faith, independently, and with reasonable care, the court shall enforce the determination of the committee. Otherwise, the court shall dissolve the stay of discovery entered under subdivision 1 and allow the action to proceed under the direction of the plaintiff.",
	"repealed": false
}