{
	"id": "317A.905",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.905",
	"title": "317A.905 CHAMBERS OF COMMERCE, BOARDS OF TRADE, EXCHANGES.",
	"text": "A corporation may be formed under this chapter to:\n(1) acquire and disseminate useful business information;\n(2) promote equitable principles of trade; or\n(3) establish, maintain, and enforce uniformity in the commercial usages, business transactions, and trade relations in the municipality in which it is located.\nA corporation, formed for a purpose in subdivision 1, may, through its articles or bylaws, arbitrate and adjust differences between:\n(1) the corporation and its members;\n(2) the members; or\n(3) a member and a third person who has given written consent.\nThe corporation may take testimony, make awards, and enforce an award by a fine or by a forfeiture of the membership of a person or of the person's other rights or privileges.\nA corporation that is a chamber of commerce, board of trade, or exchange, and that maintains or operates a regular place of business or trading room for members only, in which the members buy, sell, or exchange grain, livestock, or other farm products for themselves or for others, is a public market.\nAs used in subdivisions 5 and 6, the words \"association or corporation\" include a cooperative corporation or association authorized to do business in this state.\nMembership in a public market is open to a person, association, or corporation:\n(1) having a method of business operation or plan of organization that does not conflict with a reasonable rule of the public market; and\n(2) desiring to deal or trade in the commodities usually dealt in on the public market.\nApplication for membership must be made in the manner provided in the articles or bylaws of the public market.\nA public market may make reasonable rules, regulations, and bylaws, including provisions for membership fees and uniform reasonable assessments. A rule, regulation, or bylaw of a public market is unreasonable when it modifies a provision in the articles, constitution, or bylaws of an association or corporation, governing the distribution of profits to the shareholders or members of the association or corporation. Members of a public market shall comply with reasonable rules, regulations, and bylaws established by the market.\nA public market is a monopoly in restraint of trade when it:\n(1) wrongfully or unreasonably refuses to admit or delays the admission of an applicant for membership;\n(2) discriminates, or causes another to discriminate, among members; or\n(3) violates this section.\nWhen a public market is a monopoly in restraint of trade under subdivision 7, trading or dealing in it is prohibited, and the attorney general shall bring an action to terminate the existence of the corporation under section 317A.751, or sue to enjoin further operation of the market or further violations of this chapter.",
	"repealed": false
}