{
	"id": "340A.409",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.409",
	"title": "340A.409 LIABILITY INSURANCE.",
	"text": "(a) No retail license may be issued, maintained or renewed unless the applicant demonstrates proof of financial responsibility with regard to liability imposed by section 340A.801. The issuing authority must submit to the commissioner the applicant's proof of financial responsibility. This subdivision does not prohibit a local unit of government from requiring higher insurance or bond coverages, or a larger deposit of cash or securities. The minimum requirement for proof of financial responsibility may be given by filing:\n(1) a certificate that there is in effect for the license period an insurance policy issued by an insurer required to be licensed under section 60A.07, subdivision 4, or by an insurer recognized as an eligible surplus lines carrier pursuant to section 60A.206 or pool providing at least $50,000 of coverage because of bodily injury to any one person in any one occurrence, $100,000 because of bodily injury to two or more persons in any one occurrence, $10,000 because of injury to or destruction of property of others in any one occurrence, $50,000 for loss of means of support of any one person in any one occurrence, $100,000 for loss of means of support of two or more persons in any one occurrence, $50,000 for other pecuniary loss of any one person in any one occurrence, and $100,000 for other pecuniary loss of two or more persons in any one occurrence;\n(2) a bond of a surety company with minimum coverages as provided in clause (1); or\n(3) a certificate of the commissioner of management and budget that the licensee has deposited with the commissioner of management and budget $100,000 in cash or securities which may legally be purchased by savings banks or for trust funds having a market value of $100,000.\n(b) This subdivision does not prohibit an insurer from providing the coverage required by this subdivision in combination with other insurance coverage.\n(c) An annual aggregate policy limit for dram shop insurance of not less than $310,000 per policy year may be included in the policy provisions.\n(d) A liability insurance policy required by this section must provide that it may not be canceled for:\n(1) any cause, except for nonpayment of premium, by either the insured or the insurer unless the canceling party has first given 60 days' notice in writing to the insured of intent to cancel the policy; and\n(2) nonpayment of premium unless the canceling party has first given ten days' notice in writing to the insured of intent to cancel the policy.\n(e) In the event of a policy cancellation, the insurer will send notice to the issuing authority at the same time that a cancellation request is received from or a notice is sent to the insured.\n(f) All insurance policies which provide coverage with regard to any liability imposed by section 340A.801 must contain at least the minimum coverage required by this section.\nThe market assistance plan of the Minnesota Joint Underwriting Association shall assist licensees in obtaining insurance coverage.\n(a) The Minnesota Joint Underwriting Association shall provide coverage required by subdivision 1 to persons rejected under this subdivision.\n(b) A liquor vendor shall be denied or terminated from coverage through the Minnesota Joint Underwriting Association if the liquor vendor disregards safety standards, laws, rules, or ordinances pertaining to the offer, sale, or other distribution of liquor.\nUpon the request of the insured, an insurer who is providing coverage required by subdivision 1 shall inform the insured of the status of any claims made under the policy. The information must include:\n(1) the employees of the insured that may be involved and the nature of their involvement;\n(2) any amount the insurer is holding in reserve for payment of a claim or has paid in the disposition of the claim; and\n(3) any amount paid in the defense of the claim.\nThis subdivision does not require disclosure of otherwise nondiscoverable information to an adverse party in litigation.\nSubdivision 1 does not apply to licensees who by affidavit establish that:\n(1) they are on-sale 3.2 percent malt liquor licensees with sales of less than $25,000 of 3.2 percent malt liquor for the preceding year;\n(2) they are off-sale 3.2 percent malt liquor licensees with sales of less than $50,000 of 3.2 percent malt liquor for the preceding year;\n(3) they are holders of on-sale wine licenses with sales of less than $25,000 for wine for the preceding year;\n(4) they are holders of temporary wine licenses issued under law; or\n(5) they are wholesalers who donate wine to an organization for a wine tasting conducted under section 340A.418 or 340A.419.",
	"repealed": false
}