{
	"id": "383A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.07",
	"title": "383A.07 PARKS AND RECREATION.",
	"text": "Ramsey County may acquire real and personal property within or without the county by purchase, lease, gift, condemnation, option, contract or otherwise including any estate, interest, easement or right, and subject to any estate, interest, easement or right. The county shall hold, improve, maintain, supervise, control and operate the property so acquired for park, open space or recreational purposes.\nAll areas that Ramsey County has acquired under any other law for public park and open space purposes, public access to waters or recreational purposes are subject to subdivisions 1 to 15.\nThe county may acquire lands for conversion into forest reserves and for the conservation of natural resources of the state, including streams, lakes, submerged lands, and swamp lands, and to these ends may create parks, parkways, forests and other reservations, and develop and improve, protect and promote the use of this land in a manner conducive to the general welfare.\nThe county may provide for the construction, installation, maintenance, and operation of suitable facilities, accommodations and services in the park and open space system for public use for the purposes of subdivisions 1 to 15 or may authorize private persons or corporations to do so. The county may not acquire a right, title or interest in or to real property or develop real property pursuant to subdivisions 1 to 15 without the approval of the governing body of the municipality in which the property is located; provided further that no such property situated in any other county shall be acquired without the approval by resolution of the county board thereof.\nThe county may provide for surveys to determine the needs of the park and open space system and the location and suitability of areas available therefor, for general plans for the park and open space system and for plans for the improvement of any park or the construction or installation of facilities, accommodations or services for public use therein.\nMS 1990 [Repealed, 1991 c 51 s 6]\nRamsey County shall cooperate with a public or municipal corporation, governmental body, or with a private or public organization engaged in conservation, recreational activities, pollution, sanitation, mosquito abatement or a constructive purpose consistent with the county park and open space system.\nThe county may fix, alter, charge and collect fees for the use of the facilities of the park and open space system or for facilities, accommodations or services provided for public use therein.\nA city, town or school district inside or outside Ramsey County or another county may make contributions of funds to Ramsey County for the purposes of subdivisions 1 to 15 with respect to a county park or other unit of the park and open space system. These contributions may be made out of the general funds of the contributing government subdivision or out of funds raised or designated for park and open space purposes or out of funds raised expressly for the purpose of these contributions. The governing body of a government subdivision making such a contribution may specify the particular purpose for which it is to be used, and these contributions shall be paid into the general fund of Ramsey County and used for the purposes herein authorized.\nThe county may accept a gift, grant, or loan of money or other property from the United States, the state, or any other source for any purpose under subdivisions 1 to 15, enter into an agreement required in connection therewith, and may hold, use, and dispose of this money or property for the purposes of subdivisions 1 to 15 in accordance with the terms and conditions of the gift, grant, loan or agreement relating thereto.\nMS 1994 [Repealed, 1996 c 310 s 1]\nThe county may enact the ordinances relating to the county park and open space system and recreational areas. The county may regulate, by ordinance, the use of any park, open space, or recreational area subject to the provisions of subdivisions 1 to 15, including waters and public lakeshore within the system and not more than 300 feet of the waterfront immediately abutting this lakeshore.\nThe county may designate employees as police officers within the park and open space system to exercise police power within the system under the jurisdiction and control of the board. The county may contract with municipalities for the policing of park and open space properties.\nThe county may create a county park and open space commission with such provisions for membership, terms of office and other requirements that the board may prescribe, and may delegate to this commission authority to exercise any of the powers conferred on the county by this section, except the power to acquire or dispose of real property, to levy taxes, and to appropriate and borrow money. The commission may make recommendations to the county board concerning matters relating to the county park and open space system.\nMS 1990 [Repealed, 1991 c 51 s 6]\nRamsey County may acquire by gift, purchase, or condemnation, and may improve and maintain public parks, bathing beaches and other recreational areas.\nThe county may by ordinance provide for the use, government and protection of these public parks, bathing beaches and other recreational areas.\nRamsey County may appropriate and expend moneys for the improvement of navigable lakes lying wholly or partly inside the county.\nRamsey County may acquire land inside the county by gift, lease, purchase or condemnation, in the vicinity of a lake of this kind, for a public recreational purpose, and may acquire, improve, equip and maintain these recreational grounds.\nNotwithstanding the provisions of section 375.19, Ramsey County may make annual expenditures from its general revenue fund for soil and water conservation purposes in an amount to be determined by the county board.\nWhite Bear Lake, in the counties of Ramsey and Washington and Goose Lake, in the county of Ramsey, adjacent to White Bear Lake, are declared to be public waters of the state of Minnesota, and shall forever remain free and open for the common and public use of all citizens of this state.\nThe waters of these lakes shall never be lowered or diminished by any artificial means, nor shall they or any of them ever be connected with, used, or applied to a use or purpose, public or private, by a person, persons, or corporation public or private.\nMS 1990 [Repealed, 1991 c 51 s 6]\nMS 1994 [Repealed, 1996 c 310 s 1]\nMS 1994 [Repealed, 1996 c 310 s 1]\nIn addition to and not in substitution for any other powers granted to Ramsey County by the above paragraph, Ramsey County may issue in one or more series general obligation bonds of the county in a total aggregate amount not to exceed $750,000 for the acquisition, construction and equipping of the recreation facilities authorized to be acquired, constructed and equipped under subdivisions 21 to 28. This additional sum shall be spent to buy the golf course, and a balance remaining thereafter of the additional sum may be used to construct and equip the artificial ice arenas. The county shall pledge its full faith and credit and taxing powers for the payment of the bonds and shall provide for the issuance and sale and for the security of the bonds in the manner provided in chapter 475, except that no election shall be required and the bonds shall not be included in computing the net debt of the county under any law or amount.\nIn addition to and not in substitution for any other powers granted to the county of Ramsey by laws heretofore enacted, the county of Ramsey may issue in one or more series general obligation bonds of the county in a total aggregate amount not to exceed $715,000, for the acquisition, construction and equipping of any and all of the recreation facilities authorized to be acquired, constructed and equipped under subdivisions 21 to 28. This additional sum shall be used to construct and equip the artificial ice arenas. The board shall pledge its full faith and credit and taxing powers for the payment of such bonds and shall provide for the issuance and sale and for the security of such bonds in the manner provided in chapter 475, except that no election shall be required and such bonds shall not be included in computing the net debt of the county under any law; and taxes required to be levied for the payment of such bonds shall not be subject to any limitation of rate or amount.\nMS 1994 [Repealed, 1996 c 310 s 1]\nRamsey County shall prescribe rules and regulations relating to the use, operation, maintenance and control of the arena facilities and golf course. It shall prescribe fees for the use of the facilities and charges for services performed in connection therewith which shall be reasonable and proper. It shall extend the use of the facilities free of charge to teams and groups that it authorizes and sanctions. Ramsey County shall maintain and operate the arenas and golf course in the manner that will best provide for the equitable and fair use of the facilities by the public, schools and other agencies of the county.\nRamsey County may employ the employees that in its opinion are necessary and proper to the efficient and effective functioning of the arenas and golf course and activities. These employees are subject to the laws relating to the civil service of the county and their compensation is in accordance with the rules provided for the civil service of the county.\nAny income accruing to the county from the operation of the ice arenas and golf course shall be placed in the county treasury and credited to a special fund known as the public ice arena-golf course account.\nRamsey County may acquire in the name of the county by purchase, lease or condemnation a site for the purpose of erecting thereon a recreational building.\nThe county may allocate to this purpose any real estate which it presently controls and which is not needed or necessary for other county purposes.\nRamsey County may construct, equip, operate and maintain a building suitable for use as a sports and recreational arena providing for the facilities necessary in its opinion to accommodate the public and educational interest in sports and recreation.\nThe county shall prescribe rules and regulations relating to the use, operation, maintenance and control of the arena facility erected by the county pursuant to this subdivision. It shall prescribe fees for the use of the facilities and charges for services performed in connection therewith which shall be reasonable and proper. The county shall maintain and operate the arena facility in the manner that will best provide for the equitable and fair use of the facilities by the public, school districts and other agencies of the county.\nIncome accruing to the county from the operation of the arena facility shall be placed in the county treasury, and credited to a special fund known as the recreation arena account.\nThe recreation arena erected, operated and maintained under the provisions of this subdivision shall be known as the Aldrich recreation arena; and a suitable plaque shall be placed at a conspicuous place within the building commemorating the services and devotion to public duty displayed by Mr. Eugene E. Aldrich while serving as director of athletics for the Saint Paul public high schools for the people of Ramsey County.",
	"repealed": false
}