{
	"id": "118A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/118A.07",
	"title": "118A.07 ADDITIONAL INVESTMENT AUTHORITY.",
	"text": "As used in this section, \"governmental entity\" means a city with a population in excess of 200,000, a county that contains a city of that size, or the Metropolitan Council. If a governmental entity meets the requirements of subdivisions 2 and 3, it may exercise additional investment authority under subdivisions 4, 5, and 6.\nPrior to exercising any additional authority under subdivisions 4, 5, and 6, the governmental entity must have written investment policies and procedures governing the following:\n(1) the use of or limitation on mutual bond funds or other securities authorized or permitted investments under law;\n(2) specifications for and limitations on the use of derivatives;\n(3) the final maturity of any individual security;\n(4) the maximum average weighted life of the portfolio;\n(5) the use of and limitations on reverse repurchase agreements;\n(6) credit standards for financial institutions with which the governmental entity deals; and\n(7) credit standards for investments made by the governmental entity.\nPrior to exercising any authority under subdivisions 4, 5, and 6, the governmental entity must establish an oversight process that provides for review of the governmental entity's investment strategy and the composition of the financial portfolio. This process shall include one or more of the following:\n(1) audit reviews;\n(2) internal or external investment committee reviews; and\n(3) internal management control.\nAdditionally, the governing body of the governmental entity must, by resolution, authorize its treasurer to utilize the additional authorities under this section within their prescribed limits, and in conformance with the written limitations, policies, and procedures of the governmental entity.\nIf the governing body of a governmental entity exercises the authority provided in this section, the treasurer of the governmental entity must annually report to the governing body on the findings of the oversight process required under this subdivision. If the governing body intends to continue to exercise the authority provided in this section for the following calendar year, it must adopt a resolution affirming that intention by December 1.\nA governmental entity may enter into repurchase agreements as authorized under section 118A.05, provided that the exclusion of mortgage-backed securities defined as \"high-risk mortgage-backed securities\" under section 118A.04, subdivision 6, shall not apply to repurchase agreements under this authority if the margin requirement is 101 percent or more.\nNotwithstanding the limitations contained in section 118A.05, subdivision 2, the governmental entity may enter into reverse repurchase agreements to:\n(1) meet cash flow needs; or\n(2) generate cash for investments, provided that the total securities owned shall be limited to an amount not to exceed 130 percent of the annual daily average of general investable monies for the fiscal year as disclosed in the most recently available audited financial report. Excluded from this limit are:\n(i) securities with maturities of one year or less; and\n(ii) securities that have been reversed to maturity.\nThere shall be no limit on the term of a reverse repurchase agreement. Reverse repurchase agreements shall not be included in computing the net debt of the governmental entity, and may be made without an election or public sale, and the interest payable thereon shall not be subject to the limitation in section 475.55. The interest shall not be deducted or excluded from gross income of the recipient for the purpose of state income, corporate franchise, or bank excise taxes, or if so provided by federal law, for the purpose of federal income tax.\nA governmental entity may enter into futures contracts, options on futures contracts, and option agreements to buy or sell securities authorized under law as legal investments for governmental entities, but only with respect to securities owned by the governmental entity, including securities that are the subject of reverse repurchase agreements under this section that expire at or before the due date of the option agreement.\nA Minnesota joint powers investment trust may invest funds in negotiable certificates of deposit or other evidences of deposit, with a remaining maturity of three years or less, issued by a nationally or state-chartered bank, a federal or state savings and loan association, or a state-licensed branch of a foreign bank, except that for obligations with a maturity of one year or less, the debt obligations of the issuing institution or its parent are rated in the top short-term rating category by at least two nationally recognized statistical ratings organizations and for obligations with a maturity in excess of one year, the senior debt obligations of the issuing institution or its parent are rated at least A or its equivalent by at least two nationally recognized statistical ratings organizations. Investments in these instruments shall not be subject to the collateralization requirements of section 118A.03.",
	"repealed": false
}