{
	"id": "116A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.19",
	"title": "116A.19 APPEALS.",
	"text": "Any party aggrieved may appeal to the district court from an order of the board or court made in any proceeding.\n(a) To render the appeal effectual, the appellant shall file with the auditor or court administrator within 30 days after the filing of such final order a notice of appeal which shall state the particular damages appealed from and the ground upon which the appeal is taken. The notice of appeal shall be accompanied by an appeal bond to the county where the property is located of not less than $250 with sufficient surety to be approved by the auditor or court administrator, conditioned that the appellant will duly prosecute the appeal and pay all costs and disbursements which may be adjudged against the appellant and abide the order of the court. Within 30 days after such filing, the auditor, in case of a county water or sewer improvement proceeding, shall return and file with the court administrator of the district court the original notice and appeal bond.\n(b) The issues raised by the appeal shall stand for trial by jury and shall be tried and determined at the next term of the district court held within the county in which the proceedings were commenced, or in such other county in which the appeal shall be heard, beginning after the filing of the appeal; and shall take precedence of all other matters of a civil nature in court. If there be more than one appeal triable in one county, the court may, on its own motion or upon the motion of a party in interest, consolidate two or more appeals and try them together, but the rights of the appellants shall be separately determined. If the appellant fails to prevail, the cost of the trial shall be paid by the appellant. In case of appeal as to damages to property situated in the county other than the county where the sewer or water proceedings are pending, and if the appellant so requests, the trial shall be held at the next term of the district court of the county wherein the lands are situated. In such case, the court administrator of the district court where the appeal is filed, shall make, certify and file in the office of the court administrator of the district court of the county where the trial is to be had, a transcript of the papers and documents on file in the court administrator's office in the proceedings so far as they pertain to the matters on account of which the appeal is taken. After the final determination of such appeal, the court administrator of the district court where the action is tried, shall certify and return the verdict to the district court of the county where the proceedings were instituted.\n(c) The court administrator of the district court shall file a certified copy of the final determination of any such appeal with the auditor of the county affected.\nIn all cases of appeal from an order determining damages to property from the construction of any system, improvement, or extension, the amount awarded by the jury as finally determined shall stand for and in the place of the amount from which the appeal was taken. In all cases of appeal from an order confirming special assessments, the court shall either affirm the assessment or set it aside and order a reassessment as provided in section 116A.18, subdivision 2. The court may order reassessment of one or more or all of the properties appearing on any special assessment roll. Upon reassessment of any property, the board or court shall have jurisdiction to reassess such other properties as it may deem necessary to spread the cost equitably, provided that notice is given to the owners of all properties reassessed. In any case of appeal from a special assessment, no reassessment shall be ordered unless the original assessment is determined to be arbitrary, unreasonable, or based on a mistake of law.\nAny party aggrieved thereby may appeal to the district court of the county where the proceedings are pending from any order made by the county board dismissing the petition for any water or sewer system or establishing or refusing to establish any water or sewer system or the assessment of benefits. The appellant shall serve notice of appeal and give bond as provided in subdivision 1. Upon appeal being perfected, it may be brought on for trial by either party upon ten days' notice to the other, and shall then be tried by the court without a jury. The court shall examine the whole matter and receive evidence to determine whether the findings made by the county board can be sustained. At the trial the findings made by the county board shall be prima facie evidence of the matters therein stated and the order of the county board shall be deemed prima facie reasonable. If the court shall find that the order appealed from is lawful and reasonable, it shall be affirmed. If the court finds that the order appealed from is arbitrary, unlawful, or not supported by the evidence, it shall make such order to take the place of the order appealed from as is justified by the record before it or remand such matter to the county board for further proceeding before the board. After determination of the appeal, the county board shall proceed in conformity therewith.\nAny party aggrieved by a final order or judgment rendered on appeal to the district court, or by the order made in any judicial improvement proceeding dismissing the petition or establishing or refusing to establish any judicial improvement or assessing benefits, may appeal as in other civil cases.\nWhenever any appeal from an order of the board or court is taken under section 116A.19, any involved county or, if two or more counties are involved and a commission is formed under section 116A.24, the commission, may move the court having jurisdiction over the appeal for an order requiring the appellant, or appellants, to file a surety bond as hereinafter set forth. Three days' written notice of the motion shall be given. If the court determines that loss or damage to the public or taxpayers may result from the pendency of the appeal, the court may require the appellant, or appellants, to file a surety bond, which shall be approved by the court, in such amount as the court may determine. The bond shall be conditioned for payment to the county, or commission, of any loss or damage which may be caused to the county, the commission or the taxpayers by the pendency of the appeal, to the extent of the penal sum of such bond, if the appellant, or appellants, shall not prevail therein. If the surety bond is not filed within a reasonable time allowed therefor by the court, the appeal shall be dismissed with prejudice. If such appellant, or appellants, file a bond as herein required and prevail in the appeal, any premium paid on the bond shall be repaid by or taxed against the county or commission.",
	"repealed": false
}