{
	"id": "115C.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/115C.11",
	"title": "115C.11 CONSULTANTS AND CONTRACTORS; SANCTIONS.",
	"text": "(a) All consultants and contractors who perform corrective action services must register with the board. In order to register, consultants must meet and demonstrate compliance with the following criteria:\n(1) provide a signed statement to the board verifying agreement to abide by this chapter and the rules adopted under it and to include a signed statement with each claim that all costs claimed by the consultant are a true and accurate account of services performed;\n(2) provide a signed statement that the consultant shall make available for inspection any records requested by the board for field or financial audits under the scope of this chapter;\n(3) certify knowledge of the requirements of this chapter and the rules adopted under it;\n(4) obtain and maintain professional liability coverage, including pollution impairment liability; and\n(5) agree to submit to the board a certificate or certificates verifying the existence of the required insurance coverage.\n(b) The board must maintain a list of all registered consultants and a list of all registered contractors.\n(c) All corrective action services must be performed by registered consultants and contractors.\n(d) Reimbursement for corrective action services performed by an unregistered consultant or contractor is subject to reduction under section 115C.09, subdivision 3, paragraph (i).\n(e) Corrective action services performed by a consultant or contractor prior to being removed from the registration list may be reimbursed without reduction by the board.\n(f) If the information in an application for registration becomes inaccurate or incomplete in any material respect, the registered consultant or contractor must promptly file a corrected application with the board.\n(g) Registration is effective 30 days after a complete application is received by the board. The board may reimburse without reduction the cost of work performed by an unregistered contractor if the contractor performed the work within 60 days of the effective date of registration.\n(h) Registration for consultants under this section remains in force until the expiration date of the professional liability coverage, including pollution impairment liability, required under paragraph (a), clause (4), or until voluntarily terminated by the registrant, or until suspended or revoked by the commissioner of commerce. Registration for contractors under this section expires every two years on the anniversary of the effective date of the contractor's most recent registration and must be renewed on or before expiration. Prior to expiration, a registration remains in force until voluntarily terminated by the registrant, or until suspended or revoked by the commissioner of commerce. All registrants must comply with registration criteria under this section.\n(i) The board may deny a consultant or contractor registration or request for renewal under this section if the consultant or contractor:\n(1) does not intend to or is not in good faith carrying on the business of an environmental consultant or contractor;\n(2) has filed an application for registration that is incomplete in any material respect or contains any statement which, in light of the circumstances under which it is made, contains any misrepresentation, or is false, misleading, or fraudulent;\n(3) has engaged in any fraudulent, coercive, deceptive, or dishonest act or practice whether or not the act or practice involves the business of environmental consulting or contracting;\n(4) has forged another's name to any document whether or not the document relates to a document approved by the board;\n(5) has been convicted, whether by pleading guilty, with or without admitting guilt, or pleading nolo contendere, of any of the following offenses: any felony; any gross misdemeanor; or a misdemeanor involving: (i) assault; (ii) harassment; (iii) moral turpitude; or (iv) conduct similar to items (i) to (iii);\n(6) has been subject to disciplinary action in another state or jurisdiction; or\n(7) has not paid subcontractors hired by the consultant or contractor after they have been paid in full by the applicant.\n[Repealed, 1996 c 308 s 13]\n[Repealed, 1996 c 308 s 13]\n[Repealed, 1996 c 308 s 13]",
	"repealed": false
}