{
	"id": "84.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.81",
	"title": "84.81 DEFINITIONS.",
	"text": "For the purposes of Laws 1967, chapter 876, the terms defined herein shall have the meanings ascribed to them.\n\"Person\" includes an individual, partnership, corporation, the state and its agencies and subdivisions, and any body of persons, whether incorporated or not.\n\"Snowmobile\" means a self-propelled vehicle originally manufactured and designed for travel on snow or ice steered by skis or runners. Snowmobile does not include the following vehicles equipped with aftermarket ski and track configurations:\n(1) an all-terrain vehicle defined in section 84.92;\n(2) an off-highway motorcycle defined in section 84.787;\n(3) an off-road vehicle defined in section 84.797;\n(4) a mini truck defined in section 169.011;\n(5) a utility task vehicle described in section 169.045; or\n(6) any other vehicle being operated off road.\n\"Owner\" means a person, other than a lienholder, having the property in or title to a snowmobile entitled to the use or possession thereof.\n\"Operate\" means to ride in or on and control the operation of a snowmobile.\n\"Operator\" means every person who operates or is in actual physical control of a snowmobile.\n\"Register\" means the act of assigning a registration number to a snowmobile.\n\"Commissioner\" means the commissioner of natural resources acting directly or through the commissioner's authorized agent.\n\"Roadway\" means that portion of a highway improved, designed, or ordinarily used for vehicular travel.\n\"Dealer\" means a person, partnership, or corporation engaged in the business of selling snowmobiles at wholesale or retail.\n\"Manufacturer\" means a person, partnership, or corporation engaged in the business of manufacturing snowmobiles.\n\"Collector snowmobile\" means a snowmobile that is 25 years old or older, was originally produced as a separate identifiable make by a manufacturer, and is owned and operated solely as a collector's item.\n\"Metal traction device\" means any metal device or array of metal devices attached to a snowmobile track to enhance traction that is:\n(1) made of metal, except that metal cleats affixed perpendicular to the direction of travel of a snowmobile track which was manufactured in 1981 or earlier shall not be considered a metal traction device; or\n(2) affixed to a snowmobile track with metal components that extend more than one-fourth inch from the bottom of the track.",
	"repealed": false
}