{
	"id": "518A.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.63",
	"title": "518A.63 TRUSTEE.",
	"text": "(a) Upon its own motion or upon motion of either party, the court may appoint a trustee, when it is deemed expedient, to receive any money ordered to be paid as maintenance or support money for remittance to the person entitled to receive the payments. The trustee may also receive property which is part of an award under section 518.58, upon trust to invest the same, and pay over the income in the manner the court directs, or to pay over the principal sum in the proportions and at the times the court orders. The court shall have regard in all cases to the situation and circumstances of the recipient, and the children, if there are any. The trustee shall give a bond, as the court requires, for the faithful performance of the trust. If it appears that the recipient of money ordered to be paid as support will receive public assistance, the court shall appoint as trustee the public authority responsible for support enforcement.\n(b) The trustee shall maintain records listing the amount of payments, the date when payments are required to be made, and the names and addresses of the parties affected by the order.\n(c) The parties affected by the order shall inform the trustee of a change of address or of other conditions that may affect the administration of the order.\n(d) If a required payment of support or of maintenance and support combined is not made within ten days after the due date, the trustee shall send by first class mail notice of the arrearage to the obligor. If payment of the sum due is not received by the trustee within ten days after sending notice, the trustee shall certify the amount due to the public authority responsible for support enforcement, whenever that authority is not the trustee. If the public authority responsible for support enforcement refers the arrearage to the county attorney, the county attorney may initiate enforcement proceedings against the obligor for support or for maintenance and support combined.\n(e) The public authority responsible for support enforcement may represent a person entitled to receive support or maintenance or both in court proceedings initiated under this section to enforce compliance with a support order or combined maintenance and support orders.\n(f) If the person obligated to pay support or maintenance is beyond the jurisdiction of the court, the county attorney may institute any proceeding available under state or federal law for the enforcement of duties of support or maintenance.",
	"repealed": false
}