{
	"id": "609.3451",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.3451",
	"title": "609.3451 CRIMINAL SEXUAL CONDUCT IN THE FIFTH DEGREE.",
	"text": "A person is guilty of criminal sexual conduct in the fifth degree if the person engages in nonconsensual sexual penetration.\nA person is guilty of criminal sexual conduct in the fifth degree if:\n(1) the person engages in nonconsensual sexual contact; or\n(2) the person engages in masturbation or lewd exhibition of the genitals in the presence of a minor under the age of 16, knowing or having reason to know the minor is present.\nFor purposes of this section, \"sexual contact\" has the meaning given in section 609.341, subdivision 11, paragraph (a), clauses (i), (iv), and (v). Sexual contact also includes the intentional removal or attempted removal of clothing covering the complainant's intimate parts or undergarments, and the nonconsensual touching by the complainant of the actor's intimate parts, effected by the actor, if the action is performed with sexual or aggressive intent.\nA person convicted under subdivision 1a may be sentenced to imprisonment for not more than 364 days or to a payment of a fine of not more than $3,000, or both.\n(a) A person is guilty of a felony and may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $10,000, or both, if the person violates subdivision 1.\n(b) A person is guilty of a felony and may be sentenced to imprisonment for not more than seven years or to payment of a fine of not more than $14,000, or both, if the person violates subdivision 1 or 1a within ten years of:\n(1) a conviction under subdivision 1;\n(2) a previous conviction for violating subdivision 1a, clause (2), a crime described in paragraph (c), or a statute from another state in conformity with any of these offenses; or\n(3) the first of two or more previous convictions for violating subdivision 1a, clause (1), or a statute from another state in conformity with this offense.\n(c) A previous conviction for violating section 609.342; 609.343; 609.344; 609.345; 609.3453; 617.23, subdivision 2, clause (2), or subdivision 3; or 617.247 may be used to enhance a criminal penalty as provided in paragraph (b).",
	"repealed": false
}