{
	"id": "16B.335",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.335",
	"title": "16B.335 REVIEW OF PLANS AND PROJECTS.",
	"text": "(a) The commissioner, or any other recipient to whom an appropriation is made to acquire or better public lands or buildings or other public improvements of a capital nature, must not prepare final plans and specifications for any construction, major remodeling, or land acquisition in anticipation of which the appropriation was made until the agency that will use the project has presented the program plan and cost estimates for all elements necessary to complete the project to the chair of the senate Finance Committee and the chair of the house of representatives Ways and Means Committee and the chairs have made their recommendations, and the chair and ranking minority member of the senate Capital Investment Committee and the chair and ranking minority member of the house of representatives Capital Investment Committee are notified. \"Construction or major remodeling\" means construction of a new building, a substantial addition to an existing building, or a substantial change to the interior configuration of an existing building. The presentation must note any significant changes in the work that will be done, or in its cost, since the appropriation for the project was enacted or from the predesign submittal. The program plans and estimates must be presented for review at least two weeks before a recommendation is needed. The recommendations are advisory only. Failure or refusal to make a recommendation is considered a negative recommendation. The chairs and ranking minority members of the senate Finance and Capital Investment Committees and the house of representatives Capital Investment and Ways and Means Committees must also be notified whenever there is a substantial change in a construction or major remodeling project, or in its cost.\n(b) Capital projects exempt from the requirements of this subdivision include demolition or decommissioning of state assets, hazardous material projects, utility infrastructure projects, environmental testing, parking lots, parking structures, park and ride facilities, bus rapid transit stations, light rail lines, passenger rail projects, freight rail projects, exterior lighting, fencing, highway rest areas, truck stations, storage facilities not consisting primarily of offices or heated work areas, roads, bridges, trails, pathways, campgrounds, athletic fields, dams, floodwater retention systems, water access sites, harbors, sewer separation projects, water and wastewater facilities, port development projects for which the commissioner of transportation has entered into an assistance agreement under section 457A.04, ice centers, a local government project with a construction cost of less than $1,500,000, or any other capital project with a construction cost of less than $750,000.\nAll other capital projects for which a specific appropriation is made must not proceed until the recipient undertaking the project has notified the chairs and ranking minority members of the senate Capital Investment and Finance Committees and the house of representatives Capital Investment and Ways and Means Committees that the work is ready to begin. Notice is not required for:\n(1) capital projects needed to comply with the Americans with Disabilities Act;\n(2) asset preservation projects to which section 16B.307 applies;\n(3) projects funded by an agency's operating budget; or\n(4) projects funded by a capital asset preservation and replacement account under section 16A.632, a higher education asset preservation and replacement account under section 135A.046, or a natural resources asset preservation and replacement account under section 84.946.\nThe definitions in paragraphs (a) and (b) apply to this section.\n(a) \"Predesign\" means the stage in the development of a project during which the purpose, scope, cost, and schedule of the complete project are defined and instructions to design professionals are produced.\n(b) \"Design\" means the stage in the development of a project during which schematic, design development, and contract documents are produced.\n(c) A recipient to whom an appropriation is made for a project subject to review under subdivision 1 or notice under subdivision 2 shall prepare a predesign package and submit it to the commissioner for review and recommendation before proceeding with design activities. The commissioner must complete the review and recommendation within ten working days after receiving it. Failure to review and recommend within the ten days is considered a positive recommendation. The predesign package must be sufficient to define the purpose, scope, cost, and schedule of the project and must demonstrate that the project has been analyzed according to appropriate space needs standards. All predesign, design, and construction projects shall include consideration of the state of Minnesota's correctional industries program, MINNCOR Industries, consistent with section 16C.151, subdivision 2, paragraph (c), in predesign planning and product specifications.\n(d) This subdivision does not apply to capital projects for park buildings owned by a local government unit in the metropolitan area defined in section 473.121, subdivision 2.\nA recipient to whom a direct appropriation is made for a capital improvement project shall ensure that the project complies with the applicable energy conservation standards contained in law, including sections 216C.19 to 216C.20, and rules adopted thereunder. The recipient may obtain information and technical assistance from the State Energy Office in the Department of Commerce on energy conservation and alternative energy development relating to the planning and construction of the capital improvement project.\nAgency requests for construction and remodeling funds shall include money for cost-effective information technology investments that would enable an agency to reduce its need for office space, provide more of its services electronically, and decentralize its operations. The Department of Information Technology Services must review and approve the information technology portion of construction and major remodeling program plans before the plans are submitted to the chairs of the senate Finance Committee and the house of representatives Ways and Means Committee for their recommendations and the chair and ranking minority member of the senate Capital Investment Committee and the chair and ranking minority member of the house of representatives Capital Investment Committee are notified as required by subdivision 1.\nNo state agency or department shall propose and the legislature shall not consider building or relocation projects without reviewing implications of utilizing information technology on space utilization.",
	"repealed": false
}