{
	"id": "446A.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.12",
	"title": "446A.12 ISSUANCE OF BONDS.",
	"text": "The authority may issue negotiable bonds in a principal amount that the authority determines necessary to provide sufficient funds for achieving its purposes, including the making of loans and purchase of securities, the payment of interest on bonds of the authority, the establishment of reserves to secure its bonds, the payment of fees to a third party providing credit enhancement, and the payment of all other expenditures of the authority incident to and necessary or convenient to carry out its corporate purposes and powers, but not including the making of grants. Bonds of the authority may be issued as bonds or notes or in any other form authorized by law. The principal amount of bonds issued and outstanding under this section at any time may not exceed $2,000,000,000, excluding bonds for which refunding bonds or crossover refunding bonds have been issued, and excluding any bonds issued for the credit enhanced bond program or refunding or crossover refunding bonds issued under the program. The principal amount of bonds issued and outstanding under section 446A.087, may not exceed $500,000,000, excluding bonds for which refunding bonds or crossover refunding bonds have been issued.\nThe authority may issue bonds to refund outstanding bonds of the authority, to pay any redemption premiums on those bonds, and to pay interest accrued or to accrue to the redemption date next succeeding the date of delivery of the refunding bonds. The authority may apply the proceeds of any refunding bonds to the purchase or payment at maturity of the bonds to be refunded, or to the redemption of outstanding bonds on the redemption date next succeeding the date of delivery of the refunding bonds and may, pending the application, place the proceeds in escrow to be applied to the purchase, retirement, or redemption. Pending use, escrowed proceeds may be invested and reinvested in obligations issued or guaranteed by the state or the United States or by any agency or instrumentality of the state or the United States, or in certificates of deposit or time deposits secured in a manner determined by the authority, maturing at a time appropriate to assure the prompt payment of the principal and interest and redemption premiums, if any, on the bonds to be refunded. The income realized on any investment may also be applied to the payment of the bonds to be refunded. After the terms of the escrow have been fully satisfied, any balance of the proceeds and any investment income may be returned to the authority for use by it in any lawful manner. All refunding bonds issued under this subdivision must be issued and secured in the manner provided by resolution of the authority.\nBonds issued under this section must be negotiable investment securities within the meaning and for all purposes of the Uniform Commercial Code, subject only to the provisions of the bonds for registration. The bonds issued may be either general obligations of the authority, secured by its full faith and credit and payable out of any money, assets, or revenues of the authority, subject to the provisions of resolutions or indenture pledging and appropriating particular money, assets, or revenues to particular bonds, or limited obligations of the authority not secured by its full faith and credit and payable solely from specified sources or assets.\nThe bonds of the authority must be authorized by a resolution or resolutions adopted by the authority. The bonds must bear the date or dates, mature at the time or times, bear interest at a fixed or variable rate, including a rate varying periodically at the time or times and on the terms determined by the authority, or any combination of fixed and variable rates, be in the denominations, be in the form, carry the registration privileges, be executed in the manner, be payable in lawful money of the United States, at the place or places within or without the state, and be subject to the terms of redemption or purchase before maturity as the resolutions or certificates provide. If, for any reason existing at the date of issue of the bonds or existing at the date of making or purchasing any loan or securities from the proceeds or after that date, the interest on the bonds is or becomes subject to federal income taxation, this fact does not affect the validity or the provisions made for the security of the bonds. The authority may make covenants and take or have taken actions that are in its judgment necessary or desirable to comply with conditions established by federal law or regulations for the exemption of interest on its obligations. The authority may refrain from compliance with those conditions if in its judgment this would serve the purposes and policies set forth in this chapter with respect to any particular issue of bonds, unless this would violate covenants made by the authority. The maximum maturity of a bond, whether or not issued for the purpose of refunding, must be 30 years from its date. The bonds of the authority may be sold at public or private sale, at a price or prices determined by the authority; provided that (i) the aggregate price at which an issue of bonds is initially offered by underwriters to investors, as stated in the authority's official statement with respect to the offering, must not exceed by more than three percent the aggregate price paid by the underwriters to the authority at the time of delivery; (ii) the commission paid by the authority to an underwriter for placing an issue of bonds with investors must not exceed three percent of the aggregate price at which the issue is offered to investors as stated in the authority's offering statement; and (iii) the spread or commission must be an amount determined by the authority to be reasonable in the light of the risk assumed and the expenses of issuance, if any, required to be paid by the underwriters.\nThe notes and bonds of the authority are not subject to sections 16C.03, subdivision 4, and 16C.05.",
	"repealed": false
}