{
	"id": "161.088",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.088",
	"title": "161.088 CORRIDORS OF COMMERCE PROGRAM.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Beyond the project limits\" means any point that is located:\n(1) outside of the project limits;\n(2) along the same trunk highway; and\n(3) within the same region of the state.\n(c) \"City\" means a statutory or home rule charter city.\n(d) \"Department\" means the Department of Transportation.\n(e) \"Greater metropolitan county\" means any of the counties of Anoka, Carver, Chisago, Dakota, Hennepin, Isanti, Ramsey, Scott, Sherburne, Washington, and Wright.\n(f) \"Program\" means the corridors of commerce program established in this section.\n(g) \"Project limits\" means the estimated construction limits of a project for trunk highway construction, reconstruction, or maintenance, that is a candidate for selection under the corridors of commerce program.\n(h) \"Screening entity\" means an area transportation partnership; the Metropolitan Council in consultation with the Transportation Advisory Board under section 473.146, subdivision 4; or a greater metropolitan county.\n(a) As provided in this section, the commissioner must establish a corridors of commerce program for trunk highway construction, reconstruction, and improvement, including maintenance operations, that improves commerce in the state.\n(b) The commissioner may expend funds under the program from appropriations to the commissioner that are:\n(1) made specifically by law for use under this section;\n(2) at the discretion of the commissioner, made for the budget activities in the state roads program of operations and maintenance, program planning and delivery, or state road construction; and\n(3) made for the corridor investment management strategy program, unless specified otherwise.\n(c) The commissioner must include in the program the cost participation policy for local units of government.\n(d) The commissioner may use up to 17 percent of any appropriation under this section for program delivery and for project scoring, ranking, and selection under subdivision 5.\nThe commissioner shall determine whether each candidate project can be classified into at least one of the following classifications:\n(1) capacity development, for a project on a segment of a trunk highway where the segment:\n(i) is not a divided highway, and that highway is an expressway or freeway beyond the project limits;\n(ii) contains a highway terminus that lacks an intersection or interchange with another trunk highway;\n(iii) contains fewer lanes of travel compared to that highway beyond the project limits; or\n(iv) contains a location that is proposed as a new interchange or to be reconstructed from an intersection to an interchange; or\n(2) freight improvement, for an asset preservation or replacement project that can result in:\n(i) removing or reducing barriers to commerce;\n(ii) easing or preserving freight movement;\n(iii) supporting emerging industries; or\n(iv) providing connections between the trunk highway system and other transportation modes for the movement of freight.\n(a) The eligibility requirements for projects that can be funded under the program are:\n(1) consistency with the statewide multimodal transportation plan under section 174.03;\n(2) location of the project on the national highway system, as provided under Code of Federal Regulations, title 23, part 470, and successor requirements, for a project located outside of the Department of Transportation metropolitan district;\n(3) placement into at least one project classification under subdivision 3;\n(4) project construction work will commence within four years, except for readiness development projects funded under subdivision 4b;\n(5) for each type of project classification under subdivision 3, a maximum allowable amount for the total project cost estimate, as determined by the commissioner with available data; and\n(6) determination of a total project cost estimate with a reasonable degree of accuracy, except for readiness development projects funded under subdivision 4b.\n(b) A project whose construction is programmed in the state transportation improvement program is not eligible for funding under the program. This paragraph does not apply to a project that is programmed as result of selection under this section.\n(c) A project may be, but is not required to be, identified in the 20-year state highway investment plan under section 174.03.\n(d) For each project, the commissioner must consider all of the eligibility requirements under paragraph (a). The commissioner is prohibited from considering any eligibility requirement not specified under paragraph (a).\n(a) To ensure regional balance throughout the state, the commissioner must distribute all available funds under the program according to the following regional allocations:\n(1) Metro Projects: at least 25 percent and no more than 27.5 percent of the funds are for projects that are located within, on, or directly adjacent to an area bounded by marked Interstate Highways 494 and 694;\n(2) Metro Connector Projects: at least 35 percent and no more than 37.5 percent of the funds are for projects that:\n(i) are not included in clause (1); and\n(ii) are located wholly or primarily within a greater metropolitan county; and\n(3) Regional Center Projects: at least 35 percent and no more than 40 percent of the funds are for projects that are not included in clause (1) or (2).\n(b) The commissioner must calculate the percentages under paragraph (a) using total funds under the program over the current and prior two consecutive project selection rounds. The calculations must include readiness development projects funded under subdivision 4b.\n(a) The commissioner may allocate up to ten percent of funds available in each fiscal year for the following readiness advancement activities on a project: planning, scoping, predesign, preliminary engineering, and environmental analysis. Any share of funds not allocated by the commissioner to readiness advancement activities must be distributed to ranked projects in subdivision 4a.\n(b) Funds under this subdivision are for project development sufficient to: (1) meet the eligibility requirements under subdivision 4, paragraph (a), clauses (4) and (6); and (2) provide for the scoring assessment under subdivision 5.\n(a) The commissioner must establish a process to identify, evaluate, and select projects under the program. The process must be consistent with the requirements of this subdivision and must not include any additional scoring criteria. The process must include phases as provided in this subdivision.\n(b) Phase 1: Project solicitation. Following enactment of each law that makes additional funds available for the program, the commissioner must undertake a public solicitation of potential projects for consideration. The solicitation must be performed through an Internet recommendation process that allows for an interested party, including an individual, business, local unit of government, corridor group, or interest group, to submit a project for consideration.\n(c) Phase 2: Local screening and recommendations. The commissioner must present the projects submitted during the open solicitation under Phase 1 to the appropriate screening entity where each project is located. A screening entity must:\n(1) consider all of the submitted projects for its area;\n(2) solicit input from members of the legislature who represent the area for project review, comment, and nonbinding approval or disapproval; and\n(3) recommend projects to the commissioner for formal scoring, as provided in Phase 3.\n(d) In addition to readiness development projects selected in paragraph (e), each screening entity may recommend the following number of projects to the commissioner:\n(1) for area transportation partnerships, no more than three projects;\n(2) for the Metropolitan Council in consultation with the Transportation Advisory Board, no more than four projects; and\n(3) for each greater metropolitan county, no more than two projects.\n(e) Each screening entity may select up to two additional projects to recommend to the commissioner for readiness development funding as provided under subdivision 4b.\n(f) A screening entity may recommend a replacement project for one that the commissioner determines is ineligible under subdivision 4. Each recommendation must identify the comments and approvals or disapprovals provided by a member of the legislature.\n(g) Phase 3: Project scoring. The commissioner must confirm project eligibility under subdivision 4 and perform a complete scoring assessment on each of the eligible projects recommended by the screening entities under Phase 2.\n(h) Projects must be scored using all of the following criteria:\n(1) a return on investment measure that provides for comparison across eligible projects;\n(2) measurable impacts on commerce and economic competitiveness;\n(3) efficiency in the movement of freight, including but not limited to:\n(i) measures of annual average daily traffic and commercial vehicle miles traveled, which may include data near the project location on that trunk highway or on connecting trunk and local highways; and\n(ii) measures of congestion or travel time reliability, which may be within or near the project limits, or both;\n(4) improvements to traffic safety;\n(5) connections to regional trade centers, local highway systems, and other transportation modes;\n(6) the extent to which the project addresses multiple transportation system policy objectives and principles;\n(7) support and consensus for the project among members of the surrounding community; and\n(8) the time and work needed before construction may begin on the project.\nThe commissioner must give the criteria in clauses (1) to (8) equal weight in the scoring process. The commissioner may establish an alternative scoring assessment method for readiness development projects funded under subdivision 4b, which, to the extent practicable, must use the criteria specified in this paragraph.\n(i) Phase 4: Project ranking and selection. On completion of project scoring under Phase 3, the commissioner must develop a ranked list of projects based on total score, and must select projects in rank order for funding under the program, subject to subdivisions 4a and 4b. The commissioner must specify the amounts and known or anticipated sources of funding for each selected project.\n(j) Phase 5: Public information. The commissioner must publish information regarding the selection process on the department's website. The information must include:\n(1) lists of all projects submitted for consideration and all projects recommended by the screening entities;\n(2) the scores and ranking for each project; and\n(3) an overview of each selected project, with amounts and sources of funding.\n(k) Phase 6: Readiness development. For project selection under Phase 4, if all selected projects from prior project selection rounds under Phase 4 are funded, the commissioner must select additional projects from projects that received readiness development advancement funds under subdivision 4b. If a project received readiness development advancement funds and does not have sufficient sources of funding identified, the commissioner must re-score the projects as provided under Phase 3 and include the project in Phase 4 in the next selection round.\nIn identifying the amount of funding allocated to a project under the program, the commissioner may include allocations of funds for operations and maintenance resulting from that project, that are assigned in future years following completion of the project, subject to available funds for the program in those years from eligible sources.\n(a) Annually by November 1, the commissioner must electronically submit a report on the corridors of commerce program to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. At a minimum, the report must include:\n(1) a summary of the program, including a review of:\n(i) project selection process details that address program design and implementation, decision-making procedures, and eligibility evaluation;\n(ii) criteria measurement methodologies and criteria weighting used in project selection; and\n(iii) the policy that provides the weight given each criterion;\n(2) a summary of program finance, including funds expended in the previous selection cycle, any future operating costs assigned under subdivision 6, and total funds expended since program inception;\n(3) a list of projects funded under the program in the previous selection cycle, including:\n(i) project classification;\n(ii) a breakdown of project costs and funding sources; and\n(iii) a brief project description that is comprehensible to a lay audience;\n(4) a comprehensive list of evaluated projects and candidate project recommendations as required under subdivision 5, that identifies for each project: eligibility, classification, evaluation results for each criterion, score, and disposition in the selection process; and\n(5) any recommendations for changes to statutory requirements of the program.\n(b) In every even-numbered year, the commissioner must incorporate into the report the results of an independent evaluation of impacts and effectiveness of the program. The evaluation must be performed by agency staff or a consultant. The individual or individuals performing the evaluation must have experience in program evaluation, but must not be regularly involved in the program's implementation.\n(c) Notwithstanding paragraph (a), a report is not required in a year in which:\n(1) no project selection was completed during the preceding 12 months; and\n(2) an evaluation under paragraph (b) is not due.",
	"repealed": false
}