{
	"id": "17.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.101",
	"title": "17.101 PROMOTIONAL ACTIVITIES.",
	"text": "For the purposes of expanding, improving, and developing production and marketing of products of Minnesota agriculture, the commissioner shall encourage and promote the production and marketing of these products by means of:\n(a) advertising Minnesota agricultural products;\n(b) assisting state agricultural commodity organizations;\n(c) developing methods to increase processing and marketing of agricultural commodities including commodities not being produced in Minnesota on a commercial scale, but which may have economic potential in national and international markets;\n(d) investigating and identifying new marketing technology and methods to enhance the competitive position of Minnesota agricultural products;\n(e) evaluating livestock marketing opportunities;\n(f) assessing and developing national and international markets for Minnesota agricultural products;\n(g) studying the conversion of raw agricultural products to manufactured products including ethanol;\n(h) hosting the visits of foreign trade teams to Minnesota and defraying the teams' expenses;\n(i) assisting Minnesota agricultural businesses desiring to sell their products;\n(j) conducting research to eliminate or reduce specific production or technological barriers to market development and trade; and\n(k) other activities the commissioner deems appropriate to promote Minnesota agricultural products, provided that the activities do not duplicate programs or services provided by the Minnesota Trade Division.\nIn order to carry out the duties in subdivision 1, the commissioner, in addition to whatever other resources the department may commit, shall make grants and enter into contracts to fulfill the obligations of subdivision 1. The commissioner may enter into partnerships or seek gifts to carry out subdivision 1. The commissioner may contract with, among others, agricultural commodity organizations, the University of Minnesota, and agriculture related businesses to fulfill the duties. The commissioner shall make permanent rules for the administration of these grants and contracts. The rules shall specify at a minimum:\n(a) eligibility criteria;\n(b) application procedures;\n(c) provisions for application review and project approval;\n(d) provisions for program monitoring and review for all approved grants and contracts; and\n(e) other provisions the commissioner finds necessary.\nContracts entered into by the commissioner pursuant to this subdivision shall not exceed 75 percent of the cost of the project supported by the commissioner's grant. In any year, no organization shall receive more than $70,000 in grants from the commissioner.\nThe books, records, documents, and accounting procedures and practices of any organization receiving a grant or contract from the commissioner under the provisions of subdivision 2 shall be subject to examination by the department. The commissioner may prescribe uniform methods of accounting to be used by grant or contract recipients.\nThe commissioner may establish an ad hoc advisory group to assist in evaluating grant requests made under subdivision 2.\nFor purposes of this section:\n(1) \"agricultural commodity\" means a material produced for use in or as food, feed, seed, or fiber and includes crops for fiber, food, oilseeds, seeds, livestock, livestock products, dairy, dairy products, poultry, poultry products, and other products or by-products of the farm produced for the same or similar use, except ethanol; and\n(2) \"agricultural product processing facility\" means land, buildings, structures, fixtures, and improvements located or to be located in Minnesota and used or operated primarily for the processing or production of marketable products from agricultural commodities produced in Minnesota.\nThe commissioner shall establish a process, including criteria and standards, to recognize and assist efforts by counties to maintain or expand their livestock sector.\nA county that meets the criteria may apply to the commissioner to be designated a \"livestock friendly\" county.",
	"repealed": false
}