{
	"id": "85.0146",
	"url": "https://www.revisor.mn.gov/statutes/cite/85.0146",
	"title": "85.0146 CUYUNA COUNTRY STATE RECREATION AREA; CITIZENS ADVISORY COUNCIL.",
	"text": "The Cuyuna Country State Recreation Area Citizens Advisory Council is established. Membership on the advisory council shall include:\n(1) a representative of Cuyuna Range Economic Development Inc.;\n(2) a representative for the Croft Mine Historical Park;\n(3) a member at large appointed by the members of the council;\n(4) a representative of the Crow Wing County Board;\n(5) the state senator representing the state recreation area;\n(6) the member from the state house of representatives representing the state recreation area;\n(7) a representative of the Grand Rapids regional office of the Department of Natural Resources;\n(8) a designee of the commissioner of Iron Range resources and rehabilitation;\n(9) a designee of the local business community selected by the area chambers of commerce;\n(10) a designee of the local environmental community selected by the Crow Wing County District 5 commissioner;\n(11) a designee of a local education organization selected by the Crosby-Ironton School Board;\n(12) a designee of one of the recreation area user groups selected by the Cuyuna Range Chamber of Commerce; and\n(13) a member of the Cuyuna Country Heritage Preservation Society.\n(a) The advisory council must meet at least four times annually. The council shall elect a chair and meetings shall be at the call of the chair.\n(b) Members of the advisory council shall serve as volunteers for two-year terms with the ability to be reappointed. Members shall accept no per diem.\n(c) The state recreation area manager may attend the council meetings and advise the council of issues in management of the recreation area.\n(d) Before a major decision is implemented in the Cuyuna Country State Recreation Area, the area manager must consult with the council and take into consideration any council comments or advice that may impact the major decision.",
	"repealed": false
}