{
	"id": "144.9821",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9821",
	"title": "144.9821 ADVANCING HEALTH EQUITY THROUGH CAPACITY BUILDING AND RESOURCE ALLOCATION.",
	"text": "(a) The commissioner of health shall establish an annual grant program to award infrastructure capacity building grants to help metro and rural community and faith-based organizations serving people of color, American Indians, LGBTQIA+ communities, and people living with disabilities in Minnesota who have been disproportionately impacted by health and other inequities to be better equipped and prepared for success in procuring grants and contracts at the department and addressing inequities.\n(b) The commissioner of health shall create a framework at the department to maintain equitable practices in grantmaking to ensure that internal grantmaking and procurement policies and practices prioritize equity, transparency, and accessibility to include:\n(1) a tracking system for the department to better monitor and evaluate equitable procurement and grantmaking processes and their impacts; and\n(2) technical assistance and coaching to department leadership in grantmaking and procurement processes and programs and providing tools and guidance to ensure equitable and transparent competitive grantmaking processes and award distribution across communities most impacted by inequities and develop measures to track progress over time.\nThe commissioner of health shall:\n(1) in consultation with community stakeholders, community health boards and Tribal nations, develop a request for proposals for an infrastructure capacity building grant program to help community-based organizations, including faith-based organizations, to be better equipped and prepared for success in procuring grants and contracts at the department and beyond;\n(2) provide outreach, technical assistance, and program development support to increase capacity for new and existing community-based organizations and other service providers in order to better meet statewide needs particularly in greater Minnesota and areas where services to reduce health disparities have not been established;\n(3) in consultation with community stakeholders, review responses to requests for proposals and award grants under this section;\n(4) ensure communication with the ethnic councils, Minnesota Indian Affairs Council, Minnesota Council on Disability, Minnesota Commission of the Deaf, DeafBlind, and Hard of Hearing, and the governor's office on the request for proposal process;\n(5) in consultation with community stakeholders, establish a transparent and objective accountability process focused on outcomes that grantees agree to achieve;\n(6) maintain data on outcomes reported by grantees; and\n(7) establish a process or mechanism to evaluate the success of the capacity building grant program and to build the evidence base for effective community-based organizational capacity building in reducing disparities.\nOrganizations eligible to receive grant funding under this section include: organizations or entities that work with diverse communities such as people of color, American Indians, LGBTQIA+ communities, and people with disabilities in metro and rural communities.\n(a) The commissioner, in consultation with community stakeholders, shall develop a request for proposals for equity in procurement and grantmaking capacity building grant program to help community-based organizations, including faith-based organizations to be better equipped and prepared for success in procuring grants and contracts at the department and addressing inequities.\n(b) In awarding the grants, the commissioner shall provide strategic consideration and give priority to proposals from organizations or entities led by populations of color or American Indians, and those serving communities of color, American Indians, LGBTQIA+ communities, and disability communities.\nThe commissioner shall ensure that grant funds are prioritized and awarded to organizations and entities that are within counties that have a higher proportion of Black or African American, nonwhite Latino(a), LGBTQIA+, and disability communities to the extent possible.\nGrantees must report grant program outcomes to the commissioner on the forms and according to the timelines established by the commissioner.",
	"repealed": false
}