{
	"id": "203B.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.121",
	"title": "203B.121 BALLOT BOARDS.",
	"text": "(a) The governing body of each county, municipality, and school district with responsibility to accept and reject absentee ballots or to administer early voting must, by ordinance or resolution, establish a ballot board. The board must consist of a sufficient number of election judges appointed as provided in sections 204B.19 to 204B.22. The board may include deputy county auditors or deputy city clerks who have received training in the processing and counting of absentee ballots. Each member of the ballot board must be provided adequate training on the processing and counting of absentee ballots, including but not limited to instruction on accepting and rejecting absentee ballots, storage of absentee ballots, timelines and deadlines, the role of the ballot board, procedures for opening absentee ballot envelopes, procedures for counting absentee ballots, and procedures for reporting absentee ballot totals.\n(b) Each jurisdiction must pay a reasonable compensation to each member of that jurisdiction's ballot board for services rendered during an election.\n(c) Except as otherwise provided by this section, all provisions of the Minnesota Election Law apply to a ballot board.\n[See Note.]\n(a) The members of the ballot board shall take possession of all signature envelopes delivered to them in accordance with section 203B.08. Upon receipt from the county auditor, municipal clerk, or school district clerk, two or more members of the ballot board shall examine each signature envelope and shall mark it accepted or rejected in the manner provided in this subdivision. Election judges performing the duties in this section must be of different major political parties, unless they are exempt from that requirement under section 205.075, subdivision 4, or section 205A.10, subdivision 2.\n(b) The members of the ballot board shall mark the signature envelope \"Accepted\" and initial or sign the signature envelope below the word \"Accepted\" if a majority of the members of the ballot board examining the envelope are satisfied that:\n(1) the voter's name and address on the signature envelope are the same as the information provided on the absentee ballot application or voter record;\n(2) the voter signed the certification on the envelope;\n(3) the voter's Minnesota driver's license, state identification number, or the last four digits of the voter's Social Security number are the same as a number on the voter's absentee ballot application or voter record. If the number does not match, the election judges must compare the signature provided by the applicant to determine whether the ballots were returned by the same person to whom they were transmitted;\n(4) the voter is registered and eligible to vote in the precinct or has included a properly completed voter registration application in the signature envelope;\n(5) the certificate has been completed as prescribed in the directions for casting an absentee ballot; and\n(6) the voter has not already voted at that election, either in person or, if it is after the close of business on the 19th day before the election, as provided by section 203B.081.\nThe signature envelope from accepted ballots must be preserved and returned to the county auditor.\n(c)(1) If a majority of the members of the ballot board examining a signature envelope find that an absentee voter has failed to meet one of the requirements provided in paragraph (b), they shall mark the signature envelope \"Rejected,\" initial or sign it below the word \"Rejected,\" list the reason for the rejection on the envelope, and return it to the county auditor. There is no other reason for rejecting an absentee ballot beyond those permitted by this section. Failure to place the ballot within the ballot envelope before placing it in the outer white envelope is not a reason to reject an absentee ballot.\n(2) If an envelope has been rejected at least five days before the election, the envelope must remain sealed and the official in charge of the ballot board shall provide the voter with a replacement absentee ballot and signature envelope in place of the rejected ballot.\n(3) If an envelope is rejected within five days of the election, the envelope must remain sealed and the official in charge of the ballot board must attempt to contact the voter to notify the voter that the voter's ballot has been rejected by the method or methods of communication provided by the voter on the voter's application for an absentee ballot or voter registration. The official must document the attempts made to contact the voter.\n(d) The official in charge of the absentee ballot board must mail the voter a written notice of absentee ballot rejection between six and ten weeks following the election. If the official determines that the voter has otherwise cast a ballot in the election, no notice is required. If an absentee ballot arrives after the deadline for submission provided by this chapter, the notice must be provided between six to ten weeks after receipt of the ballot. A notice of absentee ballot rejection must contain the following information:\n(1) the date on which the absentee ballot was rejected or, if the ballot was received after the required deadline for submission, the date on which the ballot was received;\n(2) the reason for rejection; and\n(3) the name of the appropriate election official to whom the voter may direct further questions, along with appropriate contact information.\n(e) An absentee ballot signature envelope marked \"Rejected\" may not be opened or subject to further review except in an election contest filed pursuant to chapter 209.\n(a) When applicable, the county auditor or municipal clerk must immediately record that a voter's absentee ballot has been accepted or that the voter has cast a ballot pursuant to the early voting procedures provided in this chapter. After the close of business on the 19th day before the election, a voter whose record indicates that an absentee ballot has been accepted or that the voter has cast an early ballot must not be permitted to cast another ballot at that election. In a state primary, general, or state special election for federal, state, or county office, the auditor or clerk must also record this information in the statewide voter registration system.\n(b) The roster must be marked, and a supplemental report of absentee and early voters who submitted a voter registration application with their ballot must be created, no later than the start of voting on election day to indicate the voters that have already cast a ballot at the election. The roster may be marked either:\n(1) by the county auditor or municipal clerk before election day;\n(2) by the ballot board before election day; or\n(3) by the election judges at the polling place on election day.\n[See Note.]\nAfter the close of business on the 19th day before the election, the ballots from secrecy envelopes within the signature envelopes marked \"Accepted\" may be opened, duplicated as needed in the manner provided in section 206.86, subdivision 5, initialed by the members of the ballot board, and deposited in the appropriate ballot box. If more than one voted ballot is enclosed in the ballot envelope, the ballots must be returned in the manner provided by section 204C.25 for return of spoiled ballots, and may not be counted.\n(a) On a day on which absentee ballots are inserted into a ballot box, two members of the ballot board must:\n(1) remove the ballots from the ballot box at the end of the day;\n(2) without inspecting the ballots, ensure that the number of ballots removed from the ballot box is equal to the number of voters whose absentee ballots were accepted that day; and\n(3) seal and secure all voted and unvoted ballots present in that location at the end of the day.\n(b) After the polls have closed on election day, two members of the ballot board must count the ballots, tabulating the vote in a manner that indicates each vote of the voter and the total votes cast for each candidate or question. In state primary and state general elections, the results must indicate the total votes cast for each candidate or question in each precinct and report the vote totals tabulated for each precinct. The count must be recorded on a summary statement in substantially the same format as provided in section 204C.26. The ballot board shall submit at least one completed summary statement to the county auditor or municipal clerk. The county auditor or municipal clerk may require the ballot board to submit a sufficient number of completed summary statements to comply with the provisions of section 204C.27, or the county auditor or municipal clerk may certify reports containing the details of the ballot board summary statement to the recipients of the summary statements designated in section 204C.27.\nIn state primary and state general elections, these vote totals shall be added to the vote totals on the summary statements of the returns for the appropriate precinct. In other elections, these vote totals may be added to the vote totals on the summary statement of returns for the appropriate precinct or may be reported as a separate total.\nThe count shall be public. No vote totals from ballots may be made public before the close of voting on election day.\n(c) In addition to the requirements of paragraphs (a) and (b), if the task has not been completed previously, the members of the ballot board must verify as soon as possible, but no later than 24 hours after the end of the hours for voting, that voters whose absentee ballots arrived after the rosters were marked or supplemental reports were generated and whose ballots were accepted did not vote in person on election day. An absentee ballot submitted by a voter who has voted in person on election day must be rejected. All other accepted absentee ballots must be opened, duplicated if necessary, and counted by members of the ballot board. The vote totals from these ballots must be incorporated into the totals with the other absentee ballots and handled according to paragraph (b).",
	"repealed": false
}