{
	"id": "240.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.01",
	"title": "240.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them.\n\"Account holder\" means a natural person not otherwise prohibited from wagering who applies for and opens an account with an authorized ADW provider.\n\"Advance deposit wager\" means a wager placed through an advance deposit wagering provider on a horse race that is conducted outside of the state.\n\"Advance deposit wagering\" or \"ADW\" means a system of pari-mutuel betting in which wagers and withdrawals are debited and winning payoffs and deposits are credited to an account held by an authorized ADW provider on behalf of an account holder. Advance deposit wagering shall not mean or include historical horse racing, nor any televised, video, or computer screen depicting a video game of chance or slot machine.\n\"Authorized advance deposit wagering provider\" or \"ADW provider\" means a person who holds a class C license under this chapter as a racing or gaming-related vendor and has entered into a commission-approved contract with a class A or class B licensee to provide advance deposit wagering on horse racing under this chapter.\n[Renumbered subd 8]\n\"Banked\" means any game of chance that is played with the house as a participant in the game, where the house takes on all players, collects from all losers, and pays all winners, and the house can win.\n[Renumbered subd 15]\n\"Breakage\" is the odd cents of all money to be distributed based on each dollar bet exceeding a sum equal to the next lowest multiple of ten.\n[Renumbered subd 6]\n\"Card club\" means a facility or portion of a facility where the commission has authorized a licensee to conduct card playing.\n[Renumbered subd 14]\n\"Card playing\" means an activity wherein individuals wager utilizing a 52-unit system comprised of a series of numbers, numbered two through ten, and the letters J, Q, K, and A, combined with four symbols commonly known as hearts, diamonds, spades, and clubs, wherein each individual unit constitutes the display of one of the 52 possible combinations. The symbol commonly known as a joker may be incorporated into the system.\n[Renumbered subd 3]\n\"Commission\" is the Minnesota Racing Commission.\n[Renumbered subd 22]\n\"Handle\" means the aggregate of all pari-mutuel pools, excluding refundable wagers or cancellations.\n[Renumbered subd 12]\n\"Horse racing\" is any form of live or simulcast of a live horse race in which horses carry a human rider or pull a sulky with a human. Horse racing shall not include any form that has happened in the past or is considered historical horse racing.\n\"Historical horse racing\" means any horse race that was previously conducted at a licensed racetrack, concluded with results, and concluded without scratches, disqualifications, or dead-heat finishes.\n[Renumbered subd 10]\n\"Horseperson\" means a person who is currently licensed by the commission as an owner or lessee, or a trainer.\n[Renumbered subd 17]\n\"Licensed racetrack\" is a racetrack at which horse racing is conducted on the premises and which holds a class A or class D license issued by the commission.\n\"Minnesota resident\" means a person who provides a physical address or post office box address in the state of Minnesota as the person's primary residence when applying for and opening an ADW account.\n[Renumbered subd 18]\n\"Mixed meet\" means a racing day or series of racing days on which the racing of more than one breed of horse occurs.\nMS 2014 [Repealed, 2015 c 77 art 4 s 23]\n\"Multiple pool\" is a licensed pari-mutuel pool other than a straight pool. A \"multiple bet\" is a bet in a multiple pool.\nMS 1990 [Repealed, 1991 c 336 art 1 s 33]\n\"On-track pari-mutuel betting\" means wagering conducted at a licensed racetrack.\nMS 1992 [Repealed, 1993 c 13 art 1 s 5]\n\"Pari-mutuel betting\" is the system of betting on horse races where those who bet on horses that finish in the position or positions for which bets are taken share in the total amounts bet, less deductions required or permitted by law. Pari-mutuel betting shall not include betting on a race that has occurred in the past or is considered historical horse racing or where bettors are not wagering on the same live or simulcast horse race or bettors do not share in the total amount of bets taken.\nMS 1990 [Repealed, 1991 c 233 s 110]\n\"Person\" is an individual, firm, association, partnership, corporation, trustee, or legal representative, and any licensee, participant, or patron.\n[Renumbered subd 9]\n\"Player pool\" means a wagering system or game where wagers lost in a number of card games may be accumulated into a pool for purposes of enhancing the total amount paid back to players in any other card game. In such instances, the sponsor or house may only serve as custodian of the player pool and may not have an active interest in any card game.\nMS 1994 [Repealed, 1995 c 261 s 26]\n\"Racing day\" is a day assigned by the commission on which live racing is conducted.\n[Renumbered subd 13]\n\"Racing meeting\" is a series of days in which racing days are not separated by more than five nonracing days unless approved in advance by the commission.\n\"Racing or gaming-related vendor\" means any person or entity that manufactures, sells, provides, distributes, repairs or maintains equipment or supplies used at a class A facility, or provides services to a class A facility or class B license holder that are directly related to the running of a horse race, simulcasting, pari-mutuel betting, or card playing.\n[Renumbered subd 20]\n\"Racing season\" means that portion of the calendar year starting at the beginning of the day of the first live horse race conducted by the licensee and concluding at the end of the day of the last live horse race conducted by the licensee in any year.\nMS 1994 [Repealed, 1995 c 261 s 26]\n\"Simulcasting\" means the televised display, for pari-mutuel wagering purposes, of one or more horse races conducted at another location wherein the televised display occurs simultaneously with the race being televised.\n\"Source market fee\" means a percentage of the amount wagered by a Minnesota resident through an authorized advance deposit wagering provider that is paid by the ADW provider to a class A or class B licensee.\nMS 1994 [Repealed, 1995 c 261 s 26]\nA \"steward\" means an official described in section 240.16. The term steward includes the terms \"judge,\" \"chief steward,\" and \"presiding judge,\" and applies to stewards and judges of the commission or a class B licensee, but not to other racing officials, such as paddock or placement judges, who are employees or agents of a class B licensee.\n[Renumbered subd 19]\n\"Straight pool\" is a licensed pari-mutuel pool in which each ticket represents a bet to win, place, or show. A \"straight bet\" is a bet in a straight pool.\nMS 2014 [Repealed, 2015 c 77 art 4 s 23]\n\"Takeout\" means the total amount of money, excluding breakage, withheld from each pari-mutuel pool, as authorized by statute or rule.\n[Renumbered subd 4]\n\"Unbanked\" means a wagering system or game where the individual participants compete against each other and not against the sponsor or house. In an unbanked system or game, the sponsor or house may deduct a percentage from the accumulated wagers and impose other charges for hosting the activity but does not have an interest in the outcome of a game. The sponsor or house may add additional prizes, awards, or money to any game for promotional purposes. Unbanked games include those games that involve a player pool.\n[Renumbered subd 5]\n[Renumbered subd 24]\n[Renumbered subd 16]\n[Renumbered subd 23]\n[Renumbered subd 7]\n[Renumbered subd 11]\n[Renumbered subd 2]\n[Renumbered subd 21]",
	"repealed": false
}