{
	"id": "580.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.021",
	"title": "580.021 FORECLOSURE PREVENTION COUNSELING.",
	"text": "This section applies to foreclosure of mortgages by advertisement under this chapter and foreclosure of mortgages by action under chapter 581 on property consisting of one to four family dwelling units, one of which the owner occupies as the owner's principal place of residency when the notice of pendency under section 580.032 or the lis pendens for a foreclosure under chapter 581 is recorded.\nBefore the notice of pendency under section 580.032, subdivision 3, or the lis pendens for a foreclosure under chapter 581 is recorded, a party foreclosing a mortgage must provide to the mortgagor information contained in a form prescribed in section 580.022, subdivision 1, that:\n(1) foreclosure prevention counseling services provided by an authorized foreclosure prevention counseling agency are available; and\n(2) the party will transmit the homeowner's name, address, and telephone number to an approved foreclosure prevention agency.\nThe notices required by this subdivision may be provided concurrently with a written notice of default.\nFor the purposes of this section, an \"authorized foreclosure prevention counseling agency\" or \"counseling agency\" is a government agency or a nonprofit agency funded, all or in part, for foreclosure prevention services, by the Minnesota Housing Finance Agency or the United States Department of Housing and Urban Development, or otherwise approved by the United States Department of Housing and Urban Development to provide foreclosure prevention counseling services.\nThe party entitled to foreclose shall, within one week of sending the notice prescribed in section 580.022, provide to the appropriate authorized foreclosure prevention agency the mortgagor's name, address, and most recent known telephone number.\n(a) An authorized foreclosure prevention agency that contacts or is contacted by a mortgagor or the mortgagor's authorized representative and agrees to provide foreclosure prevention assistance services to the mortgagor or representative must provide the form prescribed in section 580.022 to the mortgagee. The form serves as notice to the mortgagee that the mortgagor is receiving foreclosure prevention counseling assistance.\n(b) The mortgagee must return the form to the authorized foreclosure prevention agency within 15 days of receipt of the form with the name and telephone number of the mortgagee's agent. The agent must be a person authorized by the mortgagee to:\n(1) discuss with the authorized foreclosure prevention agency or the mortgagor the terms of the mortgage; and\n(2) negotiate any resolution to the mortgagor's default.\n(c) Nothing in this subdivision requires a mortgagee to reach a resolution relating to the mortgagor's default.",
	"repealed": false
}