{
	"id": "97A.473",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.473",
	"title": "97A.473 RESIDENT LIFETIME LICENSES.",
	"text": "(a) The commissioner may issue a lifetime angling license, a lifetime spearing license, a lifetime angling and spearing license, a lifetime small-game-hunting license, a lifetime firearm or archery deer-hunting license, a lifetime sporting license, or a lifetime sporting with spearing option license to a person who is a resident of the state for at least one year or who is under age 21 and the child of a person who is a resident of the state for at least one year. The license fees paid for a lifetime license are nonrefundable.\n(b) The commissioner may require the holder of a lifetime license issued under this section to notify the department each year that the license is used, by:\n(1) telephone or Internet notification, as specified by the commissioner;\n(2) the purchase of stamps for the license; or\n(3) registration, in the case of the resident lifetime deer license.\n[See Note.]\n(a) A resident lifetime angling license authorizes a person to take fish by angling in the state. The license authorizes those activities authorized by the annual resident angling license. The license does not include a trout-and-salmon stamp validation, a walleye stamp validation, or other stamps required by law.\n(b) The fees for a resident lifetime angling license are:\n(1) age 3 and under, $344;\n(2) age 4 to age 15, $469;\n(3) age 16 to age 50, $574; and\n(4) age 51 and over, $379.\n(a) A resident lifetime spearing license authorizes a person to take fish by spearing in the state. The license authorizes those activities authorized by the annual resident spearing license.\n(b) The fees for a resident lifetime spearing license are:\n(1) age 3 and under, $90;\n(2) age 4 to age 15, $124;\n(3) age 16 to age 50, $117; and\n(4) age 51 and over, $61.\n(a) A resident lifetime angling and spearing license authorizes a person to take fish by angling or spearing in the state. The license authorizes those activities authorized by the annual resident angling and spearing licenses.\n(b) The fees for a resident lifetime angling and spearing license are:\n(1) age 3 and under, $432;\n(2) age 4 to age 15, $579;\n(3) age 16 to age 50, $678; and\n(4) age 51 and over, $439.\n(a) A resident lifetime small-game-hunting license authorizes a person to hunt and trap small game, other than wolves, in the state. The license authorizes those hunting and trapping activities authorized by the annual resident small-game-hunting license and the trapping license for fur-bearing animals other than wolves. The license does not include any hunting stamps required by law.\n(b) The fees for a resident lifetime small-game-hunting license are:\n(1) age 3 and under, $223;\n(2) age 4 to age 15, $301;\n(3) age 16 to age 50, $430; and\n(4) age 51 and over, $274.\n[See Note.]\n(a) A resident lifetime deer-hunting license authorizes a person to take deer with firearms or by archery in the state. The license authorizes those activities authorized by the annual resident firearm deer-hunting license or the annual resident archery deer-hunting license. The licensee must review and confirm information each year that the license is used.\n(b) The fees for a resident lifetime firearm or archery deer-hunting license are:\n(1) age 3 and under, $458;\n(2) age 4 to age 15, $607;\n(3) age 16 to age 50, $741; and\n(4) age 51 and over, $528.\n[See Note.]\n(a) A resident lifetime sporting license authorizes a person to take fish by angling and hunt and trap small game, other than wolves, in the state. The license authorizes those activities authorized by the annual resident angling and resident small-game-hunting licenses and the resident trapping license for fur-bearing animals other than wolves. The license does not include a trout-and-salmon stamp validation, a walleye stamp validation, or any other stamps required by law.\n(b) The fees for a resident lifetime sporting license are:\n(1) age 3 and under, $522;\n(2) age 4 to age 15, $710;\n(3) age 16 to age 50, $927; and\n(4) age 51 and over, $603.\n[See Note.]\n(a) A resident lifetime sporting with spearing option license authorizes a person to take fish by angling or spearing and hunt and trap small game, other than wolves, in the state. The license authorizes those activities authorized by the annual resident angling, spearing, and resident small-game-hunting licenses and the resident trapping license for fur-bearing animals other than wolves. The license does not include a trout-and-salmon stamp validation, a walleye stamp validation, or any other stamps required by law.\n(b) The fees for a resident lifetime sporting with spearing option license are:\n(1) age 3 and under, $612;\n(2) age 4 to age 15, $833;\n(3) age 16 to age 50, $1,046; and\n(4) age 51 and over, $666.\n[See Note.]",
	"repealed": false
}