{
	"id": "604.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.31",
	"title": "604.31 CAUSE OF ACTION FOR NONCONSENSUAL DISSEMINATION OF PRIVATE SEXUAL IMAGES; SEXUAL SOLICITATION.",
	"text": "(a) A cause of action against a person for the nonconsensual dissemination of private sexual images exists when:\n(1) a person disseminated an image without the consent of the person depicted in the image;\n(2) the image is of an individual depicted in a sexual act or whose intimate parts are exposed in whole or in part;\n(3) the person is identifiable:\n(i) from the image itself, by the person depicted in the image or by another person; or\n(ii) from the personal information displayed in connection with the image; and\n(4) the image was obtained or created under circumstances in which the person depicted had a reasonable expectation of privacy.\n(b) The fact that the individual depicted in the image consented to the creation of the image or to the voluntary private transmission of the image is not a defense to liability for a person who has disseminated the image without consent.\nA person who uses the personal information of another to invite, encourage, or solicit sexual acts without the individual's consent and knows or has reason to know it will cause the person whose personal information is used to feel harassed, frightened, threatened, oppressed, persecuted, or intimidated, is liable for damages to the individual whose personal information was published or disseminated publicly.\nThe court may award the following damages to a prevailing plaintiff from a person found liable under subdivision 1 or 2:\n(1) general and special damages, including all finance losses due to the dissemination of the image and damages for mental anguish;\n(2) an amount equal to any profit made from the dissemination of the image by the person who intentionally disclosed the image;\n(3) a civil penalty awarded to the plaintiff of an amount up to $10,000; and\n(4) court costs, fees, and reasonable attorney fees.\n(a) A court may issue a temporary or permanent injunction or restraining order to prevent further harm to the plaintiff.\n(b) The court may issue a civil fine for the violation of a court order in an amount up to $1,000 per day for failure to comply with an order granted under this section.\nThe court shall allow confidential filings to protect the privacy of the plaintiff in cases filed under this section.\n(a) No person shall be found liable under this section when:\n(1) the dissemination is made for the purpose of a criminal investigation or prosecution that is otherwise lawful;\n(2) the dissemination is for the purpose of, or in connection with, the reporting of unlawful conduct;\n(3) the dissemination is made in the course of seeking or receiving medical or mental health treatment, and the image is protected from further dissemination;\n(4) the image involves exposure in public or was obtained in a commercial setting for the purpose of the legal sale of goods or services, including the creation of artistic products for sale or display;\n(5) the image relates to a matter of public interest and dissemination serves a lawful public purpose;\n(6) the dissemination is for legitimate scientific research or educational purposes; or\n(7) the dissemination is made for legal proceedings and is consistent with common practice in civil proceedings necessary for the proper functioning of the criminal justice system, or protected by court order which prohibits any further dissemination.\n(b) This section does not alter or amend the liabilities and protections granted by United States Code, title 47, section 230, and shall be construed in a manner consistent with federal law.\n(c) A cause of action arising under this section does not prevent the use of any other cause of action or remedy available under the law.\nA court has jurisdiction over a cause of action filed pursuant to this section if the plaintiff or defendant resides in this state.\nA cause of action arising under this section may be filed in either:\n(1) the county of residence of the defendant or plaintiff or in the jurisdiction of the plaintiff's designated address if the plaintiff participates in the address confidentiality program established by chapter 5B; or\n(2) the county where any image is produced, reproduced, or stored in violation of this section.\nIn a civil action brought under subdivision 1, the statute of limitations is tolled until the plaintiff discovers the image has been disseminated.",
	"repealed": false
}