{
	"id": "515.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/515.13",
	"title": "515.13 COPY OF THE FLOOR PLANS TO BE FILED.",
	"text": "Simultaneously with the recording of the declaration there shall be filed in the office of the recording officer a set of the floor plans of the building showing the layout, location, apartment numbers and dimensions of the apartments, stating the name of the building or that it has no name, and bearing the verified statement of a registered architect, licensed professional engineer, or licensed land surveyor certifying that it is an accurate copy of portions of the plans of the building as filed with and approved by the municipal or other governmental subdivision having jurisdiction over the issuance of permits for the construction of buildings. If such plans do not include a verified statement by such architect, engineer, or licensed land surveyor that such plans fully and accurately depict the layout, location, apartment numbers and dimensions of the apartments as built, there shall be recorded prior to the first conveyance of any apartment an amendment to the declaration to which shall be attached a verified statement of a registered architect, licensed professional engineer, or licensed land surveyor certifying that the plans theretofore filed, or being filed simultaneously with such amendment, fully and accurately depict the layout, location, apartment numbers and dimensions of the apartments as built. Such plans shall be kept by the recording officer in a separate file for each building, indexed in the same manner as a conveyance entitled to record, numbered serially in the order of receipt, each designated \"apartment ownership,\" with the name of the building, if any, and each containing a reference to the book, page and date of recording of the declaration. Correspondingly, the record of the declaration shall contain a reference to the file number of the floor plans of the building affected thereby.",
	"repealed": false
}