{
	"id": "84.154",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.154",
	"title": "84.154 LAC QUI PARLE WATER CONTROL PROJECT.",
	"text": "The commissioner is hereby authorized, with the approval of the Executive Council, and on such terms as may be deemed advantageous to the state, to sell and convey to the United States the fee title, free from any mineral reservation, of lands acquired by the state for the Lac qui Parle River water control project upon which dams and appurtenant structures have been or may be constructed and such rights-of-way as may be required by the United States to provide access thereto for the purposes of construction, maintenance and operation, and to grant, sell and convey either such fee title to, or flowage rights over, all lands acquired for the project on and above Lac qui Parle Lake which lie below the 935.7 foot elevation on project datum, and to grant, sell and convey flowage rights only over all lands so acquired on or above Marsh Lake which lie below the 939.5 foot elevation on project datum and over all of such lands on and above either of these lakes which lie above such elevations, and to lease to any appropriate agency of the United States for conservation purposes, subject to such flowage rights, any of such lands the ownership of which is retained by the state, or to enter into a cooperative agreement with any such agency for the development and management of any wild life or other conservation activity thereon; provided, that no such conveyance or agreement shall waive any claim of the state for reimbursement from the United States. Each such lease for conservation purposes and each such cooperative agreement for the development and management of wild life or other conservation activity on such lands shall contain specific conditions reserving to the public during all open seasons for hunting wild waterfowl at least 40 percent of the area of these lands suitable for hunting waterfowl as public shooting grounds.\nThe commissioner of natural resources is authorized to construct all works and improvements pertaining or incidental to said projects which the commissioner deems necessary for such purposes, and to maintain and operate the same so far as not transferred to the United States pursuant to law.\nThe commissioner of natural resources may use for any project herein authorized any land of the state under the commissioner's jurisdiction or control so far as is not inconsistent with the laws governing the same, may acquire by purchase, gift, or condemnation any additional lands or interests in lands required for such projects, including lands or interests in adjacent states if authorized by the laws thereof, may accept gifts or grants of money or property from the United States or any other source for such projects, may use and apply any money or property so received in accordance with the terms of the gift or grant so far as is not inconsistent with the provisions of this section or other laws, may act in behalf of the state as sponsor for any such project undertaken or authorized by the United States, may make any sponsor's contributions required for any such project and may cooperate with the United States or any adjacent state or any authorized agency of either in constructing, maintaining and operating any such project upon such terms and conditions as the commissioner may deem proper not inconsistent with the laws of this state.\nThe commissioner of natural resources may, in behalf of the state, with the approval of the governor, sell or lease to the United States any part of the lands or interests in lands heretofore or hereafter acquired by the state for the purposes of such projects, with any structures or improvements thereon, upon such terms and conditions as the commissioner may deem proper, providing for the continued maintenance and operation of such projects for the purposes herein specified; provided that the provisions of this section shall not be deemed to repeal or supersede the provisions of Laws 1941, chapters 142 and 518, with respect to lands or interests heretofore acquired, so far as applicable thereto; provided, that the governor shall not approve any such sale or lease without first consulting the Legislative Advisory Commission and securing their recommendation, which shall be advisory only. Failure or refusal of the commission to make a recommendation promptly shall be deemed a negative recommendation.\n[Repealed, 2014 c 290 s 70]\n(1) The supervision and control of the Lac qui Parle project lands, which is now vested in the Executive Council by Laws 1925, chapter 426; Laws 1933, chapter 355; Extra Session Laws 1933, chapter 25; Laws 1935, chapter 51; Extra Session Laws 1935, chapter 101; Laws 1937, chapters 209 and 459; Extra Session Laws 1937, chapter 89; Laws 1941, chapters 142 and 518; Laws 1943, chapter 476; Laws 1945, chapter 325; Laws 1947, chapter 571; and Minnesota Statutes, section 84.154, are hereby transferred to the commissioner of natural resources.\n(2) These lands, which consist of 22,000 acres, more or less, located in the north and east edge of Lac qui Parle County and portions of the south and west edges of Chippewa, Swift and Big Stone Counties, shall be used and developed as a game refuge and public hunting grounds as the commissioner of natural resources may designate and shall include all state-owned lands acquired pursuant to the provisions of law above stated.\n(3) The power of eminent domain will not be exercised in the case of the acquisition of additional lands to this game refuge and public hunting ground.",
	"repealed": false
}