{
	"id": "216C.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.51",
	"title": "216C.51 UTILITY DIVERSITY REPORTING.",
	"text": "It is the public policy of this state to encourage each utility that serves Minnesota residents to focus on and improve the diversity of the utility's workforce and suppliers.\nAs used in this section, \"utility\" has the meaning given to the term \"public utility\" in section 216B.02, subdivision 4.\n(a) Beginning March 15, 2024, and each March 15 thereafter, each utility authorized to do business in Minnesota must file an annual diversity report to the commissioner in the public eDockets system that describes:\n(1) the utility's goals and efforts to increase diversity in the workplace, including current workforce representation numbers and percentages; and\n(2) all procurement goals and actual spending for female-owned, minority-owned, veteran-owned, and small business enterprises during the previous calendar year.\n(b) The goals under paragraph (a), clause (2), must be expressed as a percentage of the total work performed by the utility submitting the report. The actual spending for female-owned, minority-owned, veteran-owned, and small business enterprises must also be expressed as a percentage of the total work performed by the utility submitting the report.\nEach utility required to report under this section must include the following in the annual report:\n(1) an explanation of the plan to increase diversity in the utility's workforce and among the utility's suppliers during the next year;\n(2) an explanation of the plan to increase the goals;\n(3) an explanation of the challenges faced to increase workforce and supplier diversity, including suggestions regarding actions the department could take to help identify potential employees and vendors;\n(4) a list of the certifications the company recognizes;\n(5) a point of contact for a potential employee or vendor that wishes to work for or do business with the utility; and\n(6) a list of successful actions taken to increase workforce and supplier diversity, to encourage other companies to emulate best practices.\nEach annual report must include as much state-specific data as possible. If the submitting utility does not submit state-specific data, the utility must include any relevant national data the utility possesses, explain why the utility could not submit state-specific data, and detail how the utility intends to include state-specific data in future reports, if possible.\nThe department must publish an annual report on the department's website and must maintain each annual report for at least five years.",
	"repealed": false
}