{
	"id": "144.9513",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.9513",
	"title": "144.9513 HEALTHY HOUSING GRANTS.",
	"text": "(a) For purposes of this section and sections 144.9501 to 144.9512, the following terms have the meanings given.\n(b) \"Housing\" means a room or group of rooms located within a dwelling forming a single habitable unit with facilities used or intended to be used for living, sleeping, cooking, and eating.\n(c) \"Healthy housing\" means housing that is sited, designed, built, renovated, and maintained in ways that supports the health of residents.\n(d) \"Housing-based health threat\" means a chemical, biologic, or physical agent in the immediate housing environment, including toxic lead, mold, radon, and indoor allergens and contaminants in carpets, which constitutes a potential or actual hazard to human health at acute or chronic exposure levels.\n(e) \"Primary prevention\" means preventing exposure to housing-based health threats before seeing clinical symptoms or a diagnosis.\n(f) \"Secondary prevention\" means intervention to mitigate health effects on people with housing-based health threats.\nGrant applicants shall submit applications to the commissioner as directed by a request for proposals. Grants must be competitively awarded and recipients of a grant under this section must prepare and submit a quarterly progress report to the commissioner beginning three months after receipt of the grant. The commissioner shall provide technical assistance and program support as needed to ensure that housing-based health threats are effectively identified, mitigated, and evaluated by grantees.\n(a) Within the limits of available appropriations, the commissioner shall make grants to support implementation of healthy housing programs to community health boards, community action agencies under section 142F.301, and nonprofit organizations with expertise in providing outreach, education, and training on healthy housing subjects and in providing comprehensive healthy housing assessments and interventions.\n(b) The grantee may conduct the following activities:\n(1) implement and maintain primary prevention programs to reduce housing-based health threats that include the following:\n(i) providing education materials to the general public and to property owners, contractors, code officials, health care providers, public health professionals, health educators, nonprofit organizations, and other persons and organizations engaged in housing and health issues;\n(ii) promoting awareness of community, legal, and housing resources; and\n(iii) promoting the use of hazard reduction measures in new housing construction and housing rehabilitation programs;\n(2) provide training on identifying and addressing housing-based health threats;\n(3) provide technical assistance on the implementation of mitigation measures;\n(4) promote adoption of evidence-based best practices for mitigation of housing-based health threats;\n(5) develop work practices for addressing specific housing-based health threats;\n(6) identify, characterize, and mitigate hazards in housing that contribute to adverse health outcomes;\n(7) ensure screening services and other secondary prevention measures are provided to populations at high risk for housing-related health threats;\n(8) promote compliance with Department of Health guidelines and other best practices, as identified by the commissioner, for preventing or reducing housing-based health threats;\n(9) establish local or regional collaborative groups to ensure that resources for addressing housing-based health threats are coordinated; or\n(10) develop model programs for addressing housing-based health threats.",
	"repealed": false
}