{
	"id": "256.046",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.046",
	"title": "256.046 ADMINISTRATIVE FRAUD DISQUALIFICATION HEARINGS.",
	"text": "A local agency must initiate an administrative fraud disqualification hearing for individuals accused of wrongfully obtaining assistance or intentional program violations, in lieu of a criminal action when it has not been pursued, in general assistance, family general assistance program formerly codified in section 256D.05, subdivision 1, clause (15), Minnesota supplemental aid, MinnesotaCare for adults without children, and upon federal approval, all categories of medical assistance and remaining categories of MinnesotaCare except for children through age 18. The Department of Human Services, in lieu of a local agency, may initiate an administrative fraud disqualification hearing when the state agency is directly responsible for administration or investigation of the program for which benefits were wrongfully obtained. The hearing is subject to the requirements of sections 256.045 and 256.0451 and the requirements in Code of Federal Regulations, title 7, section 273.16.\n[See Note.]\nThe human services judge may combine a fair hearing under section 142A.20 or 256.045 and administrative fraud disqualification hearing under this section or section 142A.27 into a single hearing if the factual issues arise out of the same, or related, circumstances and the individual receives prior notice that the hearings will be combined. If the administrative fraud disqualification hearing and fair hearing are combined, the time frames for administrative fraud disqualification hearings specified in Code of Federal Regulations, title 7, section 273.16, apply. If the individual accused of wrongfully obtaining assistance is charged under section 256.98 for the same act or acts which are the subject of the hearing, the individual may request that the hearing be delayed until the criminal charge is decided by the court or withdrawn.\n[Renumbered 142E.51, subd 5]",
	"repealed": false
}