{
	"id": "245.697",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.697",
	"title": "245.697 STATE ADVISORY COUNCIL ON MENTAL HEALTH.",
	"text": "(a) A State Advisory Council on Mental Health is created. The council must have members appointed by the governor in accordance with federal requirements. In making the appointments, the governor shall consider appropriate representation of communities of color. The council must be composed of:\n(1) the assistant commissioner of the Department of Human Services who oversees behavioral health policy;\n(2) a representative of the Department of Human Services responsible for the medical assistance program;\n(3) a representative of Direct Care and Treatment;\n(4) a representative of the Department of Health;\n(5) one member of each of the following professions:\n(i) psychiatry;\n(ii) psychology;\n(iii) social work;\n(iv) nursing;\n(v) marriage and family therapy; and\n(vi) professional clinical counseling;\n(6) one representative from each of the following advocacy groups: Mental Health Association of Minnesota, NAMI-MN, Minnesota Disability Law Center, American Indian Mental Health Advisory Council, and a consumer-run mental health advocacy group;\n(7) providers of mental health services;\n(8) consumers of mental health services;\n(9) family members of persons with mental illnesses;\n(10) legislators;\n(11) social service agency directors;\n(12) county commissioners; and\n(13) other members reflecting a broad range of community interests, including family physicians, or members as the United States Secretary of Health and Human Services may prescribe by regulation or as may be selected by the governor.\n(b) The council shall select a chair. Terms, compensation, and removal of members and filling of vacancies are governed by section 15.059. Notwithstanding provisions of section 15.059, the council and its subcommittee on children's mental health do not expire. The commissioner of human services shall provide staff support and supplies to the council.\nThe State Advisory Council on Mental Health shall:\n(1) advise the governor and heads of state departments and agencies about policy, programs, and services affecting people with mental illness;\n(2) advise the commissioner of human services on all phases of the development of mental health aspects of the biennial budget;\n(3) advise the governor about the development of innovative mechanisms for providing and financing services to people with mental illness;\n(4) encourage state departments and other agencies to conduct needed research in the field of mental health;\n(5) review recommendations of the subcommittee on children's mental health;\n(6) educate the public about mental illness and the needs and potential of people with mental illness;\n(7) review and comment on all grants dealing with mental health and on the development and implementation of state and local mental health plans; and\n(8) coordinate the work of local children's and adult mental health advisory councils and subcommittees.\nThe State Advisory Council on Mental Health (the \"advisory council\") must have a Subcommittee on Children's Mental Health. The subcommittee must make recommendations to the advisory council on policies, laws, regulations, and services relating to children's mental health. Members of the subcommittee must include:\n(1) the commissioners or designees of the commissioners of the Departments of Human Services, Health, Education, State Planning, and Corrections;\n(2) a designee of the Direct Care and Treatment executive board;\n(3) the commissioner of commerce or a designee of the commissioner who is knowledgeable about medical insurance issues;\n(4) at least one representative of an advocacy group for children with emotional disturbances;\n(5) providers of children's mental health services, including at least one provider of services to preadolescent children, one provider of services to adolescents, and one hospital-based provider;\n(6) parents of children who have emotional disturbances;\n(7) a present or former consumer of adolescent mental health services;\n(8) educators currently working with emotionally disturbed children;\n(9) people knowledgeable about the needs of emotionally disturbed children of minority races and cultures;\n(10) people experienced in working with emotionally disturbed children who have committed status offenses;\n(11) members of the advisory council;\n(12) one person from the local corrections department and one representative of the Minnesota District Judges Association Juvenile Committee; and\n(13) county commissioners and social services agency representatives.\nThe chair of the advisory council shall appoint subcommittee members described in clauses (4) to (12) through the process established in section 15.0597. The chair shall appoint members to ensure a geographical balance on the subcommittee. Terms, compensation, removal, and filling of vacancies are governed by subdivision 1, except that terms of subcommittee members who are also members of the advisory council are coterminous with their terms on the advisory council. The subcommittee shall meet at the call of the subcommittee chair who is elected by the subcommittee from among its members. The subcommittee expires with the expiration of the advisory council.\nThe State Advisory Council on Mental Health shall report from time to time on its activities to the governor, the chairs of the appropriate policy committees of the house of representatives and senate, and the commissioners of health, employment and economic development, and human services. It shall file a formal report with the governor not later than October 15 of each even-numbered year so that the information contained in the report, including recommendations, can be included in the governor's budget message to the legislature. It shall also report to the chairs of the appropriate policy committees of the house of representatives and senate not later than November 15 of each even-numbered year.",
	"repealed": false
}