{
	"id": "626.8471",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.8471",
	"title": "626.8471 AVOIDING RACIAL PROFILING; POLICIES AND LEARNING OBJECTIVES REQUIRED.",
	"text": "The legislature finds that the reality or public perception of racial profiling alienates people from police, hinders community policing efforts, and causes law enforcement to lose credibility and trust among the people law enforcement is sworn to protect and serve. No stop initiated by a peace officer should be made without a legitimate reason; race, ethnicity, or national origin alone should never provide a sufficient reason. Law enforcement policies and training programs must emphasize the need to respect the balance between the rights of all persons to be free from unreasonable governmental intrusions and law enforcement's need to enforce the law.\n\"Racial profiling\" means any action initiated by law enforcement that relies upon the race, ethnicity, or national origin of an individual rather than:\n(1) the behavior of that individual; or\n(2) information that leads law enforcement to a particular individual who has been identified as being engaged in or having been engaged in criminal activity.\nRacial profiling includes use of racial or ethnic stereotypes as factors in selecting whom to stop and search. Racial profiling does not include law enforcement's use of race or ethnicity to determine whether a person matches a specific description of a particular subject.\n(a) The Board of Peace Officer Standards and Training shall consult with the Minnesota Chiefs of Police Association, the Minnesota Sheriffs Association, the Racial Profiling Advisory Committee, and the Minnesota Police and Peace Officers Association in developing an antiracial profiling model policy governing the conduct of peace officers engaged in stops of citizens. This policy shall define racial profiling and identify conduct that violates the law. The policy must also include a duty to give the officer's name or badge number and identify the officer's department during routine traffic stops.\n(b) The board shall adopt a model policy and distribute the model policy to all chief law enforcement officers by August 1, 2001.\n(a) By November 1, 2001, the chief law enforcement officer of every state and local law enforcement agency must establish and enforce a written antiracial profiling policy governing the conduct of peace officers engaged in stops of citizens. The chief law enforcement officer shall ensure that each peace officer receives a copy of the agency's antiracial profiling policy. The chief law enforcement officer also must ensure that each peace officer is aware of the policy's purpose and the conduct prohibited by it.\n(b) The policy must, at a minimum, comply with the requirements of the model policy adopted by the board under subdivision 3.\n(c) Every state and local law enforcement agency must certify to the board that it has adopted a written policy in compliance with the board's model policy.\n(d) The board shall assist the chief law enforcement officer of each state and local law enforcement agency in developing and implementing antiracial profiling policies under this subdivision.\n(a) By August 1, 2001, the board shall prepare learning objectives for preservice training to instruct peace officers in avoiding racial profiling when making stops of citizens. These learning objectives shall be included in the required curriculum of professional peace officer education programs.\n(b) An individual is not eligible to take the peace officer licensing examination or the part-time peace officer licensing examination on or after June 1, 2002, unless:\n(1) the individual has received the training described in paragraph (a); and\n(2) the individual has completed a psychological evaluation demonstrating that the individual is not likely to engage in racial profiling.\nBy August 1, 2001, the board shall prepare learning objectives for in-service training to instruct peace officers in avoiding racial profiling when making stops of citizens. The board shall evaluate and monitor in-service training courses to ensure they satisfy the learning objectives.\nThe executive director of the Board of Peace Officer Standards and Training shall prepare training materials to provide chief law enforcement officers and other peace officers with supervisory authority with information on how to detect and respond to racial profiling by peace officers under their command. The training materials must address both the agency's antiracial profiling policy and procedural components aimed at eliminating racial profiling in stops of citizens. The materials must include information on federal and state constitutional and statutory laws prohibiting discrimination by law enforcement. The procedural information must describe conduct that is unlawful or inappropriate and present guidelines for reinforcing techniques that are lawful and appropriate. The procedural information shall discuss appropriate search and seizure and interviewing techniques.\nThe board has authority to inspect state and local agency policies to ensure compliance with subdivision 4. The board may conduct this inspection based upon a complaint it receives about a particular agency or through a random selection process.",
	"repealed": false
}