{
	"id": "136F.302",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.302",
	"title": "136F.302 REGULATING THE ASSIGNMENT OF STUDENTS TO REMEDIAL COURSES.",
	"text": "(a) A state college or university must not require an individual to take a remedial, noncredit course in a subject area if the individual has received a college ready ACT or SAT score or met a career and college ready Minnesota Comprehensive Assessment benchmark in that subject area. Only the ACT and SAT scores an individual received and the Minnesota Comprehensive Assessment benchmarks an individual met in the previous five years are valid for purposes of this section. Each state college and university must post notice of the exemption from remedial course taking on its website explaining student course placement requirements.\n(b) When deciding if an individual is admitted to or if an individual may enroll in a state college or university, the state college or university must consider the individual's scores on the high school Minnesota Comprehensive Assessments, in addition to other factors determined relevant by the college or university.\n(a) A state college or university must not require an individual to take a remedial, noncredit course in a subject area if the individual has received a career and college ready Minnesota Comprehensive Assessment benchmark in that subject area, consistent with benchmarks established by the commissioner of education pursuant to section 120B.305, subdivision 2, paragraph (b).\n(b) As part of the notification of high school students and their families under section 120B.305, subdivision 2, paragraph (b), the commissioner shall include a statement that students who receive a college ready benchmark on the high school MCA are not required to take a remedial, noncredit course at a Minnesota state college or university in the corresponding subject area.\nA college or university testing process used to determine whether an individual is placed in a remedial, noncredit course must comply with this subdivision. Prior to taking a test, an individual must be given reasonable time and opportunity to review materials provided by the college or university covering the material to be tested which must include a sample test. An individual who is required to take a remedial, noncredit course as a result of a test given by a college or university must be given an opportunity to retake the test at the earliest time determined by the individual when testing is otherwise offered. The college or university must provide an individual with study materials for the purpose of retaking and passing the test.",
	"repealed": false
}