{
	"id": "524.2-215",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-215",
	"title": "524.2-215 SURVIVING SPOUSE RECEIVING MEDICAL ASSISTANCE.",
	"text": "(a) Notwithstanding any law to the contrary, if a surviving spouse is receiving medical assistance under chapter 256B, when the person's spouse dies, then the provisions in paragraphs (b) to (f) apply.\n(b) Any time before an order or decree is entered under section 524.3-1001 or 524.3-1002 or a closing statement is filed under section 524.3-1003 the surviving spouse may:\n(1) exercise the right to take an elective share amount of the decedent's estate under section 524.2-211, in which case the decedent's nonprobate transfers to others shall be included in the augmented estate for purposes of computing the elective share and supplemental elective share amounts;\n(2) petition the court for an extension of time for exercising the right to an elective share amount under section 524.2-211, in which case the decedent's nonprobate transfers to others shall be included in the augmented estate for purposes of computing the elective share and supplemental elective share amounts; or\n(3) elect statutory rights in the homestead or petition the court for an extension of time to make the election as provided in section 524.2-211, paragraph (f).\n(c) Notwithstanding any law or rule to the contrary, the personal representative of the estate of the surviving spouse may exercise the surviving spouse's right of election and statutory right to the homestead in the manner provided for making those elections or petition for an extension of time as provided for in this section.\n(d) If choosing the elective share will result in the surviving spouse receiving a share of the decedent's estate greater in value than the share of the estate under the will or intestate succession, then the guardian or conservator for the surviving spouse shall exercise the surviving spouse's right to an elective share amount and a court order is not required.\n(e) A party petitioning to establish a guardianship or conservatorship for the surviving spouse may file a certified copy of the petition in the decedent's estate proceedings and serve a copy of the petition on the personal representative or the personal representative's attorney. The filing of the petition shall toll all of the limitations provided in this section until the entry of a final order granting or denying the petition. The decedent's estate may not close until the entry of a final order granting or denying the petition.\n(1) Distributees of the decedent's estate shall be personally liable to account for and turn over to the ward, the conservatee, or the estate of the ward or conservatee any and all amounts which the ward or conservatee is entitled to receive from the decedent's estate.\n(2) No distributee shall be liable for an amount in excess of the value of the distributee's distribution as of the time of the distribution.\n(3) The ward, conservatee, guardian, conservator, or personal representative may bring proceedings in district court to enforce the rights in this section.\n(f) Notwithstanding any oral or written contract, agreement, or waiver made by the surviving spouse to waive in whole or in part the surviving spouse's right of election against the decedent's will, statutory right to the homestead, exempt property, or family allowance, the surviving spouse or the surviving spouse's guardian or conservator may exercise these rights to the full extent permitted by law. The surviving spouse's rights under this paragraph do not apply to the extent there is a valid antenuptial agreement between the surviving spouse and the decedent under which the surviving spouse has waived some or all of these rights.",
	"repealed": false
}