{
	"id": "62C.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/62C.14",
	"title": "62C.14 SUBSCRIBER CONTRACTS.",
	"text": "A service plan corporation shall deliver to every subscriber, except those covered as a spouse or dependent of another subscriber, a copy of the subscriber's contract or a certificate evidencing that the subscriber is covered by a group subscriber's contract.\nThe subscriber's contract shall state in a clear and understandable manner all health services to be provided, in whole or in part, to the subscriber and all terms, conditions, limitations and exceptions under which the services shall be provided or paid for, including any provisions for coordination of benefits or subrogation, and including any provisions or conditions under which services from participating providers are not covered.\nNothing in a subscriber's contract shall deny the subscriber free choice of the provider within a particular class of providers who is to treat the subscriber, and there shall be no interference with a provider-subscriber relationship.\nExcept for group contracts or certificates, a subscriber's contract or other writing furnished with the contract, shall state the periodic subscription charge, the effective date, the expiration date or period of renewal, and the terms upon which the contract may be terminated, canceled, continued, or renewed.\nA subscriber's individual contract or any group contract delivered or issued for delivery in this state and providing that coverage of a dependent child of the subscriber or a dependent child of a covered group member shall terminate upon attainment of a specified limiting age as defined in section 62Q.01, subdivision 2a, shall also provide in substance that attainment of that age shall not terminate coverage while the child is (a) incapable of self-sustaining employment by reason of developmental disability, mental illness or disorder, or physical disability, and (b) chiefly dependent upon the subscriber or employee for support and maintenance, provided proof of incapacity and dependency is furnished by the subscriber within 31 days of attainment of the limiting age as defined in section 62Q.01, subdivision 2a, and subsequently as required by the corporation, but not more frequently than annually after a two-year period following attainment of the age. Any notice regarding termination of coverage due to attainment of the limiting age must include information about this provision.\nAny group subscriber's contract delivered or issued for delivery or renewed in this state after August 1, 1973, shall provide the same coverage for maternity benefits to unmarried women and minor female dependents as that provided for married women. If an unmarried subscriber is a parent of a dependent child, each group subscriber's contract delivered or issued for delivery or renewed after July 1, 1976, shall, if the subscriber chooses family coverage, provide the same coverage for that child as that provided for the child of any other subscriber choosing dependent family coverage. Any group contracting for a group subscriber's contract may request that the coverage required by this section be omitted.\nAn individual subscriber's contract delivered or issued for delivery in this state shall provide the same coverage for maternity benefits to unmarried women and minor female dependents as that provided for married women. If an unmarried subscriber is a parent of a dependent child, each subscriber's individual contract delivered or issued for delivery or renewed after July 1, 1975, shall, if the subscriber chooses dependent family coverage, provide the same coverage for that child as that provided for the child of any other subscriber choosing dependent family coverage.\nThe provisions of subdivision 5a shall apply to all health maintenance organizations regulated under any health maintenance organization enabling act enacted in 1973.\nA subscriber's contract or certificate shall state that it and all riders and endorsements, together with any application if signed by the subscriber, identification issued, and the applicable benefit schedules on file at the home office of the corporation and with the commissioner, shall constitute the entire contract between the corporation and the subscriber.\nNo subscriber's contract shall provide for the payment of any cash or other material benefit to the subscriber or the subscriber's estate on account of death, illness or injury, provided that a subscriber's contract may provide for the payment for services rendered by a nonparticipating provider to the extent such services are covered by the contract. In the event that the subscriber compensates the provider for services received the subscriber is subrogated to the provider's right against the service plan.\nEvery subscriber's contract or certificate shall provide in substance that the subscriber has no personal liability to the participating provider rendering health services, except for those services or parts of service not covered by the subscriber's contract.\nNo service plan corporation shall deliver or issue for delivery in this state any subscriber contract, endorsement, rider, amendment or application until a copy of the form thereof has been filed with the commissioner, subject to disapproval by the commissioner. Any such form issued or in use on August 1, 1971, if filed with the commissioner within 60 days after August 1, 1971, shall be deemed filed upon receipt by the commissioner. When an insurer, service plan corporation, or the Minnesota Comprehensive Health Association fails to respond to an objection or inquiry within 60 days, the filing is automatically disapproved. A resubmission is required if action by the Department of Commerce is subsequently requested. An additional filing fee is required for the resubmission. The commissioner also may by regulation exempt from filing those subscriber contracts issued to a group of not less than 300 subscribers, or to other groups upon such reasonable conditions and restrictions as the commissioner may require.\nExcept as otherwise provided in subdivision 9, all forms received by the commissioner shall be deemed filed 60 days after received unless disapproved by order transmitted to the corporation stating that the form used in a specified respect is contrary to law, contains a provision or provisions which are unfair, inequitable, misleading, inconsistent or ambiguous, or is in part illegible. It shall be unlawful to issue or use a document disapproved by the commissioner. When an insurer, service plan corporation, or the Minnesota Comprehensive Health Association fails to respond to an objection or inquiry within 60 days, the filing is automatically disapproved. A resubmission is required if action by the Department of Commerce is subsequently requested. An additional filing fee is required for the resubmission.\nAn order of disapproval shall state that a hearing will be granted within 20 days upon written request. The commissioner shall conduct the hearing within 20 days after receipt of the request and shall give not less than ten days' written notice of the time and place and matters to be considered. Within 15 days after the hearing, the commissioner shall affirm, reverse, or modify the previous action in writing, specifying the reasons therefor. Pending the hearing and decision thereon, the commissioner may postpone the effective date of previous action.\nAn order or decision of the commissioner under this section shall be subject to appeal in accordance with chapter 14.\nAll subscriber's contracts covering subscribers in this state shall be deemed to have been made in this state and shall be construed pursuant to Minnesota law when the position or rights of a Minnesota subscriber or covered group member are at issue. It shall be unlawful for any service plan corporation to solicit or make any subscriber contract in violation of the provisions of Laws 1971, chapter 568.\nNo subscriber's individual contract or any group contract which provides for coverage of family members or other dependents of a subscriber or of an employee or other group member of a group subscriber, shall be renewed, delivered, or issued for delivery in this state unless such contract includes as covered family members or dependents any newborn infants immediately from the moment of birth and thereafter which insurance shall provide coverage for illness, injury, congenital malformation or premature birth. The coverage described in this subdivision includes coverage of cleft lip and cleft palate to the same extent provided in section 62A.042, subdivisions 1, paragraph (b); and 2, paragraph (b). For purposes of this paragraph, \"newborn infants\" includes grandchildren who are financially dependent upon a covered grandparent and who reside with that covered grandparent continuously from birth. No policy, contract, or agreement covered by this section may require notification to a health carrier as a condition for this dependent coverage. However, if the policy, contract, or agreement mandates an additional premium for each dependent, the health carrier shall be entitled to all premiums that would have been collected had the health carrier been aware of the additional dependent. The health carrier may withhold payment of any health benefits for the new dependent until it has been compensated with the applicable premium which would have been owed if the health carrier had been informed of the additional dependent immediately.\nNo subscriber's individual contract or any group contract which provides for coverage of family members or dependents of a subscriber or of an employee or other group member of a group subscriber, entered into, issued, amended, renewed or delivered in this state on or after January 1, 1976 shall contain any provision offsetting, or in any other manner reducing, any benefit under the service plan by the amount of, or in proportion to, any increase in disability benefits received or receivable under the federal Social Security Act, as amended subsequent to the date of commencement of such benefit.",
	"repealed": false
}