{
	"id": "80A.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.50",
	"title": "80A.50 SECTION 302; FEDERAL COVERED SECURITIES; SMALL CORPORATE OFFERING REGISTRATION.",
	"text": "(a) Federal covered securities.\n(1) Required filing of records. With respect to a federal covered security, as defined in Section 18(b)(2) of the Securities Act of 1933 (15 U.S.C. Section 77r(b)(2)), that is not otherwise exempt under sections 80A.45 through 80A.47, a rule adopted or order issued under this chapter may require the filing of any or all of the following records:\n(A) before the initial offer of a federal covered security in this state, all records that are part of a federal registration statement filed with the Securities and Exchange Commission under the Securities Act of 1933 and a consent to service of process complying with section 80A.88 signed by the issuer;\n(B) after the initial offer of the federal covered security in this state, all records that are part of an amendment to a federal registration statement filed with the Securities and Exchange Commission under the Securities Act of 1933; and\n(C) to the extent necessary or appropriate to compute fees, a report of the value of the federal covered securities sold or offered to persons present in this state, if the sales data are not included in records filed with the Securities and Exchange Commission.\n(2) Notice filing effectiveness and renewal. A notice filing under subsection (a) is effective for one year commencing on the later of the notice filing or the effectiveness of the offering filed with the Securities and Exchange Commission. On or before expiration, the issuer may renew a notice filing by filing a copy of those records filed by the issuer with the Securities and Exchange Commission that are required by rule or order under this chapter to be filed. A previously filed consent to service of process complying with section 80A.88 may be incorporated by reference in a renewal. A renewed notice filing becomes effective upon the expiration of the filing being renewed.\n(3) Notice filings for federal covered securities under section 18(b)(4)(D). With respect to a security that is a federal covered security under Section 18(b)(4)(D) of the Securities Act of 1933 (15 U.S.C. Section 77r(b)(4)(D)), a rule under this chapter may require a notice filing by or on behalf of an issuer to include a copy of Form D, including the Appendix, as promulgated by the Securities and Exchange Commission, and a consent to service of process complying with section 80A.88 signed by the issuer not later than 15 days after the first sale of the federal covered security in this state.\n(4) Stop orders. Except with respect to a federal security under Section 18(b)(1) of the Securities Act of 1933 (15 U.S.C. Section 77r(b)(1)), if the administrator finds that there is a failure to comply with a notice or fee requirement of this section, the administrator may issue a stop order suspending the offer and sale of a federal covered security in this state. If the deficiency is corrected, the stop order is void as of the time of its issuance and no penalty may be imposed by the administrator.\n(b) Small corporation offering registration.\n(1) Registration required. A security meeting the conditions set forth in this section may be registered as set forth in this section.\n(2) Availability. Registration under this section is available only to the issuer of securities and not to an affiliate of the issuer or to any other person for resale of the issuer's securities. The issuer must be organized under the laws of one of the states or possessions of the United States. The securities offered must be exempt from registration under the Securities Act of 1933 pursuant to Rule 504 of Regulation D (15 U.S.C. Section 77c).\n(3) Disqualification. Registration under this section is not available to any of the following issuers:\n(A) an issuer subject to the reporting requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934;\n(B) an investment company;\n(C) a development stage company that either has no specific business plan or purpose or has indicated that its business plan is to engage in a merger or acquisition with an unidentified company or companies or other entity or person;\n(D) an issuer if the issuer or any of its predecessors, officers, directors, governors, partners, ten percent stock or equity holders, promoters, or any selling agents of the securities to be offered, or any officer, director, governor, or partner of the selling agent:\n(i) has filed a registration statement that is the subject of a currently effective registration stop order entered under a federal or state securities law within five years before the filing of the small corporate offering registration application;\n(ii) has been convicted within five years before the filing of the small corporate offering registration application of a felony or misdemeanor in connection with the offer, purchase, or sale of a security or a felony involving fraud or deceit, including, but not limited to, forgery, embezzlement, obtaining money under false pretenses, larceny, or conspiracy to defraud;\n(iii) is currently subject to a state administrative enforcement order or judgment entered by a state securities administrator or the Securities and Exchange Commission within five years before the filing of the small corporate offering registration application, or is subject to a federal or state administrative enforcement order or judgment in which fraud or deceit, including, but not limited to, making untrue statements of material facts or omitting to state material facts, was found and the order or judgment was entered within five years before the filing of the small corporate offering registration application;\n(iv) is currently subject to an order, judgment, or decree of a court of competent jurisdiction temporarily restraining or enjoining, or is subject to an order, judgment, or decree of a court of competent jurisdiction permanently restraining or enjoining the party from engaging in or continuing any conduct or practice in connection with the purchase or sale of any security or involving the making of a false filing with a state or with the Securities and Exchange Commission entered within five years before the filing of the small corporate offering registration application; or\n(v) is subject to a state's administrative enforcement order, or judgment that prohibits, denies, or revokes the use of an exemption for registration in connection with the offer, purchase, or sale of securities,\n(I) except that clauses (i) to (iv) do not apply if the person subject to the disqualification is duly licensed or registered to conduct securities-related business in the state in which the administrative order or judgment was entered against the person or if the dealer employing the party is licensed or registered in this state and the form BD filed in this state discloses the order, conviction, judgment, or decree relating to the person, and\n(II) except that the disqualification under this subdivision is automatically waived if the state securities administrator or federal agency that created the basis for disqualification determines upon a showing of good cause that it is not necessary under the circumstances to deny the registration.\n(4) Filing and effectiveness of registration statement. A small corporate offering registration statement must be filed with the administrator. If no stop order is in effect and no proceeding is pending under section 80A.54, such registration statement shall become effective automatically at the close of business on the 20th day after filing of the registration statement or the last amendment of the registration statement or at such earlier time as the administrator may designate by rule or order. For the purposes of a nonissuer transaction, other than by an affiliate of the issuer, all outstanding securities of the same class identified in the small corporate offering registration statement as a security registered under this chapter are considered to be registered while the small corporate offering registration statement is effective. A small corporate offering registration statement is effective for one year after its effective date or for any longer period designated in an order under this chapter. A small corporate offering registration statement may be withdrawn only with the approval of the administrator.\n(5) Contents of registration statement. A small corporate offering registration statement under this section shall be on Form U-7, including exhibits required by the instructions thereto, as adopted by the North American Securities Administrators Association, or such alternative form as may be designated by the administrator by rule or order and must include:\n(A) a consent to service of process complying with section 80A.88;\n(B) a statement of the type and amount of securities to be offered and the amount of securities to be offered in this state;\n(C) a specimen or copy of the security being registered, unless the security is uncertificated, a copy of the issuer's articles of incorporation and bylaws or their substantial equivalents in effect, and a copy of any indenture or other instrument covering the security to be registered;\n(D) a signed or conformed copy of an opinion of counsel concerning the legality of the securities being registered which states whether the securities, when sold, will be validly issued, fully paid, and nonassessable and, if debt securities, binding obligations of the issuer;\n(E) the states (i) in which the securities are proposed to be offered; (ii) in which a registration statement or similar filing has been made in connection with the offering including information as to effectiveness of each such filing; and (iii) in which a stop order or similar proceeding has been entered or in which proceedings or actions seeking such an order are pending;\n(F) a copy of the offering document proposed to be delivered to offerees; and\n(G) a copy of any other pamphlet, circular, form letter, advertisement, or other sales literature intended as of the effective date to be used in connection with the offering and any solicitation of interest used in compliance with section 80A.46(17)(B).\n(6) Copy to purchaser. A copy of the offering document as filed with the administrator must be delivered to each person purchasing the securities prior to sale of the securities to such person.\n(c) Offering limit. Offers and sales of securities under a small corporate offering registration as set forth in this section are allowed up to the limit prescribed by Code of Federal Regulations, title 17, part 230.504 (b)(2), as amended.\n(d) Regulation A - Tier 2 filing requirements.\n(1) Initial filing. An issuer planning to offer and sell securities in Minnesota in an offering exempt under Tier 2 of federal Regulation A must, at least 21 calendar days before the date of the initial sale of securities in Minnesota, submit to the administrator:\n(A) a completed Regulation A - Tier 2 offering notice filing form or copies of all the documents filed with the Securities Exchange Commission; and\n(B) a consent to service of process on Form U-2, if consent to service of process is not provided in the Regulation A - Tier 2 offering notice filing form.\nThe initial notice filing made in Minnesota is effective for 12 months after the date the filing is made.\n(2) Renewal. For each additional 12-month period in which the same offering is continued, an issuer conducting a Tier 2 offering under federal Regulation A may renew the notice filing by filing (i) the Regulation A - Tier 2 offering notice filing form marked \"renewal,\" or (ii) a cover letter or other document requesting renewal. The renewal filing must be made on or before the date notice filing expires.\n(3) Amendment. An issuer may increase the amount of securities offered in Minnesota by submitting a Regulation A - Tier 2 offering notice filing form or other document describing the transaction.",
	"repealed": false
}