{
	"id": "327.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/327.64",
	"title": "327.64 NOTICE OF DEFAULT; SERVICE.",
	"text": "When a default occurs under the terms of a security agreement covering a manufactured home as collateral, and the secured party desires to repossess the manufactured home, the secured party shall commence the repossession in a manner authorized by this section.\n(a) A secured party may commence repossession of a manufactured home by personally serving upon, or by sending by certified or registered United States mail and concurrently sending a copy of the notice by first class mail to, the occupant of the manufactured home a notice and, if the occupant is not the debtor, by sending a registered or certified letter to the last known address of the debtor under the security agreement, both setting forth the circumstances constituting the default under the security agreement and stating that the secured party will at the expiration of a 30-day period following receipt of the notice seek a court order removing the occupant from the manufactured home and repossessing the manufactured home, unless the debtor or the occupant acting on behalf of the debtor cures the default prior to that time and in the manner provided by section 327.66. If notice is mailed to a debtor in accordance with this subdivision, the secured party by affidavit shall set forth the circumstances causing the secured party to believe that the debtor could be reached at the address to which the notice was mailed. The affidavit shall state that the secured party has no reliable information causing the secured party to conclude that the debtor might receive mailed notice at another address.\n(b) The notice must state: \"Your loan is currently in default. Contact us immediately at [insert phone number] to discuss possible options for preventing repossession. We encourage you to seek assistance from the foreclosure prevention counseling program in your area. Nearby community agencies will answer your questions, offer free advice, and help you create a plan. You can contact the Minnesota Home Ownership Center at (866) 462-6466 or www.hocmn.org to get the phone number and location of the nearest foreclosure prevention organization. Call today. Waiting limits your options. IF YOU DO NOT BECOME CURRENT ON YOUR LOAN WITHIN 30 DAYS, WE WILL SEEK A COURT ORDER REPOSSESSING THE HOME, AND BY COURT ORDER YOU WILL HAVE TO VACATE THE HOME.\"\n(c) If the debtor does not sign for the registered or certified letter containing the notice within seven calendar days of the first attempted delivery, the secured party may proceed with all permissible actions provided in statute as though the debtor's signature has been secured.",
	"repealed": false
}