{
	"id": "353.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.665",
	"title": "353.665 MERGER OF CERTAIN CONSOLIDATION ACCOUNTS INTO PERA-P&F.",
	"text": "(a) This section applies to the local police and fire relief associations or consolidation accounts that merged with the public employees police and fire plan and fund and are specified in paragraph (b).\n(b) The former local police or fire relief associations or consolidation accounts are:\n(1) the former local police and fire consolidation accounts that merged with the public employees police and fire retirement plan and fund under Laws 1999, chapter 222, article 4;\n(2) the former Minneapolis Firefighters Relief Association;\n(3) the former Minneapolis Police Relief Association;\n(4) the former Fairmont Police Relief Association; and\n(5) the former Virginia Fire Consolidation Account.\n[Repealed, 2013 c 111 art 5 s 81]\n[Repealed, 2013 c 111 art 5 s 81]\n[Repealed, 2013 c 111 art 5 s 81]\n(a) Except as provided in paragraph (b), (e), or (f), the annuity, service pension, disability pension or benefit, or survivor benefit attributable to or of a former member of a former merged local police or fire consolidation account who did not elect coverage by all or a portion of the public employees police and fire retirement plan as permitted by applicable law must be calculated or computed under the benefit plan provisions of the applicable former local police or paid firefighters relief association.\n(b) The annuity, service pension, disability pension or benefit, or survivor benefit attributable to or of a former member of the former Minneapolis Firefighters Relief Association or of the former Minneapolis Police Relief Association who had that status as of December 29, 2011, continue after consolidation in the same amount and under the same terms as provided in chapter 423B or 423C, respectively, and the bylaws in effect as of that date, except that the unit value is governed by section 353.01, subdivisions 10a and 10b, respectively, and the postretirement adjustments after December 31, 2015, must be calculated solely under section 353.6511, subdivision 7.\n(c) On behalf of former members of the Minneapolis Firefighters Relief Association or Minneapolis Police Relief Association, the executive director shall withhold any health insurance or dental insurance premiums designated by the annuitant or benefit recipient and shall transfer them to the city of Minneapolis. The Public Employees Retirement Association may charge a necessary and reasonable monthly administrative fee to the city of Minneapolis for this function and bill it in addition to the employer contribution under section 353.65, subdivision 3, paragraph (b). Notwithstanding any provision of chapter 13 to the contrary, the executive director shall provide the city of Minneapolis with the current addresses of former members of the Minneapolis Firefighters Relief Association and the Minneapolis Police Relief Association. The city of Minneapolis shall continue to administer the health and dental insurance programs as constituted May 1, 2011, for the former members of the former Minneapolis relief associations.\n(d) The executive director shall cooperate with the Minneapolis Firefighters Fraternal Association and the Minneapolis Police Fraternal Association to ensure adequate communications with the former members of the former Minneapolis Firefighters Relief Association or the Minneapolis Police Relief Association consistent with Public Employees Retirement Association policy.\n(e) The annuity, service pension, disability pension or benefit, or survivor benefit attributable to or of a former member of the former Fairmont Police Relief Association must be calculated or computed under Minnesota Statutes 2000, sections 423.41 to 423.46, 423.48 to 423.59, 423.61, and 423.62; Laws 1963, chapter 423; Laws 1977, chapter 100; and Laws 1999, chapter 222, article 3, section 4, except that the annual base salary figure for pension and benefit determinations upon consolidation and for the balance of calendar year 2012 is $106,666.67 and after December 31, 2012, annual postretirement adjustments of pensions and benefits in force must be calculated solely under section 356.415, subdivision 1c.\n(f) The annuity, service pension, disability pension or benefit, or survivor benefit attributable to or of a former member of the former Virginia firefighters consolidation account must be calculated or computed under the election made under Minnesota Statutes 2012, section 353A.08, unless the person made a subsequent election under Minnesota Statutes 2012, section 353.6691, subdivision 4, subject to any additional ad hoc postretirement adjustment under Minnesota Statutes 2012, section 353.6691, subdivision 5, paragraph (d).\n(a) Health insurance account retention. The health insurance account of the former Minneapolis Firefighters Relief Association and the health insurance account of the former Minneapolis Police Relief Association shall remain with the financial institution holding the applicable account on July 1, 2013, if the applicable financial institution adequately performs all trustee and fiduciary duties with respect to the applicable account as a condition of the retention of the account.\n(b) Health insurance account administrative expenses. Under Laws 2011, First Special Session chapter 8, article 6, section 14, and article 7, section 14, three years of expected administrative expenses were prepaid from the Minneapolis Firefighters Relief Association and the Minneapolis Police Relief Association health insurance accounts to the financial institution holding the applicable account. After the three-year prepayment period, the beneficiaries of the applicable account are responsible for the payment of administrative expenses related to the operation of the account.\n(c) Successor in interest. The public employees police and fire retirement plan and fund is the successor in interest to all claims for or against the former Minneapolis Firefighters Relief Association and the former Minneapolis Police Relief Association. The public employees police and fire retirement plan and fund is not liable for any claim against a former Minneapolis relief association, its governing board, or its administrative staff acting in a fiduciary capacity, under chapter 356A or common law, which is founded upon a claim of a breach of fiduciary duty if the act or acts constituting the claimed breach were not undertaken in good faith. The public employees police and fire retirement plan may assert any applicable defense to any claim in any judicial or administrative proceeding that the applicable Minneapolis relief association, its board, or its administrative staff would otherwise have been entitled to assert, and the public employees police and fire retirement plan may assert any applicable defense that it has in its capacity as a statewide agency.\n(d) Indemnification. The Public Employees Retirement Association shall indemnify any former fiduciary of the Minneapolis relief associations consistent with the provisions of section 356A.11. The indemnification may be effected by the purchase by the Public Employees Retirement Association of reasonable fiduciary liability tail insurance for the officers and directors of the former Minneapolis relief association.\n[Repealed, 2013 c 111 art 5 s 81]\n[Repealed, 2013 c 111 art 5 s 81]\n(a) Except as provided in paragraph (b), (c), or (d), the employee contribution rate for merged former consolidation account active members is the rate specified in section 353.65, subdivision 2, and the regular municipal contribution rate on behalf of merged former consolidation account active members is the rate specified in section 353.65, subdivision 3.\n(b) With respect to active members of the merged former Minneapolis Firefighters Relief Association and the merged former Minneapolis Police Relief Association, there are no employee contributions payable and the employer contribution on behalf of those active members is at the rate specified in section 353.65, subdivision 3, applied to the active member's salary.\n(c) If there are assets of the former Fairmont Police Relief Association in excess of the present value of future benefits as of June 29, 2012, these assets must be credited to an interest-bearing suspense account within the public employees police and fire retirement fund, must be used to offset any amount payable under paragraph (a) until June 30, 2015, and, after June 30, 2015, must be paid to the city of Fairmont. The suspense account must be credited with the same rate of investment return as the public employees police and fire retirement fund. If, after June 29, 2012, the investment return actuarial assumption applicable to the public employees police and fire retirement plan under section 356.215, subdivision 8, is modified from the rates specified in Minnesota Statutes 2010, section 356.215, subdivision 8, the remainder present value of future benefits amount calculation under paragraph (a), updated for the passage of time, must be revised and the amortization contribution by the city of Fairmont for the balance of the amortization period must be redetermined by the actuary retained under section 356.214 and certified by the executive director to the city of Fairmont.\n(d) If there was a remainder present value of future benefits amounts under Minnesota Statutes 2012, section 353.6691, subdivision 5, paragraph (a), the city of Virginia shall pay an additional municipal contribution annually on or before December 31 sufficient to amortize on a level annual dollar basis by December 31, 2020, that remainder present value of future benefits amounts of the former Virginia fire department consolidation account. If, after June 29, 2012, the investment return actuarial assumption applicable to the public employees police and fire retirement plan under section 356.215, subdivision 8, is modified from the rates specified in Minnesota Statutes 2010, section 356.215, subdivision 8, the remainder present value of future benefits amount calculation under paragraph (a), updated for the passage of time, must be revised and any amortization contribution by the city of Virginia for the balance of the amortization period must be redetermined by the actuary retained under section 356.214 and certified by the executive director to the city of Virginia.\n(a) Until July 15, 2018, the city of Minneapolis shall make a contribution annually to the public employees police and fire retirement plan on July 15, set at the amount calculated as of December 30, 2011, as sufficient to amortize, on a level annual dollar basis by December 31, 2031, the unfunded present value figure calculated as required by Minnesota Statutes 2012, sections 353.667, subdivision 6, paragraph (a), and 353.668, subdivision 6, paragraph (a).\n(b) Beginning July 15, 2019, and every July 15 thereafter until and including July 15, 2031, the city of Minneapolis shall make a contribution annually to the public employees police and fire retirement plan equal to $3,188,735, attributable to the former Minneapolis Firefighters Relief Association, and $4,489,837, attributable to the former Minneapolis Police Relief Association.\n[Repealed, 2013 c 111 art 5 s 81]\n[Repealed, 2013 c 111 art 5 s 81]",
	"repealed": false
}