{
	"id": "168B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/168B.07",
	"title": "168B.07 RIGHT TO RECLAIM.",
	"text": "Except as provided in this subdivision, the owner or any lienholder of an impounded vehicle must have a right to reclaim such vehicle from the unit of government or impound lot operator taking it into custody upon payment of all charges for towing and recovery of the vehicle and cargo, storage of the vehicle and cargo, and accident site cleanup resulting from taking the vehicle and cargo into custody within 15 or 45 days, as applicable under section 168B.051, subdivision 1, 1a, or 2, after the date of the notice required by section 168B.06. The registered owner of a vehicle who is homeless or receives relief based on need, as defined in subdivision 3, is not liable for charges for recovery of cargo, storage of cargo, or accident site cleanup unless the costs are covered by the owner's motor vehicle insurance. For purposes of this subdivision, \"cargo\" means commercial goods or private property being transported by motor vehicle, as defined in section 168A.01, subdivision 24, or trailer, as defined in section 168.002, subdivision 35.\nNothing in sections 168B.01 to 168B.101 shall be construed to impair any lien of a garagekeeper under the laws of this state, or the right of a lienholder to foreclose. For the purposes of this section \"garagekeeper\" is an operator of a parking place or establishment, an operator of a motor vehicle storage facility, or an operator of an establishment for the servicing, repair, or maintenance of motor vehicles.\n(a) For purposes of this subdivision:\n(1) \"contents\" does not include any permanently affixed mechanical or nonmechanical automobile parts; automobile body parts; or automobile accessories, including audio or video players; and\n(2) \"relief based on need\" includes, but is not limited to, receipt of MFIP, medical assistance, general assistance, emergency general assistance, Minnesota supplemental aid, MSA-emergency assistance, MinnesotaCare, Supplemental Security Income, energy assistance, emergency assistance, Supplemental Nutrition Assistance Program (SNAP) benefits, earned income tax credit, or Minnesota working family tax credit.\n(b) A unit of government or impound lot operator must establish reasonable procedures for retrieval of vehicle contents, and may establish reasonable procedures to protect the safety and security of the impound lot and its personnel.\n(c) At any time before the expiration of the waiting periods provided in section 168B.051, a registered owner of a vehicle who provides proof of identity that includes photographic identification and documentation from a government or nonprofit agency or legal aid office that the registered owner is homeless, receives relief based on need, or is eligible for legal aid services, has the unencumbered right to retrieve any and all contents without charge and regardless of whether the registered owner pays incurred charges or fees, transfers title, or reclaims the vehicle. A refusal by the impound lot operator to allow the registered owner to retrieve the vehicle contents after the owner provides valid documentation is a violation of this paragraph.\n(d) An impound lot operator may make copies of the documents presented by the registered owner under paragraph (c), and the impound lot operator must return all of the original documents to the registered owner immediately after copying them.\n[See Note.]\nAn impound lot operator must allow any registered vehicle owner to retrieve, or must retrieve for the vehicle owner, the following from the impounded vehicle: proof of identification; prescription medicine; and durable medical equipment, including but not limited to wheelchairs, prosthetics, canes, crutches, walkers, and external braces.\n(a) This subdivision applies to an impound lot operator (1) who operates a nonpublic impound lot, or (2) with which a unit of government exclusively contracts to operate an impound lot solely for public use under section 168B.09.\n(b) An impound lot operator who denies a request of a registered vehicle owner to retrieve vehicle contents after the registered owner presents documentation pursuant to subdivision 3, paragraph (c), must, at the time of denial, provide the registered owner with a written statement that identifies the specific reasons for the denial.\n(a) This subdivision applies to an impound lot operator (1) who operates a nonpublic impound lot, or (2) with which a unit of government exclusively contracts to operate an impound lot solely for public use under section 168B.09.\n(b) An impound lot operator must post a conspicuous notice at its place of operation in the following form:\n\"If you receive government benefits, are currently homeless, or are eligible for legal aid services, you have the right to get the contents out of your car free of charge IF you provide:\n(1) a photo ID (such as a driver's license, passport, or employer ID); AND\n(2) documentation from a government or nonprofit agency or from a legal aid office that shows you get benefits from a government program based on your income, you are homeless, or you are eligible for legal aid services. Examples of this documentation include BUT ARE NOT LIMITED TO:\n- an EBT card;\n- a Medical Assistance or MinnesotaCare card;\n- a Supplemental Nutrition Assistance Program (SNAP) card; and\n- a letter, email, or other document from a government agency, nonprofit organization, or legal aid organization showing that you get benefits from a government program based on your income, you are homeless, or you are eligible for legal aid services.\"\n(a) This subdivision applies to an impound lot operator (1) who operates a nonpublic impound lot, or (2) with which a unit of government exclusively contracts to operate an impound lot solely for public use under section 168B.09.\n(b) If an impound lot operator denies the registered owner the right to retrieve the vehicle contents in violation of subdivision 3, paragraph (c), an aggrieved registered vehicle owner has a cause of action against the impound lot operator as provided in this subdivision.\n(c) If the vehicle and its contents remain in the possession of the impound lot operator and retrieval of the vehicle contents was denied in violation of subdivision 3, paragraph (c), an aggrieved registered vehicle owner is entitled to injunctive relief to retrieve the vehicle contents as well as reasonable attorney fees and costs.\n(d) If an impound lot operator sells or disposes of the vehicle contents after the registered owner has provided the documentation required under subdivision 3, paragraph (c), an aggrieved registered vehicle owner is entitled to statutory damages in an amount of $1,000 and reasonable attorney fees and costs. An action brought pursuant to this paragraph must be brought within 12 months of when the vehicle was impounded.\nThe failure of the registered owner or lienholders to exercise the right to reclaim the vehicle before the expiration of the waiting periods provided under section 168B.051 constitutes a waiver of all right, title, and interest in the vehicle and a consent to the transfer of title to, and disposal or sale of, the vehicle under section 168B.08. The failure of the registered owner to exercise the right provided under subdivision 3 constitutes a waiver of all right, title, and interest in the contents and a consent to the transfer of title to, and disposal or sale of, the contents under section 168B.08.",
	"repealed": false
}