{
	"id": "171.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.07",
	"title": "171.07 INFORMATION ON LICENSE AND IDENTIFICATION CARD.",
	"text": "(a) Upon the payment of the required fee, the department shall issue to every qualifying applicant a license designating the type or class of vehicles the applicant is authorized to drive as applied for. This license must bear: (1) a distinguishing number assigned to the licensee; (2) the licensee's full name and date of birth; (3) either (i) the licensee's residence address, or (ii) the designated address under section 5B.05; (4) a description of the licensee in a manner as the commissioner deems necessary; (5) the usual signature of the licensee; and (6) designations and markings as provided in this section. No license is valid unless it bears the usual signature of the licensee. Every license must bear a colored photograph or an electronically produced image of the licensee.\n(b) If the United States Postal Service will not deliver mail to the applicant's residence address as listed on the license, then the applicant shall provide verification from the United States Postal Service that mail will not be delivered to the applicant's residence address and that mail will be delivered to a specified alternate mailing address. When an applicant provides an alternate mailing address under this subdivision, the commissioner shall use the alternate mailing address in lieu of the applicant's residence address for all notices and mailings to the applicant.\n(c) Every license issued to an applicant under the age of 21 must be of a distinguishing color and plainly marked \"Under-21.\"\n(d) A license issued to an applicant age 65 or over must be plainly marked \"senior\" if requested by the applicant.\n(e) Except for a noncompliant license, a license must bear a distinguishing indicator for compliance with requirements of the REAL ID Act.\n(f) A noncompliant license must:\n(1) be marked \"not for federal identification\" on the face and in the machine-readable portion;\n(2) have a unique design or color indicator for purposes of the REAL ID Act; and\n(3) bear no indicator or design that relates to the lawful presence or the citizenship of the license holder.\n(g) A REAL ID compliant license issued to a person with temporary lawful status or admission period must be marked \"temporary\" on the face and in the machine-readable portion.\n(h) A license must display the licensee's full name or no fewer than 39 characters of the name. Any necessary truncation must begin with the last character of the middle name and proceed through the second letter of the middle name, followed by the last character of the first name and proceeding through the second letter of the first name.\n[See Note.]\nThe department shall file, or contract to file, all photographs or electronically produced images obtained in the process of issuing drivers' licenses or Minnesota identification cards. The photographs or electronically produced images shall be private data pursuant to section 13.02, subdivision 12. Notwithstanding section 13.04, subdivision 3, the department shall not be required to provide copies of photographs or electronically produced images to data subjects. The use of the files is restricted:\n(1) to the issuance and control of drivers' licenses;\n(2) to criminal justice agencies, as defined in section 299C.46, subdivision 2, for the investigation and prosecution of crimes, service of process, enforcement of no contact orders, location of missing persons, investigation and preparation of cases for criminal, juvenile, and traffic court, location of individuals required to register under section 243.166 or 243.167, and supervision of offenders;\n(3) to public defenders, as defined in section 611.272, for the investigation and preparation of cases for criminal, juvenile, and traffic courts;\n(4) to child support enforcement purposes under section 518A.83; and\n(5) to a county medical examiner or coroner as required by section 390.005 as necessary to fulfill the duties under sections 390.11 and 390.25.\nEach class C, class B, or class A driver's license must be clearly marked \"Minnesota Commercial Driver's License.\"\nThe department shall not issue a class B or class A license to anyone who does not have or has not qualified for a class D license. A class A license shall not be issued to anyone under 18 years of age.\n(a) Upon payment of the required fee, the department shall issue to every qualifying applicant a Minnesota identification card. The department may not issue a Minnesota identification card to an individual who has a driver's license, other than a limited license. The department may not issue an enhanced identification card to an individual who is under 16 years of age, not a resident of this state, or not a citizen of the United States of America. The card must bear: (1) a distinguishing number assigned to the applicant; (2) a colored photograph or an electronically produced image of the applicant; (3) the applicant's full name and date of birth; (4) either (i) the licensee's residence address, or (ii) the designated address under section 5B.05; (5) a description of the applicant in the manner as the commissioner deems necessary; (6) the usual signature of the applicant; and (7) designations and markings provided under this section.\n(b) If the United States Postal Service will not deliver mail to the applicant's residence address as listed on the Minnesota identification card, then the applicant shall provide verification from the United States Postal Service that mail will not be delivered to the applicant's residence address and that mail will be delivered to a specified alternate mailing address. When an applicant provides an alternate mailing address under this subdivision, the commissioner shall use the alternate mailing address in lieu of the applicant's residence address for all notices and mailings to the applicant.\n(c) Each identification card issued to an applicant under the age of 21 must be of a distinguishing color and plainly marked \"Under-21.\"\n(d) Each Minnesota identification card must be plainly marked \"Minnesota identification card - not a driver's license.\"\n(e) Except for a noncompliant identification card, a Minnesota identification card must bear a distinguishing indicator for compliance with requirements of the REAL ID Act.\n(f) A noncompliant identification card must:\n(1) be marked \"not for federal identification\" on the face and in the machine-readable portion;\n(2) have a unique design or color indicator for purposes of the REAL ID Act; and\n(3) bear no indicator or design that relates to the lawful presence or the citizenship of the identification card holder.\n(g) A REAL ID compliant Minnesota identification card issued to a person with temporary lawful status or admission period must be marked \"temporary\" on the face and in the machine-readable portion.\n(h) A Minnesota identification card must display the cardholder's full name or no fewer than 39 characters of the name. Any necessary truncation must begin with the last character of the middle name and proceed through the second letter of the middle name, followed by the last character of the first name and proceeding through the second letter of the first name.\n(i) The fee for a Minnesota identification card is 50 cents when issued to a person who is developmentally disabled, as defined in section 252A.02, subdivision 2; a physically disabled person, as defined in section 169.345, subdivision 2; or, a person with mental illness, as described in section 245.462, subdivision 20, paragraph (c).\n[See Note.]\nA Minnesota identification card issued to an applicant 65 years of age or over shall be of a distinguishing color and plainly marked \"senior.\" The fee for the card issued to an applicant 65 years of age or over shall be one-half the required fee for a class D driver's license rounded down to the nearest quarter dollar. A Minnesota identification card or a Minnesota driver's license issued to a person 65 years of age or over shall be valid identification for the purpose of qualifying for reduced rates, free licenses or services provided by any board, commission, agency or institution that is wholly or partially funded by state appropriations. This subdivision does not apply to an enhanced identification card issued to an applicant age 65 or older.\n(a) A homeless youth, as defined in section 256K.45, subdivision 1a, who meets the requirements of this subdivision may obtain a noncompliant identification card, notwithstanding section 171.06, subdivision 3.\n(b) An applicant under this subdivision must:\n(1) provide the applicant's full name, date of birth, and sex;\n(2) provide the applicant's height in feet and inches, weight in pounds, and eye color;\n(3) submit a certified copy of a birth certificate issued by a government bureau of vital statistics or equivalent agency in the applicant's state of birth, which must bear the raised or authorized seal of the issuing government entity; and\n(4) submit a statement verifying that the applicant is a homeless youth who resides in Minnesota that is signed by:\n(i) an employee of a human services agency receiving public funding to provide services to homeless youth, runaway youth, youth with mental illness, or youth with substance use disorders; or\n(ii) staff at a school who provide services to homeless youth or a school social worker.\n(c) For a noncompliant identification card under this subdivision:\n(1) the commissioner must not impose a fee, surcharge, or filing fee under section 171.06, subdivision 2; and\n(2) a driver's license agent must not impose a filing fee under section 171.061, subdivision 4.\n(d) Minnesota Rules, parts 7410.0400 and 7410.0410, or successor rules, do not apply for an identification card under this subdivision.\n(a) Except as otherwise provided in this subdivision, the expiration date of a Minnesota identification card is the birthday of the applicant in the fourth year following the date of issuance of the card.\n(b) For an applicant age 65 or older:\n(1) the expiration date of a Minnesota identification card is the birthday of the applicant in the eighth year following the date of issuance of the card; or\n(2) a noncompliant identification card is valid for the lifetime of the applicant.\n(c) For the purposes of paragraph (b), \"Minnesota identification card\" does not include an enhanced identification card issued to an applicant age 65 or older.\n(d) The expiration date for an Under-21 identification card is the cardholder's 21st birthday. The commissioner shall issue an identification card to a holder of an Under-21 identification card who applies for the card, pays the required fee, and presents proof of identity and age, unless the commissioner determines that the applicant is not qualified for the identification card.\n(e) Notwithstanding paragraphs (a) to (d), the expiration date for an identification card issued to a person with temporary lawful status is the last day of the person's legal stay in the United States, or one year after issuance if the last day of the person's legal stay is not identified.\n[See Note.]\nThe department shall offer a donor document to each person making application for a driver's license or a Minnesota identification card who indicates a desire not to make a decision about making an anatomical gift at the time the application is made. The commissioner of public safety shall prescribe the form of the donor document and the application for a driver's license or a Minnesota identification card. The forms must be designed so that execution by the applicant of the donor document or application will make an anatomical gift under the Darlene Luther Revised Uniform Anatomical Gift Act, chapter 525A. If the donor is 18 years of age or older, the donor document or application must be signed by the donor. If the donor cannot sign, the donor document or application may be signed for the donor at the donor's direction, in the donor's presence, and in the presence of two witnesses who must sign the donor document or application in the donor's presence. If the donor is a minor, the donor document or application must be signed by the minor donor, and one of the minor donor's parents, a legal guardian, or a parent having legal custody. If the minor cannot sign, the donor document or application may not be signed for the minor. The department shall identify donors of anatomical gifts by the designation \"donor\" on the front side of the donor's driver's license or Minnesota identification card. The issuance of a driver's license or Minnesota identification card identifying the person as a \"donor\" completes the donation process and the license or identification card constitutes the final donor record. The department is not required to keep the physical record of the donor card or application after issuing the driver's license or identification card for the donation to be valid. The department shall maintain a computer record of donors. Revocation, suspension, expiration, or cancellation of the license does not invalidate the anatomical gift. The designation \"donor\" constitutes sufficient legal authority for the removal of all body organs or parts upon death of the donor for the purpose of transplantation. The donor designation may be removed only upon written notice to the department. Delivery of the license or Minnesota identification card during the donor's lifetime is not necessary to make the gift valid.\nUpon the written request of the applicant, the department shall issue a driver's license or Minnesota identification card bearing a graphic or written medical alert identifier. The applicant must request the medical alert identifier at the time the photograph or electronically produced image is taken. No specific medical information will be contained on the driver's license or Minnesota identification card.\nUpon the written request of the applicant, the commissioner must issue a driver's license or Minnesota identification card bearing a graphic or written identifier for an autism spectrum disorder, as defined in section 62A.3094, subdivision 1, paragraph (b). The applicant must submit the written request for the identifier at the time the photograph or electronically produced image is taken. The commissioner must not include any specific medical information on the driver's license or Minnesota identification card.\nUpon the written request of the applicant, the commissioner must issue a driver's license or Minnesota identification card bearing a graphic or written identifier for a mental health condition. The applicant must submit the written request for the identifier at the time the photograph or electronically produced image is taken. The commissioner must not include any specific medical information on the driver's license or Minnesota identification card.\n(a) At the written request of the applicant and on payment of the required fee, the department shall issue, renew, or reissue a driver's license or Minnesota identification card bearing the graphic or written designation of a Living Will/Health Care Directive. The designation does not constitute delivery of a health care declaration under section 145B.05.\n(b) On payment of the required fee, the department shall issue a replacement or renewal license or identification card without the designation if requested by the applicant.\n(c) This subdivision does not impose any additional duty on a health care provider, as defined in section 145B.02, subdivision 6, or 145C.01, subdivision 6, beyond the duties imposed in chapter 145B or 145C.\n(d) For the purposes of this subdivision:\n(1) \"living will\" means a declaration made under section 145B.03; and\n(2) \"health care directive\" means a durable power of attorney for health care under section 145C.02, or any other written advance health care directive of the applicant that is authorized by statute or not prohibited by law.\nBefore a driver's license may be issued or renewed, an applicant for a driver's license or renewal shall certify by signature that the applicant is aware of the duties and responsibilities required of drivers under section 169.444 to guard against jeopardizing the safety of school children around school buses and the penalties for violating that section. A failure to make this certification does not bar a prosecution for violation of section 169.444.\nThe commissioner shall develop new drivers' licenses and identification cards, to be issued beginning January 1, 1994, that must be as impervious to alteration as is reasonably practicable in their design and quality of material and technology. The driver's license security laminate shall be made from materials not readily available to the general public. The design and technology employed must enable the driver's license and identification card to be subject to two or more methods of visual verification capable of clearly indicating the presence of tampering or counterfeiting. The driver's license and identification card must not be susceptible to reproduction by photocopying or simulation and must be highly resistant to data or photograph substitution and other tampering.\n(a) A driver's license or identification card must include reasonable security measures to: prevent forgery, alteration, reproduction, and counterfeiting; facilitate detection of fraud; prohibit the ability to superimpose a photograph or electronically produced image; and protect against unauthorized disclosure of personal information contained in the driver's license or identification card. The driver's license must include the best available anticounterfeit laminate technology.\n(b) An enhanced driver's license or enhanced identification card may include radio frequency identification technology that is limited to a randomly assigned number, which must be encrypted if agreed to by the United States Department of Homeland Security and does not include biometric data or any information other than the citizenship status of the license holder or cardholder. The commissioner shall ensure that the radio frequency identification technology is secure from unauthorized data access. An applicant must sign an acknowledgment of understanding of the radio frequency identification technology and its use for the sole purpose of verifying United States citizenship before being issued an enhanced driver's license or an enhanced identification card.\n[See Note.]\n(a) The commissioner of public safety is authorized to enter into agreements with other agencies to issue cards to clients of those agencies for use in their programs. The cards may be issued to persons who do not qualify for a Minnesota driver's license or do not provide evidence of name and identity as required by rule for a Minnesota identification card. Persons issued cards under this subdivision will meet the identification verification requirements of the contracting agency.\n(b) The interagency agreement may include provisions for the payment of the county fee provided in section 171.061, subdivision 4, and the actual cost to manufacture the card.\n(c) Cards issued under this subdivision are not Minnesota identification cards for the purposes defined in sections 48.512, 201.061, 201.161, 340A.503, and 604.113.\n(a) Upon the written request of the applicant and upon payment of an additional fee of $4.25, the department shall issue a driver's license or Minnesota identification card bearing a symbol or other appropriate identifier indicating that the license holder has appointed an individual to serve as a standby or temporary custodian under chapter 257B.\n(b) The request must be accompanied by a copy of the designation executed under section 257B.04.\n(c) The department shall maintain a computerized records system of all individuals listed as standby or temporary custodians by driver's license and identification card applicants. This data must be released to appropriate law enforcement agencies under section 13.69. Upon a parent's request and payment of a fee of $4.25, the department shall revise its list of standby or temporary custodians to reflect a change in the appointment.\n(d) At the request of the license or cardholder, the department shall cancel the standby or temporary custodian indication without additional charge. However, this paragraph does not prohibit a fee that may be applicable for a duplicate or replacement license or card, renewal of a license, or other service applicable to a driver's license or identification card.\n(e) Notwithstanding sections 13.08, subdivision 1, and 13.69, the department and department employees are conclusively presumed to be acting in good faith when employees rely on statements made, in person or by telephone, by persons purporting to be law enforcement and subsequently release information described in paragraph (b). When acting in good faith, the department and department personnel are immune from civil liability and not subject to suit for damages resulting from the release of this information.\n(f) The department and its employees:\n(1) have no duty to inquire or otherwise determine whether a designation submitted under this subdivision is legally valid and enforceable; and\n(2) are immune from all civil liability and not subject to suit for damages resulting from a claim that the designation was not legally valid and enforceable.\n(g) Of the fees received by the department under this subdivision:\n(1) Up to $61,000 received must be deposited in the general fund.\n(2) All other fees must be deposited in the driver and vehicle services operating account under section 299A.705.\n(a) The department shall maintain in its records information transmitted electronically from the commissioner of natural resources identifying each person to whom the commissioner has issued a snowmobile safety certificate. The records transmitted from the Department of Natural Resources must contain the full name and date of birth as required for the driver's license or identification card. Records that are not matched to a driver's license or identification card record may be deleted after seven years.\n(b) After receiving information under paragraph (a) that a person has received a snowmobile safety certificate, the department shall include, on all drivers' licenses or Minnesota identification cards subsequently issued to the person, a graphic or written indication that the person has received the certificate.\n(c) If a person who has received a snowmobile safety certificate applies for a driver's license or Minnesota identification card before that information has been transmitted to the department, the department may accept a copy of the certificate as proof of its issuance and shall then follow the procedures in paragraph (b).\n(a) When an applicant has a record transmitted to the department as described in paragraph (c) or presents:\n(1) a firearms safety certificate issued for successfully completing a firearms safety course administered under section 97B.015; or\n(2) an advanced hunter certificate issued for successfully completing an advanced hunter education course administered under section 97B.025,\nand requests a driver's license or identification card described in paragraph (b), the department shall issue, renew, or reissue to the applicant a driver's license or Minnesota identification card described in paragraph (b).\n(b) Pursuant to paragraph (a), the department shall issue a driver's license or Minnesota identification card bearing a graphic or written indication that the applicant has successfully completed a firearms safety course administered under section 97B.015, an advanced hunter education course administered under section 97B.025, or both of the described courses.\n(c) The department shall maintain in its records information transmitted electronically from the commissioner of natural resources identifying each person to whom the commissioner has issued a firearms safety certificate or an advanced hunter education certificate. The records transmitted from the Department of Natural Resources must contain the full name and date of birth as required for the driver's license or identification card. Records that are not matched to a driver's license or identification card record may be deleted after seven years.\nAn applicant's Social Security number must not be displayed, encrypted, or encoded on the driver's license or Minnesota identification card or included in a magnetic strip or bar code used to store data on the license or Minnesota identification card. The Social Security number must not be used as a Minnesota driver's license or identification number.\n(a) At the request of an eligible applicant and on payment of the required fee, the department must issue, renew, or reissue to the applicant a driver's license or Minnesota identification card bearing a graphic or written designation of:\n(1) Veteran; or\n(2) Veteran 100% T&P.\n(b) At the time of the initial application for the designation provided under this subdivision, the applicant must:\n(1) be one of the following:\n(i) a veteran, as defined in section 197.447; or\n(ii) a retired or honorably discharged member of the National Guard or a reserve component of the United States armed forces;\n(2) provide a certified copy of the applicant's discharge papers that confirms an honorable or general discharge under honorable conditions status, or a military retiree identification card, veteran identification card, or veteran health identification card; and\n(3) if the applicant is seeking the disability designation under paragraph (a), clause (2), provide satisfactory evidence of a 100 percent total and permanent service-connected disability as determined by the United States Department of Veterans Affairs.\nFor purposes of this section, \"license\" includes \"enhanced driver's license,\" and \"identification card\" includes \"enhanced identification card.\"\nAt the request of an applicant with permanent eligibility for a disability designation and on payment of the required fee, the department shall issue, renew, or reissue to the applicant a driver's license or Minnesota identification card bearing a physical disability designation based on the following medical conditions:\n(1) type 1, to an applicant who is permanently blind or disabled and meets the requirements for a free license to take fish under section 97A.441, subdivision 1, paragraph (a), clause (1), (4), (5), or (6); or\n(2) type 2, to an applicant who permanently meets the requirements for disability under section 97B.111, subdivision 1, paragraph (a), clause (1), item (i).\n(a) The department shall maintain in its records information transmitted electronically from the commissioner of natural resources identifying each person to whom the commissioner has issued an all-terrain vehicle safety certificate. The records transmitted from the Department of Natural Resources must contain the full name and date of birth as required for the driver's license or identification card. Records that are not matched to a driver's license or identification card record may be deleted after seven years.\n(b) After receiving information under paragraph (a) that a person has received an all-terrain vehicle safety certificate, the department shall include, on all drivers' licenses or Minnesota identification cards subsequently issued to the person, a graphic or written indication that the person has received the certificate.\n(c) If a person who has received an all-terrain vehicle safety certificate applies for a driver's license or Minnesota identification card before that information has been transmitted to the department, the department may accept a copy of the certificate as proof of its issuance and shall then follow the procedures in paragraph (b).\n(a) The department shall maintain in its records information transmitted electronically from the commissioner of natural resources identifying each person to whom the commissioner has issued a resident lifetime license under section 97A.473. The records transmitted from the Department of Natural Resources must contain:\n(1) the full name and date of birth as required for the driver's license or identification card;\n(2) the person's driver's license or identification card number;\n(3) the category of lifetime license issued under section 97A.473; and\n(4) the Department of Natural Resources customer identification number.\n(b) The department may delete records described in paragraph (a) if they have not been matched to a driver's license or identification card record within seven years after transmission to the department.\n(c) Except as provided in paragraph (b), the department shall include, on all drivers' licenses or Minnesota identification cards issued to a person who holds a lifetime license, a graphic or written designation of the lifetime license, and the category of the lifetime license.\n(d) If a person with a lifetime license under section 97A.473 applies for a driver's license or Minnesota identification card before that information has been transmitted to the department, the department may accept a copy of the license issued under section 97A.473 as proof of its issuance and shall then follow the procedures in paragraph (c).\n(a) The department must maintain in its records information transmitted electronically from the commissioner of natural resources identifying each person to whom the commissioner has issued a watercraft operator's permit. The records transmitted from the Department of Natural Resources must contain the full name and date of birth as required for the driver's license or identification card. Records that are not matched to a driver's license or identification card record may be deleted after seven years.\n(b) After receiving information under paragraph (a) that a person has received a watercraft operator's permit, the department must include on all drivers' licenses or Minnesota identification cards subsequently issued to the person a graphic or written indication that the person has received the permit.\n(c) If a person who has received a watercraft operator's permit applies for a driver's license or Minnesota identification card before that information has been transmitted to the department, the department may accept a copy of the certificate as proof of its issuance and must then follow the procedures in paragraph (b).\n[See Note.]",
	"repealed": false
}