{
	"id": "17.457",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.457",
	"title": "17.457 RESTRICTED SPECIES.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Commissioner\" means the commissioner of agriculture or the commissioner's designee.\n(c) \"Domestic hogs\" means members of the subspecies Sus scrofa domesticus.\n(d) \"Restricted species\" means pigs, boars, peccaries, and all other members of the Suidae family and the Tayassuidae family, excluding domestic hogs.\n(e) \"Release\" means an intentional introduction or persistent accidental escape of a restricted species or domestic hog from the control of the owner or responsible party. Release does not mean an accidental escape of restricted species or domestic hogs due to a transportation accident or an act of God.\nIt is unlawful for a person to import, possess, propagate, or transport a restricted species, unless the person has a permit as described in subdivision 3.\n(a) It is unlawful for a person to release restricted species or domestic hogs.\n(b) In addition to the penalties in subdivision 6, a person who violates paragraph (a) must do the following at the person's expense and by the date and time specified by the commissioner:\n(1) register their premises with the Board of Animal Health;\n(2) implement the confinement standards and record-keeping requirements developed by the Board of Animal Health; and\n(3) reimburse the commissioner for costs incurred to annually inspect the registered premises and verify compliance with clause (2).\nThe commissioner may issue permits for the transportation, possession, purchase, or importation of restricted species only for scientific, research, or educational purposes. A permit issued under this subdivision may be revoked by the commissioner if the conditions of the permit are not met by the permittee or for any unlawful act or omission, including accidental escapes.\nIn the event of a release of a restricted species or domestic hog, the owner must notify within 24 hours a conservation officer and the Board of Animal Health and is responsible for the recovery of the species. If the owner does not provide notification or fails to recover the animal within 72 hours of providing notification, the released animal is considered feral swine under section 97A.56, is no longer the personal property of the owner, and may be captured or destroyed at the former owner's expense by a peace officer or by the commissioner of natural resources under section 97A.045, subdivision 1, paragraph (b), or other authority.\n(a) This section may be enforced by a peace officer, an enforcement officer under sections 97A.205 and 97A.211, and, except as provided in paragraph (b), by the commissioner under sections 17.982 to 17.983.\n(b) For the first violation of this section, the commissioner may impose an administrative penalty of no more than $1,000. For a second violation, the commissioner may impose an administrative penalty of no more than $1,500. For a third or succeeding violation, the commissioner may impose an administrative penalty of no more than $3,000 for each violation.\n(a) A person who violates subdivision 2, 2a, 4, or 7 is guilty of a misdemeanor.\n(b) A person who violates subdivision 2a, paragraph (a), is liable to the state for costs associated with a release. The attorney general may enforce this paragraph on behalf of any state agency affected.\nA restricted species in the possession of a person must be marked in a permanent fashion to identify ownership. The restricted species must be marked as soon as practicable after birth or purchase.\nThe commissioner, in consultation with the commissioner of natural resources, shall develop criteria for approved containment measures for restricted species.\nA person who possesses restricted species must provide proof of insurance or file a security bond with the commissioner in an amount determined by the commissioner to pay for the potential costs and damages that would be caused by the release of a restricted species.\nThe commissioner may impose a fee for permits in an amount sufficient to cover the costs of issuing the permits and for facility inspections. The fee may not exceed $50. Fee receipts must be deposited in the general fund.",
	"repealed": false
}