{
	"id": "149A.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/149A.94",
	"title": "149A.94 FINAL DISPOSITION.",
	"text": "Every dead human body lying within the state, except unclaimed bodies delivered for dissection by the medical examiner, those delivered for anatomical study pursuant to section 149A.81, subdivision 2, or lawfully carried through the state for the purpose of disposition elsewhere; and the remains of any dead human body after dissection or anatomical study, shall be decently buried or entombed in a public or private cemetery, alkaline hydrolyzed, cremated, or, effective July 1, 2025, naturally reduced within a reasonable time after death. Where final disposition of a body will not be accomplished, or, effective July 1, 2025, when natural organic reduction will not be initiated, within 72 hours following death or release of the body by a competent authority with jurisdiction over the body, the body must be properly embalmed, refrigerated, or packed with dry ice. A body may not be kept in refrigeration for a period exceeding six calendar days, or packed in dry ice for a period that exceeds four calendar days, from the time of death or release of the body from the coroner or medical examiner.\n[Repealed, 2007 c 114 s 75]\nNo dead human body shall be buried, entombed, cremated, alkaline hydrolyzed, or, effective July 1, 2025, naturally reduced without a disposition permit. The disposition permit must be filed with the person in charge of the place of final disposition. Where a dead human body will be transported out of this state for final disposition, the body must be accompanied by a certificate of removal.\nInurnment of alkaline hydrolyzed remains, cremated remains, or, effective July 1, 2025, naturally reduced remains and release to an appropriate party is considered final disposition and no further permits or authorizations are required for transportation, interment, entombment, or placement of the remains, except as provided in section 149A.95, subdivision 16.",
	"repealed": false
}