{
	"id": "462A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.37",
	"title": "462A.37 HOUSING INFRASTRUCTURE BONDS; AUTHORIZATION; STANDING APPROPRIATION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Abandoned property\" has the meaning given in section 117.025, subdivision 5.\n(c) \"Community land trust\" means an entity that meets the requirements of section 462A.31, subdivisions 1 and 2.\n(d) \"Debt service\" means the amount payable in any fiscal year of principal, premium, if any, and interest on housing infrastructure bonds and the fees, charges, and expenses related to the bonds.\n(e) \"Foreclosed property\" means residential property where foreclosure proceedings have been initiated or have been completed and title transferred or where title is transferred in lieu of foreclosure.\n(f) \"Housing infrastructure bonds\" means bonds issued by the agency under this chapter that:\n(1) are qualified 501(c)(3) bonds, within the meaning of section 145(a) of the Internal Revenue Code;\n(2) finance qualified residential rental projects within the meaning of section 142(d) of the Internal Revenue Code; or\n(3) are tax-exempt bonds that are not private activity bonds, within the meaning of section 141(a) of the Internal Revenue Code, for the purpose of financing or refinancing affordable housing authorized under this chapter.\n(g) \"Internal Revenue Code\" means the Internal Revenue Code of 1986, as amended.\n(h) \"Senior\" means a person 55 years of age or older.\n(i) \"Senior household\" means a household with one or more senior members and with an annual combined income not greater than 50 percent of:\n(1) the metropolitan area median income for persons in the metropolitan area; or\n(2) the statewide median income for persons outside the metropolitan area.\n(j) \"Senior housing\" means housing intended and operated for occupancy by senior households with at least 80 percent of the units occupied by senior households, and for which there is publication of, and adherence to, policies and procedures that demonstrate an intent by the owner or manager to provide housing for seniors. Senior housing may be developed in conjunction with and as a distinct portion of mixed-income senior housing developments that use a variety of public or private financing sources.\n(k) \"Supportive housing\" means housing that is not time-limited and provides or coordinates with linkages to services necessary for residents to maintain housing stability and maximize opportunities for education and employment.\n(a) The agency may issue up to $30,000,000 in aggregate principal amount of housing infrastructure bonds in one or more series to which the payment made under this section may be pledged. The housing infrastructure bonds authorized in this subdivision may be issued to fund loans, or grants for the purposes of clauses (4) and (7), on terms and conditions the agency deems appropriate, made for one or more of the following purposes:\n(1) to finance the costs of the construction, acquisition, and rehabilitation of supportive housing where at least 50 percent of units are set aside for individuals and families who are without a permanent residence;\n(2) to finance the costs of the acquisition and rehabilitation of foreclosed or abandoned housing to be used for affordable rental housing or for affordable home ownership and the costs of new construction of rental housing on abandoned or foreclosed property where the existing structures will be demolished or removed;\n(3) to finance that portion of the costs of acquisition of property that is attributable to the land to be leased by community land trusts to low- and moderate-income home buyers;\n(4) to finance the acquisition, improvement, and infrastructure of manufactured home parks under section 462A.2035, subdivision 1b;\n(5) to finance the costs of acquisition, rehabilitation, adaptive reuse, or new construction of senior housing;\n(6) to finance the costs of acquisition, rehabilitation, and replacement of federally assisted rental housing and for the refinancing of costs of the construction, acquisition, and rehabilitation of federally assisted rental housing, including providing funds to refund, in whole or in part, outstanding bonds previously issued by the agency or another government unit to finance or refinance such costs;\n(7) to finance the costs of acquisition, rehabilitation, adaptive reuse, or new construction of single-family housing;\n(8) to finance the costs of construction, acquisition, and rehabilitation of permanent housing that is affordable to households with incomes at or below 50 percent of the area median income for the applicable county or metropolitan area as published by the Department of Housing and Urban Development, as adjusted for household size; and\n(9) to finance the costs of construction, acquisition, rehabilitation, conversion, and development of cooperatively owned housing created under chapter 308A, 308B, or 308C that is affordable to low- and moderate-income households.\n(b) Among comparable proposals for permanent supportive housing, preference shall be given to permanent supportive housing for veterans and other individuals or families who:\n(1) either have been without a permanent residence for at least 12 months or at least four times in the last three years; or\n(2) are at significant risk of lacking a permanent residence for 12 months or at least four times in the last three years.\n(c) Among comparable proposals for senior housing, the agency must give priority to requests for projects that:\n(1) demonstrate a commitment to maintaining the housing financed as affordable to senior households;\n(2) leverage other sources of funding to finance the project, including the use of low-income housing tax credits;\n(3) provide access to services to residents and demonstrate the ability to increase physical supports and support services as residents age and experience increasing levels of disability; and\n(4) include households with incomes that do not exceed 30 percent of the median household income for the metropolitan area.\n(d) To the extent practicable, the agency shall balance the loans made between projects in the metropolitan area and projects outside the metropolitan area. Of the loans made to projects outside the metropolitan area, the agency shall, to the extent practicable, balance the loans made between projects in counties or cities with a population of 20,000 or less, as established by the most recent decennial census, and projects in counties or cities with populations in excess of 20,000.\n(e) Among comparable proposals for permanent housing, the agency must give preference to projects that will provide housing that is affordable to households at or below 30 percent of the area median income.\n(f) If a loan recipient uses the loan for new construction as defined by the agency on a building containing more than four units, the loan recipient must construct, convert, or otherwise adapt the building to include:\n(1) the greater of: (i) at least one unit; or (ii) at least five percent of units that are accessible units, and each accessible unit includes at least one roll-in shower, water closet, and kitchen work surface meeting the requirements of section 1002 of the current State Building Code Accessibility Provisions for Dwelling Units in Minnesota; and\n(2) the greater of: (i) at least one unit; or (ii) at least five percent of units that are sensory-accessible units that include:\n(A) soundproofing between shared walls for first and second floor units;\n(B) no florescent lighting in units and common areas;\n(C) low-fume paint;\n(D) low-chemical carpet; and\n(E) low-chemical carpet glue in units and common areas.\nNothing in this paragraph relieves a project funded by the agency from meeting other applicable accessibility requirements.\nIn addition to the amount authorized in subdivision 2, the agency may issue up to $95,000,000 of housing infrastructure bonds in one or more series to which the payments made under this section may be pledged.\nIn addition to the amount authorized in subdivisions 2 and 2a, the agency may issue up to $15,000,000 of housing infrastructure bonds in one or more series to which the payments made under this section may be pledged.\nIn addition to the amount authorized in subdivisions 2, 2a, and 2b, the agency may issue up to $35,000,000 in housing infrastructure bonds in one or more series to which the payments under this section may be pledged.\nIn addition to the amount authorized in subdivisions 2, 2a, 2b, and 2c, the agency may issue up to $30,000,000 in housing infrastructure bonds in one or more series to which the payments under this section may be pledged. Housing funded with proceeds from bonds sold under this authorization must be permanent supportive housing for people with behavioral health needs.\nIn addition to the amount authorized in subdivisions 2, 2a, 2b, 2c, and 2d, the agency may issue up to $50,000,000 in housing infrastructure bonds in one or more series to which the payments under this section may be pledged.\nIn addition to the amount authorized in subdivisions 2 to 2e, the agency may issue up to $60,000,000 in housing infrastructure bonds in one or more series to which the payments under this section may be pledged.\nIn addition to the amount authorized in subdivisions 2 to 2f, the agency may issue up to $100,000,000 in housing infrastructure bonds in one or more series to which the payments under this section may be pledged.\n(a) In addition to the amount authorized in subdivisions 2 to 2g, the agency may issue up to $100,000,000 in housing infrastructure bonds in one or more series to which the payments under this section may be pledged. Of this authorization, proceeds from the sale of bonds authorized in this section must be applied as follows unless modified under paragraph (b):\n(1) $18,333,000 for uses under subdivision 2, paragraph (a), clause (7); and\n(2) $15,000,000 for acquisition of manufactured home parks and for manufactured home park improvements and infrastructure under subdivision 2, paragraph (a), clause (4).\n(b) The agency must use its best efforts to award grants and loans for the purposes allocated in paragraph (a), clauses (1) and (2). If the agency has not committed the full amount of the allocations by January 16, 2024, to the described purposes due to a lack of qualifying projects, the allocated amount may be applied to other purposes authorized in subdivision 2.\n[Renumbered subd 3a]\nIn addition to the amount authorized in subdivisions 2 to 2h and 3a, the agency may issue up to $50,000,000 in one or more series to which the payments under this section may be pledged.\nThe housing infrastructure bonds are not public debt of the state, and the full faith and credit and taxing powers of the state are not pledged to the payment of the housing infrastructure bonds or to any payment that the state agrees to make under this section. The bonds must contain a conspicuous statement to that effect.\n(a) The agency may issue housing infrastructure bonds in one or more series to refund bonds authorized in this section. The amount of refunding housing infrastructure bonds that may be issued from time to time will not be subject to the dollar limitation contained in any of the authorizations in this section nor will those bonds be included in computing the amount of bonds that may be issued within those dollar limitations.\n(b) In the refunding of housing infrastructure bonds, each bond must be called for redemption prior to its maturity in accordance with its terms no later than the earliest date on which it may be redeemed. No refunding bonds may be issued unless as of the date of the refunding bonds the present value of the dollar amount of the debt service on the refunding bonds, computed to their stated maturity dates, is lower than the present value of the dollar amount of debt service on all housing infrastructure bonds refunded computed to their stated maturity dates. For purposes of this subdivision, \"present value of the dollar amount of debt service\" means the dollar amount of debt service to be paid, discounted to the nominal date of the refunding bonds at a rate equal to the yield on the refunding bonds.\n(c) If as a result of the issuance of refunding bonds the amount of debt service for an annual period is less than the amount transferred by the commissioner of management and budget to pay debt service for that annual period, the agency must deduct the excess amount from the actual amount of debt service on those bonds certified for the next subsequent annual period.\n(a) The agency must certify annually to the commissioner of management and budget the actual amount of annual debt service on each series of bonds issued under subdivision 2.\n(b) Each July 15, beginning in 2013 and through 2035, if any housing infrastructure bonds issued under subdivision 2, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a), not to exceed $2,200,000 annually. The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(c) The agency may pledge to the payment of the housing infrastructure bonds the payments to be made by the state under this section.\n(a) The agency must certify annually to the commissioner of management and budget the actual amount of annual debt service on each series of bonds issued under this section.\n(b) Each July 15, beginning in 2015 and through 2037, if any housing infrastructure bonds issued under subdivision 2a, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a), not to exceed $6,400,000 annually. The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(c) Each July 15, beginning in 2017 and through 2038, if any housing infrastructure bonds issued under subdivision 2b, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a), not to exceed $800,000 annually. The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(d) Each July 15, beginning in 2019 and through 2040, if any housing infrastructure bonds issued under subdivision 2c, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a), not to exceed $2,800,000 annually. The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(e) Each July 15, beginning in 2020 and through 2041, if any housing infrastructure bonds issued under subdivision 2d, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a). The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(f) Each July 15, beginning in 2020 and through 2041, if any housing infrastructure bonds issued under subdivision 2e, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a). The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(g) Each July 15, beginning in 2022 and through 2043, if any housing infrastructure bonds issued under subdivision 2f, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a). The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(h) Each July 15, beginning in 2022 and through 2043, if any housing infrastructure bonds issued under subdivision 2g, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a). The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(i) Each July 15, beginning in 2023 and through 2044, if any housing infrastructure bonds issued under subdivision 2h, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a). The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(j) Each July 15, beginning in 2026 and through 2047, if any housing infrastructure bonds issued under subdivision 2j, or housing infrastructure bonds issued to refund those bonds, remain outstanding, the commissioner of management and budget must transfer to the housing infrastructure bond account established under section 462A.21, subdivision 33, the amount certified under paragraph (a). The amounts necessary to make the transfers are appropriated from the general fund to the commissioner of management and budget.\n(k) The agency may pledge to the payment of the housing infrastructure bonds the payments to be made by the state under this section.\nAny amount appropriated in this section for debt service payments that is not needed in that fiscal year for debt service payments is canceled to the general fund. The cancellation must occur no later than June 30 of the same fiscal year.",
	"repealed": false
}