{
	"id": "62Q.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.76",
	"title": "62Q.76 DEFINITIONS.",
	"text": "For purposes of sections 62Q.76 to 62Q.79, the terms defined in this section have the meanings given them.\n\"Dental care services\" means services performed by a licensed dentist or any person working under the dentist's supervision as permitted under chapter 150A, which an enrollee might reasonably require to maintain good dental health, including preventive services, diagnostic services, emergency dental care, and restorative services.\n\"Dental plan\" means a policy, contract, or certificate offered by a dental organization for the coverage of dental care services. Dental plan means individual or group coverage.\n\"Dentist\" means a person licensed to practice dentistry under chapter 150A.\n\"Emergency dental care\" means the provision of dental care services for a sudden, acute dental condition that would lead a prudent layperson to reasonably expect that the absence of immediate care would result in serious impairment to the dentition or would place the person's oral health in serious jeopardy.\n\"Enrollee\" means an individual covered by a dental organization and includes an insured, policyholder, subscriber, contract holder, member, covered person, or certificate holder.\n\"Dental organization\" means a health insurer licensed under chapter 60A; a health service plan corporation licensed under chapter 62C; a health maintenance organization licensed under chapter 62D; a community integrated service network licensed under chapter 62N; or a third-party administrator that:\n(1) provides, either directly or through contracts with providers or other persons, dental care services;\n(2) arranges for the provision of these services to enrollees on the basis of a fixed, prepaid sum without regard to the frequency or extent of services furnished to any particular enrollee; or\n(3) administers dental plans.\n\"Dental provider contract\" means a written agreement between a dentist or dental clinic and dental organization to provide dental care services.\n\"Third party\" means a person or entity that enters into a contract with a dental organization or with another third party to gain access to the dental care services or contractual discounts under a dental provider contract. Third party does not include an enrollee of a dental organization or an employer or other group for whom the dental organization provides administrative services.",
	"repealed": false
}