{
	"id": "343.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/343.21",
	"title": "343.21 OVERWORKING OR MISTREATING ANIMALS; PENALTY.",
	"text": "No person shall overdrive, overload, torture, cruelly beat, neglect, or unjustifiably injure, maim, mutilate, or kill any animal, or cruelly work any animal when it is unfit for labor, whether it belongs to that person or to another person.\nNo person shall deprive any animal over which the person has charge or control of necessary food, water, or shelter.\nNo person shall keep any cow or other animal in any enclosure without providing wholesome exercise and change of air.\nNo person shall feed any cow on food which produces impure or unwholesome milk.\nNo person shall abandon any animal.\nNo person shall allow any maimed, sick, infirm, or disabled animal to lie in any street, road, or other public place for more than three hours after receiving notice of the animal's condition.\nNo person shall willfully instigate or in any way further any act of cruelty to any animal or animals, or any act tending to produce cruelty to animals.\nNo person shall cage any animal for public display purposes unless the display cage is constructed of solid material on three sides to protect the caged animal from the elements and unless the horizontal dimension of each side of the cage is at least four times the length of the caged animal. The provisions of this subdivision do not apply to the Minnesota State Agricultural Society, the Minnesota State Fair, or to the county agricultural societies, county fairs, to any agricultural display of caged animals by any political subdivision of the state of Minnesota, or to district, regional or national educational livestock or poultry exhibitions. The provisions of this subdivision do not apply to captive wildlife, the exhibition of which is regulated by section 97A.041.\nNo person shall intentionally and without justification do either of the following to a service animal while it is providing service or while it is in the custody of the person it serves: (1) cause bodily harm to the animal; or (2) otherwise render the animal unable to perform its duties.\n(a) Except as otherwise provided in this subdivision, a person who fails to comply with any provision of this section is guilty of a misdemeanor. A person convicted of a second or subsequent violation of subdivision 1 or 7 within five years of a previous violation of subdivision 1 or 7 is guilty of a gross misdemeanor.\n(b) A person who intentionally violates subdivision 1 or 7 where the violation results in substantial bodily harm to a pet or companion animal may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both.\n(c) A person convicted of violating paragraph (b) within five years of a previous gross misdemeanor or felony conviction for violating this section may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $5,000, or both.\n(d) A person who intentionally violates subdivision 1 or 7 where the violation results in death or great bodily harm to a pet or companion animal may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $5,000, or both.\n(e) A person who violates subdivision 8a where the violation renders the service animal unable to perform its duties is guilty of a gross misdemeanor.\n(f) A person who violates subdivision 8a where the violation results in substantial bodily harm to a service animal may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $5,000, or both.\n(g) A person who intentionally violates subdivision 1 or 7 where the violation results in substantial bodily harm to a pet or companion animal, and the act is done to threaten, intimidate, or terrorize another person, may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $5,000, or both.\n(h) A person who violates subdivision 8a where the violation results in death or great bodily harm to a service animal may be sentenced to imprisonment for not more than four years or to payment of a fine of not more than $10,000, or both.\n(i) A person who intentionally violates subdivision 1 or 7 where the violation results in death or great bodily harm to a pet or companion animal, and the act is done to threaten, intimidate, or terrorize another person, may be sentenced to imprisonment for not more than four years or to payment of a fine of not more than $10,000, or both.\n(a) The court shall order a person convicted of violating subdivision 8a to pay restitution for the costs and expenses resulting from the crime. Costs and expenses include, but are not limited to, the service animal user's loss of income, veterinary expenses, transportation costs, and other expenses of temporary replacement assistance services, and service animal replacement or retraining costs incurred by a school, agency, or individual. If the court finds that the convicted person is indigent, the court may reduce the amount of restitution to a reasonable level or order it paid in installments.\n(b) This section does not preclude a person from seeking any available civil remedies for an act that violates subdivision 8a.\nIf a person is convicted of violating this section, the court shall require that pet or companion animals that have not been seized by a peace officer or agent and are in the custody or control of the person must be turned over to a peace officer or other appropriate officer or agent unless the court determines that the person is able and fit to provide adequately for an animal. If the evidence indicates lack of proper and reasonable care of an animal, the burden is on the person to affirmatively demonstrate by clear and convincing evidence that the person is able and fit to have custody of and provide adequately for an animal. The court may limit the person's further possession or custody of pet or companion animals, and may impose other conditions the court considers appropriate, including, but not limited to:\n(1) imposing a probation period during which the person may not have ownership, custody, or control of a pet or companion animal;\n(2) requiring periodic visits of the person by an animal control officer or agent appointed pursuant to section 343.01, subdivision 1;\n(3) requiring performance by the person of community service; and\n(4) requiring the person to receive psychological, behavioral, or other counseling.",
	"repealed": false
}