{
	"id": "18G.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/18G.13",
	"title": "18G.13 LOCAL PEST CONTROL.",
	"text": "The purpose of this section is to authorize political subdivisions to establish and fund their own programs to control pests that are likely to cause economic or environmental harm or harm to human health.\nThe governing body of a county, city, or town may appropriate money to control native or exotic pests.\nThe governing body of the political subdivision may levy a tax on the taxable property within the subdivision to defray the cost of the activities authorized under subdivision 2.\nTo provide funds for activities authorized in subdivision 2 in advance of collection of the tax under subdivision 3, the governing body may, after the tax has been levied and certified to the county auditor for collection, issue certificates of indebtedness in anticipation of the collection and payment of the tax. The total amount of the certificates, including principal and interest, must not exceed 90 percent of the amount of the levy and must be payable from the proceeds of the levy no later than two years from the date of issuance. They must be issued on terms and conditions determined by the governing body and must be sold as provided in section 475.60. If the governing body determines that an emergency exists, it may make appropriations from the proceeds of the certificates for authorized purposes without complying with statutory or charter provisions requiring that expenditures be based on a prior budget authorization or other budgeting requirements.\nThe proceeds of a tax levied under subdivision 3 or an issue of certificates of indebtedness under subdivision 4 must be deposited in the municipal treasury in a separate fund and spent only for purposes authorized by this section. If no disbursement is made from the fund for a period of five years, any money remaining in the fund may be transferred to the general fund.\nA person who prevents, obstructs, or interferes with the county authorities or their agents in carrying out subdivisions 2 to 5, or neglects to comply with the rules and regulations of the county commissioners adopted under authority of those subdivisions, is guilty of a misdemeanor.\nA city council, board of county commissioners, or town board may by resolution or ordinance adopt and enforce regulations to control and prevent the spread of plant pests and diseases. The regulations may authorize appropriate officers and employees to:\n(1) enter and inspect any public or private place that might harbor plant pests;\n(2) provide for the summary removal of diseased trees from public or private places if necessary to prevent the spread of the disease;\n(3) require the owner to destroy or treat plant pests, diseased or invasive plants, or other infested material; and\n(4) provide for the work at the expense of the owner.\nThe expense must be a lien upon the property and may be collected as a special assessment as provided by section 429.101 or by charter. In this subdivision, \"private place\" means every place except a private home.",
	"repealed": false
}