{
	"id": "162.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.17",
	"title": "162.17 AGREEMENTS BETWEEN COUNTY AND CITY.",
	"text": "The governing body of any city having a population of 5,000 or more may enter into cooperative agreements with the county board of the county in which the city is located, providing for the division of costs and responsibilities to be borne by each for right-of-way, construction, improvement and maintenance, including snow removal, of county state-aid highways and municipal state-aid streets established and located within such cities.\nThe governing body of any city having a population of less than 5,000 may enter into an agreement with the county board of the county in which it is located for the construction of any county state-aid highway within the corporate limits of the city. The plans and specifications for the construction shall be prepared by the county engineer or by an engineer employed by the city as may be agreed upon by the governing body of the city and the county board, and shall be approved by the governing body and the county board. It may be agreed that the city shall perform the construction and that the county shall reimburse the city for its share thereof as may be agreed upon, or that the county shall perform the construction and that the city shall reimburse the county for its share thereof as may be agreed.\nThe governing body of any city having a population of less than 5,000 may enter into an agreement with the county board of the county in which it is located for the maintenance of and snow removal from any county state-aid highway within the corporate limits of the city. The agreement may provide that the maintenance and snow removal be performed by the county board at the sole expense of the county, or that the city perform the snow removal and maintenance and the county pay to the city an amount determined in accordance with the provisions of subdivision 4 hereof.\nIt shall be the primary duty of the county to maintain and to remove snow from all county state-aid highways within the corporate limits of any city in the county. If no agreement therefor be made with the governing body of the city, the county board may elect as to such cities in the county, either that the county perform the snow removal and maintenance or, in lieu thereof, that the county pay to the city annually, an amount per mile of the county state-aid highway within the corporate limits thereof, not less than the average annual cost per mile of maintaining and removing snow from all county state-aid highways of the county outside the corporate limits of any such city therein. If the latter election be made by the county board of any county, the governing body of any city affected shall be responsible for and shall maintain and remove the snow from the county state-aid highways within its corporate limits. On or before September 1 of each year, the county board shall notify the governing body of each city affected within the county of its election for the ensuing calendar year made pursuant to the provisions of this section.\nWhenever the governing body of a city enters into an agreement with a county as provided herein, it may appropriate to the county from any funds available such sums of money as it has agreed to pay. When a portion of the costs agreed to be paid by a city is to be assessed against benefited property, the letting of a public contract by the county for the work shall be deemed to be in compliance with statutory or charter provisions requiring the city:\n(1) to advertise for bids before awarding a contract for a public improvement;\n(2) to let the contract to the lowest responsible bidder; and\n(3) to require a performance bond to be filed by the contractor before undertaking the work.\nThe contract so let by the county and the performance bond required of the contractor by the county shall be considered to be the contract and bond of the city for purposes of complying with the requirements of any applicable law or charter provision, and the bond shall inure to the benefit of the city and operate for their protection to the same extent as though they were parties thereto. Nothing herein contained is a limitation of the power of any county to appoint the commissioner of transportation its agent to accept federal funds and award contracts for the construction, improvement, or maintenance of county state-aid highways pursuant to law, and any contract let by the commissioner of transportation as the agent of a county shall be construed hereunder as having been let by the county.",
	"repealed": false
}