{
	"id": "216B.166",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.166",
	"title": "216B.166 COGENERATING POWER PLANT.",
	"text": "The legislature finds and declares that significant public benefits may be derived from the cogeneration of electrical and thermal energy and that cogenerated district heating may result in improved utilization and conservation of fuel, the substitution of coal for scarce oil and natural gas, the substitution of domestic fuel for imported fuel, and the establishment of a reliable, competitively priced heat source. Since the cost of cogenerated thermal energy is dependent upon the method used to allocate costs between the production of electric and thermal energy at a power plant, and because the method of cost allocation can be a significant factor in determining investment in district heating, it is necessary to develop cost allocation methods rapidly.\nFor the purpose of this section, the following terms shall have the meanings given.\n(a) \"Cogeneration\" means a combined process whereby electrical and thermal energy are simultaneously produced by a public utility power plant.\n(b) \"District heating\" means a process whereby thermal energy is distributed within a community for use as a primary heat source.\n(c) \"District heating utility\" means any person, corporation, or other legal entity which owns and operates a facility for district heating.\nThe methods used to allocate or assign costs between electrical and thermal energy produced by cogeneration power plants owned by public utilities shall be consistent with the following principles:\n(a) The method used shall result in a cost per unit of electricity which is no greater than the cost per unit which would exist if the power plants owned by the public utility had been normally constructed and operated without cogenerating capability.\n(b) Costs which the public utility incurs for the exclusive benefit of the district heating utility, including but not limited to backup and peaking facilities, shall be assigned to thermal energy produced by cogeneration.\n(c) The methods and procedures may be different for retrofitted than for new cogeneration power plants.\n(d) The methods should encourage cogeneration while preventing subsidization by electric consumers so that both heating and electricity consumers are treated fairly and equitably with respect to the costs and benefits of cogeneration.",
	"repealed": false
}