{
	"id": "144.1215",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1215",
	"title": "144.1215 AUTHORIZATION TO USE HANDHELD DENTAL X-RAY EQUIPMENT.",
	"text": "For purposes of this section, \"handheld dental x-ray equipment\" means x-ray equipment that is used to take dental radiographs, is designed to be handheld during operation, and is operated by an individual authorized to take dental radiographs under chapter 150A.\n(a) Handheld dental x-ray equipment may be used if the equipment:\n(1) has been approved for human use by the United States Food and Drug Administration and is being used in a manner consistent with that approval; and\n(2) utilizes a backscatter shield that:\n(i) is composed of a leaded polymer or a substance with a substantially equivalent protective capacity;\n(ii) has at least 0.25 millimeters of lead or lead-shielding equivalent; and\n(iii) is permanently affixed to the handheld dental x-ray equipment.\n(b) The use of handheld dental x-ray equipment is prohibited if the equipment's backscatter shield is broken or not permanently affixed to the system.\n(c) The use of handheld dental x-ray equipment shall not be limited to situations in which it is impractical to transfer the patient to a stationary x-ray system.\n(d) Handheld dental x-ray equipment must be stored when not in use, by being secured in a restricted, locked area of the facility.\n(e) Handheld dental x-ray equipment must be calibrated initially and at intervals that must not exceed 24 months. Calibration must include the test specified in Minnesota Rules, part 4732.1100, subpart 11.\n(f) Notwithstanding Minnesota Rules, part 4732.0880, subpart 2, item C, the tube housing and the position-indicating device of handheld dental x-ray equipment may be handheld during an exposure.\nHandheld dental x-ray equipment used according to this section and according to manufacturer instructions is exempt from the following requirements for the equipment:\n(1) shielding requirements in Minnesota Rules, part 4732.0365, item B; and\n(2) requirements for the location of the x-ray control console or utilization of a protective barrier in Minnesota Rules, part 4732.0800, subpart 2, item B, subitems (2) and (3), provided the equipment utilizes a backscatter shield that satisfies the requirements in subdivision 2, paragraph (a), clause (2).\nA registrant using handheld dental x-ray equipment shall otherwise comply with Minnesota Rules, chapter 4732.",
	"repealed": false
}