{
	"id": "609.671",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.671",
	"title": "609.671 ENVIRONMENT; CRIMINAL PENALTIES.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Agency\" means the Pollution Control Agency.\n(c) \"Deliver\" or \"delivery\" means the transfer of possession of hazardous waste, with or without consideration.\n(d) \"Dispose\" or \"disposal\" has the meaning given it in section 115A.03, subdivision 9.\n(e) \"Hazardous air pollutant\" means an air pollutant listed under United States Code, title 42, section 7412(b).\n(f) \"Hazardous waste\" means any waste identified as hazardous under the authority of section 116.07, subdivision 4, except for those wastes exempted under Minnesota Rules, part 7045.0120, wastes generated under Minnesota Rules, part 7045.0213, and household appliances.\n(g) \"Permit\" means a permit issued by the Pollution Control Agency under chapter 115 or 116 or the rules promulgated under those chapters including interim status for hazardous waste facilities.\n(h) \"Solid waste\" has the meaning given in section 116.06, subdivision 22.\n(i) \"Toxic pollutant\" means a toxic pollutant on the list established under United States Code, title 33, section 1317.\n(a) For purposes of this section, an act is committed knowingly if it is done voluntarily and is not the result of negligence, mistake, accident, or circumstances that are beyond the control of the defendant. Whether an act was knowing may be inferred from the person's conduct, from the person's familiarity with the subject matter in question, or from all of the facts and circumstances connected with the case. Knowledge may also be established by evidence that the person took affirmative steps to shield the person from relevant information. Proof of knowledge does not require that a person knew a particular act or failure to act was a violation of law or that the person had specific knowledge of the regulatory limits or testing procedures involved in a case.\n(b) Knowledge of a corporate official may be established under paragraph (a) or by proof that the person is a responsible corporate official. To prove that a person is a responsible corporate official, it must be shown that:\n(1) the person is an official of the corporation, not merely an employee;\n(2) the person has direct control of or supervisory responsibility for the activities related to the alleged violation, but not solely that the person held a certain job or position in a corporation; and\n(3) the person had information regarding the offense for which the defendant is charged that would lead a reasonable and prudent person in the defendant's position to learn the actual facts.\n(c) Knowledge of a corporation may be established by showing that an illegal act was performed by an agent acting on behalf of the corporation within the scope of employment and in furtherance of the corporation's business interest, unless a high managerial person with direct supervisory authority over the agent demonstrated due diligence to prevent the crime's commission.\n(a) A person is guilty of a felony if the person:\n(1) commits an act described in subdivision 4, 5, 8, paragraph (a), or 12; and\n(2) at the time of the violation knowingly places another person in imminent danger of death, great bodily harm, or substantial bodily harm.\n(b) A person convicted under this subdivision may be sentenced to imprisonment for not more than ten years, or to payment of a fine of not more than $100,000, or both, except that a defendant that is an organization may be sentenced to payment of a fine of not more than $1,000,000.\nA person who knowingly disposes of or abandons hazardous waste or arranges for the disposal of hazardous waste at a location other than one authorized by the Pollution Control Agency or the United States Environmental Protection Agency, or in violation of any material term or condition of a hazardous waste facility permit, is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $50,000, or both.\n(a) A person is guilty of a felony who knowingly does any of the following:\n(1) delivers hazardous waste to any person other than a person who is authorized to receive the waste under rules adopted under section 116.07, subdivision 4, or under United States Code, title 42, sections 6921 to 6938;\n(2) treats or stores hazardous waste without a permit if a permit is required, or in violation of a material term or condition of a permit held by the person, unless:\n(i) the person notifies the agency prior to the time a permit would be required that the person will be treating or storing waste without a permit; or\n(ii) for a violation of a material term or condition of a permit, the person immediately notifies the agency issuing the permit of the circumstances of the violation as soon as the person becomes aware of the violation;\n(3) transports hazardous waste to any location other than a facility that is authorized to receive, treat, store, or dispose of the hazardous waste under rules adopted under section 116.07, subdivision 4, or under United States Code, title 42, sections 6921 to 6938;\n(4) transports hazardous waste without a manifest as required by the rules under section 116.07, subdivision 4; or\n(5) transports hazardous waste without a license required for the transportation of hazardous waste by chapter 221.\n(b) A person convicted under this subdivision may be sentenced to imprisonment for not more than three years, or to payment of a fine of not more than $25,000, or both. A person convicted for a second or subsequent offense may be sentenced to imprisonment for not more than five years, or to payment of a fine of not more than $50,000, or both.\nA person who commits any of the acts set forth in subdivision 4, 5, or 12 as a result of the person's gross negligence is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not more than $15,000, or both.\nWhen two or more offenses in violation of this section are committed by the same person in two or more counties within a two-year period, the accused may be prosecuted in any county in which one of the offenses was committed.\n(a) A person is guilty of a felony who knowingly:\n(1) causes the violation of an effluent standard or limitation for a toxic pollutant in a national pollutant discharge elimination system permit or state disposal system permit;\n(2) introduces into a sewer system or into a publicly owned treatment works a hazardous substance that the person knew or reasonably should have known is likely to cause personal injury or property damage; or\n(3) except in compliance with all applicable federal, state, and local requirements and permits, introduces into a sewer system or into a publicly owned treatment works a hazardous substance that causes the treatment works to violate an effluent limitation or condition of the treatment works' national pollutant discharge elimination system permit.\n(b) For purposes of paragraph (a), \"hazardous substance\" means a substance on the list established under United States Code, title 33, section 1321(b).\n(c) A person convicted under paragraph (a) may be sentenced to imprisonment for not more than three years, or to payment of a fine of not more than $50,000 per day of violation, or both.\n(d) A person is guilty of a crime who knowingly:\n(1) violates any effluent standard or limitation, or any water quality standard adopted by the agency;\n(2) violates any material term or condition of a national pollutant discharge elimination system permit or state disposal system permit;\n(3) fails to carry out any recording, reporting, monitoring, sampling, or information gathering requirement provided for under chapter 115 or 116; or\n(4) fails to file a discharge monitoring report or other document required for compliance with a national pollutant discharge elimination system or state disposal system permit.\n(e) A person convicted under paragraph (d) may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not less than $2,500 and not more than $25,000 per day of violation, or both. A person convicted for a second or subsequent offense may be sentenced to imprisonment for not more than two years, or to payment of a fine of not more than $50,000 per day of violation, or both.\n(a) A person is guilty of a felony who knowingly:\n(1) makes any false material statement, representation, or certification in; omits material information from; or alters, conceals, or fails to file or maintain a notice, application, record, report, plan, manifest, permit, license, or other document required under sections 103F.701 to 103F.755; chapter 115 or 116; the hazardous waste transportation requirements of chapter 221; or rules adopted under these laws; or\n(2) falsifies, tampers with, renders inaccurate, or fails to install any monitoring device or method required to be maintained or followed for the purpose of compliance with sections 103F.701 to 103F.755, chapter 115 or 116, or rules adopted under these laws.\n(b) Except as provided in paragraph (c), a person convicted under this subdivision may be sentenced to imprisonment for not more than two years, or to payment of a fine of not more than $10,000, or both.\n(c) A person convicted under this subdivision for a violation related to a notice or report required by an air permit issued by the agency as provided in United States Code, title 42, section 7661a(a), as amended through January 1, 1991, may be sentenced to payment of a fine of not more than $10,000 per day of violation.\n(a) A person is, upon conviction, subject to a fine of up to $25,000 or imprisonment for up to two years, or both, who:\n(1) is required to report the release of a hazardous substance under United States Code, title 42, section 9603, or the release of an extremely hazardous substance under United States Code, title 42, section 11004;\n(2) knows that a hazardous substance or an extremely hazardous substance has been released; and\n(3) fails to provide immediate notification of the release of a reportable quantity of a hazardous substance or an extremely hazardous substance to the state emergency response center and, if directed by the center, to notify a local 911 emergency dispatch center.\nFor purposes of clause (3), the state emergency response center shall direct a caller to notify a local 911 emergency dispatch center if the situation requires an immediate response or the area is unknown to the center. In all other cases, the state emergency response center must notify a local firefighting or law enforcement organization of the situation within 24 hours of receiving the notification.\n(b) For a second or subsequent conviction under this subdivision, the violator is subject to a fine of up to $50,000 or imprisonment for not more than five years, or both.\n(c) For purposes of this subdivision, a \"hazardous substance\" means a substance on the list established under United States Code, title 42, section 9602.\n(d) For purposes of this subdivision, an \"extremely hazardous substance\" means a substance on the list established under United States Code, title 42, section 11002.\n(e) For purposes of this subdivision, a \"reportable quantity\" means a quantity that must be reported under United States Code, title 42, section 9602 or 11002.\n(f) The penalties in paragraphs (a) and (b) do not apply to an employee of a state emergency response center to the extent that the employee is acting in the scope of that employee's official duties.\nA person who knowingly disposes of or arranges for the disposal of infectious waste as defined in section 116.76 at a location or in a manner that is prohibited by section 116.78 is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not more than $10,000, or both. A person convicted a second or subsequent time under this subdivision is guilty of a felony and may be sentenced to imprisonment for not more than two years, or to payment of a fine of not more than $25,000, or both.\n(a) A person is guilty of a felony who knowingly:\n(1) causes a violation of a national emission standard for a hazardous air pollutant adopted under United States Code, title 42, section 7412; or\n(2) causes a violation of an emission standard, limitation, or operational limitation for a hazardous air pollutant established in a permit issued by the Pollution Control Agency.\nA person convicted under this paragraph may be sentenced to imprisonment for not more than three years, or to payment of a fine of not more than $50,000 per day of violation, or both.\n(b) A person is guilty of a misdemeanor who knowingly violates:\n(1) a requirement of chapter 116, or a rule adopted under that chapter, that is an applicable requirement of the federal Clean Air Act, as defined in Federal Register, volume 57, page 32295;\n(2) a condition of an air emission permit issued by the agency under chapter 116 or a rule adopted under that chapter; or\n(3) a requirement to pay a fee based on air emissions under chapter 116 or a rule adopted under that chapter.\nA person convicted under this paragraph may be sentenced to imprisonment for not more than 90 days, or to payment of a fine of not more than $10,000 per day of violation, or both.\n(a) A person is guilty of a gross misdemeanor who:\n(1) knowingly disposes of solid waste at, transports solid waste to, or arranges for disposal of solid waste at a location that does not have a required permit for the disposal of solid waste; and\n(2) does so in exchange for or in expectation of money or other consideration.\n(b) A person convicted under this subdivision may be sentenced to imprisonment for not more than 364 days, or to payment of a fine of not more than $15,000, or both.\nExcept for intentional violations, a person is not guilty of a crime for air quality violations under subdivision 6 or 12, or for water quality violations under subdivision 8, if the person notified the Pollution Control Agency of the violation as soon as the person discovered the violation and took steps to promptly remedy the violation.",
	"repealed": false
}