{
	"id": "134.351",
	"url": "https://www.revisor.mn.gov/statutes/cite/134.351",
	"title": "134.351 MULTICOUNTY, MULTITYPE LIBRARY SYSTEMS.",
	"text": "The commissioner of education, upon the advice of the Advisory Council to the Division of State Library Services, may approve the establishment of multicounty, multitype library systems and the geographic boundaries of those systems.\nEach multicounty, multitype library system is encouraged to develop services including, but not limited to the following: referral of users, intrasystem reciprocal borrowing, cooperative collection development, cooperative reference services, staff development, research and development, cooperative storage facilities, publicity and community relations.\nIn order for a multicounty, multitype library system to qualify for planning, development, or operating aid pursuant to sections 134.353 and 134.354, each participating library in the system shall adopt an organizational agreement providing for the following:\n(a) Sharing of resources among all participating libraries;\n(b) Long-range planning for cooperative programs;\n(c) The development of a delivery system for services and programs;\n(d) The development of a bibliographic database; and\n(e) A communications system among all cooperating libraries.\n(a) In any area where the boundaries of a proposed multicounty, multitype library system coincide with the boundaries of the regional library system or district, the regional library system or district board shall be designated as the governing board for the multicounty, multitype library system. In any area where a proposed multicounty, multitype library system encompasses more than one regional library system or district, the governing board of the multicounty, multitype library system shall consist of nine members appointed by the cooperating regional library system or district boards from their own membership in proportion to the population served by each cooperating regional library system or district. In each multicounty, multitype library system there shall be established an advisory committee consisting of two representatives of public libraries, two representatives of school media services, one representative of special libraries, one representative of public supported academic libraries, and one representative of private academic libraries. The advisory committee shall recommend needed policy to the system governing board.\n(b) Upon recommendation from its advisory committee, a multitype library cooperation system governing board may choose to reconstitute the governance of the multitype system by the creation of a combined board which replaces the previous governing board and advisory committee. A combined board shall consist of five or seven citizens, not employed in library or information services, and four library or information service workers. The constituent regional public library system boards shall select the citizen members from the at-large population of the region. In any area where a multicounty, multitype library system encompasses more than one regional public library system, cooperating regional system boards shall appoint citizen members of the combined board members in proportion to the population of each cooperating regional system. The combined board members who are library and information workers shall be selected, one from each type of library: academic, public, school, and special. Governing board members of the combined board shall serve two-year terms for no more than three successive terms with the members of the first combined board serving one- and two-year terms as determined by lot with a simple majority serving for two years. Elections shall be pursuant to the adopted bylaws of the multitype system and may provide additional requirements to those in this section. New combined governing boards shall take effect at the beginning of the fiscal year, July 1, and shall continue the authority, ownership, and obligations of the previously constituted multitype system in its region.\nAll property given, granted, conveyed, donated, devised or bequeathed to, or otherwise acquired by any multicounty multitype library system board shall vest in, and be held in the name of, the multicounty multitype library system board. Any conveyance, grant, donation, devise, bequest, or gift made to, or in the name of, any multicounty multitype library system shall be deemed to have been made directly to the multicounty multitype library system board.\nAll property heretofore given, granted, conveyed, donated, devised, bequeathed to, or otherwise acquired by any multicounty multitype library system board is hereby validated, ratified and confirmed as the property of the board.\nEach multicounty, multitype system receiving aid pursuant to section 134.353 or 134.354 shall provide an annual progress report to the Department of Education.",
	"repealed": false
}