{
	"id": "243.1606",
	"url": "https://www.revisor.mn.gov/statutes/cite/243.1606",
	"title": "243.1606 ADVISORY COUNCIL ON INTERSTATE ADULT OFFENDER SUPERVISION.",
	"text": "The Advisory Council on Interstate Adult Offender Supervision shall be combined with the State Advisory Council for the Interstate Compact for Juveniles established by section 260.515 and consist of the following individuals or their designees:\n(1) the governor;\n(2) the chief justice of the supreme court;\n(3) two senators, one from the majority and the other from the minority party, selected by the Subcommittee on Committees of the senate Committee on Rules and Administration;\n(4) two representatives, one from the majority and the other from the minority party, selected by the house speaker;\n(5) the compact administrator, selected as provided in section 243.1607;\n(6) a representative from the Department of Children, Youth, and Families regarding the Interstate Compact for the Placement of Children;\n(7) the executive director of the Office of Justice Programs in the Department of Public Safety;\n(8) the deputy compact administrator as defined in section 260.515;\n(9) a representative from the State Public Defender's Office;\n(10) a representative from the Minnesota County Attorney's Association;\n(11) a representative from the Minnesota Sheriff's Association;\n(12) a representative from the Minnesota Association of County Probation Officers;\n(13) a representative from the Minnesota Association of Community Corrections Act Counties;\n(14) a representative from the community at large;\n(15) a representative from a community organization working with victims of crimes; and\n(16) other members as appointed by the commissioner of corrections.\nThe council may elect a chair from among its members.\nThe council shall oversee and administer the state's participation in both compacts described in sections 243.1605 and 260.515. The council shall appoint the compact administrator as the state's commissioner. In addition to these duties, the council shall develop a model policy concerning the operations and procedures of the compact within the state.\nBy March 1 of each year, the council shall report to the governor and the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over criminal justice policy on its activities along with providing a copy of the annual report published by the national commission that includes the activities of the interstate commission and executive committee as described in section 243.1605 for the preceding year. The council's annual report must also include information required of the State Advisory Council for the Interstate Compact for Juveniles as described in Article IV in section 260.515.\nThe provisions of section 15.059 apply to the council.",
	"repealed": false
}