{
	"id": "480.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.15",
	"title": "480.15 POWERS AND DUTIES.",
	"text": "The court administrator shall, under the supervision and direction of the chief justice, have the powers and duties prescribed by this section.\nThe court administrator shall examine the administrative methods and systems employed in the offices of the judges, court administrators, reporters, and employees of the courts and make recommendations, through the chief justice for the improvement of the same.\nThe court administrator shall examine the state of dockets of the courts and determine the need for assistance by any court.\nThe court administrator shall make recommendations to the chief justice relating to the assignment of judges where courts are in need of assistance and carry out the direction of the chief justice as to the assignments of judges to counties and districts where the courts are in need of assistance.\nThe court administrator shall collect and compile statistical and other data and make reports of the business transacted by the courts and transmit the same to the chief justice and to the respective houses of the legislature to the end that proper action may be taken in respect thereto.\nThe court administrator shall prepare and submit budget estimates of state appropriations necessary for the maintenance and operation of the judicial system and make recommendations in respect thereto.\nThe court administrator shall collect statistical and other data and make reports relating to the expenditure of public money, state and local, for the maintenance and operation of the judicial system and the offices connected therewith.\nThe court administrator shall obtain reports from court administrators in accordance with law or rules adopted by the supreme court of this state on cases and other judicial business in which action has been delayed beyond periods of time specified by law or rules of court and make report thereof to the supreme court of this state and to the respective houses of the legislature.\nThe court administrator shall collect, compile, and report the data on (1) charges and convictions for driving after suspension or revocation, and (2) payment of fines for violations related to operation of a motor vehicle, as required under section 171.325.\nThe court administrator shall formulate and submit to the respective houses of the legislature recommendations of policies for the improvement of the judicial system.\nThe court administrator shall submit annually, as of February 1, to the chief justice and the judicial council, a report of the activities of the Court Administrator's Office for the preceding calendar year.\nThe court administrator shall prepare uniform standards and procedures for the recruitment, evaluation, promotion, in-service training and discipline of all personnel in the court system other than judges, referees, judicial officers, court reporters and court services officers. The court administrator shall file a report on the uniform standards and procedures with the legislature by June 30, 1978.\nThe court administrator shall promulgate and administer uniform requirements for court budget and information systems, the compilation of statistical information, and the collection, storage and use of court records.\n(a) The state court administrator under the direction of the Judicial Council may promulgate uniform collections policies and procedures for the courts and may contract with credit bureaus, public and private collection agencies, the Department of Revenue, and other public or private entities providing collection services as necessary for the collection of court debts. The court collection process and procedures are not subject to section 16A.1285. Court debts referred to the Department of Revenue for collection are not subject to section 16D.07. Court debts referred to the Department of Revenue for revenue recapture are not subject to section 270A.08 or 270A.09.\n(b) Court debt means an amount owed to the state directly or through the judicial branch on account of a fee, duty, rent, service, overpayment, fine, assessment, surcharge, court cost, penalty, restitution, damages, interest, bail bond, forfeiture, reimbursement, liability owed, an assignment to the judicial branch, recovery of costs incurred by the judicial branch, or any other source of indebtedness to the judicial branch as well as amounts owed to other public or private entities for which the judicial branch acts in providing collection services, or any other amount owed to the judicial branch.\n(c) The courts must pay for the collection services of public or private collection entities as well as the cost of one or more court employees to provide collection interface services between the Department of Revenue, the courts, and one or more collection entities from the money collected. The portion of the money collected which must be paid to the collection entity as collection fees and costs and the portion of the money collected which must be paid to the courts or Department of Revenue for collection services are appropriated from the fund to which the collected money is due.\n(d) As determined by the state court administrator, collection costs shall be added to the debts referred to a public or private collection entity for collection.\nCollection costs shall include the fees of the collection entity, and may include, if separately provided, skip tracing fees, credit bureau reporting charges, fees assessed by any public entity for obtaining information necessary for debt collection, or other collection-related costs. Collection costs shall also include the costs of one or more court employees employed by the state court administrator to provide a collection interface between the collection entity, the Department of Revenue, and the courts.\nIf the collection entity collects an amount less than the total due, the payment is applied proportionally to collection costs and the underlying debt. Collection costs in excess of collection agency fees and court employee collection interface costs must be deposited in the general fund as nondedicated receipts.\nThe uniform collections policies and procedures under subdivision 10c must not allow collections of court debt, as defined in subdivision 10c, or referral of court debt to the Department of Revenue, that only arises from a single violation under section 169.06, subdivision 10, or 169.14, subdivision 13.\n[See Note.]\nThe court administrator shall attend to such other matters consistent with the powers delegated herein as may be assigned by the supreme court of this state.\nThe court administrator shall review plans submitted by a judicial district for office equipment under section 484.68, subdivision 3, clause (5), and shall determine eligibility for state funding or reimbursement for the equipment.",
	"repealed": false
}