{
	"id": "80E.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/80E.09",
	"title": "80E.09 PAYMENTS REQUIRED UPON TERMINATION, CANCELLATION, OR NONRENEWAL.",
	"text": "Upon the termination, cancellation, or nonrenewal of any franchise, the new motor vehicle dealer shall, in the time prescribed, be allowed fair and reasonable compensation by the manufacturer for the following items:\n(a) new motor vehicle inventory which was originally acquired from the manufacturer, as limited in paragraph (f);\n(b) equipment and furnishings if the new motor vehicle dealer purchased them from the manufacturer;\n(c) special tools;\n(d) supplies, including accessories and parts, purchased from the manufacturer;\n(e) a sum equal to the current fair rental value of the dealership facilities as an ongoing new motor vehicle dealership for a period of one year from the effective date of the termination, cancellation, or nonrenewal, or until the facilities are leased or sold, whichever is less, if the dealer owns the facilities. If the facilities are leased from a lessor other than the manufacturer, a sum equivalent to rent for the remainder of the term of the lease or one year, whichever is less. Payment under this clause shall not be required if the termination, cancellation, or nonrenewal was for good cause based on a conviction or plea of nolo contendere of the dealer or one of its principal owners for a crime which constitutes a felony as described in section 609.02, subdivision 2, or if it has been demonstrated that the dealer has exhibited a course of conduct constituting fraud with respect to the manufacturer or the general public. Nothing in this subdivision relieves the dealer from the obligation to mitigate damages upon termination, cancellation, or nonrenewal. Any amount due under this paragraph is reduced to the extent the dealership makes other use of the property, sells, leases or subleases the property, or secures release from a lease. If the dealer rejects reduction of facility rental value compensation as described in this paragraph, the manufacturer is entitled to use of the premises for the period for which compensation is to be provided or the dealer may elect to receive no compensation;\n(f) fair and reasonable compensation as applied to paragraphs (a) and (d) means the manufacturer shall reimburse the dealer for 100 percent of the net cost to the dealer, including transportation, of all new current model year motor vehicle inventory acquired from the manufacturer which has not been materially altered or substantially damaged, and all new motor vehicle inventory not of the current model year which has not been materially altered or substantially damaged; provided the noncurrent model year vehicles were acquired from the manufacturer and drafted on the dealer's financing source or paid for within 120 days prior to the effective date of the termination, cancellation, or nonrenewal. The manufacturer shall reimburse the dealer for 100 percent of the current net prices on motor vehicle accessories and parts, including superseded parts listed in current price lists or catalogues plus five percent of the current net price of all accessories and parts returned to compensate the dealer for handling, packing, and loading the parts;\n(g) if the termination, cancellation, or nonrenewal of the dealer's franchise is the result of the termination, elimination, or cessation of a line-make by the manufacturer, distributor, or factory branch, the franchiser shall compensate the dealer an amount equal to the fair market value of the franchise for the line-make as of the date the franchiser announces the action that results in termination, cancellation, or nonrenewal, provided that this paragraph does not apply with respect to a dealer's franchise for distribution of recreational vehicles as defined in section 168.002, subdivision 27.\nFair and reasonable compensation shall be paid by the manufacturer when possible within 90 days of the effective date of termination, cancellation, or nonrenewal, provided the dealer has clear title to the inventory and other items, is in a position to convey that title to the manufacturer and as long as this period will allow compliance with the notification requirements of any state or federal laws relating to creditor notification.\nFor the purposes of reimbursement under this section, termination, cancellation, or nonrenewal includes a voluntary termination, cancellation, or nonrenewal by the dealer, and the compensation provided for in subdivision 1, except paragraphs (e) and (g) thereof, shall be paid to the dealer.",
	"repealed": false
}