{
	"id": "291.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/291.005",
	"title": "291.005 DEFINITIONS.",
	"text": "Unless the context otherwise clearly requires, the following terms used in this chapter shall have the following meanings:\n(1) \"Commissioner\" means the commissioner of revenue or any person to whom the commissioner has delegated functions under this chapter.\n(2) \"Federal gross estate\" means the gross estate of a decedent as required to be valued and otherwise determined for federal estate tax purposes under the Internal Revenue Code, increased by the value of any property in which the decedent had a qualifying income interest for life and for which an election was made under section 291.03, subdivision 1d, for Minnesota estate tax purposes, but was not made for federal estate tax purposes.\n(3) \"Internal Revenue Code\" means the United States Internal Revenue Code of 1986, as amended through May 1, 2023.\n(4) \"Minnesota gross estate\" means the federal gross estate of a decedent after (a) excluding therefrom any property included in the estate which has its situs outside Minnesota, and (b) including any property omitted from the federal gross estate which is includable in the estate, has its situs in Minnesota, and was not disclosed to federal taxing authorities.\n(5) \"Nonresident decedent\" means an individual whose domicile at the time of death was not in Minnesota.\n(6) \"Personal representative\" means the executor, administrator or other person appointed by the court to administer and dispose of the property of the decedent. If there is no executor, administrator or other person appointed, qualified, and acting within this state, then any person in actual or constructive possession of any property having a situs in this state which is included in the federal gross estate of the decedent shall be deemed to be a personal representative to the extent of the property and the Minnesota estate tax due with respect to the property.\n(7) \"Resident decedent\" means an individual whose domicile at the time of death was in Minnesota. The provisions of section 290.01, subdivision 7, paragraphs (c) and (d), apply to determinations of domicile under this chapter.\n(8) \"Situs of property\" means, with respect to:\n(i) real property, the state or country in which it is located;\n(ii) tangible personal property, the state or country in which it was normally kept or located at the time of the decedent's death or for a gift of tangible personal property within three years of death, the state or country in which it was normally kept or located when the gift was executed;\n(iii) a qualified work of art, as defined in section 2503(g)(2) of the Internal Revenue Code, owned by a nonresident decedent and that is normally kept or located in this state because it is on loan to an organization, qualifying as exempt from taxation under section 501(c)(3) of the Internal Revenue Code, that is located in Minnesota, the situs of the art is deemed to be outside of Minnesota, notwithstanding the provisions of item (ii); and\n(iv) intangible personal property, the state or country in which the decedent was domiciled at death or for a gift of intangible personal property within three years of death, the state or country in which the decedent was domiciled when the gift was executed.\nFor a nonresident decedent with an ownership interest in a pass-through entity with assets that include real or tangible personal property, situs of the real or tangible personal property, including qualified works of art, is determined as if the pass-through entity does not exist and the real or tangible personal property is personally owned by the decedent. If the pass-through entity is owned by a person or persons in addition to the decedent, ownership of the property is attributed to the decedent in proportion to the decedent's capital ownership share of the pass-through entity.\n(9) \"Pass-through entity\" includes the following:\n(i) an entity electing S corporation status under section 1362 of the Internal Revenue Code;\n(ii) an entity taxed as a partnership under subchapter K of the Internal Revenue Code;\n(iii) a single-member limited liability company or similar entity, regardless of whether it is taxed as an association or is disregarded for federal income tax purposes under Code of Federal Regulations, title 26, section 301.7701-3; or\n(iv) a trust to the extent the property is includable in the decedent's federal gross estate; but excludes\n(v) an entity whose ownership interest securities are traded on an exchange regulated by the Securities and Exchange Commission as a national securities exchange under section 6 of the Securities Exchange Act, United States Code, title 15, section 78f.\nThe definitions set forth in section 524.1-201, wherever appropriate to the administration of the provisions of this chapter are incorporated by reference.",
	"repealed": false
}