{
	"id": "299L.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/299L.09",
	"title": "299L.09 LOTTERY SERVICE BUSINESS.",
	"text": "For purposes of this section:\n(a) A \"lottery service business\" is a commercial enterprise that for a fee or commission purchases lottery tickets on behalf of customers or subscribers.\n(b) \"Disqualifying offense\" means any felony, gross misdemeanor, and any criminal offense involving fraud, misrepresentation, or deceit.\n(a) All print advertising in any medium published by or on behalf of a lottery service business, and all print communications intended to solicit members, including Internet solicitations, for each lottery pool or subscription service offered, must contain a clear and prominent statement that discloses to the subscriber, either in print or in electronic format, a statement that describes how much of each subscriber's fees are used to buy tickets.\n(b) All advertising and solicitation described in paragraph (a) must contain the following statement in clear and readable type: \"This business is not affiliated with and is not an agent of the Minnesota State Lottery.\"\n(a) A lottery service business may not accept as a customer or subscriber any person under age 18, or make a payment of lottery winnings to a person under age 18.\n(b) Except as necessary for the lottery service business to fill a pool, a lottery service business and any officer, director, or employee of the business may not have any stake or own any shares in any lottery pool it creates for customers or subscribers.\nA lottery service business must deposit all money received as winnings from lottery tickets bought for or on behalf of customers or subscribers into a lottery prize account that it maintains separately from all other accounts of the business. The business may expend money from the account, including interest thereon, only to pay winnings to customers or subscribers and to make payments required under subdivision 5.\n(a) A lottery service business must make all good faith efforts to distribute money in its lottery prize account to customers and subscribers entitled thereto.\n(b) Any prizewinning money deposited in the lottery prize account that has not been distributed to customers or subscribers as winnings within one year after the date of the drawing becomes an unclaimed prize. On July 1 of each year, a lottery service business must transmit all unclaimed prizes, including all interest earned thereon while the prize was in the lottery prize account, to the commissioner. The commissioner shall deposit all payments under this subdivision in the general fund. This subdivision does not apply if the amount of prizewinning money in the account is less than $25.\nA lottery service business must keep a complete accounting and all records necessary to show fully the lottery service business's lottery transactions, including incoming revenue, tickets purchased, and winnings distributed.",
	"repealed": false
}