{
	"id": "162.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/162.07",
	"title": "162.07 APPORTIONMENT OF MONEY TO COUNTIES.",
	"text": "[Renumbered subd 1b]\n(a) For purposes of this subdivision, \"distribution amount\" means the amount identified in section 162.06, subdivision 1, after the deductions provided for in section 162.06 for administrative costs, disaster account, research account, and state park road account.\n(b) The apportionment sum is calculated as 68 percent of the distribution amount.\n(c) The excess sum is calculated as 32 percent of the distribution amount.\n(a) The commissioner shall apportion the apportionment sum, as calculated in subdivision 1a, to the several counties as provided in paragraphs (b) to (e).\n(b) An amount equal to ten percent of the apportionment sum shall be apportioned equally among the 87 counties.\n(c) An amount equal to ten percent of the apportionment sum shall be apportioned among the several counties so that each county shall receive of such amount the percentage that its motor vehicle registration for the calendar year preceding the one last past, determined by residence of registrants, bears to the total statewide motor vehicle registration.\n(d) An amount equal to 30 percent of the apportionment sum shall be apportioned among the several counties so that each county shall receive of such amount the percentage that its total lane-miles of approved county state-aid highways bears to the total lane-miles of approved statewide county state-aid highways. In 1997 and subsequent years no county may receive, as a result of an apportionment under this clause based on lane-miles rather than miles of approved county state-aid highways, an apportionment that is less than its apportionment in 1996.\n(e) An amount equal to 50 percent of the apportionment sum shall be apportioned among the several counties so that each county shall receive of such amount the percentage that its money needs bears to the sum of the money needs of all of the individual counties; provided, that the percentage of such amount that each county is to receive shall be adjusted so that each county shall receive in 1958 a total apportionment at least ten percent greater than its total 1956 apportionments from the state road and bridge fund; and provided further that those counties whose money needs are thus adjusted shall never receive a percentage of the apportionment sum less than the percentage that such county received in 1958.\n(a) The commissioner shall apportion the excess sum, as calculated in subdivision 1a, to the several counties as provided in paragraphs (b) and (c).\n(b) An amount equal to 40 percent must be apportioned among the several counties so that each county receives of that amount the percentage that its motor vehicle registration for the calendar year preceding the one last past, determined by residence of registrants, bears to the total statewide motor vehicle registration.\n(c) An amount equal to 60 percent must be apportioned among the several counties so that each county receives of that amount the percentage that its money needs bears to the sum of the money needs of all of the individual counties.\nFor the purpose of this section, money needs of each county are defined as the estimated total annual costs of constructing, over a period of 25 years, the county state-aid highway system located and established by that county. Costs incidental to construction, or a specified portion of those costs, as set forth in the commissioner's rules, may be included in determining money needs. To avoid variances in costs due to differences in construction policy, construction costs shall be estimated on the basis of the engineering standards developed cooperatively by the commissioner and the county engineers of the several counties.\nAn amount equal to a levy of 0.01596 percent on each rural county's total estimated market value for the last preceding calendar year shall be computed and shall be subtracted from the county's total estimated construction costs. The result thereof shall be the money needs of the county. For the purpose of this section, \"rural counties\" means all counties having a population of less than 175,000.\nAn amount equal to a levy of 0.00967 percent on each urban county's total estimated market value for the last preceding calendar year shall be computed and shall be subtracted from the county's total estimated construction costs. The result thereof shall be the money needs of the county. For the purpose of this section, \"urban counties\" means all counties having a population of 175,000 or more.\nOn or before September 1 of each year the county engineer of each county shall forward to the commissioner, on forms prepared by the commissioner, all information relating to the mileage, in lane-miles, of the county state-aid highway system in the county, and the money needs of the county that the commissioner deems necessary in order to apportion the county state-aid highway fund in accordance with the formula heretofore set forth. Upon receipt of the information the commissioner shall appoint a board consisting of the following county engineers:\n(1) two county engineers from the metropolitan highway construction district;\n(2) one county engineer from each nonmetropolitan highway district; and\n(3) one additional county engineer from each county with a population of 175,000 or more.\nNo county engineer shall be appointed under clause (1) or (2) so as to serve consecutively for more than four years. The board shall investigate and review the information submitted by each county and shall on or before the first day of November of each year submit its findings and recommendations in writing as to each county's lane-mileage and money needs to the commissioner on a form prepared by the commissioner. Final determination of the lane-mileage of each system and the money needs of each county shall be made by the commissioner.\nIn the event that any county shall fail to submit the information provided for herein, the commissioner shall estimate the lane-mileage and the money needs of the county. The estimate shall be used in determining the apportionment formula. The commissioner may withhold payment of the amount apportioned to the county until the information is submitted.",
	"repealed": false
}