{
	"id": "116P.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/116P.17",
	"title": "116P.17 ACQUIRING LANDS OR INTEREST IN LANDS; COMMISSIONER APPROVAL.",
	"text": "(a) A recipient of an appropriation from the trust fund who acquires an interest in real property must receive written approval from the commissioner of natural resources prior to the acquisition, if the interest is acquired in whole or in part with the appropriation. A recipient must request the commissioner's approval at least ten business days before the proposed acquisition. When a recipient requests approval under this subdivision, the recipient must simultaneously submit the same information to the commission. Conservation easements to be held by the Board of Water and Soil Resources, acquisitions of land in the metropolitan regional recreation open space systems as defined under section 473.351, subdivision 1, with appropriations to the Metropolitan Council, and acquisitions specifically identified in appropriation laws are not subject to commissioner approval under this section.\n(b) The commissioner shall approve acquisitions under this section only when the interest in real property:\n(1) is identified as a high priority by the commissioner and meets the objectives and criteria identified in the applicable acquisition plan for the intended management status of the property; or\n(2) is otherwise identified by the commissioner as a priority for state financing.\nAt least ten business days prior to acquiring an interest in real property with an appropriation from the trust fund, a recipient of an appropriation must submit the most recent tax assessed value and most recent tax statement of the real property and the amount the recipient plans to offer for the interest in real property to the commission and the commissioner of natural resources. Conservation easements to be held by the Board of Water and Soil Resources are not subject to the requirements of this section. The board shall keep a record of the tax assessed value of the real property at the time of acquisition and the most recent tax statement.",
	"repealed": false
}