{
	"id": "115.7411",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.7411",
	"title": "115.7411 ADVISORY COUNCIL ON WATER SUPPLY SYSTEMS AND WASTEWATER TREATMENT FACILITIES.",
	"text": "The Advisory Council on Water Supply Systems and Wastewater Treatment Facilities shall advise the commissioners of health and the Pollution Control Agency regarding classification of water supply systems and wastewater treatment facilities, qualifications and competency evaluation of water supply system operators and wastewater treatment facility operators, and additional laws, rules, and procedures that may be desirable for regulating the operation of water supply systems and of wastewater treatment facilities. The advisory council is composed of 11 voting members, of whom:\n(1) one member must be from the Department of Health, Division of Environmental Health, appointed by the commissioner of health;\n(2) one member must be from the Pollution Control Agency appointed by the commissioner of the Pollution Control Agency;\n(3) three members must be certified water supply system operators, appointed by the commissioner of health, one of whom must represent a nonmunicipal community or nontransient noncommunity water supply system;\n(4) three members must be certified wastewater treatment facility operators, appointed by the commissioner of the Pollution Control Agency;\n(5) one member must be a representative from an organization representing municipalities, appointed by the commissioner of health with the concurrence of the commissioner of the Pollution Control Agency; and\n(6) two members must be members of the public who are not associated with water supply systems or wastewater treatment facilities. One must be appointed by the commissioner of health and the other by the commissioner of the Pollution Control Agency. Consideration should be given to one of these members being a representative of academia knowledgeable in water or wastewater matters.\nAt least one of the water supply system operators and at least one of the wastewater treatment facility operators must be from outside the seven-county metropolitan area and one wastewater treatment facility operator must be from the Metropolitan Council.\nThe terms of the appointed members and the compensation and removal of all members are governed by section 15.059.\nWhen new members are appointed to the council, a chair must be elected at the next council meeting. The Department of Health representative shall serve as secretary of the council.",
	"repealed": false
}