{
	"id": "325J.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/325J.04",
	"title": "325J.04 PAWN TICKETS.",
	"text": "At the time of making the pawn or purchase transaction, the pawnbroker shall immediately and legibly record in English the following information by using ink or other indelible medium on forms or in a computerized record approved by the municipality:\n(1) a complete and accurate description of the property, including model and serial number if indicated on the property;\n(2) the full name, residence address, residence telephone number, and date of birth of the pledgor or seller;\n(3) date and time of pawn or purchase transaction;\n(4) the identification number and state of issue from one of the following forms of identification of the seller or pledgor: current valid Minnesota driver's license; current valid Minnesota identification card; or current valid photo identification card issued by another state or a province of Canada;\n(5) description of the pledgor including approximate height, sex, and race;\n(6) amount advanced or paid;\n(7) the maturity date of the pawn transaction and the amount due; and\n(8) the monthly and annual interest rates, including all pawn fees and charges.\nThe following shall be printed on all pawn tickets:\n(1) the statement that \"Any personal property pledged to a pawnbroker within this state is subject to sale or disposal when there has been no payment made on the account for a period of not less than 60 days past the date of the pawn transaction, renewal, or extension; no further notice is necessary. There is no obligation for the pledgor to redeem pledged goods.\";\n(2) the statement that \"The pledgor of this item attests that it is not stolen, it has no liens or encumbrances against it, and the pledgor has the right to sell or pawn the item.\";\n(3) the statement that \"This item is redeemable only by the pledgor to whom the receipt was issued, or any person identified in a written and notarized authorization to redeem the property identified in the receipt, or a person identified in writing by the pledgor at the time of the initial transaction and signed by the pledgor. Written authorization for release of property to persons other than the original pledgor must be maintained along with the original transaction record.\"; and\n(4) a blank line for the pledgor's signature.",
	"repealed": false
}