{
	"id": "600.135",
	"url": "https://www.revisor.mn.gov/statutes/cite/600.135",
	"title": "600.135 PHOTOGRAPHIC COPIES OF BUSINESS AND PUBLIC RECORDS.",
	"text": "If any business, institution, member of a profession or calling, or any department or agency of government, in the regular course of business or activity has kept or recorded any memorandum, writing, entry, print, representation or combination thereof, of any act, transaction, occurrence or event, and in the regular course of business has caused any or all of the same to be recorded, copied or reproduced by any photographic, photostatic, microfilm, microcard, miniature photographic, optical disk imaging, or other process which accurately reproduces or forms a durable medium for so reproducing the original, the original may be destroyed in the regular course of business unless held in a custodial or fiduciary capacity or unless its preservation is required by law. Such reproduction, when satisfactorily identified, is as admissible in evidence as the original itself in any judicial or administrative proceeding whether the original is in existence or not and an enlargement or facsimile of such reproduction is likewise admissible in evidence if the original reproduction is in existence and available for inspection under direction of court. The introduction of a reproduced record, enlargement or facsimile, does not preclude admission of the original.\nThe phrase \"in the regular course of business\" as used in subdivision 1 with reference to making reproductions of originals not held in a custodial or fiduciary capacity nor required by law to be preserved and also with reference to destroying such originals shall be construed to include reproducing at any time and destroying at any time, respectively, if done in good faith and without intent to defraud, and with reference to making reproductions of originals held in a custodial or fiduciary capacity shall be construed to mean reproducing at any time in good faith and without intent to defraud and whether or not made with the intention of thereafter destroying such originals. Neither the manner in which an original is destroyed, whether voluntarily or by casualty or otherwise, nor the fact that it was destroyed while it was held in a custodial or fiduciary capacity shall affect the admissibility of a reproduction. This subdivision shall not be construed to exclude from evidence any document or copy thereof which is otherwise admissible under the Rules of Evidence.\nThis section shall be so interpreted and construed as to effectuate its general purpose of making uniform the law of those states which enact it.\nThis section may be cited as the Uniform Photographic Copies of Business and Public Records as Evidence Act.",
	"repealed": false
}