{
	"id": "473.553",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.553",
	"title": "473.553 COMMISSION; MEMBERSHIP; ADMINISTRATION.",
	"text": "The Metropolitan Sports Facilities Commission is established and shall be organized, structured, and administered as provided in this section.\nThe commission shall consist of six members, appointed by the city council of the city in which the stadium is located plus a chair appointed as provided in subdivision 3.\nThe chair shall be appointed by the governor as the ninth voting member and shall meet all of the qualifications of a member, except the chair need only reside outside the city of Minneapolis. The chair shall preside at all meetings of the commission, if present, and shall perform all other duties and functions assigned by the commission or by law. The commission may appoint from among its members a vice-chair to act for the chair during temporary absence or disability.\nA member shall not during a term of office hold the office of Metropolitan Council member or be a member of another metropolitan agency or hold any judicial office or office of state government. None of the members appointed by the city council of the city in which the stadium is located shall be an elected public official of that city or of another political subdivision any part of whose territory is shared with that city. Each member shall qualify by taking and subscribing the oath of office prescribed by the Minnesota Constitution, article V, section 6. The oath, duly certified by the official administering it, shall be filed with the chair of the Metropolitan Council.\nMS 1992 [Repealed, 1994 c 628 art 3 s 209]\nThe terms of three members shall end the first Monday in January in the year ending in the numeral \"5.\" The terms of the other members and the chair shall end the first Monday in January in the year ending in the numeral \"7.\" The term of each member and the chair shall be four years. The terms shall continue until a successor is appointed and qualified. Members may be removed only for cause.\nA vacancy shall be filled by the appointing authority in the same manner in which the original appointment was made.\nEach commission member shall be paid $50 for each day when the member attends one or more meetings or provides other services, as authorized by the commission, and shall be reimbursed for all actual and necessary expenses incurred in the performance of duties. The chair of the Metropolitan Sports Facilities Commission shall receive, unless otherwise provided by other law, a salary in an amount fixed by the members of the commission and shall be reimbursed for reasonable expenses to the same extent as a member. The annual budget of each commission shall provide as a separate account anticipated expenditures for per diem, travel, and associated expenses for the chair and members, and compensation or reimbursement shall be made to the chair and members only when budgeted.\nThe commission shall meet regularly at least once each month, at such time and place as the commission shall by resolution designate. Special meetings may be held at any time upon the call of the chair or a majority of the members, upon written notice to each member at least three days prior to the meeting, or upon such other notice as the commission may by resolution provide. Unless otherwise provided, any action within the authority of the commission may be taken by the affirmative vote of a majority of the members. A majority of all of the members of the commission shall constitute a quorum, but a lesser number may meet and adjourn from time to time and compel the attendance of absent members.\n(a) The council shall by resolution adopt guidelines for a personnel code relating to the employees of the commission, except that nothing in Laws 1974, chapter 422, shall impair the rights of the commission or employee under sections 473.405 and 473.415. After adoption of the guidelines, the commission shall by resolution adopt a personnel code in general conformance therewith. The code shall include a job classification plan, procedures for employment and promotion of personnel based on merit, procedures for the demotion, suspension, or discharge of employees, procedures for hearing grievances, procedures for salary administration, and such other provisions as the council deems appropriate. In addition, the code shall provide for the development by the commission of affirmative action plans, as provided in section 473.143. The executive director of the commission shall administer the code, and the commission shall not take any action inconsistent with the personnel code.\n(b) When a commission employee has been demoted, suspended, or dismissed by the executive director, the employee may, within 30 days after such action becomes effective, file with the commission a written request for a hearing showing the position from which the employee was dismissed, the date of dismissal, and the reason for requesting the hearing, full name and present mailing address. Upon receipt of a request for a hearing the commission shall appoint three of its members to act as an appeal committee and preside at a hearing on the action of the executive director. The hearing shall be held within 30 days after the request is received by the commission, upon written notice mailed or delivered to the employee at the employee's present mailing address, not less than seven days before the hearing. The appeal committee shall approve or disapprove the action of the executive director, and in the case of approval the action of the executive director shall be final. In the case of disapproval the appeal committee may reinstate the employee under such conditions as it deems proper, and may order the payment to the employee of compensation lost as a result of the demotion, suspension or dismissal.\nAt its first regular meeting each year the commission shall appoint a secretary and a treasurer or, in the alternative, a secretary-treasurer. The secretary and treasurer, or secretary-treasurer, may, but need not be, members of the commission, and shall hold office at the pleasure of the commission, subject to the terms of any contract of employment which the commission may enter into with the secretary or treasurer. The secretary shall record the minutes of all meetings of the commission and shall be the custodian of all books and records of the commission except such as the commission shall entrust to the custody of a designated employee. The treasurer shall be the custodian of all moneys received by the commission except such as the commission shall entrust to the custody of a designated employee. The commission may appoint a deputy to perform any and all functions of either the secretary or the treasurer.\nThe chair of the commission shall, subject to the approval of the commission, appoint an executive director who shall be chosen solely on the basis of training, experience, and other qualifications, and who shall serve at the pleasure of the commission. The executive director shall attend meetings of the commission, but shall not vote, and shall have the following powers and duties:\n(a) See that all resolutions, rules, or orders of the commission are enforced.\n(b) Appoint and remove, subject to the provisions of the personnel code adopted pursuant to subdivision 9, upon the basis of merit and fitness, all subordinate officers and regular employees of the commission.\n(c) Present to the commission plans, studies, and reports prepared for commission purposes and recommend to the commission for adoption such measures as the executive director deems necessary to enforce or carry out the powers and duties of the commission, or to the efficient administration of the affairs of the commission.\n(d) Keep the commission fully advised as to its financial condition, and prepare and submit to the commission its annual budget and such other financial information as it may request.\n(e) Recommend to the commission for adoption such rules as the executive director deems necessary for the efficient operation of the commission's functions.\n(f) Perform such other duties as may be prescribed by the commission.\n(a) The commission shall adopt resolutions and bylaws, an administrative code establishing procedures for commission action, keeping records, approving claims, authorizing and making disbursements, authorizing contracts, safekeeping funds and audit of all financial operations of the commission.\n(b) The commission and the council may enter into contracts with each other and with other commissions and governmental units for the joint exercise of powers in the manner provided by section 471.59; provided that the commission shall not enter into any contract with the council which would assign any operations authority, responsibility or function, other than planning or making studies, from the commission to the council.\nIn all acquisitions the commission shall provide as a cost of acquisition the relocation assistance, services, payments and benefits required by the Uniform Relocation Assistance and Real Property Acquisition Policies Act of 1970, 84 Stat. 1894 (1971), United States Code, title 42, section 4601, et seq.\nMS 2006 [Repealed, 2008 c 277 art 1 s 98]",
	"repealed": false
}