{
	"id": "65B.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.81",
	"title": "65B.81 DISCLOSURE OF INFORMATION.",
	"text": "After receiving a written request, an insurance company must release to an authorized person any relevant information in the company's possession that relates to the motor vehicle theft. Relevant information is limited to:\n(1) pertinent insurance policy information, including the application for a policy, that is relevant to a motor vehicle theft under investigation by the authorized person;\n(2) policy premium payment records that are available;\n(3) a history of previous claims made by the insured including, where the insured is a corporation or partnership, a history of previous claims by a subsidiary or any affiliates, and a history of claims of any other business association in which individual officers or partners or their spouses were known to be involved; and\n(4) material relating to the investigation of the theft, including statements of any person, proof of loss, and any other evidence relevant to the investigation.\nIf an insurance company has reason to believe that a motor vehicle theft in which it has an interest may be fraudulently claimed, the company shall, in writing, notify an authorized person and provide the person with all relevant information specified in subdivision 1 relating to the motor vehicle theft. It is sufficient for the purpose of this subdivision if an insurance company notifies and provides relevant information to one authorized person.\nAn authorized person provided with information under subdivision 1 or 2 may, to further official purposes, release or provide the information to any other authorized person.\nAn insurance company that provides information to an authorized person may request relevant information in writing from the authorized person and the authorized person must provide the requested information within 30 days. The relevant information provided under this subdivision may not include nonconviction criminal history record information or any other information that is detrimental to an ongoing criminal investigation or would reveal the identity of a confidential source of information. An authorized person who does not furnish the requested information shall notify the insurance company of the reasons why the information cannot be furnished within 30 days of the request.\nAn insurance company or its agent acting in its behalf, or an authorized person who releases information, whether oral or written, acting in good faith, under subdivisions 1 to 3, is immune from any liability, civil or criminal, that might otherwise be incurred or imposed.",
	"repealed": false
}