{
	"id": "148F.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.08",
	"title": "148F.08 SPONSOR'S APPLICATION FOR APPROVAL.",
	"text": "Individuals, organizations, associations, corporations, educational institutions, or groups intending to offer continuing education activities for approval must submit to the board the sponsor application fee and a completed application for approval on a form provided by the board. The sponsor must comply with the following to receive and maintain approval:\n(1) submit the application for approval at least 60 days before the activity is scheduled to begin; and\n(2) include the following information in the application for approval to enable the board to determine whether the activity complies with section 148F.075:\n(i) a statement of the objectives of the activity and the knowledge the participants will have gained upon completion of the activity;\n(ii) a description of the content and methodology of the activity which will allow the participants to meet the objectives;\n(iii) a description of the method the participants will use to evaluate the activity;\n(iv) a list of the qualifications of each instructor or developer that shows the instructor's or developer's current knowledge and skill in the activity's subject;\n(v) a description of the certificate or other form of verification of attendance distributed to each participant upon successful completion of the activity;\n(vi) the sponsor's agreement to retain attendance lists for a period of five years from the date of the activity; and\n(vii) a copy of any proposed advertisement or other promotional literature.\nIf the board approves an activity it shall assign the activity a number. The approval remains in effect for one year from the date of initial approval. Upon expiration, a sponsor must submit a new application for activity approval to the board as required by subdivision 1.\nEach sponsor of an approved activity shall include in any promotional literature a statement that \"This activity has been approved by the Minnesota Board of Behavioral Health and Therapy for ... hours of credit.\"\nThe activity sponsor must submit proposed changes in an approved activity to the board for its approval.\nThe board shall not approve an activity if it does not meet the continuing education requirements in section 148F.075. The board shall notify the sponsor in writing of its reasons for denial.\nThe board shall revoke its approval of an activity if a sponsor falsifies information contained in its application for approval, or if a sponsor fails to notify the board of changes to an approved activity as required in subdivision 4.",
	"repealed": false
}