{
	"id": "122A.631",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.631",
	"title": "122A.631 SUPPORTING HERITAGE LANGUAGE AND CULTURE TEACHERS.",
	"text": "The purpose of this section is to increase the number of heritage language and culture teachers in Minnesota.\n\"Heritage language and culture teacher \" means a teacher with a familial connection to their community's language and culture, who is proficient in the language and engaged in the culture, and uses this connection to support students as they learn academic content, become proficient in the language, and engage with the culture of that particular community. For the purposes of this section, a heritage language and culture teacher of American Sign Language is a teacher with a childhood connection to American Sign Language and whose primary language is American Sign Language.\nApplicants for the heritage language and culture licensure pathway program must:\n(1) hold a current license issued by the Professional Educator Licensing and Standards Board or meet the criteria for licensure in section 122A.181; and\n(2) seek initial, dual, or additional licensure in a heritage language.\n(a) The Professional Educator Licensing and Standards Board shall develop a program to support initial and additional licensure for heritage language and culture teachers. The board may prioritize the participation of heritage language and culture teachers whose own heritage language is within the most common languages spoken by Minnesota students, as indicated by the Department of Education report on primary home languages, and for which there are fewer teacher preparation programs for that licensure area or fewer teachers that hold a license in that area. The program must include:\n(1) a yearlong mentorship program;\n(2) monthly meetings where applicants receive guidance on completing the portfolio process from a portfolio liaison, dedicated specifically to facilitating this program;\n(3) a stipend to cover substitute teachers when meetings take place during the school day;\n(4) a waiver for all portfolio and licensure testing fees; and\n(5) a portfolio review committee created by the board.\n(b) For applicants seeking an initial license in a world language and culture, the applicant must demonstrate meeting the standards of effective practice in Minnesota Rules, part 8710.2000, and content-specific pedagogical standards in Minnesota Rules, part 8710.4950, through the portfolio process.\n(c) For applicants seeking a dual license, the applicant must demonstrate meeting the standards of effective practice in Minnesota Rules, part 8710.2000, content-specific pedagogical standards in Minnesota Rules, part 8710.4950, and all standards for the chosen dual license through the portfolio process.\n(d) For applicants seeking an additional license in a world language and culture, the applicant must demonstrate meeting the content-specific pedagogical standards in Minnesota Rules, part 8710.4950.\nHeritage language and culture teachers seeking a world language and culture license pursuant to Minnesota Rules, part 8710.4950, who demonstrate proficiency through one of the following may use this proficiency to evidence meeting the required content-specific world language and culture standards, which do not include content-specific pedagogical standards, for licensure in their heritage language:\n(1) passing a board-adopted assessment;\n(2) holding a certificate to serve as a translator or interpreter; or\n(3) completing an undergraduate or postbaccalaureate degree from an accredited university where the majority of coursework was taught via the non-English instructional language.",
	"repealed": false
}