{
	"id": "182.666",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.666",
	"title": "182.666 PENALTIES.",
	"text": "Any employer who willfully or repeatedly violates the requirements of section 182.653, or any standard, rule, or order adopted under the authority of the commissioner as provided in this chapter, may be assessed a fine not to exceed $156,259 for each violation. The minimum fine for a willful violation is $11,162.\nAny employer who has received a citation for a serious violation of its duties under section 182.653, or any standard, rule, or order adopted under the authority of the commissioner as provided in this chapter, shall be assessed a fine not to exceed $15,625 for each violation. If a serious violation under section 182.653, subdivision 2, causes or contributes to the death of an employee, the employer shall be assessed a fine of up to $25,000 for each violation.\n(a) Notwithstanding any other provision of this section, if any (1) serious, willful, or repeated violation other than a violation of section 182.653, subdivision 2; or (2) failure to correct a violation pursuant to subdivision 4 causes or contributes to the death of an employee, the minimum total nonnegotiable fine which shall be assessed for all citations connected to the death of an employee is $50,000 if there is a willful or repeated violation or $25,000 if there is no willful or repeated violation, except as provided in paragraph (b).\n(b) If there is no willful or repeated violation and the employer has fewer than 50 employees, the employer shall be assessed an initial fine of $5,000 and an additional fine of $5,000 for each of the following four years. The commissioner may elect to waive the $5,000 fine for any of the following four years if the employer received no citations in the preceding calendar year.\n(c) If the business or enterprise employs fewer than 50 employees, this subdivision does not apply to the death of an employee who owns a controlling interest in the business or enterprise, except if the commissioner determines that a fine shall be assessed.\nAny employer who has received a citation for a violation of its duties under section 182.653, subdivisions 2 to 4, where the violation is specifically determined not to be of a serious nature as provided in section 182.651, subdivision 12, may be assessed a fine of up to $15,625 for each violation.\nAny employer who fails to correct a violation for which a citation has been issued under section 182.66 within the period permitted for its correction, which period shall not begin to run until the date of the final order of the commissioner in the case of any review proceedings under this chapter initiated by the employer in good faith and not solely for delay or avoidance of penalties, may be assessed a fine of not more than $15,625 for each day during which the failure or violation continues.\nAny employer who violates any of the posting requirements, as prescribed under this chapter, except those prescribed under section 182.661, subdivision 3a, shall be assessed a fine of up to $15,625 for each violation.\nAny employer who knowingly violates section 182.6575 shall be assessed a fine of up to $7,000 for each violation. The employer shall also be liable to each aggrieved employee for civil punitive damages of $400.\nOnly the commissioner shall have authority to assess all proposed fines provided in this section. Notwithstanding the factors in section 14.045, subdivision 3, the commissioner must give due consideration only to the following factors:\n(1) appropriateness of the fine with respect to the size of the business of the employer;\n(2) the gravity of the violation;\n(3) the good faith of the employer; and\n(4) the history of previous violations.\n(a) The commissioner shall increase the fines in subdivisions 1 to 5, except for the fine for a serious violation under section 182.653, subdivision 2, that causes or contributes to the death of an employee, to the amounts of the corresponding federal penalties for the specified violations promulgated in United States Code, title 29, section 666, subsections (a) and (b), as amended through November 5, 1990, and adjusted according to United States Code, title 28, section 2461, note (Federal Civil Penalties Inflation Adjustment), as amended through November 2, 2015. A maximum fine shall not be reduced under this subdivision. The fines shall be increased to the nearest one dollar.\n(b) A fine increased under this subdivision takes effect on the next October 1 after any increases to the corresponding federal penalties and applies to all fines assessed on or after October 1.\n(c) No later than September 1 of each year, the commissioner shall give notice in the State Register of any increases to the corresponding federal penalties and the resulting increase to the fines in subdivisions 1 to 5.\nFines imposed under this chapter shall be paid to the commissioner for deposit in the special compensation fund and may be recovered in a civil action in the name of the department brought in the district court of the county where the violation is alleged to have occurred or the district court where the commissioner has an office. Unpaid fines shall be increased to 125 percent of the original assessed amount if not paid within 60 days after the fine becomes a final order. After that 60 days, unpaid fines shall accrue an additional penalty of ten percent per month compounded monthly until the fine is paid in full or until the fine has accrued to 300 percent of the original assessed amount.",
	"repealed": false
}