{
	"id": "216B.1696",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1696",
	"title": "216B.1696 COMPETITIVE RATE FOR ENERGY-INTENSIVE, TRADE-EXPOSED ELECTRIC UTILITY CUSTOMER.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Clean energy technology\" is energy technology that generates electricity from a carbon neutral generating resource including, but not limited to, solar, wind, hydroelectric, and biomass.\n(c) \"Energy-intensive trade-exposed customer\" is defined to include:\n(1) an iron mining extraction and processing facility, including a scram mining facility as defined in Minnesota Rules, part 6130.0100, subpart 16;\n(2) a paper mill, wood products manufacturer, sawmill, or oriented strand board manufacturer;\n(3) a steel mill and related facilities; and\n(4) a retail customer of an investor-owned electric utility that has facilities under a single electric service agreement that: (i) collectively imposes a peak electrical demand of at least 10,000 kilowatts on the electric utility's system, (ii) has a combined annual average load factor in excess of 80 percent, and (iii) is subject to globally competitive pressures and whose electric energy costs are at least ten percent of the customer's overall cost of production.\n(d) \"EITE rate schedule\" means a rate schedule under which an investor-owned electric utility may set terms of service to an individual or group of energy-intensive trade-exposed customers.\n(e) \"EITE rate\" means the rate or rates offered by the investor-owned electric utility under an EITE rate schedule.\n(a) It is the energy policy of the state of Minnesota to ensure competitive electric rates for energy-intensive trade-exposed customers. To achieve this objective, an investor-owned electric utility that has at least 50,000 retail electric customers, but no more than 200,000 retail electric customers, shall have the ability to propose various EITE rate options within their service territory under an EITE rate schedule that include, but are not limited to, fixed-rates, market-based rates, and rates to encourage utilization of new clean energy technology.\n(b) Notwithstanding section 216B.03, 216B.05, 216B.06, 216B.07, or 216B.16, the commission shall, upon a finding of net benefit to the utility or the state, approve an EITE rate schedule and any corresponding EITE rate.\n(c) The commission shall make a final determination in a proceeding begun under this section within 90 days of a miscellaneous rate filing by the electric utility.\n(d) Upon approval of any EITE rate schedule, the utility shall create a separate account to track the difference in revenue between what would have been collected under the electric utility's applicable standard tariff and the EITE rate schedule. In its next general rate case or through an EITE cost recovery rate rider between general rate cases, the commission shall allow the utility to recover any costs, including reduced revenues, or refund any savings, including increased revenues, associated with providing service to a customer under an EITE rate schedule. The utility shall not recover any costs or refund any savings under this section from any energy-intensive trade-exposed customer or any low-income residential ratepayers as defined in section 216B.16, subdivision 15.\nUpon the filing of a utility for approval of an EITE rate schedule under this section, the filing utility must deposit $10,000 into an account devoted to funding a program approved by the commission under section 216B.16, subdivision 15. The funds shall be used to expand the outreach of the commission-approved affordability program.\nThe commissioner of commerce shall assess reasonable costs it incurs for services it provides to implement this section to the utility proposing an EITE rate schedule to the commission. The department must not assess more than $854,000 per biennium under this subdivision.",
	"repealed": false
}