{
	"id": "505.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/505.08",
	"title": "505.08 CERTIFIED COPIES; PENALTIES.",
	"text": "MS 2006 [Repealed, 2007 c 73 s 7]\nThe copies of the official plat or of the exact reproducible copy shall be compared and certified to by the county recorder or registrar of titles in the manner in which certified copies of records are issued in the recorder's or registrar's office, and the copy thereof shall be for the use of the general public and anyone shall have access to and may inspect such certified copy during normal business hours. When the plat includes both registered and nonregistered land, copies thereof shall be so certified and available for such general public use in each of the offices of the county recorder and registrar of titles; provided, however, that only one such copy so certified shall be provided for general public use in those counties wherein the offices of the county recorder and registrar of titles are one and the same. When any copy, or any part thereof, shall become illegible from use or wear or otherwise, it shall be the duty of the county recorder or registrar of titles or county surveyor, depending upon where the copy resides, to make a reproduction copy of the official plat, or the exact transparent reproducible copy. It shall be the responsibility of the county recorder or registrar of titles to compare the copy, certify that it is a correct copy thereof, by proper certificate as set forth above, and it shall be made available in place of the illegible copy. Reproductions from the exact transparent reproducible copy shall be available to any person upon request and the cost of such reproductions shall be paid by the person making such request. If a copy of the official plat is requested, the county recorder shall prepare it and duly certify that it is a copy of the official plat and the cost of such copy shall be paid by the person making such request.\nMS 2006 [Repealed, 2007 c 73 s 7]\nMS 2006 [Repealed, 2007 c 73 s 7]",
	"repealed": false
}