{
	"id": "120B.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.125",
	"title": "120B.125 PLANNING FOR STUDENTS' SUCCESSFUL TRANSITION TO POSTSECONDARY EDUCATION AND EMPLOYMENT; PERSONAL LEARNING PLANS.",
	"text": "(a) Consistent with sections 120B.13, 120B.131, 120B.132, 120B.14, 120B.15, 120B.303, subdivision 1, 125A.08, and other related sections, school districts, beginning in the 2013-2014 school year, must assist all students by no later than grade 9 to explore their educational, college, and career interests, aptitudes, and aspirations and develop a plan for a smooth and successful transition to postsecondary education or employment. All students' plans must:\n(1) provide a comprehensive plan to prepare for and complete a career and college ready curriculum by meeting state and local academic standards and developing career and employment-related skills such as team work, collaboration, creativity, communication, critical thinking, and good work habits;\n(2) emphasize academic rigor and high expectations and inform the student, and the student's parent or guardian if the student is a minor, of the student's achievement level score on the Minnesota Comprehensive Assessments that are administered during high school;\n(3) help students identify interests, aptitudes, aspirations, and personal learning styles that may affect their career and college ready goals and postsecondary education and employment choices;\n(4) set appropriate career and college ready goals with timelines that identify effective means for achieving those goals;\n(5) help students access education and career options;\n(6) integrate strong academic content into career-focused courses and applied and experiential learning opportunities and integrate relevant career-focused courses and applied and experiential learning opportunities into strong academic content;\n(7) help identify and access appropriate counseling and other supports and assistance that enable students to complete required coursework, prepare for postsecondary education and careers, and obtain information about postsecondary education costs and eligibility for financial aid and scholarship;\n(8) help identify collaborative partnerships among prekindergarten through grade 12 schools, postsecondary institutions, economic development agencies, and local and regional employers that support students' transition to postsecondary education and employment and provide students with applied and experiential learning opportunities; and\n(9) be reviewed and revised at least annually by the student, the student's parent or guardian, and the school or district to ensure that the student's course-taking schedule keeps the student on track for graduation, making adequate progress to meet state and local academic standards and high school graduation requirements and with a reasonable chance to succeed with employment or postsecondary education without the need to first complete remedial coursework.\n(b) A school district may develop grade-level curricula or provide instruction that introduces students to various careers, but must not require any curriculum, instruction, or employment-related activity that obligates an elementary or secondary student to involuntarily select or pursue a career, career interest, employment goals, or related job training.\n(c) Educators must possess the knowledge and skills to effectively teach all English learners in their classrooms. School districts must provide appropriate curriculum, targeted materials, professional development opportunities for educators, and sufficient resources to enable English learners to become career and college ready.\n(d) When assisting students in developing a plan for a smooth and successful transition to postsecondary education and employment, districts must recognize the unique possibilities of each student and ensure that the contents of each student's plan reflect the student's unique talents, skills, and abilities as the student grows, develops, and learns.\n(e) If a student with a disability has an individualized education program (IEP) or standardized written plan that meets the plan components of this section, the IEP satisfies the requirement and no additional transition plan is needed.\n(f) Students who do not meet or exceed Minnesota academic standards, as measured by the Minnesota Comprehensive Assessments that are administered during high school, shall be informed that admission to a public school is free and available to any resident under 21 years of age or who meets the requirements of section 120A.20, subdivision 1, paragraph (c). A student's plan under this section shall continue while the student is enrolled.",
	"repealed": false
}