{
	"id": "142G.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.17",
	"title": "142G.17 FAMILY COMPOSITION; ASSISTANCE STANDARDS; EXIT LEVEL.",
	"text": "An MFIP assistance unit is either a group of individuals with at least one minor child who live together whose needs, assets, and income are considered together and who receive MFIP assistance, or a pregnant woman and her spouse who receive MFIP assistance.\nIndividuals identified in subdivision 2 must be included in the MFIP assistance unit. Individuals identified in subdivision 3 are ineligible to receive MFIP. Individuals identified in subdivision 4 may be included in the assistance unit at their option. Individuals not included in the assistance unit who are identified in section 142G.31, subdivisions 1 to 4, must have their income and assets considered when determining eligibility and benefits for an MFIP assistance unit. All assistance unit members, whether mandatory or elective, who live together and for whom one caregiver or two caregivers apply must be included in a single assistance unit.\nExcept for minor caregivers and their children who must be in a separate assistance unit from the other persons in the household, when the following individuals live together, they must be included in the assistance unit:\n(1) a minor child, including a pregnant minor;\n(2) the minor child's minor siblings, minor half siblings, and minor stepsiblings;\n(3) the minor child's birth parents, adoptive parents, and stepparents; and\n(4) the spouse of a pregnant woman.\nA minor child must have a caregiver for the child to be included in the assistance unit.\n(a) The following individuals who are part of the assistance unit determined under subdivision 2 are ineligible to receive MFIP:\n(1) individuals who are recipients of Supplemental Security Income or Minnesota supplemental aid;\n(2) individuals disqualified from the Supplemental Nutrition Assistance Program (SNAP) or MFIP, until the disqualification ends;\n(3) children on whose behalf federal, state or local foster care payments are made, except as provided in sections 142G.13, subdivision 2, and 142G.26, subdivision 2;\n(4) children receiving ongoing Northstar kinship assistance payments under sections142A.60 to 142A.612;\n(5) children receiving ongoing monthly adoption assistance payments under sections 142A.60 to 142A.612; or 259A; and\n(6) individuals disqualified from the work participation cash benefit program until that disqualification ends.\n(b) The exclusion of a person under this subdivision does not alter the mandatory assistance unit composition.\n(a) The minor child's eligible caregiver may choose to be in the assistance unit, if the caregiver is not required to be in the assistance unit under subdivision 2. If the eligible caregiver chooses to be in the assistance unit, that person's spouse must also be in the unit.\n(b) Any minor child not related as a sibling, stepsibling, or adopted sibling to the minor child in the unit, but for whom there is an eligible caregiver may elect to be in the unit.\n(c) A foster care provider of a minor child who is receiving federal, state, or local foster care maintenance payments may elect to receive MFIP if the provider meets the definition of caregiver under section 142G.02, subdivision 12. If the provider chooses to receive MFIP, the spouse of the provider must also be included in the assistance unit with the provider. The provider and spouse are eligible for assistance even if the only minor child living in the provider's home is receiving foster care maintenance payments.\n(d) The adult caregiver or caregivers of a minor parent are eligible to be a separate assistance unit from the minor parent and the minor parent's child when:\n(1) the adult caregiver or caregivers have no other minor children in the household;\n(2) the minor parent and the minor parent's child are living together with the adult caregiver or caregivers; and\n(3) the minor parent and the minor parent's child receive MFIP, or would be eligible to receive MFIP, if they were not receiving SSI benefits.\n(a) The MFIP transitional standard is based on the number of persons in the assistance unit eligible for both food and cash assistance. The amount of the transitional standard is published annually by the Department of Children, Youth, and Families.\n(b) The amount of the MFIP cash assistance portion of the transitional standard is increased $100 per month per household. This increase shall be reflected in the MFIP cash assistance portion of the transitional standard published annually by the commissioner.\n(c) On October 1 of each year, the commissioner of children, youth, and families shall adjust the cash assistance portion under paragraph (a) for inflation based on the CPI-U for the prior calendar year.\nThe commissioner shall adjust the food portion of the MFIP transitional standard as needed to reflect adjustments to the Supplemental Nutrition Assistance Program and maintain compliance with federal waivers related to the Supplemental Nutrition Assistance Program under the United States Department of Agriculture. The commissioner shall publish the transitional standard including a breakdown of the cash and food portions for an assistance unit of sizes one to ten in the State Register whenever an adjustment is made.\nThe family wage level is 110 percent of the transitional standard under subdivision 5. If there is earned income in the assistance unit, earned income is subtracted from the family wage level to determine the amount of the assistance payment, as specified in section 142G.16. The assistance payment may not exceed the transitional standard under subdivision 5 for the assistance unit.",
	"repealed": false
}