{
	"id": "190.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.25",
	"title": "190.25 LANDS FOR TRAINING ARMED FORCES.",
	"text": "The adjutant general is hereby authorized to acquire in the name of the state by purchase, lease, gift, or condemnation, and is authorized to lease all lands which the adjutant general may deem necessary, including lands already devoted to a public use, for military training purposes, adjacent to or in the vicinity of the Military Field Training Center at Camp Ripley, or at any other suitable place in this state, subject to the limitations of funds appropriated and available.\nThe adjutant general may, except as to lands already devoted to a public use, at any time after the filing of a petition for the condemnation of any lands authorized by this section take possession of it. Proceedings for the condemnation of lands authorized herein shall be governed by chapter 117.\nThe adjutant general is authorized to sell in the manner provided by law any or all\n(1) land, and\n(2) growing crops, buildings, and other improvements, if any, situated upon the land, acquired under the authority of subdivision 1 or which may hereafter comprise the Camp Ripley Military Field Training Center and not needed for military training purposes. The proceeds of any sales shall be deposited in the general fund.\nThe adjutant general may use funds that are directly appropriated for the acquisition of land, the payment of expenses of forest management on land forming the Camp Ripley Military Reservation, and the provision of an Enlisted Person's Service Center. If amounts that are directly appropriated for these purposes in either year of a biennium are insufficient, the appropriation for the other year of the biennium is available.\nThe adjutant general is authorized to sell in the manner provided by law any or all timber on land acquired under the authority of subdivision 1 or which may hereafter comprise the Camp Ripley Military Field Training Center. The proceeds of any sales of timber under this subdivision must be deposited in an account in the special revenue fund and are appropriated to the adjutant general to be used to manage the timber resources of Camp Ripley in a manner consistent with the camp's purpose as lands for training armed forces.\nThe adjutant general is authorized, whenever military training purposes require, to close and obliterate any and all public roads or highways established over and upon any of the lands acquired under the authority of this section. In order to accomplish prescribed military training at the Camp Ripley Military Reservation, the adjutant general may temporarily close any road or highway adjacent to the Camp Ripley Military Reservation with the concurrence of the road authorities. Prior to closing any road or highway the adjutant general shall erect suitable signs and barriers in ample time so as to minimize any inconvenience to the traveling public.",
	"repealed": false
}