{
	"id": "515B.3-120",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-120",
	"title": "515B.3-120 DECLARANT DUTIES; TURNOVER OF RECORDS.",
	"text": "(a) During any period of declarant control pursuant to section 515B.3-103(c), declarant and any of its representatives who are acting as officers or directors of the association shall:\n(1) cause the association to be operated and administered in accordance with its articles of incorporation and bylaws, the declaration and applicable law;\n(2) be subject to all fiduciary obligations and obligations of good faith applicable to any persons serving a corporation in that capacity;\n(3) cause the association's funds to be maintained in a separate bank account or accounts solely in the association's name, from and after the date of creation of the association; and\n(4) cause the association to maintain complete and accurate records in compliance with section 515B.3-118.\n(b) At such time as any period of declarant control terminates, declarant shall cause to be delivered to the board elected by the unit owners exclusive control of all funds of the association, all contracts and agreements which are binding on the association, all corporate records of the association including financial records, copies of all CIC plats and supplementary CIC plats, personal property owned or represented to be owned by the association, assignments of third-party warranties relating to common element improvements or other improvements the association is obliged to maintain, repair, or replace, if not in the name of the association, and, to the extent they are in the control or possession of the declarant, copies of all plans and specifications relating to buildings and related improvements which are part of the common elements, and operating manuals and warranty materials relating to any equipment or personal property utilized in the operation of the common interest community. The declarant's obligation to turn over the foregoing items shall continue to include additional new or changed items in its possession or control. Declarant shall not be obligated to assign any third-party warranty to the extent assignment is prohibited by the warranty or applicable law or otherwise prevents the declarant from enforcing the warranty.\n(c) A person entitled to appoint the directors of a master association pursuant to section 515B.2-121(c)(1), and the master association's officers and directors, shall be subject to the same duties and obligations with respect to the master association as are described in subsections (a) and (b), to the extent applicable. A master association may not be used to circumvent or avoid any obligation or restriction imposed on a declarant or its affiliates by this chapter.",
	"repealed": false
}