{
	"id": "16A.152",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.152",
	"title": "16A.152 BUDGET RESERVE AND CASH FLOW ACCOUNTS.",
	"text": "A cash flow account is created in the general fund in the state treasury. Amounts in the cash flow account shall remain in the account until drawn down and used to meet cash flow deficiencies resulting from uneven distribution of revenue collections and required expenditures during a fiscal year.\nA budget reserve account is created in the general fund in the state treasury. The commissioner of management and budget shall transfer to the budget reserve account on July 1 of each odd-numbered year any amounts specifically appropriated by law to the budget reserve.\n(a) The commissioner of management and budget shall calculate the budget reserve level by multiplying the current biennium's general fund nondedicated revenues and the most recent budget reserve percentage under subdivision 8.\n(b) If, on the basis of a November forecast of general fund revenues and expenditures, the commissioner of management and budget determines that there will be a positive unrestricted general fund balance at the close of the biennium and that the provisions of subdivision 2, paragraph (a), clauses (1), (2), (3), and (4), are satisfied, the commissioner shall transfer to the budget reserve account in the general fund the amount necessary to increase the budget reserve to the budget reserve level determined under paragraph (a). The amount of the transfer authorized in this paragraph shall not exceed 33 percent of the positive unrestricted general fund balance determined in the forecast.\n(a) If on the basis of a forecast of general fund revenues and expenditures, the commissioner of management and budget determines that there will be a positive unrestricted budgetary general fund balance at the close of the biennium, the commissioner of management and budget must allocate money to the following accounts and purposes in priority order:\n(1) the cash flow account established in subdivision 1 until that account reaches $350,000,000;\n(2) the budget reserve account established in subdivision 1a until that account reaches $2,852,098,000;\n(3) the amount necessary to increase the aid payment schedule for school district aids and credits payments in section 127A.45 to not more than 90 percent rounded to the nearest tenth of a percent without exceeding the amount available and with any remaining funds deposited in the budget reserve; and\n(4) the amount necessary to restore all or a portion of the net aid reductions under section 127A.441 and to reduce the property tax revenue recognition shift under section 123B.75, subdivision 5, by the same amount.\n(b) The amounts necessary to meet the requirements of this section are appropriated from the general fund within two weeks after the forecast is released or, in the case of transfers under paragraph (a), clauses (3) and (4), as necessary to meet the appropriations schedules otherwise established in statute.\n(c) The commissioner of management and budget shall certify the total dollar amount of the reductions under paragraph (a), clauses (3) and (4), to the commissioner of education. The commissioner of education shall increase the aid payment percentage and reduce the property tax shift percentage by these amounts and apply those reductions to the current fiscal year and thereafter.\nThe use of the budget reserve should be governed by principles based on the full economic cycle rather than the budget cycle. The budget reserve may be used when a negative budgetary balance is projected and when objective measures, such as reduced growth in total wages, retail sales, or employment, reflect downturns in the state's economy.\n(a) If the commissioner determines that probable receipts for the general fund will be less than anticipated, and that the amount available for the remainder of the biennium will be less than needed, the commissioner shall, with the approval of the governor, and after consulting the Legislative Advisory Commission, reduce the amount in the budget reserve account as needed to balance expenditures with revenue.\n(b) An additional deficit shall, with the approval of the governor, and after consulting the Legislative Advisory Commission, be made up by reducing unexpended allotments of any prior appropriation or transfer. Notwithstanding any other law to the contrary, the commissioner is empowered to defer or suspend prior statutorily created obligations which would prevent effecting such reductions.\n(c) If the commissioner determines that probable receipts for any other fund, appropriation, or item will be less than anticipated, and that the amount available for the remainder of the term of the appropriation or for any allotment period will be less than needed, the commissioner shall notify the agency concerned and then reduce the amount allotted or to be allotted so as to prevent a deficit.\n(d) In reducing allotments, the commissioner may consider other sources of revenue available to recipients of state appropriations and may apply allotment reductions based on all sources of revenue available.\n(e) In like manner, the commissioner shall reduce allotments to an agency by the amount of any saving that can be made over previous spending plans through a reduction in prices or other cause.\n(f) The commissioner is prohibited from reducing an allotment or appropriation made to the legislature.\nThe restoration of the budget reserve should be governed by principles based on the full economic cycle rather than the budget cycle. Restoration of the budget reserve should occur when objective measures, such as increased growth in total wages, retail sales, or employment, reflect upturns in the state's economy. The budget reserve should be restored before new or increased spending commitments are made.\nThe commissioner shall notify the committees on finance and taxes and tax laws of the senate and the committees on ways and means and taxes of the house of representatives of a reduction in an allotment under this section. The notice must be in writing and delivered within 15 days of the commissioner's act. The notice must specify:\n(1) the amount of the reduction in the allotment;\n(2) the agency and programs affected;\n(3) the amount of any payment withheld; and\n(4) any additional information the commissioner determines is appropriate.\nThe commissioner may delay paying up to 15 percent of an appropriation to a special taxing district or a system of higher education in that entity's fiscal year for up to 60 days after the start of its next fiscal year. The delayed amount is subject to allotment reduction under subdivision 4.\n(a) The commissioner of management and budget shall develop and annually review a methodology for evaluating the adequacy of the budget reserve based on the volatility of Minnesota's general fund tax structure. The review must take into consideration relevant statistical and economic literature. After completing the review, the commissioner may revise the methodology if necessary. The commissioner must use the methodology to annually estimate the percentage of the current biennium's general fund nondedicated revenues recommended as a budget reserve.\n(b) By September 30 of each year, the commissioner shall report the percentage of the current biennium's general fund nondedicated revenue that is recommended as a budget reserve to the chairs and ranking minority members of the senate Committee on Finance, the house of representatives Committee on Ways and Means, and the senate and house of representatives Committees on Taxes. The report must also specify:\n(1) whether the commissioner revised the recommendation as a result of significant changes in the mix of general fund taxes or the base of one or more general fund taxes;\n(2) whether the commissioner revised the recommendation as a result of a revision to the methodology; and\n(3) any additional appropriate information.",
	"repealed": false
}