{
	"id": "28A.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/28A.151",
	"title": "28A.151 FARMERS' MARKET OR COMMUNITY EVENT; FOOD PRODUCT SAMPLING AND DEMONSTRATION.",
	"text": "(a) For purposes of this section, the following terms have the meanings given them.\n(b) \"Farmers' market\" means an association of three or more persons who assemble at a defined location that is open to the public for the purpose of selling products of a farm or garden occupied and cultivated by the person selling the product.\n(c) \"Food product sampling\" means distributing to individuals at a farmers' market or community event, for promotional or educational purposes, small portions of a food item that include as a main ingredient a product sold by the vendor. For purposes of this subdivision, \"small portion\" means a portion that is no more than three ounces of food or beverage.\n(d) \"Food product demonstration\" means cooking or preparing food products to distribute to individuals at a farmers' market or community event for promotional or educational purposes.\n(a) Food used in sampling and demonstration must be obtained from sources that comply with Minnesota Food Law.\n(b) Raw animal, raw poultry, and raw fish products must not be served as samples.\n(c) Food product sampling or food product demonstrations, including cooked animal, poultry, or fish products, must be prepared on site at the event.\n(d) Animal or poultry products used for food product sampling or food product demonstrations must be from animals slaughtered under continuous inspection, either by the USDA or through Minnesota's \"Equal-to\" inspection program.\n(e) The licensing provisions of sections 28A.01 to 28A.16 shall not apply to persons engaged in food product sampling or food product demonstrations.\nFood provided through food product sampling or food product demonstrations must be provided at no cost to the individual recipient of a sample.\nAny person conducting food product sampling or food product demonstrations shall provide to the regulatory authority upon request the following information related to the food product sampling or food product demonstration conducted by the person:\n(1) the source of the food used in the sampling or demonstration and whether or not the food was produced at the person's farm or garden;\n(2) the type and volume of food to be served, held, prepared, packaged, or otherwise provided for human consumption;\n(3) the equipment used to serve, hold, prepare, package, or otherwise provide food for human consumption;\n(4) the time period and location of the food product sampling or food product demonstration;\n(5) the availability of facilities for hand washing by persons conducting the food product sampling or food product demonstrations;\n(6) information on facilities available for ware washing of multiuse utensils and equipment;\n(7) the available source of water; and\n(8) methods of liquid and solid waste disposal.\n(a) Any person conducting food product sampling or food product demonstrations shall meet the same food safety and equipment standards that are required of a special event food stand in Minnesota Rules, parts 4626.1855, items B to O, Q, and R; and 4626.0330.\n(b) Notwithstanding paragraph (a), a handwashing device is not required when only prepackaged food samples are offered.\nThe definition of farmers' market in subdivision 1, paragraph (b), does not prohibit a farmers' market association from establishing a definition of farmers' market that applies to its membership that is more restrictive than the definition in subdivision 1, paragraph (b).\nA food product provided through food product sampling or food product demonstrations must be accompanied by a legible sign or placard that lists the product's ingredients and major food allergens.",
	"repealed": false
}