{
	"id": "62J.461",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.461",
	"title": "62J.461 340B COVERED ENTITY REPORT.",
	"text": "(a) For purposes of this section, the following definitions apply.\n(b) \"340B covered entity\" or \"covered entity\" means a covered entity as defined in United States Code, title 42, section 256b(a)(4), with a service address in Minnesota as of January 1 of the reporting year. 340B covered entity includes all entity types and grantees. All facilities that are identified as child sites or grantee associated sites under the federal 340B Drug Pricing Program are considered part of the 340B covered entity.\n(c) \"340B Drug Pricing Program\" or \"340B program\" means the drug discount program established under United States Code, title 42, section 256b.\n(d) \"340B entity type\" is the designation of the 340B covered entity according to the entity types specified in United States Code, title 42, section 256b(a)(4).\n(e) \"340B ID\" is the unique identification number provided by the Health Resources and Services Administration to identify a 340B-eligible entity in the 340B Office of Pharmacy Affairs Information System.\n(f) \"Contract pharmacy\" means a pharmacy with which a 340B covered entity has an arrangement to dispense drugs purchased under the 340B Drug Pricing Program.\n(g) \"Pricing unit\" means the smallest dispensable amount of a prescription drug product that can be dispensed or administered.\nBeginning April 1, 2024, each 340B covered entity must maintain a current registration with the commissioner in a form and manner prescribed by the commissioner. The registration must include the following information:\n(1) the name of the 340B covered entity;\n(2) the 340B ID of the 340B covered entity;\n(3) the servicing address of the 340B covered entity; and\n(4) the 340B entity type of the 340B covered entity.\n(a) Each 340B covered entity shall report to the commissioner by April 1 of each year the following information for transactions conducted by the 340B covered entity or on its behalf, and related to its participation in the federal 340B program for the previous calendar year:\n(1) the aggregated acquisition cost for prescription drugs obtained under the 340B program;\n(2) the aggregated payment amount received for drugs obtained under the 340B program and dispensed or administered to patients;\n(3) the number of pricing units dispensed or administered for prescription drugs described in clause (2); and\n(4) the aggregated payments made:\n(i) to contract pharmacies to dispense drugs obtained under the 340B program;\n(ii) to any other entity that is not the covered entity and is not a contract pharmacy for managing any aspect of the covered entity's 340B program; and\n(iii) for all other expenses related to administering the 340B program.\nThe information under clauses (2) and (3) must be reported by payer type, including but not limited to commercial insurance, medical assistance, MinnesotaCare, and Medicare, in the form and manner prescribed by the commissioner.\n(b) For covered entities that are hospitals, the information required under paragraph (a), clauses (1) to (3), must also be reported at the national drug code level for the 50 most frequently dispensed or administered drugs by the facility under the 340B program.\n(c) Data submitted to the commissioner under paragraphs (a) and (b) are classified as nonpublic data, as defined in section 13.02, subdivision 9.\n(a) Any health care entity subject to reporting under this section that fails to provide data in the form and manner prescribed by the commissioner is subject to a fine paid to the commissioner of up to $500 for each day the data are past due. Any fine levied against the entity under this subdivision is subject to the contested case and judicial review provisions of sections 14.57 and 14.69.\n(b) The commissioner may grant an entity an extension of or exemption from the reporting obligations under this subdivision, upon a showing of good cause by the entity.\nBy November 15, 2024, and by November 15 of each year thereafter, the commissioner shall submit to the chairs and ranking minority members of the legislative committees with jurisdiction over health care finance and policy, a report that aggregates the data submitted under subdivision 3, paragraphs (a) and (b). The following information must be included in the report for all 340B entities whose net 340B revenue constitutes a significant share, as determined by the commissioner, of all net 340B revenue across all 340B covered entities in Minnesota:\n(1) the information submitted under subdivision 2; and\n(2) for each 340B entity identified in subdivision 2, that entity's 340B net revenue as calculated using the data submitted under subdivision 3, paragraph (a), with net revenue being subdivision 3, paragraph (a), clause (2), less the sum of subdivision 3, paragraph (a), clauses (1) and (4).\nFor all other entities, the data in the report must be aggregated to the entity type or groupings of entity types in a manner that prevents the identification of an individual entity and any entity's specific data value reported for an individual data element.",
	"repealed": false
}