{
	"id": "626.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.91",
	"title": "626.91 LAW ENFORCEMENT AUTHORITY; LOWER SIOUX INDIAN COMMUNITY PEACE OFFICERS.",
	"text": "As used in this section, \"community\" means the Lower Sioux Indian Community.\n(a) The community has the powers of a law enforcement agency, as defined in section 626.84, subdivision 1, paragraph (f), if all of the requirements of clauses (1) to (4) are met:\n(1) the community agrees to be subject to liability for its torts and those of its officers, employees, and agents acting within the scope of their employment or duties arising out of the law enforcement agency powers conferred by this section to the same extent as a municipality under chapter 466, and the community further agrees, notwithstanding section 16C.05, subdivision 7, to waive its sovereign immunity with respect to claims arising from this liability;\n(2) the community files with the Board of Peace Officer Standards and Training a bond or certificate of insurance for liability coverage with the maximum single occurrence amounts set forth in section 466.04 and an annual cap for all occurrences within a year of three times the single occurrence amount;\n(3) the community files with the Board of Peace Officer Standards and Training a certificate of insurance for liability of its law enforcement officers, employees, and agents for lawsuits under the United States Constitution; and\n(4) the community agrees to be subject to section 13.82 and any other laws of the state relating to data practices of law enforcement agencies.\n(b) The community may enter into an agreement under section 471.59 with the Redwood County sheriff to define and regulate the provision of law enforcement services under this section and to provide for mutual aid and cooperation. If entered, the agreement must identify and describe the trust property involved in the agreement. For purposes of entering into this agreement, the community shall be considered a \"governmental unit\" as that term is defined in section 471.59, subdivision 1.\nThe jurisdiction of the community pursuant to this section shall be concurrent with that of the Redwood County sheriff, provided that it shall be limited to persons in the geographical boundaries of property held by the United States in trust for the community.\nIf the community complies with the requirements set forth in subdivision 2, paragraph (a), the community is authorized to appoint peace officers, as defined in section 626.84, subdivision 1, paragraph (c), who have the same powers as peace officers employed by the Redwood County sheriff over the persons and the geographic areas described in subdivision 3.\nThe Redwood County sheriff is responsible for receiving persons arrested by peace officers appointed by the community under subdivision 4 and acting under the authority conferred by this section.\nThe Redwood County attorney is responsible for prosecuting or initiating petitions for any person arrested, investigated, or detained by peace officers appointed by the community under subdivision 4 and acting under the authority conferred by this section.\nNothing in this section shall be construed to restrict the community's authority under federal law.\nThis section is limited to law enforcement authority only, and nothing in this section shall affect any other jurisdictional relationships or disputes involving the community.",
	"repealed": false
}