{
	"id": "383B.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.041",
	"title": "383B.041 CAMPAIGN FINANCING, DISCLOSURE OF ECONOMIC INTERESTS.",
	"text": "Candidates for county commissioner, county attorney, and sheriff of Hennepin County must file campaign disclosure forms with the filing officer for Hennepin County. These candidates are subject to the provisions of chapter 211A.\nCandidates for elected city, school board, park commissioner, and other political subdivision offices within Hennepin County shall file campaign disclosure forms with the filing officer for the political subdivision for which the candidate is seeking office. These candidates are subject to the provisions of chapter 211A.\n(a) The provisions of chapter 10A apply to political committees as defined in section 10A.01, subdivision 27; political funds as defined in section 10A.01, subdivision 28; and independent expenditures as defined in section 10A.01, subdivision 18, related to:\n(1) a campaign for the nomination or election of a candidate for:\n(i) a county office in Hennepin County;\n(ii) a city office in a home rule charter or statutory city located wholly within Hennepin County with a population of 75,000 or more; or\n(iii) the school board in Special School District No. 1; and\n(2) a ballot question or proposition that may be voted on by:\n(i) all voters in Hennepin County;\n(ii) all voters of a home rule charter or statutory city located wholly within Hennepin County and having a population of 75,000 or more; or\n(iii) all voters in Special School District No. 1.\n(b) The provisions of chapter 211A apply to a campaign for nomination or election for an office in the following political subdivisions:\n(1) a home rule charter or statutory city located wholly within Hennepin County and having a population of less than 75,000; and\n(2) a school district located wholly within Hennepin County other than Special School District No. 1.\n(c) The provisions of chapter 211A apply to a ballot question or proposition that may be voted on by:\n(1) all voters of a home rule charter or statutory city located wholly within Hennepin County and having a population of less than 75,000; and\n(2) all voters of a school district located wholly within Hennepin County other than Special School District No. 1.\nThis section supersedes the provisions of any ordinance or resolution of a political subdivision within Hennepin County, or any existing special law or home rule charter provision of a political subdivision within Hennepin County requiring disclosure of information related to the financing of election campaigns.\nEvery candidate for school board in Special School District No. 1, Minneapolis, must file an original statement of economic interest with the school district within 14 days of the filing of an affidavit or petition to appear on the ballot. An elected official in Special School District No. 1, Minneapolis, must file the annual statement required in section 10A.09, subdivision 6, with the school district for every year that the individual serves in office. An original and annual statement must contain the information listed in section 10A.09, subdivision 5. The provisions of section 10A.09, subdivisions 6a, 7, and 9, apply to statements required under this subdivision.",
	"repealed": false
}