{
	"id": "93.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.20",
	"title": "93.20 FORM OF LEASE; REQUIRED CONTENT; MODIFICATION.",
	"text": "Except as otherwise provided by law, the body of every lease for mining iron ore belonging to the state shall consist of the provisions set forth in subdivisions 4 to 36, omitting subdivision headings, with such insertions, changes, or additions as may be necessary to incorporate the royalty rates and other particulars applicable to each case or as may be authorized under subdivision 2.\nThe commissioner of natural resources, with the approval of the Executive Council, may, so far as the commissioner deems advisable in furtherance of the public interests, fix the term of any lease at any period not exceeding that hereinafter prescribed, or may include in a lease any other conditions not inconsistent herewith relating to performance by the lessee or other pertinent matters, provided, that in case of a lease made pursuant to a permit issued upon public sale, a statement of such conditions shall be included in the designation of the mining unit affected before publication of the notice of sale.\nThe royalty rates hereinafter specified shall be deemed minimums. In any case where a higher rate has been bid or agreed upon as provided by law, such higher rate shall be inserted in the lease in place of the rate hereinafter specified and with like effect for all purposes so far as applicable, except as otherwise expressly provided by law.\nThis indenture, made this .......... day of ........................, ................, by and between the state of Minnesota, party of the first part, and ..................... part.......... of the second part.\nWitnesseth: That the party of the first part, for and in consideration of the sum of ............ Dollars to it in hand paid by the part.......... of the second part, being the payment of rental for the unexpired portion of the first quarter, hereinafter provided for, the receipt whereof is hereby acknowledged, and in further consideration of the covenants and conditions hereof, to be kept and performed by the part.......... of the second part, does hereby lease and demise unto the part.......... of the second part for the term of 50 years from and after the .............. day of ..................., ............, the following described land, situated in the County of .................., in the state of Minnesota, to-wit: ...........................................\nThe above described premises are leased to the part.......... of the second part for the purpose of exploring for, mining, taking out and removing the iron ore found on or in said land, together with the right to construct or make such buildings, excavations, openings, ditches, drains, railroads, roads and other improvements upon said premises as may be necessary or suitable for such purposes. The part.......... of the second part may contract with others for doing any work authorized or required hereunder, or for the use of said land or any part thereof for the purposes hereof, but no such contract shall relieve the part.......... of the second part from any duty, obligation, or liability hereunder. Three executed duplicates of every such contract shall be filed with the commissioner of natural resources before it shall become effective for any purpose.\nThe party of the first part reserves the right to sell and dispose of, under the provisions of law now or hereinafter governing the sale of timber on state lands, all the timber upon the land hereby leased, and reserves to the purchaser of such timber, or agents and servants of the purchaser, the right at all times to enter thereon, and to cut and remove any and all such timber therefrom, according to the terms of the purchaser's contract with the state, and without let or hindrance from the part.......... of the second part; but such purchaser shall not unnecessarily or materially interfere with the mining operations carried on thereon. The party of the first part further reserves the right to grant to any person or corporation the right-of-way necessary for the construction and operation of one or more railroads over or across the land thereby leased, without let or hindrance from the part.......... of the second part; but such railroads shall not unnecessarily or materially interfere with the mining operations carried on thereon. The party of the first part further reserves the right to grant leases, permits or licenses to any portion of the surface of the demised premises to any person or corporation under authority of section 92.50, or other applicable laws, without let or hindrance from the part.......... of the second part, but such leases, permits or licenses shall not unnecessarily or materially interfere with the mining operations carried on thereon.\nThe part.......... of the second part covenants and agrees to pay to the commissioner of management and budget of said state rental for said premises at the rate of $1,250 for the first year after the date of this lease and $5,000 per year for the remainder of the term hereof; provided, that in case and so long as this lease is designated as a taconite iron ore mining lease the rate for the first five years after the date hereof shall be $400 per year and the rate for the remainder of the term hereof shall be $1,600 per year. Such rental shall be payable quarterly on or before the 20th day of April, July, October, and January each year during the term hereof. Each quarterly payment shall cover the rental at the rates hereinbefore specified for the calendar quarter or fraction thereof ending on the last day of the calendar month next preceding the due date for such payment. The rental for any fraction of a quarter shall be computed proportionately at the applicable rate. Any amount paid for rental accrued during any calendar year shall be credited on any royalty that may become due for iron ore removed hereunder during the same calendar year but no further, and any amount paid for such royalty in excess of such credit during such year shall be credited on rental, if any, subsequently accruing during such year but no further.\nThe term \"dried iron\" as used herein shall mean iron ore dried at 212 degrees Fahrenheit; and the word \"ton\" shall mean a gross ton of 2,240 pounds.\n[Repealed, 1991 c 194 s 5]\n(1) The royalties to be paid by the part.......... of the second part to the party of the first part on ore removed in each calendar quarter that the lease remains in force as hereinbefore specified shall be subject to increase by fifty percent (50%) of the sum of the amounts determined in accordance with subparagraphs (a) and (b) below:\n(a) Reference shall be made to the Producer Price Index for iron ores (December 1984=100) (Industry Code No. 1011), as originally published (unrevised) by the Bureau of Labor Statistics of the United States Department of Labor, or any succeeding federal agency publishing such index, for the first month in the calendar quarter for which royalty payment is to be made. If the Producer Price Index for iron ores exceeds .........., which was the level of such index for the month in which this lease was issued (hereafter called the \"PPI - IO Base Index\"), the excess shall be computed and this excess shall become the numerator of a fraction, the denominator of which shall be the PPI - IO Base Index, and the resulting fraction shall be multiplied by the royalty rate per ton payable on the ore mined and removed during any such quarter.\nFor example, if the PPI - IO Base Index under this lease was 119.2, and if the Producer Price Index for iron ores for January, ............. was 125.3, the additional amount for the calendar quarter of January, February, and March ............ would be computed as follows:\n(b) Reference shall be made to the Producer Price Index for the iron and steel subgroup of the metals and metal products group (1982=100) (Commodity Code No. 101), as originally published (unrevised) by the Bureau of Labor Statistics of the United States Department of Labor, or any succeeding federal agency publishing such index, for the first month in the calendar quarter for which royalty payment is to be made. If the Producer Price Index for the iron and steel subgroup of the metals and metal products group exceeds .........., which was the level of such index for the month in which this lease was issued (hereafter called the \"PPI - I&S Base Index\"), the excess shall be computed and this excess shall become the numerator of a fraction, the denominator of which shall be the PPI - I&S Base Index, and the resulting fraction shall be multiplied by the royalty rate per ton payable on the ore mined and removed during any such quarter.\nFor example, if the PPI - I&S Base Index under this lease was 129.5, and if the Producer Price Index for the iron and steel subgroup of the metals and metal products group for January, ............ was 139.5, the additional amount for the calendar quarter of January, February, and March ............ would be computed as follows:\n(2) In the event some other period than December 1984 is used as a base of 100 in determining the Producer Price Index for iron ores or some other period than 1982 is used as a base of 100 in determining the Producer Price Index for the iron and steel subgroup of the metals and metal products group, for the purposes of this lease these indexes shall be adjusted so as to be in correct relationship to the appropriate base. In the event either such index is not published by any federal agency, the index to be used as aforesaid shall be that index independently published, which, after necessary adjustments, if any, provides the most reasonable substitute for the appropriate index during any period subsequent to the month in which this lease is issued; it being intended to substitute for the Producer Price Index for iron ores and index that most accurately reflects fluctuations in the prices of Great Lakes iron ores in the manner presently reported by the Producer Price Index for iron ores (December 1984=100), as originally published (unrevised) by the Bureau of Labor Statistics of the United States Department of Labor, and it being intended to substitute for the Producer Price Index for the iron and steel subgroup of the metals and metal products group an index that most accurately reflects fluctuations in the prices of iron and steel in the manner presently reported by the Producer Price Index for the iron and steel subgroup of the metals and metal products group (1982=100), as originally published (unrevised) by the Bureau of Labor Statistics of the United States Department of Labor.\nIf the parties to this lease cannot agree upon substitute indexes which accomplish these purposes, each shall choose an arbitrator and the two thus selected shall choose a third. The decision of the arbitrators or any two of them shall be final and binding on the parties in interest. The agreement or the decision of the arbitrators shall be attached as a supplement to the lease. Each party to the arbitration shall bear their representative share of the costs for the arbitration.\nIn computing royalty rates hereunder, any fraction of a cent less than 5/1000 shall be disregarded and any fraction amounting to 5/1000 or more shall be counted as 1/100 of a cent.\nThe method of computing increased rates upon analysis illustrated by the following example shall apply in all cases hereunder, with such changes as may be necessary for adaptation to a particular schedule. Assuming that the royalty rate for the lowest grade of ore, with analysis 25.49 percent or less, is 18 cents per ton, the rate will be 18.9 cents per ton for all dried iron analyses higher than 25.49 percent but less than 26.50 percent; 19.85 cents per ton for all dried iron analyses higher than 26.49 percent but less than 27.50 percent; and so on, adding to the amount of royalty for a given grade five percent thereof for an increase in dried iron content of one percent or fraction thereof.\nSubject to the foregoing provisions, the royalties to be paid by the part.......... of the second part to the party of the first part shall be as hereinafter specified.\nSchedule 1. Direct shipping open pit ore shall be understood to mean all ore lying beneath the final stripped area of the particular mine in which it shall be situated and lying within reasonably safe mining slopes therein, that is shipped in its natural state without beneficiation of any kind other than crushing or dry screening.\nOn a ton of direct shipping open pit ore averaging in dried iron 25.49 percent or less, the royalty shall be 18 cents. The royalty rate shall be increased five percent for each increase of one percent, or fraction thereof, in dried iron analysis.\nSchedule 2. Open pit wash ore concentrates shall be understood to mean all concentrates produced from open pit ore which, in accordance with good engineering and metallurgical practice, requires treatment by straight washing to make it suitable for blast furnace use.\nOn a ton of open pit wash ore concentrates averaging in dried iron 25.49 percent or less, the royalty shall be 18 cents. The royalty rate shall be increased 4-1/2 percent for each increase of one percent, or fraction thereof in dried iron analysis.\nSchedule 3. Open pit special concentrates shall be understood to mean all concentrates produced from open pit ore which, in accordance with good engineering and metallurgical practice, requires treatment by roasting, sintering, agglomerating, or drying through the use of fuel, or by jigging, or by heavy medium separation to make them suitable for blast furnace practice.\nOn a ton of such open pit special concentrates averaging in dried iron 25.49 percent or less, the royalty shall be 18 cents. The royalty rate shall be increased four percent for each increase of one percent, or fraction thereof, in dried iron analysis.\nSchedule 4. Underground direct shipping ore shall be understood to mean all ore in any particular mine, other than open pit ore, that is shipped in its natural state without beneficiation of any kind other than crushing or dry screening.\nOn a ton of underground direct shipping ore averaging in dried iron 25.49 percent or less, the royalty shall be 15 cents. The royalty rate shall be increased 3-1/2 percent for each increase of one percent, or fraction thereof, in dried iron analysis.\nSchedule 5. Underground wash ore concentrates shall be understood to mean all concentrates produced from underground ore which, in accordance with good engineering and metallurgical practice, requires treatment by straight washing to make it suitable for blast furnace use.\nOn a ton of underground wash ore concentrates averaging in dried iron 25.49 percent or less, the royalty shall be 15 cents. The royalty rate shall be increased three percent for each increase of one percent, or fraction thereof, in dried iron analysis.\nSchedule 6. Underground special concentrates shall be understood to mean all concentrates produced from underground ore which, in accordance with good engineering and metallurgical practice, require treatment by roasting, sintering, agglomerating, or drying through the use of fuel, or by jigging, or by heavy medium separation to make them suitable for blast furnace practice.\nPonded fine tailings special concentrates shall be understood to mean all concentrates produced from fine tailings stored in tailings ponds which, in accordance with good engineering and metallurgical practice, require additional treatment by one or more of the types described in schedules 2 and 3 to make them suitable for blast furnace practice.\nOn a ton of such underground special concentrates or ponded fine tailings special concentrates, averaging in dried iron 25.49 percent or less, the royalty shall be 15 cents. The royalty rate shall be increased two percent for each increase of one percent, or fraction thereof, in dried iron analysis.\nSchedule 7. Taconite ore shall be understood to mean a ferruginous chert or ferruginous slate in the form of compact siliceous rock, in which the iron oxide is so finely disseminated that substantially all of the iron-bearing particles of merchantable grade are smaller than 20 mesh.\nTaconite concentrates shall be understood to mean the merchantable product, suitable for blast furnace use, which, in accordance with good engineering and metallurgical practice, has been produced from taconite ore which requires treatment by fine grinding, magnetic separation, flotation, or some other method or methods other than or in addition to one or more of the methods specified in schedules 1 to 6, inclusive.\nOn a ton of taconite concentrates averaging in dried iron 40.49 percent or less, the royalty shall be 11 cents. The royalty rate shall be increased one percent for each increase of one percent, or fraction thereof, in dried iron analysis.\nIn lieu of payment of such royalty on the taconite concentrates, royalty payments may be made on the taconite ore as set forth in section 93.201.\nThe part.......... of the second part covenant .......... and agree ........... to pay to the commissioner of management and budget of said state, on or before the twentieth day of April, July, October, and January in each year during the period this lease continues in force royalty at the rates hereinbefore specified for all the iron ore mined and removed from said land during the three months preceding the first day of the month in which such payment is due as hereinbefore provided.\nThe part.......... of the second part at the time of such payment shall transmit to the commissioner of natural resources an exact and truthful statement of the amount of iron ore removed under each schedule during the three months for which such payment is made and the royalty due thereon, determined as hereinafter provided. The part.......... of the second part shall provide for all the operations required for such determination except as otherwise specified.\nExcept as otherwise hereinafter provided, all iron ore removed from said land hereunder shall be shipped by rail. Each shipment shall be sampled in accordance with standard practice so as to show the true grade of the ore contained therein under each schedule, taking specimens from five carloads to make up a sample for analysis; provided, that with the approval of the commissioner of natural resources a sample may consist of specimens from any other number of carloads. The ore in each sample shall be thoroughly mingled and then split into two portions, both of which shall be properly marked for identification. One portion shall be delivered to the commissioner of natural resources or authorized agent, and the other retained by the part.......... of the second part. Each sample, dried at 212 degrees Fahrenheit, shall be analyzed for iron and manganese, and also, if directed by the commissioner or agent, for silica, phosphorus, and alumina, at the expense of the part.......... of the second part, by a competent chemist approved in writing by the commissioner.\nThe iron ore so taken and shipped shall be weighed by the railroad carrier. Weight bills or certificates, signed by the weigher, shall be transmitted to the commissioner at the close of each day when ore is shipped. Except as otherwise permitted by the commissioner of natural resources, the part.......... of the second part shall transmit to the commissioner on or before the tenth of each month a statement in such form as the commissioner shall prescribe, covering all ore removed from said land during the preceding calendar month, showing the weight and analysis of the ore under each schedule, the royalty computed to be due thereon, and such other information pertaining thereto as the commissioner may require. The amount of royalty due upon the ore under each schedule shall be determined according to the percentage of iron shown by the analysis at the rates hereinbefore prescribed. If the manganese content is four percent or more, the royalty due thereon shall be determined and paid as provided by law. With the approval of the commissioner, for the purpose of computing and accounting for royalty, ore may be considered as removed from said land in the month in which it was weighed as shown by the weight bills or certificates, but the party of the second part shall nevertheless be liable for the royalty on all ore from and after the actual time of removal from said land. With the approval of the commissioner the royalty on all the ore under a given schedule removed during a given calendar month may be computed on the average dried iron analysis thereof. The grades and weights of ore as set forth in said monthly statements shall be prima facie binding as between the parties, but the party of the first part shall have the right at any time, and in such manner as it may see fit, to sample the ore, check the analyses, and inspect, review, and test the correctness of the methods, books, records, and accounts of the part.......... of the second part in sampling, analyzing, recording, and reporting such grades and weights, and to inspect, review, and test the correctness of the scales and other equipment used in weighing the ore and of the weights reported as aforesaid, it being understood that any errors in these respects, when ascertained, shall be corrected. Should the party of the second part desire to remove crude ore for experimental purposes from the demised premises, the commissioner of natural resources may prescribe the method of such removal and the method of sampling and weighing such crude ore for the purpose of determining the amount of royalty due.\nThe part.......... of the second part shall have the right to beneficiate and treat, for the purpose of improving the character or quality thereof, any iron ore which without such treatment or beneficiation will not meet general market requirements at the time. Subject to the approval of the commissioner of natural resources, such ore may be so beneficiated or treated either upon the demised premises or elsewhere. The part.......... of the second part agree .......... that any treatment or beneficiation of ore conducted hereunder shall be done with suitable and proper machinery and appliances, and in a careful, good and workmanlike manner, according to good engineering practice, and so as not to cause any greater waste of the ore mined than is necessary in order to produce an ore concentrate of proper composition and character for satisfactory furnace use. No ore shall be treated or beneficiated which, without treatment or beneficiation, will meet general market requirements at the time. As to any ore so beneficiated or treated during any quarter year, royalty at the rates per ton hereinbefore provided for such ore shall be paid upon the merchantable product of such beneficiation or treatment and not upon the ore as mined. The residue of such treatment or beneficiation may be deposited upon the demised premises, in such place or places as shall not unnecessarily hinder or embarrass the future operation of the mine or mines therein, or on other state-owned lands conveniently located for the purpose, or may be otherwise disposed of in such manner as the commissioner of natural resources may approve. The merchantable product of such beneficiation shall be sampled, analyzed and weighed and the royalty thereon determined in like manner as hereinbefore provided for direct shipping ore. The part.......... of the second part shall nevertheless be liable for royalty on all ore removed from the demised premises for beneficiation or treatment from and after the actual time of removal. If any such ore shall not be beneficiated or treated or if the royalty due thereon shall not be determined and accounted for as herein otherwise provided by the next quarterly payment date after the end of the quarter in which such ore is removed from the demised premises, the commissioner may determine such royalty by such method as the commissioner deems appropriate and give the part.......... of the second part written notice thereof, whereupon such royalty shall be due and payable within 20 days after the mailing or delivery of such notice, unless the time therefor shall be extended by the commissioner.\nIt is understood and agreed that should the part.......... of the second part desire to stockpile concentrates off the demised premises or on land not owned by the state, the parties shall agree upon a method of sampling and weighing such concentrated ore for the purpose of determining the amount of royalty due, and in case they are unable to agree, each shall choose a referee and the two referees so chosen shall choose a third. The decision of such board of referees shall be binding on the parties in interest as to the methods to be employed in such sampling and weighing only. Should the party of the second part desire to stockpile crude ore off the demised premises for a temporary period not to exceed one year, the commissioner of natural resources may prescribe the method of removal and the method of sampling and weighing such crude ore for the purpose of determining the amount of royalty due.\nThe party of the first part shall have the right to enter upon and into said premises at any time, and to inspect and survey the same, and to measure the quantity of ore which shall have been mined or removed therefrom, not unreasonably hindering or interrupting the operations of the part.......... of the second part.\nThe part.......... of the second part shall provide, upon written request from the commissioner of natural resources, a suitable room in the dry or wash house or in some other suitable place on said premises, with water, light and heat free, for the use of the commissioner or agents thereof in the work of inspection on said premises, such room to be at least equal in size and equipment to that customarily furnished for the use of the mining captain or superintendent at mines comparable to the mine or mines on said premises. The commissioner or agents thereof shall have the right to enter and inspect at any time any plant where ore from said land is treated or beneficiated, and to take such samples and make such tests as may be necessary to determine the effects of such treatment or beneficiation. In case ore from more than one state mining unit or other property is treated or beneficiated at the same plant, the commissioner may appoint such special inspectors for such plant as the commissioner deems necessary to insure proper accounting and protect the interests of the state, and the part.......... of the second part shall reimburse the state monthly for the cost of all such inspection service, upon notification thereof by the commissioner.\nIn addition to other reports or statements required hereunder, the part.......... of the second part shall furnish the commissioner of natural resources with the following:\n(1) Copies of all exploration reports, concentrating plant reports, mine maps, analysis maps, cross sections and plans of development made and used in the operations on said leased premises;\n(2) At least a quarter portion of all exploration samples, and, when requested by the commissioner in writing, a quarter portion of mine or mill samples;\n(3) A monthly report showing the estimated weight and analysis of all ore material stockpiled according to each classification, whether merchantable, concentratable, or nonmerchantable;\n(4) A monthly report showing the estimated weight and analysis of concentrated ore when stockpiled on state-owned land;\n(5) A monthly report of all ore beneficiated, showing the tonnage and analysis of crude ore treated, the tonnage and analysis of concentrates recovered, and a record of any analysis made of tailings and rejects;\n(6) Not later than February 1st of each year during said term, a summary statement of the tonnage of all iron ore and other iron-bearing material mined on said land during the previous calendar year under each schedule or classification, showing the average analysis of iron, silica, phosphorus, alumina, and manganese on all merchantable ore, such analysis as the commissioner may require on other iron-bearing material, and such other information as to the grade, character and disposition of such ore and other material as the commissioner may direct.\nThe part.......... of the second part further covenant.......... and agree .......... to pay all taxes, general and specific, which may be assessed against said land and the improvements thereon made, used or controlled by said part.......... of the second part, and the iron ore product thereof, and any personal property thereat owned, used, or controlled by the part.......... of the second part, in all respects as if said land was owned in fee by the part.......... of the second part.\nIt is further understood and agreed as follows:\n(1) The part.......... of the second part will open, use and work the mine or mines on said land in such manner only as is usual and customary in skillful and proper mining operations of similar character when conducted by the proprietors on their own land and in accordance with the requirements, methods, and practices of good mining engineering, and in such manner as not to cause any unnecessary or unusual permanent injury to such mine or mines or inconvenience or hindrance in the subsequent operation of the same or in the development, mining, or disposal of any iron ore or other valuable mineral left on or in said land.\n(2) Subject to the approval of the commissioner of natural resources, all iron ore and other material produced or accumulated in connection with any operations hereunder and not otherwise lawfully disposed of shall be deposited or disposed of by the part.......... of the second part at such places and in such manner as will not hinder or embarrass such subsequent operations or activities; provided, that any such material containing iron or other minerals in such quantity or form as to have present or potential value shall be deposited only on the land covered by this lease, or on other land belonging to the state and available for the purpose, unless the commissioner of natural resources shall approve in writing its disposal in some other manner.\n(3) Land conveyed to the state upon condition that it shall be used for the storage of iron ore or other materials having present or potential value belonging to the state, subject to termination or reversion of title when no longer needed or used for that purpose, shall be deemed suitable and available therefor. The commissioner may accept such a conveyance in behalf of the state if the commissioner determines that the conditions thereof conform with the foregoing provisions and will fully protect the interests of the state in the materials to be so stored, but no consideration shall be paid for such conveyance unless authorized by law. The existence of mineral reservations with rights to use or destroy the surface in connection therewith, shall not prevent lands being deemed suitable and available if the commissioner finds that the lands are located off the generally recognized limits of the iron formation, and the commissioner finds that no minerals of any present or foreseeable commercial value are known to exist thereon. The provisions of section 500.20, shall not apply to any conveyance of land to the state pursuant to this subdivision and shall not limit the duration of any covenant, condition, restriction, or limitation created by any such conveyance.\nIt is understood and agreed that in case any interest in the land covered by this lease or in any minerals therein is owned by anyone other than the state, this lease shall not be construed as authorizing any invasion of or trespass upon such other interest, that in case it shall be necessary to make use of any such other interest in connection with any operations hereunder, the part.......... of the second part shall obtain all necessary legal rights therefor before proceeding therewith, that the part.......... of the second part shall be liable for all damages to any such other interest caused by any operations hereunder, and that the state shall not incur or be subject to any liability therefor.\nIn case it shall become impossible or impracticable at any time during the term of this lease to comply with the provisions hereof relating to sampling, analysis, shipping, or weighing of ore, or in case methods for any of said operations shall be developed which appear to be superior to those herein prescribed and which will not result in any loss or disadvantage to the state hereunder, the commissioner of natural resources, with the approval of the Executive Council, may make a supplemental agreement with the part.......... of the second part, modifying this lease so as to authorize the adoption of such other methods for any of said operations so far as deemed expedient.\nAll remittances by the part.......... of the second part hereunder shall be made payable to the commissioner of management and budget and shall be transmitted to the commissioner of natural resources, who shall audit the same, take such action as may be necessary on account of any error or discrepancy discovered, and deposit all remittances found due with the commissioner of management and budget.\nThe party of the first part reserves and shall at all times have a lien upon all ore mined and upon all improvements made by the part.......... of the second part upon the land covered by this lease for any unpaid sums due hereunder.\nThe part.......... of the second part shall have the right at any time to terminate this lease in so far as it requires the part.......... of the second part to mine ore on said land, or to pay royalty therefor, by delivering written notice of such intention to terminate to the commissioner of natural resources, who shall in writing acknowledge receipt of such notice, and this lease shall terminate 60 days after such delivery unless such notice is revoked by the part.......... of the second part by further written notice delivered to the commissioner before the expiration of said 60 days, and all arrearages and sums which shall be due under this lease up to the time of such termination shall be paid upon settlement and adjustment thereof by the part.......... of the second part.\nThis lease is granted upon the express condition that if any sum owing hereunder by the part.......... of the second part for rental, royalty, taxes, or otherwise shall remain unpaid after the expiration of 60 days from the time when the same became payable as herein provided, or in case the part.......... of the second part or any agent or servant thereof shall knowingly or willfully make any false statement in any statement, report, or account submitted to the state or to the commissioner of natural resources or any agents of the commissioner pertaining to any matter hereunder, or in case the part.......... of the second part shall fail to perform any of the covenants or conditions herein expressed to be performed by said part.......... of the second part, then it shall be the duty of the commissioner of natural resources to cancel this lease, first having mailed or delivered to the part.......... of the second part at least 20 days' notice in writing thereof, whereupon this lease shall terminate at the expiration of said 20 days, and the party of the first part shall reenter and again possess said premises as fully as if no lease had been given to the part.......... of the second part, and the part.......... of the second part and all persons claiming under such part.......... shall be wholly excluded therefrom except as hereinafter provided, but such termination and reentry shall not relieve the part.......... of the second part from any payment or other liability thereupon or theretofore incurred hereunder.\nIt is mutually agreed that upon the termination of this lease, whether by expiration of the term thereof or by act of either party, the part.......... of the second part shall have 90 days thereafter in which to remove all equipment, materials, railroad tracks, structures, and other property placed or erected by the part.......... of the second part upon said land, and any such property not removed within said time shall become the property of the party of the first part; but the part.......... of the second part shall not remove or impair any supports placed in any mine or mines on said land, or any timber or frame work necessary to the use or maintenance of shafts or other approaches to such mine or mines or tramways within the same. Subject thereto, it is understood and agreed that upon the termination of this lease by expiration of the term thereof or otherwise, the part.......... of the second part will quietly and peaceably surrender possession of the land covered thereby to the party of the first part.\nThe covenants, terms and conditions of this lease shall run with the land and shall extend to and bind all assignees and other successors in interest of the part.......... of the second part.\nThe provisions of this section relating to the contents of mining leases shall be deemed to be enabling provisions, and the respective officers and agencies of the state concerned therewith shall have all the authority, powers, and duties required for the execution and administration thereof.\nAny state iron ore mining lease heretofore or hereafter issued and in force may be modified by the commissioner of natural resources, with the approval of the Executive Council, upon application of the holder of the lease, by written agreement with the holder, so as to conform with the provisions of the laws in force at the time of such application with respect to the methods of shipping, weighing, and analyzing ore and computing royalty thereon, the time of payment of rental and royalty, the beneficiation or treatment of iron ore and the disposal of concentrates and residues therefrom, the stockpiling, depositing, or disposal of iron ore or other material, and the making of statements and reports pertaining to said matters.\nAny iron ore or other material which is subject to stockpiling under a state iron ore mining lease heretofore issued and in force on April 20, 1951, may, with the approval of the commissioner of natural resources, be stockpiled on land conveyed to the state for the purpose, subject to the provisions of subdivision 28.",
	"repealed": false
}