{
	"id": "398.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/398.09",
	"title": "398.09 SPECIFIC POWERS.",
	"text": "Park district boards in addition to the foregoing general powers shall have these specific powers:\n(a) The power to regulate by ordinance the use of the waters of any lake lying wholly within a park established under this chapter and the use of any lake shore which is within a park established under this chapter and the waterfront immediately abutting such lake shore for not to exceed 300 feet therefrom, by all persons, including persons boating, swimming, fishing, skating, or otherwise, in, upon, or about said lake, lake shore, and abutting waterfront, subject to regulation by the state of Minnesota.\n(b) The power to acquire lands either within or without the park district for conversion into forest reserves and for the conservation of the natural resources of the state, including streams, lakes, submerged lands and swamplands, and to these ends may create parks, parkways, forest reservations and other reservations and afforest, develop, improve, protect and promote the use of the same in such manner as is conducive to the general welfare. These lands may be acquired by the board, on behalf of the district, by gift or devise, by purchase or by condemnation. In furtherance of the use and enjoyment of the lands controlled by it, the board may accept donations of money or other property, or may act as trustee of land, money or other property and use and administer the same as stipulated by the donor, or as provided in the trust agreement. The terms of each trust shall first be approved by the district court before acceptance by the board. If the park district includes all or part of more than one court district, approval shall be by the district court of the court district having the largest area within the park district. In case of condemnation the proceedings are to be instituted in the name of the district and conducted in the manner provided in chapter 117 and acts now in effect and hereafter adopted amendatory thereof and supplemental thereto. Either the fee or any lesser interest may be acquired as the board deems advisable. Nothing herein contained shall authorize the board to:\n(1) acquire real estate by purchase or condemnation which is located within the boundaries of an incorporated statutory city or city unless the governing body of such statutory city or city shall have consented thereto by resolution duly adopted; or\n(2) acquire real estate by condemnation which is located outside the park district unless the board of county commissioners of the county in which such property is located has consented thereto by resolution duly adopted.\n(c) The power, if the board finds that any lands which it has acquired are not necessary for the purposes for which acquired, to dispose of such lands upon such terms as are advisable, including the power to transfer such lands to other public corporations. Where lands which were acquired by condemnation less than 20 years before are to be sold to private parties, the former owners, or their heirs, successors or assigns, shall be notified in writing of the board's intent to dispose of the properties and shall be given 20 days to purchase the property taken from them at such price as the board shall deem fair compensation to the district for such property. The board may lease any of its lands or permit their use for purposes consistent with the purposes for which the lands were acquired upon such terms as are advisable. No such lands shall be sold without the approval of the district court of the county in which the lands are situated.\n(d) The power to fix, alter, charge, and collect fees, tolls, and charges for the use of facilities of the park district, for services rendered by, or for any commodities furnished by, or for licenses issued by, the board pursuant to ordinances authorized hereunder. All fines collected for any violation of a board's ordinance shall be paid into the treasury of such park district board.\n(e) The power to borrow, make, and issue negotiable bonds, notes, and other evidences of indebtedness, subject to the provisions of sections 398.16 and 398.17, and to pledge its full faith, credit, and taxing power to the payment thereof, and/or to secure the payment of such obligations or any part thereof by mortgage, lien, pledge, deed of trust otherwise, on all or any of its property, contracts, franchises, or revenues and to make such agreements with the purchasers or holders of such notes, bonds or other evidences of indebtedness or with others in connection with the same, whether issued or to be issued.\n(f) The power to cooperate with or borrow from any governmental organization, state or federal, or from any agency of the state or federal government for any purpose within the scope of the authority of this corporation.\n(g) The power to cooperate with any public or municipal corporation, with the counties and with any private or public organization engaged in conservation, recreational activities, protection of the public health and safety, prevention of water pollution, sanitation, and/or mosquito abatement for any constructive purpose, and the power, upon request, to assume control of all or a portion of any existing parks or park lands owned by any county government or municipal corporation in the park district; such control shall be assumed only at the request of and by agreement with the public authority in control of such parks or park lands. Thereupon such parks or park lands may be developed, improved, protected, and operated as a park as in case of lands otherwise acquired by the board. Such acquisition or assumption of control or operation of a municipal park system by a park district shall in no way impair the authority and power of such municipality to levy and collect taxes for park, playground, and recreational purposes, all or part of such tax funds to be transferred to the park district for such uses as may be agreed upon between the district and the municipality.\n(h) The power to designate employees as police officers within the parks under the jurisdiction and control of the board, and employees so designated may exercise all the powers of police officers within the park lands under the jurisdiction and control of the board. Before exercising these powers, each such employee shall take an oath and give a bond to the state in such sum as the board prescribes for the proper performance of the employee's duties in such respect. The board may contract with municipalities or with the county or counties for the policing of park properties.\n(i) The power to enter into an agreement under section 471.59 with any political subdivision, governmental unit, or agency, including an elected park and recreation board in a city of the first class, to expend public money, including bond proceeds, in its possession for any metropolitan regional park purposes, including transferring money in its possession as a grant to other political subdivisions, governmental units, or agencies, including an elected park and recreation board in a city of the first class.",
	"repealed": false
}