{
	"id": "103D.335",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.335",
	"title": "103D.335 DISTRICT AND MANAGERS' POWERS.",
	"text": "A watershed district has the power, to the extent necessary for lawful conservation purposes:\n(1) to sue and be sued;\n(2) to incur debts, liabilities, and obligations;\n(3) to exercise the power of eminent domain;\n(4) to provide for assessments and to issue certificates, warrants, and bonds; and\n(5) to perform all acts expressly authorized, and all other acts necessary and proper for the watershed district to carry out and exercise the powers expressly vested in it.\nSection 471.59 relating to joint power authority applies to watershed districts organized under this chapter.\nSection 471.64 relating to acquisition and disposition of property from the United States and state agencies applies to watershed districts organized under this chapter.\n(a) The managers may use the powers in subdivisions 5 to 23 to implement this chapter.\n(b) The exercise of the managers' powers is subject to review by the board as provided in this chapter.\nThe managers may:\n(1) make necessary surveys or use other reliable surveys and data and develop projects and programs to acquire data to accomplish the purposes for which the watershed district is organized; and\n(2) establish and maintain devices for acquiring and recording hydrological and water quality data.\nThe managers may initiate, undertake, and implement projects not required to be instituted by a petition under section 103D.701.\nThe managers may cooperate or contract with any state or subdivision of a state or federal agency, private corporation, political subdivision, or cooperative association.\nThe managers may construct, clean, repair, alter, abandon, consolidate, reclaim, or change the course or terminus of any public ditch, drain, sewer, river, watercourse, natural or artificial, within the watershed district.\nThe managers may acquire, operate, construct, and maintain dams, dikes, reservoirs, water supply systems, and appurtenant works.\nThe managers may regulate, conserve, and control the use of water within the watershed district.\nThe managers may acquire by gift, purchase, taking under the procedures of this chapter, or by the power of eminent domain, necessary real and personal property. The managers may dispose of real or personal property when the property no longer serves a purpose of the watershed district. The watershed district may acquire property outside the watershed district where necessary for a water supply system.\nThe managers may contract for or purchase insurance the managers find necessary for the protection of the watershed district.\nThe managers may enter into contracts of construction or implementation authorized by this chapter.\nThe managers may enter lands inside or outside the watershed district to make surveys and investigations to accomplish the purposes of the watershed district. The watershed district is liable for actual damages resulting from entry.\nThe managers may take over when directed by a drainage authority all joint county or county drainage systems within the watershed district, together with the right to repair, maintain, and improve them.\nThe managers may provide for sanitation and public health and regulate the use of streams, ditches, or watercourses to dispose of waste and prevent pollution.\nThe managers may borrow funds from an agency of the federal government, a state agency, a county where the watershed district is located in whole or in part, or a financial institution authorized under chapter 47 to do business in this state. A county board may lend the amount requested by a watershed district. A watershed district may not have more than a total of $2,000,000 in loans from counties and financial institutions under this subdivision outstanding at any time.\nThe managers may prepare a floodplain map of the lands of the watershed district that are in the floodplain of lakes and watercourses. The map must be made available to the counties and local municipalities for inclusion in floodplain ordinances. It must conform to rules of the commissioner setting standards for designation of floodplain areas.\nThe managers may prepare an open space and greenbelt map of the lands of the watershed district that should be preserved and included in the open space and greenbelt land areas of the watershed district. The map must be made available to the counties and local municipalities for inclusion in floodplain and shoreland ordinances. The managers may control the use and development of land in the floodplain and the greenbelt and open space areas of the watershed district. The managers may adopt, amend, or repeal rules to control encroachments, the changing of land contours, the placement of fill and structures, and the placement of encumbrances or obstructions, and may require a landowner to remove fill, structures, encumbrances, or other obstructions and restore the previously existing land contours and vegetation. The managers may by rule provide a procedure for the watershed district to do the work required and assess its cost against the affected property as a special assessment. The rules apply only in the absence of county or municipal ordinances regulating the items set forth in this subdivision. The rules must be adopted in accordance with section 103D.341. Except as provided in section 103D.345, subdivision 3, rules adopted under this subdivision apply to the state.\nThe managers may appropriate necessary funds to provide for membership in a state association of watershed districts whose purpose is to improve watershed governmental operations.\nThe managers may make contracts or other arrangements with the federal government, persons, railroads or other corporations, political subdivisions, and the state or other states, with drainage authorities, flood control, soil conservation, or other improvement districts in this state or other states, for cooperation or assistance in constructing, maintaining, and operating the projects of the watershed district, or for the control of its waters, or for making surveys and investigations or reports on them. Property acquired for flood damage reduction purposes by the watershed district may be operated or leased by the district for agricultural purposes during periods the property is not needed for flood control, provided it remains subject to use by the watershed district as necessary for flood control purposes. Notwithstanding section 16A.695, revenue received by the watershed district from the operation or lease of state-bond-financed property acquired for flood control purposes shall be retained by the district in a separate project-specific account and used solely for flood control operation, maintenance, and replacement purposes within the related project area and, if the district determines that the account contains adequate reserves for future operation, maintenance, and replacement, any excess may be used for the construction, operation, maintenance, or replacement of other flood control projects as approved by the commissioner.\nThe managers may purchase, lease, or acquire land or other property in adjoining states to secure outlets, to construct and maintain dikes or dams or other structures for the purposes of this chapter.\n(a) A watershed district located wholly within the metropolitan area has the duties and powers in section 103B.211.\n(b) Notwithstanding any contrary provision of this section, a watershed district located entirely within the metropolitan area may regulate the use and development of land only under the conditions specified in section 103B.211, subdivision 1.\nA watershed district is exempt from fees charged by political subdivisions for permits required for activities conducted under subdivisions 8 to 10.\nThe managers may conduct studies and monitoring of water resources within the watershed district and implement water resource management programs.",
	"repealed": false
}