{
	"id": "136F.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.36",
	"title": "136F.36 TECHNICAL COLLEGE CARPENTRY PROGRAM CONSTRUCTION AUTHORITY.",
	"text": "For the purpose of instructional construction by technical colleges, the board may build, sell, or transfer personal property and may purchase or otherwise acquire real property that it does not intend to use as a permanent educational site. The board may, upon the terms and conditions it sets, develop, sell, transfer, or otherwise dispose of real property acquired under this section. A sale, transfer, or other disposition must be at fair market value. For purposes of this section, a sale price resulting from public bidding, public auction, or negotiations between unrelated parties acting in their self-interest is fair market value. Where real property acquired under this section cannot be sold, the board may lease the real property under the terms and conditions it sets. The board may also contract for the use of real property it does not own. Where the board makes improvements to real property it does not own, the landowner may compensate the board for the fair market value, nominal consideration, or without consideration as may be agreed on between the parties, of the board's contribution to the improvements. No other authorizing legislation or legislative approval is required for an acquisition, improvement, or sale under this section. Proceeds from the sale, lease, or improvement of real property under this section are appropriated to the board.\nThe sale requirements of chapters 92 and 94 do not apply to this section. The board shall develop policies for leasing requirements and construction supervision. The board will normally competitively bid contracts related to instructional construction but may negotiate contracts without competitive bidding where it deems appropriate.\nThe board may, in its discretion, offer the warranties contained in chapter 327A, less extensive warranties or no warranties.\nNotwithstanding section 16A.58, the board may store and retain at the respective technical college original documents from carpentry program transactions, including but not limited to deeds, abstracts of title, and certificates of title.\nNotwithstanding section 15.054, personal or real property resulting from instructional construction by technical colleges may be sold to a state employee under the following conditions:\n(1) there is reasonable public notice of the sale;\n(2) the sale is by public auction, sealed bid, or listing with a licensed real estate broker;\n(3) the state employee offers the highest price; and\n(4) the state employee was not involved in the development of the property or the award of the sale.",
	"repealed": false
}