{
	"id": "245G.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/245G.13",
	"title": "245G.13 PROVIDER PERSONNEL POLICIES.",
	"text": "A license holder must have written personnel policies that are available to each staff member. The personnel policies must:\n(1) ensure that staff member retention, promotion, job assignment, or pay are not affected by a good faith communication between a staff member and the department, the Department of Health, the ombudsman for mental health and developmental disabilities, law enforcement, or a local agency for the investigation of a complaint regarding a client's rights, health, or safety;\n(2) contain a job description for each staff member position specifying responsibilities, degree of authority to execute job responsibilities, and qualification requirements;\n(3) provide for a job performance evaluation based on standards of job performance conducted on a regular and continuing basis, including a written annual review;\n(4) describe behavior that constitutes grounds for disciplinary action, suspension, or dismissal, including policies prohibiting personal involvement with a client in violation of chapter 604, and policies prohibiting client abuse described in sections 245A.65, 626.557, and 626.5572, and chapter 260E;\n(5) describe the process for disciplinary action, suspension, or dismissal of a staff person for violating the drug and alcohol policy described in section 245A.04, subdivision 1, paragraph (c);\n(6) include a chart or description of the organizational structure indicating lines of authority and responsibilities;\n(7) include orientation within 24 working hours of starting for each new staff member based on a written plan that, at a minimum, must provide training related to the staff member's specific job responsibilities, policies and procedures, client confidentiality, HIV minimum standards, and client needs; and\n(8) include policies outlining the license holder's response to a staff member with a behavior problem that interferes with the provision of treatment service.\n(a) A license holder must ensure that each staff member has the training described in this subdivision.\n(b) Each staff member must be trained every two years in:\n(1) client confidentiality rules and regulations and client ethical boundaries; and\n(2) emergency procedures and client rights as specified in sections 144.651, 148F.165, and 253B.03.\n(c) Annually each staff member with direct contact must be trained on mandatory reporting as specified in sections 245A.65, 626.557, and 626.5572, and chapter 260E, including specific training covering the license holder's policies for obtaining a release of client information.\n(d) Upon employment and annually thereafter, each staff member with direct contact must receive training on HIV minimum standards according to section 245A.19.\n(e) The license holder must ensure that each mandatory reporter, as described in section 260E.06, subdivision 1, is trained on the maltreatment of minors reporting requirements and definitions in chapter 260E before the mandatory reporter has direct contact, as defined in section 245C.02, subdivision 11, with a person served by the program.\n(f) A treatment director, supervisor, nurse, or counselor must have a minimum of 12 hours of training in co-occurring disorders that includes competencies related to philosophy, trauma-informed care, screening, assessment, diagnosis and person-centered treatment planning, documentation, programming, medication, collaboration, mental health consultation, and discharge planning. A new staff member who has not obtained the training must complete the training within six months of employment. A staff member may request, and the license holder may grant, credit for relevant training obtained before employment, which must be documented in the staff member's personnel file.\nThe license holder must maintain a separate personnel file for each staff member. At a minimum, the personnel file must conform to the requirements of this chapter. A personnel file must contain the following:\n(1) a completed application for employment signed by the staff member and containing the staff member's qualifications for employment;\n(2) documentation related to the staff member's background study data, according to chapter 245C;\n(3) for a staff member who provides psychotherapy services, employer names and addresses for the past five years for which the staff member provided psychotherapy services, and documentation of an inquiry required by sections 604.20 to 604.205 made to the staff member's former employer regarding substantiated sexual contact with a client;\n(4) documentation that the staff member completed orientation and training;\n(5) documentation that the staff member meets the requirements in section 245G.11;\n(6) documentation demonstrating the staff member's compliance with section 245G.08, subdivision 3, for a staff member who conducts administration of medication; and\n(7) documentation demonstrating the staff member's compliance with section 245G.18, subdivision 2, for a staff member that treats an adolescent client.",
	"repealed": false
}