{
	"id": "147A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/147A.13",
	"title": "147A.13 GROUNDS FOR DISCIPLINARY ACTION.",
	"text": "The board may refuse to grant licensure or may impose disciplinary action as described in this subdivision against any physician assistant. The following conduct is prohibited and is grounds for disciplinary action:\n(1) failure to demonstrate the qualifications or satisfy the requirements for licensure contained in this chapter or rules of the board. The burden of proof shall be upon the applicant to demonstrate such qualifications or satisfaction of such requirements;\n(2) obtaining a license by fraud or cheating, or attempting to subvert the examination process. Conduct which subverts or attempts to subvert the examination process includes, but is not limited to:\n(i) conduct which violates the security of the examination materials, such as removing examination materials from the examination room or having unauthorized possession of any portion of a future, current, or previously administered licensing examination;\n(ii) conduct which violates the standard of test administration, such as communicating with another examinee during administration of the examination, copying another examinee's answers, permitting another examinee to copy one's answers, or possessing unauthorized materials; and\n(iii) impersonating an examinee or permitting an impersonator to take the examination on one's own behalf;\n(3) conviction, during the previous five years, of a felony reasonably related to the practice of physician assistant. Conviction as used in this subdivision includes a conviction of an offense which if committed in this state would be deemed a felony without regard to its designation elsewhere, or a criminal proceeding where a finding or verdict of guilt is made or returned but the adjudication of guilt is either withheld or not entered;\n(4) revocation, suspension, restriction, limitation, or other disciplinary action against the person's physician assistant credentials in another state or jurisdiction, failure to report to the board that charges regarding the person's credentials have been brought in another state or jurisdiction, or having been refused licensure by any other state or jurisdiction;\n(5) advertising which is false or misleading, violates any rule of the board, or claims without substantiation the positive cure of any disease or professional superiority to or greater skill than that possessed by another physician assistant;\n(6) violating a rule adopted by the board or an order of the board, a state, or federal law which relates to the practice of a physician assistant, or in part regulates the practice of a physician assistant, including without limitation sections 604.201, 609.344, and 609.345, or a state or federal narcotics or controlled substance law;\n(7) engaging in any unethical conduct; conduct likely to deceive, defraud, or harm the public, or demonstrating a willful or careless disregard for the health, welfare, or safety of a patient; or practice which is professionally incompetent, in that it may create unnecessary danger to any patient's life, health, or safety, in any of which cases, proof of actual injury need not be established;\n(8) engaging in the practice of medicine beyond what is allowed under this chapter, or aiding or abetting an unlicensed person in the practice of medicine;\n(9) adjudication as mentally incompetent, mentally ill or developmentally disabled, or as a chemically dependent person, a person dangerous to the public, a sexually dangerous person, or a person who has a sexual psychopathic personality by a court of competent jurisdiction, within or without this state. Such adjudication shall automatically suspend a license for its duration unless the board orders otherwise;\n(10) engaging in unprofessional conduct. Unprofessional conduct includes any departure from or the failure to conform to the minimal standards of acceptable and prevailing practice in which proceeding actual injury to a patient need not be established;\n(11) inability to practice with reasonable skill and safety to patients by reason of illness, drunkenness, use of drugs, narcotics, chemicals, or any other type of material, or as a result of any mental or physical condition, including deterioration through the aging process or loss of motor skills;\n(12) revealing a privileged communication from or relating to a patient except when otherwise required or permitted by law;\n(13) any identification of a physician assistant by the title \"Physician\" in a patient care setting or in a communication directed to the general public;\n(14) improper management of medical records, including failure to maintain adequate medical records, to comply with a patient's request made pursuant to sections 144.291 to 144.298, or to furnish a medical record or report required by law;\n(15) engaging in abusive or fraudulent billing practices, including violations of the federal Medicare and Medicaid laws or state medical assistance laws;\n(16) becoming addicted or habituated to a drug or intoxicant;\n(17) prescribing a drug or device for other than medically accepted therapeutic, experimental, or investigative purposes authorized by a state or federal agency or referring a patient to any health care provider as defined in sections 144.291 to 144.298 for services or tests not medically indicated at the time of referral;\n(18) engaging in conduct with a patient which is sexual or may reasonably be interpreted by the patient as sexual, or in any verbal behavior which is seductive or sexually demeaning to a patient;\n(19) failure to make reports as required by section 147A.14 or to cooperate with an investigation of the board as required by section 147A.15, subdivision 3;\n(20) knowingly providing false or misleading information that is directly related to the care of that patient unless done for an accepted therapeutic purpose such as the administration of a placebo;\n(21) aiding suicide or aiding attempted suicide in violation of section 609.215 as established by any of the following:\n(i) a copy of the record of criminal conviction or plea of guilty for a felony in violation of section 609.215, subdivision 1 or 2;\n(ii) a copy of the record of a judgment of contempt of court for violating an injunction issued under section 609.215, subdivision 4;\n(iii) a copy of the record of a judgment assessing damages under section 609.215, subdivision 5; or\n(iv) a finding by the board that the person violated section 609.215, subdivision 1 or 2. The board shall investigate any complaint of a violation of section 609.215, subdivision 1 or 2; or\n(22) failure to maintain the proof of review document as required under section 147A.09, subdivision 3, or to provide a copy of the document upon request of the board.\n(a) For purposes of this subdivision, \"reproductive health care services\" has the meaning given in section 147.091, subdivision 1c.\n(b) Notwithstanding subdivision 1, clause (3) or (4), the board shall not refuse to grant a license to an applicant for licensure or impose disciplinary action against a physician assistant solely on one or more of the following grounds:\n(1) the applicant or physician assistant provided or assisted in the provision of reproductive health care services in a manner that is lawful in this state and that is within the applicable scope of practice;\n(2) the applicant or physician assistant was convicted in another jurisdiction of a felony resulting from conduct specified in clause (1); or\n(3) the applicant or physician assistant was subject to disciplinary action in another jurisdiction or was refused a physician assistant license in another jurisdiction resulting from conduct specified in clause (1).\nA suspension, revocation, condition, limitation, qualification, or restriction of a license shall be in effect pending determination of an appeal unless the court, upon petition and for good cause shown, orders otherwise.\nA physician assistant license is automatically suspended if:\n(1) a guardian of a licensee is appointed by order of a court pursuant to sections 524.5-101 to 524.5-502, for reasons other than the minority of the licensee; or\n(2) the licensee is committed by order of a court pursuant to chapter 253B. The license remains suspended until the licensee is restored to capacity by a court and, upon petition by the licensee, the suspension is terminated by the board after a hearing.\nIn its discretion, the board may restore and reissue a physician assistant license, but may impose as a condition any disciplinary or corrective measure which it might originally have imposed.\nIn addition to any other remedy provided by law, the board may, without a hearing, temporarily suspend the license of a physician assistant if the board finds that the physician assistant has violated a statute or rule which the board is empowered to enforce and continued practice by the physician assistant would create a serious risk of harm to the public. The suspension shall take effect upon written notice to the physician assistant, specifying the statute or rule violated. The suspension shall remain in effect until the board issues a final order in the matter after a hearing. At the time it issues the suspension notice, the board shall schedule a disciplinary hearing to be held pursuant to the Administrative Procedure Act.\nThe physician assistant shall be provided with at least 20 days' notice of any hearing held pursuant to this subdivision. The hearing shall be scheduled to begin no later than 30 days after the issuance of the suspension order.\nIn disciplinary actions alleging a violation of subdivision 1, clause (3) or (4), a copy of the judgment or proceeding under the seal of the court administrator or of the administrative agency which entered it shall be admissible into evidence without further authentication and shall constitute prima facie evidence of the contents thereof.\n(a) If the board has probable cause to believe that a physician assistant comes under subdivision 1, clause (1), it may direct the physician assistant to submit to a mental or physical examination. For the purpose of this subdivision, every physician assistant licensed under this chapter is deemed to have consented to submit to a mental or physical examination when directed in writing by the board and further to have waived all objections to the admissibility of the examining physicians' testimony or examination reports on the ground that the same constitute a privileged communication. Failure of a physician assistant to submit to an examination when directed constitutes an admission of the allegations against the physician assistant, unless the failure was due to circumstance beyond the physician assistant's control, in which case a default and final order may be entered without the taking of testimony or presentation of evidence. A physician assistant affected under this subdivision shall at reasonable intervals be given an opportunity to demonstrate that the physician assistant can resume competent practice with reasonable skill and safety to patients. In any proceeding under this subdivision, neither the record of proceedings nor the orders entered by the board shall be used against a physician assistant in any other proceeding.\n(b) In addition to ordering a physical or mental examination, the board may, notwithstanding sections 13.384, 144.651, or any other law limiting access to medical or other health data, obtain medical data and health records relating to a licensee or applicant without the licensee's or applicant's consent if the board has probable cause to believe that a physician assistant comes under subdivision 1, clause (1).\nThe medical data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (i), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this subdivision and is not liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this subdivision, unless the information is false and the provider giving the information knew, or had reason to believe, the information was false. Information obtained under this subdivision is classified as private under chapter 13.\n(a) In addition to the provisions of subdivision 1, the board may not issue or renew a license if the commissioner of revenue notifies the board and the licensee or applicant for licensure that the licensee or applicant owes the state delinquent taxes in the amount of $500 or more. The board may issue or renew the license only if:\n(1) the commissioner of revenue issues a tax clearance certificate; and\n(2) the commissioner of revenue, the licensee, or the applicant forwards a copy of the clearance to the board.\nThe commissioner of revenue may issue a clearance certificate only if the licensee or applicant does not owe the state any uncontested delinquent taxes.\n(b) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"Taxes\" are all taxes payable to the commissioner of revenue, including penalties and interest due on those taxes, and\n(2) \"Delinquent taxes\" do not include a tax liability if:\n(i) an administrative or court action that contests the amount or validity of the liability has been filed or served;\n(ii) the appeal period to contest the tax liability has not expired; or\n(iii) the licensee or applicant has entered into a payment agreement to pay the liability and is current with the payments.\n(c) When a licensee or applicant is required to obtain a clearance certificate under this subdivision, a contested case hearing must be held if the licensee or applicant requests a hearing in writing to the commissioner of revenue within 30 days of the date of the notice provided in paragraph (a). The hearing must be held within 45 days of the date the commissioner of revenue refers the case to the Office of Administrative Hearings. Notwithstanding any law to the contrary, the licensee or applicant must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the registrant or applicant. The notice may be served personally or by mail.\n(d) The board shall require all licensees or applicants to provide their Social Security number and Minnesota business identification number on all license applications. Upon request of the commissioner of revenue, the board must provide to the commissioner of revenue a list of all licensees and applicants, including their names and addresses, Social Security numbers, and business identification numbers. The commissioner of revenue may request a list of the licensees and applicants no more than once each calendar year.\nNo board proceeding against a licensee shall be instituted unless commenced within seven years from the date of commission of some portion of the offense except for alleged violations of subdivision 1, clause (19), or subdivision 7.",
	"repealed": false
}