{
	"id": "424A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.05",
	"title": "424A.05 RELIEF ASSOCIATION SPECIAL FUND.",
	"text": "Every firefighters relief association shall establish and maintain a special fund within the relief association.\nThe special fund must be credited with all fire state aid and police and firefighter retirement supplemental state aid received under chapter 477B and section 423A.022, all taxes levied by or other revenues received from the municipality under sections 424A.091 to 424A.096 or any applicable special law requiring municipal support for the relief association, any funds or property donated, given, granted or devised by any person which is specified for use for the support of the special fund and any interest or investment return earned upon the assets of the special fund. The treasurer of the relief association is the custodian of the assets of the special fund and must be the recipient on behalf of the special fund of all revenues payable to the special fund. The treasurer shall maintain adequate records documenting any transaction involving the assets or the revenues of the special fund. These records and the bylaws of the relief association are public and must be open for inspection by any member of the relief association, any officer or employee of the state or of the municipality, or any member of the public, at reasonable times and places.\n(a) Disbursements from the special fund may not be made for any purpose other than one of the following:\n(1) for the payment of service pensions to retired members of the relief association if authorized and paid under law and the bylaws governing the relief association;\n(2) for the purchase of an annuity for the applicable person under section 424A.015, subdivision 3, for the transfer of service pension or benefit amounts to the applicable person's individual retirement account under section 424A.015, subdivision 4, or to the applicable person's account in the Minnesota deferred compensation plan under section 424A.015, subdivision 5;\n(3) for the payment of temporary or permanent disability benefits to disabled members of the relief association if authorized and paid under law and specified in amount in the bylaws governing the relief association;\n(4) for the payment of survivor benefits or for the payment of a death benefit to the estate of the deceased active or deferred firefighter, if authorized and paid under law and specified in amount in the bylaws governing the relief association;\n(5) for the payment of the fees, dues and assessments to the Minnesota State Fire Department Association and to the Minnesota State Fire Chiefs Association in order to entitle relief association members to membership in and the benefits of these associations or organizations;\n(6) for the payment of insurance premiums to the state Volunteer Firefighters Benefit Association, or an insurance company licensed by the state of Minnesota offering casualty insurance, in order to entitle relief association members to membership in and the benefits of the association or organization;\n(7) for the payment of administrative expenses of the relief association as authorized under subdivision 3b; and\n(8) for the payment of a service pension to the former spouse of a member or former member of a relief association, if the former spouse is an alternate payee designated in a qualified domestic relations order under subdivision 5.\n(b) Checks or authorizations for electronic fund transfers for disbursements authorized by this section must be signed by the relief association treasurer and at least one other elected trustee who has been designated by the board of trustees to sign the checks or authorizations. A relief association may make disbursements authorized by this subdivision by electronic fund transfers only if the specific method of payment and internal control policies and procedures regarding the method are approved by the board of trustees.\nUpon notification of funds deposited in error in the special fund and after presentation of evidence that the error occurred in good faith, the state auditor may require the relief association to provide a written legal opinion concluding that the transfer of funds from the special fund is consistent with federal and state law. Taking into consideration the evidence of good faith presented and the legal opinion, if any, provided, the state auditor may order the transfer from the special fund to the appropriate fund or account an amount equal to the funds deposited in error.\n(a) Notwithstanding any provision of law to the contrary, the payment of the following necessary, reasonable, and direct expenses of maintaining, protecting, and administering the special fund, when provided for in the bylaws of the association and approved by the board of trustees, constitutes authorized administrative expenses of a firefighters relief association organized under any law of the state or the Bloomington Fire Department Relief Association:\n(1) office expenses, including but not limited to rent, utilities, equipment, supplies, postage, periodical subscriptions, furniture, fixtures, and salaries of administrative personnel;\n(2) salaries of the officers of the association or their designees, and salaries of the members of the board of trustees of the association if the salary amounts are approved by the governing body of the entity that is responsible for meeting any minimum obligation under section 424A.092 or 424A.093 or Laws 2013, chapter 111, article 5, sections 31 to 42, and the itemized expenses of relief association officers and board members that are incurred as a result of fulfilling their responsibilities as administrators of the special fund;\n(3) tuition, registration fees, organizational dues, and other authorized expenses of the officers or members of the board of trustees incurred in attending educational conferences, seminars, or classes relating to the administration of the relief association;\n(4) audit and audit-related services, accounting and accounting-related services, and actuarial, medical, legal, and investment and performance evaluation expenses;\n(5) filing and application fees necessary to administer the special fund payable by the relief association to federal or other government entities;\n(6) reimbursement to the officers and members of the board of trustees or their designees, for reasonable and necessary expenses actually paid and incurred in the performance of their duties as officers or members of the board; and\n(7) premiums on fiduciary liability insurance and official bonds for the officers, members of the board of trustees, and employees of the relief association.\n(b) All other expenses of the relief association must be paid from the general fund of the association if one exists. If a relief association has only one fund, that fund is the special fund for purposes of this subdivision. If a relief association has a special fund and a general fund, the payment of any expense of the relief association that is directly related to the purposes for which both funds were established must be apportioned between the two funds on the basis of the benefits derived by each fund.\nThe assets of the special fund must be invested only in securities authorized by section 424A.095.\n(a) A \"qualified domestic relations order\" means a domestic relations order that creates or recognizes the existence of an alternate payee's right to or assigns to an alternate payee the right to receive a service pension that is all or any portion of the service pension payable with respect to a member or former member of a relief association.\n(b) An \"alternate payee\" means the former spouse of a member or former member of a relief association, including a former spouse who is a distributee as defined in section 356.633, subdivision 1, paragraph (b).\n(c) A relief association must comply with a qualified domestic relations order purporting to assign all or a portion of a service pension accrued under the retirement plan of the relief association, to the extent vested, if the payment or payments required by the order are within the limits described in section 518.58, subdivision 4, paragraph (a), clauses (1) to (4). For the purpose of applying section 518.58, subdivision 4, paragraph (a), \"plan\" or \"pension plan\" as used in paragraph (a) means the articles or bylaws of the relief association and chapter 424A, as applicable to the relief association.\n(d) Notwithstanding any state law to the contrary, the bylaws of a relief association may permit distribution to an alternate payee under a qualified domestic relations order:\n(1) as early as administratively practicable after the order is received by the relief association, even if the member whose service pension is being assigned to the alternate payee under the order has not yet reached age 50 or separated from active service with the fire department affiliated with the relief association; and\n(2) in a lump sum, even if the relief association is a defined benefit relief association that pays monthly service pensions under section 424A.093.\n(e) If the service pension is an eligible rollover distribution as defined in section 356.633, subdivision 1, paragraph (d), the relief association must permit the alternate payee to elect a direct rollover, as provided under section 356.633, subdivisions 1 and 2.",
	"repealed": false
}