{
	"id": "518A.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.42",
	"title": "518A.42 ABILITY TO PAY; SELF-SUPPORT ADJUSTMENT.",
	"text": "(a) It is a rebuttable presumption that a child support order should not exceed the obligor's ability to pay. To determine the amount of child support the obligor has the ability to pay, the court shall follow the procedure set out in this section.\n(b) The court shall calculate the obligor's income available for support by subtracting a monthly self-support reserve equal to 120 percent of the federal poverty guidelines for one person from the obligor's parental income for determining child support (PICS). If benefits under section 518A.31 are received by the obligee as a representative payee for a joint child or are received by the child attending school, based on the other parent's eligibility, the court shall subtract the amount of benefits from the obligor's PICS before subtracting the self-support reserve. If the obligor's income available for support calculated under this paragraph is equal to or greater than the obligor's support obligation calculated under section 518A.34, the court shall order child support under section 518A.34.\n(c) If the obligor's income available for support calculated under paragraph (b) is more than the minimum support amount under subdivision 2, but less than the guideline amount under section 518A.34, then the court shall apply a reduction to the child support obligation in the following order, until the support order is equal to the obligor's income available for support:\n(1) medical support obligation;\n(2) child care support obligation; and\n(3) basic support obligation.\n(d) If the obligor's income available for support calculated under paragraph (b) is equal to or less than the minimum support amount under subdivision 2 or if the obligor's gross income is less than 120 percent of the federal poverty guidelines for one person, the minimum support amount under subdivision 2 applies.\n(a) If the basic support amount applies, the court must order the following amount as the minimum basic support obligation:\n(1) for one child, the obligor's basic support obligation is $50 per month;\n(2) for two children, the obligor's basic support obligation is $60 per month;\n(3) for three children, the obligor's basic support obligation is $70 per month;\n(4) for four children, the obligor's basic support obligation is $80 per month;\n(5) for five children, the obligor's basic support obligation is $90 per month; and\n(6) for six or more children, the obligor's basic support obligation is $100 per month.\n(b) If the court orders the obligor to pay the minimum basic support amount under this subdivision, the obligor is presumed unable to pay child care support and medical support.\n(a) The minimum basic support amount under subdivision 2 does not apply to an obligor who is incarcerated.\n(b) The minimum basic support amount under subdivision 2 does not apply to an obligor who is a recipient of:\n(1) a general assistance grant;\n(2) Supplemental Security Income;\n(3) a Temporary Assistance for Needy Families (TANF) grant; or\n(4) comparable state-funded Minnesota family investment program (MFIP) benefits.\n(c) If the court finds the obligor receives no income and completely lacks the ability to earn income, the minimum basic support amount under subdivision 2 does not apply.\n(d) If the obligor's basic support amount is reduced below the minimum basic support amount due to the application of the parenting expense adjustment, the minimum basic support amount under subdivision 2 does not apply and the lesser amount is the guideline basic support.",
	"repealed": false
}