{
	"id": "144.197",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.197",
	"title": "144.197 CANNABIS AND SUBSTANCE MISUSE PREVENTION AND EDUCATION PROGRAMS.",
	"text": "The commissioner of health, in consultation with the commissioners of human services and education and in collaboration with local health departments and Tribal health departments, shall conduct a long-term, coordinated program to raise public awareness about substance misuse prevention, treatment options, and recovery options. The program must address adverse health effects associated with the use of cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products by persons under age 25. In conducting this education program, the commissioner shall engage and consult with youth around the state on program content and on methods to effectively disseminate program information to youth around the state.\nThe commissioner of health, in consultation with the commissioners of human services and education, shall conduct a long-term, coordinated prevention program focused on (1) preventing substance use by pregnant individuals, breastfeeding individuals, and individuals who may become pregnant, and (2) raising public awareness of the risks of substance use while pregnant or breastfeeding. The program must include education on the adverse health effects of prenatal exposure to cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products and on the adverse health effects experienced by infants and children who are exposed to cannabis flower, cannabis products, lower-potency hemp edibles, or hemp-derived consumer products in breast milk, from secondhand smoke, or by ingesting cannabinoid products. This prevention and education program must also educate individuals on what constitutes a substance use disorder, signs of a substance use disorder, and treatment options for persons with a substance use disorder. The prevention and education program must also provide resources, including training resources, technical assistance, or educational materials, to local public health home visiting programs, Tribal home visiting programs, and child welfare workers.\nMS 2023 Supp [Repealed by amendment, 2024 c 121 art 3 s 1]\nThe commissioner of health shall distribute grants to local health departments and Tribal health departments for the departments to create prevention, education, and recovery programs focusing on substance misuse prevention and treatment options. The programs must include specific cannabis-related initiatives.",
	"repealed": false
}