{
	"id": "82A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/82A.02",
	"title": "82A.02 DEFINITIONS.",
	"text": "\"Advertisement\" or \"advertising\" means any written or printed communication or any communication transmitted on radio, television, electronic means, or similar communications media other than telephone, published in connection with the offer or sale of membership camping contracts or to induce prospective purchasers to visit or attend an offer or sales presentation.\n\"Advanced payment\" means any money paid in advance regardless of its descriptive nomenclature, including, but not limited to, a management fee, listing, security, or advance fee or payment.\n\"Amenity\" means any major recreational building, swimming pool, utility serviced camping sites, or similar facility which is represented as available for use by purchasers now or in the future.\n\"Affiliate\" of another person means any person directly or indirectly controlling, controlled by, or under common control with the other person.\n\"Blanket encumbrance\" means any mortgage, deed of trust, option to purchase, vendor's lien or interest under a contract or agreement of sale, judgment lien, federal or state tax lien, or any other material lien or encumbrance which secures or evidences the obligation to pay money or to sell or convey any campground located in this state, or any portion thereof, made available to purchasers by the membership camping operator, and which authorizes, permits, or requires the foreclosure or other disposition of the campground. \"Blanket encumbrance\" also includes the lessor's interest in a lease of a campground which is located in this state, or any portion thereof, and which is made available to purchasers by a membership camping operator. \"Blanket encumbrance\" does not include a lien for taxes or assessments levied by any public authority which are not yet due and payable.\n\"Broker\" means a person who, for a fee or other valuable consideration, resells a membership camping contract to a new purchaser on behalf of a prior purchaser or who engages in the business of buying and selling membership camping contracts. \"Broker\" does not include a membership camping operator or a licensed salesperson acting on behalf of a membership camping operator or a licensed broker.\n\"Campground\" means real property owned or operated by a membership camping operator which is available for use by purchasers of membership camping contracts. Campground does not include:\n(1) a recreational camping area as defined by section 327.14, subdivision 8, if the operator of the recreational camping area does not offer or sell membership camping contracts, but rather rents or licenses camping sites on the recreational camping area for a per use fee; or\n(2) a manufactured home park as defined in section 327.14, subdivision 3.\n\"Camping site\" means a space on a campground designed and promoted for the purpose of locating a trailer, tent, tent trailer, pickup camper, or other similar device used for camping.\n\"Commissioner\" means the commissioner of commerce of the state of Minnesota or an authorized delegate.\n\"Controlling person\" of a membership camping operator means each director and officer and each owner of 25 percent or more of stock of the operator, if the operator is a corporation; and each general partner and each owner of 25 percent or more of the partnership or other interests, if the operator is a general or limited partnership or other person doing business as a membership camping operator.\n\"Membership camping contract\" means an agreement offered or sold within this state evidencing a purchaser's right or license to use for more than one year a campground owned or operated by a membership camping operator and includes a membership which provides for this use.\n\"Membership camping operator\" or \"operator\" means any person, other than one that is tax exempt under section 501(c)(3) of the Internal Revenue Code of 1986, as amended through December 31, 1992, that owns or operates a campground and offers or sells membership camping contracts paid for by a fee or periodic payments and has as one of its purposes camping or outdoor recreation including use of camping sites by purchasers. \"Membership camping operator\" does not include any person who engages in the business of arranging and selling reciprocal programs except to the extent such person owns or operates campgrounds.\n\"Nondisturbance agreement\" means any instrument by which the holder of a blanket encumbrance agrees that:\n(1) its rights in any campground located in this state made available to purchasers by the membership camping operator shall be subordinate to the rights of purchasers;\n(2) the holder and all successors and assigns, and any person who acquires a campground located in this state through foreclosure or by deed in lieu of foreclosure of the blanket encumbrance, or by default or cancellation of a lease shall take the property subject to the rights of purchasers; and\n(3) the holder or any successor acquiring a campground located in this state through the blanket encumbrance shall not use or cause the campground to be used in a manner which would materially prevent the purchasers from using or occupying the campground in the manner contemplated by the purchasers' membership camping contract; provided, however, the holder shall have no obligation or liability to assume the responsibilities or obligations of the membership camping operator under the membership camping contract.\nThe agreement may be in any form or language that reasonably evidences the foregoing.\n\"Offer\" means every inducement, solicitation, or attempt to encourage a person to acquire a membership camping contract.\n\"Own,\" \"owned,\" or \"ownership\" means to hold title, either legal or equitable, in real property.\n\"Person\" means an individual, corporation, business trust, estate, trust, partnership, unincorporated association, two or more of any of the foregoing having a joint or common interest, or any other legal or commercial entity.\n\"Purchaser\" means a person who enters into a membership camping contract with a membership camping operator and obtains the right to use the campground owned or operated by the membership camping operator.\n\"Reciprocal program\" means any arrangements allowing purchasers to use campgrounds owned or operated by persons other than the membership camping operator with whom the purchaser has entered into a membership camping contract.\n\"Sale\" or \"sell\" means entering into, or other disposition of, a membership camping contract for value. \"Value\" does not include any fee charged by a membership camping operator to offset the reasonable costs of transfer of a membership camping contract from an existing purchaser to a new purchaser.\n\"Salesperson\" means an individual, other than a membership camping operator or broker, who offers or sells membership camping contracts, but does not include individuals who refer persons, provided that the referring party is a current member of the campground or does not directly or indirectly receive compensation of more than $150 per referral, does not make more than 15 referrals per year, and has entered into a referral agreement with a membership camping operator that prohibits the discussion of terms or prices of camping memberships. The practice of subcontracting referral services where referral fees are split or shared with another person is prohibited.",
	"repealed": false
}