{
	"id": "297H.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/297H.06",
	"title": "297H.06 EXEMPTIONS.",
	"text": "The amount of a surcharge, fee, or charge established pursuant to section 115A.919, 115A.921, 115A.923, 400.08, 473.811, or 473.843, or a service charge by a home rule charter or statutory city that owns and operates a solid waste-to-energy resource recovery facility, is exempt from the solid waste management tax. The exemption does not apply to the tax imposed on market price under section 297H.02, subdivision 1, paragraphs (b) and (c), or section 297H.03, subdivision 1, paragraphs (b) and (c).\nThe tax is not imposed upon charges to generators of mixed municipal solid waste or upon the volume of nonmixed municipal solid waste for waste management services to manage the following materials:\n(1) mixed municipal solid waste and nonmixed municipal solid waste generated outside of Minnesota;\n(2) recyclable materials that are separated for recycling by the generator, collected separately from other waste, and recycled, to the extent the price of the service for handling recyclable material is separately itemized on a bill to the generator;\n(3) recyclable nonmixed municipal solid waste that is separated for recycling by the generator, collected separately from other waste, delivered to a waste facility for the purpose of recycling, and recycled;\n(4) industrial waste, when it is transported to a facility owned and operated by the same person that generated it;\n(5) mixed municipal solid waste from a recycling facility that separates or processes recyclable materials and reduces the volume of the waste by at least 85 percent, provided that the exempted waste is managed separately from other waste;\n(6) recyclable materials that are separated from mixed municipal solid waste by the generator, collected and delivered to a waste facility that recycles at least 85 percent of its waste, and are collected with mixed municipal solid waste that is segregated in leakproof bags, provided that the mixed municipal solid waste does not exceed five percent of the total weight of the materials delivered to the facility and is ultimately delivered to a waste facility identified as a preferred waste management facility in county solid waste plans under section 115A.46;\n(7) source-separated compostable materials, if the materials are delivered to a facility exempted as described in this clause. To initially qualify for an exemption, a facility must apply for an exemption in its application for a new or amended solid waste permit to the Pollution Control Agency. The first time a facility applies to the agency it must certify in its application that it will comply with the criteria in items (i) to (v) and the commissioner of the agency shall so certify to the commissioner of revenue who must grant the exemption. The facility must annually apply to the agency for certification to renew its exemption for the following year. The application must be filed according to the procedures of, and contain the information required by, the agency. The commissioner of revenue shall grant the exemption if the commissioner of the Pollution Control Agency finds and certifies to the commissioner of revenue that based on an evaluation of the composition of incoming waste and residuals and the quality and use of the product:\n(i) generators separate materials at the source;\n(ii) the separation is performed in a manner appropriate to the technology specific to the facility that:\n(A) maximizes the quality of the product;\n(B) minimizes the toxicity and quantity of rejects; and\n(C) provides an opportunity for significant improvement in the environmental efficiency of the operation;\n(iii) the operator of the facility educates generators, in coordination with each county using the facility, about separating the waste to maximize the quality of the waste stream for technology specific to the facility;\n(iv) process rejects do not exceed 15 percent of the weight of the total material delivered to the facility; and\n(v) the final product is accepted for use;\n(8) waste and waste by-products for which the tax has been paid; and\n(9) daily cover for landfills that has been approved in writing by the Minnesota Pollution Control Agency.\nThe tax is not imposed on construction debris generated from repair and demolition activities caused by a disaster occurring in a presidentially declared disaster area, provided that the construction debris is disposed of in a waste management facility designated by the commissioner of the Pollution Control Agency. To be exempt, the debris must be disposed of within 18 months following the presidential declaration.",
	"repealed": false
}