{
	"id": "84.922",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.922",
	"title": "84.922 REGISTRATION.",
	"text": "Unless exempted in subdivision 1a, a person may not operate and an owner may not give permission for another to operate an all-terrain vehicle within the state unless the vehicle has been registered with the commissioner of natural resources, or is exempt from registration.\nAll-terrain vehicles exempt from registration are:\n(1) vehicles owned and used by the United States, an Indian tribal government, the state, another state, or a political subdivision;\n(2) vehicles that are registered in another state or country and have not been in this state for more than 30 consecutive days or that are registered by an Indian tribal government to a tribal member and have not been outside the tribal reservation boundary for more than 30 consecutive days;\n(3) vehicles that:\n(i) are owned by a resident of another state or country that does not require registration of all-terrain vehicles;\n(ii) have not been in this state for more than 30 consecutive days; and\n(iii) are operated on state and grant-in-aid trails by a nonresident possessing a nonresident all-terrain vehicle state trail pass;\n(4) vehicles used exclusively in organized track-racing events; and\n(5) vehicles that are 25 years old or older and were originally produced as a separate identifiable make by a manufacturer.\n(a) Application for registration or continued registration shall be made to the commissioner or an authorized deputy registrar of motor vehicles in a form prescribed by the commissioner. The form must state the name and address of every owner of the vehicle.\n(b) A person who purchases an all-terrain vehicle from a retail dealer shall make application for registration to the dealer at the point of sale. The dealer shall issue a dealer temporary 21-day registration permit to each purchaser who applies to the dealer for registration. The dealer shall submit the completed registration application and fees to the deputy registrar at least once each week. No fee may be charged by a dealer to a purchaser for providing the temporary permit.\n(c) Upon receipt of the application and the appropriate fee, the commissioner or deputy registrar shall issue to the applicant, or provide to the dealer, an assigned registration number or a commissioner or deputy registrar temporary 21-day permit. Once issued, the registration number must be affixed to the vehicle in a manner prescribed by the commissioner. A dealer subject to paragraph (b) shall provide the registration materials or temporary permit to the purchaser within the 21-day temporary permit period. The commissioner shall use the snowmobile registration system to register vehicles under this section.\n(d) Each deputy registrar of motor vehicles acting under section 168.33, is also a deputy registrar of all-terrain vehicles. The commissioner of natural resources in agreement with the commissioner of public safety may prescribe the accounting and procedural requirements necessary to assure efficient handling of registrations and registration fees. Deputy registrars shall strictly comply with the accounting and procedural requirements.\n(e) In addition to other fees prescribed by law, a filing fee of $4.50 is charged for each all-terrain vehicle registration renewal, duplicate or replacement registration card, and replacement decal and a filing fee of $7 is charged for each all-terrain vehicle registration and registration transfer issued by:\n(1) a deputy registrar and shall be deposited in the treasury of the jurisdiction where the deputy is appointed, or retained if the deputy is not a public official; or\n(2) the commissioner and shall be deposited to the state treasury and credited to the all-terrain vehicle account in the natural resources fund.\nAll-terrain vehicles may be registered for private use that are used exclusively for private or agricultural use or used exclusively on private property. Private use registration is valid from the date of issuance until ownership of the all-terrain vehicle is transferred. Private or agricultural use registrations are not transferable.\nAll-terrain vehicles may be issued an exempt registration if requested and the machine is at least 25 years old. Exempt registration is valid from the date of issuance until ownership of the all-terrain vehicle is transferred. Exempt registrations are not transferable.\nThe commissioner shall provide to the registrant a registration card that includes the registration number, the date of registration, the make and serial number of the vehicle, the owner's name and address, and additional information the commissioner may require. Information concerning each registration shall be retained by the commissioner. The registration is not valid unless signed by at least one owner. Upon a satisfactory showing that the registration card has been lost or destroyed the commissioner shall issue a replacement registration card upon payment of a fee of $4. The fees collected from replacement registration cards shall be deposited in the all-terrain vehicle account in the natural resources fund.\n(a) Application for transfer of ownership must be made to the commissioner within 15 days of the date of transfer.\n(b) An application for transfer must be executed by the current owner and the purchaser using a bill of sale that includes the vehicle serial number.\n(c) The purchaser is subject to the penalties imposed by section 84.774 if the purchaser fails to apply for transfer of ownership as provided under this subdivision.\n(a) The fee for a three-year registration of an all-terrain vehicle under this section, other than those registered by a dealer or manufacturer under paragraph (b) or (c), is:\n(1) for public use, $60;\n(2) for private use, $6; and\n(3) for a duplicate or transfer, $4.\n(b) The total registration fee for all-terrain vehicles owned by a dealer and operated for demonstration or testing purposes is $50 per year. Dealer registrations are not transferable.\n(c) The total registration fee for all-terrain vehicles owned by a manufacturer and operated for research, testing, experimentation, or demonstration purposes is $150 per year. Manufacturer registrations are not transferable.\n(d) The onetime fee for registration of an all-terrain vehicle under subdivision 2b is $6.\n(e) The fees collected under this subdivision must be credited to the all-terrain vehicle account.\nEvery owner of an all-terrain vehicle must renew registration in a manner prescribed by the commissioner upon payment of the registration fees in subdivision 5.\nA registration number must be issued without the payment of a fee for all-terrain vehicles owned by the state or a political subdivision upon application.\n[Repealed, 1989 c 331 s 26]\nNo political subdivision of this state shall require licensing or registration of all-terrain vehicles covered by sections 84.92 to 84.928.\nNo person under the age of 18 may register an all-terrain vehicle.\n(a) A person applying for initial registration in Minnesota of an all-terrain vehicle must provide a receipt, invoice, or other document to prove that:\n(1) the sales and use tax under chapter 297A was paid;\n(2) the purchase was exempt from tax under chapter 297A; or\n(3) the all-terrain vehicle was purchased from a retailer that is maintaining a place of business in this state as defined in section 297A.66, subdivision 1, and is a dealer.\n(b) The commissioner or authorized deputy registrars, acting as agents of the commissioner of revenue under an agreement between the commissioner and the commissioner of revenue, as provided in section 297A.825:\n(1) must collect use tax from the applicant if the applicant does not provide the proof required under paragraph (a); and\n(2) are authorized to issue refunds of use tax paid to them in error.\n(c) Subdivision 12 does not apply to refunds under this subdivision.\nThe commissioner may issue a refund on a registration, not including any issuing fees paid under subdivision 2, paragraph (e), or section 84.027, subdivision 15, paragraph (a), clause (2), if the refund request is received within 60 days of the original registration, the registration is not used or transferred, and:\n(1) the vehicle was registered incorrectly; or\n(2) the vehicle was registered twice, once by the dealer and once by the customer.\n[See Note.]\nThe commissioner shall designate, by written order published in the State Register, one weekend each year when, notwithstanding subdivision 1, an all-terrain vehicle may be operated on state and grant-in-aid all-terrain vehicle trails without a registration issued under this section. Nonresidents may participate during the designated weekend without a state trail pass required under section 84.9275.",
	"repealed": false
}