{
	"id": "137.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/137.025",
	"title": "137.025 APPROPRIATIONS; PAYMENT; INVESTMENT.",
	"text": "The commissioner of management and budget shall pay 1/12 of the annual appropriation to the University of Minnesota by the 25th day of each month. If the 25th day of the month falls on a Saturday or Sunday, the monthly payment must be made by the first business day immediately following the 25th day of the month.\nThe commissioner of management and budget shall pay no money to the University of Minnesota pursuant to a direct appropriation for buildings until all balances separately invested, including cash, and those in the temporary investment pool attributable to all state building funds shall be reduced below $5,000,000, or any other amount specified in the act making the appropriation. Payment shall then be made upon certification of the amounts needed for construction payments, but so as not to increase the building balances in cash, separately invested, or in the temporary investment pool, to a total above the indicated level.\n(a) The commissioner of management and budget shall pay no money to the University of Minnesota pursuant to a direct appropriation from the Minnesota environment and natural resources trust fund until the University of Minnesota requests reimbursement for expenditures related to the direct appropriation. The reimbursement request shall specify expenditures by appropriation. The commissioner of management and budget shall reimburse the University of Minnesota by the 25th day of the month following the reimbursement request. If the 25th day of the month falls on a Saturday, Sunday, or holiday, the payment must be made by the first business day immediately following the 25th day of the month.\n(b) For each year the appropriation is available, the University of Minnesota must submit an encumbrance request to the commissioner of management and budget by July 31 for the prior fiscal year. The encumbrance request shall identify the amount the university anticipates it will request for reimbursement for expenses in the prior fiscal year by appropriation. The commissioner of management and budget shall maintain this amount as an encumbrance at the state level until the university submits its final reimbursement request for that fiscal year.\n(c) Final requests for reimbursement must be made within 90 days from the last day the appropriation is available to reimburse expenditures.\nMoney not paid to the university by reason of the foregoing requirements shall be invested by the state in those securities authorized by section 11A.25 until paid to the university. Income from investments shall be credited to the general fund in the state treasury.",
	"repealed": false
}