{
	"id": "477B.042",
	"url": "https://www.revisor.mn.gov/statutes/cite/477B.042",
	"title": "477B.042 ALLOCATION OF FIRE STATE AID FOR RELIEF ASSOCIATIONS.",
	"text": "(a) This section applies to fire state aid payable each year under section 477B.04, subdivision 3, paragraph (b), if, during the prior year, the municipality or independent nonprofit firefighting corporation:\n(1) employs one or more volunteer firefighters covered by the relief association affiliated with the municipality or independent nonprofit firefighting corporation under chapter 424A; and\n(2) contributes on behalf of one or more firefighters to the public employees police and fire retirement plan under chapter 353.\n(b) This section does not apply to police and firefighter supplemental state aid under section 423A.022.\n(a) The municipality or independent nonprofit firefighting corporation and the affiliated relief association may agree to allocate fire state aid between the relief association and the public employees police and fire retirement plan by entering into an aid allocation agreement described in subdivision 3.\n(b) If an aid allocation agreement has been filed with the state auditor and is in effect, then within 30 days of receipt of the fire state aid the treasurer of the municipality must transmit to the relief association the amount of the fire state aid as determined in the aid allocation agreement. If a municipality receives fire state aid on behalf of an independent nonprofit firefighting corporation, the municipality must also transmit any remaining fire state aid to the independent nonprofit firefighting corporation.\n(c) The fire state aid allocated to the municipality or independent nonprofit firefighting corporation may only be disbursed for the payment of employer contributions for firefighters covered by the public employees police and fire retirement plan or for contributions to the relief association and must be disbursed within 18 months of receipt by the municipality or independent nonprofit firefighting corporation.\n(a) An aid allocation agreement is a written agreement that meets the following requirements:\n(1) the agreement specifies:\n(i) the percentage of the fire state aid, a dollar amount, or a formula for determining the amount of fire state aid that will be transmitted to the relief association annually; and\n(ii) the period of time covered by the agreement and the date on which the agreement expires; and\n(2) the agreement has been signed by:\n(i) an individual authorized to sign on behalf of the municipality or independent nonprofit firefighting corporation; and\n(ii) the president of the relief association or its representative duly appointed for the purposes of this section.\n(b) An aid allocation agreement is not effective unless filed with the state auditor under subdivision 5.\n(a) The parties to the agreement may modify or terminate the aid allocation agreement, provided that the modification or termination is in writing and signed by the parties.\n(b) If the amount of fire state aid paid to a municipality or independent nonprofit firefighting corporation by the commissioner changes by an amount greater than 50 percent of the prior year's amount, then the aid allocation agreement may be terminated by either party to the agreement by providing written notice of termination to the other party.\n(c) Unless the aid allocation agreement provides otherwise, termination is effective for the fire state aids payable in the calendar year after notice of termination has been given.\n(a) By March 1 of each year in which fire state aid is to be allocated, the municipality or independent nonprofit firefighting corporation must file a copy of the aid allocation agreement or modified agreement with the state auditor.\n(b) If an aid allocation agreement terminates by its own terms or for any other reason, the municipality or independent nonprofit firefighting corporation must notify the Office of the State Auditor in writing within 30 days after the termination date.\n(c) If the municipality or independent nonprofit firefighting corporation fails to file by the deadline in paragraph (a), fire state aid payments must not be allocated, but must be transmitted to the relief association until the agreement has been filed. If the state auditor determines that an aid allocation agreement does not meet the requirements of subdivision 3, any future fire state aid payments must be transmitted to the relief association by the municipality until the municipality files with the state auditor an aid allocation agreement that satisfies the requirements under subdivision 3.",
	"repealed": false
}