{
	"id": "18B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/18B.03",
	"title": "18B.03 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "The commissioner shall administer, implement, and enforce this chapter and the Department of Agriculture is the lead state agency for the regulation of pesticides. The commissioner has the sole regulatory authority over the terrestrial application of pesticides, including, but not limited to, the application of pesticides to agricultural crops, structures, and other nonaquatic environments. Except as provided in subdivision 3, a state agency other than the Department of Agriculture shall not regulate or require permits for the terrestrial or nonaquatic application of pesticides.\nThe functions vested in the commissioner by this chapter may be delegated to designated employees or agents of the Department of Agriculture.\nThe commissioner may, by written agreements, delegate specific inspection, enforcement, and other regulatory duties of this chapter to officials of approved agencies. The commissioner may enter into data sharing agreements with other state agencies to help assess the potential for unreasonable adverse effects to human health and the environment from the use of a pesticide.\nThe commissioner may take enforcement action under chapter 18D for a violation of this chapter, or any rule adopted under this chapter, that results in harm to pollinators, including but not limited to applying a pesticide in a manner inconsistent with the pesticide product's label or labeling and resulting in pollinator death or willfully applying pesticide in a manner inconsistent with the pesticide product's label or labeling. The commissioner must deposit any penalty collected under this subdivision in the pesticide regulatory account in section 18B.05.\nThe commissioner has the sole regulatory authority over the terrestrial application of pesticides containing PFAS, including but not limited to the application of pesticides to agricultural crops, structures, and other nonaquatic environments. In order to reduce duplication, a registrant is not required to provide technical data to another state agency if the registrant previously submitted the data to the commissioner and the data is available to the other state agencies.",
	"repealed": false
}