{
	"id": "97A.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.101",
	"title": "97A.101 PUBLIC WATER RESERVES AND MANAGEMENT DESIGNATION.",
	"text": "The commissioner may designate and reserve public waters of the state to propagate and protect wild animals.\n(a) The commissioner may designate, reserve, and manage public waters for wildlife after giving notice and holding a public hearing. The hearing must be held in the county where the major portion of the waters is located. Notice of the hearing must be published in a legal newspaper within each county where the waters are located at least seven days before the hearing. The designation by the commissioner shall be by written order published in the State Register. Designations are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.\n(b) The commissioner may contract with riparian owners for water projects under section 103G.121, subdivision 3, and may acquire land, accept local funding, and construct, maintain, and operate structures to control water levels under section 103G.505 to manage designated waters.\nSeasons or methods of taking fish other than minnows may not be restricted under this section.\n(a) The use of airboats is prohibited at all times on lakes designated for wildlife management purposes under this section unless otherwise authorized by the commissioner.\n(b) The commissioner may restrict the use of motorized watercraft and recreational vehicles on lakes designated for wildlife management purposes by posting all public access points on the designated lake. To minimize disturbance to wildlife or to protect wildlife habitat, the commissioner may restrict the type of allowable motorized watercraft or recreational vehicle, horsepower or thrust of motor, speed of operation, and season or area of use. Designation of areas, times, and types of restrictions to be posted shall be by written order published in the State Register. Posting of the restrictions is not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply.\n(c) Before the commissioner establishes perpetual restrictions under paragraph (b), public comment must be received and a public meeting must be held in the county where the largest portion of the lake is located. Notice of the meeting must be published in a news release issued by the commissioner and in a newspaper of general circulation in the area where the waters are located. The notice must be published at least once between 30 and 60 days before the public meeting and at least once between seven and 30 days before the meeting. The notices required in this paragraph must summarize the proposed action, invite public comment, and specify a deadline for the receipt of public comments. The commissioner shall mail a copy of each required notice to persons who have registered their names with the commissioner for this purpose. The commissioner shall consider any public comments received in making a final decision. This paragraph does not apply to temporary restrictions that expire within 90 days of the effective date of the restrictions.",
	"repealed": false
}