{
	"id": "354.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/354.53",
	"title": "354.53 CREDIT FOR BREAK IN SERVICE TO PROVIDE UNIFORMED SERVICE.",
	"text": "(a) Any teacher who is absent from employment by reason of service in the uniformed services, as defined in United States Code, title 38, section 4303(13), and who returns to the employer providing teaching service upon discharge from service in the uniformed service within the time frames required in United States Code, title 38, section 4312(e), may obtain service credit for the period of the uniformed service as further specified in this section, provided that the teacher did not separate from uniformed service with a dishonorable or bad conduct discharge or under other than honorable conditions.\n(b) The member may obtain credit by paying into the fund an equivalent employee contribution based upon the contribution rate or rates in effect at the time that the uniformed service was performed multiplied by the full and fractional years being purchased and applied to the annual salary rate. The annual salary rate is the average annual salary during the purchase period that the teacher would have received if the teacher had continued to provide teaching service to the employer rather than provide uniformed service or if the determination of that rate is not reasonably certain, the annual salary rate is the teacher's average salary rate during the 12-month period immediately preceding the period, or, if the preceding period is less than 12 months, the annualized rate derived from the teacher's average salary rate during the period of teacher employment rendered immediately preceding the period of the uniformed service.\n(c) The equivalent employer contribution and, if applicable, the equivalent additional contribution provided in section 354.42 must be paid by the employing unit as provided in section 354.52, subdivision 4, using the employer and employer additional contribution rate or rates in effect at the time that the uniformed service was performed, applied to the same annual salary rate or rates used to compute the equivalent employee contribution.\n(a) For purposes of computing a money purchase annuity under section 354.44, subdivision 2, all payments into the fund under this section must be considered accumulations after July 1, 1957.\n(b) For purposes of computing a formula annuity under section 354.44, subdivision 6, if the employee equivalent contributions provided in this section are not paid in full, the member's formula service credit must be prorated by multiplying the full and fractional number of years of uniformed service eligible for purchase by the ratio obtained by dividing the total employee contribution received by the total employee contribution otherwise required under this section.\n(a) To receive service credit under this section, the contributions specified in this section must be transmitted to the Teachers Retirement Association during the period which begins with the date on which the individual returns to teaching service and which has a duration of three times the length of the uniformed service period, but not to exceed five years.\n(b) Notwithstanding paragraph (a), if the payment period determined under paragraph (a) is less than three years, the contributions required under this section to receive service credit may be made within three years from the discharge date.\nThe amount of service credit obtainable under this section may not exceed five years, unless a longer purchase period is required under United States Code, title 38, section 4312.\nThe employer shall pay interest on all equivalent employee and employer contribution amounts payable under this section at the applicable annual rate or rates specified in section 356.59, subdivision 4, compounded annually, from the end of each fiscal year of the leave or the break in service to the end of the month in which the payment is received.",
	"repealed": false
}