{
	"id": "624.7143",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.7143",
	"title": "624.7143 CHEMICAL TESTING.",
	"text": "(a) A person who carries a pistol in a public place on or about the person's clothes or person is required, subject to the provisions of this section, to take or submit to a test of the person's blood, breath, or urine for the purpose of determining the presence and amount of alcohol or a controlled substance. The test shall be administered at the direction of an officer authorized to make arrests under section 624.7142.\n(b) Taking or submitting to a test of the person's breath is mandatory when requested by an officer who has probable cause to believe the person was carrying a pistol in violation of section 624.7142, and one of the following conditions exists:\n(1) the person has been lawfully placed under arrest for violating section 624.7142;\n(2) the person has been involved while carrying a firearm in a firearms-related accident resulting in property damage, personal injury, or death;\n(3) the person has refused to take the preliminary screening test provided for in section 624.7142; or\n(4) the screening test was administered and indicated an alcohol concentration of 0.04 or more.\n(c) Taking or submitting to a test of the person's blood or urine is mandatory when requested by a peace officer under the conditions described in paragraph (b) if the officer is acting pursuant to a search warrant under sections 626.04 to 626.18.\nNotwithstanding any contrary provision in this section, a blood or urine test may be conducted only pursuant to a search warrant under sections 626.04 to 626.18, or a judicially recognized exception to the search warrant requirement. When, under the provisions of this section, a search warrant is required for a blood or urine test, that requirement is met if a judicially recognized exception to the search warrant is applicable.\n(a) If a person refuses to take a test required under subdivision 1, none must be given but the officer shall report the refusal to the sheriff and to the authority having responsibility for prosecution of misdemeanor offenses for the jurisdiction in which the incident occurred that gave rise to the test demand and refusal. On certification by the officer that probable cause existed to believe the person had been carrying a pistol on or about the person's clothes or person in a public place while under the influence of alcohol or a controlled substance, that in the case of a blood or urine test the officer was acting pursuant to a search warrant, and that the person refused to submit to testing, a court may impose a civil penalty of $500 and may revoke the person's authority to carry a pistol in a public place on or about the person's clothes or person under the provisions of a permit or otherwise for a period of one year from the date of the refusal. The person shall be accorded notice and an opportunity to be heard prior to imposition of the civil penalty or the revocation.\n(b) Revocations under this subdivision must be reported in the same manner as in section 624.714, subdivision 12a.\nAt the time a test is requested, the person must be informed that:\n(1) Minnesota law requires a person to take a test to determine if the person is under the influence of alcohol or a controlled substance;\n(2) if the person refuses to take the test, the person is subject to a civil penalty of $500 and is prohibited for a period of one year from carrying a pistol in a public place on or about the person's clothes or person, as provided under subdivision 2; and\n(3) that, in the case of a breath test, the person has the right to consult with an attorney, but that this right is limited to the extent it cannot unreasonably delay administration of the test or the person will be deemed to have refused the test.\n(a) A peace officer who directs a test pursuant to this section may direct a breath test.\n(b) A peace officer, acting pursuant to a search warrant, may direct a blood or urine test as provided in the warrant. If the warrant authorizes either a blood or urine test, the officer may direct whether the test is of blood or urine. If the person to whom the test is directed objects to the test, the officer shall offer the person an alternative test of either blood or urine.\n(c) If there is probable cause to believe there is impairment by a controlled substance that is not subject to testing by a breath test, a blood or urine test may be required pursuant to a search warrant even after a breath test has been administered.\n(d) Action under this section may be taken against a person who refuses to take a blood test only if an alternative test was offered and action may be taken against a person who refuses to take a urine test only if an alternative test was offered.\nChemical tests administered under this section are governed by section 169A.51 in all aspects that are not inconsistent with this section.",
	"repealed": false
}