{
	"id": "342.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.70",
	"title": "342.70 CANNABIS INDUSTRY COMMUNITY RENEWAL GRANTS.",
	"text": "The Office of Cannabis Management shall establish CanRenew, a program to award grants to eligible organizations for investments in communities where long-term residents are eligible to be social equity applicants.\n(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Community investment\" means a project or program designed to improve community-wide outcomes or experiences and may include efforts targeting economic development, improving social determinants of health, violence prevention, youth development, or civil legal aid, among others.\n(c) \"Eligible community\" means a community where long-term residents are eligible to be social equity applicants.\n(d) \"Eligible organization\" means any organization able to make an investment in a community where long-term residents are eligible to be social equity applicants and may include educational institutions, nonprofit organizations, private businesses, community groups, units of local government, or partnerships between different types of organizations.\n(e) \"Program\" means the CanRenew grant program.\n(f) \"Social equity applicant\" means a person who meets the qualification requirements in section 342.17.\n(a) The Division of Social Equity must award grants to eligible organizations through a competitive grant process.\n(b) To receive grant money, an eligible organization must submit a written application to the office, using a form developed by the office, explaining the community investment the organization wants to make in an eligible community.\n(c) An eligible organization's grant application must also include:\n(1) an analysis of the community's need for the proposed investment;\n(2) a description of the positive impact that the proposed investment is expected to generate for that community;\n(3) any evidence of the organization's ability to successfully achieve that positive impact;\n(4) any evidence of the organization's past success in making similar community investments;\n(5) an estimate of the cost of the proposed investment;\n(6) the sources and amounts of any nonstate funds or in-kind contributions that will supplement grant money;\n(7) a description of the organization's engagement with youth-centered, community-based organizations working with youth who are 14 to 24 years of age that have been most impacted by cannabis-related usage, criminalization, or incarceration; and\n(8) any additional information requested by the office.\n(d) In awarding grants under this subdivision, the office shall give priority to the following:\n(1) applications from organizations that demonstrate a history of successful community investments, particularly in geographic areas that are now eligible communities;\n(2) applications that support youth civic engagement, leadership, and youth-led health education opportunities; and\n(3) applications where there is demonstrated community support for the proposed investment.\n(e) The office shall fund investments in eligible communities throughout the state.\nThe office shall make extensive efforts to publicize these grants, including through partnerships with community organizations, particularly those located in eligible communities.\nBy January 15, 2024, and each January 15 thereafter, the office must submit a report to the chairs and ranking minority members of the committees of the house of representatives and the senate having jurisdiction over community development that details awards given through the CanRenew program and the use of grant money, including any measures of successful community impact from the grants.",
	"repealed": false
}