{
	"id": "48.153",
	"url": "https://www.revisor.mn.gov/statutes/cite/48.153",
	"title": "48.153 INSTALLMENT LOANS; FINANCE CHARGES; MINIMUM CHARGES.",
	"text": "[Repealed, 1982 c 494 s 5]\nA bank organized under the laws of this state, or a national banking association doing business in this state, making a loan of money not exceeding $35,000 repayable in installments, may charge, at the time the loan is made, a rate of interest upon the unpaid principal balance of the amount financed of 12 percent a year, or the rate of interest authorized by section 48.195, whichever is greater. If the rate of interest charged is permitted by section 48.195 at the time the loan is made, the rate does not later become usurious because of a fluctuation in the federal discount rate.\nInstallment payments on loans made pursuant to this section by a bank or national banking association shall not extend beyond a period of 12 years and 32 days from the date of the loan. The loan may be secured by a mortgage, pledge, or other collateral.\n[Repealed, 1982 c 494 s 5]\nA savings bank organized under chapter 50, a savings association subject to the provisions of sections 51A.01 to 51A.57, or a savings association chartered under the laws of the United States, that has its principal place of business in this state, may make a loan for consumer purposes to a natural person in an amount not exceeding $25,000 repayable in installments, and may charge a rate of interest upon the unpaid principal balance of the amount financed of 12 percent a year, or the rate of interest authorized by section 48.195, whichever is greater. If the rate of interest charged is permitted by section 48.195 at the time the loan is made, the rate does not later become usurious because of a fluctuation in the federal discount rate.\nInstallment payments on loans made pursuant to this section by a savings bank, a savings association subject to the provisions of sections 51A.01 to 51A.57, or a savings association chartered under the laws of the United States shall not extend beyond a period of 12 years and 32 days from the date of the loan. The loan may be secured by a mortgage, pledge, or other collateral.\nCharges in reference to installment loans under this section shall be computed and collected only on the unpaid principal balance of the amount financed actually outstanding. One day's finance charge means an amount equal to 1/365 of the per annum rate provided for in an installment loan. If the total finance charge determined on an installment loan, single payment or demand loan shall be less than $10 the amount charged may nevertheless be $10. No loan shall be made pursuant to this section if over 50 percent of the proceeds of the loan are used to finance the purchase of a borrower's primary residence other than a manufactured home.",
	"repealed": false
}