{
	"id": "97C.815",
	"url": "https://www.revisor.mn.gov/statutes/cite/97C.815",
	"title": "97C.815 COMMERCIAL FISHING AREAS.",
	"text": "The commissioner shall specify inland commercial fishing areas, taking into account the amount, size, and proximity of waters specified, the species to be removed, and the type and quantity of fishing gear and equipment necessary to provide an adequate removal effort. The commissioner may change inland commercial fishing area boundaries by rule prior to a new licensing period.\n(a) The commissioner shall assign licensed inland commercial fishing operators to commercial fishing areas and each operator is obligated to fish in the area that the commissioner has assigned to them. The commissioner's assignment is valid as long as the assigned operator continues to purchase a license, continues to provide an adequate removal effort in a good and professional manner, and is not convicted of two or more violations of laws or rules governing inland commercial fishing operations during any one license period. In the operator assignment, the commissioner shall consider the proximity of the operator to the area, the type and quantity of fish gear and equipment possessed, knowledge of the affected waters, and general ability to perform the work well.\n(b) Area assignments must not restrict permits and contracts that the commissioner issues to governmental subdivisions and their subcontractors for invasive species control.\nIf an area is not assigned, or the operator licensed for the area is not fishing that area, the commissioner may issue a special inland commercial fishing permit for the area. The permit may be issued to an individual holding a valid inland commercial fishing license. The permit must describe the specific waters involved, the county, the species to be removed, the equipment to be used, and the time period of the total operation.\nThe commissioner shall consult with representatives of the Inland Commercial Fishing Trade Association when disagreements arise in the areas of license issuance, problems with performance pursuant to the license, transfers of licenses, area assignments, and the entry of new commercial fishing operators into the inland commercial fishery.",
	"repealed": false
}