{
	"id": "15B.155",
	"url": "https://www.revisor.mn.gov/statutes/cite/15B.155",
	"title": "15B.155 CAPITOL RESTORATION PROJECT.",
	"text": "The commissioner shall consult and collaborate with representatives designated by the governor, the majority leader of the senate, the speaker of the house, the chief justice of the Minnesota Supreme Court, the attorney general, Capitol Area and Architectural Planning Board, and the director of the Minnesota Historical Society regarding the design and construction process for the restoration of the Capitol building.\nNo changes shall be made to the current amount and location of space in the Capitol building for the house of representatives, senate, supreme court, and constitutional officers, unless approved as follows:\n(1) for space currently allocated to the house of representatives, by the chief clerk of the house of representatives;\n(2) for space currently allocated to the senate, by the secretary of the senate;\n(3) for space currently allocated to the judicial branch, by the court administrator; and\n(4) for space currently allocated to the attorney general's office, by the attorney general.\nConstruction work shall be sequenced to maintain occupancy in the house of representatives and senate chambers during regular legislative sessions, unless otherwise approved by the speaker of the house and the majority leader of the senate for respective chambers.\n(a) By January 15, 2013, the commissioner of administration shall submit a space recommendation report to the majority leader of the senate, the speaker of the house, and the chairs of the legislative committees with primary jurisdiction over the Capitol Area Architectural and Planning Board. The space recommendation report shall identify appropriate and required functions of the Capitol building and make recommendations to address space requirements for the tenants currently located in the Capitol building for the effective and efficient function of state government. In preparing the report, the commissioner shall consult with the Capitol Preservation Commission and representatives designated by the governor, the secretary of the senate, the chief clerk of the house of representatives, the director of the Minnesota Historical Society, and the state court administrator. Before the appropriations in Laws 2012, chapter 293, section 13, subdivision 3, paragraph (a), clauses (4) and (5), may be spent, the recommendations in the report must be approved by the governor, the secretary of the senate, and the chief clerk of the house of representatives.\n(b) By July 15, 2013, the commissioner shall submit a report describing final plans and specifications for the restoration of the Capitol building to the majority leader of the senate, the speaker of the house, and to the chairs of the committees in the senate and house of representatives with primary jurisdiction over the Capitol Area Architectural and Planning Board. Before the appropriations in Laws 2012, chapter 293, section 13, subdivision 3, paragraph (a), clauses (4) and (5), may be spent, the plans and specifications must be approved by the governor, the secretary of the senate, and the chief clerk of the house of representatives.\n(c) Notwithstanding sections 16C.05, subdivision 2, paragraph (b); and 16C.08, subdivision 3, clause (5), the commissioner of administration may enter into consultant and construction contracts on the Capitol restoration and repair project with a term of up to ten years.\n(d) Notwithstanding section 16B.31, subdivision 2, the commissioner of administration may proceed with the Capitol restoration and repair project before obtaining an appropriation to complete the entire project.\n(e) On or before December 1 of each year until final completion of the restoration project, the commissioner of administration shall submit in writing to the governor, chairs of the senate Finance and Capital Investment Committees, and chairs of the house of representatives Ways and Means and Capital Investment Committees the estimated annual amount needed for the restoration project for the upcoming fiscal year. The construction manager and the commissioner shall enter into a guaranteed maximum price contract. In the absence of an appropriation sufficient for the continued performance of work on an annual basis as determined by the commissioner of administration, the construction manager shall not be bound to complete the remaining work within the guaranteed maximum price in the contract.\n(f) With the approval of the commissioner of administration, the construction manager may bid trade work in accordance with section 16C.34, subdivision 3, before the enactment of an appropriation sufficient to fully fund the trade work for completion of the full project described in the Comprehensive Master Plan. The construction manager shall enter into guaranteed maximum price contracts with subcontractors for the trade work. In the event the legislature fails to appropriate money sufficient for the continued performance of work on an annual basis as determined by the commissioner of administration, the subcontractors shall not be bound to complete the remaining work within the guaranteed maximum price in the contract. Contracts with subcontractors for trade work under this paragraph must include terms consistent with this paragraph.",
	"repealed": false
}