{
	"id": "299C.105",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.105",
	"title": "299C.105 DNA DATA REQUIRED.",
	"text": "(a) Sheriffs, peace officers, and community corrections agencies operating secure juvenile detention facilities shall take or cause to be taken biological specimens for the purpose of DNA analysis as defined in section 299C.155, of the following:\n(1) persons having been convicted of or attempting to commit any of the following:\n(i) murder under section 609.185, 609.19, or 609.195;\n(ii) manslaughter under section 609.20 or 609.205;\n(iii) assault under section 609.221, 609.222, or 609.223;\n(iv) robbery under section 609.24, aggravated robbery under section 609.245, or carjacking under section 609.247;\n(v) kidnapping under section 609.25;\n(vi) false imprisonment under section 609.255;\n(vii) criminal sexual conduct under section 609.342, 609.343, 609.344, 609.345, 609.3451, subdivision 3, or 609.3453;\n(viii) incest under section 609.365;\n(ix) burglary under section 609.582, subdivision 1; or\n(x) indecent exposure under section 617.23, subdivision 3;\n(2) persons sentenced as patterned sex offenders under section 609.3455, subdivision 3a; or\n(3) juveniles having been adjudicated delinquent for committing or attempting to commit any of the following:\n(i) murder under section 609.185, 609.19, or 609.195;\n(ii) manslaughter under section 609.20 or 609.205;\n(iii) assault under section 609.221, 609.222, or 609.223;\n(iv) robbery under section 609.24, aggravated robbery under section 609.245, or carjacking under section 609.247;\n(v) kidnapping under section 609.25;\n(vi) false imprisonment under section 609.255;\n(vii) criminal sexual conduct under section 609.342, 609.343, 609.344, 609.345, 609.3451, subdivision 3, or 609.3453;\n(viii) incest under section 609.365;\n(ix) burglary under section 609.582, subdivision 1; or\n(x) indecent exposure under section 617.23, subdivision 3.\n(b) Unless the superintendent of the bureau requires a shorter period, within 72 hours the biological specimen required under paragraph (a) must be forwarded to the bureau in such a manner as may be prescribed by the superintendent.\n(c) Prosecutors, courts, and probation officers shall attempt to ensure that the biological specimen is taken on a person described in paragraph (a).\n(a) The persons who collect the biological specimens required under subdivision 1 must be trained to bureau-established standards in the proper method of collecting and transmitting biological specimens.\n(b) A law enforcement officer who seeks to collect a biological specimen from a juvenile pursuant to subdivision 1 must notify the juvenile's parent or guardian prior to collecting the biological specimen.\n(a) The bureau shall destroy the biological specimen and return all records to a person who submitted a biological specimen under subdivision 1 but who was found not guilty of a felony. Upon the request of a person who submitted a biological specimen under subdivision 1 but where the charge against the person was later dismissed, the bureau shall destroy the person's biological specimen and return all records to the individual.\n(b) If the bureau destroys a biological specimen under paragraph (a), the bureau shall also remove the person's information from the bureau's combined DNA index system and return all related records and all copies or duplicates of them.",
	"repealed": false
}