{
	"id": "624.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/624.20",
	"title": "624.20 FIREWORKS.",
	"text": "(a) As used in sections 624.20 to 624.25, the term \"fireworks\" means any substance or combination of substances or article prepared for the purpose of producing a visible or an audible effect by combustion, explosion, deflagration, or detonation, and includes blank cartridges, toy cannons, and toy canes in which explosives are used, the type of balloons which require fire underneath to propel them, firecrackers, torpedoes, skyrockets, Roman candles, daygo bombs, sparklers other than those specified in paragraph (c), or other fireworks of like construction, and any fireworks containing any explosive or inflammable compound, or any tablets or other device containing any explosive substance and commonly used as fireworks.\n(b) The term \"fireworks\" shall not include toy pistols, toy guns, in which paper caps containing 25/100 grains or less of explosive compound are used and toy pistol caps which contain less than 20/100 grains of explosive mixture.\n(c) The term also does not include wire or wood sparklers of not more than 100 grams of mixture per item, other sparkling items which are nonexplosive and nonaerial and contain 75 grams or less of chemical mixture per tube or a total of 500 grams or less for multiple tubes, snakes and glow worms, smoke devices, or trick noisemakers which include paper streamers, party poppers, string poppers, snappers, and drop pops, each consisting of not more than twenty-five hundredths grains of explosive mixture. The use of items listed in this paragraph is not permitted on public property. This paragraph does not authorize the purchase of items listed in it by persons younger than 18 years of age. The age of a purchaser of items listed in this paragraph must be verified by photographic identification.\n(d) A local unit of government may impose an annual license fee for the retail sale of items authorized under paragraph (c). The annual license fee of each retail seller that is in the business of selling only the items authorized under paragraph (c) may not exceed $350, and the annual license of each other retail seller may not exceed $100. A local unit of government may not:\n(1) impose any fee or charge, other than the fee authorized by this paragraph, on the retail sale of items authorized under paragraph (c);\n(2) prohibit or restrict the display of items for permanent or temporary retail sale authorized under paragraph (c) that comply with National Fire Protection Association Standard 1124 (2003 edition); or\n(3) impose on a retail seller any financial guarantee requirements, including bonding or insurance provisions, containing restrictions or conditions not imposed on the same basis on all other business licensees.\nAs used in sections 624.20 to 624.25, the term \"explosive fireworks\" means any fireworks that contain pyrotechnic or flash powder, gunpowder, black powder, or any other explosive compound constructed to produce detonation or deflagration.",
	"repealed": false
}