{
	"id": "325E.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.37",
	"title": "325E.37 TERMINATION OF SALES REPRESENTATIVES.",
	"text": "(a) As used in this section, the following terms have the meanings given them.\n(b) \"Good cause\" means a material breach of one or more provisions of a written sales representative agreement governing the relationship with the manufacturer, wholesaler, assembler, or importer, or in absence of a written agreement, failure by the sales representative to substantially comply with the material and reasonable requirements imposed by the manufacturer, wholesaler, assembler, or importer. Good cause includes, but is not limited to:\n(1) the bankruptcy or insolvency of the sales representative;\n(2) assignment for the benefit of creditors or similar disposition of the assets of the sales representative's business;\n(3) the voluntary abandonment of the business by the sales representative as determined by a totality of the circumstances;\n(4) conviction or a plea of guilty or no contest to a charge of violating any law relating to the sales representative's business;\n(5) any act of the sales representative which materially impairs the good will associated with the manufacturer's, wholesaler's, assembler's, or importer's trademark, trade name, service mark, logotype, or other commercial symbol; or\n(6) failure to forward customer payments to the manufacturer, wholesaler, assembler, or importer.\n(c) \"Person\" means a natural person, but also includes a partnership, corporation, and all other entities.\n(d) \"Sales representative\" means a person who contracts with a principal to solicit wholesale orders and who is compensated, in whole or in part, by commission.\nSales representative does not include a person who:\n(1) is an employee of the principal;\n(2) places orders or purchases for the person's own account for resale;\n(3) holds the goods on a consignment basis for the principal's account for resale; or\n(4) distributes, sells, or offers the goods, other than samples, to end users, at retail.\n(e) \"Sales representative agreement\" means a contract or agreement, either express or implied, whether oral or written, for a definite or indefinite period, between a sales representative and another person or persons, whereby a sales representative is granted the right to represent, sell, or offer for sale a manufacturer's, wholesaler's, assembler's, or importer's goods by use of the latter's trade name, trademark, service mark, logotype, advertising, or other commercial symbol or related characteristics, and in which there exists a community of interest between the parties in the marketing of the goods at wholesale, by lease, agreement, or otherwise.\n(f) \"Wholesale orders\" means the solicitation of orders for goods by persons in the distribution chain for ultimate sale at retail, and also includes material, component, or part orders for use or incorporation into a product, and later resold.\n(a) A manufacturer, wholesaler, assembler, or importer may not terminate a sales representative agreement unless the person has good cause and:\n(1) that person has given written notice setting forth the reason(s) for the termination at least 90 days in advance of termination; and\n(2) the recipient of the notice fails to correct the reasons stated for termination in the notice within 60 days of receipt of the notice.\n(b) A notice of termination is effective immediately upon receipt where the alleged grounds for termination are the reasons set forth in subdivision 1, paragraph (b), clauses (1) to (6), hereof.\nUnless the failure to renew a sales representative agreement is for good cause, and the sales representative has failed to correct reasons for termination as required by subdivision 2, no person may fail to renew a sales representative agreement unless the sales representative has been given written notice of the intention not to renew at least 90 days in advance of the expiration of the agreement. For purposes of this subdivision, a sales representative agreement of indefinite duration shall be treated as if it were for a definite duration expiring 180 days after the giving of written notice of intention not to continue the agreement.\nIf a sales representative is paid by commission under a sales representative agreement and the agreement is terminated, the representative is entitled to be paid for all sales as to which the representative would have been entitled to commissions pursuant to the provisions of the sales representative agreement, made prior to the date of termination of the agreement or the end of the notification period, whichever is later, regardless of whether the goods have been actually shipped. Payment of commissions due the sales representative shall be paid in accordance with the terms of the sales representative agreement or, if not specified in the agreement, payments of commissions due the sales representative shall be paid in accordance with section 181.145.\n(a) The sole remedy for a manufacturer, wholesaler, assembler, or importer who alleges a violation of any provision of this section is to submit the matter to arbitration. A sales representative may also submit a matter to arbitration, or in the alternative, at the sales representative's option prior to the arbitration hearing, the sales representative may bring the sales representative's claims in a court of law, and in that event the claims of all parties must be resolved in that forum. In the event the parties do not agree to an arbitrator within 30 days after the sales representative demands arbitration in writing, either party may request the appointment of an arbitrator from the American Arbitration Association. Each party to a sales representative agreement shall be bound by the arbitration. In the event that the American Arbitration Association declines to appoint an arbitrator, the arbitration shall proceed under chapter 572B. The cost of an arbitration hearing must be borne equally by both parties unless the arbitrator determines a more equitable distribution. Except as provided in paragraph (c), the arbitration proceeding is to be governed by the Uniform Arbitration Act, sections 572B.01 to 572B.31.\n(b) The arbitrator may provide any of the following remedies:\n(1) sustainment of the termination of the sales representative agreement;\n(2) reinstatement of the sales representative agreement, or damages;\n(3) payment of commissions due under subdivision 4;\n(4) reasonable attorneys' fees and costs to a prevailing sales representative;\n(5) reasonable attorneys' fees and costs to a prevailing manufacturer, wholesaler, assembler, or importer, if the arbitrator finds the complaint was frivolous, unreasonable, or without foundation; or\n(6) the full amount of the arbitrator's fees and expenses if the arbitrator finds that the sales representative's resort to arbitration or the manufacturer's, wholesaler's, assembler's, or importer's defense in arbitration was vexatious and lacking in good faith.\n(c) The decision of any arbitration hearing under this subdivision is final and binding on the sales representative and the manufacturer, wholesaler, assembler, or importer. The district court shall, upon application of a party, issue an order confirming the decision.\n(a) This section applies to a sales representative who, during some part of the period of the sales representative agreement:\n(1) is a resident of Minnesota or maintains that person's principal place of business in Minnesota; or\n(2) whose geographical territory specified in the sales representative agreement includes part or all of Minnesota.\n(b) To be effective, any demand for arbitration under subdivision 5 must be made in writing and delivered to the principal on or before one year after the effective date of the termination of the agreement.\n(c) A provision in any contract between a sales representative dealing in plumbing equipment or supplies and a principal purporting to waive any provision of Laws 2007, chapters 135 or 140, whether by express waiver or by a provision stipulating that the contract is subject to the laws of another state, shall be void.\n(a) No manufacturer, wholesaler, assembler, or importer shall circumvent compliance with this section by including in a sales representative agreement a term or provision, whether express or implied, that includes or purports to include:\n(1) an application or choice of law of any other state;\n(2) a choice of venue in any other state; or\n(3) a waiver of any provision of this section.\n(b) Any term or provision described in paragraph (a) is void and unenforceable.",
	"repealed": false
}