{
	"id": "354A.093",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.093",
	"title": "354A.093 BREAK IN SERVICE TO PROVIDE UNIFORMED SERVICE.",
	"text": "Any teacher in the coordinated program of the St. Paul Teachers Retirement Fund Association who is absent from employment by reason of service in the uniformed services as defined in United States Code, title 38, section 4303(13) and who returns to the employer providing active teaching service upon discharge from uniformed service within the time frames required under United States Code, title 38, section 4312(e), may receive allowable service credit in the association for all or a portion of the period of uniformed service, provided that the teacher did not separate from uniformed service with a dishonorable or bad conduct discharge or under other than honorable conditions.\nIf the teacher makes the equivalent employee contribution for a period of service provided to the uniformed services under this section, the employing unit shall make an equivalent employer contribution on behalf of the teacher to the applicable association for the period being purchased in the manner described in section 354A.12, subdivision 2a. The equivalent employee and employer contributions must be in an amount equal to the employee and employer contribution rates in effect for other active members of the association covered by the same program applied to a salary figure equal to the teacher's average annual salary rate that the teacher would have received if the leave or break in service had not occurred, or if the determination of that average salary rate is not reasonably certain, on the basis of the teacher's average salary rate during the 12-month period immediately preceding the period, or, if the preceding period is less than 12 months, the annualized rate derived from the teacher's average salary rate during the period of teacher employment rendered immediately preceding the period of uniformed service, with the result multiplied by the number of full and fractional years constituting the period of service provided to the uniformed service which the teacher is authorized to purchase under this section.\nIf the payments made by a teacher under this section are less than the full amount determined under subdivision 2, the service credit must be prorated. The prorated service credit must be determined by the ratio between the amount of the actual equivalent employee payment which was made and the full equivalent employee payment required under this section.\n(a) To receive service credit under this section, the contributions specified in this section must be transmitted to the St. Paul Teachers Retirement Fund Association during the period which begins with the date the individual returns to teaching service and which has a duration of three times the length of the uniformed service period, but not to exceed five years.\n(b) Notwithstanding paragraph (a), if the payment period determined under paragraph (a) is less than three years, the contributions required under this section to receive service credit may be made within three years from the discharge date.\nThe amount of service credit obtainable under this section may not exceed five years, unless a longer purchase period is required under United States Code, title 38, section 4312.\nThe employer shall pay interest on all equivalent employee and employer contribution amounts payable under this section. Interest must be computed at the applicable annual rate or rates specified in section 356.59, subdivision 5, compounded annually, from the end of each fiscal year of the leave or break in service to the end of the month in which payment is received.",
	"repealed": false
}