{
	"id": "82C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/82C.03",
	"title": "82C.03 LICENSING.",
	"text": "It is unlawful for a person, corporation, partnership, sole proprietorship, subsidiary, unit, or other business entity to directly or indirectly engage or attempt to engage in business as an appraisal management company, to directly or indirectly engage or attempt to perform appraisal management services, or to advertise or hold itself out as engaging in or conducting business as an appraisal management company without first obtaining a license issued by the commissioner under the provisions of this chapter.\n(a) An appraisal management company applying to the commissioner for a license in this state must not be owned by any person that is currently subject to any cease and desist order or injunctive order that would preclude involvement with an appraisal management company, or that has ever:\n(1) voluntarily surrendered in lieu of disciplinary action an appraiser certification, registration or license, or an appraisal management company license;\n(2) been the subject of a final order revoking or denying an appraiser certification, registration or license, or an appraisal management company license; or\n(3) a final order barring involvement in any industry or profession issued by this or another state or federal regulatory agency.\n(b) A person that owns more than ten percent of an appraisal management company in this state shall:\n(1) be of good moral character, as determined by the commissioner;\n(2) submit to a background investigation, as determined by the commissioner; and\n(3) certify to the commissioner that the person has never been the subject of an order of certificate, registration or license suspension, revocation, or denial; cease and desist order; injunctive order; or order barring involvement in an industry or profession issued by this or another state or federal regulatory agency.\n(a) Designation. Each appraisal management company applying to the commissioner for a license in this state shall designate a controlling person that will be the main contact for all communication between the commissioner and the appraisal management company.\n(b) Requirements. In order to serve as a designated controlling person of an appraisal management company, a person must:\n(1) certify to the commissioner that the person is not currently subject to any cease and desist order or injunctive order that would preclude involvement with an appraisal management company, and has never been the subject of an order suspending, revoking, or denying a certification, registration, or license for real estate services, or a final order barring involvement in any industry or profession issued by this or another state or federal regulatory agency;\n(2) be of good moral character, as determined by the commissioner; and\n(3) submit to a background investigation, as determined by the commissioner.\nApplication for an appraisal management company license must be submitted on a form prescribed by the commissioner.\nThe application must, at a minimum, include the following information:\n(1) the name of the entity seeking registration;\n(2) the business address or addresses of the entity seeking registration;\n(3) telephone contact and email information of the entity seeking registration;\n(4) if the entity is not a corporation that is domiciled in this state, the name and contact information for the company's agent for service of process in this state;\n(5) the name, address, and contact information for an individual or corporation, partnership, limited liability company, association, or other business entity that owns ten percent or more of the appraisal management company;\n(6) the name, address, and contact information for a controlling person or persons;\n(7) a certification that the entity has a system and process in place to verify that a person being added to the employment or appraiser panel of the appraisal management company for appraisal services within this state holds an active appraisal license in this state pursuant to chapter 82B if a license is required to perform appraisals;\n(8) a certification that the entity has a system in place to review the work of all employed and independent appraisers that are performing real estate appraisal services for the appraisal management company on a periodic basis to verify that the real estate appraisal assignments are being conducted in accordance with USPAP and chapter 82B;\n(9) a certification that the entity maintains a detailed record of each service request that it receives and the independent appraiser that performs the real estate appraisal services for the appraisal management company, pursuant to section 82C.13;\n(10) a certification that the employees of the appraisal management company will be appropriately trained and familiar with the appraisal process;\n(11) a certification that the appraisal management company has a system and process in place to verify that a person being added to the appraiser panel of the appraisal management company holds a license in good standing in this state pursuant to chapter 82B;\n(12) an irrevocable Uniform Consent to Service of Process, pursuant to section 82C.07; and\n(13) any information necessary for the commissioner to collect and transmit any required National Registry fees under section 82C.08, subdivision 2, paragraph (c).\nInitial licenses issued under this chapter are effective upon issuance and remain valid, subject to denial, suspension, or revocation under this chapter, until the following August 31.",
	"repealed": false
}