{
	"id": "103G.222",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.222",
	"title": "103G.222 REPLACEMENT OF WETLANDS.",
	"text": "(a) Wetlands must not be drained or filled, wholly or partially, unless replaced by actions that provide at least equal public value under a replacement plan approved as provided in section 103G.2242, a replacement plan under a local governmental unit's comprehensive wetland protection and management plan approved by the board under section 103G.2243, or, if a permit to mine is required under section 93.481, under a mining reclamation plan approved by the commissioner under the permit to mine. Project-specific wetland-replacement plans submitted as part of a project for which a permit to mine is required and approved by the commissioner on or after July 1, 1991, may include surplus wetland credits to be allocated by the commissioner to offset future mining-related wetland impacts under any permits to mine held by the permittee, the operator, the permittee's or operator's parent, an affiliated subsidiary, or an assignee pursuant to an assignment under section 93.481, subdivision 5. For project-specific wetland replacement completed prior to wetland impacts authorized or conducted under a permit to mine within the Great Lakes and Rainy River watershed basins, those basins are considered a single watershed for purposes of determining wetland-replacement ratios. Mining reclamation plans must apply the same principles and standards for replacing wetlands that are applicable to mitigation plans approved as provided in section 103G.2242. The commissioner must provide notice of an application for wetland replacement under a permit to mine to the county in which the impact is proposed and the county in which a mitigation site is proposed. Public value must be determined in accordance with section 103B.3355 or a comprehensive wetland protection and management plan established under section 103G.2243. Sections 103G.221 to 103G.2372 also apply to excavation in permanently and semipermanently flooded areas of wetlands.\n(b) Replacement must be guided by the following principles in descending order of priority:\n(1) avoiding the direct or indirect impact of the activity that may destroy or diminish the wetland;\n(2) minimizing the impact by limiting the degree or magnitude of the wetland activity and its implementation;\n(3) rectifying the impact by repairing, rehabilitating, or restoring the affected wetland environment;\n(4) reducing or eliminating the impact over time by preservation and maintenance operations during the life of the activity;\n(5) compensating for the impact by restoring a wetland; and\n(6) compensating for the impact by replacing or providing substitute wetland resources or environments.\nFor a project involving the draining or filling of wetlands in an amount not exceeding 10,000 square feet more than the applicable amount in section 103G.2241, subdivision 9, paragraph (a), the local government unit may make an on-site sequencing determination without a written alternatives analysis from the applicant.\n(c) If a wetland is located in a cultivated field, then replacement must be accomplished through restoration only without regard to the priority order in paragraph (b), provided that the altered wetland is not converted to a nonagricultural use for at least ten years.\n(d) If a wetland is replaced under paragraph (c), or drained under section 103G.2241, subdivision 1, clause (1), the local government unit may require a deed restriction that prohibits nonagricultural use for at least ten years. The local government unit may require the deed restriction if it determines the wetland area drained is at risk of conversion to a nonagricultural use within ten years based on the zoning classification, proximity to a municipality or full service road, or other criteria as determined by the local government unit.\n(e) Restoration and replacement of wetlands must be accomplished in accordance with the ecology of the landscape area affected and ponds that are created primarily to fulfill stormwater management, and water quality treatment requirements may not be used to satisfy replacement requirements under this chapter unless the design includes pretreatment of runoff and the pond is functioning as a wetland.\n(f) Except as provided in paragraph (g), for a wetland or public waters wetland located on nonagricultural land, replacement must be in the ratio of two acres of replaced wetland for each acre of drained or filled wetland.\n(g) For a wetland or public waters wetland located on agricultural land or in a greater than 80 percent area, replacement must be in the ratio of one acre of replaced wetland for each acre of drained or filled wetland.\n(h) Wetlands that are restored or created as a result of an approved replacement plan are subject to the provisions of this section for any subsequent drainage or filling.\n(i) Except in a greater than 80 percent area, only wetlands that have been restored from previously drained or filled wetlands, wetlands created by excavation in nonwetlands, wetlands created by dikes or dams along public or private drainage ditches, or wetlands created by dikes or dams associated with the restoration of previously drained or filled wetlands may be used for wetland replacement according to rules adopted under section 103G.2242, subdivision 1. Modification or conversion of nondegraded naturally occurring wetlands from one type to another are not eligible for wetland replacement.\n(j) The Technical Evaluation Panel established under section 103G.2242, subdivision 2, shall ensure that sufficient time has occurred for the wetland to develop wetland characteristics of soils, vegetation, and hydrology before recommending that the wetland be deposited in the statewide wetland bank. If the Technical Evaluation Panel has reason to believe that the wetland characteristics may change substantially, the panel shall postpone its recommendation until the wetland has stabilized.\n(k) This section and sections 103G.223 to 103G.2242, 103G.2364, and 103G.2365 apply to the state and its departments and agencies.\n(l) For projects involving draining or filling of wetlands associated with a new public transportation project, and for projects expanded solely for additional traffic capacity, public transportation authorities may purchase credits from the board at the cost to the board to establish credits. Proceeds from the sale of credits provided under this paragraph are appropriated to the board for the purposes of this paragraph. For the purposes of this paragraph, \"transportation project\" does not include an airport project.\n(m) A replacement plan for wetlands is not required for individual projects that result in the filling or draining of wetlands for the repair, rehabilitation, reconstruction, or replacement of a currently serviceable existing state, city, county, or town public road necessary, as determined by the public transportation authority, to meet state or federal design or safety standards or requirements, excluding new roads or roads expanded solely for additional traffic capacity lanes. This paragraph only applies to authorities for public transportation projects that:\n(1) minimize the amount of wetland filling or draining associated with the project and consider mitigating important site-specific wetland functions on site;\n(2) except as provided in clause (3), submit project-specific reports to the board, the Technical Evaluation Panel, the commissioner of natural resources, and members of the public requesting a copy at least 30 days prior to construction that indicate the location, amount, and type of wetlands to be filled or drained by the project or, alternatively, convene an annual meeting of the parties required to receive notice to review projects to be commenced during the upcoming year; and\n(3) for minor and emergency maintenance work impacting less than 10,000 square feet, submit project-specific reports, within 30 days of commencing the activity, to the board that indicate the location, amount, and type of wetlands that have been filled or drained.\nThose required to receive notice of public transportation projects may appeal minimization, delineation, and on-site mitigation decisions made by the public transportation authority to the board according to the provisions of section 103G.2242, subdivision 9. The Technical Evaluation Panel must review minimization and delineation decisions made by the public transportation authority and provide recommendations regarding on-site mitigation if requested to do so by the local government unit, a contiguous landowner, or a member of the Technical Evaluation Panel.\nExcept for public transportation projects that occur on state roads, for which the state Department of Transportation is responsible for the wetland replacement, the board must replace the wetlands, and wetland areas of public waters if authorized by the commissioner or a delegated authority, drained or filled by public transportation projects on existing roads.\nPublic transportation authorities at their discretion may deviate from federal and state design standards on existing road projects when practical and reasonable to avoid wetland filling or draining, provided that public safety is not unreasonably compromised. The local road authority and its officers and employees are exempt from liability for any tort claim for injury to persons or property arising from travel on the highway and related to the deviation from the design standards for construction or reconstruction under this paragraph. This paragraph does not preclude an action for damages arising from negligence in construction or maintenance on a highway.\n(n) If a landowner seeks approval of a replacement plan after the proposed project has already affected the wetland, the local government unit may require the landowner to replace the affected wetland at a ratio not to exceed twice the replacement ratio otherwise required.\n(o) A local government unit may request the board to reclassify a county or watershed on the basis of its percentage of presettlement wetlands remaining. After receipt of satisfactory documentation from the local government, the board shall change the classification of a county or watershed. If requested by the local government unit, the board must assist in developing the documentation. Within 30 days of its action to approve a change of wetland classifications, the board shall publish a notice of the change in the Environmental Quality Board Monitor.\n(p) One hundred citizens who reside within the jurisdiction of the local government unit may request the local government unit to reclassify a county or watershed on the basis of its percentage of presettlement wetlands remaining. In support of their petition, the citizens shall provide satisfactory documentation to the local government unit. The local government unit shall consider the petition and forward the request to the board under paragraph (o) or provide a reason why the petition is denied.\nThe board shall give priority to restoration projects that:\n(1) will encourage land use that leads to more compact development or redevelopment;\n(2) will encourage public or private infrastructure investments which connect ecosystems and communities, attract private sector investment in commercial or residential properties adjacent to the public improvement; or\n(3) are located in critical rural and urban watersheds.\n(a) Impacted wetlands outside of a greater than 80 percent area must not be replaced in a greater than 80 percent area. All wetland replacement must follow this priority order:\n(1) in the same minor watershed as the impacted wetland;\n(2) in the same watershed as the impacted wetland;\n(3) in the same wetland bank service area as the impacted wetland; and\n(4) in another wetland bank service area.\n(b) Notwithstanding paragraph (a), wetland banking credits approved according to a complete wetland banking application submitted to a local government unit by April 1, 1996, may be used to replace wetland impacts resulting from public transportation projects statewide.\n(c) Notwithstanding paragraph (a), clauses (1) and (2), the priority order for replacement by wetland banking begins at paragraph (a), clause (3), according to rules adopted under section 103G.2242, subdivision 1.\n(d) When reasonable, practicable, and environmentally beneficial replacement opportunities are not available in siting priorities listed in paragraph (a), the applicant may seek opportunities at the next level.\n(e) For the purposes of this section, \"reasonable, practicable, and environmentally beneficial replacement opportunities\" are defined as opportunities that:\n(1) take advantage of naturally occurring hydrogeomorphological conditions and require minimal landscape alteration;\n(2) have a high likelihood of becoming a functional wetland that will continue in perpetuity;\n(3) do not adversely affect other habitat types or ecological communities that are important in maintaining the overall biological diversity of the area; and\n(4) are available and capable of being done after taking into consideration cost, existing technology, and logistics consistent with overall project purposes.\n(f) Regulatory agencies, local government units, and other entities involved in wetland restoration shall collaborate to identify potential replacement opportunities within their jurisdictional areas.\n(g) The board must establish wetland-replacement ratios and wetland bank service area priorities to implement the siting and targeting of wetland replacement and encourage the use of high priority areas for wetland replacement.\n(h) Wetland replacement sites identified in accordance with the priority order for replacement siting in paragraph (a) as part of the completion of an adequate environmental impact statement may be approved for a replacement plan under section 93.481, 103G.2242, or 103G.2243 without further modification related to the priority order, notwithstanding availability of new mitigation sites or availability of credits after completion of an adequate environmental impact statement. Wetland-replacement-plan applications must be submitted within one year of the adequacy determination of the environmental impact statement to be eligible for approval under this paragraph.",
	"repealed": false
}