{
	"id": "171.061",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.061",
	"title": "171.061 DRIVER'S LICENSE AGENT.",
	"text": "For purposes of this section:\n(1) \"applicant\" means an individual applying for a driver's license, provisional license, restricted license, duplicate license, instruction permit, Minnesota identification card, or motorized bicycle operator's permit; and\n(2) \"application\" refers to an application for a driver's license, provisional license, restricted license, duplicate license, instruction permit, Minnesota identification card, or motorized bicycle operator's permit.\n(a) The commissioner of public safety may appoint an individual, and for cause discontinue the appointment of an agent, to serve as a driver's license agent.\n(b) A county board may appoint an individual, and for cause discontinue the appointment of an agent, to serve as an agent, pursuant to sections 373.32 to 373.38, with the approval of the commissioner. If a county board does not discontinue an agent's appointment, although cause for discontinuance exists, the commissioner may discontinue the appointment. If a county board does not appoint an individual, the commissioner may establish an office and appoint an individual to accept applications as the public interest and convenience may require.\n(c) The county board is responsible for the acts of an agent appointed by the board and for forwarding to the department all applications accepted and fees collected by the agent as required by the department.\nAn applicant may file an application with an agent. The agent shall receive and accept applications in accordance with the laws and rules of the Department of Public Safety for a noncompliant driver's license or identification card; an enhanced driver's license or identification card; a REAL ID compliant driver's license or identification card; restricted license; duplicate license; instruction permit; or motorized bicycle operator's permit. Application records must be maintained at the office of the agent in a manner that complies with sections 13.05, subdivision 5, and 13.055. As an alternative to paper copy storage, an agent may retain records and documents in a secure electronic medium that complies with the security requirements under the United States Federal Bureau of Investigation, Criminal Justice Information Services Division, Policy 5.4 or any successor policy, provided 60 days have elapsed since the transaction and subject to standards established by the commissioner. The agent is responsible for all costs associated with the conversion to electronic records and maintenance of the electronic storage medium, including the destruction of existing paper records after conversion to the electronic format. All queries and responses in the secure electronic medium, and all actions in which data are entered, updated, accessed, or shared or disseminated by the agent must be contained in a data audit trail. Data contained in the audit trail are public to the extent the data are not otherwise classified under this section.\n[See Note.]\n(a) The agent may charge and retain a filing fee for each application as follows:\nExcept as provided in paragraph (c), the fee must cover all expenses involved in receiving, accepting, or forwarding to the department the applications and fees required under sections 171.02, subdivision 3; 171.06, subdivisions 2 and 2a; and 171.07, subdivisions 3 and 3a.\n(b) The statutory fees and the filing fees imposed under paragraph (a) may be paid by credit card or debit card. The driver's license agent may collect a convenience fee on the statutory fees and filing fees not greater than the cost of processing a credit card or debit card transaction. The convenience fee must be used to pay the cost of processing credit card and debit card transactions. The commissioner must adopt rules to administer this paragraph using the exempt procedures of section 14.386, except that section 14.386, paragraph (b), does not apply.\n(c) The department must maintain the photo identification and vision examination equipment for all agents. All photo identification and vision examination equipment must be compatible with standards established by the department.\n(d) A filing fee retained by the agent employed by a county board must be paid into the county treasury and credited to the general revenue fund of the county. An agent who is not an employee of the county must retain the filing fee in lieu of county employment or salary and is considered an independent contractor for pension purposes, coverage under the Minnesota State Retirement System, or membership in the Public Employees Retirement Association.\n(e) Before the end of the first working day following the final day of the reporting period established by the department, the agent must forward to the department all applications and fees collected during the reporting period except as provided in paragraph (d).\n(a) An agent shall notify the department no less than 30 days before the discontinuance of service.\n(b) In the event of the notice specified in paragraph (a); death or retirement of the agent; or revocation or discontinuance of the appointment of the agent by the county board or commissioner, the appointment terminates and all equipment provided by the department reverts to the department.\n(a) Notwithstanding any statute or rule to the contrary, if a driver's license agent appointed under this section permanently stops offering services at the approved office location and permanently closes the approved office location, the commissioner must use a competitive bidding process for the appointment of a replacement driver's license agent. If available, the replacement driver's license agent appointed by the commissioner under this section must continue to offer services at the approved office location. If the existing office location is not available to the replacement driver's license agent, the replacement office location must be at a location that must be approved by the commissioner and must serve a similar service area as the existing office location.\n(b) The commissioner must not give a preference to a partner, owner, manager, or employee of the driver's license agent that has permanently stopped offering services at the closed office location in a competitive bidding process.\n(c) The commissioner must adopt rules to administer and enforce a competitive bidding process to select a replacement driver's license agent. If the replacement driver's license agent elects to not offer services at the office location of the prior agent, Minnesota Rules, chapter 7404, governing the selection of a proposed office location of a driver's license agent, applies.\n[See Note.]\nThe commissioner shall adopt rules that prescribe:\n(1) criteria, procedures, and requirements for appointing an individual as an agent of the commissioner;\n(2) criteria for establishment, operation, management, location, and movement of a license application office;\n(3) standards for the uniform administration of laws and rules governing the receipt of applications and fees for applications;\n(4) number of applications to be processed;\n(5) standards for submitting applications including valid forms of identification, depositing funds, maintaining records, and holding proper bonds; and\n(6) standards for discontinuing the individual's appointment and for enforcement action.",
	"repealed": false
}