{
	"id": "398.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/398.21",
	"title": "398.21 ENLARGEMENT OF DISTRICTS.",
	"text": "When conducive to the general welfare any territory adjacent and contiguous to an existing park district, whether located within any county in which the district was created or not, may be annexed to the district under the following procedure: A petition shall be filed with the board of park district commissioners requesting such annexation, containing an accurate description of the territory proposed to be annexed, accompanied by an accurate map or plat of the territory, and signed either by one percent of the electors residing within the territory or authorized by resolutions of a majority of the councils of the cities within the area to be annexed. The board shall determine whether the petition is sufficient and whether it is advisable that the annexation be made. If the board determines in favor of the annexation, it makes application to the county board of the county in which the territory is located, setting forth the fact of the filing of the petition and the reasons why it is advisable that the territory be annexed to the district. The board may on its own motion file such petition with the county board. Upon the filing of such petition, like proceedings shall be had as are provided in section 398.20 upon application for the creation of a park district. The territory annexed may not include any city of the first class, a part only of an existing town or municipal corporation and shall not include any territory situated in any other park district activated pursuant to this chapter unless the park district board of such district consents to the transfer of such territory.\nIn the event of the annexation to a park district of territory located in a county other than the county or counties in which the district was created, the county board of the county in which the annexed territory is located shall exercise, with reference to the annexed territory, the powers conferred upon county boards by section 398.20 and the auditor and the treasurer of the county in which the annexed territory is located shall exercise, with reference to taxes levied and collected by the board of park district commissioners upon the annexed territory, the powers conferred upon auditors and treasurers by sections 398.16 to 398.19.",
	"repealed": false
}