{
	"id": "273.119",
	"url": "https://www.revisor.mn.gov/statutes/cite/273.119",
	"title": "273.119 CONSERVATION TAX CREDIT.",
	"text": "Land located in an agricultural preserve created under chapter 40A is eligible for a property tax credit of $1.50 per acre. To begin to qualify for the tax credit, the owner shall file with the county by January 2 of any year an application for an agricultural preserve restrictive covenant pursuant to section 40A.10, subdivision 1. An owner who has given notice of termination of the agricultural preserve under section 40A.11, subdivision 2, is not eligible for the credit. The assessor shall indicate the amount of the property tax reduction on the property tax statement of each taxpayer receiving a credit under this section. The credit paid pursuant to this section shall be deducted from the tax due on the property as provided in section 273.1393.\nThe county may transfer money from the county conservation account created in section 40A.152 to the county revenue fund to reimburse the fund for the cost of the property tax credit. The county auditor shall certify to the commissioner of revenue under section 270C.85, subdivision 2, clause (4), the amount of tax lost to the county from the property tax credit under subdivision 1 and the extent that the tax lost exceeds funds available in the county conservation account. Any prior year adjustments must also be certified. The commissioner of revenue shall review the certifications to determine their accuracy. The commissioner may make the changes in the certification that are considered necessary or return a certification to the county auditor for corrections. The commissioner shall reimburse each taxing district, other than school districts, from the Minnesota conservation fund under section 40A.151 for the taxes lost in excess of the county account. The payments must be made at the time provided in section 473H.10, subdivision 3, for payment to taxing jurisdictions in the same proportion that the ad valorem tax is distributed.",
	"repealed": false
}