{
	"id": "353.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.65",
	"title": "353.65 CONTRIBUTIONS.",
	"text": "(a) The public employees police and fire fund is established for police officers and firefighters who meet the eligibility criteria under section 353.64.\n(b) Employee contributions other than those made under subdivision 2, paragraph (b) or (c), employer contributions under subdivision 3, and section 353.665, subdivision 8, and other amounts authorized by law, including all employee and employer contributions of members transferred, must be deposited in the public employees police and fire fund.\n(a) For members other than members who were active members of the former Minneapolis Firefighters Relief Association on December 29, 2011, or for members other than members who were active members of the former Minneapolis Police Relief Association on December 29, 2011, the employee contribution is an amount equal to the following percentage of the total salary of each member, as follows:\n(b) For members who were active members of the former Minneapolis Firefighters Relief Association on December 29, 2011, the employee contribution is an amount equal to eight percent of the monthly unit value under section 353.01, subdivision 10a, multiplied by 80 and expressed as a biweekly amount for each member. The employee contribution made by a member with at least 25 years of service credit as an active member of the former Minneapolis Firefighters Relief Association must be deposited in the postretirement health care savings account established under section 352.98.\n(c) For members who were active members of the former Minneapolis Police Relief Association on December 29, 2011, the employee contribution is an amount equal to eight percent of the monthly unit value under section 353.01, subdivision 10b, multiplied by 80 and expressed as a biweekly amount for each member. The employee contribution made by a member with at least 25 years of service credit as an active member of the former Minneapolis Police Relief Association must be deposited in the postretirement health care savings account established under section 352.98.\n(d) Contributions under this section must be made by deduction from salary in the manner provided in subdivision 4. Where any portion of a member's salary is paid from other than public funds, the member's employee contribution is based on the total salary received from all sources.\n(a) With respect to members other than members who were active members of the former Minneapolis Firefighters Relief Association on December 29, 2011, or for members other than members who were active members of the former Minneapolis Police Relief Association on December 29, 2011, the employer contribution is an amount equal to the following percentage of the total salary of each member, as follows:\n(b) With respect to members who were active members of the former Minneapolis Firefighters Relief Association on December 29, 2011, the employer contribution is an amount equal to the amount of the member contributions under subdivision 2, paragraph (b).\n(c) With respect to members who were active members of the former Minneapolis Police Relief Association on December 29, 2011, the employer contribution is an amount equal to the amount of the member contributions under subdivision 2, paragraph (c).\n(d) Contributions under this subdivision must be made from funds available to the employing subdivision by the means and in the manner provided in section 353.28.\n[Repealed, 1999 c 222 art 4 s 20]\n(a) The state must pay $4,500,000 on October 1, 2018, and October 1, 2019, to the public employees police and fire retirement plan. By October 1 of each year after 2019, the state must pay $9,000,000 to the public employees police and fire retirement plan. The commissioner of management and budget must pay the aid specified in this subdivision. The amount required is annually appropriated from the general fund to the commissioner of management and budget.\n(b) The aid under paragraph (a) continues until the earlier of:\n(1) the first day of the fiscal year following three consecutive fiscal years in which, for each fiscal year, the actuarial value of assets of the fund equals or exceeds 100 percent of the actuarial accrued liabilities as reported by the actuary retained under section 356.214 in the annual actuarial valuation prepared under section 356.215; or\n(2) July 1, 2048.\nThe head of each department of the various governmental subdivisions is hereby directed to cause employee contributions to be deducted in the manner and subject to the terms provided in section 353.27, subdivision 4.\n[Repealed, 1973 c 753 s 85]\nAll contributions shall be credited to the fund and all interest and other income of the fund shall be credited to said fund. The retirement fund shall be disbursed only for the purposes herein provided. The expenses of said fund and the annuities herein provided upon retirement shall be paid from said fund.\n[Repealed, 1996 c 390 s 41]",
	"repealed": false
}