{
	"id": "365.181",
	"url": "https://www.revisor.mn.gov/statutes/cite/365.181",
	"title": "365.181 CONTRACTED FIRE SERVICE; COST DATA; ASSESSMENTS.",
	"text": "A town board may enter into a contract for fire protection and operation and upkeep of fire apparatus with the town's county or a nearby home rule charter or statutory city. The town board may also enter into the same kind of contract with a volunteer fire department or association if the volunteer fire department or association is not, by charter or ordinance, an official part of a city government. The parties shall mutually agree on the terms and conditions of the contract but the contract must not run for more than ten years.\nA town that has entered into a contract or is negotiating with a municipality for fire services under this section, may ask the municipality for cost data relating to fire protection. The town may also ask for a copy of each existing fire protection contract the municipality has with other political subdivisions. The municipality shall provide the requested data and contracts.\nIf a tax is not levied under section 365.18 or if the tax does not raise enough to pay for a year's contracted fire service the town board may levy an assessment for fire service. The assessment must be levied on each real estate parcel that required fire service during the year. The assessment must not be more than the cost of service. The parcel owners must be given ten days' mailed notice of the time and place of the town board meeting that is called to consider the assessments. The county auditor's records must be used to determine ownership of the parcels.\nThe assessment is a lien on the assessed parcel and is due and payable to the town treasurer 30 days after the assessment levy. A parcel's assessment that is not paid when due must be certified by the town treasurer to the county auditor. The auditor shall add the assessment plus a ten percent penalty to the real estate taxes on the parcel for the next year.",
	"repealed": false
}