{
	"id": "14.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.52",
	"title": "14.52 COURT REPORTERS; AUDIO RECORDINGS.",
	"text": "The Office of Administrative Hearings may maintain a court reporter system and in addition to or in lieu thereof may contract with nongovernmental sources for court reporter services. The court reporters may additionally be utilized as the chief administrative law judge directs. Unless the chief administrative law judge determines that the use of a court reporter is more appropriate, an audio magnetic recording device shall be used to keep a record at any hearing which takes place under this chapter. In all cases, the chief administrative law judge shall use audio magnetic recording devices to keep the record of hearings except when there are more than two primary parties in a case and the chief administrative law judge determines that the use of a court reporter is more appropriate. If the chief administrative law judge determines that the use of a court reporter is more appropriate, the cost of the court reporter shall be paid by the state. If the chief administrative law judge determines that the use of an audio magnetic recording device is more appropriate in a hearing, any party to that hearing may provide a court reporter at the party's expense. Court reporters provided by a party shall be selected from the chief administrative law judge's list of nongovernmental sources.\nThe fee charged by a court reporter to a party shall not exceed the fee which would be charged to the state pursuant to the court reporter's contract with the state.\nCourt reporters serving in the court reporter system of the Office of Administrative Hearings shall be in the classified service. Notwithstanding the provisions of section 15.17, subdivision 4, copies of transcriptions of hearings conducted pursuant to sections 14.48 to 14.56 may be obtained only through the Office of Administrative Hearings.\nThe departmental and classification seniority of an individual who was employed as a court reporter in state service prior to appointment as a court reporter in the Office of Administrative Hearings pursuant to Laws 1975, chapter 380, section 16, shall carry forward and be credited to the individual's employment with the Office of Administrative Hearings.",
	"repealed": false
}