{
	"id": "302A.7291",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.7291",
	"title": "302A.7291 DISSOLUTION PROCEDURE FOR CORPORATIONS THAT DO NOT GIVE NOTICE.",
	"text": "Articles of dissolution for a corporation that has not given notice to creditors and claimants in the manner provided in section 302A.727 must be filed with the secretary of state after:\n(1) the payment of claims of all known creditors and claimants has been made or provided for; or\n(2) at least two years have elapsed from the date of filing the notice of intent to dissolve.\nThe articles of dissolution must state:\n(1) if articles of dissolution are being filed pursuant to subdivision 1, clause (1), that all known debts, obligations, and liabilities of the corporation have been paid and discharged or that adequate provision has been made for payment or discharge;\n(2) that the remaining property, assets, and claims of the corporation have been distributed among its shareholders in accordance with section 302A.551, subdivision 4, or that adequate provision has been made for that distribution; and\n(3) that there are no pending legal, administrative, or arbitration proceedings by or against the corporation, or that adequate provision has been made for the satisfaction of any judgment, order, or decree that may be entered against it in a pending proceeding.\n(a) If the corporation has paid or provided for all known creditors or claimants at the time articles of dissolution are filed, a creditor or claimant who does not file a claim or pursue a remedy in a legal, administrative, or arbitration proceeding within two years after the date of filing the notice of intent to dissolve is barred from suing on that claim or otherwise realizing upon or enforcing it.\n(b) If the corporation has not paid or provided for all known creditors and claimants at the time articles of dissolution are filed, a person who does not file a claim or pursue a remedy in a legal, administrative, or arbitration proceeding within two years after the date of filing the notice of intent to dissolve is barred from suing on that claim or otherwise realizing upon or enforcing it, except as provided in section 302A.781.",
	"repealed": false
}