{
	"id": "169.468",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.468",
	"title": "169.468 VEHICLE SAFETY RULES; FEDERAL SAFETY STANDARDS.",
	"text": "The commissioner of public safety, pursuant to the Administrative Procedure Act, may adopt and enforce rules in substantial conformity with federal motor vehicle safety standards established by the United States Secretary of Transportation pursuant to the national Traffic and Motor Vehicle Safety Act of 1966 (Public Law 89-563) with respect to any new motor vehicle or new item of motor vehicle equipment applicable to the same aspect of performance of such new vehicle or new equipment.\nIn the absence of a motor vehicle safety standard adopted pursuant to the national Traffic and Motor Vehicle Safety Act of 1966 or if any such standard is not applicable to new vehicles or new equipment manufactured and first sold in the state of Minnesota, the commissioner of public safety may require new vehicles and specific types of new equipment to be tested and approved for compliance with the requirements of this chapter, or any rule adopted pursuant to this chapter. The commissioner shall approve or disapprove of the vehicle or equipment within a reasonable time after it is submitted. Approval may be based upon a certificate of approval or test report furnished to the commissioner by the American Association of Motor Vehicle Administrators. If such new vehicle or new equipment does not conform to the provisions of this chapter, or to such rules adopted by the commissioner of public safety, no person shall sell, offer for sale, or use any such new vehicle or new equipment. The commissioner of public safety is authorized to set and collect a reasonable fee from the manufacturer or distributor for the testing and approval of all new vehicles and specific types of new equipment upon which approval is required under this section. Such fee may be sufficient in amount to reimburse the Department of Public Safety for all costs connected with such test and approval. The commissioner shall waive the fee for any approval based on a certificate of approval or test report furnished by the American Association of Motor Vehicle Administrators.\nA federal motor vehicle safety standard adopted by the commissioner of public safety which conflicts with an equipment provision of this chapter, applicable to the same aspect of performance, shall supersede, on its effective date, the conflicting equipment provision of this chapter, with respect to new motor vehicles.\nAny person who violates the provisions of this section is guilty of a misdemeanor.",
	"repealed": false
}