{
	"id": "332B.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/332B.09",
	"title": "332B.09 FEES; WITHDRAWAL OF CREDITORS; NOTIFICATION TO DEBTOR OF SETTLEMENT OFFER.",
	"text": "A debt settlement services provider may calculate fees on a percentage of debt basis or on a percentage of savings basis. The fee structure shall be clearly disclosed and explained in the debt settlement services agreement.\nThe total amount of the fees claimed, demanded, charged, collected, or received under a debt settlement services agreement shall be:\n(1) for fees calculated on a percentage of debt basis, no greater than 15 percent of the aggregate debt; and\n(2) for fees calculated on a percentage of savings basis, no greater than 30 percent of the savings actually negotiated by the debt settlement services provider. The savings shall be calculated as the difference between the aggregate debt that is stated in the debt settlement services agreement at the time of its execution and the total amount that the debtor actually pays to settle all the debts included in the debt settlement services agreement, provided that only savings resulting from concessions actually negotiated by the debt settlement services provider may be counted.\nA debt settlement services provider may not impose or collect any payment pursuant to a debt settlement services agreement before the debt settlement service provider has fully performed all of the following:\n(1) the debt settlement services contained in the agreement; and\n(2) any additional services the debt settlement services provider has agreed to perform.\nIf more than one debt is the subject of the debt settlement services agreement, a debt settlement services provider may only charge or collect that proportion of total fees allowable under this section that equals the proportion of the aggregate debt the individual settled debt represents.\nNo fees, charges, assessments, or any other compensation may be claimed, demanded, charged, collected, or received other than the fees allowed under this section. Any fees collected in excess of those allowed under this section must be immediately returned to the debtor.\nWhenever a creditor withdraws from a debt settlement services plan, the debt settlement services provider must promptly notify the debtor of the withdrawal, identify the creditor, and inform the debtor of the right to modify the debt settlement services agreement, unless at least 50 percent of the listed creditors withdraw, in which case the debt settlement services provider must notify the debtor of the debtor's right to cancel. In no case may this notice be provided more than 15 days after the debt settlement services provider learns of the creditor's decision to withdraw from a plan.\nA debt settlement services provider must make all reasonable efforts to notify the debtor within 24 hours of a settlement offer made by a creditor.",
	"repealed": false
}