{
	"id": "171.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.071",
	"title": "171.071 PHOTOGRAPH ON LICENSE OR IDENTIFICATION CARD.",
	"text": "Notwithstanding the provisions of section 171.07, the commissioner of public safety may adopt rules to permit identification on a driver's license or Minnesota identification card in lieu of a photograph or electronically produced image where the commissioner finds that the licensee has religious objections to the use of a photograph or electronically produced image.\nIf an accident involving a head injury, serious illness, or treatment of the illness has resulted in hair loss by an applicant for a driver's license or identification card, the commissioner shall permit the applicant to wear a hat or similar head wear in the photograph or electronically produced image. The hat or head wear must be of an appropriate size and type to allow identification of the holder of the license or card and must not obscure the holder's face.\nSubdivision 1 applies only to a noncompliant license or identification card. Subdivisions 1 and 2 do not apply to the commissioner's requirements pertaining to a photograph or electronically produced image on an enhanced driver's license or an enhanced identification card.\n[See Note.]\n(a) Notwithstanding section 171.07 or Minnesota Rules, part 7410.1810, the commissioner may grant a variance from the photograph requirements for a noncompliant identification card if: (1) the individual is homebound as defined in paragraph (b); (2) the individual has submitted proof of homebound status; and (3) the department has a photograph of the applicant on file that was taken within the last four years or during the most recent renewal cycle or the applicant has submitted a photograph to the department that meets the requirements of section 171.07, Minnesota Rules, part 7410.1810, subpart 1, and other technical requirements established by the commissioner, such as background color and electronic file size, to ensure the image can be used on a credential and conforms with images taken by the department. Applicants granted a photograph variance under this subdivision are not required to appear in person to have a new photograph taken.\n(b) For purposes of this subdivision, \"homebound\" means the individual is unable to leave the individual's residence due to a medical, physical, or mental health condition or infirmity as documented in writing by a physician, case worker, or social worker.",
	"repealed": false
}