{
	"id": "237.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/237.761",
	"title": "237.761 ALTERNATIVE REGULATION PLAN; SERVICE.",
	"text": "An alternative regulation plan must contain provisions that provide for classification of all telephone services as price regulated, flexibly priced, or nonprice regulated consistent with subdivisions 2 to 5.\nFor purposes of this section, the term \"price-regulated service\" includes only those services that are:\n(1) essential for providing local telephone service and access to the local telephone network;\n(2) integrally related to privacy, health, and safety of the company's customers; and\n(3) for which no reasonable alternative exists within the relevant market or geographic area on reasonably comparable terms and conditions.\nPrice-regulated telephone services are the following:\n(1) residential and business service for local calling, including measured local service, two-party service, private branch exchange (PBX) trunks, trunk type hunting services, direct inward dialing, the network access portion of central office switched exchange service, and public access lines for customer-owned coin-operated telephones;\n(2) extended area service;\n(3) switched network access service;\n(4) call tracing;\n(5) calling number blocking;\n(6) touch tone service when provided separately from basic local exchange service;\n(7) local exchange, white-page, printed directories;\n(8) 911 emergency services;\n(9) installation and repair of local network access;\n(10) local operator services, excluding directory assistance; and\n(11) toll service blocking and 1-900 or 976 access blocking.\n(a) A service not listed in subdivision 3 or not otherwise determined to be price regulated under subdivision 6 or 7 or nonprice regulated must be classified as a flexibly priced service.\n(b) Flexibly priced services are regulated consistent with Minnesota Rules, parts 7811.2210 and 7812.2210, except that:\n(1) rate decreases may be effective immediately upon filing and upon notice to affected customers; and\n(2) rate increases may be effective 20 days after filing and upon notice to affected customers and are considered approved if no objection is filed or raised by an interested party or the commission within 20 days after the filing. If an interested party files an objection, the commission shall make its determination on the proposed rate increase within 90 days of the filing of the objection.\n(a) A service must be classified as nonprice regulated if the commission finds, based upon evidence filed by the telephone company and other evidence available to the commission and consistent with the company's proposed plan, that there is sufficient competition to justify classification as nonprice regulated. In making that determination, the factors the commission shall consider include:\n(1) the number, size, and identity of competitors providing the same or functionally equivalent service;\n(2) the geographic area in which competitive service is actually available to and being used by customers, to the extent this information is available to the commission;\n(3) the importance of the service to the public; and\n(4) the effect of classification of the service on the development of a competitive telecommunications market.\n(b) Telephone companies shall file tariffs or price lists for non-price-regulated services with the commission, but the rates for these services are not subject to commission approval or investigation except as provided in subdivision 6 and sections 237.762, subdivision 6, 237.770, and 237.771.\nAn alternative regulation plan may contain provisions allowing for the reclassification of services during the course of the plan upon a showing that the service meets the criteria contained in subdivision 2, 3, 4, or 5, and the plan, for the requested classification.\nAt the time the company first offers a service, it shall file a tariff or price list and the proposed classification for the service under the plan along with a written explanation of why the proposed classification is consistent with this section. New services classified as flexibly priced or nonprice regulated may be offered on one day's notice to the commission and the department. New services classified as price regulated may be offered pursuant to the terms set forth in the plan. A service is not considered a new service if it consists of a repackaging including bundling, unbundling, or repricing of an already existing service. If no interested party or the commission objects to the company's proposed classification within 30 days of the filing of the petition, the company's proposed classification of the service is approved. If an objection is filed, the commission shall determine the classification of the service within 90 days of the filing of the new service.\n(a) An alternative regulation plan must also include a plan outlining the company's commitment to invest in telecommunications infrastructure improvements in this state over a period of not less than six years.\n(b) An investment plan shall include all of the following:\n(1) a description of the level of planned investment in technological or infrastructure enhancement;\n(2) a description of the extent to which planned investment will make new telecommunications technology available to customers or expand the availability of current technology;\n(3) a description of the planned deployment of fiber-optic facilities or broadband capabilities to schools, libraries, technical colleges, hospitals, colleges and universities, and local governments in this state; and\n(4) a description of planned investment and deployment of higher speed telecommunications services and increased capacity for voice, video, and data transmission, in both the metropolitan and outstate portions of the company's service territory.",
	"repealed": false
}