{
	"id": "121A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.06",
	"title": "121A.06 REPORTS OF DANGEROUS WEAPON INCIDENTS IN SCHOOL ZONES.",
	"text": "As used in this section:\n(1) \"dangerous weapon\" has the meaning given it in section 609.02, subdivision 6;\n(2) \"school\" has the meaning given it in section 120A.22, subdivision 4; and\n(3) \"school zone\" has the meaning given it in section 152.01, subdivision 14a, clauses (1) and (3).\nSchool districts must electronically report to the commissioner of education incidents involving the use or possession of a dangerous weapon in school zones. The form must include the following information:\n(1) a description of each incident, including a description of the dangerous weapon involved in the incident;\n(2) where, at what time, and under what circumstances the incident occurred;\n(3) information about the offender, other than the offender's name, including the offender's age; whether the offender was a student and, if so, where the offender attended school; and whether the offender was under school expulsion or suspension at the time of the incident;\n(4) information about the victim other than the victim's name, if any, including the victim's age; whether the victim was a student and, if so, where the victim attended school; and if the victim was not a student, whether the victim was employed at the school;\n(5) the cost of the incident to the school and to the victim; and\n(6) the action taken by the school administration to respond to the incident.\nThe commissioner shall provide an electronic reporting format that allows school districts to provide aggregate data.\nBy July 31 of each year, each public school shall report incidents involving the use or possession of a dangerous weapon in school zones to the commissioner. The reports must be submitted using the electronic reporting system developed by the commissioner under subdivision 2. The commissioner shall compile the information it receives from the schools and report it annually to the commissioner of public safety and the legislature.",
	"repealed": false
}