{
	"id": "473F.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/473F.07",
	"title": "473F.07 COMPUTATION OF AREAWIDE TAX BASE.",
	"text": "Each county auditor shall certify the determinations under sections 473F.05 and 473F.06 to the administrative auditor on or before August 1 of each year.\nThe administrative auditor shall determine an amount equal to 40 percent of the sum of the amounts certified under section 473F.06. The resulting amount shall be known as the \"areawide net tax capacity for ........(year).\"\nThe commissioner of revenue shall certify to the administrative auditor, on or before August 10 of each year, the population of each municipality for the preceding year, the proportion of that population which resides within the area, the average fiscal capacity of all municipalities in the area for the preceding year, and the fiscal capacity of each municipality in the area for the preceding year.\nThe administrative auditor shall determine, for each municipality, the product of (a) its population, and (b) the proportion which the average fiscal capacity of municipalities for the preceding year bears to the fiscal capacity of that municipality for the preceding year. The product shall be the areawide tax base distribution index for that municipality. If a municipality is located partly within and partly without the area its index shall be that which is otherwise determined hereunder, multiplied by the proportion which its population residing within the area bears to its total population as of the preceding year.\nThe administrative auditor shall determine the proportion which the index of each municipality bears to the sum of the indices of all municipalities and shall then multiply this proportion in the case of each municipality, by the areawide net tax capacity.\nThe result of the procedure prescribed by subdivision 4 shall be known as the \"areawide net tax capacity for ........(year) attributable to ..................(municipality).\" The administrative auditor shall certify such product to the auditor of the county in which the municipality is located on or before August 15.",
	"repealed": false
}