{
	"id": "145.986",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.986",
	"title": "145.986 STATEWIDE HEALTH IMPROVEMENT PROGRAM.",
	"text": "The purpose of the statewide health improvement program is to:\n(1) address the leading preventable causes of illness and death such as tobacco use or exposure, poor diet, and lack of regular physical activity, and other issues as determined by the commissioner through the statewide health assessment;\n(2) promote the development, availability, and use of evidence-based, community level, comprehensive strategies to create healthy communities; and\n(3) measure the impact of the evidence-based, community health improvement practices which over time work to contain health care costs and reduce chronic diseases.\n(a) The commissioner of health shall award competitive grants to community health boards and tribal governments to convene, coordinate, and implement proven-effective strategies, promising practice strategies, or theory-based strategies that can be evaluated using experimental or quasi-experimental design. Grants shall be awarded to all community health boards and tribal governments whose proposals demonstrate the ability to implement programs designed to achieve the purposes in subdivision 1 and other requirements of this section. In each grant cycle, the commissioner may award up to 100 percent of tribal grants and up to 25 percent of the grants awarded to community health boards to theory-based strategies that are culturally or ethnically focused.\n(b) Grantee activities shall:\n(1) be based on scientific evidence;\n(2) be based on community input;\n(3) address behavior change at the individual, community, and systems levels;\n(4) occur in community, school, work site, and health care settings;\n(5) be focused on policy, systems, and environmental changes that support healthy behaviors; and\n(6) address the health disparities and inequities that exist in the grantee's community.\n(c) To receive a grant under this section, community health boards and tribal governments must submit proposals to the commissioner. A local match of ten percent of the total funding allocation is required. This local match may include funds donated by community partners.\n(d) In order to receive a grant, community health boards and tribal governments must submit a health improvement plan to the commissioner of health for approval. The commissioner may require the plan to identify a community leadership team, community partners, and a community action plan that includes an assessment of area strengths and needs, proposed action strategies, technical assistance needs, and a staffing plan.\n(e) The grant recipient must implement the health improvement plan, evaluate the effectiveness of the strategies, and modify or discontinue strategies found to be ineffective.\n(f) Grant recipients shall report their activities and their progress toward the outcomes established under subdivision 2 to the commissioner in a format and at a time specified by the commissioner.\n(g) All grant recipients shall be held accountable for making progress toward the measurable outcomes established in subdivision 2. The commissioner shall require a corrective action plan and may reduce the funding level of grant recipients that do not make adequate progress toward the measurable outcomes.\n(h) For purposes of this subdivision, \"proven-effective\" means a strategy or practice that offers a high level of research on effectiveness for at least one outcome of interest; \"promising practice\" means a practice or activity that is supported by research demonstrating effectiveness for at least one outcome of interest; and \"theory-based\" means a strategy or activity that has no research on effectiveness but has a well-constructed logical model or theory of change.\n(a) The commissioner shall set measurable outcomes to meet the goals specified in subdivision 1, and annually review the progress of grant recipients in meeting the outcomes.\n(b) The commissioner shall measure current public health status, using existing measures and data collection systems when available, to determine baseline data against which progress shall be monitored.\n(c) For grants awarded on or after July 1, 2016, the commissioner, in coordination with each grant recipient under section 145.986, must identify:\n(1) each geographic area or population to be targeted;\n(2) the policy, systems, or environmental strategy to be used to address one or more of the health indicators listed in section 62U.10, subdivision 6; and\n(3) the selected outcomes and evaluation measures for the grant, related to one or more of the health indicators listed in section 62U.10, subdivision 6, within the geographic area or among the population targeted.\n(a) The commissioner shall provide content expertise, technical expertise, training to grant recipients, and advice on evidence-based strategies, including those based on populations and types of communities served. The commissioner shall ensure that the statewide health improvement program meets the outcomes established under subdivision 2 by conducting a comprehensive statewide evaluation and assisting grant recipients to modify or discontinue interventions found to be ineffective.\n(b) For the purposes of carrying out the grant program under this section, including for administrative purposes, the commissioner shall award contracts to appropriate entities to assist in training and provide technical assistance to grantees.\n(c) Contracts awarded under paragraph (b) may be used to provide technical assistance and training in the areas of:\n(1) community engagement and capacity building;\n(2) tribal support;\n(3) community asset building and risk behavior reduction;\n(4) legal;\n(5) communications;\n(6) community, school, health care, work site, and other site-specific strategies; and\n(7) health equity.\n(a) Using the outcome measures established in subdivision 3, the commissioner shall conduct a biennial evaluation of the statewide health improvement program grants funded under this section. The evaluation must use the most appropriate experimental or quasi-experimental design suitable for the grant activity or project. Grant recipients shall cooperate with the commissioner in the evaluation and provide the commissioner with the information necessary to conduct the evaluation, including information on any impact on the health indicators listed in section 62U.10, subdivision 6, within the geographic area or among the population targeted.\n(b) Grant recipients will collect, monitor, and submit to the Department of Health baseline and annual data and provide information to improve the quality and impact of community health improvement strategies.\n(c) For the purposes of carrying out the grant program under this section, including for administrative purposes, the commissioner shall award contracts to appropriate entities to assist in designing and implementing evaluation systems. The commissioner shall consult with the commissioner of management and budget to ensure that the evaluation process is using experimental or quasi-experimental design.\n(d) Contracts awarded under paragraph (c) may be used to:\n(1) develop grantee monitoring and reporting systems to track grantee progress, including aggregated and disaggregated data;\n(2) manage, analyze, and report program evaluation data results; and\n(3) utilize innovative support tools to analyze and predict the impact of prevention strategies on health outcomes and state health care costs over time.\n(e) For purposes of this subdivision, \"experimental design\" means a method of evaluating the impact of a strategy that uses random assignment to establish statistically similar groups, so that any difference in outcomes found at the end of the evaluation can be attributed to the strategy being evaluated; and \"quasi-experimental design\" means a method of evaluating the impact of a strategy that uses an approach other than random assignment to establish statistically similar groups, so that any difference in outcomes found at the end of the evaluation can be attributed to the strategy being evaluated.\nThe commissioner shall submit a biennial report to the legislature on the statewide health improvement program funded under this section. The report must include information on each grant recipient, including the activities that were conducted by the grantee using grant funds, the grantee's progress toward achieving the measurable outcomes established under subdivision 2, and the data provided to the commissioner by the grantee to measure these outcomes for grant activities. The commissioner shall provide information on grants in which a corrective action plan was required under subdivision 1a, the types of plan action, and the progress that has been made toward meeting the measurable outcomes. In addition, the commissioner shall provide recommendations on future areas of focus for health improvement. These reports are due by January 15 of every other year, beginning in 2010. In the reports due beginning January 15, 2020, the commissioner shall include a description of the contracts awarded under subdivision 4, paragraph (c), and the monitoring and evaluation systems that were designed and implemented under these contracts.\nCommunity health boards and tribal governments must use funds received under this section to develop new programs, expand current programs, or replace discontinued state or federal funds. Funds must not be used to supplant current state or local funding to community health boards or tribal governments.",
	"repealed": false
}