{
	"id": "201.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/201.12",
	"title": "201.12 PROPER REGISTRATION; VERIFICATION BY MAIL; CHALLENGES.",
	"text": "To prevent fraudulent voting and to eliminate excess names, the county auditor may mail to any registered voter a notice stating the voter's name and address as they appear in the registration files. The notice shall request the voter to notify the county auditor if there is any mistake in the information.\nIf any nonforwardable mailing from an election official is returned as undeliverable but with a permanent forwarding address in this state, the county auditor may change the voter's status to \"inactive\" in the statewide registration system and shall transmit a copy of the mailing to the auditor of the county in which the new address is located. If an election is scheduled to occur in the precinct in which the voter maintains residence in the next 47 days, the county auditor shall promptly update the voter's address in the statewide voter registration system. If there is not an election scheduled, the auditor may wait to update the voter's address until after the next list of address changes is received from the secretary of state. Once updated, the county auditor shall mail to the voter a notice stating the voter's name, address, precinct, and polling place, except that if the voter's record is challenged due to a felony conviction, noncitizenship, name change, incompetence, or a court's revocation of voting rights of individuals under guardianship, the auditor must not mail the notice. The notice must advise the voter that the voter's voting address has been changed and that the voter must notify the county auditor within 21 days if the new address is not the voter's address of residence. The notice must state that it must be returned if it is not deliverable to the voter at the named address.\nIf any nonforwardable mailing from an election official is returned as undeliverable but with a permanent forwarding address outside this state, the county auditor shall promptly mail to the voter at the voter's new address a notice advising the voter that the voter's status in the statewide voter registration system will be changed to \"inactive\" unless the voter notifies the county auditor within 21 days that the voter is retaining the former address as the voter's address of residence. If the voter's record is challenged due to a felony conviction, lack of United States citizenship, legal incompetence, or court-ordered revocation of voting rights of persons under guardianship, the county auditor must not mail this notice. If the notice is not received by the deadline, the county auditor shall change the voter's status to \"inactive\" in the statewide voter registration system.\nIf any nonforwardable mailing from an election official is returned as undeliverable but with no forwarding address, the county auditor shall change the registrant's status to \"challenged\" in the statewide voter registration system. An individual challenged in accordance with this subdivision shall comply with the provisions of section 204C.12, before being allowed to vote. If a notice mailed at least 60 days after the return of the first nonforwardable mailing is also returned by the postal service, the county auditor shall change the registrant's status to \"inactive\" in the statewide voter registration system.",
	"repealed": false
}