{
	"id": "256B.197",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.197",
	"title": "256B.197 INTERGOVERNMENTAL TRANSFERS; INPATIENT HOSPITAL PAYMENTS.",
	"text": "This section is effective for federal fiscal year 2010 and future years contingent on federal approval of the voluntary intergovernmental transfers and payments authorized under this section and contingent on payment of the intergovernmental transfers under this section.\n(a) Hennepin County Medical Center and Regions Hospital are eligible nonstate government hospitals.\n(b) If the commissioner obtains federal approval to include other hospitals, including University of Minnesota Medical Center, Fairview, and SMDC Medical Center, the commissioner may expand the definition of eligible nonstate government hospitals to include other hospitals.\n(a) For the purposes of this subdivision, the commissioner shall determine the fee-for-service inpatient hospital services upper payment limit for nonstate government hospitals. The commissioner shall determine, for each eligible nonstate government hospital, the amount of a supplemental payment for inpatient hospital services that would increase medical assistance spending for each eligible nonstate government hospital up to the amount that Medicare would pay for the Medicaid fee-for-service inpatient hospital services provided by that hospital. If the combined amount of such supplemental payment amounts and existing medical assistance payments for inpatient hospital services to all nonstate government hospitals is less than the upper payment limit, the commissioner shall increase the supplemental payment amount for each eligible nonstate government hospital in proportion to the initial supplemental payments in order to maximize the additional total payments.\n(b) The commissioner shall inform each eligible nonstate government hospital and associated governmental entities of voluntary intergovernmental transfers necessary to provide the nonfederal share for the supplemental payment amount attributable to each eligible nonstate government hospital, as calculated under paragraph (a).\n(c) Upon receipt of a voluntary intergovernmental transfer from a governmental entity associated with an eligible nonstate government hospital or from the eligible nonstate government hospital, the commissioner shall make a supplemental payment, using the amounts calculated under paragraph (a), to the associated eligible nonstate government hospital.\n(d) The commissioner may implement the payments in this section through use of periodic payments and voluntary intergovernmental transfers.\n(e) The commissioner shall inform eligible nonstate government hospitals and associated governmental entities on an ongoing basis of any changes needed in the payment amounts or voluntary intergovernmental transfers in order to continue the payments under paragraph (c) at their maximum level, including increases in upper payment limits, changes in the federal Medicaid match, and other factors.",
	"repealed": false
}