{
	"id": "115.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/115.71",
	"title": "115.71 DEFINITIONS.",
	"text": "As used in sections 115.71 to 115.77, the terms defined in this section have the meanings given them.\n[Repealed, 1995 c 180 s 16]\n[Repealed, 1995 c 180 s 16]\n[Repealed, 1995 c 180 s 16]\nMS 2018 [Repealed, 2020 c 83 art 1 s 103]\n\"Population equivalent\" means a number determined by dividing a daily pound load of five-day, 20-degree-centigrade carbonaceous biochemical oxygen demand (CBOD) of raw sewage by 0.17.\nMS 1990 [Renumbered subd 9]\n\"Wastewater certificate\" means a certificate of competency issued by the commissioner of the Pollution Control Agency stating that the wastewater treatment facility operator has met the requirements for the specified operator classification of the certification program.\nMS 1990 [Renumbered subd 5]\n\"Wastewater treatment facility\" means any plant, disposal field, lagoon, or other works not specifically mentioned herein, installed for the purpose of collecting, pumping, treating, stabilizing or disposing of sewage, as defined in section 115.01, subdivision 17, which is actually used or intended for use by the public or by any considerable number of persons.\n[Repealed, 1991 c 202 s 42]\nMS 1990 [Renumbered subd 6]\n\"Wastewater treatment facility operator\" means a person who has direct responsibility for the operation of or operates a wastewater treatment facility.\nMS 1991 Supp [Renumbered subd 10]\n\"Water certificate\" means a certificate of competency issued by the commissioner of health stating that the water supply system operator has met the requirements for the specified operator classification of the certification program.\n\"Water supply system\" means a community or nontransient noncommunity water system as defined in Code of Federal Regulations, title 40, section 141.2, as amended.\nMS 1990 [Renumbered subd 8]\n\"Water supply system operator\" means a person who has direct responsibility for the operation of or operates a water supply system or such parts of the system as would affect the quality and safety of the water.",
	"repealed": false
}