{
	"id": "353.651",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.651",
	"title": "353.651 RETIREMENT ANNUITY UPON SEPARATION FROM PUBLIC SERVICE.",
	"text": "Upon separation from public service, any police officer or firefighter member, other than a firefighter covered by section 353.6511, or a police officer covered by section 353.6512, who has attained the age of at least 55 years and who is partially or 100 percent vested under section 353.01, subdivision 47, is entitled upon application to a retirement annuity, known as the normal retirement annuity.\n[Repealed, 1Sp2005 c 8 art 1 s 32]\n(a) The average salary as defined in section 353.01, subdivision 17a, multiplied by 3.0 percent, multiplied by years of allowable service, multiplied by the applicable vesting percentage indicated in section 353.01, subdivision 47, determines the amount of the normal retirement annuity. If the member has earned allowable service for performing services other than those of a police officer or firefighter, the annuity representing that service must be computed under sections 353.29 and 353.30.\n(b) For a member first enrolled in the public employees police and fire retirement plan after June 30, 2014, the average salary as defined in section 353.01, subdivision 17a, paragraph (a), includes salary for all years for which contributions have been reported to the public employees police and fire retirement plan, but allowable service included in the calculation is limited to 33 years and the normal retirement annuity must not exceed 99 percent of the average salary.\n(c) When the annuity begins for members of the public employees police and fire retirement plan enrolled after June 30, 2014, a prorated share of the contributions for allowable service exceeding 33 years must be refunded to the member. The prorated share of the contributions to be refunded is determined by multiplying the accumulated deductions paid by the member to the public employees police and fire retirement plan by a percentage determined using the number of months of service in excess of 396 as the numerator and the total number of months of allowable service on which contributions were reported as the denominator. Interest as defined in section 353.34, subdivision 2, is to be applied to the prorated share of contributions from the first of the 397th month of allowable service reported to the public employees police and fire retirement plan to the first of the month the annuity begins.\n(a) A person who becomes a public employees police and fire retirement plan member after June 30, 2007, or a former member who is reinstated as a member of the plan after that date, who is at least 50 years of age and is at least partially vested under section 353.01, subdivision 47, upon the termination of public employees police and fire retirement plan membership before July 1, 2014, is entitled upon application to a retirement annuity equal to the normal annuity calculated under subdivision 3, reduced by two-tenths of one percent for each month that the member is under age 55 at the time of retirement.\n(b) Upon the termination of public employees police and fire retirement plan membership before July 1, 2014, any public employees police and fire retirement plan member who first became a member of the plan before July 1, 2007, and who is not specified in paragraph (a), upon attaining at least 50 years of age with at least three years of allowable service is entitled upon application to a retirement annuity equal to the normal annuity calculated under subdivision 3, reduced by one-tenth of one percent for each month that the member is under age 55 at the time of retirement.\n(c) A person who is a member of the public employees police and fire retirement plan on or after July 1, 2014, and who is at least 50 years old and is at least partially vested under section 353.01, subdivision 47, and whose benefit effective date is after July 1, 2014, and on or before July 1, 2019, is entitled upon application to a retirement annuity equal to the normal annuity calculated under subdivision 3, reduced for each month the member is under age 55 at the time of retirement by applying a blended monthly rate that is equivalent to the sum of:\n(1) one-sixtieth of the annual rate of five percent, prorated for each month the person's benefit effective date is after July 1, 2014; and\n(2) one-sixtieth of the annual rate provided under paragraph (a) or (b), whichever applies, for each month the person's benefit effective date is before July 1, 2019.\n(d) A person who is a member of the public employees police and fire retirement plan on or after July 1, 2014, and who is at least 50 years old and is at least partially vested under section 353.01, subdivision 47, whose benefit effective date is after July 1, 2019, is entitled, upon application, to a retirement annuity equal to the normal annuity calculated under subdivision 3, reduced by five percent annually, prorated for each month that the member is under age 55.\nAn annuity under this section is eligible for postretirement adjustments under section 356.415.",
	"repealed": false
}