{
	"id": "295.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.81",
	"title": "295.81 CANNABIS GROSS RECEIPTS TAX.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Bundled transaction\" means the retail sale of two or more products when the products are otherwise distinct and identifiable and the products are sold for one nonitemized price.\n(c) \"Cannabis flower\" has the meaning given in section 342.01, subdivision 16.\n(d) \"Cannabis product\" has the meaning given in section 342.01, subdivision 20.\n(e) \"Cannabis solution product\" means any cartridge, bottle, or other package that contains a taxable cannabis product in a solution that is consumed or meant to be consumed through the use of a heating element, power source, electronic circuit, or other electronic, chemical, or mechanical means that produces vapor or aerosol. A cannabis solution product includes any electronic delivery system, electronic vaping device, electronic vape pen, electronic oral device, electronic delivery device, or similar product or device, and any batteries, heating elements, or other components, parts, or accessories sold with and meant to be used in the consumption of a solution containing a taxable cannabis product.\n(f) \"Cannabis mezzobusiness\" means a cannabis business licensed under section 342.29.\n(g) \"Cannabis microbusiness\" means a cannabis business licensed under section 342.28.\n(h) \"Cannabis retailer\" means a cannabis business licensed under section 342.32.\n(i) \"Commissioner\" means the commissioner of revenue.\n(j) \"Gross receipts\" means the total amount received in money or by barter or exchange for all taxable cannabis product sales at retail as measured by the sales price. Gross receipts include but are not limited to delivery charges and packaging costs. Gross receipts do not include:\n(1) any taxes imposed directly on the customer that are separately stated on the invoice, bill of sale, or similar document given to the purchaser; and\n(2) discounts, including cash, terms, or coupons, that are not reimbursed by a third party and that are allowed by the seller and taken by a purchaser on a sale.\n(k) \"Hemp-derived consumer product\" has the meaning given in section 342.01, subdivision 37.\n(l) \"Lower-potency hemp edible\" has the meaning given in section 342.01, subdivision 50.\n(m) \"Lower-potency hemp edible retailer\" means a cannabis business licensed under section 342.43, subdivision 1, clause (2).\n(n) \"Medical cannabis flower\" has the meaning given in section 342.01, subdivision 54.\n(o) \"Medical cannabinoid product\" has the meaning given in section 342.01, subdivision 52.\n(p) \"Medical cannabis paraphernalia\" has the meaning given in section 342.01, subdivision 55.\n(q) \"Retail sale\" has the meaning given in section 297A.61, subdivision 4.\n(r) \"Taxable cannabis product\" means cannabis flower, cannabis product, cannabis solution product, hemp-derived consumer product, lower-potency hemp edible, and any substantially similar item.\n(s) \"Taxable cannabis product retailer\" means a retailer that sells any taxable cannabis product, and includes a cannabis retailer, cannabis microbusiness, cannabis mezzobusiness, medical cannabis combination business, and lower-potency hemp edible retailer. Taxable cannabis product retailer includes but is not limited to a:\n(1) retailer maintaining a place of business in this state;\n(2) marketplace provider maintaining a place of business in this state, as defined in section 297A.66, subdivision 1, paragraph (a);\n(3) retailer not maintaining a place of business in this state; and\n(4) marketplace provider not maintaining a place of business in this state, as defined in section 297A.66, subdivision 1, paragraph (b).\n(a) A tax equal to ten percent of gross receipts from retail sales in Minnesota of taxable cannabis products is imposed on any taxable cannabis product retailer that sells these products to customers. A taxable cannabis product retailer may but is not required to collect the tax imposed by this section from the purchaser as long as the tax is separately stated on the receipt, invoice, bill of sale, or similar document given to the purchaser.\n(b) If a product subject to the tax imposed under this section is included in a bundled transaction, the entire sales price of the bundled transaction is subject to the tax imposed under this section.\n(c) The tax imposed under this section is in addition to any other tax imposed on the sale or use of taxable cannabis products.\n(a) A person that receives taxable cannabis products for use or storage in Minnesota, other than from a taxable cannabis product retailer that paid the tax under subdivision 2, is subject to tax at the rate imposed under subdivision 2. Liability for the tax is incurred when the person has possession of the taxable cannabis product in Minnesota. The tax must be remitted to the commissioner in the same manner prescribed for taxes imposed under chapter 297A.\n(b) A person that has paid taxes to another state or any subdivision thereof on the same transaction and is subject to tax under this section is entitled to a credit for the tax legally due and paid to another state or subdivision thereof to the extent of the lesser of (1) the tax actually paid to the other state or subdivision thereof, or (2) the amount of tax imposed by Minnesota on the transaction subject to tax in the other state or subdivision thereof.\n(a) The use tax imposed under subdivision 3, paragraph (a), does not apply to the possession, use, or storage of taxable cannabis products if (1) the taxable cannabis products have an aggregate cost in any calendar month to the customer of $100 or less, and (2) the taxable cannabis products were carried into this state by the customer.\n(b) The tax imposed under this section does not apply to sales of medical items purchased by or for a patient enrolled in the registry program, including medical cannabis flower, medical cannabinoid products, or medical cannabis paraphernalia.\n(c) Unless otherwise specified in this section, the exemptions applicable to taxes imposed under chapter 297A are not applicable to the taxes imposed under this section.\n(d) The tax imposed under this section does not apply to:\n(1) sales made on Tribally regulated land as defined in section 3.9228, subdivision 1, by a cannabis business licensed by a Minnesota Tribal government, as defined in section 3.9228, subdivision 1, paragraph (f); or\n(2) use tax owed on taxable cannabis products purchased on Tribally regulated land as defined in section 3.9228, subdivision 1, from a cannabis business licensed by a Minnesota Tribal government as defined in section 3.9228, subdivision 1, paragraph (f).\nA taxable cannabis product retailer with nexus in Minnesota that is not subject to tax under subdivision 2 is required to collect the tax imposed under subdivision 3 from the purchaser of the taxable cannabis product and give the purchaser a receipt for the tax paid. The tax collected must be remitted to the commissioner in the same manner prescribed for the taxes imposed under chapter 297A.\nA taxable cannabis product retailer that has paid taxes to another state or any subdivision thereof measured by gross receipts and is subject to tax under this section on the same gross receipts is entitled to a credit for the tax legally due and paid to another state or any subdivision thereof to the extent of the lesser of (1) the tax actually paid to the other state or any subdivision thereof, or (2) the amount of tax imposed by Minnesota on the gross receipts subject to tax in the other taxing state or any subdivision thereof.\nSection 297A.668 applies to the taxes imposed by this section.\nUnless specifically provided otherwise, the audit, assessment, refund, penalty, interest, enforcement, collection remedies, appeal, and administrative provisions of chapters 270C and 289A that are applicable to taxes imposed under chapter 297A, except the requirement to file returns and remit taxes due electronically if authorized under section 289A.33, apply to the tax imposed under this section.\n(a) A taxable cannabis product retailer must report the tax on a return prescribed by the commissioner and must remit the tax in a form and manner prescribed by the commissioner. The return and the tax must be filed and paid using the filing cycle and due dates provided for taxes imposed under section 289A.20, subdivision 4, and chapter 297A.\n(b) Interest must be paid on an overpayment refunded or credited to the taxpayer from the date of payment of the tax until the date the refund is paid or credited. For purposes of this subdivision, the date of payment is the due date of the return or the date of actual payment of the tax, whichever is later.\n(a) The commissioner must deposit the revenues, including penalties and interest, derived from the tax imposed by this section as follows:\n(1) 80 percent to the general fund; and\n(2) 20 percent to the local government cannabis aid account in the special revenue fund.\n(b) The local government cannabis aid account is established in the special revenue fund.\nThe tax imposed by this section, and interest and penalties imposed with respect to it, are a personal debt of the person required to file a return from the time that the liability for it arises, irrespective of when the time for payment of the liability occurs. The debt must, in the case of the executor or administrator of the estate of a decedent and in the case of a fiduciary, be that of the person in the person's official or fiduciary capacity only, unless the person has voluntarily distributed the assets held in that capacity without reserving sufficient assets to pay the tax, interest, and penalties, in which event the person is personally liable for any deficiency.",
	"repealed": false
}