{
	"id": "245D.071",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.071",
	"title": "245D.071 SERVICE PLANNING AND DELIVERY; INTENSIVE SUPPORT SERVICES.",
	"text": "Except for services identified in section 245D.03, subdivision 1, paragraph (c), clauses (1) and (2), item (ii), a license holder providing intensive support services identified in section 245D.03, subdivision 1, paragraph (c), must comply with the requirements in this section and section 245D.07, subdivisions 1, 1a, and 3. Services identified in section 245D.03, subdivision 1, paragraph (c), clauses (1) and (2), item (ii), must comply with the requirements in section 245D.07, subdivision 2.\nPrior to or upon initiating services, the license holder must develop, document, and implement an abuse prevention plan according to section 245A.65, subdivision 2.\n(a) Within 15 days of service initiation the license holder must complete a preliminary support plan addendum based on the support plan.\n(b) Within the scope of services, the license holder must, at a minimum, complete assessments in the following areas before providing 45 days of service or within 60 calendar days of service initiation, whichever is shorter:\n(1) the person's ability to self-manage health and medical needs to maintain or improve physical, mental, and emotional well-being, including, when applicable, allergies, seizures, choking, special dietary needs, chronic medical conditions, self-administration of medication or treatment orders, preventative screening, and medical and dental appointments;\n(2) the person's ability to self-manage personal safety to avoid injury or accident in the service setting, including, when applicable, risk of falling, mobility, regulating water temperature, community survival skills, water safety skills, and sensory disabilities; and\n(3) the person's ability to self-manage symptoms or behavior that may otherwise result in an incident as defined in section 245D.02, subdivision 11, clauses (4) to (7), suspension or termination of services by the license holder, or other symptoms or behaviors that may jeopardize the health and welfare of the person or others.\nAssessments must produce information about the person that describes the person's overall strengths, functional skills and abilities, and behaviors or symptoms. Assessments must be based on the person's status within the last 12 months at the time of service initiation. Assessments based on older information must be documented and justified. Assessments must be conducted annually at a minimum or within 30 days of a written request from the person or the person's legal representative or case manager. The results must be reviewed by the support team or expanded support team as part of a service plan review.\n(c) Before providing 45 days of service or within 60 calendar days of service initiation, whichever is shorter, the license holder must hold an initial planning meeting with the person, the person's legal representative, the case manager, other members of the support team or expanded support team, and other people as identified by the person or the person's legal representative to determine the following based on information obtained from the assessments identified in paragraph (b), the person's identified needs in the support plan, and the requirements in subdivision 4 and section 245D.07, subdivision 1a:\n(1) the scope of the services to be provided to support the person's daily needs and activities;\n(2) the person's desired outcomes and the supports necessary to accomplish the person's desired outcomes;\n(3) the person's preferences for how services and supports are provided, including how the provider will support the person to have control of the person's schedule;\n(4) whether the current service setting is the most integrated setting available and appropriate for the person;\n(5) opportunities to develop and maintain essential and life-enriching skills, abilities, strengths, interests, and preferences;\n(6) opportunities for community access, participation, and inclusion in preferred community activities;\n(7) opportunities to develop and strengthen personal relationships with other persons of the person's choice in the community;\n(8) opportunities to seek competitive employment and work at competitively paying jobs in the community; and\n(9) how services must be coordinated across other providers licensed under this chapter serving the person and members of the support team or expanded support team to ensure continuity of care and coordination of services for the person.\n(d) A discussion of how technology might be used to meet the person's desired outcomes must be included in the initial planning meeting. The support plan or support plan addendum must include a summary of this discussion. The summary must include a statement regarding any decision that is made regarding the use of technology and a description of any further research that needs to be completed before a decision regarding the use of technology can be made. Nothing in this paragraph requires that the support plan include the use of technology for the provision of services.\n(a) Within ten working days of the initial planning meeting, the license holder must develop a service plan that documents the service outcomes and supports based on the assessments completed under subdivision 3 and the requirements in section 245D.07, subdivision 1a. The outcomes and supports must be included in the support plan addendum.\n(b) The license holder must document the supports and methods to be implemented to support the person and accomplish outcomes related to acquiring, retaining, or improving skills and physical, mental, and emotional health and well-being. The documentation must include:\n(1) the methods or actions that will be used to support the person and to accomplish the service outcomes, including information about:\n(i) any changes or modifications to the physical and social environments necessary when the service supports are provided;\n(ii) any equipment and materials required; and\n(iii) techniques that are consistent with the person's communication mode and learning style;\n(2) the measurable and observable criteria for identifying when the desired outcome has been achieved and how data will be collected;\n(3) the projected starting date for implementing the supports and methods and the date by which progress towards accomplishing the outcomes will be reviewed and evaluated; and\n(4) the names of the staff or position responsible for implementing the supports and methods.\n(c) Within 20 working days of the initial planning meeting, the license holder must submit to and obtain dated signatures from the person or the person's legal representative and case manager to document completion and approval of the assessment and support plan addendum. If, within ten working days of the submission of the assessment or support plan addendum, the person or the person's legal representative or case manager has not signed and returned to the license holder the assessment and support plan addendum or has not proposed written modifications to the license holder's submission, the submission is deemed approved and the assessment and support plan addendum become effective and remain in effect until the legal representative or case manager submits a written request to revise the assessment or support plan addendum.\n(a) The license holder must give the person or the person's legal representative, case manager, and other people as identified by the person or the person's legal representative, an opportunity to participate in the ongoing review and development of the service plan and the methods used to support the person and accomplish outcomes identified in subdivisions 3 and 4. At least once per year, or within 30 days of a written request by the person, the person's legal representative, or the case manager, the license holder, in coordination with the person's support team or expanded support team, must meet with the person, the person's legal representative, the case manager, and other people as identified by the person or the person's legal representative, and participate in service plan review meetings following stated timelines established in the person's support plan or support plan addendum. The purpose of the service plan review is to determine whether changes are needed to the service plan based on the assessment information, the license holder's evaluation of progress toward accomplishing outcomes, or other information provided by the support team or expanded support team.\n(b) At least once per year, the license holder, in coordination with the person's support team or expanded support team, must meet with the person, the person's legal representative, the case manager, and other people as identified by the person or the person's legal representative to discuss how technology might be used to meet the person's desired outcomes. The support plan addendum must include a summary of this discussion. The summary must include a statement regarding any decision made related to the use of technology and a description of any further research that must be completed before a decision regarding the use of technology can be made. Nothing in this paragraph requires the support plan addendum to include the use of technology for the provision of services.\n(c) At least once per year, the license holder, in coordination with the person's support team or expanded support team, must meet with a person receiving residential supports and services, the person's legal representative, the case manager, and other people as identified by the person or the person's legal representative to discuss options for transitioning out of a community setting controlled by a provider and into a setting not controlled by a provider.\n(d) The support plan addendum must include a summary of the discussion required in paragraph (c). The summary must include a statement about any decision made regarding transitioning out of a provider-controlled setting and a description of any further research or education that must be completed before a decision regarding transitioning out of a provider-controlled setting can be made.\n(e) At least once per year, the license holder, in coordination with the person's support team or expanded support team, must meet with a person receiving day services, the person's legal representative, the case manager, and other people as identified by the person or the person's legal representative to discuss options for transitioning to an employment service described in section 245D.03, subdivision 1, paragraph (c), clauses (5) to (7).\n(f) The support plan addendum must include a summary of the discussion required in paragraph (e). The summary must include a statement about any decision made concerning transition to an employment service and a description of any further research or education that must be completed before a decision regarding transitioning to an employment service can be made.\n(g) The license holder must summarize the person's status and progress toward achieving the identified outcomes and make recommendations and identify the rationale for changing, continuing, or discontinuing implementation of supports and methods identified in subdivision 4 in a report available at the time of the progress review meeting. The report must be sent at least five working days prior to the progress review meeting if requested by the team in the support plan or support plan addendum.\n(h) The license holder must send the support plan addendum to the person, the person's legal representative, and the case manager by mail within ten working days of the progress review meeting. Within ten working days of the mailing of the support plan addendum, the license holder must obtain dated signatures from the person or the person's legal representative and the case manager to document approval of any changes to the support plan addendum.\n(i) If, within ten working days of submitting changes to the support plan and support plan addendum, the person or the person's legal representative or case manager has not signed and returned to the license holder the support plan or support plan addendum or has not proposed written modifications to the license holder's submission, the submission is deemed approved and the support plan addendum becomes effective and remains in effect until the legal representative or case manager submits a written request to revise the support plan addendum.",
	"repealed": false
}