{
	"id": "216B.1691",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1691",
	"title": "216B.1691 RENEWABLE ENERGY OBJECTIVES.",
	"text": "(a) For purposes of this section, the following terms have the meaning given them.\n(b) \"Carbon-free\" means a technology that generates electricity without emitting carbon dioxide.\n(c) Unless otherwise specified in law, \"eligible energy technology\" means an energy technology that generates electricity from the following renewable energy sources:\n(1) solar;\n(2) wind;\n(3) hydroelectric with a capacity of: (i) less than 100 megawatts; or (ii) 100 megawatts or more, provided that the facility is in operation as of February 8, 2023;\n(4) hydrogen generated from the resources listed in this paragraph; or\n(5) biomass, which includes, without limitation, landfill gas; an anaerobic digester system; the predominantly organic components of wastewater effluent, sludge, or related by-products from publicly owned treatment works, but not including incineration of wastewater sludge to produce electricity; and, except as provided in subdivision 1a, an energy recovery facility used to capture the heat value of mixed municipal solid waste or refuse-derived fuel from mixed municipal solid waste as a primary fuel.\n(d) \"Electric utility\" means: (1) a public utility providing electric service; (2) a generation and transmission cooperative electric association; (3) a municipal power agency; (4) a power district; or (5) a cooperative electric association or municipal utility providing electric service that is not a member of an entity in clauses (2) to (4).\n(e) \"Environmental justice area\" means an area in Minnesota that, based on the most recent data published by the United States Census Bureau, meets one or more of the following criteria:\n(1) 40 percent or more of the area's total population is nonwhite;\n(2) 35 percent or more of households in the area have an income that is at or below 200 percent of the federal poverty level;\n(3) 40 percent or more of the area's residents over the age of five have limited English proficiency; or\n(4) the area is located within Indian country, as defined in United State Code, title 18, section 1151.\n(f) \"Total retail electric sales\" means the kilowatt-hours of electricity sold in a year by an electric utility to retail customers of the electric utility or to a distribution utility for distribution to the retail customers of the distribution utility.\nAn energy recovery facility used to capture the heat value of mixed municipal solid waste or refuse-derived fuel from mixed municipal solid waste as a primary fuel is not an eligible energy technology, as defined in subdivision 1, if the energy recovery facility is located in a county with a population density that exceeds 1,500 persons per square mile but is less than 2,500 persons per square mile as of February 8, 2023.\nMS 2022 [Repealed, 2023 c 7 s 33]\nEach electric utility shall generate or procure sufficient electricity generated by an eligible energy technology to provide its retail customers in Minnesota, or the retail customers of a distribution utility to which the electric utility provides wholesale electric service, so that the electric utility generates or procures an amount of electricity from an eligible energy technology that is equivalent to at least the following standard percentages of the electric utility's total retail electric sales to retail customers in Minnesota by the end of the year indicated:\n(a) The commission shall modify or delay the implementation of a standard obligation under subdivision 2a, 2f, or 2g, in whole or in part, if the commission determines that modifying or delaying the standard obligation is in the public interest. The commission, when evaluating a request to modify or delay implementation of a standard, must consider:\n(1) the impact of implementing the standard on its customers' utility costs, including the economic and competitive pressure on the utility's customers;\n(2) the environmental costs that would be incurred as a result of a delay or modification, based on the full range of environmental cost values established in section 216B.2422, subdivision 3;\n(3) the effects of implementing the standard on the reliability of the electric system;\n(4) technical advances or technical concerns;\n(5) delays in acquiring sites or routes due to rejection or delays of necessary siting or other permitting approvals;\n(6) delays, cancellations, or nondelivery of necessary equipment for construction or commercial operation of an eligible energy technology facility;\n(7) transmission constraints preventing delivery of service;\n(8) other statutory obligations imposed on the commission or a utility;\n(9) impacts on environmental justice areas; and\n(10) additional electric load from beneficial electrification and the greenhouse gas emissions savings associated with those loads as compared to serving the load with nonelectric energy sources.\nFor the purposes of this paragraph, \"beneficial electrification\" means the substitution of electricity for a fossil fuel, provided that the substitution meets at least one of the following conditions without adversely affecting either of the other two, as determined by the commission:\n(i) saves a consumer money over the long run compared with continued use of the fossil fuel;\n(ii) enables an electric utility to better manage the electric utility's electric grid network; or\n(iii) reduces negative environmental impacts of fuel use, including but not limited to statewide greenhouse gas emissions.\n(b) The commission may modify or delay implementation of a standard obligation under paragraph (a), clauses (1) to (4), only if it finds implementation would cause significant rate impact, requires significant measures to address reliability, or raises significant technical issues. The commission may modify or delay implementation of a standard obligation under paragraph (a), clauses (5) to (7), only if it finds that the circumstances described in those clauses were due to circumstances beyond an electric utility's control and make compliance not feasible.\n(c) When evaluating transmission capacity constraints under paragraph (a), clause (7), the commission must consider whether the utility has:\n(1) taken reasonable measures that are under the utility's control and consistent with the utility's obligations under local, state, and federal laws and regulations, and the utility's obligations as a member of a regional transmission organization or independent system operator, to acquire sites, necessary permit approvals, and necessary equipment to develop and construct new transmission lines or upgrade existing transmission lines to transmit electricity generated by eligible energy technologies; and\n(2) taken all reasonable operational measures to maximize cost-effective electricity delivery from eligible energy technologies in advance of transmission availability.\n(d) When considering whether to delay or modify implementation of a standard obligation, the commission must give due consideration to a preference for electric generation through use of eligible energy technology and to the achievement of the standards set by this section.\n(e) An electric utility that requests a modification or delay to the implementation of a standard must file a plan to comply with the electric utility's standard obligation as part of the same proceeding in which the electric utility requests the modification or delay.\nThe commission may exercise its authority under subdivision 2b to modify or delay implementation of a standard obligation as part of an integrated resource planning proceeding under section 216B.2422. The commission's authority must be exercised according to subdivision 2b. The order to delay or modify shall not be considered advisory with respect to any electric utility. This subdivision is in addition to and does not limit the commission's authority to modify or delay implementation of a standard obligation in other proceedings before the commission.\n(a) The commission shall issue necessary orders detailing the criteria and standards used to: (1) measure an electric utility's efforts to meet the standards under subdivisions 2a, 2f, and 2g; and (2) determine whether the utility is achieving the standards.\n(b) In the order under paragraph (a), the commission shall include criteria and standards that: (1) protect against undesirable impacts on the reliability of the utility's system and economic impacts on the utility's ratepayers and that consider technical feasibility; and (2) require the commission to allow for partial compliance with subdivision 2g from:\n(i) electricity generated from facilities that utilize carbon-free technologies for electricity generation, but only for the percentage that is carbon-free; and\n(ii) an electric utility's annual purchases from a regional transmission organization net of the electric utility's sales to the regional transmission organization, but only for the percentage of annual net purchases that is carbon-free, which percentage the commission must calculate based on the regional transmission organization's systemwide annual fuel mix or an applicable subregional fuel mix.\nEach electric utility must submit to the commission and the legislative committees with primary jurisdiction over energy policy a report containing an estimation of the rate impact of activities of the electric utility necessary to comply with this section. In consultation with the Department of Commerce, the commission shall determine a uniform reporting system to ensure that individual utility reports are consistent and comparable, and shall, by order, require each electric utility subject to this section to use that reporting system. The rate impact estimate must be for wholesale rates and, if the electric utility makes retail sales, the estimate shall also be for the impact on the electric utility's retail rates. Those activities include, without limitation, energy purchases, generation facility acquisition and construction, and transmission improvements. A report must be updated and submitted as part of each integrated resource plan or plan modification filed by the electric utility under section 216B.2422. The reporting obligation of an electric utility under this subdivision expires December 31, 2040.\n(a) In addition to the requirements of subdivisions 2a and 2g, each public utility shall generate or procure sufficient electricity generated by solar energy to serve its retail electricity customers in Minnesota so that by the end of 2020, at least 1.5 percent of the utility's total retail electric sales to retail customers in Minnesota is generated by solar energy.\n(b) For a public utility with more than 200,000 retail electric customers, at least ten percent of the 1.5 percent goal must be met by solar energy generated by or procured from solar photovoltaic devices with a nameplate capacity of 40 kilowatts or less.\n(c) A public utility with between 50,000 and 200,000 retail electric customers:\n(1) must meet at least ten percent of the 1.5 percent goal with solar energy generated by or procured from solar photovoltaic devices with a nameplate capacity of 40 kilowatts or less; and\n(2) may apply toward the ten percent goal in clause (1) individual customer subscriptions of 40 kilowatts or less to a community solar garden program operated by the public utility that has been approved by the commission.\n(d) The solar energy standard established in this subdivision is subject to all the provisions of this section governing a utility's standard obligation under subdivision 2a.\n(e) It is an energy goal of the state of Minnesota that, by 2030, ten percent of the retail electric sales in Minnesota be generated by solar energy.\n(f) For the purposes of calculating the total retail electric sales of a public utility under this subdivision, there shall be excluded retail electric sales to customers that are:\n(1) an iron mining extraction and processing facility, including a scram mining facility as defined in Minnesota Rules, part 6130.0100, subpart 16; or\n(2) a paper mill, wood products manufacturer, sawmill, or oriented strand board manufacturer.\nThose customers may not have included in the rates charged to them by the public utility any costs of satisfying the solar standard specified by this subdivision.\n(g) A public utility may not use energy used to satisfy the solar energy standard under this subdivision to satisfy its standard obligation under subdivision 2a. A public utility may not use energy used to satisfy the standard obligation under subdivision 2a to satisfy the solar standard under this subdivision.\n(h) Notwithstanding any law to the contrary, a solar renewable energy credit associated with a solar photovoltaic device installed and generating electricity in Minnesota after August 1, 2013, but before 2020 may be used to meet the solar energy standard established under this subdivision.\nIn addition to the requirements under subdivisions 2a and 2f, each electric utility must generate or procure sufficient electricity generated from a carbon-free energy technology to provide the electric utility's retail customers in Minnesota, or the retail customers of a distribution utility to which the electric utility provides wholesale electric service, so that the electric utility generates or procures an amount of electricity from carbon-free energy technologies that is equivalent to at least the following standard percentages of the electric utility's total retail electric sales to retail customers in Minnesota by the end of the year indicated:\n(a) For the purposes of this subdivision, the following terms have the meanings given:\n(1) \"capacity\" has the meaning given in section 216B.164, subdivision 2a;\n(2) \"industrial customer\" means a retail electricity customer:\n(i) whose numerical classification under the North American Industry Classification System begins with the numbers 31, 32, or 33;\n(ii) that is a pipeline, as defined in section 216G.01, subdivision 3; or\n(iii) that is an iron mining extraction and processing facility, including a scram mining facility, as defined in Minnesota Rules, part 6130.0100, subpart 16; and\n(3) \"solar energy generating system\" has the meaning given in section 216E.01, subdivision 9a.\n(b) In addition to the other requirements of this section, by the end of 2030, the following proportions of a public utility's total retail electric sales in Minnesota must be generated from solar energy generating systems:\n(1) for a public utility with at least 200,000 retail electric customers in Minnesota, at least three percent;\n(2) for a public utility with at least 100,000 but fewer than 200,000 retail electric customers in Minnesota, at least three percent; and\n(3) for a public utility with fewer than 100,000 retail electric customers in Minnesota, at least one percent.\nFor a public utility subject to clause (2) or (3), sales to industrial customers in Minnesota must be subtracted from the utility's total retail electric sales for the purpose of calculating total retail electric sales in Minnesota.\n(c) To be counted toward a public utility's standard established in paragraph (a), a solar energy generating system must:\n(1) have a capacity of ten megawatts or less;\n(2) be connected to the public utility's distribution system;\n(3) be located in the Minnesota service territory of the public utility; and\n(4) be constructed or procured after August 1, 2023.\n(d) A solar energy generating system with a capacity of 100 kilowatts or more does not count toward compliance with the standard established in paragraph (a) unless the public utility verifies that construction trades workers who constructed the solar energy generating system were all paid no less than the prevailing wage rate, as defined in section 177.42, and whose employer participated in an apprenticeship program that is registered under chapter 178 or Code of Federal Regulations, title 29, part 29.\n(e) A public utility shall select projects to satisfy the standard established under this subdivision through a competitive bidding process approved by the commission.\n(f) The commission may modify or delay the implementation of the standard established under this subdivision in accordance with the provisions of subdivision 2b.\n(a) Each electric utility shall report on its plans, activities, and progress with regard to the standard obligations under this section in its filings under section 216B.2422 or in a separate report submitted to the commission every two years, whichever is more frequent, demonstrating to the commission the utility's effort to comply with this section. In its resource plan or a separate report, each electric utility shall provide a description of:\n(1) the status of the utility's renewable energy mix relative to the standard obligations;\n(2) efforts taken to meet the standard obligations;\n(3) any obstacles encountered or anticipated in meeting the standard obligations;\n(4) potential solutions to the obstacles;\n(5) the number of Minnesotans employed to construct facilities designed to meet the utility's standard obligations under this section;\n(6) efforts taken to retain and retrain workers employed at electric generating facilities that the utility has ceased operating or designated to cease operating for new positions constructing or operating facilities used to meet a utility's standard obligation;\n(7) the impacts of facilities designed to meet the utility's standard obligations under this section on environmental justice areas;\n(8) efforts made to increase the diversity of both the utility's workforce and vendors; and\n(9) for an electric utility utilizing renewable energy credits to satisfy any portion of the electric utility's obligations under this section, the following information:\n(i) the name and location of energy facilities that generated the energy associated with the credits;\n(ii) the dates when the energy associated with the credits was generated;\n(iii) the type of fuel that generated the energy associated with the credits; and\n(iv) whether the energy associated with the credits was purchased by the utility purchasing the credits.\n(b) The commissioner shall compile the information provided to the commission under paragraph (a), and report to the chairs of the house of representatives and senate committees with jurisdiction over energy and environment policy issues as to the progress of utilities in the state, including the progress of each individual electric utility, in increasing the amount of renewable energy provided to retail customers, with any recommendations for regulatory or legislative action, by January 15 of each odd-numbered year.\n(a) To facilitate compliance with this section, the commission, by rule or order, shall establish by January 1, 2008, a program for tradable renewable energy credits for electricity generated by eligible energy technology. The credits must represent energy produced by an eligible energy technology, as defined in subdivision 1. Each kilowatt-hour of renewable energy credits must be treated the same as a kilowatt-hour of eligible energy technology generated or procured by an electric utility if it is produced by an eligible energy technology. The program must permit a credit to be used only once, except that a credit may be used to satisfy both the carbon-free energy standard obligation under subdivision 2g and either the renewable energy standard obligation under subdivision 2a or the solar energy standard obligation under subdivision 2f, if the credit meets the requirements of each subdivision. The program must treat all eligible energy technology equally and shall not give more or less credit to energy based on the state where the energy was generated or the technology with which the energy was generated. The commission must determine the period in which the credits may be used for purposes of the program.\n(b) In lieu of generating or procuring energy directly to satisfy a standard obligation under subdivision 2a, 2f, or 2g, an electric utility may utilize renewable energy credits allowed under the program to satisfy the standard.\n(c) The commission shall facilitate the trading of renewable energy credits between states.\n(d) The commission shall require all electric utilities to participate in a commission-approved credit-tracking system or systems. Once a credit-tracking system is in operation, the commission shall issue an order establishing protocols for trading credits.\n(a) Electricity produced by fuel combustion through fuel blending or co-firing under paragraph (b) may only count toward a utility's standard obligation under subdivision 2a if the generation facility:\n(1) was constructed in compliance with new source performance standards promulgated under the federal Clean Air Act, United States Code, title 42, section 7401 et seq., for a generation facility of that type; or\n(2) employs the maximum achievable or best available control technology available for a generation facility of that type.\n(b) An eligible energy technology may blend or co-fire a fuel listed in subdivision 1, paragraph (c), clause (5), with other fuels in the generation facility, but only the percentage of electricity that is attributable to a fuel listed in that clause can be counted toward an electric utility's standard obligation under subdivision 2a.\n[Repealed by amendment, 2007 c 3 s 1]\nThe commission must regularly investigate whether an electric utility is in compliance with the electric utility's standard obligation under subdivisions 2a, 2f, and 2g. If the commission finds noncompliance, it may order the electric utility to construct facilities, purchase energy generated by eligible energy technology, purchase renewable energy credits, or engage in other activities to achieve compliance. If an electric utility fails to comply with an order under this subdivision, the commission may impose a financial penalty on the electric utility in an amount not to exceed the estimated cost of the electric utility to achieve compliance. The penalty may not exceed the lesser of the cost of constructing facilities or purchasing credits. The commission must deposit financial penalties imposed under this subdivision in the energy and conservation account established in the special revenue fund under section 216B.241, subdivision 2a. This subdivision is in addition to and does not limit any other authority of the commission to enforce this section.\nThis section does not limit the authority of the commission under any other law, including, without limitation, sections 216B.2422 and 216B.243.\n(a) The commission shall take all reasonable actions within the commission's statutory authority to ensure this section is implemented in a manner that maximizes net benefits to all Minnesota citizens. Reasonable actions the commission must take and benefits that must be maximized include but are not limited to:\n(1) the creation of high-quality jobs in Minnesota paying wages that support families;\n(2) recognition of the rights of workers to organize and unionize;\n(3) ensuring that workers have the necessary tools, opportunities, and economic assistance to adapt successfully during the energy transition, particularly in environmental justice areas;\n(4) ensuring that all Minnesotans share (i) the benefits of clean and renewable energy, and (ii) the opportunity to participate fully in the clean energy economy;\n(5) ensuring that statewide air emissions are reduced, particularly in environmental justice areas; and\n(6) the provision of affordable electric service to Minnesotans, particularly to low-income consumers.\n(b) The commission must also implement this section in a manner that balances factors such as local ownership of or participation in energy production, development and ownership of eligible energy technology facilities by independent power producers, Minnesota utility ownership of eligible energy technology facilities, the costs of energy generation to satisfy the renewable and carbon-free standards, and the reliability of electric service to Minnesotans.\n(c) When making investments to meet the requirements under this section, utilities are encouraged to locate new energy generating facilities in Minnesota communities where fossil-fuel-generating plants have been retired or are scheduled for retirement.\nA competitive resource acquisition process established by the commission prior to June 1, 2007, shall not apply to a utility for the construction, ownership, and operation of generation facilities used to satisfy the requirements of this section unless, upon a finding that it is in the public interest, the commission issues an order on or after June 1, 2007, that requires compliance by a utility with a competitive resource acquisition process. A utility that owns a nuclear generation facility and intends to construct, own, or operate facilities under this section shall file with the commission as part of the utility's filing under section 216B.2422 a renewable energy plan setting forth the manner in which the utility proposes to meet the requirements of this section. The commission shall approve the plan unless it determines, after public hearing and comment, that the plan is not in the public interest. As part of its determination of public interest, the commission shall consider the plan's impact on balancing the state's interest in:\n(1) promoting the policy of economic development in rural areas through the development of renewable energy projects, as expressed in subdivision 9;\n(2) maintaining the reliability of the state's electric power grid; and\n(3) minimizing cost impacts on ratepayers.",
	"repealed": false
}