{
	"id": "240.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/240.18",
	"title": "240.18 BREEDERS' FUND.",
	"text": "The commission shall establish a Minnesota breeders' fund with the money paid to it under section 240.15, subdivision 1. The commission, after paying the current costs of administering the fund, shall apportion the remaining net proceeds into categories corresponding with the various breeds of horses which are racing at licensed Minnesota racetracks in proportion to each category's contribution to the fund and distribute the available net proceeds in each category as provided in this section.\n(a) With respect to available money apportioned in the Thoroughbred and Quarter Horse categories, 20 percent must be expended as follows:\n(1) at least one-half in the form of grants, contracts, or expenditures for equine research and related education at public institutions of postsecondary learning in the state; and\n(2) the balance in the form of grants, contracts, or expenditures for one or more of the following:\n(i) additional equine research and related education;\n(ii) substance abuse programs for licensed personnel at racetracks in this state; and\n(iii) promotion and public information regarding industry and commission activities; racehorse breeding, ownership, and management; and development and expansion of economic benefits from racing.\n(b) As a condition of a grant, contract, or expenditure under paragraph (a), the commission shall require an annual report from the recipient on the use of the funds.\n(c) The commission shall include in its biennial report a summary of each grant, contract, or expenditure under paragraph (a), clause (2), and a description of how the commission has coordinated activities among recipients to ensure the most efficient and effective use of funds.\n(d) After deducting the amount for paragraph (a), the balance of the available proceeds in each category may be expended by the commission to:\n(1) supplement purses for races held exclusively for Minnesota-bred or Minnesota-foaled horses, and supplement purses for Minnesota-bred or Minnesota-foaled horses racing in nonrestricted races in that category;\n(2) pay breeders' or owners' awards to the breeders or owners of Minnesota-bred horses in that category which win money at pari-mutuel racetracks licensed by any state or province; and\n(3) provide other financial incentives to encourage the horse breeding industry in Minnesota.\n(a) With respect to the available money apportioned in the standardbred category, 20 percent must be expended as follows:\n(1) one-half of that amount to supplement purses for standardbreds at non-pari-mutuel racetracks in the state; and\n(2) one-half of that amount as grants for equine research and related education at public institutions of postsecondary learning in the state.\n(b) After deducting the amount for paragraph (a), the balance of the available proceeds in the standardbred category must be expended by the commission to:\n(1) supplement purses for races held exclusively for Minnesota-bred and Minnesota-foaled standardbreds;\n(2) pay breeders or owners awards to the breeders or owners of Minnesota-bred standardbreds which win money at licensed racetracks in the state; and\n(3) provide other financial incentives to encourage the horse breeding industry in Minnesota.\nAvailable money apportioned to breeds other than breeds contained in subdivisions 2 and 3 must be distributed as financial incentives to encourage horse racing and horse breeding for such breeds. Available money apportioned for the Arabian breed may be distributed to owners who are Minnesota residents racing at licensed Minnesota racetracks or at racetracks of border states.\nThe commission shall adopt rules governing the distribution of the fund. The commission may establish advisory committees to advise it on the distribution of money under this section, provided that the members of an advisory committee shall serve without compensation.",
	"repealed": false
}