{
	"id": "176.238",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.238",
	"title": "176.238 NOTICE OF DISCONTINUANCE OF COMPENSATION.",
	"text": "Except as provided in section 176.221, subdivision 1, once the employer or insurer has commenced payment of benefits, the employer may not discontinue payment of compensation until it provides the employee with notice in writing of intention to do so. A copy of the notice shall be filed with the division by the employer or insurer. The notice to the employee and the copy to the division shall state the date of intended discontinuance and set forth a statement of facts clearly indicating the reason for the action. Copies of whatever medical reports or other written reports in the employer's or insurer's possession which are relied on for the discontinuance shall be attached to the notice.\n(a) If the reason for discontinuance is that the employee has returned to work, temporary total compensation may be discontinued effective the day the employee returned to work. Written notice shall be served on the employee and filed with the division within 14 days of the date the employer or insurer has notice that the employee has returned to work.\n(b) If the reason for the discontinuance is for other than that the employee has returned to work, the liability of the employer or insurer to make payments of compensation continues until the copy of the notice and reports have been filed with the division. When the division has received a copy of the notice of discontinuance, the statement of facts and available medical reports, the duty of the employer or insurer to pay compensation is suspended, except as provided in the following subdivisions and in section 176.239.\nAn employee may request the office to schedule an administrative discontinuance conference to obtain an expedited interim decision concerning the discontinuance of compensation. Procedures relating to discontinuance conferences are set forth in section 176.239.\nAn employee may serve on the employer and insurer and file with the office an objection to discontinuance if:\n(1) the employee elects not to request an administrative conference under section 176.239;\n(2) if the employee fails to timely proceed under that section;\n(3) if the discontinuance is not governed by that section; or\n(4) if the employee disagrees with the interim administrative decision issued under that section. Within ten calendar days after receipt of an objection to discontinuance, the office shall schedule the matter for a de novo hearing before a compensation judge to determine the right of the employee to further compensation.\nInstead of filing a notice of discontinuance, an employer or insurer may serve on the employee and file with the office a petition to discontinue compensation. A petition to discontinue compensation may also be used when the employer or insurer disagrees with the interim administrative decision under section 176.239. Within ten calendar days after receipt of a petition to discontinue, the office shall schedule the matter for a de novo hearing before a compensation judge to determine the right of the employer or insurer to discontinue compensation.\nThe petition shall include copies of medical reports or other written reports or evidence in the possession of the employer or insurer bearing on the physical condition or other present status of the employee which relate to the proposed discontinuance. The employer or insurer shall continue payment of compensation until the filing of the decision of the compensation judge and thereafter as the compensation judge, court of appeals, or the supreme court directs, unless, during the interim, occurrences arise justifying the filing of a notice under subdivision 1 or 2 and the discontinuance is permitted by the commissioner's order or no conference under section 176.239 is requested.\n(a) A hearing before a compensation judge shall be held within 60 calendar days after the filing of the objection to discontinuance or petition to discontinue if:\n(1) an objection to discontinuance has been filed under subdivision 4 within 60 calendar days after the notice of discontinuance was filed and where no administrative conference has been held;\n(2) an objection to discontinuance has been filed under subdivision 4 within 60 calendar days after an interim administrative decision under this section has been issued;\n(3) a petition to discontinue has been filed by the employer or insurer in lieu of filing a notice of discontinuance; or\n(4) a petition to discontinue has been filed within 60 calendar days after the interim administrative decision under this section has been issued.\n(b) If the petition or objection is filed later than the deadlines listed above, the expedited procedures in this section apply only where the employee is unemployed at the time of filing the objection and shows, to the satisfaction of the chief administrative law judge, by sworn affidavit, that the failure to file the objection within the deadlines was due to some infirmity or incapacity of the employee or to circumstances that are beyond the employee's control. The hearing shall be limited to the issues raised by the notice or petition unless all parties agree to expanding the issues. If the issues are expanded, the time limits for hearing and issuance of a decision by the compensation judge under this subdivision shall not apply.\n(c) Once a hearing date has been set, a continuance of the hearing date will be granted only under the following circumstances:\n(1) the employer or insurer has agreed, in writing, to a continuation of the payment of benefits pending the outcome of the hearing; or\n(2) the employee has agreed, in a document signed by the employee, that benefits may be discontinued pending the outcome of the hearing.\n(d) Absent a clear showing of surprise at the hearing or the unexpected unavailability of a crucial witness, all evidence must be introduced at the hearing. If it is necessary to accept additional evidence or testimony after the scheduled hearing date, it must be submitted no later than 14 days following the hearing, unless the compensation judge, for good cause, determines otherwise.\n(e) When a compensation judge issued the interim administrative decision, the de novo hearing under paragraph (a), clauses (2) and (4), must be held before a compensation judge other than the compensation judge who presided over the administrative conference. The compensation judge shall issue a decision pursuant to this subdivision within 30 days following the close of the hearing record.\nIf the order of the compensation judge confirms a discontinuance of compensation, the service and filing of the order relieves the employer and insurer from further liability for compensation subject to the right of review provided by this chapter, and to the right of the compensation judge to set aside the order at any time prior to the review and to grant a new hearing pursuant to this chapter. Once an appeal to the Workers' Compensation Court of Appeals is filed, a compensation judge may not set aside the order. In any appeal from the compensation judge's decision under this section, the court of appeals shall conclude any oral arguments by the parties within 60 days following certification of the record from the office.\nNotices under this section shall be on forms prescribed by the commissioner.\nIf the employee has been presently represented by an attorney for the same injury, all notices required by this section shall also be served on the last attorney of record.\nAn employer or insurer who violates requirements set forth in this section or section 176.239 is subject to a fine of up to $2,500 for each violation payable to the commissioner for deposit in the assigned risk safety account.\nThis section shall not apply to those employees who have been adjudicated permanently totally disabled, or to those employees who have been administratively determined pursuant to division rules to be permanently totally disabled.",
	"repealed": false
}