{
	"id": "246C.16#stat.246C.16.1",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.16#stat.246C.16.1",
	"title": "246C.16 PROPERTY MANAGEMENT.",
	"text": "(a) Notwithstanding section 16B.24, subdivision 6, paragraph (a), or any other law to the contrary, the commissioner of administration may lease land or other premises to provide state-operated, community-based programs authorized by sections 246C.02, and 246C.11 for a term of 20 years or less, with a ten-year or less option to renew, subject to cancellation upon 30 days' notice by the state for any reason, except rental of other land or premises for the same use.\n(b) The commissioner of administration may also lease land or premises from political subdivisions of the state to provide state-operated, community-based programs authorized by sections 246C.02, and 246C.11 for a term of 20 years or less, with a ten-year or less option to renew. A lease under this paragraph may be canceled only due to the lack of a legislative appropriation for the program.\n(a) Notwithstanding any law to the contrary, money collected as rent under section 16B.24, subdivision 5, for state property at any of the regional treatment centers or state nursing home facilities administered by the Direct Care and Treatment executive board is dedicated to the regional treatment center or state nursing home from which it is generated. Any balance remaining at the end of the fiscal year shall not cancel and is available until expended.\n(b) The executive board may lease out any buildings or portions of buildings, units, or lands acquired by the department that are not needed for the uses and purposes of the department. Such authority to lease out buildings, units, and lands includes authority to lease to employees of the department, notwithstanding section 16B.24, subdivision 5, paragraph (c). The executive board may set the prices and terms and conditions for leases under this paragraph and shall not make any such lease for a term of more than five years. All money received from leases under this paragraph shall be credited to the fund from which the property was acquired or through which the property is being maintained. Money credited for leased property maintenance is appropriated to the executive board for that purpose.\n(c) The executive board may lease out any buildings or portions of buildings, units, or lands acquired by the department to clients and employees of the department for the provision of community-based services, notwithstanding section 16B.24, subdivision 5, paragraph (c). The executive board may set the prices and terms and conditions for leases under this paragraph, and shall not make any such lease for a term of more than five years. All money received from leases under this paragraph shall be credited to the fund from which the property was acquired or through which the property is being maintained. Money credited for leased property maintenance is appropriated to the executive board for that purpose.\nThe executive board may use available space in any institution under jurisdiction of the executive board, or in any institution under the jurisdiction of another department or agency of the state offered by executive or legislative action to the executive board for the care and custody of persons, patients, or inmates of the institutions under exclusive control of the executive board for whom other, more suitable, space is not available.\nThe executive board may settle any disagreement between the executive board and any person claiming a right, interest, estate, or lien in or upon lands or improvements on such land occupied by or used in connection with any state institution, or any claim by a person for damages to any such land or improvements with the approval of the governor and the commissioner of management and budget. In entering a settlement, the executive board may make any necessary conveyance of land. All money received by the executive board as a part of any such settlement must be paid into the general fund.\n(a) Within the limits of available appropriations, the executive board may build, purchase, or lease suitable buildings, at least a portion of which must be used for state-operated, community-based programs. The executive board must develop the state-operated community residential facilities authorized in the worksheets of the house of representatives appropriations and senate finance committees. If financing through state general obligation bonds is not available, the executive board shall finance the purchase or construction of state-operated, community-based facilities with the Minnesota Housing Finance Agency. The executive board shall make payments through the Department of Administration to the Minnesota Housing Finance Agency in repayment of mortgage loans granted for the purposes of this section.\n(b) Programs must be adaptable to the needs of persons with developmental disabilities and residential programs must be homelike.",
	"repealed": false
}