{
	"id": "473.411",
	"url": "https://www.revisor.mn.gov/statutes/cite/473.411",
	"title": "473.411 TRANSIT AND HIGHWAY SYSTEMS.",
	"text": "MS 1982 [Repealed, 1984 c 654 art 3 s 153]\nMS 1976 [Repealed, 1977 c 454 s 49]\nThe council may make use of engineering and other technical and professional services, including regular staff and qualified consultants, which the commissioner of transportation can furnish, upon fair and reasonable reimbursement for the cost thereof; provided, that the council has final authority over the employment of any services from other sources which it may deem necessary for such purposes. The commissioner of transportation may furnish all engineering, legal, and other services, if so requested by the council and upon fair and reasonable reimbursement for the cost thereof by the council, for the purposes stated in this subdivision, including the acquisition by purchase, condemnation, or otherwise in the name of the council of all lands, waters, easements, or other rights or interests in lands or waters required by the council. No purchase of service agreements may be made under this subdivision which are not included in the budget of the council.\nWherever the joint construction or use of a state highway is feasible in fulfilling the purposes of sections 473.405 to 473.449, the council shall enter into an agreement with the commissioner of transportation therefor, evidenced by a memorandum setting forth the terms of the agreement. Either the council or the commissioner of transportation may acquire any additional lands, waters, easements or other rights or interests required for joint use in accordance with the agreement, or joint acquisition may be made by condemnation as provided by section 117.016 and the provisions of sections 473.405 to 473.449. Under the agreement each party shall pay to the other party reasonable compensation for the costs of any services performed at the request of the other party which may include any costs of engineering, design, acquisition of property, construction of the facilities, and for the use thereof so far as attributable to and necessary for the purposes. The council may not agree to acquisitions or expenditures under this subdivision which are not included in its budget.\nThe council may use for the purposes of sections 473.405 to 473.449 upon the conditions stated in this subdivision any state highway or other public roadway, parkway, or lane, or any bridge or tunnel or other appurtenance of a roadway, without payment of any compensation, provided the use does not interfere unreasonably with the public use or maintenance of the roadway or appurtenance or entail any substantial additional costs for maintenance. The provisions of this subdivision do not apply to the property of any common carrier railroad or common carrier railroads. The consent of the public agency in charge of such state highway or other public highway or roadway or appurtenance is not required; except that if the council seeks to use a designated parkway for regular route service in the city of Minneapolis, it must obtain permission from and is subject to reasonable limitations imposed by a joint board consisting of two representatives from the council, two members of the board of park commissioners, and a fifth member jointly selected by the other members of the board. If the use is a designated Minneapolis parkway for regular route service adjacent to the city of Minneapolis, it must obtain permission from and is subject to reasonable limitations imposed by a joint board consisting of two representatives from the council, two members of the board of park commissioners, and a fifth member jointly selected by other members of the board. The joint board must include a nonvoting member appointed by the council of the city in which the parkway is located.\nThe board of park commissioners and the council may designate persons to sit on the joint board. In considering a request by the council to use designated parkways for additional routes or trips, the joint board consisting of the council or their designees, the board of park commissioners or their designees, and the fifth member, shall base its decision to grant or deny the request based on the criteria to be established by the joint board. The decision to grant or deny the request must be made within 45 days of the date of the request. The park board must be notified immediately by the council of any temporary route detours. If the park board objects to the temporary route detours within five days of being notified, the joint board must convene and decide whether to grant the request, otherwise the request is deemed granted. If the agency objects to the proposed use or claims reimbursement from the council for additional cost of maintenance, it may commence an action against the council in the district court of the county wherein the highway, roadway, or appurtenance, or major portion thereof, is located. The proceedings in the action must conform to the Rules of Civil Procedure applicable to the district courts. The court shall sit without jury. If the court determines that the use in question interferes unreasonably with the public use or maintenance of the roadway or appurtenance, it shall enjoin the use by the council. If the court determines that the use in question does not interfere unreasonably with the public use or maintenance of the roadway or appurtenance, but that it entails substantial additional maintenance costs, the court shall award judgment to the agency for the amount of the additional costs. Otherwise the court shall award judgment to the council. An aggrieved party may appeal from the judgment of the district court in the same manner as is provided for such appeals in other civil actions. The council may also use land within the right-of-way of any state highway or other public roadway for the erection of traffic-control devices, other signs, and passenger shelters upon the conditions stated in this subdivision and subject only to the approval of the commissioner of transportation where required by statute, and subject to the express provisions of other applicable statutes and to federal requirements where necessary to qualify for federal aid.",
	"repealed": false
}