{
	"id": "327C.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/327C.03",
	"title": "327C.03 FEES.",
	"text": "Except as provided in this section and section 327C.04, no fee other than the periodic rental payment shall be charged to a park resident or prospective resident or any agent of a resident or prospective resident for the right to obtain or retain a lot.\nA park owner may contract with a resident to install the resident's home on a lot or to remove the resident's home from the park. The contract must be in writing and the park owner may charge for the service. A park owner may not require a resident to use the park owner's service to install or remove a home unless the owner provides the service without charge.\nAll periodic rental payments charged to residents by the park owner shall be uniform throughout the park, except that a higher rent may be charged to a particular resident due to the larger size or location of the lot, or the special services or facilities furnished by the park. A park owner may charge a reasonable fee for delinquent rent where the fee is provided for in the rental agreement. The fee shall be enforceable as part of the rent owed by the resident. No park owner shall charge to a resident any fee, whether as part of or in addition to the periodic rental payment, which is based on the number of persons residing or staying in the resident's home, the number or age of children residing or staying in the home, the number of guests staying in the home, the size of the home, the fact that the home is temporarily vacant or the type of personal property used or located in the home. The park owner may charge an additional fee for pets owned by the resident, but the fee may not exceed $4 per pet per month. This subdivision does not prohibit a park owner from abating all or a portion of the rent of a particular resident with special needs.\nA park owner may require a resident to deposit with the park owner a fee, not to exceed the amount of two months' rent, to secure the resident's performance of the rental agreement and to protect the park owner against damage by the resident to park property, including any damage done by the resident in the installation or removal of the resident's home. The provisions of section 504B.178 shall apply to any security deposit required by a park owner under this subdivision.\nIf park rules or state or local law provide for lot maintenance or impose conditions on the use of common areas and a resident fails to do the required maintenance or meet the conditions, the park owner may do the maintenance or satisfy the conditions and charge the resident the reasonable cost, plus a fee of up to $10, if:\n(1) before doing the work the park owner gives the resident a written notice specifying the work that has to be done, stating which rule or law requires the work to be done, advising the tenant that if the work is not done promptly the park will do the work and bill the resident, and stating a reasonable deadline by which the resident must do the work;\n(2) after receiving the notice, the resident fails to do the work by the stated deadline; and\n(3) after the work is done by the park owner, the park owner serves the resident with a written notice of the charge.\nIf a resident's failure to do required maintenance or meet a condition imposed on the use of common areas causes an immediate danger to park facilities or to the health or safety of other residents, the park owner may give the resident a written notice requiring immediate compliance. If immediate compliance is essential and delivery of a notice is impractical or useless, the park owner may do the work without giving notice and may charge the tenant the reasonable cost. A notice given pursuant to this subdivision neither precludes nor suffices as the notice required by section 327C.09, subdivisions 3 to 7.\nCharges made pursuant to this subdivision shall be enforceable as part of the rent owed by the resident. The notice required by clause (3) shall specify the work performed, the date of its performance, the total cost of performing the work, the method used in computing the cost and a deadline for payment by the resident. The deadline shall not be less than 30 days after the service of the notice.\nIn the event a park owner has been assessed under section 327C.095, subdivision 12, paragraph (c), the park owner may collect the $15 annual payment required by section 327C.095, subdivision 12, for participation in the relocation trust fund, as a lump sum or, along with monthly lot rent, a fee of no more than $1.25 per month to cover the cost of participating in the relocation trust fund. The $1.25 fee must be separately itemized and clearly labeled \"Minnesota manufactured home relocation trust fund.\"",
	"repealed": false
}