{
	"id": "356.65",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.65",
	"title": "356.65 DISPOSITION OF ABANDONED PUBLIC PENSION FUND AMOUNTS.",
	"text": "For purposes of this section, unless the context clearly indicates otherwise, each of the following terms has the meaning given to it:\n(a) \"Public pension fund\" means any public pension plan as defined in section 356.63, paragraph (b), and any Minnesota firefighters relief association which is established under chapter 424A and governed under sections 424A.091 to 424A.096.\n(b) \"Unclaimed public pension fund amounts\" means any amounts representing accumulated member contributions, any outstanding unpaid annuity, service pension or other retirement benefit payments, including those made on warrants issued by the commissioner of management and budget, which have been issued and delivered for more than six months prior to the date of the end of the fiscal year applicable to the public pension fund, and any applicable interest to the credit of:\n(1) an inactive or former member of a public pension fund who is not entitled to a defined retirement annuity and who has not applied for a refund of those amounts within five years after the last member contribution was made; or\n(2) a deceased inactive or former member of a public pension fund if no survivor is entitled to a survivor benefit and no survivor, designated beneficiary or legal representative of the estate has applied for a refund of those amounts within five years after the date of death of the inactive or former member.\nAny unclaimed public pension fund amounts existing in any public pension fund are presumed to be abandoned, but are not subject to the provisions of sections 345.31 to 345.60. Unless the benefit plan of the public pension fund specifically provides for a different disposition of unclaimed or abandoned funds or amounts, any unclaimed public pension fund amounts cancel and must be credited to the public pension fund. If the unclaimed public pension fund amount exceeds $25 and the inactive or former member again becomes a member of the applicable public pension plan or applies for a retirement annuity under section 356.30 or 356.311, whichever applies, the canceled amount must be restored to the credit of the person.",
	"repealed": false
}