{
	"id": "148.71",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.71",
	"title": "148.71 TEMPORARY PERMITS.",
	"text": "[Repealed, 2007 c 123 s 137]\n(a) The board may, upon completion of the application prescribed by the board and payment of a fee set by the board, issue a temporary permit to practice physical therapy under supervision to an applicant for licensure as a physical therapist or physical therapist assistant who meets the educational requirements of section 148.721 or 148.722 and qualified for admission to examination for licensing as a physical therapist or physical therapist assistant. A temporary permit may be issued only once and cannot be renewed. It expires 90 days after the next examination for licensing given by the board or on the date on which the board, after examination of the applicant, grants or denies the applicant a license to practice, whichever occurs first. A temporary permit expires on the first day the board begins its next examination for license after the permit is issued if the holder does not submit to examination on that date. The holder of a temporary permit to practice under supervision may practice physical therapy as defined in section 148.65 if the entire practice is under the supervision of a person holding a valid license to practice physical therapy in this state. The supervision shall be direct, immediate, and on premises.\n(b) An applicant from another state who is licensed or otherwise registered in good standing as a physical therapist by that state and meets the requirements for licensing under section 148.721 does not require supervision to practice physical therapy while holding a temporary permit in this state. The temporary permit remains valid only until the meeting of the board at which the application for licensing is considered.\n(a) The Board of Physical Therapy may issue a temporary permit to a foreign-educated physical therapist who:\n(1) is enrolled in a supervised physical therapy traineeship that meets the requirements under paragraph (b);\n(2) has completed a physical therapy education program equivalent to that under section 148.721, and has provided to the board a Foreign Credentialing Commission on Physical Therapy (FCCPT) comprehensive credentials evaluation (Type I certificate) or FCCPT educational credentials review demonstrating completion of the program;\n(3) has achieved a passing score according to section 148.725, subdivision 3, on the test of English as a foreign language or an alternate equivalent examination, as determined by the board; and\n(4) has paid a nonrefundable fee set by the board.\nA foreign-educated physical therapist must have the temporary permit before beginning a traineeship.\n(b) A supervised physical therapy traineeship must:\n(1) be at least six months;\n(2) be at a board-approved facility;\n(3) provide a broad base of clinical experience to the foreign-educated physical therapist including a variety of physical agents, therapeutic exercises, evaluation procedures, and patient diagnoses;\n(4) be supervised by a physical therapist who has at least three years of clinical experience and is licensed under subdivision 1; and\n(5) be approved by the board before the foreign-educated physical therapist begins the traineeship.\n(c) A temporary permit is effective on the first day of a traineeship and expires 90 days after the next examination for licensing given by the board following successful completion of the traineeship or on the date on which the board, after examination of the applicant, grants or denies the applicant a license to practice, whichever occurs first.\n(d) A foreign-educated physical therapist must successfully complete a traineeship to be licensed as a physical therapist under subdivision 1. The traineeship may be waived for a foreign-educated physical therapist who is licensed or otherwise registered in good standing in another state and has successfully practiced physical therapy in that state under the supervision of a licensed or registered physical therapist for at least six months at a facility that meets the requirements under paragraph (b), clauses (2) and (3).\n(e) A temporary permit will not be issued to a foreign-educated applicant who has been issued a temporary permit for longer than six months in any other state.",
	"repealed": false
}