{
	"id": "352D.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/352D.11",
	"title": "352D.11 PURCHASE OF PRIOR SERVICE CREDIT.",
	"text": "A qualified legislative employee may purchase prior service credit from the Minnesota State Retirement System for service for which the employee did not receive service credit from the state retirement system. An employee is qualified to purchase prior service credit only if:\n(1) the employee is a permanent employee of the senate, the house of representatives, or of a joint legislative agency or legislative commission, or a former permanent employee of the senate, the house of representatives, or of a joint legislative agency or legislative commission who has not withdrawn the value of shares in the unclassified program; and\n(2) before permanent employment the employee served as a temporary, intermittent, or contract employee of the senate, the house of representatives, a joint legislative staff agency, or a legislative commission.\nAn employee entitled to purchase service credit may make the purchase by paying to the state retirement system an amount equal to the current employee contribution rate in effect for the state retirement system applied to the current or final salary rate multiplied by the months and days of prior temporary, intermittent, or contract legislative service. Payment shall be made in one lump sum unless the executive director of the state retirement system agrees to accept payment in installments over a period of not more than three years from the date of the agreement. Installment payments shall be charged interest at the applicable annual rate or rates specified in section 356.59, subdivision 2, compounded annually.\nProof of all legislative employment and the duration of all legislative employment shall be established for current or former employees by certification of the appropriate employer:\n(1) by the Committee on Rules and Administration of the senate;\n(2) by the Committee on Rules and Legislative Administration of the house of representatives; or\n(3) by the agency director or commission chair for service as an employee of a joint legislative staff agency or legislative commission.\nCertification to the executive director of the state retirement system shall include the exact period or periods of employment for which the employee or qualified former employee is entitled to obtain service credit. Service credit shall be computed and granted upon receiving payment based on the relationship that the temporary, intermittent, or contract service bears to full-time employment.\nEmployee payments to the state retirement system authorized by this section shall be matched by the current employer of the qualified employee from the appropriation made to the respective legislative expense funds or the appropriation available to the agency or commission. If the qualified employee is a participant in the unclassified program at the time of payment, payments by the employee and employer shall be used to purchase shares in the Minnesota supplemental retirement fund.",
	"repealed": false
}