{
	"id": "85B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/85B.03",
	"title": "85B.03 POWERS.",
	"text": "(a) The corporation has the powers granted to a business corporation by section 302A.161, subdivisions 3; 4; 5; 7; 8; 9; 11; 12; 13, except that the corporation may not act as a general partner in any partnership; 14; 15; 16; 17; 18; and 22; and the powers necessary or convenient to exercise the enumerated powers.\n(b) The state is not liable for the obligations of the corporation.\n(c) Section 302A.041 applies to this chapter and the corporation in the same manner that it applies to business corporations established under chapter 302A.\nThe corporation may enter into management contracts or lease agreements or both with Lake Superior Center, a Minnesota nonprofit corporation, to design, develop, and operate a facility to further the purposes of sections 85B.01 to 85B.08 in the city of Duluth, at the site determined by the board and on the terms that the board finds desirable. Notwithstanding the provisions of section 85B.02, subdivision 7, relating to the conflict of interest, a director or officer of the corporation who is also a director, officer, or member of Lake Superior Center, a Minnesota nonprofit corporation, and the corporation, may participate in and vote on the decision of the board as to the terms and conditions of management contracts or lease agreements between Lake Superior Center and the corporation.\nThe corporation may accept and use gifts, grants, or contributions from any source, except that the corporation may not receive state general fund appropriations to support operation of the facility. If the facility experiences an operating deficit, the corporation and any Minnesota nonprofit corporation with which the corporation enters into management contracts or lease agreements shall rely upon private or local government sources to provide operating funds. Unless otherwise restricted by the terms of a gift or bequest, the board may sell, exchange, or otherwise dispose of, and invest or reinvest the money, securities, or other property given or bequeathed to it. The principal of these funds, the income from them, and all other revenues received by it from any nonstate source must be placed in the depositories the board determines and is subject to expenditure for the board's purposes. Expenditures of $25,000 or more must be approved by the full board.\nThe corporation shall comply with all federal laws and federal rules or regulations relating to the quarantine, transportation, examination, habitation, care, and treatment of wild animals. The Department of Natural Resources may prescribe rules supplemental to federal regulations, relating to the transportation, examination, care, and treatment of wild animals native to this state held or proposed to be acquired by the board and may inspect them as often and at the times it deems necessary.\nThe board may sell or exchange animals determined by it to be superfluous to operations, subject to state and federal regulations.\nThe board may provide for promotional and advertising programs to be developed and implemented either by its personnel or by contract with outside personnel and paid for out of funds other than bond revenues.\nThe board or its agent may establish admission fees and other charges for use of its facilities.",
	"repealed": false
}