{
	"id": "176.138",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.138",
	"title": "176.138 MEDICAL DATA; ACCESS.",
	"text": "(a) Notwithstanding any other state laws related to the privacy of medical data or any private agreements to the contrary, the release in writing, by telephone discussion, or otherwise of medical data related to a current claim for compensation under this chapter to the employee, employer, or insurer who are parties to the claim, or to the Department of Labor and Industry, shall not require prior approval of any party to the claim. This section does not preclude the release of medical data under section 175.10 or 176.231, subdivision 9. Requests for pertinent data shall be made, and the date of discussions with medical providers about medical data shall be confirmed, in writing to the person or organization that collected or currently possesses the data. Written medical data that exists at the time the request is made shall be provided by the collector or possessor within seven working days of receiving the request. Nonwritten medical data may be provided, but is not required to be provided, by the collector or possessor. In all cases of a request for the data or discussion with a medical provider about the data, except when it is the employee who is making the request, the employee shall be sent written notification of the request by the party requesting the data at the same time the request is made or a written confirmation of the discussion. This data shall be treated as private data by the party who requests or receives the data and the party receiving the data shall provide the employee or the employee's attorney with a copy of all data requested by the requester.\n(b) Medical data which is not directly related to a current injury or disability shall not be released without prior authorization of the employee.\n(c) The commissioner may impose a penalty of up to $600 payable to the commissioner for deposit in the assigned risk safety account against a party who does not timely release data as required in this section. A party who does not treat this data as private pursuant to this section is guilty of a misdemeanor. This paragraph applies only to written medical data which exists at the time the request is made.\n(d) Workers' compensation insurers and self-insured employers may, for the sole purpose of identifying duplicate billings submitted to more than one insurer, disclose to health insurers, including all insurers writing insurance described in section 60A.06, subdivision 1, clause (5)(a), nonprofit health service plan corporations subject to chapter 62C, health maintenance organizations subject to chapter 62D, and joint self-insurance employee health plans subject to chapter 62H, computerized information about dates, coded items, and charges for medical treatment of employees and other medical billing information submitted to them by an employee, employer, health care provider, or other insurer in connection with a current claim for compensation under this chapter, without prior approval of any party to the claim. The data may not be used by the health insurer for any other purpose whatsoever and must be destroyed after verification that there has been no duplicative billing. Any person who is the subject of the data which is used in a manner not allowed by this paragraph has a cause of action for actual damages and punitive damages for a minimum of $5,000.\n(e) Medical data collected, stored, used, or disseminated by or filed with the commissioner in connection with a claim for workers' compensation benefits governed by this chapter does not constitute genetic information for the purposes of section 13.386.",
	"repealed": false
}