{
	"id": "16A.125",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.125",
	"title": "16A.125 STATE TRUST LANDS.",
	"text": "[Repealed, 1976 c 231 s 34]\n[Repealed, 1976 c 231 s 34]\n[Repealed, 1976 c 231 s 34]\n[Repealed, 1969 c 399 s 51]\n(a) The term \"state forest trust fund lands\" as used in this subdivision, means public land in trust under the constitution set apart as \"forest lands under the authority of the commissioner\" of natural resources as defined by section 89.001, subdivision 13.\n(b) The commissioner of management and budget shall credit the revenue from the forest trust fund lands to the forest suspense account. The account must specify the trust funds interested in the lands and the respective receipts of the lands.\n(c) After a fiscal year, the commissioner of management and budget shall certify the costs incurred for forestry during that year under appropriations for the improvement, administration, and management of state forest trust fund lands and construction and improvement of forest roads to enhance the forest value of the lands. The certificate must specify the trust funds interested in the lands. After presentation to the Legislative Permanent School Fund Commission or by June 30 each year, whichever is sooner, the commissioner of natural resources shall supply the commissioner of management and budget with the information needed for the certificate. The certificate shall include an analysis that compares costs certified under this section with costs incurred on other public and private lands with similar land assets.\n(d) After a fiscal year, the commissioner shall distribute the receipts credited to the suspense account during that fiscal year as follows:\n(1) the amount of the certified costs incurred by the state for forest management, forest improvement, and road improvement during the fiscal year shall be transferred to the forest management investment account established under section 89.039;\n(2) the amount of costs incurred by the Legislative Permanent School Fund Commission under section 127A.30, and by the school trust lands director under section 127A.353, shall be transferred to the general fund;\n(3) the balance of the certified costs incurred by the state during the fiscal year shall be transferred to the general fund; and\n(4) the balance of the receipts shall then be returned prorated to the trust funds in proportion to their respective interests in the lands which produced the receipts.\nMoney accruing and credited to the state forest development account is appropriated to the Division of Forestry in the Department of Natural Resources to apply state forest resource management policy and plans to forest trust fund lands. The appropriation is supervised and controlled by the commissioner of natural resources.\nThe appropriation shall be spent according to law and remains available until spent. The appropriation is not available for spending until any estimates required by law are approved by the commissioner of management and budget. An obligation to spend money may not be made unless there is an available balance not otherwise encumbered in the appropriation.\n[Repealed by amendment, 1995 c 220 s 26]\n[Repealed, 1996 c 395 s 17]\n[Repealed, 1976 c 231 s 34]\n[Repealed, 1976 c 231 s 34]\n[Repealed, 1976 c 231 s 34]\n[Repealed, 1976 c 231 s 34]",
	"repealed": false
}