{
	"id": "491A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/491A.01",
	"title": "491A.01 ESTABLISHMENT; POWERS; JURISDICTION.",
	"text": "The district court in each county shall establish a conciliation court division with the jurisdiction and powers set forth in this chapter.\nThe conciliation court has all powers, and may issue process as necessary or proper to carry out the purposes of this chapter. No writ of execution or garnishment summons may be issued out of conciliation court.\n[Expired, 2012 c 283 s 1]\n(a) Except as provided in subdivisions 4 and 5, the conciliation court has jurisdiction to hear, conciliate, try, and determine civil claims if the amount of money or property that is the subject matter of the claim does not exceed: (1) $20,000; or (2) $4,000, if the claim involves a consumer credit transaction.\n(b) \"Consumer credit transaction\" means a sale of personal property, or a loan arranged to facilitate the purchase of personal property, in which:\n(1) credit is granted by a seller or a lender who regularly engages as a seller or lender in credit transactions of the same kind;\n(2) the buyer is a natural person;\n(3) the claimant is the seller or lender in the transaction; and\n(4) the personal property is purchased primarily for a personal, family, or household purpose and not for a commercial, agricultural, or business purpose.\n(c) Except as otherwise provided in this subdivision and subdivisions 5 to 11, the territorial jurisdiction of conciliation court is coextensive with the county in which the court is established. The summons in a conciliation court action under subdivisions 6 to 10 may be served anywhere in the state, and the summons in a conciliation court action under subdivision 7, paragraph (b), may be served outside the state in the manner provided by law. The court administrator shall serve the summons in a conciliation court action by first class mail, except that if the amount of money or property that is the subject of the claim exceeds $2,500, the summons must be served by the plaintiff by certified mail, and service on nonresident defendants must be made in accordance with applicable law or rule. Subpoenas to secure the attendance of nonparty witnesses and the production of documents at trial may be served anywhere within the state in the manner provided by law.\nWhen a court administrator is required to summon the defendant by certified mail under this paragraph, the summons may be made by personal service in the manner provided in the Rules of Civil Procedure for personal service of a summons of the district court as an alternative to service by certified mail.\nThe conciliation court does not have jurisdiction over the following actions:\n(1) involving title to real estate, including actions to determine boundary lines;\n(2) involving claims of defamation by libel or slander;\n(3) for specific performance, except to the extent authorized in subdivision 5;\n(4) brought or defended on behalf of a class;\n(5) requesting or involving prejudgment remedies;\n(6) involving injunctive relief, except to the extent authorized in subdivision 5;\n(7) pursuant to chapters 256, 257, 259, 260, 518, 518A, 518B, and 518C, except for actions involving debts owed to state agencies or political subdivisions that arise under those chapters;\n(8) pursuant to chapters 524 and 525;\n(9) where jurisdiction is vested exclusively in another court or division of district court;\n(10) for eviction; and\n(11) involving medical malpractice.\nIf the controversy concerns the ownership or possession of personal property the value of which does not exceed the jurisdictional limit under subdivision 3, the conciliation court has jurisdiction to determine the ownership and possession of the property and direct any party to deliver the property to another party. Notwithstanding any other law to the contrary, once the judgment of the court directing return of the property becomes final, it is enforceable by the sheriff of the county in which the property is located without further legal process. The sheriff is authorized to effect repossession of the property according to law, including, but not limited to: (1) entry upon the premises for the purposes of demanding the property and ascertaining whether the property is present and taking possession of it; and (2) causing the building or enclosure where the property is located to be broken open and the property taken out of the building and if necessary to that end, the sheriff may call the power of the county to the sheriff's aid. If the party against whom the judgment is directed is not physically present at the time of entry by the sheriff, then a copy of the judgment must be served upon any person in possession of the property or if no person is present, a copy of the judgment must be left on the premises. After taking possession of the property, the sheriff shall turn the property over to the prevailing party.\nThe conciliation court also has jurisdiction to determine a civil action commenced by a plaintiff educational institution, including but not limited to, a state college or university governed by the Board of Trustees of the Minnesota State Colleges and Universities, with administrative offices in the county in which the conciliation court is located, to recover the amount of a student loan or loans even though the defendant or defendants are not residents of the county under the following conditions:\n(1) the student loan or loans were originally awarded in the county in which the conciliation court is located;\n(2) notice that payment on the loan is overdue has previously been sent by first class mail to the borrower to the last known address reported by the borrower to the educational institution; and\n(3) the notice states that the educational institution may commence a conciliation court action in the county where the loan was awarded to recover the amount of the loan.\n(a) If a foreign corporation is subject by law to service of process in this state or is subject to service of process outside this state under section 543.19, a conciliation court action may be commenced against the foreign corporation:\n(1) in the county where the corporation's registered agent is located;\n(2) in the county where the cause of action arose, if the corporation has a place of business in that county either at the time the cause of action arose or at the time the action was commenced; or\n(3) in the county in which the plaintiff resides, if the corporation does not appoint or maintain a registered agent in this state, withdraws from the state, or the certificate of authority of the corporation is canceled or revoked.\n(b) If a nonresident other than a foreign corporation is subject to service of process outside this state under section 543.19, a conciliation court action may be commenced against the nonresident in the county in which the plaintiff resides.\nThe conciliation court also has jurisdiction to determine a civil action commenced against two or more defendants in the county in which one or more of the defendants resides. Counterclaims may be commenced in the county where the original action was commenced.\nThe conciliation court also has jurisdiction to determine an action for damages arising from the landlord and tenant relationship under chapter 504B or under the rental agreement in the county in which the rental property is located.\nThe conciliation court also has jurisdiction to determine a civil action commenced by a plaintiff, resident of the county, to recover the amount of a dishonored check issued in the county, even though the defendant or defendants are not residents of the county, if the notice of nonpayment or dishonor described in section 609.535, subdivision 3, is sent to the maker or drawer as specified in that section and the notice states that the payee or holder of the check may commence a conciliation court action in the county where the dishonored check was issued to recover the amount of the check. This subdivision does not apply to a check that has been dishonored by stop payment order.\nThe conciliation court has jurisdiction to determine a civil action commenced by the county in which it is established to recover debts owed to the county for fees, services, overpayments, or similar obligations, even though the defendant is not a resident of the county provided that notice of the overdue debt:\n(1) has previously been sent by first class mail to the nonresident defendant at the defendant's last known address; and\n(2) states that the county may commence a conciliation court action in the county where the debt owed was incurred.\nFor the purposes of this section, \"overpayments\" does not include any overpayments that are governed by the procedures set forth under chapter 256.",
	"repealed": false
}