{
	"id": "253B.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.19",
	"title": "253B.19 JUDICIAL APPEAL PANEL; PATIENTS WHO ARE MENTALLY ILL AND DANGEROUS TO THE PUBLIC.",
	"text": "The supreme court shall establish an appeal panel composed of three judges and four alternate judges appointed from among the acting judges of the state. Panel members shall serve for terms of one year each. Only three judges need hear any case. One of the regular three appointed judges shall be designated as the chief judge of the appeal panel. The chief judge is vested with power to fix the time and place of all hearings before the panel, issue all notices, subpoena witnesses, appoint counsel for the patient, if necessary, and supervise and direct the operation of the appeal panel. The chief judge shall designate one of the other judges or an alternate judge to act as chief judge in any case where the chief judge is unable to act. No member of the appeal panel shall take part in the consideration of any case in which that judge committed the patient. The chief justice of the supreme court shall determine the compensation of the judges serving on the appeal panel. The compensation shall be in addition to their regular compensation as judges. All compensation and expenses of the appeal panel and all allowable fees and costs of the patient's counsel shall be established and paid by the executive board.\n(a) A patient committed as a person who has a mental illness and is dangerous to the public under section 253B.18, or the county attorney of the county from which the patient was committed or the county of financial responsibility, may petition the judicial appeal panel for a rehearing and reconsideration of a decision by the commissioner under section 253B.18, subdivision 5. The judicial appeal panel must not consider petitions for relief other than those considered by the executive board from which the appeal is taken. The petition must be filed with the supreme court within 30 days after the decision of the executive board is signed. The hearing must be held within 45 days of the filing of the petition unless an extension is granted for good cause.\n(b) For an appeal under paragraph (a), the supreme court shall refer the petition to the chief judge of the judicial appeal panel. The chief judge shall notify the patient, the county attorney of the county of commitment, the designated agency, the executive board, the head of the facility or program to which the patient was committed, any interested person, and other persons the chief judge designates, of the time and place of the hearing on the petition. The notice shall be given at least 14 days prior to the date of the hearing.\n(c) Any person may oppose the petition. The patient, the patient's counsel, the county attorney of the committing county or the county of financial responsibility, and the executive board shall participate as parties to the proceeding pending before the judicial appeal panel and shall, except when the patient is committed solely as a person who has a mental illness and is dangerous to the public, no later than 20 days before the hearing on the petition, inform the judicial appeal panel and the opposing party in writing whether they support or oppose the petition and provide a summary of facts in support of their position. The judicial appeal panel may appoint court examiners and may adjourn the hearing from time to time. It shall hear and receive all relevant testimony and evidence and make a record of all proceedings. The patient, the patient's counsel, and the county attorney of the committing county or the county of financial responsibility have the right to be present and may present and cross-examine all witnesses and offer a factual and legal basis in support of their positions. The petitioning party seeking discharge or provisional discharge bears the burden of going forward with the evidence, which means presenting a prima facie case with competent evidence to show that the person is entitled to the requested relief. If the petitioning party has met this burden, the party opposing discharge or provisional discharge bears the burden of proof by clear and convincing evidence that the discharge or provisional discharge should be denied. A party seeking transfer under section 253B.18, subdivision 6, must establish by a preponderance of the evidence that the transfer is appropriate.\nA majority of the judicial appeal panel shall rule upon the petition. The panel shall consider the petition de novo. The order of the judicial appeal panel shall supersede an order of the executive board under section 253B.18, subdivision 5. No order of the judicial appeal panel granting a transfer, discharge or provisional discharge shall be made effective sooner than 15 days after it is issued. The panel may not consider petitions for relief other than those considered by the executive board or special review board from which the appeal is taken. The judicial appeal panel may not grant a transfer or provisional discharge on terms or conditions that were not presented to the executive board or the special review board.\nThe filing of a petition shall immediately suspend the operation of any order for transfer, discharge or provisional discharge of the patient. The patient shall not be discharged in any manner except upon order of a majority of the appeal panel.\nA party aggrieved by an order of the appeal panel may appeal from the decision of the appeal panel to the court of appeals as in other civil cases. A party may seek review of a decision by the appeals panel within 60 days after a copy is sent to the parties by the clerk of appellate courts. The filing of an appeal shall immediately suspend the operation of any order granting transfer, discharge or provisional discharge, pending the determination of the appeal.",
	"repealed": false
}