{
	"id": "160.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.10",
	"title": "160.10 ROADS ON MINERAL LANDS.",
	"text": "When any road, including any street within a city crosses mineral land and the road interferes with mining operations on the land, the owner or lessee of the land may notify the road authority of the interference and request that the road be relocated. The road authority shall, thereupon in the manner provided by law, relocate the road so as not to interfere with the mining operations. The relocated road shall be constructed to at least the engineering standards of the old road unless the road authority determines that such standards are not necessary for safety or for the convenience of public travel. All right-of-way needed for such relocation shall be provided by the owner or lessee of the land or shall be acquired by the road authority by gift, purchase, or other manner provided by law.\nWhen any road crosses any lands including mineral lands outside the limits of any city and such road interferes with the placing of buildings, structures, or other improvements on such land, the road authority may relocate the road upon the request of the owner of the land; provided that the safety and convenience of public travel shall not be impaired thereby.\nBefore relocating such road, the road authority may require of such owner or lessee a surety bond in a sum as the road authority deems sufficient, conditioned for the payment of all damages and all costs incident to the relocation.\nThe owner or lessee may choose to construct the relocated road with the owner's or lessee's own forces or by contract, or may elect to have the construction done in whole or in part by the road authority. The owner or lessee and the road authority shall enter into an agreement setting forth the respective responsibilities of each in accord with the provisions of this section.\nIf the owner or lessee elects to construct the relocated road, the design and plans therefor shall first be approved by the road authority. The road authority shall have the right to inspect the construction work as it progresses, and the construction work shall be approved by the road authority prior to the road being opened for travel.\nThe owner or lessee shall be liable to the owner or occupant of any land abutting upon such road or any affected by such change to the extent of the damage sustained by reason of such change and for the recovery of which an action may be brought. All right-of-way costs and all costs of right-of-way acquisition, and all construction costs shall be paid by the owner or lessee requesting such relocation; provided, that if the road authority determines that such relocation shall be constructed to a greater width or to a higher standard than the old road, the road authority shall pay the additional right-of-way or construction costs incurred thereby.\nWhen any road including streets within cities is to be established over mineral lands, or over lands containing gravel, the road authority and the owner or lessee may enter into equitable agreements to provide for the use of such lands for road purposes and for the relocation of the road whenever the road interferes with mining operations.\nNothing in this section shall be construed to limit the power of any road authority including road authorities of cities to vacate a road by or under any other provision of law. Nothing herein shall affect contractual rights or obligations in existence as of July 1, 1959, between the road authority and the owner or lessee of mining lands.",
	"repealed": false
}