{
	"id": "124E.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.21",
	"title": "124E.21 SPECIAL EDUCATION AID.",
	"text": "(a) Except as provided in section 124E.23, special education aid, excluding cross subsidy reduction aid under section 125A.76, subdivision 2e, must be paid to a charter school according to section 125A.76, as though it were a school district.\n(b) For fiscal year 2020 and later, the special education aid paid to the charter school shall be adjusted as follows:\n(1) if the charter school does not receive general education revenue on behalf of the student according to section 124E.20, the aid shall be adjusted as provided in section 125A.11; or\n(2) if the charter school receives general education revenue on behalf of the student according to section 124E.20, the aid shall be adjusted as provided in section 127A.47, subdivision 7, paragraphs (b) to (e), and if the tuition adjustment is computed under section 127A.47, subdivision 7, paragraph (c), it shall also receive an adjustment equal to five percent for fiscal year 2020 or ten percent for fiscal year 2021 and later of the unreimbursed cost of providing special education and services for the student.\n(a) For purposes of subdivision 3, the terms in this subdivision have the meanings given.\n(b) \"Unreimbursed costs\" means the difference between the total cost of educating students at the school and the total of state and federal aids and grants, excluding aid under subdivision 3 and section 124E.20, subdivision 1, paragraph (c).\n(c) \"Eligible special education charter school\" means a charter school:\n(1) where the percent of students eligible for special education services equals at least 90 percent of the charter school's total enrollment; and\n(2) that submits to the commissioner a preliminary annual budget by June 15 prior to the start of the fiscal year and a revised budget by January 15 of the current fiscal year detailing its unreimbursed costs for educating students eligible and not eligible for special education services.\n(a) Notwithstanding subdivision 1, the special education aid for an eligible special education charter school equals the sum of the school's special education aid under subdivision 1, paragraph (a), and the school's approved unreimbursed cost for educating students eligible for special education services.\n(b) The commissioner must review the budget data submitted by an eligible special education charter school under subdivision 2 and notify the school of the approved unreimbursed cost to be used for current aid payments within 30 days of receiving the budget from the school.\n(c) For purposes of section 127A.45, subdivision 13, the aid under this subdivision is not subject to the 97.4 percent current fiscal year special education aid entitlement provision.\n(d) Final aid payments must be calculated using the actual unreimbursed costs as determined by the department based on year-end financial and student data submitted by the charter school.",
	"repealed": false
}