{
	"id": "524.2-702",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.2-702",
	"title": "524.2-702 REQUIREMENT OF SURVIVAL FOR 120 HOURS FOR DEVISEES, BENEFICIARIES OF CERTAIN TRUSTS, AND APPOINTEES OF CERTAIN POWERS OF APPOINTMENT; SIMULTANEOUS DEATH ACT FOR OTHER CASES.",
	"text": "(a) Requirement of survival for 120 hours. A beneficiary of a trust in which the grantor has reserved a power to alter, amend, revoke, or terminate the provisions of the trust who fails to survive the grantor by 120 hours, a devisee who fails to survive the testator by 120 hours, a beneficiary named in a transfer on death deed under section 507.071 who fails to survive by 120 hours the grantor owner upon whose death the conveyance to the beneficiary becomes effective, or an appointee of a power of appointment taking effect at the death of the holder of the power who fails to survive the holder of the power by 120 hours is deemed to have predeceased the grantor, grantor owner testator, or holder of the power for purposes of determining title to property passing by the trust instrument, by the testator's will, by the transfer on death deed, or by the exercise of the power of appointment.\n(b)(1) Title to property in other cases. In cases not governed by section 524.2-104 or paragraph (a), where the title to property or the devolution thereof depends upon priority of death and there is no sufficient evidence that the persons have died otherwise than simultaneously, the property of each person shall be disposed of as if the person had survived, except as provided otherwise in this paragraph.\n(2) Death of multiple beneficiaries; division of property. Where two or more beneficiaries are designated to take successively by reason of survivorship under another person's disposition of property and there is no sufficient evidence that these beneficiaries have died otherwise than simultaneously the property thus disposed of shall be divided into as many equal portions as there are successive beneficiaries and these portions shall be distributed respectively to those who would have taken in the event that each designated beneficiary had survived.\n(3) Death of joint tenants or tenants by the entirety; division of property. Where there is no sufficient evidence that two joint tenants or tenants by the entirety have died otherwise than simultaneously the property so held shall be distributed one-half as if one had survived and one-half as if the other had survived. If there are more than two joint tenants and all of them have so died the property thus distributed shall be in the proportion that one bears to the whole number of joint tenants.\n(4) Death of insured and beneficiary; division of property. Where the insured and the beneficiary in a policy of life or accident insurance have died and there is no sufficient evidence that they have died otherwise than simultaneously the proceeds of the policy shall be distributed as if the insured had survived the beneficiary.\n(c) Not retroactive. This section does not apply to the distribution of the property of a person who has died before it takes effect. Paragraph (a) applies only to persons who die on or after August 1, 1999.\n(d) Application. This section does not apply in the case of wills, trusts, deeds, contracts of insurance, or documents exercising powers of appointment wherein provision has been made for distribution of property different from the provisions of this section. Paragraph (a) does not apply to trusts which are part of a qualified or nonqualified retirement plan or individual retirement accounts.",
	"repealed": false
}