{
	"id": "16B.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/16B.55",
	"title": "16B.55 USE OF STATE VEHICLES; COMPENSATION FOR USE OF PERSONAL VEHICLES.",
	"text": "For purposes of this section, \"state vehicle\" means a vehicle owned or leased by the state or loaned to the state.\nA state vehicle may be used only for authorized state business. A state vehicle may not be used for transportation to or from the residence of a state employee, except as provided in subdivision 3.\nA state vehicle may be used by a state employee to travel to or from the employee's residence:\n(1) on a day on which it may be necessary for the employee to respond to a work-related emergency during hours when the employee is not normally working;\n(2) if the employee has been assigned the use of a state vehicle for authorized state business on an extended basis, and the employee's primary place of work is not the state work station to which the employee is permanently assigned;\n(3) if the employee has been assigned the use of a state vehicle for authorized state business away from the work station to which the employee is permanently assigned, and the number of miles traveled, or the time needed to conduct the business, will be minimized if the employee uses a state vehicle to travel to the employee's residence before or after traveling to the place of state business; or\n(4) if the employee is authorized to participate in a ride-sharing program established by the commissioner pursuant to section 174.257.\nUse of a state vehicle under this subdivision requires the prior approval of the agency head or the designee of the agency head.\nNo state employee shall be compensated by the state for use of a personal vehicle for travel between the employee's residence and the state work station to which the employee is permanently assigned, except pursuant to a collective bargaining agreement negotiated under chapter 179A or a compensation plan adopted by the commissioner of management and budget under section 43A.05. A collective bargaining agreement or compensation plan may only provide for this compensation in cases in which an employee is called back to work during hours when the employee is not normally working.\nSubdivisions 2 to 4 do not apply to the van pooling program established in section 16B.56, to a ride-sharing program established by the Department of Transportation, to a trooper employed by the State Patrol, or to use of a state vehicle by the governor or lieutenant governor.\nThe commissioner shall set operating procedures for use of state vehicles. These operating procedures are not subject to the Administrative Procedure Act.",
	"repealed": false
}