{
	"id": "480.065",
	"url": "https://www.revisor.mn.gov/statutes/cite/480.065",
	"title": "480.065 UNIFORM CERTIFICATION OF QUESTIONS OF LAW.",
	"text": "In this section:\n(1) \"State\" means a state of the United States, the District of Columbia, the Commonwealth of Puerto Rico, or any territory or insular possession subject to the jurisdiction of the United States.\n(2) \"Tribe\" means a tribe, band, or village of Native Americans which is recognized by federal law or formally acknowledged by a state.\nThe supreme court or the court of appeals of this state, on the motion of a party to pending litigation or its own motion, may certify a question of law to the highest court of another state, of a tribe, of Canada or a Canadian province or territory, or of Mexico or a Mexican state if:\n(1) the pending litigation involves a question to be decided under the law of the other jurisdiction;\n(2) the answer to the question may be determinative of an issue in the pending litigation; and\n(3) the question is one for which an answer is not provided by a controlling appellate decision, constitutional provision, or statute of the other jurisdiction.\nThe supreme court of this state may answer a question of law certified to it by a court of the United States or by an appellate court of another state, of a tribe, of Canada or a Canadian province or territory, or of Mexico or a Mexican state, if the answer may be determinative of an issue in pending litigation in the certifying court and there is no controlling appellate decision, constitutional provision, or statute of this state.\nThe supreme court of this state may reformulate a question of law certified to it.\nThe court certifying a question of law to the supreme court of this state shall issue a certification order and forward it to the supreme court of this state. Before responding to a certified question, the supreme court of this state may require the certifying court to deliver all or part of its record to the supreme court of this state.\n(a) A certification order must contain:\n(1) the question of law to be answered;\n(2) the facts relevant to the question, showing fully the nature of the controversy out of which the question arose;\n(3) a statement acknowledging that the supreme court of this state, acting as the receiving court, may reformulate the question; and\n(4) the names and addresses of counsel of record and parties appearing without counsel.\n(b) If the parties cannot agree upon a statement of facts, the certifying court shall determine the relevant facts and state them as a part of its certification order.\nThe supreme court of this state, acting as a receiving court, shall notify the certifying court of acceptance or rejection of the question and, in accordance with notions of comity and fairness, respond to an accepted certified question as soon as practicable.\nAfter the supreme court of this state has accepted a certified question, proceedings are governed by the rules and statutes of this state. Procedures for certification from this state to a receiving court are those provided in the rules and statutes of the receiving forum.\nThe supreme court of this state shall state in a written opinion the law answering the certified question and send a copy of the opinion to the certifying court, counsel of record, and parties appearing without counsel.\nFees and costs are the same as in civil appeals docketed before the supreme court of this state and must be equally divided between the parties unless otherwise ordered by the certifying court.\nThis section may be cited as the \"Uniform Certification of Questions of Law Act (1997).\"",
	"repealed": false
}