{
	"id": "84.791",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.791",
	"title": "84.791 EDUCATION AND TRAINING.",
	"text": "(a) The commissioner shall establish a comprehensive off-highway motorcycle environment and safety education and training program, including the preparation and dissemination of vehicle information and safety advice to the public, the training of off-highway motorcycle operators, and the issuance of off-highway motorcycle safety certificates to operators under the age of 16 years who successfully complete the off-highway motorcycle environment and safety education and training courses.\n(b) An individual who is convicted of violating a law related to the operation of an off-highway motorcycle must successfully complete the environment and safety education and training program established under paragraph (a) before continuing operation of an off-highway motorcycle.\nFor the purposes of administering the program and to defray a portion of the expenses of training and certifying vehicle operators, the commissioner shall collect a fee not to exceed $5 from each person who receives the training. The commissioner shall collect a fee for issuing a duplicate off-highway motorcycle safety certificate. The commissioner shall establish the fee for a duplicate off-highway motorcycle safety certificate, to include a $1 issuing fee for licensing agents, that neither significantly overrecovers nor underrecovers costs, including overhead costs, involved in providing the service. The fees, except for the issuing fee for licensing agents under this subdivision, shall be deposited in the state treasury and credited to the off-highway motorcycle account in the natural resources fund.\nThe commissioner shall cooperate with private organizations and associations, private and public corporations, and local governmental units in furtherance of the program established under this section. The commissioner shall consult with the commissioner of public safety in regard to training program subject matter and performance testing that leads to the certification of off-road motorcycle operators.\n(a) The commissioner may enter into reciprocity agreements or otherwise certify off-highway motorcycle environment and safety education and training courses from other states that are substantially similar to in-state courses. Proof of completion of a course subject to a reciprocity agreement or certified as substantially similar is adequate to meet the safety certificate requirements of sections 84.787 to 84.795.\n(b) Proof of completion of the Motorcycle Safety Foundation Dirtbike School is adequate to meet the safety certificate requirements of sections 84.787 to 84.795.\nThe fees provided for under subdivision 2 are not subject to the rulemaking provisions of chapter 14 and section 14.386 does not apply. The commissioner may establish the fees under subdivision 2 notwithstanding section 16A.1283.",
	"repealed": false
}