{
	"id": "82A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/82A.05",
	"title": "82A.05 DISCLOSURE STATEMENT.",
	"text": "A disclosure statement shall be delivered to each person to whom an offer is made before or concurrently with:\n(1) the first written offer other than offer by means of an advertisement; or\n(2) any payment pursuant to a sale, whichever occurs first.\nEach person to whom an offer is made must be afforded a reasonable opportunity to examine the disclosure statement and must be permitted to retain the statement. The seller shall obtain a receipt, signed by the person, acknowledging that the person has received a copy of the disclosure statement prior to the execution by the purchaser of any membership camping contract. All receipts shall be kept in files which are in the possession of the membership camping operator or broker subject to inspection by the commissioner, for a period of three years from the date of the receipt.\nA disclosure statement shall include the following information:\n(1) the name, principal address, and telephone number of the membership camping operator and of its offices in this state;\n(2) a brief description of the membership camping operator's experience in the membership camping business, including the number of years the membership camping operator has been in the membership camping business;\n(3) a brief description of the campgrounds owned or operated by the membership camping operator and represented as available for use by purchasers, including identification of the amenities then available for use by purchasers, whether amenities will be available to nonpurchasers and, if so, the price to nonpurchasers therefor;\n(4) a statement of whether or not the operator has obtained a bond, deposited funds in an escrow account, obtained an irrevocable letter of credit, or provided any other assurance securing the cost of the amenities which are represented as planned to be constructed or installed in the future for use by purchasers and, if so, the identity of the amenities and the year in which completion is estimated to occur;\n(5) a description of the nature of the purchaser's title to, interest in, or right or license to use the campgrounds and amenities;\n(6) a description of the membership camping operator's ownership of, or other right to use, the campground and amenities represented to be available for use by purchasers, together with a brief description of any material blanket or other material encumbrance on the campground, and the material provisions of any agreements which materially restrict a purchaser's use of the property, and a statement of the consequences to purchasers in the event of any conveyances of the campgrounds or foreclosure or other adverse action which can be taken with respect to the encumbrances;\n(7) a statement or summary of what required material discretionary land use permits, the issuance of which is in the discretion of the issuing governmental authority, have not been obtained for each campground located in this state, and a description of the conditions that must be met to obtain the permits that have not yet been obtained;\n(8) a summary and copy of the articles, bylaws, rules, restrictions, or covenants regulating the purchaser's use of each campground and amenities on each campground in this state, including a statement of whether and how the articles, bylaws, rules, restrictions, or covenants may be changed; provided that the foregoing need not include any rules adopted in response to unique local or immediate needs if the rules are posted at the campground;\n(9) a description of all payments required of a purchaser under a membership camping contract, including initial fees and any further fees, charges or assessments, together with any provisions for changing the payments;\n(10) a description of any restraints on the transfer of membership camping contracts;\n(11) a statement of the assistance, if any, that the membership camping operator will provide to the purchaser in the resale of membership camping contracts;\n(12) a description of the policies of the membership camping operator relating to the availability of camping sites and whether reservations are required;\n(13) a description of the membership camping operator's right to change or withdraw from use all or a material portion of the campgrounds or amenities and the extent to which the operator is obligated to replace campgrounds or amenities withdrawn;\n(14) a description of any grounds for forfeiture of a membership camping contract;\n(15) a statement of the person's right to cancel the membership camping contract as provided in section 82A.11;\n(16) a statement describing all material terms and conditions of any reciprocal program represented to be available to purchasers, including whether the purchaser's participation in the reciprocal program is dependent upon the continued participation of the membership camping operator in the reciprocal program and whether the membership camping operator reserves the right to terminate the participation; and\n(17) such additional information as may be reasonably required by the commissioner to assure full and fair disclosure of all material facts to prospective purchasers.\nThe disclosure statement shall not be used for any promotional purpose before registration of the membership camping contracts and after registration, when required to be delivered pursuant to subdivision 1, it shall be used only in its entirety. A person may not advertise or represent that the commissioner has approved or recommended the membership camping contracts or sale thereof. A portion of the disclosure statement may not be underscored, italicized, or printed in larger or heavier or different color type than the remainder of the statement if the effect is to render the statement misleading or deceptive.\nA membership camping contract which contains all of the information required by subdivision 2 shall be deemed to be a disclosure statement within the meaning of this section. Delivery of such a membership camping contract shall be sufficient compliance with the requirements imposed by this section for delivery of a disclosure statement.\nAny disclosure statement which complies with the requirements of any federal law or the laws of any other state requiring substantially the same disclosure of information as is required by this section, may by rule or order of the commissioner be deemed to be in full or partial compliance with this section.\nIf the membership camping operator or that person's salespeople represents to a prospective purchaser that the operator plans to construct or install any amenities in the future, but the operator has not guaranteed to do so, the operator shall furnish a separate disclosure to the prospective purchaser. The separate disclosure shall be in 10-point bold type and shall state: NOTICE: PURCHASE THIS MEMBERSHIP CAMPING CONTRACT ONLY ON THE BASIS OF EXISTING AMENITIES. CONSTRUCTION OF PLANNED AMENITIES IS NOT GUARANTEED. CONSTRUCTION MAY BE DEFERRED, REVISED, OR CANCELED FOR A VARIETY OF REASONS. THE PLANNED AMENITIES FOR THIS CAMPGROUND ARE (Insert list of amenities, including estimated year of completion of each). IF THE SALESPERSON DESCRIBES A SIGNIFICANT AMENITY WHICH IS NOT ON THIS LIST, TELEPHONE COLLECT OR TOLL FREE TO (Insert headquarters telephone number) TO VERIFY THE OPERATOR'S PLAN FOR SUCH A FACILITY.\nThe separate disclosure shall be delivered to each person to whom an offer is made before or concurrently with:\n(1) the first written offer other than offer by means of an advertisement; or\n(2) any payment pursuant to a sale, whichever is first.\nThe seller shall obtain a receipt, signed by the person, acknowledging that the person has received a copy of the separate disclosure required herein prior to the execution by the purchaser of any membership camping contract. All receipts shall be kept in files which are in the possession of the membership camping operator or broker subject to inspection by the commissioner for a period of three years from the date of the receipt.",
	"repealed": false
}