{
	"id": "116C.779",
	"url": "https://www.revisor.mn.gov/statutes/cite/116C.779",
	"title": "116C.779 FUNDING FOR RENEWABLE DEVELOPMENT.",
	"text": "(a) The renewable development account is established as a separate account in the special revenue fund in the state treasury. Appropriations and transfers to the account shall be credited to the account. Earnings, such as interest, dividends, and any other earnings arising from assets of the account, shall be credited to the account. Funds remaining in the account at the end of a fiscal year are not canceled to the general fund but remain in the account until expended. The account shall be administered by the commissioner of management and budget as provided under this section.\n(b) On July 1, 2017, the public utility that owns the Prairie Island nuclear generating plant must transfer all funds in the renewable development account previously established under this subdivision and managed by the public utility to the renewable development account established in paragraph (a). Funds awarded to grantees in previous grant cycles that have not yet been expended and unencumbered funds required to be paid in calendar year 2017 under paragraphs (f) and (g), and sections 116C.7792 and 216C.41, are not subject to transfer under this paragraph.\n(c) Except as provided in subdivision 1a, beginning January 15, 2018, and continuing each January 15 thereafter, the public utility that owns the Prairie Island nuclear generating plant must transfer to the renewable development account $500,000 each year for each dry cask containing spent fuel that is located at the Prairie Island power plant for each year the plant is in operation, and $7,500,000 each year the plant is not in operation if ordered by the commission pursuant to paragraph (i). The fund transfer must be made if nuclear waste is stored in a dry cask at the independent spent-fuel storage facility at Prairie Island for any part of a year. The total amount transferred annually under this paragraph must be reduced by $3,750,000.\n(d) Except as provided in subdivision 1a, beginning January 15, 2018, and continuing each January 15 thereafter, the public utility that owns the Monticello nuclear generating plant must transfer to the renewable development account $350,000 each year for each dry cask containing spent fuel that is located at the Monticello nuclear power plant for each year the plant is in operation, and $5,250,000 each year the plant is not in operation if ordered by the commission pursuant to paragraph (i). The fund transfer must be made if nuclear waste is stored in a dry cask at the independent spent-fuel storage facility at Monticello for any part of a year.\n(e) Each year, the public utility shall withhold from the funds transferred to the renewable development account under paragraphs (c) and (d) the amount necessary to pay its obligations under paragraphs (f) and (g), and sections 116C.7792 and 216C.41, for that calendar year.\n(f) If the commission approves a new or amended power purchase agreement, the termination of a power purchase agreement, or the purchase and closure of a facility under section 216B.2424, subdivision 9, with an entity that uses poultry litter to generate electricity, the public utility subject to this section shall enter into a contract with the city in which the poultry litter plant is located to provide grants to the city for the purposes of economic development on the following schedule: $4,000,000 in fiscal year 2018; $6,500,000 each fiscal year in 2019 and 2020; and $3,000,000 in fiscal year 2021. The grants shall be paid by the public utility from funds withheld from the transfer to the renewable development account, as provided in paragraphs (b) and (e).\n(g) If the commission approves a new or amended power purchase agreement, or the termination of a power purchase agreement under section 216B.2424, subdivision 9, with an entity owned or controlled, directly or indirectly, by two municipal utilities located north of Constitutional Route No. 8, that was previously used to meet the biomass mandate in section 216B.2424, the public utility that owns a nuclear generating plant shall enter into a grant contract with such entity to provide $6,800,000 per year for five years, commencing 30 days after the commission approves the new or amended power purchase agreement, or the termination of the power purchase agreement, and on each June 1 thereafter through 2021, to assist the transition required by the new, amended, or terminated power purchase agreement. The grant shall be paid by the public utility from funds withheld from the transfer to the renewable development account as provided in paragraphs (b) and (e).\n(h) The collective amount paid under the grant contracts awarded under paragraphs (f) and (g) is limited to the amount deposited into the renewable development account, and its predecessor, the renewable development account, established under this section, that was not required to be deposited into the account under Laws 1994, chapter 641, article 1, section 10.\n(i) After discontinuation of operation of the Prairie Island nuclear plant or the Monticello nuclear plant and each year spent nuclear fuel is stored in dry cask at the discontinued facility, the commission shall require the public utility to pay $7,500,000 for the discontinued Prairie Island facility and $5,250,000 for the discontinued Monticello facility for any year in which the commission finds, by the preponderance of the evidence, that the public utility did not make a good faith effort to remove the spent nuclear fuel stored at the facility to a permanent or interim storage site out of the state. This determination shall be made at least every two years.\n(j) Funds in the account may be expended only for any of the following purposes:\n(1) to stimulate research and development of renewable electric energy technologies;\n(2) to encourage grid modernization, including, but not limited to, projects that implement electricity storage, load control, and smart meter technology; and\n(3) to stimulate other innovative energy projects that reduce demand and increase system efficiency and flexibility.\nExpenditures from the fund must benefit Minnesota ratepayers receiving electric service from the utility that owns a nuclear-powered electric generating plant in this state or the Prairie Island Indian community or its members.\nThe utility that owns a nuclear generating plant is eligible to apply for grants under this subdivision.\n(k) For the purposes of paragraph (j), the following terms have the meanings given:\n(1) \"renewable\" has the meaning given in section 216B.2422, subdivision 1, paragraph (c), clauses (1), (2), (4), and (5); and\n(2) \"grid modernization\" means:\n(i) enhancing the reliability of the electrical grid;\n(ii) improving the security of the electrical grid against cyberthreats and physical threats; and\n(iii) increasing energy conservation opportunities by facilitating communication between the utility and its customers through the use of two-way meters, control technologies, energy storage and microgrids, technologies to enable demand response, and other innovative technologies.\n(l) A renewable development account advisory group that includes, among others, representatives of the public utility and its ratepayers, and includes at least one representative of the Prairie Island Indian community appointed by that community's tribal council, shall develop recommendations on account expenditures. The advisory group must design a request for proposal and evaluate projects submitted in response to a request for proposals. The advisory group must utilize an independent third-party expert to evaluate proposals submitted in response to a request for proposal, including all proposals made by the public utility. A request for proposal for research and development under paragraph (j), clause (1), may be limited to or include a request to higher education institutions located in Minnesota for multiple projects authorized under paragraph (j), clause (1). The request for multiple projects may include a provision that exempts the projects from the third-party expert review and instead provides for project evaluation and selection by a merit peer review grant system. In the process of determining request for proposal scope and subject and in evaluating responses to request for proposals, the advisory group must strongly consider, where reasonable:\n(1) potential benefit to Minnesota citizens and businesses and the utility's ratepayers; and\n(2) the proposer's commitment to increasing the diversity of the proposer's workforce and vendors.\n(m) The advisory group shall submit funding recommendations to the public utility, which has full and sole authority to determine which expenditures shall be submitted by the advisory group to the legislature. The commission may approve proposed expenditures, may disapprove proposed expenditures that it finds not to be in compliance with this subdivision or otherwise not in the public interest, and may, if agreed to by the public utility, modify proposed expenditures. The commission shall, by order, submit its funding recommendations to the legislature as provided under paragraph (n).\n(n) The commission shall present its recommended appropriations from the account to the senate and house of representatives committees with jurisdiction over energy policy and finance annually by February 15. Expenditures from the account must be appropriated by law. In enacting appropriations from the account, the legislature:\n(1) may approve or disapprove, but may not modify, the amount of an appropriation for a project recommended by the commission; and\n(2) may not appropriate money for a project the commission has not recommended funding.\n(o) A request for proposal for renewable energy generation projects must, when feasible and reasonable, give preference to projects that are most cost-effective for a particular energy source.\n(p) The advisory group must annually, by February 15, report to the chairs and ranking minority members of the legislative committees with jurisdiction over energy policy on projects funded by the account for the prior year and all previous years. The report must, to the extent possible and reasonable, itemize the actual and projected financial benefit to the public utility's ratepayers of each project.\n(q) A project receiving funds from the account must produce a written final report that includes sufficient detail for technical readers and a clearly written summary for nontechnical readers. The report must include an evaluation of the project's financial, environmental, and other benefits to the state and the public utility's ratepayers. A project receiving funds from the account must submit a report that meets the requirements of section 216C.51, subdivisions 3 and 4, each year the project funded by the account is in progress.\n(r) Final reports, any mid-project status reports, and renewable development account financial reports must be posted online on a public website designated by the commissioner of commerce.\n(s) All final reports must acknowledge that the project was made possible in whole or part by the Minnesota renewable development account, noting that the account is financed by the public utility's ratepayers.\n(t) Of the amount in the renewable development account, priority must be given to making the payments required under section 216C.417.\n(u) Construction projects receiving funds from this account are subject to the requirement to pay the prevailing wage rate, as defined in section 177.42 and the requirements and enforcement provisions in sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45.\n(a) Until January 1, 2021, $10,900,000 annually must be allocated from available funds in the account to fund renewable energy production incentives. $9,400,000 of this annual amount is for incentives for electricity generated by wind energy conversion systems that are eligible for the incentives under section 216C.41 or Laws 2005, chapter 40.\n(b) The balance of this amount, up to $1,500,000 annually, may be used for production incentives for on-farm biogas recovery facilities and hydroelectric facilities that are eligible for the incentive under section 216C.41 or for production incentives for other renewables, to be provided in the same manner as under section 216C.41.\n(c) Any portion of the $10,900,000 not expended in any calendar year for the incentive is available for other spending purposes under subdivision 1. This subdivision does not create an obligation to contribute funds to the account.\n(d) The Department of Commerce shall determine eligibility of projects under section 216C.41 for the purposes of this subdivision. At least quarterly, the Department of Commerce shall notify the public utility of the name and address of each eligible project owner and the amount due to each project under section 216C.41. The public utility shall make payments within 15 working days after receipt of notification of payments due.\n[Repealed, 2017 c 94 art 10 s 30]",
	"repealed": false
}