{
	"id": "124D.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.60",
	"title": "124D.60 RIGHTS OF PARENTS.",
	"text": "Within 30 calendar days after the beginning of the school year, the district or charter school in which the English learner identified for participation in an instructional program for English learners is enrolled must notify the parents. For those children who have not been identified as English learners prior to the beginning of the school year but are identified as English learners during that school year, the district or charter school shall notify the children's parents during the first two weeks of the child being placed in a language instruction educational program. This notice must:\n(1) be in writing in English and in the primary language of the pupil's parents;\n(2) inform the parents that their child has been enrolled in an instructional program for English learners;\n(3) contain a simple, nontechnical description of the purposes, method and content of the program;\n(4) inform the parents that they have the right to visit the educational program for English learners in which their child is enrolled;\n(5) inform the parents of the time and manner in which to request and receive a conference for the purpose of explaining the nature and purpose of the program; and\n(6) inform the parents of their rights to withdraw their child from an educational program for English learners and the time and manner in which to do so.\nThe department shall, at the request of the district, prepare the notice in the primary language of the parent.\nAny parent whose child is enrolled in an educational program for English learners shall have the right, either at the time of the original notification of enrollment or at the close of any semester thereafter, to withdraw the child from the program by providing written notice of this intent to the principal of the school in which the child is enrolled or to the superintendent of the district in which the child resides. Nothing in this section shall preclude a parent from reenrolling the child in an educational program for English learners.\nA district which receives moneys pursuant to section 124D.65 must encourage involvement of parents of pupils enrolled in the educational program for English learners in this program. The district shall solicit the views of parents about the program and its effects upon their children.",
	"repealed": false
}