{
	"id": "53B.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/53B.43",
	"title": "53B.43 ACQUISITION OF CONTROL.",
	"text": "(a) Any person, or group of persons acting in concert, seeking to acquire control of a licensee must obtain the commissioner's written approval before acquiring control. An individual is not deemed to acquire control of a licensee and is not subject to these acquisition of control provisions when that individual becomes a key individual in the ordinary course of business.\n(b) For the purpose of this section, a person is presumed to exercise a controlling influence when the person holds the power to vote, directly or indirectly, at least ten percent of the outstanding voting shares or voting interests of a licensee or person in control of a licensee. A person presumed to exercise a controlling influence as defined by this subdivision can rebut the presumption of control if the person is a passive investor.\n(c) For purposes of determining the percentage of a person controlled by any other person, the person's interest must be aggregated with the interest of any other immediate family member, including the person's spouse, parents, children, siblings, mothers- and fathers-in-law, sons- and daughters-in-law, brothers- and sisters-in-law, and any other person who shares the person's home.\n(d) A person, or group of persons acting in concert, seeking to acquire control of a licensee must, in cooperation with the licensee:\n(1) submit an application in a form and in a medium prescribed by the commissioner; and\n(2) submit a nonrefundable fee of $4,000 with the request for approval.\n(e) Upon request, the commissioner may permit a licensee or the person, or group of persons acting in concert, to submit some or all information required by the commissioner pursuant to paragraph (d), clause (1), without using NMLS.\n(f) The application required by paragraph (d), clause (1), must include information required by section 53B.39 for any new key individuals that have not previously completed the requirements of section 53B.39 for a licensee.\n(g) When an application for acquisition of control under this section appears to include all of the items and address all of the matters that are required, the application is considered complete and the commissioner must promptly notify the applicant in a record of the date on which the application was determined to be complete.\n(h) The commissioner must approve or deny the application within 60 days after the completion date. If the application is not approved or denied within 60 days after the completion date, the application is approved and the person, or group of persons acting in concert, are not prohibited from acquiring control. The commissioner may extend the application period for good cause.\n(i) The commissioner's determination that an application is complete and is accepted for processing means only that the application, on the application's face, appears to include all of the items and address all of the matters that are required. The commissioner's determination that an application is complete is not an assessment of the application's substance or of the sufficiency of the information provided.\n(j) When an application is filed and considered complete under paragraph (g), the commissioner must investigate the financial condition and responsibility; the financial and business experience; character; and the general fitness of the person, or group of persons acting in concert, seeking to acquire control. The commissioner must approve an acquisition of control under this section if the commissioner finds:\n(1) the requirements of paragraphs (d) and (f) have been met, as applicable; and\n(2) the financial condition and responsibility, financial and business experience, competence, character, and general fitness of the person, or group of persons acting in concert, seeking to acquire control; and the competence, experience, character, and general fitness of the key individuals and persons that control the licensee after the acquisition of control indicate that it is in the interest of the public to permit the person, or group of persons acting in concert, to control the licensee.\n(k) If an applicant avails itself of or is otherwise subject to a multistate licensing process:\n(1) the commissioner is authorized to accept the investigation results of a lead investigative state for the purposes of paragraph (j); or\n(2) if Minnesota is a lead investigative state, the commissioner is authorized to investigate the applicant under paragraph (j) and consistent with the time frames established by agreement through the multistate licensing process.\n(l) The commissioner must issue a formal written notice of the denial of an application to acquire control. The commissioner must set forth in the notice of denial the specific reasons the application was denied. An applicant whose application is denied by the commissioner under this paragraph may appeal the denial within 30 days of the date the written notice of the denial is received. Chapter 14 applies to appeals under this paragraph.\n(m) Paragraphs (a) and (d) do not apply to:\n(1) a person that acts as a proxy for the sole purpose of voting at a designated meeting of the shareholders or holders of voting shares or voting interests of a licensee or a person in control of a licensee;\n(2) a person that acquires control of a licensee by devise or descent;\n(3) a person that acquires control of a licensee as a personal representative, custodian, guardian, conservator, or trustee, or as an officer appointed by a court of competent jurisdiction or by operation of law;\n(4) a person that is exempt under section 53B.29, clause (7);\n(5) a person that the commissioner determines is not subject to paragraph (a), based on the public interest;\n(6) a public offering of securities of a licensee or a person in control of a licensee; or\n(7) an internal reorganization of a person controlling the licensee, where the ultimate person controlling the licensee remains the same.\n(n) A person identified in paragraph (m), clause (2), (3), (4), or (6), that is cooperating with the licensee must notify the commissioner within 15 days of the date the acquisition of control occurs.\n(o) Paragraphs (a) and (d) do not apply to a person that has complied with and received approval to engage in money transmission under this chapter, or that was identified as a person in control in a prior application filed with and approved by the commissioner or by another state pursuant to a multistate licensing process, provided that:\n(1) the person has not had a license revoked or suspended or controlled a licensee that has had a license revoked or suspended while the person was in control of the licensee in the previous five years;\n(2) if the person is a licensee, the person is well managed and has received at least a satisfactory rating for compliance at the person's most recent examination by an MSB-accredited state if a rating was given;\n(3) the licensee to be acquired is projected to meet the requirements of sections 53B.59 to 53B.61 after the acquisition of control is completed, and if the person acquiring control is a licensee, the acquiring licensee is also projected to meet the requirements of sections 53B.59 to 53B.61 after the acquisition of control is completed;\n(4) the licensee to be acquired does not implement any material changes to the acquired licensee's business plan as a result of the acquisition of control, and if the person acquiring control is a licensee, the acquiring licensee does not implement any material changes to the acquiring licensee's business plan as a result of the acquisition of control; and\n(5) the person provides notice of the acquisition in cooperation with the licensee and attests to clauses (1), (2), (3), and (4) in a form and in a medium prescribed by the commissioner.\n(p) If the notice under paragraph (o), clause (5), is not disapproved within 30 days after the date on which the notice was determined to be complete, the notice is deemed approved.\n(q) Before filing an application for approval to acquire control of a licensee, a person may request in writing a determination from the commissioner as to whether the person would be considered a person in control of a licensee upon consummation of a proposed transaction. If the commissioner determines that the person would not be a person in control of a licensee, the proposed person and transaction is not subject to paragraphs (a) and (d).\n(r) If a multistate licensing process includes a determination pursuant to paragraph (q) and an applicant avails itself or is otherwise subject to the multistate licensing process:\n(1) the commissioner is authorized to accept the control determination of a lead investigative state with sufficient staffing, expertise, and minimum standards for the purposes of paragraph (q); or\n(2) if Minnesota is a lead investigative state, the commissioner is authorized to investigate the applicant under paragraph (q) and consistent with the time frames established by agreement through the multistate licensing process.",
	"repealed": false
}