{
	"id": "86B.830",
	"url": "https://www.revisor.mn.gov/statutes/cite/86B.830",
	"title": "86B.830 APPLYING FOR AND ISSUING CERTIFICATE OF TITLE.",
	"text": "The owner of a titled watercraft must apply for the first certificate of title of a watercraft in this state to the commissioner or a deputy registrar on a form prescribed by the commissioner. The appropriate fee under section 86B.870 must accompany the application. The application must be signed by the owner and contain:\n(1) the full names, dates of birth, and addresses of owners who are natural persons and the full names and addresses of other owners;\n(2) a description of the watercraft including its make, model, year, length, the principal material used in construction, and the builder's or manufacturer's hull identification number;\n(3) the date of purchase by the applicant, the name and address of the person from whom the watercraft was acquired;\n(4) the name and address of the person who is to possess the title and any conditions of possession; and\n(5) other information required by the commissioner to determine whether the owner is entitled to a certificate of title and whether security interests exist in the watercraft.\n(a) The commissioner shall issue a certificate of title for a watercraft upon verification that:\n(1) the application is genuine;\n(2) the applicant is the owner of the watercraft; and\n(3) payment of the required fee.\n(b) The original certificate of title must be mailed to the owner named in the application. Secured parties, if any, must be mailed notification of their security interest filed.\n(a) A certificate of title issued by the commissioner must contain:\n(1) the date issued;\n(2) the full names, dates of birth, and addresses of owners who are natural persons and the full names and addresses of other owners;\n(3) the names and addresses of secured parties;\n(4) the title number assigned to the watercraft;\n(5) a description of the watercraft including its make, model, year of manufacture, length, principal material used in construction, registration number, and manufacturer's hull identification number or, if none, the builder's hull identification number assigned to the watercraft by the commissioner;\n(6) spaces for assignment of title by the owner or by the dealer and for warranting that the signer is the owner and that the watercraft is not subject to security interests, liens, or encumbrances except as noted on the face of the certificate of title;\n(7) spaces on the certificate for application of title by a new owner subject to the security interests of secured parties named and for the assignment or release of the security interest of a secured party; and\n(8) other information the commissioner may require.\n(b) A certificate of title issued by the commissioner is prima facie evidence of the facts appearing on it.\n(a) If application is made for a certificate of title for a watercraft and the commissioner is not satisfied of the ownership of the watercraft or the existence of security interests in the watercraft, the watercraft may be assigned a title number but the commissioner must:\n(1) withhold issuance of a certificate of title until the applicant presents documents that satisfy the commissioner of the applicant's ownership of the watercraft and of security interest in the watercraft; or\n(2) require the applicant to file a bond in the form prescribed by the commissioner and executed by the applicant as a condition to issuing a certificate of title.\n(b) A bond filed under this subdivision must be accompanied by the deposit of cash or executed by a surety company authorized to do business in this state. The bond must be in an amount equal to 1-1/2 times the value of the watercraft as determined by the commissioner. The bond must be conditioned to indemnify prior owners, secured parties, and later purchasers of the watercraft or persons acquiring a security interest in the watercraft, or successors in interest of the persons, against expenses, losses, or damages, including reasonable attorney fees, by reason of the issuance of the certificate of title to the watercraft or on account of a defect in or undisclosed security interest upon the right, title, and interest of the applicant in the watercraft.\n(c) An interested person has a right of action to recover on the bond for a breach of its conditions, but the aggregate liability of the surety to all persons may not exceed the amount of the bond.\n(d) The commissioner shall return the bond and any deposit accompanying the bond if:\n(1) the commissioner has not been notified of the pendency of an action to recover on the bond;\n(2) questions of ownership and outstanding security interests have been resolved to the satisfaction of the commissioner;\n(3) the bond has been posted for three years or the watercraft is not registered for license purposes in this state under sections 86B.125, 86B.301, and 86B.401 to 86B.421; and\n(4) the currently valid certificate of title is surrendered.\n(a) The commissioner shall maintain records of certificates of title issued under this section according to one of the following systems:\n(1) under a distinctive title number assigned to a watercraft;\n(2) under the registration number awarded to a watercraft in accordance with the registration and numbering law of the state where it is registered;\n(3) alphabetically, under the name of the owner; or\n(4) under another system determined by the commissioner.\n(b) Records relating to watercraft titling maintained by the commissioner are public records and are open to public inspection during regular office hours.\nThe commissioner may not issue a certificate of title if a required fee is not paid or the commissioner has reasonable grounds to believe that:\n(1) the applicant is not the owner of the watercraft;\n(2) the application contains a false statement; or\n(3) the applicant failed to furnish required information or documents or additional information the commissioner reasonably requires.",
	"repealed": false
}