{
	"id": "182.6554",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.6554",
	"title": "182.6554 SAFE PATIENT HANDLING IN CLINICAL SETTINGS.",
	"text": "(a) By July 1, 2010, every clinical setting that moves patients in the state shall develop a written safe patient handling plan to achieve by January 1, 2012, the goal of ensuring the safe handling of patients by minimizing manual lifting of patients by direct patient care workers and by utilizing safe patient handling equipment.\n(b) The plan shall address:\n(1) assessment of risks with regard to patient handling that considers the patient population and environment of care;\n(2) the acquisition of an adequate supply of appropriate safe patient handling equipment;\n(3) initial and ongoing training of direct patient care workers on the use of this equipment;\n(4) procedures to ensure that physical plant modifications and major construction projects are consistent with plan goals; and\n(5) periodic evaluations of the safe patient handling plan.\n(c) A health care organization with more than one covered clinical setting that moves patients may establish a plan at each clinical setting or establish one plan to serve this function for all the clinical settings.\nA clinical setting that moves patients that has already adopted a safe patient handling plan that satisfies the requirements of subdivision 1, or a clinical setting that moves patients that is covered by a safe patient handling plan that is covered under and consistent with section 182.6553, is considered to be in compliance with the requirements of this section.\nThe commissioner shall make training materials on implementation of this section available at no cost to all clinical settings that move patients as part of the training and education duties of the commissioner under section 182.673.\nThis section shall be enforced by the commissioner under section 182.661. An initial violation of this section shall not be assessed a penalty. A subsequent violation of this section is subject to the penalties provided under section 182.666.",
	"repealed": false
}