{
	"id": "245A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.08",
	"title": "245A.08 HEARINGS.",
	"text": "Upon receiving a timely appeal or petition pursuant to section 245A.05, 245A.07, subdivision 3, or 245C.28, the commissioner shall issue a notice of and order for hearing to the appellant under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612.\nAt any hearing provided for by section 245A.05, 245A.07, subdivision 3, or 245C.28, the appellant may be represented by counsel and has the right to call, examine, and cross-examine witnesses. The administrative law judge may require the presence of witnesses and evidence by subpoena on behalf of any party.\n(a) When a denial of a license under section 245A.05 or a licensing sanction under section 245A.07, subdivision 3, is based on a disqualification for which reconsideration was timely requested and which was not set aside under section 245C.22, the scope of the contested case hearing shall include the disqualification and the licensing sanction or denial of a license, unless otherwise specified in this subdivision. When the licensing sanction or denial of a license is based on a determination of maltreatment under section 626.557 or chapter 260E, or a disqualification for serious or recurring maltreatment which was not set aside, the scope of the contested case hearing shall include the maltreatment determination, disqualification, and the licensing sanction or denial of a license, unless otherwise specified in this subdivision. In such cases, a fair hearing under section 256.045 shall not be conducted as provided for in sections 245C.27, 260E.33, and 626.557, subdivision 9d.\n(b) Reconsideration of a maltreatment determination under sections 260E.33 and 626.557, subdivision 9d, and reconsideration of a disqualification under section 245C.22, shall not be conducted when:\n(1) a denial of a license under section 245A.05, or a licensing sanction under section 245A.07, is based on a determination that the license holder is responsible for maltreatment or the disqualification of a license holder is based on serious or recurring maltreatment;\n(2) the denial of a license or licensing sanction is issued at the same time as the maltreatment determination or disqualification; and\n(3) the license holder appeals the maltreatment determination or disqualification, and denial of a license or licensing sanction. In these cases, a fair hearing shall not be conducted under sections 245C.27, 260E.33, and 626.557, subdivision 9d. The scope of the contested case hearing must include the maltreatment determination, disqualification, and denial of a license or licensing sanction.\nNotwithstanding clauses (1) to (3), if the license holder appeals the maltreatment determination or disqualification, but does not appeal the denial of a license or a licensing sanction, reconsideration of the maltreatment determination shall be conducted under sections 260E.33 and 626.557, subdivision 9d, and reconsideration of the disqualification shall be conducted under section 245C.22. In such cases, a fair hearing shall also be conducted as provided under sections 245C.27, 260E.33, and 626.557, subdivision 9d.\n(c) In consolidated contested case hearings regarding sanctions issued in family adult day services, adult foster care, and community residential settings, the county attorney shall defend the commissioner's orders in accordance with section 245A.16, subdivision 4.\n(d) The commissioner's final order under subdivision 5 is the final agency action on the issue of maltreatment and disqualification, including for purposes of subsequent background studies under chapter 245C and is the only administrative appeal of the final agency determination, specifically, including a challenge to the accuracy and completeness of data under section 13.04.\n(e) When consolidated hearings under this subdivision involve a licensing sanction based on a previous maltreatment determination for which the commissioner has issued a final order in an appeal of that determination under section 256.045, or the individual failed to exercise the right to appeal the previous maltreatment determination under section 260E.33 or 626.557, subdivision 9d, the commissioner's order is conclusive on the issue of maltreatment. In such cases, the scope of the administrative law judge's review shall be limited to the disqualification and the licensing sanction or denial of a license. In the case of a denial of a license or a licensing sanction issued to a facility based on a maltreatment determination regarding an individual who is not the license holder or a household member, the scope of the administrative law judge's review includes the maltreatment determination.\n(f) The hearings of all parties may be consolidated into a single contested case hearing upon consent of all parties and the administrative law judge, if:\n(1) a maltreatment determination or disqualification, which was not set aside under section 245C.22, is the basis for a denial of a license under section 245A.05 or a licensing sanction under section 245A.07;\n(2) the disqualified subject is an individual other than the license holder and upon whom a background study must be conducted under section 245C.03; and\n(3) the individual has a hearing right under section 245C.27.\n(g) When a denial of a license under section 245A.05 or a licensing sanction under section 245A.07 is based on a disqualification for which reconsideration was requested and was not set aside under section 245C.22, and the individual otherwise has no hearing right under section 245C.27, the scope of the administrative law judge's review shall include the denial or sanction and a determination whether the disqualification should be set aside, unless section 245C.24 prohibits the set-aside of the disqualification. In determining whether the disqualification should be set aside, the administrative law judge shall consider the factors under section 245C.22, subdivision 4, to determine whether the individual poses a risk of harm to any person receiving services from the license holder.\n(h) Notwithstanding section 245C.30, subdivision 5, when a licensing sanction under section 245A.07 is based on the termination of a variance under section 245C.30, subdivision 4, the scope of the administrative law judge's review shall include the sanction and a determination whether the disqualification should be set aside, unless section 245C.24 prohibits the set-aside of the disqualification. In determining whether the disqualification should be set aside, the administrative law judge shall consider the factors under section 245C.22, subdivision 4, to determine whether the individual poses a risk of harm to any person receiving services from the license holder.\n(a) At a hearing regarding a licensing sanction under section 245A.07, including consolidated hearings under subdivision 2a, the commissioner may demonstrate reasonable cause for action taken by submitting statements, reports, or affidavits to substantiate the allegations that the license holder failed to comply fully with applicable law or rule. If the commissioner demonstrates that reasonable cause existed, the burden of proof shifts to the license holder to demonstrate by a preponderance of the evidence that the license holder was in full compliance with those laws or rules that the commissioner alleges the license holder violated, at the time that the commissioner alleges the violations of law or rules occurred.\n(b) At a hearing on denial of an application, the applicant bears the burden of proof to demonstrate by a preponderance of the evidence that the appellant has complied fully with this chapter and other applicable law or rule and that the application should be approved and a license granted.\nThe administrative law judge shall recommend whether or not the commissioner's order should be affirmed. The recommendations must be consistent with this chapter and the rules of the commissioner. The recommendations must be in writing and accompanied by findings of fact and conclusions and must be mailed to the parties by certified mail to their last known addresses as shown on the license or application.\nAfter considering the findings of fact, conclusions, and recommendations of the administrative law judge, the commissioner shall issue a final order. The commissioner shall consider, but shall not be bound by, the recommendations of the administrative law judge. The appellant must be notified of the commissioner's final order as required by chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The notice must also contain information about the appellant's rights under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The institution of proceedings for judicial review of the commissioner's final order shall not stay the enforcement of the final order except as provided in section 14.65.\n(a) A license holder and each controlling individual of a license holder whose license has been revoked because of noncompliance with applicable law or rule must not be granted a license for five years following the revocation. Notwithstanding the five-year restriction, when a license is revoked because a person, other than the license holder, resides in the home where services are provided and that person has a disqualification that is not set aside and no variance has been granted, the former license holder may reapply for a license when:\n(1) the person with a disqualification, who is not a minor child, is no longer residing in the home and is prohibited from residing in or returning to the home; or\n(2) the person with the disqualification is a minor child, the restriction applies until the minor child becomes an adult and permanently moves away from the home or five years, whichever is less.\n(b) An applicant or controlling individual whose application was denied must not be granted a license for two years following a denial, unless the applicant's subsequent application contains new information which constitutes a substantial change in the conditions that caused the previous denial. The addition of a new co-applicant in a subsequent application does not constitute a substantial change. If an applicant or controlling individual whose application was denied is affiliated with a subsequent application, and two years have not passed since the denial, the subsequent application must be denied.",
	"repealed": false
}