{
	"id": "216B.2422",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2422",
	"title": "216B.2422 RESOURCE PLANNING; RENEWABLE ENERGY.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(b) \"Utility\" means an entity with the capability of generating 100,000 kilowatts or more of electric power and serving, either directly or indirectly, the needs of 10,000 retail customers in Minnesota. Utility does not include federal power agencies.\n(c) \"Renewable energy\" means electricity generated through use of any of the following resources:\n(1) wind;\n(2) solar;\n(3) geothermal;\n(4) hydro;\n(5) trees or other vegetation;\n(6) landfill gas; or\n(7) predominantly organic components of wastewater effluent, sludge, or related by-products from publicly owned treatment works, but not including incineration of wastewater sludge.\n(d) \"Resource plan\" means a set of resource options that a utility could use to meet the service needs of its customers over a forecast period, including an explanation of the supply and demand circumstances under which, and the extent to which, each resource option would be used to meet those service needs. These resource options include using, refurbishing, and constructing utility plant and equipment, buying power generated by other entities, controlling customer loads, and implementing customer energy conservation.\n(e) \"Refurbish\" means to rebuild or substantially modify an existing electricity generating resource of 30 megawatts or greater.\n(f) \"Energy storage system\" means a commercially available technology that:\n(1) uses mechanical, chemical, or thermal processes to:\n(i) store energy, including energy generated from renewable resources and energy that would otherwise be wasted, and deliver the stored energy for use at a later time; or\n(ii) store thermal energy for direct use for heating or cooling at a later time in a manner that reduces the demand for electricity at the later time;\n(2) is composed of stationary equipment;\n(3) if being used for electric grid benefits, is operationally visible and capable of being controlled by the distribution or transmission entity managing it, to enable and optimize the safe and reliable operation of the electric system; and\n(4) achieves any of the following:\n(i) reduces peak or electrical demand;\n(ii) defers the need or substitutes for an investment in electric generation, transmission, or distribution assets;\n(iii) improves the reliable operation of the electrical transmission or distribution systems, while ensuring transmission or distribution needs are not created; or\n(iv) lowers customer costs by storing energy when the cost of generating or purchasing it is low and delivering it to customers when the costs are high.\n(g) \"Local job impacts\" means the impacts of a certificate of need, a power purchase agreement, or commission approval of a new or refurbished energy facility on the availability of construction employment opportunities to local workers.\n(h) \"Local workers\" means workers who:\n(1) are employed to construct and maintain energy infrastructure; and\n(2) are Minnesota residents, are residents of the utility's service territory, or permanently reside within 150 miles of a proposed new or refurbished energy facility.\n(a) A utility shall file a resource plan with the commission periodically in accordance with rules adopted by the commission. The commission shall approve, reject, or modify the plan of a public utility, as defined in section 216B.02, subdivision 4, consistent with the public interest.\n(b) In the resource plan proceedings of all other utilities, the commission's order shall be advisory and the order's findings and conclusions shall constitute prima facie evidence which may be rebutted by substantial evidence in all other proceedings. With respect to utilities other than those defined in section 216B.02, subdivision 4, the commission shall consider the filing requirements and decisions in any comparable proceedings in another jurisdiction.\n(c) As a part of its resource plan filing, a utility shall include the least cost plan for meeting 50 and 75 percent of all energy needs from both new and refurbished generating facilities through a combination of conservation and renewable energy resources.\nEach utility required to file a resource plan under this section shall include in the filing all applicable annual information required by section 216C.17, subdivision 2, and the rules adopted under that section. To the extent that a utility complies with this subdivision, it is not required to file annual advance forecasts with the department under section 216C.17, subdivision 2.\nFor the purposes of this subdivision, a \"cooperative\" means a generating and transmission cooperative electric association that has at least 80 percent of its member distribution cooperatives located outside of Minnesota and that provides less than four percent of the electricity annually sold at retail in the state of Minnesota. A cooperative may, in lieu of filing a resource plan under subdivision 2, elect to file a report to the commission under this subdivision. The report must include projected demand levels for the next 15 years and generation resources to meet any projected generation deficiencies. To supply the information required in a report under this subdivision, a cooperative may use reports submitted under section 216C.17, subdivision 2, reports to regional reliability organizations, or similar reports submitted to other state utility commissions. A report must be submitted annually by July 1, but the commission may extend the time if it finds the extension in the public interest. Presentation of the annual report shall be done in accordance with procedures established by the commission. Data in a report under this subdivision may be aggregate data and need not be separately reported for individual distribution cooperative members of the cooperative. The commission may take whatever action in response to a report under this subdivision that it could take with respect to a report by a cooperative under subdivision 2.\nEach utility required to file a resource plan under subdivision 2 shall include in the filing a narrative identifying and describing the costs, opportunities, and technical barriers to the utility continuing to make progress on its system toward achieving the state greenhouse gas emission reduction goals established in section 216H.02, subdivision 1, and the technologies, alternatives, and steps the utility is considering to address those opportunities and barriers.\nA utility required to file a resource plan under subdivision 2 that has scheduled the retirement of an electric generating facility located in Minnesota must include in the filing a narrative describing the utility's efforts, in conjunction with the utility's workers and the workers' designated representatives, to develop a plan to minimize the dislocations employees may suffer as a result of the facility's retirement. The narrative must address, at a minimum, plans to:\n(1) minimize financial losses to workers;\n(2) provide a transition timeline to ensure certainty for workers;\n(3) protect pension benefits;\n(4) extend or replace health insurance, life insurance, and other employment benefits;\n(5) provide training and skill development for workers who must or choose to leave the utility;\n(6) create targeted transition plans for workers at all locations impacted by the facility retirement; and\n(7) quantify any additional costs the utility would incur and specifying what costs, if any, the utility would request be recovered in the utility's rates as a result of efforts made under this subdivision to minimize impacts to workers.\n(a) The commission shall, to the extent practicable, quantify and establish a range of environmental costs associated with each method of electricity generation. A utility shall use the values established by the commission in conjunction with other external factors, including socioeconomic costs, when evaluating and selecting resource options in all proceedings before the commission, including resource plan and certificate of need proceedings.\n(b) The commission shall provisionally adopt and apply the draft cost of greenhouse gas emissions valuations presented in the United States Environmental Protection Agency's EPA External Review Draft of Report on the Social Cost of Greenhouse Gases: Estimates Incorporating Recent Scientific Advances, released in September 2022, including the time horizon, global estimates of damages, and the full range of discount rates from 2.5 to 1.5 percent, with two percent as the central estimate. The commission shall adopt the estimates contained in the final version of the external review draft report when it becomes available.\n(c) If, at any time, the estimates adopted by the commission under paragraph (a) are exceeded by estimates released by the federal Interagency Working Group on the Social Cost of Greenhouse Gases or its successors, the commission shall adopt the working group estimates.\n(d) The commission shall establish interim environmental cost values associated with each method of electricity generation by March 1, 1994. These values expire on the date the commission establishes environmental cost values under paragraph (a).\nThe commission shall not approve a new or refurbished nonrenewable energy facility in an integrated resource plan or a certificate of need, pursuant to section 216B.243, nor shall the commission allow rate recovery pursuant to section 216B.16 for such a nonrenewable energy facility, unless the utility has demonstrated that a renewable energy facility is not in the public interest. When making the public interest determination, the commission must consider:\n(1) whether the resource plan helps the utility achieve the greenhouse gas reduction goals under section 216H.02, the renewable energy standard under section 216B.1691, or the solar energy standard under section 216B.1691, subdivision 2f;\n(2) impacts on local and regional grid reliability;\n(3) utility and ratepayer impacts resulting from the intermittent nature of renewable energy facilities, including but not limited to the costs of purchasing wholesale electricity in the market and the costs of providing ancillary services; and\n(4) utility and ratepayer impacts resulting from reduced exposure to fuel price volatility, changes in transmission costs, portfolio diversification, and environmental compliance costs.\nAs part of a resource plan filing, a utility must report on associated local job impacts and the steps the utility and the utility's energy suppliers and contractors are taking to maximize the availability of construction employment opportunities for local workers. The commission must consider local job impacts and give preference to proposals that maximize the creation of construction employment opportunities for local workers, consistent with the public interest, when evaluating any utility proposal that involves the selection or construction of facilities used to generate or deliver energy to serve the utility's customers, including but not limited to an integrated resource plan, a certificate of need, a power purchase agreement, or commission approval of a new or refurbished electric generation facility. The commission must, to the maximum extent possible, prioritize the hiring of workers from communities hosting retiring electric generation facilities, including workers previously employed at the retiring facilities.\nThe commission may give preference in resource selection to projects utilizing energy technologies produced domestically by entities who received an advanced manufacturing tax credit for those technologies under section 45X of the Internal Revenue Code, as allowed under the federal Inflation Reduction Act of 2022, Public Law 117-169.\n(a) A utility may select resources to meet its projected energy demand through a bidding process approved or established by the commission. A utility shall use the environmental cost estimates determined under subdivision 3 and consider local job impacts when evaluating bids submitted in a process established under this subdivision.\n(b) Notwithstanding any other provision of this section, if an electric power generating plant, as described in section 216B.2421, subdivision 2, clause (1), is selected in a bidding process approved or established by the commission, a certificate of need proceeding under section 216B.243 is not required.\n(c) A certificate of need proceeding is also not required for an electric power generating plant that has been selected in a bidding process approved or established by the commission, or such other selection process approved by the commission, to satisfy, in whole or in part, the wind power mandate of section 216B.2423 or the biomass mandate of section 216B.2424.\nA utility shall indicate in its resource plan whether it intends to site or construct a large energy facility. If the utility's resource plan includes a proposed large energy facility and construction of that facility is likely to begin before the utility files its next resource plan, the commission shall conduct the resource plan proceeding consistent with the requirements of section 216B.243 with respect to the proposed facility. If the commission approves the proposed facility in the resource plan, a separate certificate of need proceeding is not required.\n(a) Each public utility required to file a resource plan under subdivision 2 must include in the filing an assessment of energy storage systems that analyzes how the deployment of energy storage systems contributes to:\n(1) meeting identified generation and capacity needs; and\n(2) evaluating ancillary services.\n(b) The assessment must employ appropriate modeling methods to enable the analysis required in paragraph (a).\n(a) The commission may issue an order to reduce carbon dioxide emissions from coal-fired electric generating units located in Minnesota that do not have applicable capacity obligations with a regional transmission organization and are wholly owned by a public utility required to file a resource plan under this section. The order may:\n(1) require the public utility to develop and implement a plan to operate coal-fired electric generating units only during the months of June, July, August, December, January, and February, other than for emergency or reliability purposes; or\n(2) establish an annual limit on the carbon dioxide emissions from coal-fired electric generating units.\n(b) Nothing in this subdivision affects a public utility's obligation to comply with the provisions of section 216B.1691.",
	"repealed": false
}