{
	"id": "144A.53",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.53",
	"title": "144A.53 DIRECTOR; POWERS AND DUTIES.",
	"text": "The director may:\n(1) promulgate by rule, pursuant to chapter 14, and within the limits set forth in subdivision 2, the methods by which complaints against health facilities, health care providers, home care providers, or residential care homes, or administrative agencies are to be made, reviewed, investigated, and acted upon; provided, however, that a fee may not be charged for filing a complaint;\n(2) recommend legislation and changes in rules to the state commissioner of health, governor, administrative agencies or the federal government;\n(3) investigate, upon a complaint or upon initiative of the director, any action or failure to act by a health care provider, home care provider, residential care home, or a health facility;\n(4) request and receive access to relevant information, records, incident reports, or documents in the possession of an administrative agency, a health care provider, a home care provider, a residential care home, or a health facility, and issue investigative subpoenas to individuals and facilities for oral information and written information, including privileged information which the director deems necessary for the discharge of responsibilities. For purposes of investigation and securing information to determine violations, the director need not present a release, waiver, or consent of an individual. The identities of patients or residents must be kept private as defined by section 13.02, subdivision 12;\n(5) enter and inspect, at any time, a health facility or residential care home and be permitted to interview staff; provided that the director shall not unduly interfere with or disturb the provision of care and services within the facility or home or the activities of a patient or resident unless the patient or resident consents;\n(6) issue correction orders and assess civil fines pursuant to section 144.653 or any other law which provides for the issuance of correction orders to health facilities or home care provider, or under section 144A.45. A facility's or home's refusal to cooperate in providing lawfully requested information may also be grounds for a correction order;\n(7) recommend the certification or decertification of health facilities pursuant to Title XVIII or XIX of the United States Social Security Act;\n(8) assist patients or residents of health facilities or residential care homes in the enforcement of their rights under Minnesota law; and\n(9) work with administrative agencies, health facilities, home care providers, residential care homes, and health care providers and organizations representing consumers on programs designed to provide information about health facilities to the public and to health facility residents.\n(a) The director may receive a complaint from any source concerning an action of an administrative agency, a health care provider, a home care provider, a residential care home, or a health facility. The director may require a complainant to pursue other remedies or channels of complaint open to the complainant before accepting or investigating the complaint. Investigators are required to interview at least one family member of the vulnerable adult identified in the complaint. If the vulnerable adult is directing his or her own care and does not want the investigator to contact the family, this information must be documented in the investigative file.\n(b) The director shall keep written records of all complaints and any action upon them. After completing an investigation of a complaint, the director shall inform the complainant, the administrative agency having jurisdiction over the subject matter, the health care provider, the home care provider, the residential care home, and the health facility of the action taken. Complainants must be provided a copy of the public report upon completion of the investigation.\nIf, after duly considering a complaint and whatever material the director deems pertinent, the director determines that the complaint is valid, the director may recommend that an administrative agency, a health care provider, a home care provider, a residential care home, or a health facility should:\n(1) modify or cancel the actions which gave rise to the complaint;\n(2) alter the practice, rule or decision which gave rise to the complaint;\n(3) provide more information about the action under investigation; or\n(4) take any other step which the director considers appropriate.\nIf the director requests, the administrative agency, a health care provider, a home care provider, residential care home, or health facility shall, within the time specified, inform the director about the action taken on a recommendation.\nIf a complaint received by the director relates to a matter more properly within the jurisdiction of an occupational licensing board or other governmental agency, the director shall forward the complaint to that agency and shall inform the complaining party of the forwarding. The agency shall promptly act in respect to the complaint, and shall inform the complaining party and the director of its disposition. If a governmental agency receives a complaint which is more properly within the jurisdiction of the director, it shall promptly forward the complaint to the director, and shall inform the complaining party of the forwarding. If the director has reason to believe that an official or employee of an administrative agency, a home care provider, residential care home, or health facility has acted in a manner warranting criminal or disciplinary proceedings, the director shall refer the matter to the state commissioner of health, the commissioner of human services, an appropriate prosecuting authority, or other appropriate agency.",
	"repealed": false
}