{
	"id": "469.059",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.059",
	"title": "469.059 DEVELOPMENT DISTRICT POWERS.",
	"text": "A port authority, or a city authorized by law to exercise the powers of a port authority, may use the powers in this section for the purposes in section 469.058, subdivision 1.\nThe port authority may acquire by lease, purchase, gift, devise, or condemnation proceedings the needed right, title, and interest in property to create industrial development districts. A port authority may lease property in or out of its port district if it believes the property is suitable and proper to use to carry out its duties and responsibilities. It shall pay for the property out of money it receives under sections 469.059 to 469.068. It may hold and dispose of the property subject to the limits and conditions in sections 469.049, 469.050, and 469.058 to 469.068. The title to property acquired by condemnation or purchase must be in fee simple, absolute. The port authority may accept an interest in property acquired in another way subject to any condition of the grantor or donor. The condition must be consistent with the proper use of the property under sections 469.049, 469.050, and 469.058 to 469.068. Property acquired, owned, leased, controlled, used, or occupied by the port authority for any of the purposes of this section is for public governmental and municipal purposes and is exempt from taxation by the state or by its political subdivisions. The exemption applies only while the port authority holds property for its own purpose. When property is sold it begins to be taxed again.\nThe port authority may sign options to purchase, sell, or lease property.\nThe port authority may exercise the power of eminent domain under chapter 117, or under its city's charter to acquire property it is authorized to acquire by condemnation. The port authority may acquire in this way property acquired by its owner by eminent domain or property already devoted to a public use only if its city's council approves. The port authority may take possession of property to be condemned after it files a petition in condemnation proceedings describing the property. The authority may abandon the condemnation before taking possession.\nThe port authority may make contracts for an industrial development purpose within the powers given it in sections 469.049, 469.050, and 469.058 to 469.068.\nThe port authority may be a limited partner.\nThe port authority may acquire rights or an easement for a term of years or perpetually for development of an industrial district.\nThe port authority may buy the supplies and materials it needs to carry out this section.\nThe port authority may accept land, money, or other assistance, whether by gift, loan or otherwise, in any form from the federal or state government, or an agency of either, or a local subdivision of state government to carry out sections 469.048 to 469.068 and to acquire and develop an industrial development district and its facilities under this section.\nThe port authority may use the power of a governmental subdivision under section 282.01 to acquire land for and develop an industrial development district. The authority may exercise the power of a city of the first class under that section to acquire land forfeited to the state for nonpayment of taxes.\nTax-forfeited lands in an industrial development district that are vested in the state shall be conveyed to the port authority that is developing the district for one dollar per tract. The port authority may use and later resell the land for purposes of sections 469.048 to 469.068.\nIn conveying tax-forfeited land to a port authority, the state may not retain a possibility of reverter or right of reentry as it does under section 282.01, subdivision 1e.\nThe commissioner of revenue shall convey tax-forfeited parcels in an industrial development district to the port authority, if the authority petitions for conveyance under sections 469.048 to 469.068 and pays $1 per tract.\nThe attorney general shall approve the form of the deed of conveyance. The port authority shall receive absolute title to the tract, subject only to a reservation of minerals and mineral rights, under section 282.12. The deed of conveyance must not contain a restriction on the use of the premises. The conveyance divests the state of all further right, title, claim or interest in the tracts, except for the reservation of minerals and mineral rights.\nThe port authority may sell or lease land held by it for river, harbor or industrial development in industrial development districts. The authority may, if in the public interest, build suitable buildings or structures on land owned by it. The authority may furnish capital equipment to be located permanently or used exclusively on the lands or in the buildings if necessary to the purposes of the buildings or structures. The port authority must intend that the buildings, structures, and equipment be leased or sold to private persons to further develop the industrial district.\nThe authority may acquire, develop, sell, or lease single or multiple tracts of land regardless of size, to be developed as a part of the industrial development of the district under sections 469.048 to 469.068.\nMS 2011 Supp [Repealed, 2012 c 294 art 2 s 43]\nThe port authority may apply to the board defined in United States Code, title 19, section 81a, for the right to use the powers provided in United States Code, title 19, sections 81a to 81u. If the right is granted, the authority may use the powers in or out of its port district. One authority may apply with another port authority.\nThe port authority may exercise powers and duties of a redevelopment agency under sections 469.152 to 469.165, for a purpose in sections 469.001 to 469.047 or 469.048 to 469.068. The port authority may also exercise the powers and duties in sections 469.001 to 469.047 and 469.048 to 469.068, for a purpose in sections 469.152 to 469.165.\nThe port authority may operate and maintain a public parking or other public facility to promote development in a development district.\nThe port authority may sell, at private or public sale, at the price or prices determined by the authority, any note, mortgage, lease, sublease, lease purchase, or other instrument or obligation evidencing or securing a loan made for the purpose of economic development, job creation, redevelopment, or community revitalization by a public agency to a business, for-profit or nonprofit organization, or an individual.",
	"repealed": false
}