{
	"id": "136A.902",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.902",
	"title": "136A.902 SPINAL CORD AND TRAUMATIC BRAIN INJURY ADVISORY COUNCIL.",
	"text": "The commissioner shall appoint a 14-member advisory council consisting of:\n(1) one member representing the University of Minnesota Medical School;\n(2) one member representing the Mayo Medical School;\n(3) one member representing the Courage Kenny Rehabilitation Center;\n(4) one member representing Hennepin County Medical Center;\n(5) one member who is a neurosurgeon;\n(6) one member who has a spinal cord injury;\n(7) one member who is a family member of a person with a spinal cord injury;\n(8) one member who has a traumatic brain injury;\n(9) one member who is a veteran who has a spinal cord injury;\n(10) one member who is a veteran who has a traumatic brain injury;\n(11) one member who is a family member of a person with a traumatic brain injury;\n(12) one member who is a physician specializing in the treatment of spinal cord injury;\n(13) one member who is a physician specializing in the treatment of traumatic brain injury; and\n(14) one member representing Gillette Children's Specialty Healthcare.\nThe advisory council shall be organized and administered under section 15.059, except that subdivision 2 shall not apply. Except as provided in subdivision 4, the commissioner shall appoint council members to two-year terms and appoint one member as chair. The advisory council does not expire.\nThe commissioner shall appoint the first members of the council by September 1, 2015. The chair shall convene the first meeting by November 1, 2015.\nThe commissioner shall designate six of the initial council members to serve one-year terms and six to serve two-year terms.\nCouncil members must disclose in a written statement any financial interest in any organization that the council recommends to receive a grant. The written statement must accompany the grant recommendations and must explain the nature of the conflict. The council is not subject to policies developed by the commissioner of administration under section 16B.98.\nThe advisory council shall:\n(1) develop criteria for evaluating and awarding the research grants under section 136A.901;\n(2) review research proposals and make recommendations by January 15 of each year to the commissioner for purposes of awarding grants under section 136A.901; and\n(3) perform other duties as authorized by the commissioner.",
	"repealed": false
}