{
	"id": "271.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/271.01",
	"title": "271.01 CREATION OF TAX COURT; JURISDICTION.",
	"text": "There is hereby created a Tax Court as an independent agency of the executive branch of the government. The Tax Court is a court of record. The Tax Court shall consist of three judges, each of whom shall be a citizen of the state, appointed by the governor, by and with the advice and consent of the senate, for a term of six years commencing at the expiration of the preceding term. Any vacancy shall be filled by the governor for the unexpired term, subject to confirmation by the senate. The terms of the judges shall end on the first Monday in January. The terms of the judges shall be staggered, the term of one judge expiring on the first Monday of each odd-numbered year. Judges may serve until their successors are appointed and qualify. They shall be selected on the basis of their experience with and knowledge of taxation and tax laws. The judges of the Tax Court shall be subject to the provisions of the Minnesota Constitution, article VI, section 6, the jurisdiction of the commission on judicial standards, as provided in sections 490A.01 and 490A.02, and the provisions of the Code of Judicial Conduct.\nUpon the retirement of a judge of the Tax Court or the district court, the chief judge of the Tax Court may, with the retired judge's consent, assign the retired judge to hear any case properly assignable to a judge of the Tax Court and to act on it with the full powers of a judge of the Tax Court. A retired judge performing this service shall receive pay and expenses in the amount and manner provided by law for judges serving on the court, less the amount of retirement pay the judge is receiving under chapter 352 or 490.\nMS 1976 [Repealed, 1977 c 307 s 31]\nMS 1976 [Repealed, 1977 c 307 s 31]\nMS 1974 [Repealed, 1976 c 134 s 79]\nMS 1969 [Repealed, 1971 c 753 s 2]\nEach judge of the Tax Court shall receive actual and necessary expenses paid or incurred in the performance of duties as provided in section 43A.04, subdivision 3.\nThe Tax Court shall have statewide jurisdiction. Except for an appeal to the supreme court or any other appeal allowed under this subdivision, the Tax Court shall be the sole, exclusive, and final authority for the hearing and determination of all questions of law and fact arising under the tax laws of the state, as defined in this subdivision, in those cases that have been appealed to the Tax Court and in any case that has been transferred by the district court to the Tax Court. The Tax Court shall have no jurisdiction in any case that does not arise under the tax laws of the state or in any criminal case or in any case determining or granting title to real property or in any case that is under the probate jurisdiction of the district court. The Small Claims Division of the Tax Court shall have jurisdiction only as provided in section 271.21, subdivision 2. The Tax Court shall have no jurisdiction in any case involving an order of the state board of equalization unless a taxpayer contests the valuation of property. Laws governing taxes, aids, and related matters administered by the commissioner of revenue, laws dealing with property valuation, assessment or taxation of property for property tax purposes, and any other laws that contain provisions authorizing review of taxes, aids, and related matters by the Tax Court shall be considered tax laws of this state subject to the jurisdiction of the Tax Court. This subdivision shall not be construed to prevent an appeal, as provided by law, to an administrative agency, board of equalization, review under section 274.13, subdivision 1c, or to the commissioner of revenue. Wherever used in this chapter, the term commissioner shall mean the commissioner of revenue, unless otherwise specified.\nMS 1988 [Repealed, 1989 c 324 s 29]",
	"repealed": false
}