{
	"id": "501B.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/501B.49",
	"title": "501B.49 NOTICE OF HEARING.",
	"text": "On the filing of a petition under section 501B.46 or 501B.47, the court shall, by order, fix a time and place for a hearing on the petition unless a hearing has been waived in writing. In the case of a petition under section 501B.46, each beneficiary of the trust then in being must join in the waiver. In the case of a petition under section 501B.47, each person in being who owns an interest in the real property must join in the waiver.\nNotice of hearing must be given by publishing a copy of the order for hearing one time in a legal newspaper for the county in which the petition is filed at least 20 days before the date of the hearing, and by mailing copies of the order for hearing in the manner specified in this subdivision or in another manner ordered by the court. In the case of a petition under section 501B.46, mailed notice must be given by mailing a copy of the order for hearing to those beneficiaries of the trust then in being who are known to or reasonably ascertainable by the petitioner and, in the case of a beneficiary who is a minor or an incapacitated person as defined in section 524.5-102, subdivision 6 or 10, or otherwise under conservatorship, to the conservator or guardian, or if none is acting within the state, to the guardian ad litem of the beneficiary, at least 15 days before the date of the hearing. In the case of a petition under section 501B.47, mailed notice must be given by mailing a copy of the order for hearing to those persons owning an interest in the real property then in being who are known to or reasonably ascertainable by the petitioner and, in the case of a person who is a minor or an incapacitated person as defined in section 524.5-102, subdivision 6 or 10, or otherwise under conservatorship, to the conservator or guardian, or if none is acting within the state, to the guardian ad litem of the person, at least 15 days before the date of the hearing.",
	"repealed": false
}