{
	"id": "103G.2242",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.2242",
	"title": "103G.2242 WETLAND VALUE REPLACEMENT PLANS.",
	"text": "(a) The board, in consultation with the commissioner, shall adopt rules governing the approval of wetland value replacement plans under this section and public-waters-work permits affecting public waters wetlands under section 103G.245. These rules must address the criteria, procedure, timing, and location of acceptable replacement of wetland values and may address the state establishment and administration of a wetland banking program for public and private projects, including provisions for an in-lieu fee program; mitigating and banking other water and water-related resources; the administrative, monitoring, and enforcement procedures to be used; provisions that protect, or mitigate impacts to, intermittent and perennial watercourses upstream of public waters identified under section 103G.005, subdivision 15, paragraph (a), clause (9) or (10); and a procedure for the review and appeal of decisions under this section. In the case of peatlands, the replacement plan rules must consider the impact on carbon. Any in-lieu fee program established by the board must conform with Code of Federal Regulations, title 33, section 332.8, as amended.\n(b) After the adoption of the rules, a replacement plan must be approved by a resolution of the governing body of the local government unit, consistent with the provisions of the rules or a comprehensive wetland protection and management plan approved under section 103G.2243.\n(c) If the local government unit fails to apply the rules or fails to implement a local comprehensive wetland protection and management plan established under section 103G.2243, the government unit is subject to penalty as determined by the board.\n(d) When making a determination under rules adopted pursuant to this subdivision on whether a rare natural community will be permanently adversely affected, consideration of measures to mitigate any adverse effect on the community must be considered.\n(a) Questions concerning the public value, location, size, or type of a wetland must be submitted to and determined by a Technical Evaluation Panel after an on-site inspection. The Technical Evaluation Panel must be composed of a technical professional employee of the board, a technical professional employee of the local soil and water conservation district or districts, a technical professional with expertise in water resources management appointed by the local government unit, and a technical professional employee of the Department of Natural Resources for projects affecting public waters or wetlands adjacent to public waters.\n(b) For wetland boundary determinations, the panel must use Corps of Engineers Wetland Delineation Manual, United States Army Corps of Engineers (January 1987), including updates, supplementary guidance, and replacements, if any. For wetland type determinations, the panel must also use Wetlands of the United States, United States Fish and Wildlife Service Circular 39 (1971 edition); Classification of Wetlands and Deepwater Habitats of the United States, United States Fish and Wildlife Service (August 2013 edition); or A Hydrogeomorphic Classification for Wetlands, United States Army Corps of Engineers (August 1993), according to rules authorized under this part and including updates, supplementary guidance, and replacements, if any, for any of these publications.\n(c) The panel must provide the wetland determination and recommendations on other technical matters to the local government unit that must approve a replacement plan, sequencing, exemption determination, no-loss determination, or wetland boundary or type determination and may recommend approval or denial of the plan. The authority must consider and include the decision of the Technical Evaluation Panel in their approval or denial of a plan or determination.\n(d) A member of the Technical Evaluation Panel that has a financial interest in a wetland bank or management responsibility to sell or make recommendations in their official capacity to sell credits from a publicly owned wetland bank must disclose that interest, in writing, to the Technical Evaluation Panel and the local government unit.\n(e) Persons conducting wetland or public waters boundary delineations or type determinations are exempt from the requirements of chapter 326. The board may develop a professional wetland delineator certification program.\n(f) The board must establish an interagency team to assist in identifying and evaluating potential wetland replacement sites. The team must consist of members of the Technical Evaluation Panel and representatives from the Department of Natural Resources; the Pollution Control Agency; the United States Army Corps of Engineers, St. Paul district; and other organizations as determined by the board.\n(a) A landowner may apply for a wetland boundary or type determination from the local government unit. The landowner applying for the determination is responsible for submitting proof necessary to make the determination, including, but not limited to, wetland delineation field data, observation well data, topographic mapping, survey mapping, and information regarding soils, vegetation, hydrology, and groundwater both within and outside of the proposed wetland boundary.\n(b) A local government unit that receives an application under paragraph (a) may seek the advice of the Technical Evaluation Panel as described in subdivision 2 and, if necessary, expand the Technical Evaluation Panel. The local government unit may delegate the decision authority for wetland boundary or type determinations to designated staff or establish other procedures it considers appropriate.\n(c) The local government unit decision must be made in compliance with section 15.99. Within ten calendar days of the decision, the local government unit decision must be mailed or sent by electronic transmission to the landowner, members of the Technical Evaluation Panel, the watershed district or watershed management organization, if one exists, and individual members of the public who request a copy. Notwithstanding section 15.99, subdivision 2, the board must establish by rule timelines for project review and comment for wetland banking projects.\n(d) The local government unit decision is valid for five years unless the Technical Evaluation Panel determines that natural or artificial changes to the hydrology, vegetation, or soils of the area have been sufficient to alter the wetland boundary or type.\n(a) Replacement of wetland values must be completed prior to or concurrent with the actual draining or filling of a wetland, unless:\n(1) an irrevocable bank letter of credit or other financial assurance acceptable to the local government unit or the board is given to the local government unit or the board to guarantee the successful completion of the replacement; or\n(2) the replacement is approved under an in-lieu fee program according to rules adopted under subdivision 1. In the case of an in-lieu fee program established by a board-approved sponsor, the board may require that a financial assurance in an amount and method acceptable to the board be given to the board to ensure the approved sponsor fulfills the sponsor's obligation to complete the required wetland replacement.\n(b) The board may establish, sponsor, or administer a wetland banking program, which may include provisions allowing monetary payment to the wetland banking program for impacts to wetlands. The board may acquire land in fee title, purchase or accept easements, enter into agreements, and purchase existing wetland replacement credits to facilitate the wetland banking program. The board may establish wetland credit and in-lieu fee payment amounts and hold money in an account in the special revenue fund, which is appropriated to the board to be used solely for establishing replacement wetlands and administering the wetland banking program.\n(c) The board shall coordinate the establishment and operation of a wetland bank with the United States Army Corps of Engineers, the Natural Resources Conservation Service of the United States Department of Agriculture, and the commissioners of natural resources, agriculture, and the Pollution Control Agency.\nUpon receiving and considering all required data, the local government unit reviewing replacement plan applications, sequencing applications, and exemption or no-loss determination requests must act on all replacement plan applications, sequencing applications, and exemption or no-loss determination requests in compliance with section 15.99.\nThe local government unit and soil and water conservation district may charge processing fees in amounts not greater than are necessary to cover the reasonable costs of implementing the rules adopted under subdivision 1 and for technical and administrative assistance to landowners in processing other applications for projects affecting wetlands.\n(a) Application for approval of a replacement plan under this section must be reviewed by the local government according to section 15.99, subdivision 3, paragraph (a). Copies of the complete application must be mailed or sent by electronic transmission to the members of the Technical Evaluation Panel, the managers of the watershed district if one exists, and the commissioner of natural resources. Individual members of the public who request a copy shall be provided information to identify the applicant and the location and scope of the project.\n(b) For the purpose of this subdivision, \"application\" includes a revised application for replacement plan approval and an application for a revision to an approved replacement plan if:\n(1) the wetland area to be drained or filled under the revised replacement plan is at least ten percent larger than the area to be drained or filled under the original replacement plan; or\n(2) the wetland area to be drained or filled under the revised replacement is located more than 500 feet from the area to be drained or filled under the original replacement plan.\nWithin ten days of the approval or denial of a replacement plan under this section, notice of the decision must be mailed or sent by electronic transmission to members of the Technical Evaluation Panel, the applicant, individual members of the public who request a copy, the managers of the watershed district, if one exists, and the commissioner of natural resources.\nExcept for activities impacting less than 10,000 square feet of wetland, before approval or denial of a replacement plan under this section, comments may be made by the public to the local government unit for a period of 15 days or more, as determined by the local government unit.\n(a) Appeal of a replacement plan, sequencing, exemption, wetland banking, wetland boundary or type determination, or no-loss decision may be obtained by mailing a petition and payment of a filing fee, which shall be retained by the board to defray administrative costs, to the board within 30 days after the postmarked date of the mailing or date of sending by electronic transmission specified in subdivision 7. If appeal is not sought within 30 days, the decision becomes final. If the petition for hearing is accepted, the amount posted must be returned to the petitioner. Appeal may be made by:\n(1) the wetland owner;\n(2) any of those to whom notice is required to be mailed or sent by electronic transmission under subdivision 7; or\n(3) 100 residents of the county in which a majority of the wetland is located.\n(b) Within 30 days after receiving a petition, the board shall decide whether to grant the petition and hear the appeal. The board shall grant the petition unless the board finds that:\n(1) the appeal is without significant merit, trivial, or brought solely for the purposes of delay;\n(2) the petitioner has not exhausted all local administrative remedies;\n(3) expanded technical review is needed;\n(4) the local government unit's record is not adequate; or\n(5) the petitioner has not posted a letter of credit, cashier's check, or cash if required by the local government unit.\n(c) In determining whether to grant the appeal, the board, executive director, or dispute resolution committee shall also consider the size of the wetland, other factors in controversy, any patterns of similar acts by the local government unit or petitioner, and the consequences of the delay resulting from the appeal.\n(d) If an appeal is granted, the appeal must be heard by the committee for dispute resolution of the board, and a decision must be made by the board within 60 days of filing the local government unit's record and the written briefs submitted for the appeal and the hearing. The decision must be served by mail or by electronic transmission to the parties to the appeal and is not subject to the provisions of chapter 14. A decision whether to grant a petition for appeal and a decision on the merits of an appeal must be considered the decision of an agency in a contested case for purposes of judicial review under sections 14.63 to 14.69.\n(e) Notwithstanding section 16A.1283, the board shall establish a fee schedule to defray the administrative costs of appeals made to the board under this subdivision. Fees established under this authority shall not exceed $1,000. Establishment of the fee is not subject to the rulemaking process of chapter 14, and section 14.386 does not apply.\nA landowner or other responsible party may appeal the terms and conditions of a restoration or replacement order within 30 days of receipt of written notice of the order. The time frame for the appeal may be extended beyond 30 days by mutual agreement, in writing, between the landowner or responsible party, the local government unit, and the enforcement authority. If the written request is not submitted within 30 days, the order is final. The board's executive director must review the request and supporting evidence and render a decision within 60 days of receipt of a petition. A decision on an appeal must be considered the decision of an agency in a contested case for purposes of judicial review under sections 14.63 to 14.69.\nThe rules adopted under subdivision 1 shall allow for local government units to use their own notice and public comment procedures so long as the requirements of this section are satisfied.\n[Expired.]\n(a) No public or private wetland restoration, enhancement, or construction may be allowed for replacement unless specifically designated for replacement and paid for by the individual or organization performing the wetland restoration, enhancement, or construction.\n(b) Paragraph (a) does not apply to a wetland whose owner has paid back with interest the individual or organization restoring, enhancing, or constructing the wetland.\n(c) Notwithstanding section 103G.222, subdivision 1, paragraph (i), the following actions, and others established in rule, that are consistent with criteria in rules adopted by the board in conjunction with the commissioners of natural resources and agriculture, are eligible for replacement credit as determined by the local government unit or the board, including enrollment in a statewide wetlands bank:\n(1) reestablishment of permanent native, noninvasive vegetative cover on a wetland on agricultural land that was planted with annually seeded crops, was in a crop rotation seeding of pasture grasses or legumes, or was in a land retirement program during the past ten years;\n(2) buffer areas of permanent native, noninvasive vegetative cover established or preserved on upland adjacent to replacement wetlands;\n(3) wetlands restored for conservation purposes under terminated easements or contracts;\n(4) water quality treatment ponds constructed to pretreat stormwater runoff prior to discharge to wetlands, public waters, or other water bodies, provided that the water quality treatment ponds must be associated with an ongoing or proposed project that will impact a wetland and replacement credit for the treatment ponds is based on the replacement of wetland functions and on an approved stormwater management plan for the local government; and\n(5) in a greater than 80 percent area, restoration and protection of streams and riparian buffers that are important to the functions and sustainability of aquatic resources.\n(d) Notwithstanding section 103G.222, subdivision 1, paragraphs (f) and (g), the board may establish by rule different replacement ratios for restoration projects with exceptional natural resource value.\n[Repealed, 1996 c 462 s 44]\n(a) Fees must be assessed for managing wetland bank accounts and transactions as follows:\n(1) account maintenance annual fee: one percent of the value of credits not to exceed $500;\n(2) account establishment, deposit, or transfer: 6.5 percent of the value of credits not to exceed $1,000 per establishment, deposit, or transfer; and\n(3) withdrawal fee: 6.5 percent of the value of credits withdrawn.\n(b) The board must establish fees based on costs to the agency below the amounts in paragraph (a) for single-user or other dedicated wetland banking accounts.\n(c) Fees for single-user or other dedicated wetland banking accounts established pursuant to section 103G.005, subdivision 10i, clause (4), are limited to establishment of a wetland banking account and are assessed at the rate of 6.5 percent of the value of the credits not to exceed $1,000.\n(d) The board may assess a fee to pay the costs associated with establishing conservation easements, or other long-term protection mechanisms prescribed in the rules adopted under subdivision 1, on property used for wetland replacement.\nAll fees established in subdivisions 9 and 14 must be paid to the Board of Water and Soil Resources and are annually appropriated to the board for the purpose of administration of the wetland bank and to process appeals under section 103G.2242, subdivision 9.",
	"repealed": false
}