{
	"id": "62J.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/62J.26",
	"title": "62J.26 EVALUATION OF PROPOSED HEALTH COVERAGE MANDATES.",
	"text": "(a) For purposes of this section, the following terms have the meanings given unless the context otherwise requires:\n(1) \"commissioner\" means the commissioner of commerce;\n(2) \"enrollee\" has the meaning given in section 62Q.01, subdivision 2b;\n(3) \"health plan\" means a health plan as defined in section 62A.011, subdivision 3, but includes coverage listed in clauses (7) and (10) of that definition;\n(4) \"mandated health benefit proposal\" or \"proposal\" means a proposal that would statutorily require a health plan company to do the following:\n(i) provide coverage or increase the amount of coverage for the treatment of a particular disease, condition, or other health care need;\n(ii) provide coverage or increase the amount of coverage of a particular type of health care treatment or service or of equipment, supplies, or drugs used in connection with a health care treatment or service;\n(iii) provide coverage for care delivered by a specific type of provider;\n(iv) require a particular benefit design or impose conditions on cost-sharing for:\n(A) the treatment of a particular disease, condition, or other health care need;\n(B) a particular type of health care treatment or service; or\n(C) the provision of medical equipment, supplies, or a prescription drug used in connection with treating a particular disease, condition, or other health care need; or\n(v) impose limits or conditions on a contract between a health plan company and a health care provider.\n(b) \"Mandated health benefit proposal\" does not include health benefit proposals:\n(1) amending the scope of practice of a licensed health care professional; or\n(2) that make state law consistent with federal law.\n(a) The commissioner, in consultation with the commissioners of health and management and budget, must evaluate all mandated health benefit proposals as provided under subdivision 3.\n(b) The purpose of the evaluation is to provide the legislature with a complete and timely analysis of all ramifications of any mandated health benefit proposal. The evaluation must include, in addition to other relevant information, the following to the extent applicable:\n(1) scientific and medical information on the mandated health benefit proposal, on the potential for harm or benefit to the patient, and on the comparative benefit or harm from alternative forms of treatment, and must include the results of at least one professionally accepted and controlled trial comparing the medical consequences of the proposed therapy, alternative therapy, and no therapy;\n(2) public health, economic, and fiscal impacts of the mandated health benefit proposal on persons receiving health services in Minnesota, on the relative cost-effectiveness of the proposal, and on the health care system in general;\n(3) the extent to which the treatment, service, equipment, or drug is generally utilized by a significant portion of the population;\n(4) the extent to which insurance coverage for the mandated health benefit proposal is already generally available;\n(5) the extent to which the mandated health benefit proposal, by health plan category, would apply to the benefits offered to the health plan's enrollees;\n(6) the extent to which the mandated health benefit proposal will increase or decrease the cost of the treatment, service, equipment, or drug;\n(7) the extent to which the mandated health benefit proposal may increase enrollee premiums; and\n(8) if the proposal applies to a qualified health plan as defined in section 62A.011, subdivision 7, the cost to the state to defray the cost of the mandated health benefit proposal using commercial market reimbursement rates in accordance with Code of Federal Regulations, title 45, section 155.170.\n(c) The commissioner shall consider actuarial analysis done by health plan companies and any other proponent or opponent of the mandated health benefit proposal in determining the cost of the proposal.\n(d) The commissioner must summarize the nature and quality of available information on these issues, and, if possible, must provide preliminary information to the public. The commissioner may conduct research on these issues or may determine that existing research is sufficient to meet the informational needs of the legislature. The commissioner may seek the assistance and advice of researchers, community leaders, or other persons or organizations with relevant expertise. The commissioner must provide the public with at least 45 days' notice when requesting information pursuant to this section. The commissioner must notify the chief authors of a bill when a request for information is issued.\n(e) Information submitted to the commissioner pursuant to this section that meets the definition of trade secret information, as defined in section 13.37, subdivision 1, paragraph (b), is nonpublic data.\n(a) No later than August 1 of the year preceding the legislative session in which a legislator is planning on introducing a bill containing a mandated health benefit proposal, or is planning on offering an amendment to a bill that adds a mandated health benefit, the prospective author must notify the chair of one of the standing legislative committees that have jurisdiction over the subject matter of the proposal. No later than 15 days after notification is received, the chair must notify the commissioner that an evaluation of a mandated health benefit proposal is required to be completed in accordance with this section in order to inform the legislature before any action is taken on the proposal by either house of the legislature.\n(b) The commissioner must conduct an evaluation described in subdivision 2 of each mandated health benefit proposal for which an evaluation is required under paragraph (a).\n(c) If the evaluation of multiple proposals are required, the commissioner must consult with the chairs of the standing legislative committees having jurisdiction over the subject matter of the mandated health benefit proposals to prioritize the evaluations and establish a reporting date for each proposal to be evaluated.\n(a) The commissioner shall not use any funds for purposes of this section other than as provided in this subdivision or as specified in an appropriation.\n(b) The commissioner may seek and accept funding from sources other than the state to pay for evaluations under this section to supplement or replace state appropriations. Any money received under this paragraph must be deposited in the state treasury, credited to a separate account for this purpose in the special revenue fund, and is appropriated to the commissioner for purposes of this section.\n(c) If an evaluation is required under this section, the commissioner may use for purposes of the evaluation:\n(1) any funds appropriated to the commissioner specifically for purposes of this section; or\n(2) funds available under paragraph (b), if use of the funds for evaluation of that mandated health benefit proposal is consistent with any restrictions imposed by the source of the funds.\n(d) The commissioner must ensure that the source of the funding has no influence on the process or outcome of the evaluation.\nThe commissioner must submit a written report on the evaluation to the author of the proposal and to the chairs and ranking minority members of the legislative committees with jurisdiction over health insurance policy and finance no later than 180 days after the commissioner receives notification from a chair as required under subdivision 3.",
	"repealed": false
}