{
	"id": "326B.133",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.133",
	"title": "326B.133 BUILDING OFFICIALS.",
	"text": "Each municipality shall designate a building official to administer the code. A municipality may designate no more than one building official responsible for code administration defined by each certification category created by statute or rule. Two or more municipalities may combine in the designation of a building official for the purpose of administering the provisions of the code within their communities. In those municipalities for which no building officials have been designated, the state building official may use whichever state employees are necessary to perform the duties of the building official until the municipality makes a temporary or permanent designation. All costs incurred by virtue of these services rendered by state employees must be borne by the involved municipality and receipts arising from these services must be paid to the commissioner.\nA building official, to be eligible for designation, must be certified and have the experience in design, construction, and supervision which the commissioner deems necessary and must be generally informed on the quality and strength of building materials, accepted building construction requirements, and the nature of equipment and needs conducive to the safety, comfort, and convenience of building occupants. No person may be designated as a building official for a municipality unless the commissioner determines that the official is qualified as provided in subdivision 3.\n(a) An applicant for certification shall submit a completed application on a form approved by the commissioner to the department. The commissioner shall review applications for compliance with the requirements established by rule.\n(b) Application for initial certification or renewal certification as a building official, building official-limited, or accessibility specialist shall be according to this section and sections 326B.092 to 326B.095.\n(c) Fees shall be paid to the department according to section 326B.092.\n(d) Unless revoked or suspended under this chapter, all certifications issued or renewed under this section expire two years from the date of original issuance and every two years thereafter.\nThe commissioner shall by rule establish certification criteria as proof of qualification pursuant to subdivision 2. The commissioner may:\n(1) develop and administer written and practical examinations to determine if a person is qualified pursuant to subdivision 2 to be a building official;\n(2) accept documentation of successful completion of testing programs developed and administered by nationally recognized testing agencies, as proof of qualification pursuant to subdivision 2; or\n(3) determine qualifications by satisfactory completion of clause (2) and a mandatory training program developed or approved by the commissioner.\nUpon a determination of qualification under clause (1), (2), or (3), the commissioner shall issue a certificate to the building official stating that the official is certified. The commissioner or a designee may establish categories of certification that will recognize the varying complexities of code enforcement in the municipalities within the state. The commissioner shall provide educational programs designed to train and assist building officials in carrying out their responsibilities.\n(a) If a municipality has adopted or adopts the State Building Code, the responsibilities for code administration and enforcement are under the authority of its designated building official or the certified building official-limited.\n(b) Certified building official. This certification is identified as \"certified building official\" on the certificate card. This certification is granted to an individual who has met the certified building official requirements established by rule and passed the written examination prepared by the state. A person with this certification may serve as the designated building official for any municipality. For the purposes of calculating fees under section 326B.092, certification as a building official is a master license.\n(c) Certified building official-limited. This certification is identified as \"certified building official-limited\" on the certification card. This certification is granted to an individual who has met the certified building official-limited requirements established by rule and passed the written examination prepared by the state. An individual with this certification may perform code administration for one- and two-family dwellings, their accessory structures, and \"exempt classes of buildings\" as provided in Minnesota Rules, part 1800.5000, of the Board of Architecture, Engineering, Land Surveying, Landscape Architecture, Geoscience, and Interior Design, and \"facilities for persons with physical disabilities\" that are governed by the State Building Code. Subject to the limitations of the building official-limited certification, an individual with this certification may serve as the designated building official for any municipality. Code administration for all other buildings must be performed by a certified building official as defined in paragraph (b). A certified building official-limited may conduct inspections for other structures regulated by the State Building Code under the direction of a designated certified building official or the state building official.\nSubject to all other certification requirements, as of January 1, 2012, valid Class I certifications shall be included in the certified building official-limited category upon the next immediate renewal. For the purposes of calculating fees under section 326B.092, certification as a building official-limited is a journeyworker license.\n(d) Accessibility specialist. This certification is identified as accessibility specialist on the certification card. This certification is granted to an individual who has met the \"accessibility specialist\" requirements established by rule and passed the written examination prepared by the state. An individual with this classification is limited to the administration of those provisions of the State Building Code that provide access for persons with disabilities. For the purposes of calculating fees under section 326B.092, certification as an accessibility specialist is a journeyworker license.\nBuilding officials shall, in the municipality for which they are designated, be responsible for all aspects of code administration for which they are certified, including the issuance of all building permits and the inspection of all manufactured home installations. The commissioner may direct a municipality with a building official to perform services for another municipality, and in that event the municipality being served shall pay the municipality rendering the services the reasonable costs of the services. The costs may be subject to approval by the commissioner.\nThe commissioner may use any enforcement provision in section 326B.082 against an applicant or individual holding a certificate, if the applicant or individual:\n(1) violates a provision of sections 326B.101 to 326B.194 or a rule adopted under those sections; or\n(2) engages in fraud, deceit, or misrepresentation while performing the duties of a certified building official.\nNothing in this subdivision limits or otherwise affects the authority of a municipality to dismiss or suspend a building official at its discretion, except as otherwise provided for by law.\nThe commissioner may take any administrative action provided under section 326B.082, against an individual required to be certified under subdivision 3, based upon conduct that would provide grounds for action against a certificate holder under this section.\nIn the event that a designated building official position is vacant within a municipality, that municipality shall designate a certified building official to fill the vacancy as soon as possible. The commissioner must be notified of any vacancy or designation in writing within 15 days. If the municipality fails to designate a certified building official within 15 days of the occurrence of the vacancy, the state building official may provide state employees to serve that function as provided in subdivision 1 until the municipality makes a temporary or permanent designation. Municipalities must not issue permits without a designated certified building official.\n(a) This subdivision establishes the number of continuing education hours required within each two-year certification period.\nA certified building official shall accumulate 35 hours of continuing education in any education program that is approved under Minnesota Rules, part 1301.1000.\nA certified building official-limited shall accumulate 35 hours of continuing education in any education program that is approved under Minnesota Rules, part 1301.1000.\nAn accessibility specialist must accumulate nine hours of approved continuing education hours in any of the education programs that are provided under Minnesota Rules, part 1301.1000, subpart 1 or 2. The nine hours must be in courses relating to building accessibility, plan review, field inspection, or building code administration.\nContinuing education programs may be approved as established in rule.\n(b) Subject to sections 326B.101 to 326B.194, the commissioner may by rule establish or approve continuing education programs for certified building officials dealing with matters of building code administration, inspection, and enforcement.\nEach person certified as a building official for the state must satisfactorily complete applicable educational programs established or approved by the commissioner to renew certification.\n(c) The state building official may grant an extension of time to comply with continuing education requirements if the certificate holder requesting the extension of time shows cause for the extension. The request for the extension must be in writing. For purposes of this section, the certificate holder's current certification effective dates shall remain the same. The extension does not relieve the certificate holder from complying with the continuing education requirements for the next two-year period.\n[Repealed, 2010 c 347 art 3 s 75]\n[Repealed, 2010 c 347 art 3 s 75]\nAn individual who has failed to make a timely application for renewal of a certificate is not certified and must not serve as the designated building official for any municipality, or a certified building official, a certified building official-limited, or an accessibility specialist until a renewed certificate has been issued by the commissioner.",
	"repealed": false
}