{
	"id": "124E.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/124E.16",
	"title": "124E.16 REPORTS.",
	"text": "(a) A charter school is subject to the same financial audits, audit procedures, and audit requirements as a district, except as required under this subdivision. Audits must be conducted in compliance with generally accepted governmental auditing standards, the federal Single Audit Act, if applicable, and section 6.65 governing auditing procedures. The audit must comply with the requirements of sections 123B.75 to 123B.83 governing school district finance, except when the commissioner and authorizer approve a deviation made necessary because of school program finances. The commissioner, state auditor, legislative auditor, or authorizer may conduct financial, program, or compliance audits. A charter school in statutory operating debt under sections 123B.81 to 123B.83 must submit a plan under section 123B.81, subdivision 4.\n(b) The charter school must submit an audit report to the commissioner and its authorizer annually by December 31.\n(c) The charter school, with the assistance of the auditor conducting the audit, must include with the report, as supplemental information: (1) a copy of a new management agreement or an amendment to a current agreement with a CMO or EMO signed during the audit year; and (2) a copy of a service agreement or contract with a company or individual totaling over five percent of the audited expenditures for the most recent audit year. The agreements must detail the terms of the agreement, including the services provided and the annual costs for those services.\n(d) A charter school independent audit report shall include audited financial data of an affiliated building corporation under section 124E.13, subdivision 3, or other component unit.\n(e) If the audit report finds that a material weakness exists in the financial reporting systems of a charter school, the charter school must submit a written report to the commissioner explaining how the charter school will resolve that material weakness. An auditor, as a condition of providing financial services to a charter school, must agree to make available information about a charter school's financial audit to the commissioner and authorizer upon request.\n(a) A charter school must publish an annual report approved by the board of directors. The annual report must at least include information on school enrollment, student attrition, governance and management, staffing, finances, management agreements with a CMO or EMO, academic performance, innovative practices and implementation, and future plans. A charter school may combine this report with the reporting required under section 120B.11 governing comprehensive achievement and civic readiness. A charter school must post the annual report on the school's official website. A charter school also must distribute the annual report by publication, mail, or electronic means to its authorizer, school employees, and parents and legal guardians of students enrolled in the charter school. The reports are public data under chapter 13.\n(b) An authorizer must submit an annual public report in a manner specified by the commissioner by January 15 for the previous school year ending June 30 that shall at least include key indicators of school academic, operational, and financial performance. The report is part of the system to evaluate authorizer performance under section 124E.05, subdivision 5.\n(a) A charter school that enters into a management agreement with a CMO or EMO must:\n(1) publish on the charter school website for at least 20 business days the proposed final agreement for public review and comment before the school board may adopt the contract or agreement. Any changes made to the posted agreement during the public review period or any proposed amendments to the agreement once adopted must be posted for 20 business days before the board may adopt the amendments to the contract;\n(2) annually publish on the charter school website a statement of assurance that no member of the school board, staff, or any agent of the school has been promised or received any form of compensation or gifts from the CMO or EMO and that no board member, employee, or agent of the CMO or EMO or any of the organization affiliates or providers serve on the charter school board; and\n(3) conduct an independent review and evaluation of the services provided by the CMO or EMO and publish the evaluation on the school's website at least 30 business days before the end of the current contract.\n(b) A management agreement with a CMO or EMO must contain the following:\n(1) the term of the contract, not to exceed five years;\n(2) the total dollar value of the contract including the annual projected costs of services;\n(3) a description and terms of the services to be provided during the term of the contract;\n(4) notice that a charter school closure during the term of the contract by action of the authorizer or the school's board results in the balance of the current contract becoming null and void;\n(5) an annual statement of assurance to the charter school board that the CMO or EMO provided no compensation or gifts to any charter school board member, staff member, or agent of the charter school;\n(6) an annual statement of assurance that no charter school board member, employee, contractor, or agent of the CMO or EMO or any affiliated organization is a board member of the charter school or any other charter school;\n(7) the policies and protocols that meet federal and state laws regarding student and personnel data collection, usage, access, retention, disclosure and destruction, and indemnification and warranty provisions in case of data breaches by the CMO or EMO; and\n(8) an annual assurance that all assets purchased on behalf of the charter school using public funds remain assets of the school.\n(c) The CMO or EMO must annually provide the charter school board a financial report by July 31 that accounts for income and expenditures for the previous fiscal year using the account categories in uniform financial accounting and reporting standards.\n(d) Any agreement with a CMO or EMO containing any of the following provisions is null and void:\n(1) restrictions on the charter school's ability to operate a school upon termination of the agreement;\n(2) restrictions on the annual or total amount of the school's operating surplus or fund balance;\n(3) authorization to allow a CMO or EMO to withdraw funds from a charter school account; or\n(4) authorization to allow a CMO or EMO to loan funds to the charter school.\n(e) A CMO or EMO or its affiliates, employees, or agents may not contract with, be employed by, or serve on the board of an authorizer. An authorizer or its affiliates, employees, or agents may not contract with, be employed by, serve as a paid consultant for, or serve as a board member of a CMO or EMO.",
	"repealed": false
}