{
	"id": "15.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.38",
	"title": "15.38 NONINSURANCE OF STATE PROPERTY; EXCEPTIONS.",
	"text": "No public funds shall be expended on account of any insurance upon state property against loss or damage by fire or tornado, nor shall any state officer or board contract for or incur any indebtedness against the state on account of any such insurance, except as specifically authorized in this section, section 15.39, or other law.\nThe commissioner of corrections may insure the state of Minnesota against loss by fire or tornado to the Minnesota Correctional Facility-Stillwater, or the contents thereof, in any insurance companies licensed to do business in this state, in such an amount as the commissioner may from time to time determine and to pay the premiums therefor from the revolving fund of the institution.\nThe Board of Trustees of the Minnesota State Colleges and Universities may purchase insurance coverage as it deems necessary and appropriate to protect buildings and contents and for activities ancillary to the programs of the state colleges and universities.\n[Repealed, 1995 c 212 art 4 s 65]\n[Repealed, 2010 c 382 s 87]\nThe adjutant general may purchase insurance coverage deemed necessary to indemnify the Department of Military Affairs for workers' compensation awards paid for state employees employed under federal cooperative funding agreements.\nAfter seeking a recommendation from the Iron Range Resources and Rehabilitation Board, the commissioner of Iron Range resources and rehabilitation may purchase insurance the commissioner deems necessary and appropriate to insure facilities operated by the commissioner.\nThe commissioner of administration may authorize the purchase of insurance on state property that agencies of state government deem necessary and appropriate to protect buildings and contents.\nThe Sibley House Association may purchase fire, wind, hail, and vandalism insurance and insurance coverage for fine art objects from state appropriations.",
	"repealed": false
}