{
	"id": "383C.041",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.041",
	"title": "383C.041 TESTS.",
	"text": "The human resources director shall hold tests for the purpose of establishing employment lists for the various positions in the classified service. Such tests shall be public, competitive and open to all persons who may be lawfully appointed to any position within the class for which such examinations are held with limitations specified in the rules of the commission as to prerequisite minimum qualifications of the job classification. Promotion tests shall be competitive to employees who have attained permanent status in the classified service by successfully completing a probationary period and who meet the prerequisite minimum qualifications of the job classification. The human resources director shall hold promotion tests for each job class whenever there is a lower-level class in the same classification series, the duties of which directly fit the incumbents thereof for the performance of the duties of the higher-level class. If fewer than two qualified persons submit themselves for a promotion test, or if after such test is held no applicants pass the test, the director may, at the request of the appointing authority, hold an original entrance test and refer names from the employment list resulting from the original entrance test.\nAll tests shall be practical, and shall consist only of subjects which will fairly determine the capacity of the persons examined to perform the duties of the class of work for which the examination is being conducted, and may include tests of physical fitness or of manual skill. No question in any test shall relate to religious or political opinions or affiliations. As many tests shall be held as may be necessary to provide qualified applicants for each vacancy. From the return and report of the examiners or from the tests provided by the human resources director, the director shall prepare a list of eligible persons who shall attain such minimum mark as may be fixed for the various parts of such test, and whose general average standing upon the test for such position is not less than the minimum fixed by the rules of the commission, and who may lawfully be appointed. Such persons shall take rank upon the list in the order of their relative excellence as determined by the tests. The markings of all tests shall be completed and the resulting employment list posted as soon as possible thereafter. The life of any promotional or open employment list shall not exceed one year, but may be extended an additional year.\nThe markings and test papers of the candidate shall be open to the candidate's inspection. An error in the markings of any test other than an error in judgment, if called to the attention of the commission within one month after the establishment of an employment list resulting from such test, shall be corrected by it; provided, however, that such correction shall not invalidate any certification or appointment previously made. Public notice of each examination shall be given.",
	"repealed": false
}