{
	"id": "197.987",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.987",
	"title": "197.987 HONOR AND REMEMBER FLAG.",
	"text": "The legislature of the state of Minnesota finds and determines that:\n(1) since the Revolutionary War, more than 1,000,000 members of the United States armed forces have paid the ultimate price by sacrificing their lives in active military service for the United States of America;\n(2) the contribution made by those fallen members of the armed forces is deserving of state and national recognition; and\n(3) the Honor and Remember Flag is an appropriate symbol that acknowledges the selfless sacrifice of those members of the United States armed forces.\nThe Honor and Remember Flag described in subdivision 3 is designated as the symbol of our state's concern and commitment to honoring and remembering the lives of all members of the United States armed forces who have lost their lives in the line of duty while serving honorably in active military service in the United States armed forces or of a service-connected cause due to or aggravated by that service, as determined by the United States Department of Defense or the United States Department of Veterans Affairs. This designation is contingent on the flag being available for purchase at a reasonable price.\nThe Honor and Remember Flag shall conform substantially to the following description: The Honor and Remember Flag is the same standard proportions as the flag of the United States of America. Its design contains a red field that occupies the top three-quarters and a white field that occupies the bottom quarter of the flag. In the center of the red field is a five-pointed, gold star with the top point located near the top of the red field and the two bottom points extending about one-quarter of the way into the white field. The gold star has a white border surrounded by a blue border. Between the two bottom points of the star is a tri-folded American flag displaying the blue field and some stars, which is the configuration of the American flag presented to the family of the deceased at a military memorial service. At the top of the tri-folded flag, extending into the center of the gold star, is a stylized, three-part flame, with one blue part and two red parts. In the white field below the tri-folded flag, the words \"Honor and Remember\" are centered. The Honor and Remember Flag is protected by U.S. copyright, registration number VA0001670661, owned by Honor and Remember, Inc.\n(a) The chief administrator of each governmental building or facility within this state, as defined in paragraph (b), is encouraged to display the Honor and Remember Flag on the following days each year:\n(1) Armed Forces Day, the third Saturday in May;\n(2) Flag Day, June 14;\n(3) July 2nd and July 3rd, in remembrance of the 262 soldiers of the 1st Regiment Minnesota Volunteer Infantry who, at the Battle of Gettysburg during the American Civil War, fought so gallantly and successfully to repulse two major Confederate attacks on the main Union line, suffering over 80 percent casualties, thereby turning the battle and the war and helping to preserve the Union itself at that pivotal moment in our nation's history;\n(4) July 4th, Independence Day;\n(5) the third Friday of September, National POW/MIA Recognition Day;\n(6) November 11, Veterans Day;\n(7) July 27, Korean War Armistice Day;\n(8) March 29, Vietnam Veterans Day; and\n(9) any day on which the United States flag is displayed at a governmental building or facility within this state.\n(b) For purposes of this section, \"governmental building or facility within this state\" means the following locations:\n(1) the Minnesota State Capitol, the Office of the Governor and each other Minnesota constitutional office, the chambers of the Minnesota Senate and the Minnesota House of Representatives, the Minnesota Judicial Center and each Minnesota District Court House, any official state of Minnesota veterans memorial, Minnesota veterans home, Minnesota veterans cemetery, state veterans service centers, and state veterans community-based outreach centers; and\n(2) any appropriate local government building or facility, as determined by the governing body of that local government.\nThis section may not be construed or interpreted to require any employee to report to work solely for the purpose of providing for the display of the Honor and Remember Flag or any other flag.\nIf a governmental building or facility within this state opts to display the Honor and Remember Flag, the chief administrator of that facility shall prescribe procedures necessary for the display.\nNotwithstanding sections 10A.071 and 471.895, any named public office or public official may accept a donation of one or more Honor and Remember Flags for the purpose of this section.",
	"repealed": false
}