{
	"id": "110A.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/110A.28",
	"title": "110A.28 POWERS.",
	"text": "The district shall have all the usual powers of a public corporation, and may acquire by purchase, gift, or other lawful means and hold real or personal property reasonably necessary for the conduct of its business, or lease property for its proper purposes, and sell, lease, or otherwise dispose of property when not needed.\nThe district may own, construct, reconstruct, improve, purchase, lease, receive by gift, or otherwise acquire, hold, extend, manage, use, or operate any works, as defined in sections 110A.01 to 110A.36, and any and every kind of property, personal or real, necessary, useful, or incident to their acquisition, extension, management, use, and operation, and may sell, mortgage, alienate, or otherwise dispose of works under the terms and conditions provided in sections 110A.01 to 110A.36.\nA district may enter into any contract, lease, agreement, or arrangement with a state, county, city, town, district, governmental or public corporation or association, or with a person, firm, or corporation, public or private, or with the government of the United States, or with any officer, department, bureau, or agency thereof, or with any corporation organized under federal law to exercise the powers set forth in this section, or for the sale, leasing, or otherwise furnishing or establishing of water rights, water supply, conveyance and distribution of water, water service, or water storage, for domestic, industrial, municipal, or stock watering purposes, or for the financing or payment of the cost and expenses incident to the construction, acquisition, or operation of works, or incident to any obligation or liability entered into or incurred by the district.\nA district may exercise any of the powers enumerated in this section either within or beyond or partly within and partly beyond the boundaries of the district and of the state, unless prohibited by the law of the area or state concerned or of the United States of America.\nA district may appropriate the waters of the state in the same manner as other persons under the laws of this state. A district shall not, in the exercise of the powers conferred by sections 110A.01 to 110A.36, interfere with, injure, or otherwise damage or affect existing water rights, other than through the purchase of the rights or through condemnation proceedings. No district, corporation, association, or individual holding a water right for lands located either within or outside the boundaries of a district shall be in any way affected by the operations of the district other than by reason of a contract voluntarily entered into by the organization or individual with the district, or by reason of the exercise by the district of the power of eminent domain.\nA district may exercise the power of eminent domain pursuant to chapter 117, after declaring by resolution the necessity for and purpose of the taking of property and the extent of the taking.\nThe district shall have no power of taxation, or of levying assessments for special benefits. No governmental authority shall have power to levy or collect taxes or assessments for the purpose of paying, in whole or in part, any indebtedness or obligation of or incurred by the district or upon which the district may be or become in any manner liable. Nor shall any privately owned property within or outside a district, or the owner thereof, nor any city, town, county, or other political subdivision or public or private corporation or association or its property, be directly or indirectly liable for any district indebtedness or obligation beyond the liability to perform an express contract between the owner or public or private organization and the district.\nNo person, city, town, county, or other governmental subdivision, or other public or private corporation or association shall be liable for the payment of any rent or charge for water storage, water supply, or for any of the costs of operation of a district, unless a contract has been entered into between the person or public or private organization and the district furnishing water storage or water supply. All capital and operating expenses shall be borne by the users in proportion to their use of water supplied by the district.\nA district organized under sections 110A.01 to 110A.36 may exercise any power conferred by sections 110A.01 to 110A.36 to obtain grants or loans or both from any federal agency pursuant to acts of Congress, and may accept from private owners or other sources, gifts, deeds or instruments of trust or title relating to land, water rights and any other form of property.\nA district may purchase and acquire lands, water rights, rights-of-way, and real and personal properties of every nature in cooperation with the United States under conditions as may to the board seem advisable, and to convey them under the conditions, terms and restrictions approved by the directors and the federal government or any of its agencies and to pay the purchase price and any and all construction costs or other necessary expenses and costs in connection with any works contemplated by sections 110A.01 to 110A.36 either from its own funds or cooperatively with the federal government.\nA district shall not, in the exercise of the powers conferred by sections 110A.01 to 110A.36, provide service to actual or potential residential, commercial, industrial or publicly owned land uses within one-half mile of the limits of a city of up to 20,000 persons without approval by the city council. Approval shall not be required prior to serving class 2a lands as defined in section 273.13.\nA district shall not, in the exercise of the powers conferred by sections 110A.01 to 110A.36, provide service to actual or potential residential, commercial, industrial or publicly owned land uses within one mile of the limits of a city of more than 20,000 persons without approval by the city council. Approval shall not be required prior to serving class 2a lands as defined in section 273.13.",
	"repealed": false
}