{
	"id": "43A.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.49",
	"title": "43A.49 VOLUNTARY UNPAID LEAVE OF ABSENCE.",
	"text": "(a) Appointing authorities in state government may allow each employee to take unpaid leaves of absence for up to 1,040 hours in each two-year period beginning July 1 of each odd-numbered year. Each appointing authority approving such a leave shall allow the employee to continue accruing vacation and sick leave, be eligible for paid holidays and insurance benefits, accrue seniority, and accrue service credit and credited salary in retirement plans as if the employee had actually been employed during the time of leave. An employee covered by the unclassified plan may voluntarily make the employee contributions to the unclassified plan during the leave of absence. If the employee makes these contributions, the appointing authority must make the employer contribution. If the leave of absence is for one full pay period or longer, any holiday pay shall be included in the first payroll payment after return from the leave of absence. The appointing authority shall attempt to grant requests for the unpaid leaves of absence consistent with the need to continue efficient operation of the agency. However, each appointing authority shall retain discretion to grant or refuse to grant requests for leaves of absence and to schedule and cancel leaves, subject to the applicable provisions of collective bargaining agreements and compensation plans.\n(b) To receive eligible service credit and credited salary in a defined benefit plan, the member shall pay an amount equal to the applicable employee contribution rates. If an employee pays the employee contribution for the period of the leave under this section, the appointing authority must pay the employer contribution. The appointing authority may, at its discretion, pay the employee contributions. Contributions must be made in a time and manner prescribed by the executive director of the applicable retirement system.",
	"repealed": false
}