{
	"id": "14.389",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.389",
	"title": "14.389 EXPEDITED PROCESS.",
	"text": "This section applies when a law requiring or authorizing rules to be adopted states that this section must or may be used to adopt the rules. When a law refers to this section, the process in this section is the only process an agency must follow for its rules to have the force and effect of law. Sections 14.19 and 14.366 apply to rules adopted under this section.\nThe agency must publish notice of the proposed rule in the State Register and must mail the notice by United States mail or electronic mail to persons who have registered with the agency to receive mailed notices. The mailed notice must include either a copy of the proposed rule or a description of the nature and effect of the proposed rule and a statement that a free copy is available from the agency upon request. The notice in the State Register must include the proposed rule or the amended rule in the form required by the revisor under section 14.07, an easily readable and understandable summary of the overall nature and effect of the proposed rule, and a citation to the most specific statutory authority for the rule, including authority for the rule to be adopted under the process in this section. The agency must allow 30 days after publication in the State Register for comment on the rule.\nThe agency may modify a proposed rule if the modifications do not result in a substantially different rule, as defined in section 14.05, subdivision 2, paragraphs (b) and (c). If the final rule is identical to the rule originally published in the State Register, the agency must publish a notice of adoption in the State Register. If the final rule is different from the rule originally published in the State Register, the agency must publish a copy of the changes in the State Register. The agency must also file a copy of the rule with the governor. The rule is effective upon publication in the State Register.\nBefore publication of the final rule in the State Register, the agency must submit the rule to an administrative law judge in the Office of Administrative Hearings. The administrative law judge shall within 14 days approve or disapprove the rule as to its legality and its form to the extent the form relates to legality.\nA law authorizing or requiring rules to be adopted under this section may refer specifically to this subdivision. If the law contains a specific reference to this subdivision, as opposed to a general reference to this section:\n(1) the notice required in subdivision 2 must include a statement that a public hearing will be held if 50 or more people request a hearing. The request must be in the manner specified in section 14.25; and\n(2) if 50 or more people submit a written request for a public hearing, the agency may adopt the rule only after complying with all of the requirements of chapter 14 for rules adopted after a public hearing.",
	"repealed": false
}