{
	"id": "259.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.79",
	"title": "259.79 ADOPTION RECORDS.",
	"text": "(a) The adoption records of the commissioner's agents and licensed child-placing agencies shall contain copies of all relevant legal documents, responsibly collected genetic, medical and social history of the child and the child's birth parents, the child's placement record, copies of all pertinent agreements, contracts, and correspondence relevant to the adoption, and copies of all reports and recommendations made to the court.\n(b) The commissioner of children, youth, and families shall maintain a permanent record of all adoptions granted in district court in Minnesota regarding children who are:\n(1) under guardianship of the commissioner or a licensed child-placing agency according to section 260C.317 or 260C.515, subdivision 3;\n(2) placed by the commissioner, commissioner's agent, or licensed child-placing agency after a consent to adopt according to section 259.24 or under an agreement conferring authority to place for adoption according to section 259.25; or\n(3) adopted after a direct adoptive placement approved by the district court under section 259.47.\nEach record shall contain identifying information about the child, the birth or legal parents, and adoptive parents, including race where such data is available. The record must also contain: (1) the date the child was legally freed for adoption; (2) the date of the adoptive placement; (3) the name of the placing agency; (4) the county where the adoptive placement occurred; (5) the date that the petition to adopt was filed; (6) the county where the petition to adopt was filed; and (7) the date and county where the adoption decree was granted.\n(c) Identifying information contained in the adoption record must be confidential and must be disclosed only pursuant to section 259.61 or, for adoption records maintained by the commissioner of children, youth, and families, upon request from the commissioner of health or state registrar pursuant to sections 144.2252 and 144.2253.\nEach adoption record shall constitute the permanent record upon which court action is based and agency services are administered.\nAll adoption records shall be retained on a permanent basis under a protected record system which ensures confidentiality and lasting preservation. All adoption records shall become public records on the 100th anniversary of the granting of the adoption decree.",
	"repealed": false
}