{
	"id": "12.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/12.34",
	"title": "12.34 ASSISTANCE REQUIRED; COMPENSATION FOR PROPERTY TAKEN; PENALTY.",
	"text": "When necessary to save life, property, or the environment during a national security emergency or during a peacetime emergency, the governor, the state director, or a member of a class of members of a state or local emergency management organization designated by the governor, may:\n(1) require any person, except members of the federal or state military forces and officers of the state or a political subdivision, to perform services for emergency management purposes as directed by any of the persons described above; and\n(2) commandeer, for emergency management purposes as directed by any of the persons described above, any motor vehicles, tools, appliances, medical supplies, or other personal property and any facilities.\nThe owner of commandeered property must be promptly paid just compensation for its use and all damages done to the property while so used for emergency management purposes. The governor or the governing body of the political subdivision concerned, respectively, according to the use of the property, shall make a formal order determining the amount of compensation. The owner may appeal to the district court of the county in which the property was commandeered if, within 30 days from the date of the order, the owner serves upon the governor or the political subdivision concerned and files with the court administrator of the district court a written notice of appeal setting forth the order appealed from and, in detail, the amount claimed as compensation. Upon appeal, the issue is the amount of damages to which the appellant is entitled. It may be noticed for trial as in the case of a civil action and the court may require other parties to be joined and to plead when necessary to a proper determination of the questions involved. The cause must be tried without a jury de novo and the court shall determine the damages and the person or persons entitled to them. Except as herein otherwise provided, the trial must be conducted and the cause disposed of according to the rules applicable to civil actions in the district court. The court in its discretion may award to the prevailing party the costs and disbursements of the appeal.\nAn able-bodied person required to perform services for emergency management who refuses, neglects, or otherwise fails to perform the services required under subdivision 1 is guilty of a misdemeanor and must be punished by imprisonment in the county jail for not less than ten days or more than 90 days.",
	"repealed": false
}