{
	"id": "270C.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.60",
	"title": "270C.60 FAILURE TO COMPLY WITH WITHHOLDING PROVISIONS.",
	"text": "(a) When a person who is required to deduct, withhold, pay over, or deposit any tax imposed by chapter 290, at the time and in the manner prescribed by law or rules fails to deduct, withhold, or pay over the tax, or fails to make deposits or payments of the tax and is notified of the failure by notice served upon the person in the manner prescribed for service of a summons in civil actions, then the requirements of paragraph (b) shall be met. In the case of a corporation, partnership or trust, notice served upon an officer, partner or trustee shall, for purposes of this subdivision, be considered notice served upon the corporation, partnership, or trust and their officers, partners, or trustees.\n(b) A person who is required to deduct, withhold, pay over, or deposit a tax imposed by chapter 290, if notice has been served upon that person in accordance with paragraph (a), shall after that date deduct, withhold, and collect the taxes and shall (not later than the end of the second banking day after any amount of such taxes is deducted, withheld or collected) deposit the taxes in a separate account in a bank, savings bank or savings association and shall keep the amount of the taxes in that account until paid to the state of Minnesota. The account constitutes and must be designated as a special fund in trust for the state of Minnesota payable to the state of Minnesota by that person as trustee. The person upon whom notice is served shall notify the commissioner of revenue in writing of the name and address of the bank, savings bank or savings association wherein the account is kept, together with other information the commissioner may require. In lieu of the trust fund account, the commissioner may, when necessary to secure the withholding of the tax imposed by chapter 290, require an employer to file with the Department of Revenue a bond in an amount determined by the commissioner, or in lieu of it, security in a form and in an amount the commissioner determines, not more than twice the estimated average liability for future monthly withholding tax periods.\n(c) The commissioner of revenue, on being satisfied with respect to any notification made under paragraph (a) that the requirements of law and rules with respect to the taxes imposed by chapter 290 have been and will be complied with, may cancel the notification. The cancellation shall take effect at the time specified in the notice of the cancellation. All notices authorized or required under this section must be in the form the commissioner determines.",
	"repealed": false
}