{
	"id": "260C.171",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.171",
	"title": "260C.171 RECORDS.",
	"text": "The juvenile court judge shall keep such minutes and in such manner as the court deems necessary and proper. The juvenile court shall provide, upon the request of any other juvenile court, copies of the records concerning adjudications involving the particular child.\nThe court shall also keep an index in which files pertaining to juvenile matters shall be indexed under the name of the child. After the name of each file shall be shown the file number and, if ordered by the court, the book and page of the register in which the documents pertaining to such file are listed. The court shall also keep a register properly indexed in which shall be listed under the name of the child all documents filed pertaining to the child and in the order filed. The list shall show the name of the document and the date of filing thereof. The juvenile court legal records shall be deposited in files and shall include the petition, summons, notice, findings, orders, decrees, judgments, and motions and such other matters as the court deems necessary and proper. Unless otherwise provided by law, all court records shall be open at all reasonable times to the inspection of any child to whom the records relate, and to the child's parent and guardian.\n(a) The records from proceedings or portions of proceedings involving a child in need of protection or services, permanency, or termination of parental rights are accessible to the public as authorized by the Minnesota Rules of Juvenile Protection Procedure.\n(b) None of the records relating to an appeal from a nonpublic juvenile court proceeding, except the written appellate opinion, shall be open to public inspection or their contents disclosed except by order of a court.\n(c) The records of juvenile probation officers are records of the court for the purposes of this subdivision. This subdivision applies to all proceedings under this chapter, including appeals from orders of the juvenile court. The court shall maintain the confidentiality of adoption files and records in accordance with the provisions of laws relating to adoptions. In juvenile court proceedings any report or social history furnished to the court shall be open to inspection by the attorneys of record and the guardian ad litem a reasonable time before it is used in connection with any proceeding before the court.\nAn attorney representing a child, parent, or guardian ad litem in a proceeding under this chapter shall be given access to records, responsible social services agency files, and reports which form the basis of any recommendation made to the court. An attorney does not have access under this subdivision to the identity of a person who made a report under chapter 260E. The court may issue protective orders to prohibit an attorney from sharing a specified record or portion of a record with a client other than a guardian ad litem.\nIn a county in which the county attorney refers children who are in need of protection or services to community programs, the county attorney may provide a community program with data on a child who is a participant or being considered for participation in the program.\nA person who receives access to juvenile court or peace officer records of children that are not accessible to the public may not release or disclose the records to any other person except as authorized by law. This subdivision does not apply to the child who is the subject of the records or the child's parent or guardian.\n(a) As used in this subdivision, the following terms have the meanings given. \"Chemical substance,\" \"methamphetamine paraphernalia,\" and \"methamphetamine waste products\" have the meanings given in section 152.137, subdivision 1. \"School\" means a charter school or a school as defined in section 120A.22, subdivision 4, except a home school.\n(b) If a child has been taken into protective custody after being found in an area where methamphetamine was being manufactured or attempted to be manufactured or where any chemical substances, methamphetamine paraphernalia, or methamphetamine waste products were stored, and the child is enrolled in school, the officer who took the child into custody shall notify the chief administrative officer of the child's school of this fact.",
	"repealed": false
}