{
	"id": "97B.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.001",
	"title": "97B.001 TRESPASS.",
	"text": "For purposes of this section, \"agricultural land\" means land:\n(1) that is plowed or tilled;\n(2) that has standing crops or crop residues;\n(3) within a maintained fence for enclosing domestic livestock;\n(4) that is planted native or introduced grassland or hay land; or\n(5) that is planted to short rotation woody crops as defined in section 41B.048, subdivision 4.\n\"Outdoor recreation\" means any voluntary activity, including hunting, fishing, trapping, boating, hiking, camping, and engaging in winter sports, which is conducted primarily for the purposes of pleasure, rest, or relaxation and is dependent upon or derives its principal benefit from natural surroundings.\nExcept as provided in subdivisions 5 and 6, a person may not enter agricultural land for outdoor recreation purposes, without first obtaining permission of the owner, occupant, or lessee.\nExcept as provided in subdivision 6, a person may not remain on or return within one year to any land for outdoor recreation purposes after being personally notified not to do so by the owner, occupant, or lessee.\n(a) Except as provided in subdivision 6, a person may not:\n(1) enter, for outdoor recreation purposes, any land that is posted under this subdivision without first obtaining permission of the owner, occupant, or lessee; or\n(2) knowingly enter, for outdoor recreation purposes, any land that is posted under this subdivision without first obtaining permission of the owner, occupant, or lessee. A person who violates this clause is subject to the penalty provided in section 97A.315, subdivision 1, paragraph (b).\n(b) The owner, occupant, or lessee of private land, or an authorized manager of public land may prohibit outdoor recreation on the land by posting signs once each year that:\n(1) state \"no trespassing\" or similar terms;\n(2) display letters at least two inches high;\n(3) either:\n(i) are signed by the owner, occupant, lessee, or authorized manager; or\n(ii) include the legible name and telephone number of the owner, occupant, lessee, or authorized manager; and\n(4) either:\n(i) are at intervals of 1,000 feet or less along the boundary of the area, or in a wooded area where boundary lines are not clear, at intervals of 500 feet or less; or\n(ii) mark the primary corners of each parcel of land and access roads and trails at the point of entrance to each parcel of land except that corners only accessible through agricultural land need not be posted.\n(c) A person may not erect a sign that prohibits outdoor recreation or trespassing where the person does not have a property right, title, or interest to use the land.\nExcept as provided in subdivision 3, a person on foot may, without permission of the owner, occupant, or lessee, enter land that is not posted under subdivision 4, to retrieve a wounded animal that was lawfully shot. The hunter must leave the land immediately after retrieving the wounded game.\nA person on foot may, without permission of the owner, occupant, or lessee, enter private land without a firearm to retrieve a hunting dog. After retrieving the dog, the person must immediately leave the premises.\n(a) Unless otherwise provided by law, a person may not discharge a firearm within 500 feet of a building occupied by a human or livestock without the written permission of the owner, occupant, or lessee:\n(1) on another person's private land, if the land is not a licensed shooting preserve; or\n(2) on a public road right-of-way.\n(b) No person may discharge a firearm within 500 feet of a stockade or corral confining livestock for the purpose of normal livestock holding or sorting operations without the permission of the owner, occupant, or lessee. This paragraph does not apply to persons hunting during an established hunting season on state-owned or local government-owned land that is not a road right-of-way. For the purposes of this paragraph, a \"stockade or corral\" means a fenced enclosure for confining livestock that does not enclose an area greater than one acre.\n(c) A person may not take a wild animal on any land where the person is prohibited from entering by this section.\nA person may not:\n(1) wound or kill another person's domestic animal;\n(2) destroy, cut, or tear down another person's fence, building, grain, crops, live tree, or sign erected under subdivision 4; or\n(3) pass through another person's closed gate without returning the gate to its original position.",
	"repealed": false
}