{
	"id": "190.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.19",
	"title": "190.19 MINNESOTA \"SUPPORT OUR TROOPS\" ACCOUNT.",
	"text": "The Minnesota \"Support Our Troops\" account is established in the special revenue fund. The account shall consist of contributions from private sources and appropriations. Money in the account is appropriated in equal shares to the Department of Military Affairs and the Department of Veterans Affairs.\n(a) Money appropriated from the Minnesota \"Support Our Troops\" account to the Department of Military Affairs may be used for:\n(1) grants directly to eligible individuals;\n(2) grants to one or more eligible foundations for the purpose of making grants to eligible individuals, as provided in this section;\n(3) veterans' services; or\n(4) grants to family readiness groups chartered by the adjutant general.\n(b) As used in paragraph (a), the term \"eligible individual\" includes any person who is:\n(1) a member in good standing of the Minnesota National Guard or a reserve unit based in Minnesota;\n(2) a Minnesota resident who is a member of a military reserve unit not based in Minnesota, if the member is called to active service as defined in section 190.05, subdivision 5;\n(3) any other Minnesota resident performing active service for any branch of the military of the United States;\n(4) a person who honorably served in one of the capacities listed in clause (1), (2), or (3) who has current financial needs; and\n(5) a member of the immediate family of an individual identified in clause (1), (2), (3), or (4). For purposes of this clause, \"immediate family\" means the individual's spouse and minor children and, if they are dependents of the member of the military, the member's parents, grandparents, siblings, stepchildren, and adult children.\n(c) As used in paragraph (a), the term \"eligible foundation\" includes any organization that:\n(1) is a tax-exempt organization under section 501(c)(3) of the Internal Revenue Code;\n(2) has articles of incorporation under chapter 317A specifying the purpose of the organization as including the provision of financial assistance to members of the Minnesota National Guard and other United States armed forces reserves and their families and survivors; and\n(3) agrees in writing to distribute any grant money received from the adjutant general under this section to eligible individuals as defined in this section and in accordance with any written policies and rules the adjutant general may impose as conditions of the grant to the foundation.\n(d) The maximum grant awarded to an eligible individual under paragraph (a) in a calendar year with funds from the Minnesota \"Support Our Troops\" account, either through an eligible institution or directly from the adjutant general, may not exceed $4,000.\n(a) Money appropriated to the Department of Veterans Affairs from the Minnesota \"Support Our Troops\" account may be used for:\n(1) grants to veterans service organizations;\n(2) outreach to underserved veterans;\n(3) providing services and programs for veterans and their families;\n(4) transfers to the driver and vehicle services operating account for Gold Star license plates under section 168.1253;\n(5) grants of up to $100,000 to any organization approved by the commissioner of veterans affairs for the purpose of supporting and improving the lives of veterans and their families;\n(6) grants to an eligible foundation; and\n(7) the agency's uncompensated burial costs for eligible dependents to whom the commissioner grants a no-fee or reduced-fee burial in the state's veteran cemeteries pursuant to section 197.236, subdivision 9, paragraph (b).\n(b) For purposes of this subdivision, \"eligible foundation\" includes any organization that:\n(1) is a tax-exempt organization under section 501(c) of the Internal Revenue Code; and\n(2) is a nonprofit corporation under chapter 317A and the organization's articles of incorporation specify that a purpose of the organization includes: (i) providing assistance to veterans and their families; or (ii) enhancing the lives of veterans and their families.\nThe adjutant general and commissioner of veterans affairs must report by February 1 each year to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over military and veterans' affairs on the number, amounts, and use of grants made by each agency from the Minnesota \"Support Our Troops\" account in the previous year.",
	"repealed": false
}