{
	"id": "402A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/402A.16",
	"title": "402A.16 HUMAN SERVICES PERFORMANCE COUNCIL.",
	"text": "By October 1, 2013, the commissioner shall convene a Human Services Performance Council to advise the commissioner on the implementation and operation of the performance management system for human services.\nThe Human Services Performance Council shall:\n(1) hold meetings at least quarterly that are in compliance with Minnesota's Open Meeting Law under chapter 13D;\n(2) annually review the annual performance data submitted by counties or service delivery authorities;\n(3) review and advise the commissioner on department procedures related to the implementation of the performance management system and system process requirements and on barriers to process improvement in human services delivery;\n(4) advise the commissioner on the training and technical assistance needs of county or service delivery authority and department personnel;\n(5) review instances in which a county or service delivery authority has not made adequate progress on a performance improvement plan and make recommendations to the commissioner under section 402A.18;\n(6) consider appeals from counties or service delivery authorities that are in the remedies process and make recommendations to the commissioner on resolving the issue;\n(7) convene working groups to update and develop outcomes, measures, and performance thresholds for the performance management system and, on an annual basis, present these recommendations to the commissioner, including recommendations on when a particular essential human services program has a balanced set of program measures in place;\n(8) make recommendations on human services administrative rules or statutes that could be repealed in order to improve service delivery; and\n(9) provide information to stakeholders on the council's role and regularly collect stakeholder input on performance management system performance.\n(a) Human Services Performance Council membership shall be equally balanced among the following five stakeholder groups: the Association of Minnesota Counties, the Minnesota Association of County Social Service Administrators, the Department of Human Services, tribes and communities of color, and service providers and advocates for persons receiving human services. The Association of Minnesota Counties and the Minnesota Association of County Social Service Administrators shall appoint their own respective representatives. The commissioner of human services shall appoint representatives of the Department of Human Services, tribes and communities of color, and social services providers and advocates. Minimum council membership shall be 15 members, with at least three representatives from each stakeholder group, and maximum council membership shall be 20 members, with four representatives from each stakeholder group.\n(b) Notwithstanding section 15.059, Human Services Performance Council members shall be appointed for a minimum of two years, but may serve longer terms at the discretion of their appointing authority.\n(c) Notwithstanding section 15.059, members of the council shall receive no compensation for their services.\n(d) A commissioner's representative and a county representative from either the Association of Minnesota Counties or the Minnesota Association of County Social Service Administrators shall serve as Human Services Performance Council cochairs.\nThe commissioner shall:\n(1) implement and maintain the performance management system for human services;\n(2) establish and regularly update the system's outcomes, measures, and thresholds, including the minimum performance threshold for each performance measure;\n(3) determine when a particular program has a balanced set of measures;\n(4) receive reports from counties or service delivery authorities at least annually on their performance against system measures, provide counties with data needed to assess performance and monitor progress, and provide timely feedback to counties or service delivery authorities on their performance;\n(5) implement and monitor the remedies process in section 402A.18;\n(6) report to the Human Services Performance Council on county or service delivery authority performance on a semiannual basis;\n(7) provide general training and technical assistance to counties or service delivery authorities on topics related to performance measurement and performance improvement;\n(8) provide targeted training and technical assistance to counties or service delivery authorities that supports their performance improvement plans; and\n(9) provide staff support for the Human Services Performance Council.\nThe counties or service delivery authorities shall:\n(1) report performance data to meet performance management system requirements; and\n(2) provide training to personnel on basic principles of performance measurement and improvement and participate in training provided by the department.",
	"repealed": false
}