{
	"id": "216I.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.05",
	"title": "216I.05 DESIGNATING SITES AND ROUTES.",
	"text": "(a) A person is prohibited from constructing a large electric generating plant, a solar energy generating system, an energy storage system, or a large wind energy conversion system without a site permit issued by the commission. A person may construct a large electric generating plant, an energy storage system, a solar energy generating system, or a large wind energy conversion system only on a site approved by the commission. A person is prohibited from increasing the generating capacity or output of an electric power plant from under 50 megawatts to more than 50 megawatts without a site permit issued by the commission.\n(b) The commission must incorporate into one proceeding the route selection for a high-voltage transmission line that is directly associated with and necessary to interconnect the large electric generating plant, energy storage system, solar energy generating system, or large wind energy conversion system to the transmission system if the applications are submitted jointly under this chapter.\n(c) A site permit does not authorize construction of a large electric power generating plant until the permittee has obtained a power purchase agreement or some other enforceable mechanism to sell the power generated by the project. If the permittee does not have a power purchase agreement or other enforceable mechanism at the time the permit is issued, the commission must provide in the permit that the permittee must advise the commission when the permittee obtains a commitment to purchase the power. The commission may establish as a condition in the permit a date by which the permittee must obtain a power purchase agreement or other enforceable mechanism. If the permittee does not obtain a power purchase agreement or other enforceable mechanism by the date required by the permit condition, the site permit is null and void.\nA person is prohibited from constructing a high-voltage transmission line without a route permit issued by the commission. A person may construct a high-voltage transmission line only along a route approved by the commission.\n(a) A person that seeks to construct a large energy infrastructure facility must apply to the commission for a site or route permit, as applicable. The applicant must propose a single route for a high-voltage transmission line.\n(b) The application must contain:\n(1) a statement of proposed ownership of the facility at the time of filing the application and after commercial operation;\n(2) the name of any person or organization initially named as permittee or permittees and the name of any other person to whom the permit may be transferred if transfer of the permit is contemplated;\n(3) a description of the proposed large energy infrastructure facility and all associated facilities, including size, type, and timing of the facility;\n(4) the environmental information required under subdivision 4;\n(5) the names of each owner described under subdivision 8;\n(6) United States Geological Survey topographical maps, or other maps acceptable to the commission, that show the entire proposed large energy infrastructure facility;\n(7) a document that identifies existing utility and public rights-of-way along or near the large energy infrastructure facility;\n(8) the engineering and operational design at each of the proposed sites for the proposed large energy infrastructure facility, and identify transportation, pipeline, and electrical transmission systems that are required to construct, maintain, and operate the facility;\n(9) a cost analysis of the proposed large energy infrastructure facility, including the costs to construct, operate, and maintain the facility;\n(10) a description of possible design options to accommodate the large energy infrastructure facility's future expansion;\n(11) the procedures and practices proposed to acquire, construct, maintain, and restore the large energy infrastructure facility's right-of-way or site;\n(12) a list and brief description of federal, state, and local permits that may be required for the proposed large energy infrastructure facility;\n(13) a discussion regarding whether a certificate of need application is required and, if a certificate of need application is required, whether the certificate of need application has been submitted;\n(14) a discussion regarding any other sites or routes that were considered and rejected by the applicant;\n(15) any information the commission requires pursuant to an administrative rule; and\n(16) a discussion regarding coordination with Minnesota Tribal governments, as defined under section 10.65, subdivision 2, by the applicant, including but not limited to the notice required under subdivision 5 of this section.\n(a) An applicant for a site or route permit must include in the application environmental information for each proposed site or route. The environmental information submitted must include:\n(1) a description of each site or route's environmental setting;\n(2) a description of the effects the facility's construction and operation has on human settlement, including but not limited to public health and safety, displacement, noise, aesthetics, socioeconomic impacts, environmental justice impacts, cultural values, recreation, and public services;\n(3) a description of the facility's effects on land-based economies, including but not limited to agriculture, forestry, tourism, and mining;\n(4) a description of the facility's effects on archaeological and historic resources;\n(5) a description of the facility's effects on the natural environment, including effects on air and water quality resources, flora, and fauna;\n(6) a description of the greenhouse gas emissions associated with constructing and operating the facility;\n(7) a description of the facility's climate change resilience;\n(8) a description of the facility's effects on rare and unique natural resources;\n(9) a list that identifies human and natural environmental effects that are unavoidable if the facility is approved at a specific site or route; and\n(10) a description of (i) measures that might be implemented to mitigate the potential human and environmental impacts identified in clauses (1) to (7), and (ii) the estimated costs of the potential mitigative measures.\n(b) An applicant that applies using the standard process under section 216I.06 may include the environmental information required under paragraph (a) in the applicant's environmental assessment.\nAt least 30 days before filing an application with the commission, an applicant must provide notice to: (1) each local unit of government within which a site or route may be proposed; (2) Minnesota Tribal governments, as defined under section 10.65, subdivision 2; and (3) the state technical resource agencies. The notice must describe the proposed project and provide the entities receiving the notice an opportunity for preapplication coordination or feedback.\n(a) Before submitting an application under this chapter, an applicant must provide a draft application to commission staff for review. A draft application must not be filed electronically.\n(b) Commission staff's draft application review must focus on the application's completeness and clarifications that may assist the commission's review of the application. Upon completion of the preapplication review under this subdivision, commission staff must provide the applicant a summary of the completeness review. The applicant may include the completeness review summary with the applicant's application under subdivision 3.\n(a) The commission or the commission's designee must determine whether an application is complete and advise the applicant of any deficiencies within ten working days of the date an application is received.\n(b) An application is not incomplete if: (1) information that is not included in the application may be obtained from the applicant prior to the initial public meeting; and (2) the information that is not included in the application is not essential to provide adequate notice.\n(a) Upon finding an application is complete, the commission must:\n(1) publish notice of the application in a legal newspaper of general circulation in each county in which the site or route is proposed;\n(2) provide notice of the application to any regional development commission, Minnesota Tribal government, as defined under section 10.65, subdivision 2, county, incorporated municipality, and town in which any part of the site or route is proposed;\n(3) provide notice of the application and description of the proposed project to each owner whose property is within or adjacent to the proposed site or route for the large energy infrastructure facility; and\n(4) provide notice to persons who have requested to be placed on a list maintained by the commission to receive notice of proposed large energy infrastructure facilities.\n(b) The commission must identify a standard format and content for application notice. At a minimum, the notice must include: (1) a description of the proposed project, including a map displaying the general area of the proposed site or route; (2) a description detailing how a person may receive more information and future notices regarding the application; and (3) a location where a copy of the application may be reviewed.\n(c) The notice must also provide information regarding the date and location of the public meeting where the public may learn more about the proposed project and the commission's review process.\n(d) For the purposes of providing mailed notice under this subdivision, an owner is the person indicated in the records of the county auditor or, in a county where tax statements are mailed by the county treasurer, in the records of the county treasurer. If necessary, other appropriate records may be used for purposes of providing mailed notice. The failure to provide mailed notice to a property owner or defects in the notice do not invalidate the proceedings, provided a bona fide attempt to comply with this subdivision has been made.\n(a) The commission must hold at least one public meeting in a location near the proposed large energy infrastructure facility project's location to explain the permitting process, present major issues, accept public comments on the scope of the environmental impact statement prepared under section 216I.06 or the addendum prepared under section 216I.07, and respond to questions raised by the public.\n(b) At the public meeting and in written comments accepted for at least ten days following the date of the public meeting, the commission must accept comments on (1) potential impacts and alternative sites or routes to be considered in the environmental impact statement prepared under section 216I.06 or the addendum prepared under section 216I.07, and (2) permit conditions.\nUpon close of the public comment period following the public meeting in subdivision 9, the commission must:\n(1) prepare a draft site or route permit for the large energy infrastructure facility. The draft permit must identify the person or persons who are the permittee, describe the proposed project, and include proposed permit conditions. A draft site permit does not authorize a person to construct a large energy infrastructure facility. The commission may change the draft site permit in any respect before final issuance or may deny the permit; and\n(2) identify the scope of the environmental impact statement prepared under section 216I.06 or the addendum prepared under section 216I.07. A member of the commission is prohibited from giving direction to commission environmental review staff on the scope of an environmental assessment, environmental addendum, or environmental impact statement, except in a publicly noticed meeting or through a publicly available commission notice or order.\n(a) The commission's site and route permit determinations must (1) be guided by the state's goals to conserve resources; (2) minimize environmental impacts, and minimize human settlement and other land use conflicts; (3) consider impacts to environmental justice areas, as defined in section 216B.1691, subdivision 1, paragraph (e), including cumulative impacts, as defined in section 116.065, to environmental justice areas; and (4) ensure the state's energy security through efficient, cost-effective energy supply and infrastructure.\n(b) When determining whether to issue a site permit for a large energy infrastructure facility, the commission must include but is not limited to:\n(1) evaluating research and investigations relating to: (i) large energy infrastructure facilities' effects on land, water, and air resources; and (ii) the effects water and air discharges and electric and magnetic fields resulting from large energy infrastructure facilities have on public health and welfare, vegetation, animals, materials, and aesthetic values, including baseline studies, predictive modeling, and evaluating new or improved methods to minimize adverse impacts of water and air discharges and other matters pertaining to large energy infrastructure facilities' effects on the water and air environment;\n(2) conducting environmental evaluation of sites and routes that are proposed for future development and expansion, and the relationship of proposed sites and routes for future development and expansion to Minnesota's land, water, air, and human resources;\n(3) evaluating the effects of measures designed to minimize adverse environmental effects;\n(4) evaluating the potential for beneficial uses of waste energy from proposed large electric power generating plants;\n(5) analyzing the direct and indirect economic impact of proposed sites and routes, including but not limited to productive agricultural land lost or impaired;\n(6) evaluating adverse direct and indirect environmental effects that are unavoidable should the proposed site and route be accepted;\n(7) evaluating alternatives to the applicant's proposed site or route, if applicable;\n(8) when appropriate, evaluating potential routes that would use or parallel existing railroad and highway rights-of-way;\n(9) evaluating governmental survey lines and other natural division lines of agricultural land to minimize interference with agricultural operations;\n(10) evaluating the future needs for large energy infrastructure facilities in the same general area as any proposed site or route;\n(11) evaluating irreversible and irretrievable commitments of resources if the proposed site or route is approved;\n(12) when appropriate, considering the potential impacts raised by other state and federal agencies and local entities;\n(13) evaluating the benefits of the proposed facility with respect to (i) the protection and enhancement of environmental quality, and (ii) the reliability of state and regional energy supplies;\n(14) evaluating the proposed facility's impact on socioeconomic factors; and\n(15) evaluating the proposed facility's employment and economic impacts in the facility site's vicinity and throughout Minnesota, including the quantity, quality, and compensation level of construction and permanent jobs. The commission must consider a facility's local employment and economic impacts, and may reject or place conditions on a site or route permit based on the local employment and economic impacts.\n(c) If the commission's rules are substantially similar to existing federal agency regulations the utility is subject to, the commission must apply the federal regulations.\n(d) The commission is prohibited from designating a site or route that violates state agency rules.\n(e) When applicable, the commission must make a specific finding that the commission considered locating a route for a high-voltage transmission line on an existing high-voltage transmission route and using parallel existing highway right-of-way. To the extent an existing high-voltage transmission route or parallel existing right-of-way is not used for the route, the commission must state the reasons.\n(a) The commission must issue a site or route permit that is demonstrated to be in the public interest pursuant to this chapter. The commission may require any reasonable conditions in the site or route permit that are necessary to protect the public interest. The commission maintains continuing jurisdiction over the route and site permits and any conditions contained in the route and site permits.\n(b) The commission is prohibited from issuing a site permit in violation of the site selection standards and criteria established under this section and in rules the commission adopts. When the commission designates a site, the commission must issue a site permit to the applicant with any appropriate conditions. The commission must publish a notice of the commission's decision in the Environmental Quality Board Monitor within 30 days of the date the commission issues the site permit.\n(c) The commission is prohibited from issuing a route permit in violation of the route selection standards and criteria established under this section and in rules the commission adopts. When the commission designates a route, the commission must issue a permit for the construction of a high-voltage transmission line that specifies the design, routing, right-of-way preparation, and facility construction the commission deems necessary, including any other appropriate conditions. The commission may order the construction of high-voltage transmission line facilities that are capable of expanding transmission capacity through multiple circuiting or design modifications. The commission must publish a notice of the commission's decision in the Environmental Quality Board Monitor within 30 days of the date the commission issues the route permit.\n(d) The commission must require as a condition of permit issuance, including the issuance of a modified permit for a repowering project, as defined in section 216B.243, subdivision 8, paragraph (b), that the recipient of a site or route permit to construct an energy infrastructure facility, including all of the permit recipient's construction contractors and subcontractors on the project: (1) must pay no less than the prevailing wage rate, as defined in section 177.42; and (2) is subject to the requirements and enforcement provisions under sections 177.27, 177.30, 177.32, 177.41 to 177.435, and 177.45.\n(e) Immediately following the commission's vote granting an applicant a site or route permit, and prior to issuance of a written commission order embodying the decision, the applicant may submit to commission staff for review preconstruction compliance filings specifying details of the applicant's proposed site or route operations.\n(a) The commission must consult with other state agencies and obtain technical expertise and other assistance for activities and proceedings under this chapter.\n(b) Notwithstanding the requirements of section 216B.33, employees of the commission may take any action related to the requirements of this chapter immediately following a hearing and vote by the commission, prior to issuing a written order, finding, authorization, or certification.",
	"repealed": false
}