{
	"id": "16A.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.81",
	"title": "16A.81 TECHNOLOGY DEVELOPMENT LEASE-PURCHASE FINANCING.",
	"text": "(a) The following definitions apply to this section.\n(b) \"Technology system project\" means the development, acquisition, installation, and implementation of a technology system that is essential to state operations and is expected to have a long useful life.\n(c) \"Lease-purchase agreement\" means an agreement for the lease and installment purchase of a technology system project, or a portion of the project, between the commissioner, on behalf of the state, and a vendor or a third-party financing source.\n(d) \"Technology development lease-purchase guidelines\" means policies, procedures, and requirements established by the commissioner for technology system projects that are financed pursuant to a lease-purchase agreement.\nThe commissioner may enter into a lease-purchase agreement in an amount sufficient to fund a technology system project and authorize the public or private sale and issuance of certificates of participation, provided that:\n(1) the technology system project has been authorized by law to be funded pursuant to a lease-purchase agreement;\n(2) the term of the lease-purchase agreement and the related certificates of participation shall not exceed the lesser of the expected useful life of the technology system project financed by the lease-purchase agreement and the certificates or ten years from the date of issuance of the lease-purchase agreement and the certificates;\n(3) the principal amount of the lease-purchase agreement and the certificates is sufficient to provide for the costs of issuance, capitalized interest, credit enhancement, or reserves, if any, as required under the lease-purchase agreement;\n(4) funds sufficient for payment of lease obligations have been committed in the authorizing legislation for the technology system project for the fiscal year during which the lease-purchase agreement is entered into; provided that no lease-purchase agreement shall obligate the state to appropriate funds sufficient to make lease payments due under such agreement in any future fiscal year; and\n(5) planned expenditures for the technology system project are permitted within the technology development lease-purchase guidelines.\nThe commissioner may covenant in a lease-purchase agreement that the state will abide by the terms and provisions that are customary in lease-purchase financing transactions, including, but not limited to, covenants providing that the state:\n(1) will maintain insurance as required under the terms of the lease-purchase agreement;\n(2) is responsible to the lessor for any public liability or property damage claims or costs related to the selection, use, or maintenance of the technology system project, to the extent of insurance or self-insurance maintained by the state, and for costs and expenses incurred by the lessor as a result of any default by the state; or\n(3) authorizes the lessor to exercise the rights of a secured party with respect to the technology system project or any portion of the project in the event of default or nonappropriation of funds by the state, and for the present recovery of lease payments due during the current term of the lease-purchase agreement as liquidated damages in the event of default.\nProceeds of the lease-purchase agreement and certificates of participation must be credited to a technology lease project fund in the state treasury. Net income from investment of the proceeds, as estimated by the commissioner, must be credited to the appropriate accounts in the technology lease project fund. Funds in the technology lease project fund are appropriated for the purposes described in the authorizing law for each technology development project and this section.\nBefore the lease-purchase proceeds are received in the technology lease project fund, the commissioner may transfer to that fund from the general fund amounts not exceeding the expected proceeds from the lease-purchase agreement and certificates of participation. The commissioner shall return these amounts to the general fund by transferring proceeds when received. The amounts of these transfers are appropriated from the general fund and from the technology lease project fund.\nActual and necessary travel and subsistence expenses of employees and all other nonsalary expenses incidental to the sale, printing, execution, and delivery of the lease-purchase agreement and certificates of participation may be paid from the lease-purchase proceeds. The lease-purchase proceeds are appropriated for this purpose.\nLease-purchase proceeds remaining in the technology lease project fund after the purposes for which the lease-purchase agreement was undertaken are accomplished or abandoned, as determined by the commissioner, must be transferred to the general fund.\nA lease-purchase agreement does not constitute or create a general or moral obligation or indebtedness of the state in excess of the money from time to time appropriated or otherwise available for payments or obligations under such agreement. Payments due under a lease-purchase agreement during a current lease term for which money has been appropriated is a current expense of the state.\nProperty purchased subject to a lease-purchase agreement under this section is not subject to personal property taxes. The purchaser of property for lease to the state under a valid lease-purchase agreement under this section is not subject to the sales tax on the purchase of the property or on the payments received under the agreement, but the state is subject to the tax under chapter 297A on property acquired under the agreement.\nThe commissioner from time to time may enter into a new lease-purchase agreement and issue and sell certificates of participation for the purpose of refunding any lease-purchase agreement and related certificates of participation then outstanding, including the payment of any redemption premiums, any interest accrued or that is to accrue to the redemption date, and costs related to the issuance and sale of such refunding certificates. The proceeds of any refunding certificates may, in the discretion of the commissioner, be applied to the purchase or payment at maturity of the certificates to be refunded, to the redemption of outstanding lease-purchase agreements and certificates on any redemption date, or to pay interest on the refunding lease-purchase agreements and certificates and may, pending such application, be placed in escrow to be applied to such purchase, payment, retirement, or redemption. Any escrowed proceeds, pending such use, may be invested and reinvested in obligations that are authorized investments under section 11A.24. The income earned or realized on any authorized investment may also be applied to the payment of the lease-purchase agreements and certificates to be refunded, interest or premiums on the refunded certificates, or to pay interest on the refunding lease-purchase agreements and certificates. After the terms of the escrow have been fully satisfied, any balance of proceeds and any investment income may be returned to the general fund, or if applicable, the technology lease project fund, for use in a lawful manner. All refunding lease-purchase agreements and certificates issued under the provisions of this subdivision must be prepared, executed, delivered, and secured by appropriations in the same manner as the lease-purchase agreements and certificates to be refunded.",
	"repealed": false
}