{
	"id": "256B.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.072",
	"title": "256B.072 PERFORMANCE REPORTING AND QUALITY IMPROVEMENT SYSTEM.",
	"text": "(a) The commissioner of human services shall establish a performance reporting system for health care providers who provide health care services to public program recipients covered under chapters 256B, 256D, and 256L, reporting separately for managed care and fee-for-service recipients.\n(b) The measures used for the performance reporting system for medical groups shall include measures of care for asthma, diabetes, hypertension, and coronary artery disease and measures of preventive care services. The measures used for the performance reporting system for inpatient hospitals shall include measures of care for acute myocardial infarction, heart failure, and pneumonia, and measures of care and prevention of surgical infections. In the case of a medical group, the measures used shall be consistent with section 62U.02, subdivision 1, paragraph (a), clause (1). In the case of inpatient hospital measures, the commissioner shall appoint the Minnesota Hospital Association and Stratis Health to advise on the development of the performance measures to be used for hospital reporting. To enable a consistent measurement process across the community, the commissioner may use measures of care provided for patients in addition to those identified in paragraph (a). The commissioner shall ensure collaboration with other health care reporting organizations so that the measures described in this section are consistent with those reported by those organizations and used by other purchasers in Minnesota.\n(c) The commissioner may require providers to submit information in a required format to a health care reporting organization or to cooperate with the information collection procedures of that organization. The commissioner may collaborate with a reporting organization to collect information reported and to prevent duplication of reporting.\n(d) By October 1, 2007, and annually thereafter, the commissioner shall report through a public website the results by medical groups and hospitals, where possible, of the measures under this section, and shall compare the results by medical groups and hospitals for patients enrolled in public programs to patients enrolled in private health plans. To achieve this reporting, the commissioner may collaborate with a health care reporting organization that operates a website suitable for this purpose.\n(e) Performance measures must be stratified as provided under section 62U.02, subdivision 1, paragraph (c), and risk-adjusted as specified in section 62U.02, subdivision 3, paragraph (b).\n(f) Notwithstanding paragraph (b), by January 1, 2019, the commissioner shall consider and appropriately adjust quality metrics and benchmarks for providers who primarily serve socioeconomically complex patient populations and request to be scored on additional measures in this subdivision. This applies to all Minnesota health care programs, including for patient populations enrolled in health plans, county-based purchasing plans, or managed care organizations and for value-based purchasing arrangements, including, but not limited to, initiatives operating under sections 62U.03, 256B.0753, 256B.0755, 256B.0756, and 256B.0757.\n(g) Assessment of patient satisfaction with chronic pain management for the purpose of determining compensation or quality incentive payments is prohibited. The commissioner shall require managed care plans, county-based purchasing plans, and integrated health partnerships to comply with this requirement as a condition of contract. This prohibition does not apply to:\n(1) assessing patient satisfaction with chronic pain management for the purpose of quality improvement; and\n(2) pain management as a part of a palliative care treatment plan to treat patients with cancer or patients receiving hospice care.\nNotwithstanding subdivision 1, paragraph (b), by January 1, 2019, the commissioner shall consider and appropriately adjust quality metrics and benchmarks for providers who primarily serve socioeconomically complex patient populations and request to be scored on additional measures in this subdivision. This requirement applies to all medical assistance and MinnesotaCare programs and enrollees, including persons enrolled in managed care and county-based purchasing plans or other managed care organizations, persons receiving care under fee-for-service, and persons receiving care under value-based purchasing arrangements, including but not limited to initiatives operating under sections 62U.03, 256B.0753, 256B.0755, 256B.0756, and 256B.0757.",
	"repealed": false
}