{
	"id": "142A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.04",
	"title": "142A.04 STATE AND COUNTY SYSTEMS.",
	"text": "(a) The commissioner shall establish and enhance computer systems necessary for the efficient operation of the programs the commissioner supervises, including:\n(1) management and administration of the Supplemental Nutrition Assistance Program (SNAP) and income maintenance program, including the electronic distribution of benefits; and\n(2) management and administration of the child support enforcement program.\n(b) The commissioner's development costs incurred by computer systems for statewide programs administered with that computer system and mandated by state or federal law must not be assessed against county agencies. The commissioner may charge a county for development and operating costs incurred by computer systems for functions requested by the county and not mandated by state or federal law for programs administered by the computer system incurring the cost.\n(c) The commissioner shall distribute the nonfederal share of the costs of operating and maintaining the systems to the commissioner and to the counties participating in the system in a manner that reflects actual system usage, except that the nonfederal share of the costs of the MAXIS computer system and child support enforcement systems for statewide programs administered by those systems and mandated by state or federal law shall be borne entirely by the commissioner.\n(d) The commissioner may enter into contractual agreements with federally recognized Indian Tribes with a reservation in Minnesota to participate in state-operated computer systems related to the management and administration of the SNAP, income maintenance, and child support enforcement programs to the extent necessary for the Tribe to operate a federally approved family assistance program or any other program under the supervision of the commissioner.\nA state systems account for the Department of Children, Youth, and Families is created in the state treasury. Money collected by the commissioner for the programs in subdivision 1 must be deposited in the account. Money in the state systems account and federal matching money are appropriated to the commissioner for purposes of this section.",
	"repealed": false
}