{
	"id": "256B.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.73",
	"title": "256B.73 DEMONSTRATION PROJECT FOR UNINSURED LOW-INCOME PERSONS.",
	"text": "The purpose of the demonstration project is to determine the need for and the feasibility of establishing a statewide program of medical insurance for uninsured low-income persons.\nThe commissioner of human services shall cooperate with a local coalition to establish a demonstration project to provide low cost medical insurance to uninsured low-income persons in Cook, Crow Wing, Lake, St. Louis, Carlton, Aitkin, Pine, Itasca, and Koochiching Counties except an individual county may be excluded as determined by the county board of commissioners. The coalition shall work with the commissioners of human services, commerce, and health and potential demonstration providers as well as other public and private organizations to determine program design, including enrollee eligibility requirements, benefits, and participation.\nFor the purposes of this section, the following terms have the meanings given:\n(1) \"coalition\" means an organization comprised of members representative of small business, health care providers, county social service departments, health consumer groups, and the health industry, established to serve the purposes of this demonstration;\n(2) \"demonstration provider\" means a corporation regulated under chapter 62A, 62C, or 62D;\n(3) \"individual provider\" means a medical provider under contract to the demonstration provider to provide medical care to enrollees; and\n(4) \"enrollee\" means a person eligible to receive coverage according to subdivision 4.\nTo be eligible for participation in the demonstration project, an enrollee must:\n(1) not be eligible for Medicare or medical assistance; and\n(2) have no medical insurance or health benefits plan available through employment or other means that would provide coverage for the same medical services as provided by this demonstration.\n(a) Eligible persons enrolled by a demonstration provider shall receive a health services benefit package that includes health services which the enrollees might reasonably require to be maintained in good health, including emergency care; inpatient hospital and physician, advanced practice registered nurse, or physician assistant care; outpatient health services; and preventive health services.\n(b) Services related to substance use disorder, mental illness, vision care, dental care, and other benefits may be excluded or limited upon approval by the commissioners. The coalition may petition the commissioner of commerce or health, whichever is appropriate, for waivers that allow these benefits to be excluded or limited.\n(c) The commissioners, the coalition, and demonstration providers shall work together to design a package of benefits or packages of benefits that can be provided to enrollees for an affordable monthly premium.\nThe demonstration provider may terminate the coverage for an enrollee who has not made payment within the first ten calendar days of the month for which coverage is being purchased. The termination for nonpayment shall be retroactive to the first day of the month for which no payment has been made by the enrollee. The coalition will assure that participants receive adequate information about the demonstration nature of the project. The coalition will assist enrollees with finding alternative coverage at the conclusion of the demonstration project.\nThe commissioner of human services shall contract with the coalition to administer and direct the demonstration project and to select and retain the demonstration provider for the duration of the project. This contract shall be for 24 months with an option to renew for no more than 12 months. This contract may be canceled without cause by the commissioner upon 90 days' written notice to the coalition or by the coalition with 90 days' written notice to the commissioner. The commissioner shall assure the cooperation of the county human services or social services staff in all counties participating in the project.\nTo assure enrollees of uninterrupted delivery of health care services, the commissioner may pay the premium to the demonstration provider for persons who become eligible for medical assistance. To determine eligibility for medical assistance, any medical expenses for eligible services incurred by the demonstration provider shall be considered as evidence of satisfying the medical expense requirements of section 256B.056, subdivisions 4 and 5.\nNo part of the demonstration project shall become operational until any required waivers of appropriate federal regulations are obtained from the Centers for Medicare and Medicaid Services.\n[Repealed, 1988 c 689 art 2 s 269]",
	"repealed": false
}