{
	"id": "115B.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.41",
	"title": "115B.41 ALLOCATING COSTS; FAILURE TO COMPLY.",
	"text": "(a) A person who is subject to the requirements in section 115B.40, subdivision 4 or 5, paragraph (b), is responsible for all environmental response costs incurred by the commissioner at or related to the facility until the date of notice of compliance under section 115B.40, subdivision 7. The commissioner may use any funds available for closure, postclosure care, and response action established by the owner or operator. If those funds are insufficient or if the owner or operator fails to assign rights to them to the commissioner, the commissioner may seek recovery of environmental response costs against the owner or operator in the county of Ramsey or in the county where the facility is located or where the owner or operator resides.\n(b) In an action brought under this subdivision in which the commissioner prevails, the court shall award the commissioner reasonable attorney fees and other litigation expenses incurred by the commissioner to bring the action. All costs, fees, and expenses recovered under this subdivision must be deposited in the remediation fund established in section 116.155.\nAll environmental response costs, including administrative and legal expenses, incurred by the commissioner at a qualified facility before the date of notice of compliance under section 115B.40, subdivision 7, constitute a lien in favor of the state upon any real property located in the state, other than homestead property, owned by the owner or operator who is subject to the requirements of section 115B.40, subdivision 4 or 5. A lien under this subdivision attaches when the environmental response costs are first incurred and continues until the lien is satisfied or becomes unenforceable as for an environmental lien under section 514.672. Notice, filing, and release of the lien are governed by sections 514.671 to 514.676, except where those requirements specifically are related to only cleanup action expenses as defined in section 514.671. Relative priority of a lien under this subdivision is governed by section 514.672, except that a lien attached to property that was included in any permit for the solid waste disposal facility takes precedence over all other liens regardless of when the other liens were or are perfected. Amounts received to satisfy all or a part of a lien must be deposited in the remediation fund.\nIf an owner or operator fails to comply with section 115B.40, subdivision 4, or 5, paragraph (b), fails to remit payment of environmental response costs incurred by the commissioner before the date of notice of compliance under section 115B.40, subdivision 7, and is a local government unit, the commissioner may seek payment of the costs from any state aid payments, except payments made under section 115A.557, subdivision 1, otherwise due the local government unit. The commissioner of revenue, after being notified by the commissioner that the local government unit has failed to pay the costs and the amount due, shall pay an annual proportionate amount of the state aid payment otherwise payable to the local government unit into the remediation fund that will, over a period of no more than five years, satisfy the liability of the local government unit for the costs.\nIf an owner or operator of a qualified facility that is not a local government unit does not undertake closure or postclosure care in compliance with section 115B.40, subdivision 4, the owner or operator is ineligible to obtain or renew a state or local permit or license to engage in a business that manages solid waste. Failure of an owner or operator that is not a local government unit to complete closure or postclosure care at a qualified facility is prima facie evidence of the lack of fitness of that owner or operator to conduct any solid waste business and is grounds for revocation of any solid waste business permit or license held by that owner or operator.\nFor the purposes of this subdivision and subdivision 2, \"owner or operator\" means a person, partnership, firm, limited liability company, cooperative, association, corporation, or other entity and includes any entity in which the owner or operator owns a controlling interest.\nTo expedite compliance with section 115B.40, subdivision 4, a person other than an owner or operator may undertake closure or postclosure care in compliance with that subdivision under an agreement with the commissioner.",
	"repealed": false
}