{
	"id": "325E.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.70",
	"title": "325E.70 ESTATE SALE CONDUCTORS; BONDING REQUIRED.",
	"text": "(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Estate sale\" means a sale, to which the public is invited, of physical assets, suited primarily for household or personal use, owned by one or more individuals or families, or by the estate of a deceased individual. Estate sale does not include an auction.\n(c) \"Estate sale conductor\" means an individual, including an auctioneer, who conducts, or contracts to conduct, an estate sale in the expectation or hope of receiving financial compensation for services rendered.\n(d) \"Conducts an estate sale\" means entering into and performing an agreement with the owner or owners of property to be sold at an estate sale, in which agreement the estate sale conductor undertakes to take responsibility for conducting the sale, including functions such as advice, advertising, pricing, display of merchandise, selling, receiving and accounting for payments, and record-keeping.\n(a) Before entering into an agreement to conduct an estate sale, the estate sale conductor shall give or previously have filed a corporate surety bond to the county in which the estate sale will take place, or in which the estate sale conductor resides, in a penal sum of at least $20,000, conditioned that the estate sale conductor will pay all sums required by law or contract and in all things conform to the contract and to all laws relevant to the estate sale or to persons who conduct estate sales. The county treasurer, for approval, shall endorse the bond and file it in the county treasurer's office.\n(b) Paragraph (a) applies to an auctioneer who conducts an estate sale, on the same basis as any other estate sale conductor, regardless of whether the auctioneer has also posted the bond required under section 330.02 for the auctioneer's sales conducted as an auctioneer.\nThis section shall not apply to licensed certified public accountants or licensed attorneys.",
	"repealed": false
}