{
	"id": "103C.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.331",
	"title": "103C.331 POWERS OF DISTRICT BOARDS.",
	"text": "A soil and water conservation district is a governmental and political subdivision of this state, and a public body, corporate and politic, and has the following powers in addition to any others prescribed by law.\nThe supervisors may invite the legislative body of a municipality or county in the district to designate a representative to advise and consult with the supervisors of the district on questions of program and policy that may affect the property, water supply, or other interests of the municipality or county.\nA district may conduct surveys, investigations, and research to identify the problems and preventive practices specified in section 103C.005.\nA district may publish its comprehensive plan and the results of its surveys, investigations, and research and may disseminate information to the public concerning any of its activities.\nA district may conduct demonstration projects within the district on lands owned or administered by a state agency, with the cooperation of the administering agency, and on other lands with the consent of the land occupier, to demonstrate practices which implement the state policy specified in section 103C.005.\nA district may implement any necessary practices within the district, including structural measures and works of improvement to achieve the purposes of this chapter and fulfill other statutory responsibilities, on:\n(1) lands acquired by the district;\n(2) lands owned or administered by a public agency, with the cooperation of the administering agency; and\n(3) other lands, with the consent of the land occupier.\nA district may cooperate or enter into agreements with and furnish financial or other aid to a land occupier or appropriate agency to implement this chapter and fulfill other statutory responsibilities, subject to conditions the district board determines are necessary.\nA district may acquire any rights or interests in real or personal property by option, purchase, exchange, lease, gift, grant, bequest, devise, or otherwise. It may maintain, operate, administer, and improve any properties acquired. It may receive income from the properties and expend the income to implement this chapter and fulfill other statutory responsibilities. It may sell, lease, or otherwise dispose of any of its property or interests.\nA district may make available, on terms it prescribes, to land occupiers within the district agricultural and engineering machinery and equipment, fertilizer, seeds, seedlings, and other material or equipment that helps land occupiers implement practices on their land to implement this chapter and fulfill other statutory responsibilities.\nA district may construct, install, improve, maintain, and operate structures and works necessary or convenient to perform an operation authorized under this chapter and other statutory authority.\n(a) A district may develop and revise a comprehensive plan to fulfill statutory responsibilities. The plan may include:\n(1) the construction, maintenance, and operation of structural measures;\n(2) methods of cultivation;\n(3) the use of vegetation;\n(4) cropping programs;\n(5) mechanical practices;\n(6) changes in use of land;\n(7) water quality improvement practices;\n(8) other land use, soil erosion reduction, and agricultural practices;\n(9) related technical standards and specifications; and\n(10) other practices, projects, programs, and systems to fulfill statutory responsibilities.\n(b) The plan must be consistent with the statewide frameworks as provided in chapter 103B.\n(c) At least 60 days before submitting the plan to the state board, the district must hold a public hearing on the plan and provide notice of the hearing via the district's website. The district must give notice of the hearing to the county and all affected cities and towns. To allow for public input, the district must also administer a review and comment period of at least 30 days before submitting the plan.\n(d) The district must submit the plan to the state board for review and approval before adopting the plan at a district meeting.\n(a) A district may take over by purchase, lease, or otherwise, and may improve, maintain, operate, and administer a soil or water conservation, erosion-control, erosion-prevention, water quality improvement, watershed protection, flood prevention, or flood control project in its boundaries undertaken by the United States or by a public agency.\n(b) A district may accept donations, gifts, grants, or contributions in money, services, materials, or otherwise from the United States, a public agency, or other source to accomplish statutory responsibilities. A district may enter into a contract or agreement necessary or appropriate to accomplish the transfer. A district may use or expend money, services, materials, or other things to accomplish an authorized purpose.\nA district may sue and be sued in its name, have perpetual succession unless terminated as provided in section 103C.225, make and execute contracts and other instruments necessary or convenient to the exercise of its powers, and make, amend, or repeal rules and regulations consistent with this chapter and other statutory authority.\nAs a condition for extending benefits for the performance of work, including operations and maintenance, upon lands not owned or administered by a public agency or the district, the district may require compensation or contributions in money, services, materials, or otherwise, commensurate with the cost or reasonable value of the operations or work conferring the benefits.\n(a) A district may apply for and enter into an agreement or contract to obtain or use state or federal funding or assistance under any law providing for state or federal funding or assistance for an authorized purpose of the district.\n(b) A district may:\n(1) acquire any land, easements, or rights-of-way needed in connection with works of improvement installed with federal or state assistance or funding;\n(2) assume the proportionate share of the cost of installing works of improvement involving state or federal funding or assistance that is equitable in consideration of anticipated benefits from the improvements;\n(3) arrange to defray costs of operating and maintaining works of improvement in accordance with prescribed regulations;\n(4) acquire or provide assurance that land occupiers have acquired the water rights and other rights, pursuant to state law, needed to install, maintain, and operate the works of improvement; and\n(5) obtain agreements to carry out recommended soil and water conservation measures and prepare farm plans for owners of not less than 50 percent or other required percentage of the lands situated in a drainage area above a retention reservoir installed with federal assistance, as prescribed by applicable federal law, and may do any other acts necessary to secure and use federal aid.\nThe district shall annually present a budget consisting of an itemized statement of district expenses for the ensuing calendar year to the boards of county commissioners of the counties in which the district is located. The county boards may levy an annual tax on all taxable real property in the district for the amount that the boards determine is necessary to meet the requirements of the district. The amount levied shall be collected and distributed to the district as prescribed by chapter 276. The amount may be spent by the district for a district purpose authorized by law.\nA district may appropriate funds to provide membership in state and national associations that have as their purpose the betterment and improvement of soil and water conservation district operations. A district may participate through designated representatives in the meetings and activities of the associations. A district may appropriate funds to defray the actual and necessary expenses of its representatives in connection with the associations' membership. The expenses may be paid only upon the presentation of a verified itemized claim.\nA district may procure liability insurance as provided in section 466.06, automobile insurance on personal cars while used on official business, insurance on the contents of district offices, and workers' compensation insurance, or may require the counties in which the district is located to include the district in the counties' insurance coverage for these purposes.\nA district may accept delegation from the state, a county, or a city of authority to administer soil and water conservation-related official controls, as defined in section 103B.305, subdivision 7, of the county or city. Prior to the delegation, the district and the state, county, or city agreement must include provisions that:\n(1) provide for the source of funding for administering the official controls;\n(2) the district will provide notice and hearing in the same instances that the county or city would; and\n(3) identify who will provide legal advice and support for administration and enforcement.\nIn implementing its authorities, a district shall cooperate as far as possible with federal, state, and local agencies and with private organizations in order to avoid duplication and to enhance implementation of public and private conservation initiatives within its jurisdiction.\nA district may initiate, construct, operate, and maintain water and soil resource management practices, projects, programs, and systems within the boundaries of the district and use, supplement, or otherwise coordinate contributions from state, federal, Tribal, or local governments and private entities for similar purposes.\nThe district may obtain loans when the district determines it is prudent to accomplish its statutory duties.",
	"repealed": false
}