{
	"id": "160.801",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.801",
	"title": "160.801 HIGHWAY SPONSORSHIP PROGRAM.",
	"text": "(a) The commissioner is authorized to establish a program designed to encourage businesses, civic groups, or individuals to voluntarily assist with the improvement and maintenance of real property comprising the trunk highway system, including bicycle and pedestrian trails, roadside monuments, and historic sites.\n(b) All support provided by volunteers or vendors must be carried out in a manner consistent with construction and maintenance plans approved by the commissioner after consultation with the volunteers.\n(c) The commissioner may provide assistance to (1) enhance volunteer safety, and (2) facilitate the implementation and administration of the sponsorship program.\nThe commissioner may enter into volunteer agreements with businesses, civic groups, or individuals to support, maintain, and make improvements to real property included in the trunk highway system. Agreements under this section are not subject to section 161.32.\n(a) The volunteer support activities include but are not limited to:\n(1) work to create, protect, and enhance pollinator habitat along highway rights-of-way;\n(2) work to pick up litter along roadsides;\n(3) work to install enhancements, including landscaping materials, on trunk highway property;\n(4) financial support provided to the department for specific roadside improvements;\n(5) financial support consisting of the sponsor hiring a professional landscape contractor to install vegetation, maintain landscape plantings, or pick up litter, or for other similar activities along a selected area of highway right-of-way; or\n(6) installation of features that enhance the aesthetics of trunk highway property or the amenities available to highway users.\n(b) All volunteer support activities must have prior commissioner approval.\nThe commissioner may erect signs to publicly recognize and express appreciation to businesses, civic groups, and individuals that provide volunteer funding or services under the sponsorship program.\nFunds received under this section must be deposited in the highway sponsorship program account, which is created in the special revenue fund. The account consists of funds as provided by law, and any other money donated, allotted, transferred, or otherwise provided to the account. Funds in the account are annually appropriated to the commissioner for the purpose specified in the volunteer agreement.\nThe commissioner must not take action under this section that would result in the loss of federal highway funds or require payment of highway funds to the federal government.",
	"repealed": false
}