{
	"id": "211B.075",
	"url": "https://www.revisor.mn.gov/statutes/cite/211B.075",
	"title": "211B.075 INTIMIDATION AND INTERFERENCE WITH THE VOTING PROCESS; PENALTIES.",
	"text": "(a) A person may not directly or indirectly use or threaten force, coercion, violence, restraint, damage, harm, or loss, including loss of employment or economic reprisal against:\n(1) any person with the intent to compel that person to register or abstain from registering to vote, vote or abstain from voting, or vote for or against a candidate or ballot question; or\n(2) any person with the intent to impede that person's efforts to encourage another to cast a ballot or assist another in registering to vote, traveling to a polling place, casting a ballot, or participating in any other aspect of the election process.\n(b) Notwithstanding paragraph (a), in a civil action brought to prevent and restrain violations of this subdivision or to require the payment of civil penalties, the plaintiff must demonstrate that the action or attempted action would cause a reasonable person to feel intimidated. The plaintiff does not need to show that the defendant intended to cause the victim to feel intimidated.\n(a) No person may, within 60 days of an election, cause information to be transmitted by any means that the person:\n(1) intends to impede or prevent another person from exercising the right to vote; and\n(2) knows to be materially false.\n(b) The prohibition in this subdivision includes but is not limited to information regarding the time, place, or manner of holding an election; the qualifications for or restrictions on voter eligibility at an election; and threats to physical safety associated with casting a ballot.\nNo person may intentionally hinder, interfere with, or prevent another person from voting, registering to vote, or aiding another person in casting a ballot or registering to vote.\nA person may be held vicariously liable for any damages resulting from the violation of this section and may be identified in an order restraining violations of this section if that person:\n(1) intentionally aids, advises, hires, counsels, abets, incites, compels, or coerces a person to violate any provision of this section or attempts to aid, advise, hire, counsel, abet, incite, compel, or coerce a person to violate any provision of this section; or\n(2) conspires, combines, agrees, or arranges with another to either commit a violation of this section or aid, advise, hire, counsel, abet, incite, compel, or coerce a third person to violate any provision of this section.\n(a) A person who violates this section is guilty of a gross misdemeanor.\n(b) The attorney general, a county attorney, or any person injured by an act prohibited by this section may bring a civil action to prevent or restrain a violation of this section if there is a reasonable basis to believe that an individual or entity is committing or intends to commit a prohibited act.\n(c) The attorney general, a county attorney, or any person injured by an act prohibited by this section, may bring a civil action pursuant to section 8.31 to recover damages, together with costs of investigation and reasonable attorney fees, and receive other equitable relief as determined by the court. An action brought by any person under section 8.31, subdivision 3a, is in the public interest. In addition to all other damages, the court may impose a civil penalty of up to $1,000 for each violation.\n(d) Civil remedies allowable under this section are cumulative and do not restrict any other right or remedy otherwise available. An action for a penalty or remedy under this section must be brought within two years of the date the violation is alleged to have occurred. The complaint process provided in sections 211B.31 to 211B.36 does not apply to violations of this section.",
	"repealed": false
}