{
	"id": "47.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.64",
	"title": "47.64 OPERATION OF AN ELECTRONIC FINANCIAL TERMINAL.",
	"text": "(a) Any person establishing and maintaining an electronic financial terminal located separate and apart from a financial institution's principal office, branch, or detached facility for use by one type of financial institution shall, upon written request, make its services available to any requesting financial institution of similar type on a fair, equitable, and nondiscriminatory basis. A financial institution requesting use of an electronic financial terminal shall be permitted its use only if the financial institution conforms to reasonable technical operation standards which have been established by the electronic financial terminal provider. For purposes of this subdivision, the types of financial institutions are: (1) commercial banks and savings banks; (2) credit unions, industrial loan and thrift companies, and regulated lenders under chapter 56; and (3) savings associations. The services of an electronic financial terminal may be made available to any type of financial institution. After March 1, 1979, or earlier if determined by the commissioner to be technically feasible, an electronic financial terminal which is used by or made available to one type of financial institution shall be made available, upon request, to other types of financial institutions on a fair, equitable, and nondiscriminatory basis. The charges required to be paid to any person establishing and maintaining an electronic financial terminal shall be related to an equitable proportion of the direct costs of establishing, operating, and maintaining the terminal plus a reasonable return on those costs to the owner of the terminal. The charges may provide for amortization of development costs and capital expenditures over a reasonable period of time.\n(b) Any person establishing and maintaining an electronic financial terminal located on and as a part of a financial institution's principal office, branch, detached facility, or lending office where deposits are not taken may, at the financial institution's option, (1) maintain the electronic financial terminal for the exclusive use of the financial institution's customers; or (2) maintain the electronic financial terminal for the use of the financial institution's customers and make some or all of the electronic financial terminal's services available to any other requesting financial institution on a fair, equitable, and nondiscriminatory basis.\nIf a person establishing and maintaining an electronic financial terminal makes it available for use by one or more federal savings associations or one or more federal credit unions and their customers, the federal savings association or federal credit union shall agree to grant to any financial institution use of all similar devices owned, maintained, or used by it. A state chartered financial institution or a national bank may participate upon contractual agreement in the use of a device which is capable of performing the functions of an electronic financial terminal and is owned or operated by one or more federal savings associations or federal credit unions.\nAny agreement or charge between a person establishing an electronic financial terminal and the person at whose location the terminal is established shall be upon such commercially reasonable terms and conditions as are agreed to by the parties. A person at whose location an electronic financial terminal is established and maintained may limit the kind of financial transaction functions which the terminal may perform. If the electronic financial terminal is not located on the premises of a financial institution's principal office, branch, or detached facility, the person shall make available upon request every financial transaction function which the terminal does perform to all financial institutions, their affiliates, or agents on a nondiscriminatory basis. A function involving either a bank credit card authorized pursuant to section 48.185 or other credit card authorized under any other similar open end consumer credit sales plan need not be made so available.\nAn electronic financial terminal located separate and apart from a financial institution's principal office, branch, or detached facility, if staffed, shall be operated exclusively by a person who is not employed by any financial institution, any financial institution holding company, or subsidiary thereof. However, persons assisting customers of financial institutions at the site of the terminal may be trained by employees of a financial institution, financial institution holding company, or subsidiary thereof, and nothing in this section shall be construed to prohibit periodic servicing of an electronic financial terminal by an employee of a financial institution, financial institution holding company, or subsidiary thereof.\nTo insure payment to any person who suffers loss due to negligence or intentional misconduct in the operation of an electronic financial terminal any person seeking to establish an electronic financial terminal shall, at the option of the commissioner, file with the commissioner's office either a financial statement in an acceptable form, or a bond, rider to an existing bond, or other collateral security acceptable to and in an amount set by the commissioner. The commissioner shall permit the filing of a financial statement in lieu of a bond or other security only if the financial statement demonstrates that the person seeking to establish the electronic financial terminal has the financial ability to insure payment to any person who suffers loss due to negligence or intentional misconduct in the operation of the electronic financial terminal. If the filing of a financial statement is permitted, additional periodic financial information shall be filed as required by the commissioner.\nA customer of a bank, savings bank, savings association, or credit union located outside Minnesota may, with the consent of the person establishing an electronic financial terminal, use the terminal for the withdrawal of funds and for the inquiry as to the balance in that customer's accounts maintained with that institution. Nothing in sections 47.61 to 47.74 shall be construed to authorize any person, other than a financial institution, to engage in business which is only legally authorized to be engaged in by financial institutions.\nAn agreement to share electronic financial terminals may not contain provisions distinguishing between cards issued by United States financial institutions and cards issued by Canadian financial institutions relative to a fee that may be charged to a cardholder by the owner or operator of an electronic financial terminal, if the terminal is located within 50 miles of the Canadian border, and the enforcement of any such provision is prohibited.",
	"repealed": false
}