{
	"id": "353.017",
	"url": "https://www.revisor.mn.gov/statutes/cite/353.017",
	"title": "353.017 EMPLOYEES OF LABOR ORGANIZATIONS.",
	"text": "Unless specifically exempt under section 353.01, subdivision 2b, a coordinated member of the association who is on an authorized leave of absence, and who is an employee of a labor organization that represents public employees who are association members may elect, under subdivision 2, to continue to be a coordinated member with respect to employment by the labor organization subject to the limitations set forth in subdivisions 4 and 7.\nA person described in subdivision 1 is covered by the association if written election to be covered is delivered to the association within six months of employment by the labor organization.\nThe employee, employer and additional employer contributions are the obligation of the employee who elects coverage herein in accord with this chapter; provided, however, the employer, labor organization may pay the employer and additional employer contributions. The employer shall, in any event, deduct the necessary contributions from the employee's salary, subject to the limitations under subdivision 6, and remit all contributions to the public employees retirement association under section 353.27, subdivisions 4, 7, 10, 11, and 12.\nMS 1980 [Repealed, 1982 c 404 s 10]\nA retirement annuity is only payable, if the person has met any other applicable requirements, upon the termination by the person who elected coverage under subdivision 1 of employment by the labor organization. The reemployed annuitant earnings limitation set forth in section 353.37, subdivision 1, applies in the event that the person who elected coverage under subdivision 1 retires and is subsequently reemployed while an annuitant by the labor organization or by any other entity employing persons who are covered by the Public Employees Retirement Association by virtue of that employment.\nPersons who become association members pursuant to this section shall not be eligible for election to the board of trustees.\nThe annuity of a person otherwise eligible for an annuity under this chapter is subject to the provisions of section 353.37.\nThe covered salary for a labor organization employee who qualifies for membership under this section is limited to the lesser of:\n(1) the employee's actual salary as defined under section 353.01, subdivision 10; or\n(2) 75 percent of the salary of the governor as set under section 15A.082.\nThe limited covered salary determined under this subdivision must be used in determining employee and employer contributions under section 353.27, subdivisions 2, 3, and 3a, and in determining retirement annuities and other benefits under this chapter and chapter 356.",
	"repealed": false
}