{
	"id": "582.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/582.031",
	"title": "582.031 LIMITED RIGHT OF ENTRY; DUTY TO ENTER AND PROTECT PREMISES.",
	"text": "(a) If premises described in a mortgage or sheriff's certificate are vacant or unoccupied, the holder of the mortgage or sheriff's certificate or the holder's agents and contractors may enter upon the premises to protect the premises from waste and trespass, until the holder of the mortgage or sheriff's certificate receives notice that the premises are occupied. The holder of the mortgage or sheriff's certificate does not become a mortgagee in possession by taking actions authorized or required under this section. An affidavit of the sheriff, the building or housing regulatory authority of a municipality in which the property is located, the holder of the mortgage or sheriff's certificate, or a person acting on behalf of the holder, describing the premises and stating that the same are vacant or unoccupied, is prima facie evidence of the facts stated in the affidavit and is entitled to be recorded in the office of the county recorder or the registrar of titles in the county where the premises are located, if it contains a legal description of the premises.\n(b) If the holder of a sheriff's certificate knows that there is prima facie evidence of abandonment of the property, as described in section 582.032, subdivision 7, clauses (1) to (6), the holder or the holder's agents:\n(1) shall enter the premises and make reasonable periodic inspections, install or change the locks on all doors, install locks on all windows that do not have locks, and ensure that any existing window locks are functioning properly; and\n(2) may, to protect the premises from waste, trespass, or falling below minimum community standards for public safety and sanitation, enter the premises and board windows, doors, and other openings; install and operate an alarm system; and otherwise prevent or minimize damage to the premises from the elements, vandalism, trespass, or other illegal activity.\n(c) Upon an installation or change of locks as required by this section, the holder of a sheriff's certificate must deliver a key to the premises to the mortgagor or any person lawfully claiming through the mortgagor, upon request.\nThe holder of the mortgage or sheriff's certificate may take the following actions to protect the premises from waste, trespass, or from falling below minimum community standards for public safety and sanitation: make reasonable periodic inspections; install or change locks on doors and windows; board windows, doors, and other openings; install and operate an alarm system; and otherwise prevent or minimize damage to the premises from the elements, vandalism, trespass, or other illegal activities. If the holder of the mortgage or sheriff's certificate installs or changes locks under this section, a key to the premises must be promptly delivered to the mortgagor or any person lawfully claiming through the mortgagor, upon request.\nAll costs incurred by the holder of the mortgage or sheriff's certificate to protect the premises from waste or trespass or from falling below minimum community standards for public safety and sanitation may be added to the principal balance of the mortgage or the costs allowable upon redemption. The costs may bear interest to the extent provided in the mortgage and may be added to the redemption price if the costs are incurred after a foreclosure sale. If the costs are incurred after a foreclosure sale, the holder of any sheriff's certificate of sale or certificate of redemption must comply with the provisions of section 582.03. The provisions of this section are in addition to, and do not limit or replace, any other rights or remedies available to holders of mortgages and sheriff's certificates, at law or under the applicable mortgage agreements.",
	"repealed": false
}