{
	"id": "325F.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.23",
	"title": "325F.23 MARKING, LABELING, AND CONSUMER INFORMATION.",
	"text": "The outside of all containers and wrappings of insulation used or offered for sale in Minnesota shall have the following information printed legibly thereon in bold type not less than one-eighth inch high:\n(a) type (pneumatic or blown, pouring, batt, roll, blanket, board, cellular, or reflective);\n(b) R value (to the nearest tenth) per inch at the recommended installation density;\n(c) required thickness in inches to obtain four or more commonly used R values and the corresponding coverage areas in square feet of the insulation in the container or wrapping;\n(d) expiration date and expected shelf life of all resins, catalysts, and foaming agents for all foam insulations, whether in powder, diluted or partially diluted state, on canister, drum, container, or package. For purposes of this section, \"foam insulation\" means products having an organic base or composed of vinyl or plastic material or both, which are manufactured or installed using a process involving a foaming agent, a resin, a catalyst and an air compressor, including but not limited to urea-formaldehyde, other urea-based foams, urethane foam, polyurethane foam, polystyrene foam, and isocyanurate foam;\n(e) name and address of the manufacturer of the insulation;\n(f) a notation of those current specifications of the United States General Services Administration, the United States Department of Energy, the United States Department of Housing and Urban Development, the United States Consumer Product Safety Commission, the Federal Trade Commission and the commissioner with which the insulation complies;\n(g) the net weight of the contents of the bag, package, or container.\nWhere insulation is used or offered for sale without the manufacturer's container, the information required in subdivision 1 shall be provided in a separate printed statement to the intermediate and ultimate consumers.",
	"repealed": false
}