{
	"id": "15A.081",
	"url": "https://www.revisor.mn.gov/statutes/cite/15A.081",
	"title": "15A.081 SALARIES; EXPENSES; LEAVE TRANSFERS.",
	"text": "[Repealed, 2Sp1997 c 3 s 19]\n[Repealed, 1976 c 239 s 7]\n[Repealed, 1974 c 511 s 16]\n[Repealed, 1974 c 511 s 16]\n[Repealed, 1977 c 35 s 21]\n[Repealed, 1980 c 617 s 45]\n[Repealed, 1987 c 404 s 191]\n[Repealed, 2Sp1997 c 3 s 19]\n[Repealed, 1Sp1985 c 16 art 2 s 39 subd 1]\n[Repealed, 2003 c 133 art 2 s 21]\nThe Board of Trustees of the Minnesota State Colleges and Universities shall establish a salary range for the position of chancellor of the Minnesota State Colleges and Universities. The board shall submit the proposed salary range to the Legislative Coordinating Commission for approval, modification, or rejection in the manner provided in section 3.855. The board shall establish the salary for the chancellor within the approved salary range.\nIn deciding whether to approve a salary increase, the board shall consider the performance of the chancellor in areas including educational leadership, student success, system management, human resources, and affirmative action.\nNotwithstanding any law to the contrary, positions listed in section 15A.0815, subdivisions 2 and 3, constitutional officers, the commissioner of Iron Range resources and rehabilitation, and the director of the State Lottery are authorized an annual expense allowance not to exceed $1,500 for necessary expenses in the normal performance of their duties for which no other reimbursement is provided. The expenditures under this subdivision are subject to any laws and rules relating to budgeting, allotment and encumbrance, preaudit and postaudit. The commissioner of management and budget may adopt rules to assure the proper expenditure of these funds and to provide for reimbursement.\n(a) This subdivision governs transfers of accumulated vacation leave and sick leave if the governor appoints the incumbent of a position listed in section 15A.0815 to another position listed in section 15A.0815.\n(b) An appointee moving between positions in the executive branch shall transfer all vacation leave and sick leave hours to the appointee's credit at the time of the new appointment.\n(c) The governor may authorize an appointee to transfer accumulated vacation leave and sick leave hours under the following conditions:\n(1) an appointee moving to a position in the executive branch from a position outside the executive branch may be permitted to transfer no more than 275 hours of accumulated unliquidated vacation leave and no more than 900 hours of accumulated unliquidated sick leave; and\n(2) an appointee moving to a position outside the executive branch from a position within the executive branch may be permitted to transfer accumulated unliquidated vacation leave and sick leave hours up to the maximum accumulations permitted by the personnel policies governing the new position.\nThe governor shall notify the commissioner of management and budget of any transfers authorized under this paragraph.",
	"repealed": false
}