{
	"id": "244.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.51",
	"title": "244.51 REPORTING REQUIRED.",
	"text": "(a) Beginning January 15, 2026, and by January 15 each year thereafter for ten years, the commissioner must provide a report to the chairs and ranking minority members of the house of representatives and senate committees and divisions with jurisdiction over public safety and judiciary.\n(b) For the 2026 report, the commissioner must report on implementing the requirements in this act. Starting with the 2027 report, the commissioner must report on the status of the requirements in this act for the previous fiscal year.\n(c) Each report must be provided to the sitting president of the Minnesota Association of Community Corrections Act Counties and the executive directors of the Minnesota Sentencing Guidelines Commission, the Minnesota Indian Women's Sexual Assault Coalition, the Minnesota Alliance on Crime, Violence Free Minnesota, the Minnesota Coalition Against Sexual Assault, and the Minnesota County Attorneys Association.\n(d) The report must include but not be limited to:\n(1) a qualitative description of policy development; implementation status; identified implementation or operational challenges; strategies identified to mitigate and ensure that the act does not create or exacerbate gender, racial, and ethnic disparities; and proposed mechanisms for projecting future savings and reallocation of savings;\n(2) the number of persons who were granted earned incentive release credit, the total number of days of incentive release earned, a summary of committing offenses for those persons who earned incentive release credit, a summary of earned incentive release savings, and the demographic data for all persons eligible for earned incentive release credit and the reasons and demographic data of those eligible persons for whom earned incentive release credit was unearned or denied;\n(3) the number of persons who earned supervision abatement status, the total number of days of supervision abatement earned, the committing offenses for those persons granted supervision abatement status, the number of revocations for reoffense while on supervision abatement status, and the demographic data for all persons eligible for, considered for, granted, or denied supervision abatement status and the reasons supervision abatement status was unearned or denied;\n(4) the number of persons deemed ineligible to receive earned incentive release credits and supervise abatement and the demographic data for the persons; and\n(5) the number of victims who submitted input, the number of referrals to local victim-serving agencies, and a summary of the kinds of victim services requested.\n(a) The commissioner must solicit feedback on victim-related operational concerns from the Minnesota Indian Women's Sexual Assault Coalition, Minnesota Alliance on Crime, Minnesota Coalition Against Sexual Assault, and Violence Free Minnesota.\n(b) The feedback should relate to applying earned incentive release credit and supervision abatement status options. A summary of the feedback from the organizations must be included in the annual report.\nThe commissioner must direct the Department of Corrections' research unit to regularly evaluate earned incentive release credits and other provisions of the act. The findings must be published on the Department of Corrections' website and in the annual report.",
	"repealed": false
}