{
	"id": "514.672",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.672",
	"title": "514.672 ENVIRONMENTAL LIEN.",
	"text": "All cleanup action expenses for which a person is liable to the state under section 115B.04 or 115C.04, constitute a lien in favor of the state upon all real property that:\n(1) is owned by the person at the time the environmental lien notice is filed; and\n(2) is subject to or affected by the cleanup action.\nAn environmental lien attaches when:\n(1) cleanup action costs are first incurred by the state with respect to a cleanup action;\n(2) the person referred to in subdivision 1 is provided, by certified or registered mail, written notice of potential liability; and\n(3) a lien notice is filed as provided in section 514.673.\nAn environmental lien continues until the liability for the cleanup action costs, or a judgment against the person referred to in subdivision 1 arising out of the liability, is satisfied or becomes unenforceable through operation of the statute of limitations under section 115B.11 or 541.05, subdivision 1, clause (2), unless the lien is released under subdivision 5.\nAn environmental lien is subject to the rights of any other person, including an owner, purchaser, holder of a mortgage or security interest, or judgment lien creditor, whose interest is perfected before a lien notice has been filed as provided in section 514.673. The rights of such other person must be afforded the same protections against an environmental lien as are afforded against a judgment lien which arises out of an unsecured obligation and which arises as of the time of the filing of the lien notice as provided in section 514.673.\n(a) The commissioner shall release an environmental lien if:\n(1) the environmental lien is satisfied;\n(2) a legally enforceable agreement satisfactory to the agency under chapter 115B, or the commissioner under chapter 115C, has been executed relating to taking the cleanup action or reimbursing the agency for the cleanup action expenses;\n(3) a claim or judgment for the cleanup action expenses is satisfied; or\n(4) the environmental lien is unenforceable.\n(b) The commissioner or the agency may release an environmental lien if the attachment or enforcement of the environmental lien is determined by the agency or commissioner not to be in the public interest.\n(c) An environmental lien is unenforceable if:\n(1) the lien is unenforceable under subdivision 3; or\n(2) a determination is made by a court that the environmental lien is unenforceable.\n(d) The commissioner shall execute the release of an environmental lien and file the release as provided in section 514.673, subdivision 2.",
	"repealed": false
}