{
	"id": "93.482",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.482",
	"title": "93.482 RECLAMATION FEES.",
	"text": "(a) The commissioner shall charge every person holding a permit to mine an annual permit fee. The fee is payable to the commissioner by June 30 of each year, beginning in 2009.\n(b) The annual permit to mine fee for a taconite mining operation is $60,000 if the operation had production within the calendar year immediately preceding the year in which payment is due and $30,000 if there was no production within the immediately preceding calendar year.\n(c) The annual permit to mine fee for a nonferrous metallic minerals mining operation is $75,000 if the operation had production within the calendar year immediately preceding the year in which payment is due and $37,500 if there was no production within the immediately preceding calendar year.\n(d) The annual permit to mine fee for a scram mining operation is $5,000 if the operation had production within the calendar year immediately preceding the year in which payment is due and $2,500 if there was no production within the immediately preceding calendar year.\n(e) The annual permit to mine fee for a peat mining operation is $1,000 if the operation had production within the calendar year immediately preceding the year in which payment is due and $500 if there was no production within the immediately preceding calendar year.\n(a) In addition to the application fee specified in section 93.481, the commissioner shall assess a person submitting an application for a permit to mine for a taconite or a nonferrous metallic minerals mining operation the reasonable costs for reviewing the application and preparing the permit to mine. For nonferrous metallic minerals mining, the commissioner shall assess reasonable costs for monitoring construction of the mining facilities.\n(b) The commissioner must give the applicant an estimate of the supplemental application fee under this subdivision. The estimate must include a brief description of the tasks to be performed and the estimated cost of each task. The application fee under section 93.481 must be subtracted from the estimate of costs to determine the supplemental application fee.\n(c) The applicant and the commissioner shall enter into a written agreement to cover the estimated costs to be incurred by the commissioner.\n(d) The commissioner shall not issue the permit to mine until the applicant has paid all fees in full. Upon completion of construction of a nonferrous metallic minerals facility, the commissioner shall refund the unobligated balance of the monitoring fee revenue.\n[Never effective, 2009 c 88 art 12 s 23]",
	"repealed": false
}