{
	"id": "179A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.11",
	"title": "179A.11 UNIVERSITY OF MINNESOTA.",
	"text": "(a) The following are appropriate units of University of Minnesota employees. The listed units include but are not limited to the positions described. A position may be added to a unit if the commissioner makes a determination under section 179A.09 that the unit is appropriate for the position. All units shall exclude managerial and confidential employees.\n(1) The Law Enforcement Unit includes the positions of all employees with the power of arrest.\n(2) The Craft and Trades Unit includes the positions of all employees whose work requires specialized manual skills and knowledge acquired through formal training or apprenticeship or equivalent on-the-job training or experience.\n(3) The Service, Maintenance, and Labor Unit includes the positions of all employees whose work is typically that of maintenance, service, or labor and which does not require extensive previous training or experience, except as provided in unit 4.\n(4) The Health Care Nonprofessional and Service Unit includes the positions of all nonprofessional employees of the University of Minnesota hospitals, dental school, and health service whose work is unique to those settings, excluding labor and maintenance employees as defined in unit 3.\n(5) The Nursing Professional Unit includes all positions which are required to be filled by registered nurses.\n(6) The Clerical and Office Unit includes the positions of all employees whose work is typically clerical or secretarial, including nontechnical data recording and retrieval and general office work, except as provided in unit 4.\n(7) The Technical Unit includes the positions of all employees whose work is not typically manual and which requires specialized knowledge or skills acquired through two-year academic programs or equivalent experience or on-the-job training, except as provided in unit 4.\n(8) The Outstate Instructional Unit includes the positions of all instructional employees with the rank of professor, associate professor, assistant professor, including research associate or instructor, including research fellow, located at the Duluth campus, provided that the positions of instructional employees of the same ranks at the Morris, Crookston, or Rochester campuses shall be included within this unit if a majority of the eligible employees voting at a campus so vote during an election conducted by the commissioner, provided that the election or majority verification procedure shall not be held until the Duluth campus has voted in favor of representation. The election shall be held or majority verification procedure shall take place when an employee organization or group of employees petitions the commissioner stating that a majority of the eligible employees at one of these campuses wishes to join the unit and this petition is supported by a showing of at least 30 percent support from eligible employees at that campus and is filed between September 1 and November 1.\nFor the purposes of this section, an \"instructional employee\" is an individual who spends 35 percent or more of their work time creating, delivering, and assessing the mastery of credit-bearing coursework.\n(9) The Graduate Assistant Unit includes the positions of all graduate assistants who are enrolled in the graduate school and who hold the rank of research assistant, teaching assistant, teaching associate I or II, project assistant, graduate school fellow, graduate school trainee, professional school fellow, professional school trainee, or administrative fellow I or II. The listed ranks do not coincide with the ranks that are categorized by the University of Minnesota as professionals in training, even though in some cases the job titles may be the same.\n(b) An employee of the University of Minnesota whose position is not enumerated in paragraph (a) may petition the commissioner to determine an appropriate unit for the position. The commissioner must make a determination for an appropriate unit as provided in section 179A.09 and the commissioner must give special weight to the desires of the petitioning employee or representatives of the petitioning employee.\n(a) Each of the following groups of University of Minnesota employees has the right, as specified in this subdivision, to separate from the instructional and supervisory units: (1) health sciences instructional employees at all campuses with the rank of professor, associate professor, assistant professor, including research associate, or instructor, including research fellow, (2) instructional employees of the law school with the rank of professor, associate professor, assistant professor, including research associate, or instructor, including research fellow, (3) instructional supervisors, (4) noninstructional professional supervisors, and (5) academic professional and administrative staff supervisors.\n(b) The right to separate may be exercised:\n(1) by petition between September 1 and November 1. If a group separates from its unit, it has no right to meet and negotiate, but retains the right to meet and confer with the appropriate officials on any matter of concern to the group. The right to separate must be exercised as follows: An employee organization or group of employees claiming that a majority of any one of these groups of employees on a statewide basis wish to separate from their unit may petition the commissioner for an election during the petitioning period. If the petition is supported by a showing of at least 30 percent support from the employees, the commissioner may hold an election on the separation issue or the petitioning group may proceed under the process set forth in section 179A.12. This election must be conducted within 30 days of the close of the petition period. If a majority of votes cast endorse severance from their unit, the commissioner shall certify that result; or\n(2) by the group's exclusion from a proposed unit in a representation petition.\n(c) Where not inconsistent with other provisions of this section, the election is governed by section 179A.12. If a group of employees severs, it may rejoin that unit by following the procedures for severance during the periods for severance.\nUnits organized under this section that have elected exclusive bargaining representatives may by mutual agreement of the exclusive representatives jointly negotiate a contract with the regents or may negotiate separate contracts with the regents. If the exclusive bargaining representatives jointly negotiate a contract with the regents, the contract must be ratified by each unit.",
	"repealed": false
}