{
	"id": "332.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/332.57",
	"title": "332.57 DISCLOSURE STATEMENT.",
	"text": "Before the execution of a contract or agreement between the buyer and a credit services organization or before the receipt by the credit services organization of any money or other valuable consideration, whichever occurs first, the credit services organization shall provide the buyer with a statement in writing containing all of the information required by subdivision 2. The credit services organization shall maintain on file for a period of two years an exact copy of the statement, personally signed by the buyer, acknowledging receipt of a copy of the statement.\nThe disclosure statement required under subdivision 1 must be printed in boldface and in at least 10-point type and must include the following statement:\n\"CONSUMER CREDIT FILE RIGHTS UNDER MINNESOTA AND FEDERAL LAW\nYou have a right to dispute inaccurate information in your credit report by contacting the credit bureau directly. However, neither you nor any credit repair company or credit repair organization has the right to have accurate, current, and verifiable information removed from your credit report. The credit bureau must remove accurate, negative information from your report only if it is over seven years old. Bankruptcy information can be reported for ten years.\nYou have a right to obtain a copy of your credit report from a credit bureau. You may be charged a reasonable fee. There is no fee, however, if you have been turned down for credit, employment, insurance, or a rental dwelling because of information in your credit report within the preceding 60 days. The credit bureau must provide assistance to help you interpret the information in your credit file. You are entitled to receive a free copy of your credit report if you are unemployed and intend to apply for employment in the next 60 days, if you are a recipient of public welfare assistance, or if you have reason to believe that there is inaccurate information in your credit report due to fraud.\nYou have a right to sue a credit repair ORGANIZATION that violates the Credit Repair Organization Act. This law prohibits deceptive practices by credit repair organizations.\nYou have the right to cancel your contract with any credit repair organization for any reason within three business days of the date you signed it.\nCredit bureaus are required to follow reasonable procedures to ensure that the information they report is accurate. However, mistakes may occur.\nYou may, on your own, notify a credit bureau in writing that you dispute the accuracy of information in your credit file. The credit bureau must then reinvestigate and modify or remove inaccurate or incomplete information. The credit bureau is prohibited from charging any fee for this service. Any pertinent information and copies of all documents you have concerning an error should be given to the credit bureau.\nIf the credit bureau's reinvestigation does not resolve the dispute to your satisfaction, you may send a brief statement to the credit bureau, to be kept in your file, explaining why you think the record is inaccurate. The credit bureau must include a summary of your statement about disputed information with any report it issues about you.\"",
	"repealed": false
}