{
	"id": "302A.435",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.435",
	"title": "302A.435 NOTICE.",
	"text": "Except as otherwise provided in this chapter, notice of all meetings of shareholders shall be given to every holder of shares entitled to vote, unless:\n(1) the meeting is an adjourned meeting to be held not more than 120 days after the date fixed for the original meeting and the date, time, and place of the meeting were announced at the time of the original meeting or any adjournment of the original meeting; or\n(2) the following have been mailed by first class mail to a shareholder at the address in the corporate records and returned undeliverable:\n(i) two consecutive regular meeting notices and notices of any special meetings held during the period between the two regular meetings; or\n(ii) all payments of dividends sent during a 12-month period, provided there are at least two sent during the 12-month period.\nIf notice of an adjourned meeting is required under clause (1), then the date for determination of shares entitled to notice of and entitled to vote at the adjourned meeting must comply with section 302A.445, subdivision 1, except that if the date of the meeting is set by court order, the court may provide that the original date of determination will continue in effect or may fix a new date.\nAn action or meeting that is taken or held without notice under clause (2) has the same force and effect as if notice was given. If the shareholder delivers a written notice of the shareholder's current address to the corporation, the notice requirement is reinstated.\nIn all instances where a specific minimum notice period has not otherwise been fixed by law, the notice shall be given at least ten days before the date of the meeting, or a shorter time provided in the articles or bylaws, and not more than 60 days before the date of the meeting.\nThe notice shall contain the date, time, and place of the meeting, the information with respect to dissenters' rights required by section 302A.473, subdivision 2, if applicable, and any other information required by this chapter. In the case of a special meeting, the notice shall contain a statement of the purposes of the meeting. The notice may also contain any other information required by the articles or bylaws or deemed necessary or desirable by the board or by any other person or persons calling the meeting.\nA shareholder may waive notice of a meeting of shareholders. A waiver of notice by a shareholder entitled to notice is effective whether given before, at, or after the meeting, and whether given in writing, orally, or by attendance. Attendance by a shareholder at a meeting is a waiver of notice of that meeting, except where the shareholder objects at the beginning of the meeting to the transaction of business because the meeting is not lawfully called or convened, or objects before a vote on an item of business because the item may not lawfully be considered at that meeting and does not participate in the consideration of the item at that meeting.",
	"repealed": false
}