{
	"id": "89.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/89.56",
	"title": "89.56 EXPENSES.",
	"text": "At the end of each fiscal year and upon completion of the infestation control measures in any zone of infestation, the commissioner shall prepare a certified statement of expenses incurred in carrying out the measures, including expenses of owners covered by agreements entered into pursuant to section 89.55. The statement shall show the amount that the commissioner determines to be the commissioner's share of the expenses. The share of the commissioner may include funds and the value of other contributions made available by the federal government and other cooperators. The balance of the costs shall constitute a charge on an acreage basis as provided herein against the owners of lands in the zone containing trees affected or likely to be affected by the forest pests or shade tree pests for which control measures were conducted. In fixing the rates at which charges shall be made against each owner, the commissioner shall consider the present commercial value of the trees on the land, the present and potential benefits to the owner from the application of the control measures, the cost of applying the measures to the land, and such other factors as in the discretion of the commissioner will enable determination of an equitable distribution of the cost to all owners. No charge shall be made against owners to the extent that they have individually or as members of a cooperative association contributed funds, supplies, or services pursuant to agreement under this section.\nNotice of said charge and the amount thereof shall be given to the owner by delivery or by depositing the same in the United States mails in an envelope properly addressed to the owner and bearing sufficient postage. The owner shall have the right to protest such charge to the commissioner within 60 days from the date of such notice, and shall also have the same right to review of such charge as is provided with respect to ad valorem property assessments. Application for such review shall be made within 60 days from the date of action by the commissioner on any protest.\nThe unpaid charges assessed under sections 89.51 to 89.64 and the actions of the commissioner on any protests filed pursuant to subdivision 2, shall be reported to the tax levying authority for the county in which the lands for which the charges are assessed are situated and shall be made a public record. Any charges finally determined to be due shall become a special assessment and shall be payable in the same manner and with the same interest and penalty charges and with the same procedure for collection as apply to ad valorem property taxes. Upon collection of the charges, the county treasurer shall forthwith cause the amounts thereof to be paid to the forest pest and shade tree pest control account created by section 89.58. Any unpaid charge or lien against the lands shall not be affected by the sale thereof or by dissolution of the zone of infestation.",
	"repealed": false
}