{
	"id": "103D.711",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.711",
	"title": "103D.711 ENGINEER'S REPORT.",
	"text": "MS 2022 [Repealed, 2024 c 90 art 3 s 88]\n(a) The engineer's report must include findings and recommendations about the proposed project. If the engineer finds the project feasible, the engineer must provide a plan of the proposed project as part of the report. The plan must include:\n(1) a map of the project area, drawn to scale, showing the location of the proposed improvements, if any;\n(2) the estimated total cost of completing the project including construction, operation, implementation, supervision, and administrative costs;\n(3) the acreage required as right-of-way listed by each lot and 40-acre tract or fraction of the lot or tract under separate ownership, if required to implement the project; and\n(4) other details and information to inform the managers of the practicability and necessity of the proposed project with the engineer's recommendations on these matters.\n(b) The map of the area must include:\n(1) the location and adequacy of the outlet, if the project is related to drainage;\n(2) the watershed of the project area;\n(3) the location of existing highways, bridges, and culverts;\n(4) the property, highways, and utilities affected by the project with the names of the known property owners;\n(5) the location of public land and water affected by the project; and\n(6) other physical characteristics of the watershed necessary to understand the area.\nThe engineer may adopt, approve, and include as a part of the engineer's report a project of the state or federal government that is pertinent to the project and may accept data, plats, plans, details, or information pertaining to the state or federal project given to the watershed district by the state or federal agency. The engineer may omit the items required in subdivision 2 from the engineer's report if the data given by the state or federal government is sufficient to meet the requirements of subdivision 2.\n(a) If the project has been initiated by petition and the engineer's report is unfavorable, the managers shall, by order, within 35 days set a time and place within the watershed district for a hearing for the petitioners to demonstrate why the managers should not refer the petition back to the petitioners for further proceedings or dismiss the petition.\n(b) The hearing notice must state:\n(1) that the engineer's report is unfavorable;\n(2) that the engineer's report is on file with the managers and may be reviewed; and\n(3) the time and place for the hearing.\n(c) The managers shall mail a copy of the notice to each of the petitioners at least 14 days before the hearing.\n(a) When the engineer's report is filed with the managers, the managers shall send a complete copy to the director and to the board.\n(b) The director and the board shall examine the engineer's report and by 30 days after receiving the report, the director shall make a director's advisory report and the board shall make a board's advisory report which must include:\n(1) a statement on whether the engineer's report is incomplete and not in accordance with this chapter;\n(2) a statement of whether the engineer's report is approved as being a practical plan;\n(3) if the project as planned does not meet approval, recommendations for changes considered advisable must be stated or an opinion that the proposed project or improvement is not practical; and\n(4) a recommendation as to whether a soil survey appears advisable.\n(c) The director's advisory report and the board's advisory report shall be directed to and filed with the managers.\n(d) The director's advisory report and the board's advisory report shall be considered advisory only.\nA notice may not be issued for the final hearing until the board's advisory report and the director's advisory report are filed or the time for filing the reports with the managers has expired. For projects initiated by the managers according to section 103D.707, the managers may decide at any time not to proceed to final hearing.\nThe findings, recommendations, and content of the engineering report shall conform as nearly as practicable to the requirements of this section.\nIf a soil survey is recommended to be made in the director's advisory report or the board's advisory report, the engineer shall make the soil survey and a soil survey report. The soil survey report must be submitted to the managers before the final hearing.",
	"repealed": false
}