{
	"id": "125A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.21",
	"title": "125A.21 THIRD-PARTY PAYMENT.",
	"text": "Nothing in sections 125A.03 to 125A.24 and 125A.65 relieves an insurer or similar third party from an otherwise valid obligation to pay, or changes the validity of an obligation to pay, for services rendered to a child with a disability, and the child's family. A school district shall pay the nonfederal share of medical assistance services provided according to section 256B.0625, subdivision 26. Eligible expenditures must not be made from federal funds or funds used to match other federal funds. Any federal disallowances are the responsibility of the school district. A school district may pay or reimburse co-payments, coinsurance, deductibles, and other enrollee cost-sharing amounts, on behalf of the student or family, in connection with health and related services provided under an individual educational plan or individualized family service plan.\n(a) Beginning July 1, 2000, districts shall seek reimbursement from insurers and similar third parties for the cost of services provided by the district whenever the services provided by the district are otherwise covered by the child's health coverage. Districts shall request, but may not require, the child's family to provide information about the child's health coverage when a child with a disability begins to receive services from the district of a type that may be reimbursable, and shall request, but may not require, updated information after that as needed.\n(b) For children enrolled in medical assistance under chapter 256B or MinnesotaCare under chapter 256L who have no other health coverage, a district shall provide an initial and annual written notice to the enrolled child's parent or legal representative of its intent to seek reimbursement from medical assistance or MinnesotaCare for:\n(1) the evaluations required as part of the individualized education program process or individualized family service plan process; and\n(2) health-related services provided by the district according to the individualized education program or individualized family service plan.\nThe initial notice must give the child's parent or legal representative the right to request a copy of the child's education records on the health-related services that the district provided to the child and disclosed to a third-party payer.\n(c) The district shall give the parent or legal representative annual written notice of:\n(1) the district's intent to seek reimbursement from medical assistance or MinnesotaCare for evaluations required as part of the individualized education program process or individualized family service plan process, and for health-related services provided by the district according to the individualized education program or individualized family service plan;\n(2) the right of the parent or legal representative to request a copy of all records concerning individualized education program or individualized family service plan health-related services disclosed by the district to any third party; and\n(3) the right of the parent or legal representative to withdraw consent for disclosure of a child's records at any time without consequence.\nThe written notice shall be provided as part of the written notice required by Code of Federal Regulations, title 34, section 300.504 or 303.520. The district must ensure that the parent of a child with a disability is given notice, in understandable language, of federal and state procedural safeguards available to the parent under this paragraph and paragraph (b).\n(d) In order to access the private health care coverage of a child who is covered by private health care coverage in whole or in part, a district must:\n(1) obtain annual written informed consent from the parent or legal representative, in compliance with subdivision 5; and\n(2) inform the parent or legal representative that a refusal to permit the district or state Medicaid agency to access their private health care coverage does not relieve the district of its responsibility to provide all services necessary to provide free and appropriate public education at no cost to the parent or legal representative.\n(e) If the commissioner of human services obtains federal approval to exempt covered individualized education program or individualized family service plan health-related services from the requirement that private health care coverage refuse payment before medical assistance may be billed, paragraphs (b), (c), and (d) shall also apply to students with a combination of private health care coverage and health care coverage through medical assistance or MinnesotaCare.\n(f) In the event that Congress or any federal agency or the Minnesota legislature or any state agency establishes lifetime limits, limits for any health care services, cost-sharing provisions, or otherwise provides that individualized education program or individualized family service plan health-related services impact benefits for persons enrolled in medical assistance or MinnesotaCare, the amendments to this subdivision adopted in 2002 are repealed on the effective date of any federal or state law or regulation that imposes the limits. In that event, districts must obtain informed consent consistent with this subdivision as it existed prior to the 2002 amendments and subdivision 5, before seeking reimbursement for children enrolled in medical assistance under chapter 256B or MinnesotaCare under chapter 256L who have no other health care coverage.\nSchool districts must reserve third-party revenue and must spend the reimbursements received only to:\n(1) retain an amount sufficient to compensate the district for its administrative costs of obtaining reimbursements;\n(2) regularly obtain from education- and health-related entities training and other appropriate technical assistance designed to improve the district's ability to access third-party payments for individualized education program or individualized family service plan health-related services; or\n(3) reallocate reimbursements for the benefit of students with individualized education programs or individualized family service plans in the district.\nTo the extent required by federal law, a school district may not require parents of children with disabilities, if they would incur a financial cost, to use private or public health coverage to pay for the services that must be provided under an individualized education program or individualized family service plan.\nWhen obtaining informed consent, consistent with sections 13.05, subdivision 4a; 256B.77, subdivision 2, paragraph (p); and Code of Federal Regulations, title 34, parts 99, 300, and 303, to bill health plans for covered services, the school district must notify the legal representative (1) that the cost of the person's private health insurance premium may increase due to providing the covered service in the school setting, (2) that the school district may pay certain enrollee health plan costs, including but not limited to, co-payments, coinsurance, deductibles, premium increases or other enrollee cost-sharing amounts for health and related services required by an individual service plan, or individualized family service plan, and (3) that the school's billing for each type of covered service may affect service limits and prior authorization thresholds. The informed consent may be revoked in writing at any time by the person authorizing the billing of the health plan.\nTo the extent required by federal law, no school district may deny, withhold, or delay any service that must be provided under an individualized education program or individualized family service plan because a family has refused to provide informed consent to bill a health plan for services or a health plan company has refused to pay any, all, or a portion of the cost of services billed.\nA school district may disclose information contained in a student's individualized education program, consistent with section 13.32, subdivision 3, paragraph (a), and Code of Federal Regulations, title 34, parts 99, 300, and 303; including records of the student's diagnosis and treatment, to a health plan company only with the signed and dated consent of the student's parent, or other legally authorized individual. The school district shall disclose only that information necessary for the health plan company to decide matters of coverage and payment. A health plan company may use the information only for making decisions regarding coverage and payment, and for any other use permitted by law.",
	"repealed": false
}