{
	"id": "31A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/31A.21",
	"title": "31A.21 COOPERATION WITH FEDERAL GOVERNMENT.",
	"text": "The Minnesota Department of Agriculture is the state agency responsible for cooperating with the United States Secretary of Agriculture under section 301 of the Federal Meat Inspection Act and of the Poultry Products Inspection Act to develop and administer the state meat inspection program under this chapter so that its requirements at least equal those imposed under titles I and IV of the Federal Meat Inspection Act and of the Poultry Products Inspection Act to develop and administer the state program under sections 31A.17 to 31A.20 to carry out the purposes of this chapter and the federal act.\nIn its cooperative efforts, the Minnesota Department of Agriculture may accept from the United States Secretary of Agriculture (1) advisory assistance in planning and otherwise developing the state program, (2) technical and laboratory assistance and training, including necessary curricular and instructional materials and equipment, and (3) financial and other aid for the administration of the program.\nThe Minnesota Department of Agriculture may recommend to the United States Secretary of Agriculture officials or employees of this state for appointment to the advisory committees provided for in section 301 of the Federal Meat Inspection Act and of the Poultry Products Inspection Act. The Minnesota Department of Agriculture shall serve as the representative of the governor for consultation with the secretary under paragraph (c) of section 301 of the Federal Meat Inspection Act and of the Poultry Products Inspection Act unless the governor selects another representative.\nIf the state program includes performance of functions by a municipality or other subdivision of state government, the municipality or subdivision is part of the Minnesota Department of Agriculture for the purposes of this section.\nA municipality or other subdivision of state government, through the agent of a community health board as authorized under section 145A.04 or other appropriate authority, may apply in writing for designation to operate a state-approved inspection service under supervision of the commissioner. Applications must be filed on forms obtained from the commissioner and include the information the commissioner requires.\nOn receipt of an application under subdivision 5, the commissioner shall determine whether the applicant's inspection service conforms with this chapter and the designation to operate under the commissioner's supervision as an approved inspection service. A municipality or other subdivision of state government may be designated only after the commissioner determines that each establishment under supervision of the municipality or other subdivision conforms with this chapter and the rules of the commissioner and that the municipality or subdivision is effectively enforcing laws and rules equivalent to sections 31A.01 to 31A.31 and the rules of the commissioner. The department shall make regular inspections and surveys to determine if the inspection service continues to comply. The commissioner may revoke the designation of inspection service by an agency if the commissioner finds that there is a failure to conform to the provisions of this chapter or the rules.\nIf a municipality or other subdivision of state government performs inspection service under this section, the agency may be reimbursed for the service at a rate contracted with Minnesota Department of Agriculture.",
	"repealed": false
}