{
	"id": "245D.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.06",
	"title": "245D.06 PROTECTION STANDARDS.",
	"text": "(a) The license holder must respond to incidents under section 245D.02, subdivision 11, that occur while providing services to protect the health and safety of and minimize risk of harm to the person.\n(b) The license holder must maintain information about and report incidents to the person's legal representative or designated emergency contact and case manager within 24 hours of an incident occurring while services are being provided, within 24 hours of discovery or receipt of information that an incident occurred, unless the license holder has reason to know that the incident has already been reported, or as otherwise directed in a person's support plan or support plan addendum. An incident of suspected or alleged maltreatment must be reported as required under paragraph (d), and an incident of serious injury or death must be reported as required under paragraph (e).\n(c) When the incident involves more than one person, the license holder must not disclose personally identifiable information about any other person when making the report to each person and case manager unless the license holder has the consent of the person.\n(d) Within 24 hours of reporting maltreatment as required under section 626.557 or chapter 260E, the license holder must inform the case manager of the report unless there is reason to believe that the case manager is involved in the suspected maltreatment. The license holder must disclose the nature of the activity or occurrence reported and the agency that received the report.\n(e) The license holder must report the death or serious injury of the person as required in paragraph (b) and to the Department of Human Services Licensing Division, and the Office of Ombudsman for Mental Health and Developmental Disabilities as required under section 245.94, subdivision 2a, within 24 hours of the death or serious injury, or receipt of information that the death or serious injury occurred, unless the license holder has reason to know that the death or serious injury has already been reported.\n(f) When a death or serious injury occurs in a facility certified as an intermediate care facility for persons with developmental disabilities, the death or serious injury must be reported to the Department of Health, Office of Health Facility Complaints, and the Office of Ombudsman for Mental Health and Developmental Disabilities, as required under sections 245.91 and 245.94, subdivision 2a, unless the license holder has reason to know that the death or serious injury has already been reported.\n(g) The license holder must conduct an internal review of incident reports of deaths and serious injuries that occurred while services were being provided and that were not reported by the program as alleged or suspected maltreatment, for identification of incident patterns, and implementation of corrective action as necessary to reduce occurrences. The review must include an evaluation of whether related policies and procedures were followed, whether the policies and procedures were adequate, whether there is a need for additional staff training, whether the reported event is similar to past events with the persons or the services involved, and whether there is a need for corrective action by the license holder to protect the health and safety of persons receiving services. Based on the results of this review, the license holder must develop, document, and implement a corrective action plan designed to correct current lapses and prevent future lapses in performance by staff or the license holder, if any.\n(h) The license holder must verbally report the emergency use of manual restraint of a person as required in paragraph (b) within 24 hours of the occurrence. The license holder must ensure the written report and internal review of all incident reports of the emergency use of manual restraints are completed according to the requirements in section 245D.061 or successor provisions.\nThe license holder must:\n(1) ensure the following when the license holder is the owner, lessor, or tenant of the service site:\n(i) the service site is a safe and hazard-free environment;\n(ii) that toxic substances or dangerous items are inaccessible to persons served by the program only to protect the safety of a person receiving services when a known safety threat exists and not as a substitute for staff supervision or interactions with a person who is receiving services. If toxic substances or dangerous items are made inaccessible, the license holder must document an assessment of the physical plant, its environment, and its population identifying the risk factors which require toxic substances or dangerous items to be inaccessible and a statement of specific measures to be taken to minimize the safety risk to persons receiving services and to restore accessibility to all persons receiving services at the service site;\n(iii) doors are locked from the inside to prevent a person from exiting only when necessary to protect the safety of a person receiving services and not as a substitute for staff supervision or interactions with the person. If doors are locked from the inside, the license holder must document an assessment of the physical plant, the environment and the population served, identifying the risk factors which require the use of locked doors, and a statement of specific measures to be taken to minimize the safety risk to persons receiving services at the service site;\n(iv) a staff person is available at the service site who is trained in basic first aid and, when required in a person's support plan or support plan addendum, cardiopulmonary resuscitation (CPR) whenever persons are present and staff are required to be at the site to provide direct support service. The CPR training must include instruction, hands-on practice, and an observed skills assessment under the direct supervision of a CPR instructor; and\n(v) that sharpened or metal knives are presumed to be inaccessible to an individual provisionally discharged from a commitment as mentally ill and dangerous who is residing in a licensed state-operated community-based program and whose provisional discharge plan restricts access to inherently dangerous instruments, including but not limited to knives, firearms, and explosives or incendiary material or devices, unless unsupervised access is approved by the individual, county case manager, and the individual's support team. Approval must be reflected in the support plan, the support plan addendum, or the self-management assessment. This provision does not apply to an individual who has been fully discharged from a commitment;\n(2) maintain equipment, vehicles, supplies, and materials owned or leased by the license holder in good condition when used to provide services;\n(3) follow procedures to ensure safe transportation, handling, and transfers of the person and any equipment used by the person, when the license holder is responsible for transportation of a person or a person's equipment;\n(4) be prepared for emergencies and follow emergency response procedures to ensure the person's safety in an emergency; and\n(5) follow universal precautions and sanitary practices, including hand washing, for infection prevention and control, and to prevent communicable diseases.\n[Repealed by amendment, 2013 c 108 art 8 s 27]\n(a) Whenever the license holder assists a person with the safekeeping of funds or other property according to section 245A.04, subdivision 13, the license holder must obtain written authorization to do so from the person or the person's legal representative and the case manager. Authorization must be obtained within five working days of service initiation and renewed annually thereafter. At the time initial authorization is obtained, the license holder must survey, document, and implement the preferences of the person or the person's legal representative and the case manager for frequency of receiving a statement that itemizes receipts and disbursements of funds or other property. The license holder must document changes to these preferences when they are requested.\n(b) A license holder or staff person may not accept powers-of-attorney from a person receiving services from the license holder for any purpose. This does not apply to license holders that are Minnesota counties or other units of government or to staff persons employed by license holders who were acting as attorney-in-fact for specific individuals prior to implementation of this chapter. The license holder must maintain documentation of the power-of-attorney in the service recipient record.\n(c) A license holder or staff person is restricted from accepting an appointment as a guardian as follows:\n(1) under section 524.5-309 of the Uniform Probate Code, any individual or agency that provides residence, custodial care, medical care, employment training, or other care or services for which the individual or agency receives a fee may not be appointed as guardian unless related to the respondent by blood, marriage, or adoption; and\n(2) under section 245A.03, subdivision 2, paragraph (a), clause (1), a related individual as defined under section 245A.02, subdivision 13, is excluded from licensure. Services provided by a license holder to a person under the license holder's guardianship are not licensed services.\n(d) Upon the transfer or death of a person, any funds or other property of the person must be surrendered to the person or the person's legal representative, or given to the executor or administrator of the estate in exchange for an itemized receipt.\nThe license holder is prohibited from using chemical restraints, mechanical restraints, manual restraints, time out, seclusion, or any other aversive or deprivation procedure, as a substitute for adequate staffing, for a behavioral or therapeutic program to reduce or eliminate behavior, as punishment, or for staff convenience.\n(a) The following procedures are allowed when the procedures are implemented in compliance with the standards governing their use as identified in clauses (1) to (3). Allowed but restricted procedures include:\n(1) permitted actions and procedures subject to the requirements in subdivision 7;\n(2) procedures identified in a positive support transition plan subject to the requirements in subdivision 8; or\n(3) emergency use of manual restraint subject to the requirements in section 245D.061.\n(b) A restricted procedure identified in paragraph (a) must not:\n(1) be implemented with a child in a manner that constitutes sexual abuse, neglect, physical abuse, or mental injury, as defined in section 260E.03;\n(2) be implemented with an adult in a manner that constitutes abuse or neglect as defined in section 626.5572, subdivision 2 or 17;\n(3) be implemented in a manner that violates a person's rights identified in section 245D.04;\n(4) restrict a person's normal access to a nutritious diet, drinking water, adequate ventilation, necessary medical care, ordinary hygiene facilities, normal sleeping conditions, necessary clothing, or any protection required by state licensing standards or federal regulations governing the program;\n(5) deny the person visitation or ordinary contact with legal counsel, a legal representative, or next of kin;\n(6) be used for the convenience of staff, as punishment, as a substitute for adequate staffing, or as a consequence if the person refuses to participate in the treatment or services provided by the program;\n(7) use prone restraint. For purposes of this section, \"prone restraint\" means use of manual restraint that places a person in a face-down position. Prone restraint does not include brief physical holding of a person who, during an emergency use of manual restraint, rolls into a prone position, if the person is restored to a standing, sitting, or side-lying position as quickly as possible;\n(8) apply back or chest pressure while a person is in a prone position as identified in clause (7), supine position, or side-lying position; or\n(9) be implemented in a manner that is contraindicated for any of the person's known medical or psychological limitations.\n(a) Use of the instructional techniques and intervention procedures as identified in paragraphs (b) and (c) is permitted when used on an intermittent or continuous basis. When used on a continuous basis, it must be addressed in a person's support plan addendum as identified in sections 245D.07 and 245D.071.\n(b) Physical contact or instructional techniques must use the least restrictive alternative possible to meet the needs of the person and may be used:\n(1) to calm or comfort a person by holding that person with no resistance from that person;\n(2) to protect a person known to be at risk of injury due to frequent falls as a result of a medical condition;\n(3) to facilitate the person's completion of a task or response when the person does not resist or the person's resistance is minimal in intensity and duration;\n(4) to block or redirect a person's limbs or body without holding the person or limiting the person's movement to interrupt the person's behavior that may result in injury to self or others with less than 60 seconds of physical contact by staff; or\n(5) to redirect a person's behavior when the behavior does not pose a serious threat to the person or others and the behavior is effectively redirected with less than 60 seconds of physical contact by staff.\n(c) Restraint may be used as an intervention procedure to:\n(1) allow a licensed health care professional to safely conduct a medical examination or to provide medical treatment ordered by a licensed health care professional;\n(2) assist in the safe evacuation or redirection of a person in the event of an emergency and the person is at imminent risk of harm; or\n(3) position a person with physical disabilities in a manner specified in the person's support plan addendum.\nAny use of manual restraint as allowed in this paragraph must comply with the restrictions identified in subdivision 6, paragraph (b).\n(d) Use of adaptive aids or equipment, orthotic devices, or other medical equipment ordered by a licensed health professional to treat a diagnosed medical condition do not in and of themselves constitute the use of mechanical restraint.\n(a) License holders must develop a positive support transition plan on the forms and in the manner prescribed by the commissioner for a person who requires intervention in order to maintain safety when it is known that the person's behavior poses an immediate risk of physical harm to self or others. The positive support transition plan must phase out any existing plans for the emergency or programmatic use of restrictive interventions prohibited under this chapter within the following timelines:\n(1) for persons receiving services from the license holder before January 1, 2014, the plan must be developed and implemented by February 1, 2014, and phased out no later than December 31, 2014; and\n(2) for persons admitted to the program on or after January 1, 2014, the plan must be developed and implemented within 30 calendar days of service initiation and phased out no later than 11 months from the date of plan implementation.\n(b) The commissioner has limited authority to grant approval for the emergency use of procedures identified in subdivision 6 that had been part of an approved positive support transition plan when a person is at imminent risk of serious injury as defined in section 245.91, subdivision 6, due to self-injurious behavior and the following conditions are met:\n(1) the person's expanded support team approves the emergency use of the procedures; and\n(2) the interim review panel established in section 245.8251, subdivision 4, recommends commissioner approval of the emergency use of the procedures.\n(c) Written requests for the emergency use of the procedures must be developed and submitted to the commissioner by the designated coordinator with input from the person's expanded support team in accordance with the requirements set by the interim review panel, in addition to the following:\n(1) a copy of the person's current positive support transition plan and copies of each positive support transition plan review containing data on the progress of the plan from the previous year;\n(2) documentation of a good faith effort to eliminate the use of the procedures that had been part of an approved positive support transition plan;\n(3) justification for the continued use of the procedures that identifies the imminent risk of serious injury due to the person's self-injurious behavior if the procedures were eliminated;\n(4) documentation of the clinicians consulted in creating and maintaining the positive support transition plan; and\n(5) documentation of the expanded support team's approval and the recommendation from the interim panel required under paragraph (b).\n(d) A copy of the written request, supporting documentation, and the commissioner's final determination on the request must be maintained in the person's service recipient record.",
	"repealed": false
}