{
	"id": "97A.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.225",
	"title": "97A.225 SEIZURE AND CONFISCATION OF MOTOR VEHICLES AND BOATS.",
	"text": "(a) An enforcement officer must seize all motor vehicles used to:\n(1) shine wild animals in violation of section 97B.081, subdivision 1;\n(2) transport big game animals illegally taken or fur-bearing animals illegally purchased; or\n(3) transport minnows in violation of section 97C.501, 97C.515, or 97C.525.\n(b) An enforcement officer must seize all boats and motors used in netting fish on Lake of the Woods, Rainy Lake, Lake Superior, Namakan Lake, and Sand Point Lake in violation of licensing or operating requirements of section 97A.475, subdivision 30, 97C.825, 97C.831, or 97C.835, or a rule of the commissioner relating to these provisions.\n(c) An enforcement officer may seize all boats and motors with their trailers that are used to take, possess, or transport wild animals when the restitution value of the wild animals exceeds $500.\nThe enforcement officer must hold the seized property, subject to the order of the court having jurisdiction where the offense was committed. The property held is confiscated when:\n(1) the commissioner complies with this section;\n(2) the person from whom it was seized is convicted of the offense; and\n(3) the conviction is not under appeal and the time period for appeal of the conviction has expired.\nThe commissioner shall file with the court a separate complaint against the property held. The complaint must identify the property, describe its use in the violation, and specify the time and place of the violation. A copy of the complaint must be served upon the defendant or the owner of the property.\nAt any time after seizure of the property specified in this section, the property must be returned to the owner or person having the legal right to possession upon execution of a valid bond to the state with a corporate surety. The bond must be approved by a judge of the court of jurisdiction, conditioned to abide by an order and judgment of the court and to pay the full value of the property at the time of seizure. The bond must be for $100 or for a greater amount not more than twice the value of the property seized.\n(a) If the person arrested is acquitted, the court shall dismiss the complaint against the property and:\n(1) order it returned to the person legally entitled to it; and\n(2) order the commissioner to reimburse the person for any seized or confiscated property that is sold, lost, or damaged.\n(b) Upon conviction of the person, the court shall issue an order directed to any person that may have any right, title, or interest in, or lien upon, the seized property. The order must describe the property and state that it was seized and that a complaint against it has been filed. The order shall require a person claiming right, title, or interest in, or lien upon, the property to file with the court administrator an answer to the complaint, stating the claim, within ten days after the service of the order. The order shall contain a notice that if the person fails to file an answer within the time limit, the property may be ordered sold by the commissioner.\n(c) The court order must be served upon any person known or believed to have any right, title, interest, or lien in the same manner as provided for service of a summons in a civil action, and upon unknown persons by publication, in the same manner as provided for publication of a summons in a civil action.\nIf an answer is not filed within the time provided in subdivision 5, the court administrator shall notify the court and the court shall order the commissioner to sell the property. The net proceeds of the sale shall be deposited in the state treasury and credited to the game and fish fund.\nIf an answer is filed within the time provided in subdivision 5, the court shall schedule a hearing within ten to 30 days after the time expired for filing the answer. The court, without a jury, shall determine whether any of the property was used in a violation specified in the complaint and whether the owner had knowledge or reason to believe that the property was being used, or intended to be used, in the violation. The court shall order the commissioner to sell the property that was unlawfully used with knowledge of the owner and to return to the owner property that was not unlawfully used with the knowledge of the owner. If the property is to be sold, the court shall determine the priority of liens against the property and whether the lienholders had knowledge that the property was being used or was intended to be used. Lienholders that had knowledge of the property's use in the violation are not to be paid. The court order must state the priority of the liens to be paid.\nThe proceeds from the sale after payment of the costs of seizing, towing, keeping, and selling the property and satisfying valid liens against the property must be distributed as follows:\n(1) 70 percent of the money or proceeds shall be deposited in the state treasury and credited to the game and fish fund; and\n(2) 30 percent of the money or proceeds is considered a cost of forfeiting the property and must be forwarded to the prosecuting authority that handled the forfeiture for deposit as a supplement to its operating fund or similar fund for prosecutorial purposes.\nA sale under this section cancels all liens on and security interests in the property sold.\nThe appropriate agency and prosecuting authority shall report on forfeitures occurring under this section as described in section 609.5315, subdivision 6.",
	"repealed": false
}