{
	"id": "62A.43",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.43",
	"title": "62A.43 LIMITATIONS ON SALES.",
	"text": "No agent shall sell a Medicare supplement plan, as defined in section 62A.3099, to a person who currently has one plan in effect; however, an agent may sell a replacement plan in accordance with section 62A.40, provided that the second plan is not made effective any sooner than necessary to provide continuous benefits for preexisting conditions. Every application for Medicare supplement insurance shall require a written statement signed by the applicant listing all health and accident insurance maintained by the applicant as of the date the application is taken and stating whether the applicant is entitled to any medical assistance. The written statement must be accompanied by a written acknowledgment, signed by the seller of the policy, of the request for and receipt of the statement.\nNotwithstanding the provisions of section 62A.38, an insurer which issues a Medicare supplement plan to any person who has one plan then in effect, except as permitted in subdivision 1, shall, at the request of the insured, either refund the premiums or pay any claims on the policy, whichever is greater. Any refund of premium pursuant to this section or section 62A.38 shall be sent by the insurer directly to the insured within 15 days of the request by the insured.\nIf the commissioner determines after an investigation that an insurer has issued a Medicare supplement plan to a person who already has one plan, except as permitted in subdivision 1, the commissioner shall notify the insurer in writing of the determination. If the insurer thereafter fails to take reasonable action to prevent overselling, the commissioner may, in the manner prescribed in chapter 14, revoke or suspend the insurer's authority to sell accident and health insurance in this state or impose a civil penalty not to exceed $10,000, or both.\nThe prohibition in this section or the requirements of section 62A.31, subdivision 1, against the sale of duplicate Medicare supplement coverage do not preclude the sale of a health insurance policy or certificate if it will pay benefits without regard to other health coverage and if prospective purchasers are provided, on or together with the application for the policy or certificate, the appropriate disclosure statement for health insurance policies sold to Medicare beneficiaries that duplicate Medicare as prescribed by the National Association of Insurance Commissioners. Notwithstanding this provision, if the commissioner determines that the coverage being sold is in fact Medicare supplement insurance, the commissioner shall notify the insurer in writing of the determination. If the insurer does not thereafter comply with sections 62A.3099 to 62A.44, the commissioner may, pursuant to chapter 14, revoke or suspend the insurer's authority to sell accident and health insurance in this state or impose a civil penalty not to exceed $10,000, or both.",
	"repealed": false
}