{
	"id": "375.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.60",
	"title": "375.60 DUTIES AND POWERS OF DIRECTOR.",
	"text": "The personnel director shall prepare personnel rules, which shall be effective upon approval by the county board, to carry out sections 375.56 to 375.71. The rules shall provide, among other things, for:\n(a) Preparation of a classification plan and classification of positions within the jurisdiction of the department in accordance with the plan.\n(b) Creation and maintenance of lists of eligibles. No name shall remain on an eligible list for more than two years.\n(c) Certification of names to the appointing authority from the eligible list for appointment, promotion, or reemployment.\n(d) Establishment of procedures for the recruitment, selection and advancement of personnel on the basis of relative ability, knowledge and skills.\n(e) Establishment of procedures assuring nondiscriminatory and fair treatment of applicants and employees in all aspects of personnel administration without regard to political affiliation, race, color, national origin, sex, or religious creed.\n(f) Establishment of procedures for suspension or termination or other disciplinary action, including procedures for appeal of actions by appointing authorities with respect to suspension or termination or other disciplinary action.\nThe director shall administer the personnel department. In addition to the duties imposed elsewhere in sections 375.56 to 375.71, the director shall:\n(a) Appoint, supervise and direct the work of the employees of the personnel department.\n(b) Schedule and conduct hearings as required by rules adopted pursuant to sections 375.56 to 375.71 or at the direction of the county board.\n(c) Provide for, formulate and hold competitive examinations as required by rule to determine the qualifications of persons seeking employment in positions within the jurisdiction of the department.\n(d) Make investigations concerning the administration and effect of rules made pursuant to sections 375.56 to 375.71 and report the findings and recommendations to the county board.\n(e) Establish programs for training and continuing education of employees as deemed appropriate by the county board to improve the quality of service of employees holding positions within the jurisdiction of the department.\n(f) Prepare a compensation plan and recommend a schedule of salary or wage rates for positions within the jurisdiction of the personnel department for adoption by the county board.",
	"repealed": false
}