{
	"id": "125A.0941",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.0941",
	"title": "125A.0941 DEFINITIONS.",
	"text": "(a) The following terms have the meanings given them.\n(b) \"Emergency\" means a situation where immediate intervention is needed to protect a child or other individual from physical injury. Emergency does not mean circumstances such as: a child who does not respond to a task or request and instead places his or her head on a desk or hides under a desk or table; a child who does not respond to a staff person's request unless failing to respond would result in physical injury to the child or other individual; or an emergency incident has already occurred and no threat of physical injury currently exists.\n(c) \"Physical holding\" means physical intervention intended to hold a child immobile or limit a child's movement, where body contact is the only source of physical restraint, and where immobilization is used to effectively gain control of a child in order to protect a child or other individual from physical injury. The term physical holding does not mean physical contact that:\n(1) helps a child respond or complete a task;\n(2) assists a child without restricting the child's movement;\n(3) is needed to administer an authorized health-related service or procedure; or\n(4) is needed to physically escort a child when the child does not resist or the child's resistance is minimal.\n(d) \"Positive behavioral interventions and supports\" means interventions and strategies to improve the school environment and teach children the skills to behave appropriately, including the key components under section 122A.627.\n(e) \"Prone restraint\" means placing a child in a face down position.\n(f) \"Restrictive procedures\" means the use of physical holding or seclusion in an emergency. Restrictive procedures must not be used to punish or otherwise discipline a child.\n(g) \"Seclusion\" means confining a child alone in a room from which egress is barred. Egress may be barred by an adult locking or closing the door in the room or preventing the child from leaving the room. Removing a child from an activity to a location where the child cannot participate in or observe the activity is not seclusion.",
	"repealed": false
}