{
	"id": "155A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/155A.23",
	"title": "155A.23 DEFINITIONS.",
	"text": "For purposes of sections 155A.23 to 155A.36, and unless the context clearly requires otherwise, the words defined in this section have the meanings given them.\n\"Board\" means the Board of Cosmetologist Examiners.\n\"Cosmetology\" is the practice of personal services, for compensation, for the cosmetic care of the hair, nails, and skin. These services include cleaning, conditioning, shaping, reinforcing, coloring and enhancing the body surface in the areas of the head, scalp, face, arms, hands, legs, feet, and trunk of the body, except where these services are performed by a barber under sections 154.001, 154.002, 154.003, 154.01 to 154.161, 154.19 to 154.21, and 154.24 to 154.26.\nA \"cosmetologist\" is any person who, for compensation, performs the personal services, as defined in subdivision 3.\n\"Eyelash extensions\" means the application, removal, and trimming of threadlike natural or synthetic fibers to an eyelash, and includes the cleansing of the eye area and lashes. Eyelash extensions do not include color agents, straightening agents, permanent wave solutions, bleaching agents, applications to the eyebrow, or any other cosmetology service.\nAn \"eyelash technician\" is any person who is not a cosmetologist, esthetician, or advanced practice esthetician who, for compensation, performs the personal services limited to eyelash extensions as defined in subdivision 4a only.\nAn \"esthetician\" is any person who, for compensation, performs personal services for the cosmetic care of the skin only.\n\"Individual license\" means a license described in section 155A.25, subdivision 1a, paragraph (b), clause (1).\n[Repealed, 2015 c 77 art 2 s 88]\nA \"nail technician\" is any person who, for compensation, performs personal services for the cosmetic care of the hands, feet, and nails only.\nA \"manager\" is any person who is a cosmetologist, esthetician, advanced practice esthetician, hair technician, nail technician practitioner, or eyelash technician, and who has a manager license and provides any services under that license, as defined in subdivision 3.\nA \"mobile salon\" is a salon that is operated in a mobile vehicle or mobile structure for exclusive use to offer personal services, as defined in subdivision 3.\nA \"salon\" is an area, room, or rooms employed to offer personal services, as defined in subdivision 3. \"Salon\" does not include the home of a customer but the board may adopt health and infection control rules governing practice in the homes of customers.\nA \"school\" is a place where any person operates and maintains a class to teach cosmetology to the public for compensation. \"School\" does not include a place where the only teaching of cosmetology is done by a licensed cosmetologist as part of a community education program of less than ten hours duration, provided that the program does not permit practice on persons other than students in the program, and provided that the program is intended solely for the self-improvement of the students and not as preparation for professional practice.\nAn \"instructor\" is any person employed by a school to prepare and present the theoretical and practical education of cosmetology to persons who seek to practice cosmetology. An instructor must maintain an active operator or manager's license in the area in which the instructor holds an instructor's license.\nThe term \"person\" may extend and be applied to bodies politic and corporate, and to partnership and other unincorporated associations.\n\"Threading\" is a method of removing hair from the eyebrows, upper lip, or other body parts by using cotton thread to pull hair from follicles. Threading does not include the use of chemicals or any type of wax. Threading may include the use of (1) over-the-counter astringents, gels, and powders; and (2) tweezers and scissors incidental to threading.\nAn \"advanced practice esthetician\" is a person who for compensation performs personal services for the cosmetic care of the skin, including the use of mechanical or electrical skin care apparatuses or appliances that are used on the epidermal layer of the skin.\nA \"designated licensed salon manager\" is a manager designated by a salon owner and registered with the board, who is responsible with the salon owner for salon and practitioner compliance.\nA \"school manager\" is a salon manager who has a school manager license. A school manager must maintain an active salon manager's license.\nA \"designated school manager\" is a school manager who is designated by the school owner and registered with the board, who is responsible with the school owner for school and instructor compliance.\nA \"practitioner\" is any person licensed as an operator or manager in the practice of cosmetology, esthiology, hair technology services, nail technology services, or eyelash technology services.\n\"Hairstyling\" is the practice of cleaning, drying, arranging, or styling hair. It includes the use of hair sprays and topical agents, such as shampoos and conditioners. It also includes the use and styling of hair extensions and wigs. It does not include cutting or the application of dyes, bleach, reactive chemicals, keratin, or other preparations to color or alter the structure of hair.\n\"Makeup services\" is the application of a cosmetic to enhance the face or skin, including powder, foundation, rouge, eyeshadow, eyeliner, mascara, and lipstick. Makeup services includes the application of makeup applied using an airbrush. Makeup services does not include the application of permanent makeup, tattooing, or facial services.\nA \"hair technician\" is any person who, for compensation, performs personal services for the cosmetic care of the hair on the scalp. Hair technician services include cutting the hair and the application of dyes, bleach, reactive chemicals, keratin, or other preparations to color or alter the structure of the hair. A person who only performs hairstyling as defined by subdivision 19, is not a hair technician.",
	"repealed": false
}