{
	"id": "518.619",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.619",
	"title": "518.619 CUSTODY OR VISITATION; MEDIATION SERVICES.",
	"text": "Except as provided in subdivision 2, if it appears on the face of the petition or other application for an order or modification of an order for the custody of a child that custody or parenting time is contested, or that any issue pertinent to a custody or parenting time determination, including parenting time rights, is unresolved, the matter may be set for mediation of the contested issue prior to, concurrent with, or subsequent to the setting of the matter for hearing. The purpose of the mediation proceeding is to reduce acrimony which may exist between the parties and to develop an agreement that is supportive of the child's best interests. The mediator shall use best efforts to effect a settlement of the custody or parenting time dispute, but shall have no coercive authority.\nIf the court determines that there is probable cause that one of the parties, or a child of a party, has been physically or sexually abused by the other party, the court shall not require or refer the parties to mediation or any other process that requires parties to meet and confer without counsel, if any, present.\nIn order to participate in a custody mediation, a mediator must be appointed by the family court. A mediator must be a member of the professional staff of a family court, probation department, mental health services agency, or a private mediation service. The mediator must be on a list of mediators approved by the court having jurisdiction of the matter, unless the parties stipulate to a mediator not on the list.\nA mediator who performs mediation in contested child custody matters shall meet the following minimum qualifications:\n(a) knowledge of the court system and the procedures used in contested child custody matters;\n(b) knowledge of other resources in the community to which the parties to contested child custody matters can be referred for assistance;\n(c) knowledge of child development, clinical issues relating to children, the effects of marriage dissolution on children, and child custody research; and\n(d) a minimum of 40 hours of certified mediation training.\nMediation proceedings shall be conducted in private. All records of a mediation proceeding shall be private and not available as evidence in an action for marriage dissolution and related proceedings on any issue in controversy in the dissolution.\nWhen the parties have not reached agreement as a result of the mediation proceeding, the mediator may recommend to the court that an investigation be conducted under section 518.167, or that other action be taken to assist the parties to resolve the controversy before hearing on the issues. The mediator may not conduct the investigation or evaluation unless: (1) the parties agree in writing, executed after the termination of mediation, that the mediator may conduct the investigation or evaluation, or (2) there is no other person reasonably available to conduct the investigation or evaluation. The mediator may recommend that mutual restraining orders be issued in appropriate cases, pending determination of the controversy, to protect the well-being of the children involved in the controversy.\nAn agreement reached by the parties as a result of mediation shall be discussed by the parties with their attorneys, if any, and the approved agreement may then be included in the marital dissolution decree or other stipulation submitted to the court. An agreement reached by the parties as a result of mediation may not be presented to the court nor made enforceable unless the parties and their counsel, if any, consent to its presentation to the court, and the court adopts the agreement.\nEach court shall adopt rules to implement this section, and shall compile and maintain a list of mediators.",
	"repealed": false
}