{
	"id": "123A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.06",
	"title": "123A.06 STATE-APPROVED ALTERNATIVE PROGRAMS AND SERVICES.",
	"text": "(a) The programs and services of a state-approved alternative program must focus on academic and learning skills, applied learning opportunities, trade and vocational skills, work-based learning opportunities, work experience, youth service to the community, transition services, and English language and literacy programs for children whose primary language is a language other than English. Applied learning, work-based learning, and service learning may best be developed in collaboration with a local education and transitions partnership, culturally based organizations, mutual assistance associations, or other community resources. In addition to offering programs, the state-approved alternative program shall coordinate the use of other available educational services, special education services, social services, health services, and postsecondary institutions in the community and services area.\n(b) Consistent with the requirements of sections 121A.40 to 121A.56, a school district may provide an alternative education program for a student who is within the compulsory attendance age under section 120A.20, and who is involved in severe or repeated disciplinary action.\nA state-approved alternative program shall provide programs for secondary pupils. A center may also provide programs and services for elementary and secondary pupils who are not attending the state-approved alternative program to assist them in being successful in school. A center shall use research-based best practices for serving English learners and their parents, taking into account the variations in students' backgrounds and needs and the amount of time and the staff resources necessary for students to overcome gaps in their education and to develop English proficiency and work-related skills. An individualized education program team may identify a state-approved alternative program as an appropriate placement to the extent a state-approved alternative program can provide the student with the appropriate special education services described in the student's plan. Pupils eligible to be served are those who qualify under the graduation incentives program in section 124D.68, subdivision 2, those enrolled under section 124D.02, subdivision 2, or those pupils who are eligible to receive special education services under sections 125A.03 to 125A.24, and 125A.65.\nNotwithstanding any law to the contrary, the area learning center programs must be available throughout the entire year.\nUpon successful completion of the area learning center program, a pupil is entitled to receive a high school diploma. The pupil may elect to receive a diploma from either the district of residence or the district in which the area learning center is located or the intermediate district or educational cooperative responsible for the area learning center program.",
	"repealed": false
}