{
	"id": "231.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/231.18",
	"title": "231.18 CLAIMS AGAINST A BOND.",
	"text": "A depositor claiming to be damaged by the breach of an agreement to store household goods must file a claim with the department within 180 days of the date of breach.\nAll claims must be in writing, must state the facts upon which the claim is based, must include any supporting evidence, and must be signed by the claimant. The supporting evidence may consist of, but is not limited to, a bill of lading, a warehouse receipt, a contract form, correspondence, or photographs.\nAll claims must be filed with the Minnesota Department of Agriculture, Grain Licensing and Auditing Section.\nThe bonds are not cumulative from one year to the next. A claim against the bond may only be made against the bond in effect at the time the agreement is breached. A bond is not liable for claims filed after 180 days from the date of the breach of the bond.\nUpon determining that a depositor has filed a valid claim, the department shall publish notice of the claim in the official county newspaper of the county in which the licensee's primary place of business is located.\nThe notice must state that a claim against the bond of a licensee has been filed with the department, the name and address of the licensee, that any additional claims should be filed with the department, the date by which claims must be filed, and where the claims should be filed.\nThe public notice of the claim must appear for three consecutive days in newspapers with a daily circulation and for two consecutive publications in newspapers published less than daily.\n(a) Upon expiration of the claim filing period, the department shall promptly determine the validity of all claims filed and notify the claimants of the determination. An aggrieved party may appeal the department's determination by requesting, within 15 days, that the department initiate a contested case proceeding. In the absence of such a request, or following the issuance of a final order in a contested case, the surety company shall issue payment promptly to those claimants entitled to payment.\n(b) If a household goods warehouse operator has become liable to more than one depositor by reason of breaches of the conditions of the bond and the amount of the bond is insufficient to pay the entire liability to all depositors entitled to the protection of the bond, the proceeds of the bond shall be apportioned among the bona fide claimants.",
	"repealed": false
}