{
	"id": "60B.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.191",
	"title": "60B.191 CLAIMS REGARDING REHABILITATION AND LIQUIDATION OF HEALTH MAINTENANCE ORGANIZATIONS.",
	"text": "The rehabilitator or liquidator of a health maintenance organization shall, in lieu of the classification otherwise provided in this chapter, classify all approved claims into the following classes:\n(1) claims for ordinary and necessary expenses of operating and administering the health maintenance organization during rehabilitation or liquidation proceeding. Administrative expenses of a rehabilitation proceeding shall constitute administrative expenses of the liquidation proceeding;\n(2) claims of the United States government for unpaid taxes;\n(3) claims by persons employed by the health maintenance organization for services rendered within the four months before the initiation of any insolvency proceeding, up to $1,000. Employee claimants shall not be entitled to any lien claim or other claim under chapter 514;\n(4) claims by all providers for health care goods and services to the extent covered under a health maintenance contract between enrollees and the health maintenance organization, and claims by enrollees for coverage under a health maintenance contract with the health maintenance organization;\n(5) claims which are not secured by any perfected lien or security interest in assets of the health maintenance organization and which are not otherwise classified; or\n(6) claims subordinated under this chapter, chapter 62D, or by agreement with the health maintenance organization or the commissioner of health.\nAs to a health maintenance organization, a claim shall be classified as an unsecured claim if it is made by an enrollee, a parent or guardian of an enrollee, or a person seeking contribution based on injuries to an enrollee, for damages of any type related to death or bodily illness or injury based on improper provisions or failure to provide health care goods or services by a health maintenance organization and its employees, or a provider and its employees to an enrollee of the health maintenance organization. However, a claimant who has secured a judgment or settlement shall receive any insurance proceeds received by the health maintenance organization based on the claims or the medical care provided to the enrollee, other than reinsurance payable because the aggregate value of services to an enrollee exceeds a certain amount, less any expenses, including reasonable attorneys' fees the health maintenance organization incurred in defending the claim or prosecuting its claim against the insurer. This section does not expand the liability of health maintenance organizations on bodily injury to enrollees.",
	"repealed": false
}