{
	"id": "469.310",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.310",
	"title": "469.310 DEFINITIONS.",
	"text": "For purposes of sections 469.310 to 469.320, the following terms have the meanings given.\n\"Agricultural processing facility\" means one or more facilities or operations that transform, package, sort, or grade livestock or livestock products, agricultural commodities, or plants or plant products into goods that are used for intermediate or final consumption including goods for nonfood use, and surrounding property.\n\"Applicant\" means a local government unit or units applying for designation of an area as a job opportunity building zone or a joint powers board, established under section 471.59, acting on behalf of two or more local government units.\n\"Commissioner\" means the commissioner of employment and economic development.\n\"Create automotive recovery zone\" means a zone designated by the commissioner under section 469.314 that contains a motor vehicle assembly facility.\n\"Development plan\" means a plan meeting the requirements of section 469.311.\n\"Job opportunity building zone\" or \"zone\" means a zone designated by the commissioner under section 469.314, and includes an agricultural processing facility zone and a create automotive recovery zone.\n\"Job opportunity building zone percentage\" or \"zone percentage\" means the following fraction reduced to a percentage:\n(1) the numerator of the fraction is:\n(i) the ratio of the taxpayer's property factor under section 290.191 located in the zone for the taxable year over the property factor numerator determined under section 290.191, plus\n(ii) the ratio of the taxpayer's job opportunity building zone payroll factor under subdivision 8 over the payroll factor numerator determined under section 290.191; and\n(2) the denominator of the fraction is two.\nWhen calculating the zone percentage for a business that is part of a unitary business as defined under section 290.17, subdivision 4, the denominator of the payroll and property factors is the Minnesota payroll and property of the unitary business as reported on the combined report under section 290.17, subdivision 4, paragraph (h).\n\"Job opportunity building zone payroll factor\" or \"job opportunity building zone payroll\" is that portion of the payroll factor under section 290.191 that represents:\n(1) wages or salaries paid to an individual for services performed in a job opportunity building zone; or\n(2) wages or salaries paid to individuals working from offices within a job opportunity building zone if their employment requires them to work outside the zone and the work is incidental to the work performed by the individual within the zone.\n\"Local government unit\" means a statutory or home rule charter city, county, town, the Department of Iron Range Resources and Rehabilitation, regional development commission, or a federally designated economic development district.\n\"Person\" includes an individual, corporation, partnership, limited liability company, association, or any other entity.\n(a) A person carrying on a trade or business at a place of business located within a job opportunity building zone is a qualified business for the purposes of sections 469.310 to 469.320 according to the criteria in paragraphs (b) to (f).\n(b) A person is a qualified business only on those parcels of land for which the person has entered into a business subsidy agreement, as required under section 469.313, with the appropriate local government unit in which the parcels are located.\n(c) Prior to execution of the business subsidy agreement, the local government unit must consider the following factors:\n(1) how wages compare to the regional industry average;\n(2) the number of jobs that will be provided relative to overall employment in the community;\n(3) the economic outlook for the industry the business will engage in;\n(4) sales that will be generated from outside the state of Minnesota;\n(5) how the business will build on existing regional strengths or diversify the regional economy;\n(6) how the business will increase capital investment in the zone; and\n(7) any other criteria the commissioner deems necessary.\n(d) A person that relocates a trade or business from outside a job opportunity building zone into a zone is not a qualified business unless the business meets all of the requirements of paragraphs (b) and (c) and:\n(1) increases full-time employment in the first full year of operation within the job opportunity building zone by a minimum of five jobs or 20 percent, whichever is greater, measured relative to the operations that were relocated and maintains the required level of employment for each year the zone designation applies; and\n(2) enters a binding written agreement with the commissioner that:\n(i) pledges the business will meet the requirements of clause (1);\n(ii) provides for repayment of all tax benefits enumerated under section 469.315 to the business under the procedures in section 469.319, if the requirements of clause (1) are not met for the taxable year or for taxes payable during the year in which the requirements were not met; and\n(iii) contains any other terms the commissioner determines appropriate.\n(e) The commissioner may waive the requirements under paragraph (d), clause (1), if the commissioner determines that the qualified business will substantially achieve the factors under this subdivision.\n(f) A business is not a qualified business if, at its location or locations in the zone, the business is primarily engaged in making retail sales to purchasers who are physically present at the business's zone location.\n(g) A qualifying business must pay each employee compensation, including benefits not mandated by law, that on an annualized basis is equal to at least 110 percent of the federal poverty level for a family of four.\n(h) A public utility, as defined in section 336B.01, is not a qualified business.\n(i) A business operating in a create automotive recovery zone is a qualified business only if it engages in the assembly of motor vehicles at the zone location.\n(a) \"Relocates\" means that the trade or business:\n(1) ceases one or more operations or functions at another location in Minnesota and begins performing substantially the same operations or functions at a location in a job opportunity building zone; or\n(2) reduces employment at another location in Minnesota during a period starting one year before and ending one year after it begins operations in a job opportunity building zone and its employees in the job opportunity building zone are engaged in the same line of business as the employees at the location where it reduced employment.\n(b) \"Relocate\" does not include an expansion by a business that establishes a new facility that does not replace or supplant an existing operation or employment, in whole or in part.\n(c) \"Trade or business\" includes any business entity that is substantially similar in operation or ownership to the business entity seeking to be a qualified business under this section.\n\"Relocation payroll percentage\" is a fraction, the numerator of which is the zone payroll of the business for the tax year minus the payroll from the relocated operations in the last full year of operations prior to the relocation, and the denominator of which is the zone payroll of the business for the tax year. The relocation payroll percentage of a business that is not a relocating business is 100 percent.\n\"Motor vehicle assembly facility\" means a manufacturing facility with at least 500 employees that is used to assemble motor vehicles and is located in a city of the first class.",
	"repealed": false
}