{
	"id": "115A.1443",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.1443",
	"title": "115A.1443 REGISTRATION OF PRODUCER RESPONSIBILITY ORGANIZATIONS AND SERVICE PROVIDERS.",
	"text": "(a) By January 1, 2025, producers must appoint a producer responsibility organization. The producer responsibility organization must register with the commissioner by July 1, 2026, and each January 1 thereafter by submitting the following:\n(1) contact information for a person responsible for implementing an approved stewardship plan;\n(2) a list of all member producers that have entered into written agreements to operate under an approved stewardship plan administered by the producer responsibility organization and, for each producer, a list of all brands of the producer's covered materials introduced;\n(3) copies of written agreements with each producer stating that the producer agrees to operate under an approved stewardship plan administered by the producer responsibility organization;\n(4) a list of current board members and the executive director if different from the person responsible for implementing an approved stewardship plan; and\n(5) documentation demonstrating adequate financial responsibility and financial controls to ensure proper management of funds and payment of the registration fee required under subdivision 2.\n(b) Following the approval of the initial producer responsibility organization and the initial stewardship plan, if more than a single producer responsibility organization is established, the producers and producer responsibility organizations must establish a coordinating body and process to prevent redundancy. The coordinating body must integrate:\n(1) stewardship plans of all producer responsibility organizations into a single stewardship plan that implements all requirements of sections 115A.144 to 115A.1463 and encompasses all producers when submitted to the commissioner for approval; and\n(2) annual reports of all producer responsibility organizations into a single annual report that covers all requirements of sections 115A.144 to 115A.1463 and encompasses all producers when submitted to the commissioner.\n(a) Beginning January 1, 2029, as part of its annual registration with the commissioner, a producer responsibility organization must submit to the commissioner a registration fee, as determined by the commissioner. By October 1, 2028, and annually thereafter, the commissioner must provide written notice to registered producer responsibility organizations in writing of the amount of the registration fee. If there is more than one registered producer responsibility organization, the coordinating body described in subdivision 1, paragraph (b), must equitably apportion payment of the registration fee between all registered producer responsibility organizations. The registration fee must be set at an amount anticipated to in the aggregate meet but not exceed the commissioner's estimate of the costs required to perform the commissioner's duties as described in section 115A.1445 and to otherwise administer, implement, and enforce sections 115A.144 to 115A.1463.\n(b) The commissioner must annually reconcile the fees paid by a producer responsibility organization under this subdivision with the actual costs incurred by the agency by means of credits or refunds to or additional payments required of a producer responsibility organization, as applicable.\n(a) By January 1, 2025, producers must appoint a producer responsibility organization. The producer responsibility organization must register by January 1, 2025, with the commissioner by submitting the following:\n(1) contact information for a person responsible for implementing an approved stewardship plan;\n(2) a list of current member producers that have entered into written agreements to operate under an approved stewardship plan administered by the producer responsibility organization;\n(3) a plan for recruiting additional member producers and executing written agreements confirming producers will operate under an approved stewardship plan administered by the producer responsibility organization;\n(4) a list of current board members and the executive director if different than the person responsible for implementing approved stewardship plans; and\n(5) documentation demonstrating adequate financial responsibility and financial controls to ensure proper management of funds and payment of the implementation fee required under paragraph (c).\n(b) Notwithstanding the other provisions of this section, the commissioner may not allow registration of more than one producer responsibility organization under this section before the first stewardship plan approved by the commissioner expires. If more than one producer responsibility organization applies to register under this section before the first stewardship plan is approved by the commissioner, the commissioner must select the producer responsibility organization that will represent producers until the first stewardship plan expires and, if applicable, must return the fee paid by applicants who are not selected. When selecting a producer responsibility organization, the commissioner must consider whether the producer responsibility organization:\n(1) has a governing board consisting of producers that represent a diversity of covered materials introduced; and\n(2) demonstrates adequate financial responsibility and financial controls to ensure proper management of funds.\n(c) By February 15, 2025, and annually until February 15, 2028, the commissioner must provide written notice to the producer responsibility organization of the commissioner's estimates of the cost required to perform the commissioner's duties as described in section 115A.1445. The producer responsibility organization must remit payment in full for these costs to the commissioner within 45 days of receipt of this notice. The producer responsibility organization may charge each member producer a fee according to each producer's unit-, weight-, volume-, or sales-based market share or by another method it determines to be an equitable determination of each producer's payment obligation, so that the aggregate fees charged to member producers is sufficient to pay the commissioner's estimated costs in full.\nAfter the first stewardship plan approved by the commissioner expires, the commissioner may allow registration of more than one producer responsibility organization if:\n(1) producers of a covered materials type or a specific covered material appoint a producer responsibility organization; or\n(2) producers organize under additional producer responsibility organizations.\nBy January 1, 2025, and annually thereafter, a service provider seeking reimbursement for services provided under an approved stewardship plan according to section 115A.1451 must register with the commissioner by submitting the following information:\n(1) the contact information for a person representing the service provider;\n(2) the address of the service provider; and\n(3) if applicable to services provided, a report of the total amount billed for collection for covered entities, processing services, and transfer station operations provided during the preceding calendar year and, when possible, values must be separated for collection, transfer, and processing.\nAll fees received under this section must be deposited in the state treasury and credited to the product stewardship account under section 115A.1463.",
	"repealed": false
}