{
	"id": "47.603",
	"url": "https://www.revisor.mn.gov/statutes/cite/47.603",
	"title": "47.603 ABILITY TO REPAY ANALYSIS.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Annual percentage rate\" has the meaning given in section 47.60, subdivision 1.\n(c) \"Basic living expenses\" means expenditures, other than payments for major financial obligations, that a borrower makes for goods and services that are necessary to maintain: (1) the borrower's health, welfare, and ability to produce income; and (2) the health and welfare of the members of the borrower's household who are financially dependent on the borrower.\n(d) \"Borrower\" means an individual who seeks to obtain a payday loan or a payday advance.\n(e) \"Consumer credit report\" means a consumer report, as defined in section 603(d) of the Fair Credit Reporting Act, United States Code, title 15, section 1681a(d), obtained from a consumer reporting agency that compiles and maintains files on consumers on a nationwide basis, as defined in section 603(p) of the Fair Credit Reporting Act, United States Code, title 15, section 1681a(p).\n(f) \"Debt-to-income ratio\" means the ratio, expressed as a percentage, comparing (1) the sum of the debt amounts that the lender projects will be payable by the borrower, including major financial obligations, outstanding loans other than the payday loan, the payday loan payment, all other debt obligations, and basic living expenses, to (2) the net income that the lender projects the borrower will receive during the loan period.\n(g) \"Major financial obligations\" means the sum of:\n(1) a borrower's housing expense;\n(2) outstanding loans, including any other payday loans or payday advances; and\n(3) all other debt obligations, including without limitation child support and alimony obligations.\n(h) \"Net income\" means the total amount of income received by the borrower during the loan period, as demonstrated by documentation evidencing proof of income.\n(i) \"Payday lender\" means a consumer small lender under section 47.60 or consumer short-term lender under section 47.601.\n(j) \"Payday loan\" means a consumer small loan under section 47.60 or a consumer short-term loan under section 47.601.\n(k) \"Payday advance\" means a consumer small loan under section 47.60 or a consumer short-term loan under section 47.601 that is offered under a line of credit.\n(l) \"Payday loan payment\" means the total payment due for the payday loan at the end of the payday loan period. Payday loan payment includes all principal, interest, charges, and fees.\nThis section applies to all payday loans with an annual percentage rate that exceeds 36 percent.\nA payday lender must not make a payday loan or permit a borrower to obtain a payday advance unless the lender first determines, based on an analysis that complies with subdivision 5, that the borrower has the ability to make the payday loan payment when the payday loan payment comes due at the end of the loan period. For purposes of this subdivision, each payday advance constitutes a new loan and requires a new ability to repay determination.\n(a) To conduct an ability to repay analysis, a payday lender must first obtain commercially reasonable documented evidence of the borrower's net income, major financial obligations, and basic living expenses. To the extent documentation is not available for any of the borrower's basic living expenses, the lender may reasonably rely on a written, signed statement by the borrower indicating the specific basic living expenses.\n(b) If the payday lender obtains a borrower's consumer credit report, there is a presumption that a payday lender has obtained commercially reasonable documented evidence of:\n(1) outstanding loans other than the payday loan or payday advance; and\n(2) all other debt obligations, without limitation, except for child support and alimony obligations.\n(c) For a borrower's required payments under child support or alimony obligations, the lender must obtain a consumer credit report. If the report does not include a child support or spousal maintenance obligation, as applicable, the lender may reasonably rely on a written, signed statement by the borrower indicating the child support payment or spousal maintenance payments, as applicable.\n(a) A payday lender's determination of a borrower's ability to repay a payday loan or payday advance must be based on the calculation of the borrower's debt-to-income ratio for the loan period.\n(b) A payday lender's ability to repay determination is reasonable if, based on the calculated debt-to-income ratio for the loan period, the borrower can make payments for all major financial obligations, make all payments under the loan, and meet basic living expenses during the period ending 30 days after repayment of the loan.\nA payday lender that fails to comply with this section is subject to: (1) the penalties and enforcement under section 47.601, subdivisions 6 and 7; and (2) revocation of a filing or license, as provided under section 47.60, subdivision 3, or section 45.027, subdivision 7.",
	"repealed": false
}