{
	"id": "43A.231",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.231",
	"title": "43A.231 PROCUREMENT OF A PHARMACY BENEFIT MANAGER AND A PLATFORM TECHNOLOGY VENDOR.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Market check\" means a technology-driven evaluation of prescription drug pricing based on benchmarks derived from reverse auction processes conducted in the United States over the immediately preceding 12 months.\n(c) \"Pharmacy benefit management services\" means:\n(1) the procurement of prescription drugs at a negotiated rate for dispensation within the State Employees Group Insurance Program (SEGIP) to enrollees;\n(2) the administration and management of the prescription drug benefit under SEGIP; and\n(3) any services defined in section 62W.02, subdivisions 8, 12, and 15, paragraph (a).\n(d) \"Pharmacy benefit manager\" has the meaning given in section 62W.02, subdivision 15, paragraph (a).\n(e) \"Price\" means the projected cost of a bid for providing pharmacy benefit management services over the duration of the contract.\n(f) \"Reverse auction\" means an automated bidding process conducted online that starts with an opening price and allows qualified bidders to counteroffer a lower price for multiple rounds of bidding.\n(g) \"SEGIP\" means the State Employees Group Insurance Program under sections 43A.22 to 43A.31.\nThe purpose of this section is to optimize prescription drug savings in SEGIP through:\n(1) contracting with a pharmacy benefit manager to manage and administer the prescription drug benefit for SEGIP;\n(2) the adoption of a reverse auction process for the selection of a pharmacy benefit manager;\n(3) providing a process for the electronic review and validation of pharmacy benefit manager claims invoices for the purpose of reconciling pharmacy bills;\n(4) market checks of the pharmacy benefit manager's prescription drug pricing; and\n(5) limiting independent pharmacies from unsustainable reimbursement practices.\n(a) Notwithstanding any law to the contrary, the commissioner of management and budget shall procure a contract for the services of a pharmacy benefit manager to administer the prescription drug benefit and pharmacy benefit management services, effective January 1, 2023.\n(b) For the contract effective January 1, 2023, the commissioner shall conduct a reverse auction as described in this section to select the pharmacy benefit manager and use a reverse auction for procurement of subsequent pharmacy benefit manager contracts as provided in subdivision 5, paragraph (b).\n(c) In consultation with the technology platform vendor selected under subdivision 4, the commissioner shall specify the terms of a participant bidding agreement that all bidders must accept as a prerequisite for participation in the reverse auction process, including:\n(1) common definitions;\n(2) prescription drug classifications;\n(3) retail pricing rules, including maximum allowable cost price lists and dispensing fees; and\n(4) any other contract terms the commissioner deems necessary to further the purpose of this section as specified under subdivision 2.\n(d) A pharmacy benefit manager who submits a bid under this subdivision must provide the commissioner access to complete pharmacy claims data necessary for the commissioner to conduct the reverse auction and to carry out administrative and management duties.\n(e) The terms of a contract entered into under this subdivision shall not be modified by the pharmacy benefit manager except with the approval of the commissioner.\n(f) The commissioner may structure the contract awarded under this subdivision to pay the cost of the technology platform and the associated professional services contracted for under this subdivision by assessing a fee per prescription to be paid directly by the pharmacy benefit manager to the technology platform vendor.\n(g) The commissioner must perform annual market checks on pharmacy benefit manager services performed by the pharmacy benefit manager during the term of the contract. A market check performed under this paragraph may include an evaluation of the effect of alternative drug pricing metrics, such as the national average drug acquisition cost and average wholesale price, on the cost of prescription drugs and savings to the state.\n(h) The commissioner shall make regular, periodic payment of invoices within the time periods specified in the contract based on the automated adjudication of invoiced claims using the technology platform to validate that claims payments comply with the terms of the contract.\n(i) The joint labor-management committee on health plans shall assist in the process through which the commissioner conducts the reverse auction, evaluation, and comparison of the competing pharmacy benefit manager bids for award of the contract.\n(a) At least three months before the reverse auction process is scheduled to be completed, the commissioner shall procure through a competitive bidding process a contract with a professional services vendor for a technology platform and any associated professional services necessary to operate the platform to:\n(1) evaluate the qualifications of prospective pharmacy benefit manager bidders for the pharmacy benefit manager procurement;\n(2) automatically adjudicate prescription drug claims; and\n(3) collect data on pharmacy reimbursement.\n(b) The platform procured under paragraph (a) must have the following capabilities to ensure optimal performance of the reverse auction and security of data:\n(1) host and conduct an online automated reverse auction:\n(i) using a software application and high-performance data infrastructure to intake, cleanse, and normalize pharmacy benefit manager data; and\n(ii) with development methods and information security standards that have been validated by receiving Service Organization Control 2 (SOC 2) and National Institute of Standards and Technology certification;\n(2) automate repricing of diverse and complex pharmacy benefit manager prescription drug pricing proposals to enable direct comparisons of the price of bids using all annual claims data available for the program using code-based classification or prescription drugs from nationally accepted drug sources;\n(3) simultaneously evaluate, within six hours, diverse and complex multiple proposals from full-service pharmacy benefit managers that shall include at least guaranteed net cost, Average Wholesale Price and National Average Drug Acquisition Cost (NADAC) pricing models, as well as proposals from pharmacy benefit administrators and specialty drug and rebate carve-out services providers;\n(4) produce an automated report and analysis of bids, including ranking of bids on the comparative costs and qualitative aspects of the costs within six hours after the close of each round of reverse auction bidding; and\n(5) after the close of the reverse auction process, perform an electronic, line-by-line, claim-by-claim review of all invoiced pharmacy benefit manager claims within six hours of receipt that allows for an online comparison of pharmacy benefit manager invoices and identifies all deviations from the specific terms of the services contract resulting from the reverse auction.\n(c) The commissioner may require additional capabilities or more rigorous standards than those specified in paragraph (b).\n(d) The commissioner shall not award the platform technology vendor contract under this subdivision to:\n(1) a pharmacy benefit manager;\n(2) a subsidiary or affiliate of a pharmacy benefit manager; or\n(3) a vendor who is managed by a pharmacy benefit manager or who receives, directly or indirectly, remuneration from a pharmacy benefit manager for aggregating clients into a contractual relationship with a pharmacy benefit manager.\n(e) The vendor who is awarded the contract under this subdivision must not subcontract any part of the reverse auction process or the review described under paragraph (b), clause (5).\n(a) The commissioner of management and budget, with the assistance of an actuarial consultant, shall compare the following: (1) actual, electronically adjudicated prescription drug costs under the first two years of the contract that begins on January 1, 2023, with a pharmacy benefit manager that was selected by the reverse auction; and (2) a projection of what prescription drug costs would have been for those same two years under the pharmacy benefit manager contract in effect from 2018 to 2022, with appropriate adjustment for any adopted formulary or beneficiary utilization changes. The projection must use industry-recognized data sources. The commissioner of management and budget shall report the results of the comparison to the legislative auditor and to the chairs and ranking minority members of the committees in the senate and house of representatives with jurisdiction over state government finance and policy by March 1, 2025.\n(b) The commissioner of management and budget must require the actuarial consultant to take appropriate measures to ensure that the consultant's work is not compromised by a conflict of interest.\n(c) By April 1, 2025, the legislative auditor shall provide a report to the commissioner of management and budget and to the chairs and ranking minority members of the committees in the senate and house of representatives with jurisdiction over state government finance and policy. The legislative auditor's report must make a determination as to whether the commissioner's report accurately performs the comparison required under paragraph (a).\n(d) The technology platform vendor shall provide to the commissioner of management and budget and to the legislative auditor the electronically adjudicated prescription drug data and any other support or assistance required by the commissioner of management and budget to prepare a report and for the legislative auditor to validate the accuracy of the commissioner's results of the comparison, by deadlines established by the commissioner of management and budget and the legislative auditor. Individual-identifying data received from the technology platform vendor is private data on individuals, as defined by section 13.02, subdivision 12.\n(e) If the commissioner of management and budget determines that savings on prescription drug costs were not achieved, based on the comparison required under paragraph (a), with appropriate adjustment for any adopted formulary or beneficiary utilization changes, the commissioner may forego the use of a reverse auction for procurement of a successor pharmacy benefit manager contract. If the commissioner of management and budget determines that savings have been achieved, the commissioner must select the successor pharmacy benefit manager contract using the reverse auction process described in this section. If the commissioner's comparison in paragraph (a) finds that savings are not achieved, the commissioner's report under paragraph (a) must include the commissioner's findings that support a determination that savings were not achieved, analysis of the factors that caused a failure to achieve savings, and recommendations for how savings could be achieved in the next contract with a pharmacy benefit manager.\nThe commissioner of management and budget may only enter into an agreement with a technology platform vendor if the agreement provides privacy protections for data collected and maintained by the technology platform vendor, including:\n(1) procedures for the prevention of unauthorized access or use;\n(2) a prohibition on the sale of data collected and maintained as provided in the agreement; and\n(3) a prohibition on dissemination of data unless authorized by state or federal law or the agreement.",
	"repealed": false
}