{
	"id": "317A.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.501",
	"title": "317A.501 LOANS; GUARANTEES; SURETYSHIP.",
	"text": "A corporation may lend money to, guarantee or pledge its assets as security for an obligation of, become a surety for, or otherwise financially assist a person, if the transaction, or a class of transactions to which the transaction belongs, is approved by the board and:\n(1) is in the usual and regular course of activities of the corporation;\n(2) is with, or for the benefit of, a related organization, an organization in which the corporation has a financial interest, a person with whom the corporation has a relationship in the course of its activities, or an organization to which the corporation has the power to make donations;\n(3) is with, or for the benefit of, an officer, director, or employee of the corporation or a related organization, and is authorized under subdivision 2; or\n(4) subject to subdivision 2, has been approved by two-thirds of the members with voting rights or, if there are no members with voting rights, by two-thirds of the board.\nA corporation may not lend money to or guarantee the obligation of a director, officer, or employee of the corporation or a related organization, or of the spouse, parents, children and spouses of children, brothers and sisters or spouses of brothers and sisters of the director, officer, or employee, unless the loan or guarantee may reasonably be expected, in the judgment of the board, to benefit the corporation. If a loan or guarantee is made in violation of this subdivision, the borrower's liability on the loan is not affected. The officers and directors who make a loan in violation of this subdivision or assent to it are jointly and severally liable for its repayment. This subdivision does not prohibit an advance of money for expenses authorized by section 317A.505.\nA loan, guaranty, surety contract, or other financial assistance under subdivision 1 or 2 may be with or without interest and may be unsecured or secured.\nThis section does not grant authority to act as a bank or to carry on the business of banking.",
	"repealed": false
}