{
	"id": "142B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.06",
	"title": "142B.06 UNLICENSED EMERGENCY RELATIVE PLACEMENT.",
	"text": "Notwithstanding section 142B.05, subdivision 3, or 245C.13, subdivision 2, a county agency may place a child with a relative who is not licensed to provide foster care, provided the requirements of this section are met. As used in this section, the term \"relative\" has the meaning given it under section 260C.007, subdivision 26b or 27.\n(a) A county agency that places a child with a relative who is not licensed to provide foster care must conduct the initial inspection required by subdivision 3, clause (1), whenever possible, prior to placing the child in the relative's home, but no later than three working days after placing the child in the home. A child placed in the home of a relative who is not licensed to provide foster care must be removed from that home if the relative fails to cooperate with the county agency.\n(b) If a child is to be placed in the home of a relative not licensed to provide foster care, either the placing agency or the county agency in the county in which the relative lives shall conduct the emergency placement process as required in this section.\nBefore an emergency placement may be made, the following requirements must be met:\n(1) the county agency must conduct an initial inspection of the premises where the placement is to be made to ensure the health and safety of any child placed in the home. The county agency shall conduct the inspection using a form developed by the commissioner;\n(2) at the time of the inspection or placement, whichever is earlier, the county agency must provide the relative being considered for an emergency placement an application form for a child foster care license;\n(3) whenever possible, prior to placing the child in the relative's home, the relative being considered for an emergency placement shall provide the information required by section 245C.05; and\n(4) if the county determines, prior to the emergency placement, that anyone requiring a background study prior to licensure of the home is disqualified under chapter 245C, and the disqualification is one which the commissioner cannot set aside, an emergency placement must not be made.\nWhen the county agency has received the information required by section 245C.05, the county agency shall submit the information to the commissioner of human services according to section 245C.05.\n(a) The relatives with whom the emergency placement has been made shall complete the child foster care license application and necessary paperwork within ten days of the placement. The county agency shall assist the applicant to complete the application. The granting of a child foster care license to a relative shall be under the procedures in this chapter and according to the standards in Minnesota Rules, chapter 2960. In licensing a relative, the commissioner shall consider the importance of maintaining the child's relationship with relatives as an additional significant factor in determining whether a background study disqualification should be set aside under section 245C.22, or a variance should be granted under section 245C.30.\n(b) When the county or private child-placing agency is processing an application for child foster care licensure of a relative as defined in section 260B.007, subdivision 12, or 260C.007, subdivision 26b or 27, the county agency or child-placing agency must explain the licensing process to the prospective licensee, including the background study process and the procedure for reconsideration of an initial disqualification for licensure. The county or private child-placing agency must also provide the prospective relative licensee with information regarding appropriate options for legal representation in the pertinent geographic area. If a relative is initially disqualified under section 245C.14, the commissioner must provide written notice of the reasons for the disqualification and the right to request a reconsideration by the commissioner as required under section 245C.17.\n(c) The commissioner shall maintain licensing data so that activities related to applications and licensing actions for relative foster care providers may be distinguished from other child foster care settings.",
	"repealed": false
}