{
	"id": "144A.472",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.472",
	"title": "144A.472 HOME CARE PROVIDER LICENSE; APPLICATION AND RENEWAL.",
	"text": "Each application for a home care provider license must include information sufficient to show that the applicant meets the requirements of licensure, including:\n(1) the applicant's name, email address, physical address, and mailing address, including the name of the county in which the applicant resides and has a principal place of business;\n(2) the initial license fee in the amount specified in subdivision 7;\n(3) the email address, physical address, mailing address, and telephone number of the principal administrative office;\n(4) the email address, physical address, mailing address, and telephone number of each branch office, if any;\n(5) the names, email and mailing addresses, and telephone numbers of all owners and managerial officials;\n(6) documentation of compliance with the background study requirements of section 144A.476 for all persons involved in the management, operation, or control of the home care provider;\n(7) documentation of a background study as required by section 144.057 for any individual seeking employment, paid or volunteer, with the home care provider;\n(8) evidence of workers' compensation coverage as required by sections 176.181 and 176.182;\n(9) documentation of liability coverage, if the provider has it;\n(10) identification of the license level the provider is seeking;\n(11) documentation that identifies the managerial official who is in charge of day-to-day operations and attestation that the person has reviewed and understands the home care provider regulations;\n(12) documentation that the applicant has designated one or more owners, managerial officials, or employees as an agent or agents, which shall not affect the legal responsibility of any other owner or managerial official under this chapter;\n(13) the signature of the officer or managing agent on behalf of an entity, corporation, association, or unit of government;\n(14) verification that the applicant has the following policies and procedures in place so that if a license is issued, the applicant will implement the policies and procedures and keep them current:\n(i) requirements in chapter 260E, reporting of maltreatment of minors, and section 626.557, reporting of maltreatment of vulnerable adults;\n(ii) conducting and handling background studies on employees;\n(iii) orientation, training, and competency evaluations of home care staff, and a process for evaluating staff performance;\n(iv) handling complaints from clients, family members, or client representatives regarding staff or services provided by staff;\n(v) conducting initial evaluation of clients' needs and the providers' ability to provide those services;\n(vi) conducting initial and ongoing client evaluations and assessments and how changes in a client's condition are identified, managed, and communicated to staff and other health care providers as appropriate;\n(vii) orientation to and implementation of the home care client bill of rights;\n(viii) infection control practices;\n(ix) reminders for medications, treatments, or exercises, if provided; and\n(x) conducting appropriate screenings, or documentation of prior screenings, to show that staff are free of tuberculosis, consistent with current United States Centers for Disease Control and Prevention standards; and\n(15) other information required by the department.\nIn addition to the information and fee required in subdivision 1, applicants applying for a comprehensive home care license must also provide verification that the applicant has the following policies and procedures in place so that if a license is issued, the applicant will implement the policies and procedures in this subdivision and keep them current:\n(1) conducting initial and ongoing assessments of the client's needs by a registered nurse or appropriate licensed health professional, including how changes in the client's conditions are identified, managed, and communicated to staff and other health care providers, as appropriate;\n(2) ensuring that nurses and licensed health professionals have current and valid licenses to practice;\n(3) medication and treatment management;\n(4) delegation of home care tasks by registered nurses or licensed health professionals;\n(5) supervision of registered nurses and licensed health professionals; and\n(6) supervision of unlicensed personnel performing delegated home care tasks.\n(a) Except as provided in section 144A.475, a license may be renewed for a period of one year if the licensee satisfies the following:\n(1) submits an application for renewal in the format provided by the commissioner at least 30 days before expiration of the license;\n(2) submits the renewal fee in the amount specified in subdivision 7;\n(3) has provided home care services within the past 12 months;\n(4) complies with sections 144A.43 to 144A.4798;\n(5) provides information sufficient to show that the applicant meets the requirements of licensure, including items required under subdivision 1;\n(6) provides verification that all policies under subdivision 1 are current; and\n(7) provides any other information deemed necessary by the commissioner.\n(b) A renewal applicant who holds a comprehensive home care license must also provide verification that policies listed under subdivision 2 are current.\nMS 2018 [Repealed, 2019 c 60 art 4 s 35]\n(a) A home care license issued by the commissioner may not be transferred to another party. Before acquiring ownership of or a controlling interest in a home care provider business, a prospective owner must apply for a new license. A change of ownership is a transfer of operational control of the home care provider business and includes:\n(1) transfer of the business to a different or new corporation;\n(2) in the case of a partnership, the dissolution or termination of the partnership under chapter 323A, with the business continuing by a successor partnership or other entity;\n(3) relinquishment of control of the provider to another party, including to a contract management firm that is not under the control of the owner of the business' assets;\n(4) transfer of the business by a sole proprietor to another party or entity; or\n(5) transfer of ownership or control of 50 percent or more of the controlling interest of a home care provider business not covered by clauses (1) to (4).\n(b) An employee who was employed by the previous owner of the home care provider business prior to the effective date of a change in ownership under paragraph (a), and who will be employed by the new owner in the same or a similar capacity, shall be treated as if no change in employer occurred, with respect to orientation, training, tuberculosis testing, background studies, and competency testing and training on the policies identified in subdivision 1, clause (14), and subdivision 2, if applicable.\n(c) Notwithstanding paragraph (b), a new owner of a home care provider business must ensure that employees of the provider receive and complete training and testing on any provisions of policies that differ from those of the previous owner within 90 days after the date of the change in ownership.\nThe temporary licensee or licensee shall notify the commissioner in writing within ten working days after any change in the information required in subdivision 1, except the information required in subdivision 1, clause (5), is required at the time of license renewal.\n(a) An initial applicant seeking temporary home care licensure must submit the following application fee to the commissioner along with a completed application:\n(1) for a basic home care provider, $2,100; or\n(2) for a comprehensive home care provider, $4,200.\n(b) A home care provider who is filing a change of ownership as required under subdivision 5 must submit the following application fee to the commissioner, along with the documentation required for the change of ownership:\n(1) for a basic home care provider, $2,100; or\n(2) for a comprehensive home care provider, $4,200.\n(c) For the period ending June 30, 2018, a home care provider who is seeking to renew the provider's license shall pay a fee to the commissioner based on revenues derived from the provision of home care services during the calendar year prior to the year in which the application is submitted, according to the following schedule:\n(d) For the period between July 1, 2018, and June 30, 2020, a home care provider who is seeking to renew the provider's license shall pay a fee to the commissioner in an amount that is ten percent higher than the applicable fee in paragraph (c). A home care provider's fee shall be based on revenues derived from the provision of home care services during the calendar year prior to the year in which the application is submitted.\n(e) Beginning July 1, 2020, a home care provider who is seeking to renew the provider's license shall pay a fee to the commissioner based on revenues derived from the provision of home care services during the calendar year prior to the year in which the application is submitted, according to the following schedule:\n(f) If requested, the home care provider shall provide the commissioner information to verify the provider's annual revenues or other information as needed, including copies of documents submitted to the Department of Revenue.\n(g) At each annual renewal, a home care provider may elect to pay the highest renewal fee for its license category, and not provide annual revenue information to the commissioner.\n(h) A temporary license or license applicant, or temporary licensee or licensee that knowingly provides the commissioner incorrect revenue amounts for the purpose of paying a lower license fee, shall be subject to a civil penalty in the amount of double the fee the provider should have paid.\n(i) The fine for failure to comply with the notification requirements in section 144A.473, subdivision 2, paragraph (c), is $1,000.\n(j) Fees collected under this section shall be deposited in the state treasury and credited to the state government special revenue fund. All fees are nonrefundable. Fees collected under paragraphs (c), (d), and (e) are nonrefundable even if received before July 1, 2017, for temporary licenses or licenses being issued effective July 1, 2017, or later.\n(k) Fines and civil penalties collected under this subdivision shall be deposited in a dedicated special revenue account. On an annual basis, the balance in the special revenue account shall be appropriated to the commissioner to implement the recommendations of the advisory council established in section 144A.4799.",
	"repealed": false
}