{
	"id": "148.6449",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.6449",
	"title": "148.6449 BOARD OF OCCUPATIONAL THERAPY PRACTICE.",
	"text": "The Board of Occupational Therapy Practice consists of 11 members appointed by the governor. The members are:\n(1) five occupational therapists licensed under sections 148.6401 to 148.6449;\n(2) three occupational therapy assistants licensed under sections 148.6401 to 148.6449; and\n(3) three public members, including two members who have received occupational therapy services or have a family member who has received occupational therapy services, and one member who is a health care professional or health care provider licensed in Minnesota.\n(a) The occupational therapy practitioners appointed to the board must represent a variety of practice areas and settings.\n(b) At least two occupational therapy practitioners must be employed outside the seven-county metropolitan area.\n(c) Board members must not serve for more than two full consecutive terms.\nPrior to the end of the term of a member of the board, or within 60 days after a position on the board becomes vacant, the Minnesota Occupational Therapy Association and other interested persons and organizations may recommend to the governor members qualified to serve on the board. The governor may appoint members to the board from the list of persons recommended or from among other qualified candidates.\nThe board shall biennially elect from its membership a chair, vice-chair, and secretary-treasurer. Each officer shall serve until a successor is elected.\nThe board shall appoint and employ an executive director who is not a member of the board. The employment of the executive director shall be subject to the terms described in section 214.04, subdivision 2a.\nMembership terms, compensation of members, removal of members, the filling of membership vacancies, and fiscal year and reporting requirements shall be as provided in chapter 214. The provision of staff, administrative services, and office space; the review and processing of complaints; the setting of board fees; and other activities relating to board operations shall be conducted according to chapter 214.\n(a) The board shall:\n(1) adopt and enforce rules and laws necessary for licensing occupational therapy practitioners;\n(2) adopt and enforce rules for regulating the professional conduct of the practice of occupational therapy;\n(3) issue licenses to qualified individuals in accordance with sections 148.6401 to 148.6449;\n(4) assess and collect fees for the issuance and renewal of licenses;\n(5) educate the public about the requirements for licensing occupational therapy practitioners, educate occupational therapy practitioners about the rules of conduct, and enable the public to file complaints against applicants and licensees who may have violated sections 148.6401 to 148.6449; and\n(6) investigate individuals engaging in practices that violate sections 148.6401 to 148.6449 and take necessary disciplinary, corrective, or other action according to section 148.6448.\n(b) The board may adopt rules necessary to define standards or carry out the provisions of sections 148.6401 to 148.6449. Rules shall be adopted according to chapter 14.",
	"repealed": false
}