{
	"id": "442A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/442A.08",
	"title": "442A.08 JOINT PUBLIC INFORMATIONAL MEETING.",
	"text": "In all cases that proceed to a contested case hearing, there must be a joint public informational meeting of the local governments of any proposed sanitary district creation, annexation, detachment, or dissolution. The joint public informational meeting must be held after the final mediation meeting or the final meeting held according to section 442A.02, subdivision 8, if any, and before the hearing on the matter is held. If no mediation meetings are held, the joint public informational meeting must be held after the initiating documents have been filed and before the hearing on the matter. The time, date, and place of the public informational meeting must be determined jointly by the local governments in the proposed creation, annexation, detachment, or dissolution areas and by the sanitary district, if one exists. The chair of the sanitary district, if one exists, and the responsible official for one of the local governments represented at the meeting must serve as the co-chairs for the informational meeting. Notice of the time, date, place, and purpose of the informational meeting must be posted by the sanitary district, if one exists, and local governments in designated places for posting notices. The sanitary district, if one exists, and represented local governments must also publish, at their own expense, notice in their respective official newspapers. If the same official newspaper is used by multiple local government representatives or the sanitary district, a joint notice may be published and the costs evenly divided. All notice required by this section must be provided at least ten days before the date for the public informational meeting. At the public informational meeting, all persons appearing must have an opportunity to be heard, but the co-chairs may, by mutual agreement, establish the amount of time allowed for each speaker. The sanitary district board, the local government representatives, and any resident or affected property owner may be represented by counsel and may place into the record of the informational meeting documents, expert opinions, or other materials supporting their positions on issues raised by the proposed proceeding. The secretary of the sanitary district, if one exists, or a person appointed by the chair must record minutes of the proceedings of the informational meeting and must make an audio recording of the informational meeting. The sanitary district, if one exists, or a person appointed by the chair must provide the chief administrative law judge and the represented local governments with a copy of the printed minutes and must provide the chief administrative law judge and the represented local governments with a copy of the audio recording. The record of the informational meeting for a proceeding under section 442A.04, 442A.05, 442A.06, or 442A.07 is admissible in any proceeding under this chapter and shall be taken into consideration by the chief administrative law judge or the chief administrative law judge's designee.",
	"repealed": false
}