{
	"id": "609.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.26",
	"title": "609.26 DEPRIVING ANOTHER OF CUSTODIAL OR PARENTAL RIGHTS.",
	"text": "Whoever intentionally does any of the following acts may be charged with a felony and, upon conviction, may be sentenced as provided in subdivision 6:\n(1) conceals a minor child from the child's parent where the action manifests an intent substantially to deprive that parent of parental rights or conceals a minor child from another person having the right to parenting time or custody where the action manifests an intent to substantially deprive that person of rights to parenting time or custody;\n(2) takes, obtains, retains, or fails to return a minor child in violation of a court order which has transferred legal custody under chapter 260, 260B, or 260C to the commissioner of human services, a child-placing agency, or the local social services agency;\n(3) takes, obtains, retains, or fails to return a minor child from or to the parent in violation of a court order, where the action manifests an intent substantially to deprive that parent of rights to parenting time or custody;\n(4) takes, obtains, retains, or fails to return a minor child from or to a parent after commencement of an action relating to child parenting time or custody but prior to the issuance of an order determining custody or parenting time rights, where the action manifests an intent substantially to deprive that parent of parental rights;\n(5) retains a child in this state with the knowledge that the child was removed from another state in violation of any of the above provisions;\n(6) refuses to return a minor child to a parent or lawful custodian and is at least 18 years old and more than 24 months older than the child;\n(7) causes or contributes to a child being a habitual truant as defined in section 260C.007, subdivision 19, and is at least 18 years old and more than 24 months older than the child;\n(8) causes or contributes to a child being a runaway as defined in section 260C.007, subdivision 28, and is at least 18 years old and more than 24 months older than the child; or\n(9) is at least 18 years old and resides with a minor under the age of 16 without the consent of the minor's parent or lawful custodian.\nIt is an affirmative defense if a person charged under subdivision 1 proves that:\n(1) the person reasonably believed the action taken was necessary to protect the child from physical or sexual assault or substantial emotional harm;\n(2) the person reasonably believed the action taken was necessary to protect the person taking the action from physical or sexual assault;\n(3) the action taken is consented to by the parent, stepparent, or legal custodian seeking prosecution, but consent to custody or specific parenting time is not consent to the action of failing to return or concealing a minor child; or\n(4) the action taken is otherwise authorized by a court order issued prior to the violation of subdivision 1.\nThe defenses provided in this subdivision are in addition to and do not limit other defenses available under this chapter or chapter 611.\nTo the extent that it states that subdivision 2 creates affirmative defenses to a charge under this section, subdivision 2 clarifies the original intent of the legislature in enacting Laws 1984, chapter 484, section 2, and does not change the substance of this section. Subdivision 2 does not modify or alter any convictions entered under this section before August 1, 1988.\nA person who violates this section may be prosecuted and tried either in the county in which the child was taken, concealed, or detained or in the county of lawful residence of the child.\nA child who has been concealed, obtained, or retained in violation of this section shall be returned to the person having lawful custody of the child or shall be taken into custody pursuant to section 260C.175, subdivision 1, clause (2), item (ii). In addition to any sentence imposed, the court may assess any expense incurred in returning the child against any person convicted of violating this section. The court may direct the appropriate county welfare agency to provide counseling services to a child who has been returned pursuant to this subdivision.\nA felony charge brought under this section shall be dismissed if:\n(a) the person voluntarily returns the child within 48 hours after taking, detaining, or failing to return the child in violation of this section; or\n(b)(1) the person taking the action and the child have not left the state of Minnesota; and (2) within a period of seven days after taking the action, (i) a motion or proceeding under chapter 518, 518A, 518B, 518C, or 518D is commenced by the person taking the action, or (ii) the attorney representing the person taking the action has consented to service of process by the party whose rights are being deprived, for any motion or action pursuant to chapter 518, 518A, 518B, 518C, or 518D.\nClause (a) does not apply if the person returns the child as a result of being located by law enforcement authorities.\nThis subdivision does not prohibit the filing of felony charges or an offense report before the expiration of the 48 hours.\n(a) Except as otherwise provided in paragraph (b) and subdivision 5, whoever violates this section may be sentenced as follows:\n(1) to imprisonment for not more than two years or to payment of a fine of not more than $4,000, or both; or\n(2) to imprisonment for not more than four years or to payment of a fine of not more than $8,000, or both, if the court finds that:\n(i) the defendant committed the violation while possessing a dangerous weapon or caused substantial bodily harm to effect the taking;\n(ii) the defendant abused or neglected the child during the concealment, detention, or removal of the child;\n(iii) the defendant inflicted or threatened to inflict physical harm on a parent or lawful custodian of the child or on the child with intent to cause the parent or lawful custodian to discontinue criminal prosecution;\n(iv) the defendant demanded payment in exchange for return of the child or demanded to be relieved of the financial or legal obligation to support the child in exchange for return of the child; or\n(v) the defendant has previously been convicted under this section or a similar statute of another jurisdiction.\n(b) A violation of subdivision 1, clause (7), is a gross misdemeanor. The county attorney shall prosecute violations of subdivision 1, clause (7).\nAny violation of this section shall be reported pursuant to section 260E.11, subdivision 2.",
	"repealed": false
}