{
	"id": "79.59",
	"url": "https://www.revisor.mn.gov/statutes/cite/79.59",
	"title": "79.59 INSURERS AND DATA SERVICE ORGANIZATIONS; PROHIBITED ACTIVITIES.",
	"text": "No insurer or data service organization shall attempt to monopolize or combine or conspire with any other person to monopolize the business of insurance.\nNo insurer shall agree with any other insurer or with a data service organization to adhere to or to use any rate, rating plan, rating schedule, rating rule, or underwriting rule except as specifically authorized by this chapter or for the purpose of creating experience modifications for employers with employees in more than one state.\nNo insurer or data service organization shall make an agreement with any other insurer, data service organization, or other person which has the purpose or the effect of restraining trade or of substantially lessening competition.\nThe fact that insurers writing not more than 25 percent of the workers' compensation premiums in Minnesota use the same rates, rating plans, rating schedules, rating rules, underwriting rules, or similar materials shall not alone constitute a violation of subdivision 1 or 2.\nTwo or more insurers under common ownership or operating under common management or control may act in concert between or among themselves with respect to matters authorized under this chapter as if they constituted a single insurer, provided that the rating plan of such insurers shall be considered to be a single plan for the purposes of determining unfair discrimination.\nIn addition to other prohibitions contained in this chapter, no data service organization shall:\n(1) refuse to supply any service for which it is licensed or any data, except for data identifiable to an individual insurer, to any insurer authorized to do business in this state which offers to pay the usual compensation for the service or data;\n(2) require the purchase of any specific service as a condition to obtaining any other services sought;\n(3) participate in the development or distribution of rates, rating plans, or rating rules except as specifically authorized by this chapter or by rules adopted pursuant to this chapter; or\n(4) refuse membership to any licensed insurer.",
	"repealed": false
}