{
	"id": "145A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.06",
	"title": "145A.06 COMMISSIONER; POWERS AND DUTIES.",
	"text": "In addition to other powers and duties provided by law, the commissioner has the powers listed in subdivisions 2 to 5.\n(a) In the absence of provision for a community health board, the commissioner may appoint three or more persons to act as a board until one is established. The commissioner may fix their compensation, which the county or city must pay.\n(b) The commissioner by written order may require any two or more community health boards, counties, or cities to act together to prevent or control epidemic diseases.\n(c) If a community health board, county, or city fails to comply with section 145A.04, subdivision 6, the commissioner may employ medical and other help necessary to control communicable disease at the expense of the jurisdiction involved.\n(d) If the commissioner has reason to believe that the provisions of this chapter have been violated, the commissioner shall inform the attorney general and submit information to support the belief. The attorney general shall institute proceedings to enforce the provisions of this chapter or shall direct the county attorney to institute proceedings.\n[Repealed, 1989 c 194 s 22]\nThe commissioner shall help and advise community health boards that ask for assistance in developing, administering, and carrying out public health services and programs. This assistance may consist of, but is not limited to:\n(1) informational resources, consultation, and training to assist community health boards plan, develop, integrate, provide, and evaluate community health services; and\n(2) administrative and program guidelines and standards developed with the advice of the State Community Health Services Advisory Committee.\nIn accordance with chapter 14, and in consultation with the State Community Health Services Advisory Committee, the commissioner may adopt rules to set standards for administrative and program personnel to ensure competence in administration and planning.\nThe commissioner shall help and advise community health boards that ask for help in developing, administering, and carrying out public health services and programs.\nThe commissioner shall promote measures aimed at preventing businesses from facilitating sexual practices that transmit deadly infectious diseases by providing technical advice to community health boards to assist them in regulating these practices or closing establishments that constitute a public health nuisance.\nTo improve public health and ensure the integrity and accountability of the statewide local public health system, the commissioner, in consultation with the State Community Health Services Advisory Committee, shall develop performance measures and implement a process to monitor statewide outcomes and performance improvement.\n(a) The commissioner may accept grants from the United States Department of Health and Human Services for the emergency system for the advanced registration of volunteer health professionals (ESAR-VHP) established under United States Code, title 42, section 247d-7b. The ESAR-VHP program as implemented in Minnesota is known as the Minnesota Responds Medical Reserve Corps.\n(b) The commissioner may maintain a registry of volunteers for the Minnesota Responds Medical Reserve Corps and obtain data on volunteers relevant to possible deployments within and outside the state. All state licensing and certifying boards shall cooperate with the Minnesota Responds Medical Reserve Corps and shall verify volunteers' information. The commissioner may also obtain information from other states and national licensing or certifying boards for health practitioners.\n(c) The commissioner may share volunteers' data, including any data classified as private data, from the Minnesota Responds Medical Reserve Corps registry with community health boards, cities or counties, the University of Minnesota's Academic Health Center or other public or private emergency preparedness partners, or tribal governments operating Minnesota Responds Medical Reserve Corps units as needed for credentialing, organizing, training, and deploying volunteers. Upon request of another state participating in the ESAR-VHP or of a Canadian government administering a similar health volunteer program, the commissioner may also share the volunteers' data as needed for emergency preparedness and response.\n(a) When the commissioner receives a request for health volunteers from:\n(1) a community health board, county, or city according to section 145A.04, subdivision 6c;\n(2) the University of Minnesota Academic Health Center;\n(3) another state or a territory through the Interstate Emergency Management Assistance Compact authorized under section 192.89;\n(4) the federal government through ESAR-VHP or another similar program; or\n(5) a tribal or Canadian government;\nthe commissioner shall determine if deployment of Minnesota Responds Medical Reserve Corps volunteers from outside the requesting jurisdiction is in the public interest. If so, the commissioner may ask for Minnesota Responds Medical Reserve Corps volunteers to respond to the request. The commissioner may also ask for Minnesota Responds Medical Reserve Corps volunteers if the commissioner finds that the state needs health volunteers.\n(b) The commissioner may request Minnesota Responds Medical Reserve Corps volunteers to work on the Minnesota Mobile Medical Unit (MMU), or on other mobile or temporary units providing emergency patient stabilization, medical transport, or ambulatory care. The commissioner may utilize the volunteers for training, mobilization or demobilization, inspection, maintenance, repair, or other support functions for the MMU facility or for other emergency units, as well as for provision of health care services.\n(c) A volunteer's rights and benefits under this chapter as a Minnesota Responds Medical Reserve Corps volunteer is not affected by any vacation leave, pay, or other compensation provided by the volunteer's employer during volunteer service requested by the commissioner. An employer is not liable for actions of an employee while serving as a Minnesota Responds Medical Reserve Corps volunteer.\n(d) If the commissioner matches the request under paragraph (a) with Minnesota Responds Medical Reserve Corps volunteers, the commissioner shall facilitate deployment of the volunteers from the sending Minnesota Responds Medical Reserve Corps units to the receiving jurisdiction. The commissioner shall track volunteer deployments and assist sending and receiving jurisdictions in monitoring deployments, and shall coordinate efforts with the division of homeland security and emergency management for out-of-state deployments through the Interstate Emergency Management Assistance Compact or other emergency management compacts.\n(e) Where the commissioner has deployed Minnesota Responds Medical Reserve Corps volunteers within or outside the state, the provisions of paragraphs (f) and (g) must apply. Where Minnesota Responds Medical Reserve Corps volunteers were deployed across jurisdictions by mutual aid or similar agreements prior to a commissioner's call, the provisions of paragraphs (f) and (g) must apply retroactively to volunteers deployed as of their initial deployment in response to the event or emergency that triggered a subsequent commissioner's call.\n(f)(1) A Minnesota Responds Medical Reserve Corps volunteer responding to a request for training or assistance at the call of the commissioner must be deemed an employee of the state for purposes of workers' compensation and tort claim defense and indemnification under section 3.736, without regard to whether the volunteer's activity is under the direction and control of the commissioner, the division of homeland security and emergency management, the sending jurisdiction, the receiving jurisdiction, or of a hospital, alternate care site, or other health care provider treating patients from the public health event or emergency.\n(2) For purposes of calculating workers' compensation benefits under chapter 176, the daily wage must be the usual wage paid at the time of injury or death for similar services performed by paid employees in the community where the volunteer regularly resides, or the wage paid to the volunteer in the volunteer's regular employment, whichever is greater.\n(g) The Minnesota Responds Medical Reserve Corps volunteer must receive reimbursement for travel and subsistence expenses during a deployment approved by the commissioner under this subdivision according to reimbursement limits established for paid state employees. Deployment begins when the volunteer leaves on the deployment until the volunteer returns from the deployment, including all travel related to the deployment. The Department of Health shall initially review and pay those expenses to the volunteer. Except as otherwise provided by the Interstate Emergency Management Assistance Compact in section 192.89 or agreements made thereunder, the department shall bill the jurisdiction receiving assistance and that jurisdiction shall reimburse the department for expenses of the volunteers.\n(h) In the event Minnesota Responds Medical Reserve Corps volunteers are deployed outside the state pursuant to the Interstate Emergency Management Assistance Compact, the provisions of the Interstate Emergency Management Assistance Compact must control over any inconsistent provisions in this section.\n(i) When a Minnesota Responds Medical Reserve Corps volunteer makes a claim for workers' compensation arising out of a deployment under this section or out of a training exercise conducted by the commissioner, the volunteer's workers compensation benefits must be determined under section 176.011, subdivision 9, clause (25), even if the volunteer may also qualify under other clauses of section 176.011, subdivision 9.\n(a) While an emergency declaration is in effect, a volunteer health practitioner who is (1) registered with a registration system that complies with the emergency system for the advanced registration of volunteer health professionals (ESAR-VHP) established under United States Code, title 42, section 247d-7b; (2) licensed and in good standing in the state upon which the practitioner's registration is based; and (3) (i) requested for deployment by the state's authorized representative under section 192.89, or (ii) deployed pursuant to an agreement between the disaster relief organization, professional association of health practitioners, health care facilities or providers, or other individuals or entities and the state's authorized representative under section 192.89, may practice in this state within the scope of practice authorized in the licensing state and to the extent authorized by this section as if the practitioner were licensed in this state. A \"volunteer health practitioner\" means a health practitioner who provides health or veterinary services, whether or not the practitioner receives compensation for those services. The term does not include a practitioner who receives compensation pursuant to a preexisting employment relationship with a host entity or affiliate which requires the practitioner to provide health services in this state, unless the practitioner is not a resident of this state and is employed by a disaster relief organization providing services in this state while an emergency declaration is in effect.\n(b) A volunteer health practitioner qualified under paragraph (a) is entitled to the liability protections of section 192.89, subdivision 6, unless any license of the practitioner in any state has been suspended, revoked, or subject to an agency order limiting or restricting practice privileges, or has been voluntarily terminated under threat of sanction.",
	"repealed": false
}