{
	"id": "253D.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/253D.27",
	"title": "253D.27 PETITION FOR REDUCTION IN CUSTODY.",
	"text": "(a) This section applies only to committed persons as defined in section 253D.02, subdivision 4. The procedures in section 253D.14 for victim notification and right to submit a statement apply to petitions filed and reductions in custody recommended under this section.\n(b) For the purposes of this section, \"reduction in custody\" means transfer out of a secure treatment facility, a provisional discharge, or a discharge from commitment. A reduction in custody is considered to be a commitment proceeding under section 8.01.\nA petition for a reduction in custody or an appeal of a revocation of provisional discharge may be filed by either the committed person or by the executive director and must be filed with and considered by a panel of the special review board authorized under section 253B.18, subdivision 4c. A committed person may not petition the special review board any sooner than six months following either:\n(1) the entry of judgment in the district court of the order for commitment issued under section 253D.07, subdivision 5, or upon the exhaustion of all related appeal rights in state court relating to that order, whichever is later; or\n(2) any recommendation of the special review board or order of the judicial appeal panel, or upon the exhaustion of all appeal rights in state court, whichever is later. The executive director may petition at any time. The special review board proceedings are not contested cases as defined in chapter 14.\n(a) The special review board shall hold a hearing on each petition before issuing a recommendation and report under subdivision 4. Fourteen days before the hearing, the committing court, the county attorney of the county of commitment, the county attorney of the county of financial responsibility, an interested person, the petitioner and the petitioner's counsel, and the committed person and the committed person's counsel must be given written notice by the executive board of the time and place of the hearing before the special review board. Only those entitled to statutory notice of the hearing or those administratively required to attend may be present at the hearing. The committed person may designate interested persons to receive notice by providing the names and addresses to the executive board at least 21 days before the hearing.\n(b) A person or agency receiving notice that submits documentary evidence to the special review board before the hearing must also provide copies to the committed person, the committed person's counsel, the county attorney of the county of commitment, and the county attorney of the county of financial responsibility. The special review board must consider any statements received from victims under section 253D.14.\nWithin 30 days of the hearing, the special review board shall issue a report with written findings of fact and shall recommend denial or approval of the petition to the judicial appeal panel established under section 253B.19. The executive board shall forward the report of the special review board to the judicial appeal panel and to every person entitled to statutory notice. No reduction in custody or reversal of a revocation of provisional discharge recommended by the special review board is effective until it has been reviewed by the judicial appeal panel and until 15 days after an order from the judicial appeal panel affirming, modifying, or denying the recommendation.",
	"repealed": false
}