{
	"id": "115A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.06",
	"title": "115A.06 POWERS OF POLLUTION CONTROL AGENCY.",
	"text": "[Repealed, 1989 c 335 art 1 s 270]\nUnless otherwise provided, the commissioner shall promulgate rules in accordance with chapter 14 to govern the agency's activities and implement this chapter.\n[Repealed, 1989 c 335 art 1 s 270]\n[Repealed, 1996 c 310 s 1]\nWhenever the agency or the commissioner acting on behalf of the agency deems it necessary to the accomplishment of its purposes, the agency or any member, employee, or agent thereof, when authorized by it or the commissioner, may enter upon any property, public or private, for the purpose of obtaining information or conducting surveys or investigations, provided that the entrance and activity is undertaken after reasonable notice and during normal business hours and provided that compensation is made for any damages to the property caused by the entrance and activity. The agency may pay a reasonable estimate of the damages it believes will be caused by the entrance and activity before entering any property.\nIf the agency determines that any activity deemed necessary to accomplish its purposes under subdivision 5 constitutes a substantial interference with the possession, enjoyment, or value of the property where the activity will take place, the agency may acquire a temporary easement interest in the property that permits the agency to carry out the activity and other activities incidental to the accomplishment of the same purposes. The agency may acquire temporary easement interests under this subdivision by purchase, gift, or condemnation. The right of the agency to acquire a temporary easement is subject to the same requirements and may be exercised with the same authority as provided for acquisition of property interests by the commissioner of administration under Minnesota Statutes 1994, section 115A.06, subdivision 4.\nThe agency, or the commissioner of the Pollution Control Agency or commissioner of administration on behalf of the agency, may apply for and accept gifts, loans, or other property from the United States, the state, or any person for any of the purposes of the agency, may enter into any agreement required in connection therewith, and may hold, use, and dispose of the money or property in accordance with the terms of the gift, grant, loan or agreement.\nAny real or personal property owned, used, or occupied by the agency or the commissioner of administration for any purpose referred to in sections 115A.01 to 115A.72 is declared to be acquired, owned, used, and occupied for public and governmental purposes, and shall be exempt from taxation by the state or any political subdivision of or other governmental unit of or within the state, provided that those properties shall be subject to special assessments levied for a local improvement in amounts proportionate to and not exceeding the special benefit received by the properties from the improvement. No possible use of the properties in any manner different from their use for hazardous waste management at the time shall be considered in determining the special benefit received by the properties.\nThe commissioner may enter into any contract necessary or proper for the exercise of the commissioner's powers or the accomplishment of the agency's purposes.\nThe commissioner may act under the provisions of section 471.59, or any other law providing for joint or cooperative action.\nThe commissioner may conduct research studies and programs, collect and analyze data, prepare reports, maps, charts, and tables, and order all necessary hearings and investigations in connection with the commissioner's work and may advise and assist other government units on planning matters within the scope of the commissioner's powers, duties, and objectives.\nThe commissioner may employ persons and contract for services to perform research, engineering, legal, or other services necessary to carry out the commissioner's functions.\nThe commissioner may procure insurance in amounts the commissioner deems necessary to insure against liability of the agency and employees or both, for personal injury or death and property damage or destruction, with the force and effect stated in chapter 466, and against risks of damage to or destruction of any of the agency's property as the commissioner deems necessary.\n(a) Any data held by the commissioner which consists of trade secret information as defined by section 13.37, subdivision 1, clause (b), or sales information, shall be classified as private or nonpublic data as defined in section 13.02, subdivisions 9 and 12. When data is classified private or nonpublic pursuant to this subdivision the commissioner may:\n(1) use the data to compile and publish analyses or summaries and to carry out the commissioner's statutory responsibilities in a manner which does not identify the subject of the data; or\n(2) disclose the data when the commissioner is obligated to disclose it to comply with federal law or regulation but only to the extent required by the federal law or regulation.\n(b) The subject of data classified as private or nonpublic pursuant to this subdivision may authorize the disclosure of some or all of that data by the commissioner.\nThe commissioner shall encourage improved management of waste rendered nonhazardous and industrial waste that should be managed separately from mixed municipal solid waste, and may provide technical and planning assistance to political subdivisions, waste generators, and others for the purpose of identifying, developing, and implementing alternative management methods for those wastes.",
	"repealed": false
}