{
	"id": "513.56",
	"url": "https://www.revisor.mn.gov/statutes/cite/513.56",
	"title": "513.56 DISCLOSURE NOT REQUIRED.",
	"text": "Section 513.55 does not create a duty to disclose the fact that residential property:\n(1) is or was occupied by an owner or occupant who is or was suspected to be infected with human immunodeficiency virus or diagnosed with acquired immunodeficiency syndrome;\n(2) was the site of a suicide, accidental death, natural death, or perceived paranormal activity; or\n(3) is located in a neighborhood containing any adult family home, community-based residential facility, or nursing home.\nSection 513.55 does not create a duty to disclose information regarding an offender who is required to register under section 243.166, or about whom notification is made under that section, if the seller, in a timely manner, provides a written notice that information about the predatory offender registry and persons registered with the registry may be obtained by contacting the local law enforcement agency where the property is located or the Department of Corrections.\nThis section does not create a duty to disclose any facts described in subdivision 1 and this subdivision for property that is not residential real property.\n(a) Except as provided in paragraph (b), a seller is not required to disclose information relating to the real property if a written report that discloses the information has been prepared by a qualified third party and provided to the prospective buyer. For purposes of this paragraph, \"qualified third party\" means a federal, state, or local governmental agency, or any person whom the seller, or prospective buyer, reasonably believes has the expertise necessary to meet the industry standards of practice for the type of inspection or investigation that has been conducted by the third party in order to prepare the written report.\n(b) A seller shall disclose to the prospective buyer material facts known by the seller that contradict any information included in a written report under paragraph (a) if a copy of the report is provided to the seller.\n(c) The seller has no duty to disclose information regarding airport zoning regulations if the seller, in a timely manner, provides a written notice that a copy of the airport zoning regulations as adopted can be reviewed or obtained at the office of the county recorder where the zoned area is located.\nThe limitation on disclosure in subdivisions 1 and 2 modifies any common law duties with respect to disclosure of material facts.",
	"repealed": false
}