{
	"id": "160.263",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.263",
	"title": "160.263 BICYCLE LANES, ROUTES, AND PATHS.",
	"text": "MS 1986 [Repealed, 1987 c 255 s 15]\n(a) The governing body of any political subdivision may by ordinance or resolution:\n(1) designate any roadway or shoulder or portion thereof under its jurisdiction as a bicycle lane or bicycle route;\n(2) designate any sidewalk or portion thereof under its jurisdiction as a bicycle path provided that the designation does not destroy a pedestrian way or pedestrian access;\n(3) develop and designate bicycle paths;\n(4) designate as bikeways all bicycle lanes, bicycle routes, and bicycle paths.\n(b) A governing body may not prohibit or otherwise restrict operation of an electric-assisted bicycle, as defined in section 169.011, subdivision 27, on any bikeway, roadway, or shoulder, unless the governing body determines that operation of the electric-assisted bicycle is not consistent with (1) the safety or general welfare of bikeway, roadway, or shoulder users; or (2) the terms of any property conveyance.\n(a) A governing body designating a bikeway under this section may:\n(1) designate the type and character of vehicles or other modes of travel which may be operated on a bikeway, provided that the operation of such vehicle or other mode of travel is not inconsistent with the safe use and enjoyment of the bikeway by bicycle traffic;\n(2) establish priority of right-of-way on the bicycle lane or bicycle path and otherwise regulate the use of bikeways as it deems necessary; and\n(3) paint lines or construct curbs or establish other physical separations to exclude the use of the bikeways by vehicles other than those specifically permitted to operate thereon.\n(b) The designating governing body may, after public hearing, prohibit through traffic on any highway or portion thereof designated as a bicycle lane or bicycle route, except that through traffic may not be prohibited on a trunk highway. The designating governing body shall erect and maintain official signs giving notice of the regulations and priorities established under this subdivision and shall mark all bikeways with appropriate signs. Marking and signing of bikeways by the designating governing body shall be in conformance with the Minnesota Manual on Uniform Traffic Control Devices.\n(c) When an existing disability parking space is designated pursuant to section 169.346, subdivision 2, on a segment of road on which the governing body is considering designating a bikeway, the governing body must work with the person of record for the disability parking space to determine if the parking space is in use and may be removed, modified, or relocated to a mutually agreeable location. The governing body must establish in public record an agreement to remove, modify, or relocate the disability parking space. If there is no agreement to remove, modify, or relocate the disability parking space, the governing body must designate the bikeway in a manner that does not eliminate or interfere with the parking space, or must establish a disability parking space at the nearest possible location to facilitate a continuous designated bikeway.\n(d) For purposes of this subdivision, \"person of record\" means the person who is identified on file with the governing body as the requester to establish the disability parking space. If the person of record does not use the disability parking space, the person of record may delegate the authority for an agreement under paragraph (c) or may negotiate on behalf of another individual who primarily uses the disability parking space.\nNotwithstanding section 169.14, subdivision 5, the governing body of any political subdivision, by resolution or ordinance and without an engineering or traffic investigation, may designate a safe speed for any street or highway under its authority upon which it has established a bicycle lane; provided that such safe speed shall not be lower than 25 miles per hour. The ordinance or resolution designating a safe speed is effective when appropriate signs designating the speed are erected along the street or highway, as provided by the governing body.",
	"repealed": false
}