{
	"id": "196.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/196.22",
	"title": "196.22 POWERS AND DUTIES OF COMMISSIONER.",
	"text": "The commissioner shall establish and maintain an environmental hazards information and assistance program. The commissioner shall:\n(1) provide information regarding epidemiological, genetic, and other scientific studies proposed, underway, or completed that pertain to adverse health conditions which may be associated with exposure to chemical agents;\n(2) monitor and report on the activities and policies of the United States government relating to the exposure of veterans to chemical agents; and\n(3) respond, within the commissioner's powers and duties under this chapter and chapter 197, to other issues of concern to veterans relating to exposure to chemical agents.\nThe commissioner, in cooperation with the United States Veterans Administration, county veterans service officers, and veterans organizations shall institute referral programs to:\n(1) refer veterans to appropriate federal agencies or other available resources for treatment of adverse health conditions which may have resulted from possible exposure to chemical agents; and\n(2) refer veterans to state, county, or veterans organizations advocacy services to assist them in filing compensation claims for disabilities that may have resulted from possible exposure to chemical agents.\nThe commissioner may contract for limited studies regarding the prevalence of adverse health conditions in veterans which may be associated with possible exposure to chemical agents. Prior to contracting for such studies, the commissioner shall consult with the commissioner of health, the University of Minnesota School of Public Health, and other appropriate scientific and technical advisors pertaining to their design.\n[Repealed, 1997 c 7 art 2 s 67]\nWithin the commissioner's powers and duties under chapters 196 and 197, the commissioner shall take any action appropriate to represent to appropriate officials and representatives of the United States government the concerns of veterans related to exposure to chemical agents.",
	"repealed": false
}