{
	"id": "268B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/268B.07",
	"title": "268B.07 DETERMINATION ON ISSUES OF ELIGIBILITY.",
	"text": "(a) Upon a determination that an applicant is entitled to benefits, the commissioner must promptly send a notification to the employer or employers of the applicant from which the applicant is taking leave, if any, in accordance with paragraph (b).\n(b) The notification under paragraph (a) must include, at a minimum:\n(1) the name of the applicant;\n(2) that the applicant has applied for and received benefits;\n(3) the week the benefits commence;\n(4) the weekly benefit amount payable; and\n(5) the maximum duration of benefits.\n(c) The commissioner may adopt rules regarding additional information that may be requested from an applicant and notifications provided to an employer as part of the application and eligibility determination process for benefits.\n[See Note.]\n(a) The commissioner must determine any issue of ineligibility raised by information required from an applicant and send to the applicant and any current base period employer from which the applicant applied to take leave, by mail or electronic transmission, a determination of eligibility or a determination of ineligibility, as is appropriate, within two weeks, unless the application is incomplete due to outstanding requests for information including clerical or other errors. Nothing prohibits the commissioner from requesting additional information or the applicant from supplementing their initial application before a determination of eligibility. The commissioner may extend the deadline for a determination under this subdivision due to extenuating circumstances.\n(b) The commissioner shall set requirements for an applicant to respond to a request for information. If the required information is not provided in the timeline provided in paragraph (a), the application is denied.\n(c) The commissioner shall prescribe requirements for when an incomplete application is closed. Applicants shall have the ability to reopen closed claims in a manner and form prescribed by the commissioner.\n(d) If an applicant obtained benefits through misrepresentation, the department is authorized to issue a determination of ineligibility within 12 months of the effective date of leave.\n(e) If the department has filed an intervention in a workers' compensation matter under section 176.361, the department is authorized to issue a determination of ineligibility within 48 months of the effective date of leave.\n(f) The determination must contain a prominent statement indicating the consequences of not appealing.\n(g) An issue of ineligibility required to be determined under this section includes any question regarding the denial or allowing of benefits under this chapter.\n[See Note.]\nUnless an appeal has been filed, the commissioner, on the commissioner's own motion, may reconsider a determination of eligibility or determination of ineligibility that has not become final and issue an amended determination. Any amended determination must be sent to the applicant and any employer in the current base period from which the applicant applied for leave by mail or electronic transmission.\n[See Note.]\nIf a determination or amended determination allows benefits to an applicant, the family or medical leave benefits must be paid regardless of any appeal period or any appeal having been filed.\nA determination or amended determination that holds an applicant ineligible for benefits for periods an applicant has been paid benefits is an overpayment of those family or medical leave benefits. A determination or amended determination issued under this section that results in an overpayment of benefits must set out the amount of the overpayment and the requirement that the overpaid benefits must be repaid according to section 268B.185.",
	"repealed": false
}