{
	"id": "58A.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/58A.07",
	"title": "58A.07 TESTING OF LOAN ORIGINATORS.",
	"text": "In order to meet the written test requirement referred to in section 58A.05, clause (5), an individual shall pass, in accordance with the standards established under this section, a qualified written test developed by the Nationwide Multistate Licensing System and Registry (NMLSR) and designated as the NMLSR's National Test Component with Uniform State Content for Mortgage Loan Originator Licensing and administered by a test provider approved by the NMLSR based upon reasonable standards.\nA written test must not be treated as a qualified written test for purposes of subdivision 1 unless the test adequately measures the applicant's knowledge and comprehension in appropriate subject areas, including:\n(1) ethics;\n(2) federal law and regulation pertaining to mortgage origination;\n(3) state law and rule pertaining to mortgage origination; and\n(4) federal and state law and rule, including instruction on fraud, consumer protection, the nontraditional mortgage marketplace, and fair lending issues.\nNothing in this section prohibits a test provider approved by the Nationwide Multistate Licensing System and Registry from providing a test at the location of the employer of the applicant or the location of a subsidiary or affiliate of the employer of the applicant, or the location of an entity with which the applicant holds an exclusive arrangement to conduct the business of a mortgage loan originator.\n(a) An individual is not considered to have passed a qualified written test unless the individual achieves a test score of not less than 75 percent correct answers to questions.\n(b) An individual may retake a test three consecutive times with each consecutive taking occurring at least 30 days after the preceding test.\n(c) After failing three consecutive tests, an individual shall wait at least six months before taking the test again.\n(d) A licensed mortgage loan originator who fails to maintain a valid license for a period of five years or longer shall retake the test, not taking into account any time during which the individual is a registered mortgage loan originator.",
	"repealed": false
}