{
	"id": "298.227",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.227",
	"title": "298.227 TACONITE ECONOMIC DEVELOPMENT FUND.",
	"text": "An amount equal to that distributed pursuant to each taconite producer's taxable production and qualifying sales under section 298.28, subdivision 9a, shall be held by the commissioner of Iron Range resources and rehabilitation in a separate taconite economic development fund for each taconite and direct reduced ore producer. Money from the fund for each producer shall be released by the commissioner after review by a joint committee consisting of an equal number of representatives of the salaried employees and the nonsalaried production and maintenance employees of that producer. The District 11 director of the United States Steelworkers of America, on advice of each local employee president, shall select the employee members. In nonorganized operations, the employee committee shall be elected by the nonsalaried production and maintenance employees. The review must be completed no later than six months after the producer presents a proposal for expenditure of the funds to the committee. The funds held pursuant to this section may be released only for workforce development, concurrent reclamation, plant and stationary mining equipment, facilities for the producer, or for research and development in Minnesota on new mining, taconite, iron, or steel production technology, but only if the producer provides a matching expenditure equal to the amount of the distribution to be used for the same purpose. If a proposed expenditure is not approved by the commissioner, after consultation with the advisory board, the funds must be deposited in the taconite environmental protection fund under sections 298.222 to 298.225. If a taconite production facility is sold after operations at the facility had ceased, any money remaining in the fund for the former producer may be released to the purchaser of the facility on the terms otherwise applicable to the former producer under this section. If a producer fails to provide matching funds for a proposed expenditure within six months after the commissioner approves release of the funds, the funds may be released by the commissioner for deposit in the taconite area environmental protection fund created in section 298.223. Any portion of the fund which is not released by the commissioner within one year of its deposit in the fund shall be distributed to the taconite environmental protection fund.",
	"repealed": false
}