{
	"id": "515B.3-107",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.3-107",
	"title": "515B.3-107 UPKEEP OF COMMON INTEREST COMMUNITY.",
	"text": "(a) Except to the extent provided by the declaration, this subsection or section 515B.3-113, the association is responsible for the maintenance, repair and replacement of the common elements, and each unit owner is responsible for the maintenance, repair and replacement of the unit owner's unit. Damage to the common elements or any unit as a result of the acts or omissions of a unit owner or the association, including damage resulting from the unit owner's or association's lack of maintenance or failure to perform necessary repairs or replacement, is the responsibility of the unit owner or association responsible for causing the damage, or whose agents or invitees caused the damage.\n(b) The association's board of directors shall prepare and approve a written preventative maintenance plan, maintenance schedule, and maintenance budget for the common elements. The association shall follow the approved preventative maintenance plan. The association's board may amend, modify, or replace an approved preventative maintenance plan or an approved maintenance schedule from time to time. The association must provide all unit owners with a paper copy, electronic copy, or electronic access to the preventative maintenance plan, the maintenance schedule, and any amendments or modifications to or replacements of the preventative maintenance plan and the maintenance schedule. If a common interest community was created on or before August 1, 2017, the association's board of directors shall have until January 1, 2019, to comply with the requirements of this subsection.\n(c) The association shall have access through and into each unit for purposes of performing maintenance, repair or replacement for which the association may be responsible. The association and any public safety personnel shall also have access for purposes of abating or correcting any condition in the unit which violates any governmental law, ordinance or regulation, which may cause material damage to or jeopardize the safety of the common interest community, or which may constitute a health or safety hazard for occupants of units.\n(d) Neither the association, nor any unit owner other than the declarant or its affiliates, is subject to a claim for payment of expenses incurred in connection with any additional real estate.",
	"repealed": false
}