{
	"id": "297A.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.84",
	"title": "297A.84 PERMITS ISSUED AND NOT ISSUED; CANCELLATION.",
	"text": "(a) The following definitions apply for the purposes of this section.\n(b) \"Applicant\" means an individual, corporation, or partnership. Applicant also includes any officer of a corporation or member of a partnership.\n(c) \"Delinquent sales tax\" means tax not paid by the date the tax was due and payable under section 289A.20, subdivision 4, or an assessment not paid if the applicant has been issued an order assessing sales and use tax under section 270C.33, subdivision 4.\nExcept as provided in subdivision 3, the commissioner must issue a permit to each applicant who has complied with section 297A.83, and with section 297A.92 if security is required. A person is considered to have a permit if the person has a Minnesota tax identification number issued by the commissioner that is currently active for taxes imposed by this chapter. A permit is valid until canceled or revoked. It is not assignable and is valid only for the person in whose name it is granted and for the transaction of business at the places designated on the permit.\n(a) Except as provided in paragraph (b), the commissioner must not issue a permit to an applicant if the applicant is liable for delinquent sales tax.\n(b) The commissioner must issue a permit to an applicant if an appeal period of an order assessing sales tax under section 270C.33, subdivision 5, has not ended. The commissioner may cancel a permit issued under this paragraph in the manner provided in subdivision 4 if the applicant owes delinquent sales tax after the appeal period has ended.\n(a) If the commissioner issues a permit that does not conform with the requirements of this section or applicable rules, the commissioner may cancel the permit upon notice to the permit holder. The notice must be served by first class and certified mail at the permit holder's last known address. The cancellation is effective immediately.\n(b) If a permit holder shows that a canceled permit was issued in conformance with the requirements of this section and applicable rules, the commissioner must reissue the permit.",
	"repealed": false
}