{
	"id": "62D.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.08",
	"title": "62D.08 ANNUAL REPORT.",
	"text": "A health maintenance organization shall, unless otherwise provided for by rules adopted by the commissioner of health, file notice with the commissioner of health prior to any modification of the operations or documents described in the information submitted under clauses (a), (b), (e), (f), (g), (i), (j), (l), (m), (n), (o), (p), (q), (r), (s), and (t) of section 62D.03, subdivision 4. If the commissioner of health does not disapprove of the filing within 60 days, it shall be deemed approved and may be implemented by the health maintenance organization.\nEvery health maintenance organization shall annually, on or before April 1, file a verified report with the commissioner of health covering the preceding calendar year. However, utilization data required under subdivision 3, clause (c), shall be filed on or before July 1.\nSuch report shall be on forms prescribed by the commissioner of health, and shall include:\n(a) a financial statement of the organization, including its balance sheet and receipts and disbursements for the preceding year certified by an independent certified public accountant, reflecting at least (1) all prepayment and other payments received for health care services rendered, (2) expenditures to all providers, by classes or groups of providers, and insurance companies or nonprofit health service plan corporations engaged to fulfill obligations arising out of the health maintenance contract, (3) expenditures for capital improvements, or additions thereto, including but not limited to construction, renovation or purchase of facilities and capital equipment, and (4) a supplementary statement of assets, liabilities, premium revenue, and expenditures for risk sharing business under section 62D.04, subdivision 1, on forms prescribed by the commissioner;\n(b) the number of new enrollees enrolled during the year, the number of group enrollees and the number of individual enrollees as of the end of the year and the number of enrollees terminated during the year;\n(c) a summary of information compiled pursuant to section 62D.04, subdivision 1, clause (c), in such form as may be required by the commissioner of health;\n(d) a report of the names and addresses of all persons set forth in section 62D.03, subdivision 4, clause (c), who were associated with the health maintenance organization or the major participating entity during the preceding year, and the amount of wages, expense reimbursements, or other payments to such individuals for services to the health maintenance organization or the major participating entity, as those services relate to the health maintenance organization, including a full disclosure of all financial arrangements during the preceding year required to be disclosed pursuant to section 62D.03, subdivision 4, clause (d);\n(e) a separate report addressing health maintenance contracts sold to individuals covered by Medicare, title XVIII of the Social Security Act, as amended, including the information required under section 62D.30, subdivision 6;\n(f) data on the number of complaints received and the category of each complaint as defined by the commissioner. The categories must include access, communication and behavior, health plan administration, facilities and environment, coordination of care, and technical competence and appropriateness. The commissioner, in consultation with interested stakeholders, shall define complaint categories to be used by each health maintenance organization by July 1, 2017, and the categories must be used by each health maintenance organization beginning calendar year 2018; and\n(g) such other information relating to the performance of the health maintenance organization as is reasonably necessary to enable the commissioner of health to carry out the duties under sections 62D.01 to 62D.30.\nAny health maintenance organization which fails to file a verified report with the commissioner on or before April 1 of the year due shall be subject to the levy of a fine up to $500 for each day the report is past due. This failure will serve as a basis for other disciplinary action against the organization, including suspension or revocation, in accordance with sections 62D.15 to 62D.17. The commissioner may grant an extension of the reporting deadline upon good cause shown by the health maintenance organization. Any fine levied or disciplinary action taken against the organization under this subdivision is subject to the contested case and judicial review provisions of sections 14.57 to 14.69.\nAny cancellation or discontinuance of any contract or agreement listed in section 62D.03, subdivision 4, clause (e), or listed subsequently in accordance with this subdivision, shall be reported to the commissioner 120 days before the effective date. When the health maintenance organization terminates a provider for cause, death, disability, or loss of license, the health maintenance organization must notify the commissioner within ten working days of the date the health maintenance organization sends out or receives the notice of cancellation, discontinuance, or termination. Any health maintenance organization which fails to notify the commissioner within the time periods prescribed in this subdivision shall be subject to the levy of a fine up to $200 per contract for each day the notice is past due, accruing up to the date the organization notifies the commissioner of the cancellation or discontinuance. Any fine levied under this subdivision is subject to the contested case and judicial review provisions of chapter 14. The levy of a fine does not preclude the commissioner from using other penalties described in sections 62D.15 to 62D.17.\nA health maintenance organization shall submit to the commissioner unaudited financial statements of the organization for the first three quarters of the year on forms prescribed by the commissioner. The statements are due 30 days after the end of the quarter and shall be maintained as nonpublic data, as defined by section 13.02, subdivision 9. Unaudited financial statements for the fourth quarter shall be submitted at the request of the commissioner.\n(a) Every health maintenance organization must directly allocate administrative expenses to specific lines of business or products when such information is available. Remaining expenses that cannot be directly allocated must be allocated based on other methods, as recommended by the Advisory Group on Administrative Expenses. Health maintenance organizations must submit this information, including administrative expenses for dental services, using the reporting template provided by the commissioner of health.\n(b) Every health maintenance organization must allocate investment income based on cumulative net income over time by business line or product and must submit this information, including investment income for dental services, using the reporting template provided by the commissioner of health.",
	"repealed": false
}