{
	"id": "298.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/298.001",
	"title": "298.001 DEFINITIONS.",
	"text": "As used in this chapter, the terms defined in this section have the meanings given in this section.\n\"City\" includes any home rule charter city, statutory city, or any city however organized.\n\"Person\" means individuals, fiduciaries, estates, trusts, partnerships, companies, joint stock companies, corporations, and all associations.\n\"Producer\" means a person engaged in the business of mining or producing iron ore, taconite concentrate, or direct reduced ore in this state.\n\"Taconite\" means ferruginous chert or ferruginous slate in the form of compact, siliceous rock, in which the iron oxide is so finely disseminated that substantially all of the iron-bearing particles of merchantable grade are smaller than 20 mesh and which is not merchantable as iron ore in its natural state, and which cannot be made merchantable by simple methods of beneficiation involving only crushing, screening, washing, jigging, drying, or any combination thereof.\n\"Iron sulphides\" means chemical combinations of iron and sulphur (mineralogically known as pyrrhotite, pyrites, or marcasite), in relatively impure condition, which are not merchantable as iron ore and which cannot be made merchantable by the simple methods of beneficiation above described.\n\"Semitaconite\" means altered iron formation, altered taconite, ferruginous chert, or ferruginous slate which has been oxidized and partially leached and in which the iron oxide is so finely disseminated that substantially all of the iron-bearing particles of merchantable grade are smaller than 20 mesh and which is not merchantable as iron ore in its natural state, and which cannot be made merchantable by simple methods of beneficiation involving only crushing, screening, washing, jigging, heavy media separation, spirals, cyclones, drying, or any combination thereof.\n\"Agglomerates\" means the merchantable iron ore aggregates which are produced by agglomeration.\n\"Commissioner\" means the commissioner of revenue of the state of Minnesota, except that when used in sections 298.22 to 298.227 and 298.291 to 298.297, \"commissioner\" means the commissioner of Iron Range resources and rehabilitation.\n\"Other iron-bearing material\" means the material described in section 298.405.\n\"Refining\" means and is limited to refining:\n(1) of ores, metals, or mineral products, the mining, extraction, or quarrying of which were subject to tax under section 298.015; and\n(2) carried out by the entity, or an affiliated entity, that mined, extracted, or quarried the metal or mineral products.\n\"Direct reduced ore\" means ore that results in a product that has an iron content of at least 75 percent.\n\"Advisory board\" means the Iron Range Resources and Rehabilitation Board, as established under section 298.22. The acronym \"IRRRB\" means the advisory board.\n\"Merchantable iron ore concentrate\" means iron-bearing material that has been treated in Minnesota by any means of beneficiation, separation, concentration, or refinement for the purpose of making it salable for its iron ore content.",
	"repealed": false
}