{
	"id": "84.9256",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.9256",
	"title": "84.9256 YOUTHFUL OPERATORS; PROHIBITIONS.",
	"text": "(a) Except for operation on public road rights-of-way that is permitted under section 84.928 and as provided under paragraph (j), a driver's license issued by the state or another state is required to operate an all-terrain vehicle along or on a public road right-of-way.\n(b) A person under 12 years of age shall not:\n(1) make a direct crossing of a public road right-of-way;\n(2) operate an all-terrain vehicle on a public road right-of-way in the state; or\n(3) operate an all-terrain vehicle on public lands or waters, except as provided in paragraph (f).\n(c) Except for public road rights-of-way of interstate highways, a person 12 years of age but less than 16 years may make a direct crossing of a public road right-of-way of a trunk, county state-aid, or county highway or operate on public lands and waters or state or grant-in-aid trails, only if that person possesses a valid all-terrain vehicle safety certificate issued by the commissioner and is accompanied by a person 18 years of age or older who holds a valid driver's license.\n(d) To be issued an all-terrain vehicle safety certificate, a person at least 12 years old, but less than 16 years old, must:\n(1) successfully complete the safety education and training program under section 84.925, subdivision 1, including a riding component; and\n(2) be able to properly reach and control the handle bars and reach the foot pegs while sitting upright on the seat of the all-terrain vehicle.\n(e) A person at least ten years of age may take the safety education and training program and may receive an all-terrain vehicle safety certificate under paragraph (d), but the certificate is not valid until the person reaches age 12.\n(f) A person at least ten years of age but under 12 years of age may operate an all-terrain vehicle with an engine capacity up to 110cc if the vehicle is a class 1 all-terrain vehicle with straddle-style seating or up to 170cc if the vehicle is a class 1 all-terrain vehicle with side-by-side-style seating on public lands or waters if accompanied by a parent or legal guardian.\n(g) A person under 15 years of age shall not operate a class 2 all-terrain vehicle.\n(h) A person under the age of 16 may not operate an all-terrain vehicle on public lands or waters or on state or grant-in-aid trails if the person cannot properly reach and control:\n(1) the handle bars and reach the foot pegs while sitting upright on the seat of the all-terrain vehicle with straddle-style seating; or\n(2) the steering wheel and foot controls of a class 1 all-terrain vehicle with side-by-side-style seating while sitting upright in the seat with the seat belt fully engaged.\n(i) Notwithstanding paragraph (c), a nonresident at least 12 years old, but less than 16 years old, may make a direct crossing of a public road right-of-way of a trunk, county state-aid, or county highway or operate an all-terrain vehicle on public lands and waters or state or grant-in-aid trails if:\n(1) the nonresident youth has in possession evidence of completing an all-terrain safety course offered by the ATV Safety Institute or another state as provided in section 84.925, subdivision 3; and\n(2) the nonresident youth is accompanied by a person 18 years of age or older who holds a valid driver's license.\n(j) A person 12 years of age but less than 16 years of age may operate an all-terrain vehicle on the roadway, bank, slope, or ditch of a public road right-of-way as permitted under section 84.928 if the person:\n(1) possesses a valid all-terrain vehicle safety certificate issued by the commissioner; and\n(2) is accompanied by a parent or legal guardian on a separate all-terrain vehicle.\n(a) A person less than 18 years of age shall not ride as a passenger or as an operator of an all-terrain vehicle on public land, public waters, or on a public road right-of-way unless wearing a safety helmet approved by the commissioner of public safety.\n(b) A person less than 18 years of age shall not ride as a passenger or as an operator of an all-terrain vehicle without wearing a seat belt when provided by the manufacturer.\nA person under age 16 shall not operate and a person shall not allow a person under age 16 to operate an all-terrain vehicle, unless the parent or guardian of the person under age 16 authorizes the operation. For purposes of this subdivision, \"guardian\" means the legal guardian of the person under age 16 or a person age 18 or older who has been authorized by the parent or legal guardian to supervise the person under age 16.\nIt is unlawful for any person who is in lawful control of an all-terrain vehicle to permit it to be operated contrary to this section.\nWhen the judge of a juvenile court, or its duly authorized agent, determines that a person, while less than 18 years of age, has violated sections 84.92 to 84.928, or other state or local law or ordinance regulating the operation of an all-terrain vehicle, the judge or duly authorized agent shall immediately report the determination to the commissioner and (1) may recommend the suspension of the person's all-terrain vehicle safety certificate, or (2) may recommend to the commissioner of public safety, the suspension of the person's driver's license. The commissioner may suspend the certificate without a hearing.",
	"repealed": false
}