{
	"id": "504B.345",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.345",
	"title": "504B.345 JUDGMENT; EXECUTION.",
	"text": "(a) If the court or jury finds for the plaintiff, the court shall immediately enter judgment that the plaintiff shall have recovery of the premises, and shall tax the costs against the defendant. The court shall issue execution in favor of the plaintiff for the costs and also immediately issue a writ of recovery of premises and order to vacate.\n(b) The court shall give priority in issuing a writ of recovery of premises and order to vacate for an eviction action brought under section 504B.171 or on the basis that the tenant is causing a nuisance or seriously endangers the safety of other residents, their property, or the landlord's property.\n(c) If the court or jury finds for the defendant, then the court:\n(1) shall enter judgment for the defendant, tax the costs against the plaintiff, and issue execution in favor of the defendant; and\n(2) shall expunge the records relating to the action under the provisions of section 484.014 or under the court's inherent authority at the time judgment is entered or after that time upon motion of the defendant.\n(d) Except in actions brought: (1) under section 504B.171; or (2) on the basis that the residential tenant engages in behavior that seriously endangers the safety of other residents, or intentionally and seriously damages the property of the landlord or a tenant, the court shall stay the writ of recovery of premises and order to vacate for a reasonable period, not to exceed seven days. This paragraph does not apply when the court has issued a default judgment.\nIf the court enters judgment for the plaintiff in an action brought under section 504B.291 as required by section 609.5317, subdivision 1, the court may not stay issuance of the writ of recovery of premises and order to vacate unless the court makes written findings specifying the extraordinary and exigent circumstances that warrant staying the writ for a reasonable period, not to exceed seven days.\nAny party may bring a motion to vacate a judgment in an eviction action. An order denying a motion to vacate a judgment is considered a judgment for purposes of appeal under section 504B.371.",
	"repealed": false
}