{
	"id": "144.562",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.562",
	"title": "144.562 SWING BED APPROVAL; ISSUANCE OF LICENSE CONDITIONS.",
	"text": "For the purposes of this section, \"swing bed\" means a hospital bed licensed under sections 144.50 to 144.56 that has been granted a license condition under this section and which has been certified to participate in the federal Medicare program under United States Code, title 42, section 1395 (tt).\n(a) A hospital is not eligible to receive a license condition for swing beds unless (1) it either has a licensed bed capacity of less than 50 beds defined in the federal Medicare regulations, Code of Federal Regulations, title 42, section 482.66, or it has a licensed bed capacity of 50 beds or more and has swing beds that were approved for Medicare reimbursement before May 1, 1985, or it has a licensed bed capacity of less than 65 beds and the available nursing homes within 50 miles have had, in the aggregate, an average occupancy rate of 96 percent or higher in the most recent two years as documented on the statistical reports to the Department of Health; and (2) it is located in a rural area as defined in the federal Medicare regulations, Code of Federal Regulations, title 42, section 482.66.\n(b) Except for those critical access hospitals established under section 144.1483, clause (9), and section 1820 of the federal Social Security Act, United States Code, title 42, section 1395i-4, that have an attached nursing home or that owned a nursing home located in the same municipality as of May 1, 2005, eligible hospitals are allowed a total number of days of swing bed use per year as provided in paragraph (c). Critical access hospitals that have an attached nursing home or that owned a nursing home located in the same municipality as of May 1, 2005, are allowed swing bed use as provided in federal law.\n(c) An eligible hospital is allowed a total of 3,000 days of swing bed use in calendar year 2020. Beginning in calendar year 2021, and for each subsequent calendar year until calendar year 2027, the total number of days of swing bed use per year is increased by 200 swing bed use days. Beginning in calendar year 2028, an eligible hospital is allowed a total of 4,500 days of swing bed use per year.\n(d) Days of swing bed use for medical care that an eligible hospital has determined are charity care shall not count toward the applicable limit in paragraph (b) or (c). For purposes of this paragraph, \"charity care\" means care that an eligible hospital provided for free or at a discount to persons who cannot afford to pay and for which the eligible hospital did not expect payment.\n(e) Days of swing bed use for care of a person who has been denied admission to every Medicare-certified skilled nursing facility within 25 miles of the eligible hospital shall not count toward the applicable limit in paragraphs (b) and (c). Eligible hospitals must maintain documentation that they have contacted each skilled nursing facility within 25 miles to determine if any skilled nursing facility beds are available and if the skilled nursing facilities are willing to admit the patient. Skilled nursing facilities that are contacted must admit the patient or deny admission within 24 hours of being contacted by the eligible hospital. Failure to respond within 24 hours is deemed a denial of admission.\n(f) Except for critical access hospitals that have an attached nursing home or that owned a nursing home located in the same municipality as of May 1, 2005, the commissioner of health may approve swing bed use beyond 2,000 days as long as there are no Medicare certified skilled nursing facility beds available within 25 miles of that hospital that are willing to admit the patient and the patient agrees to the referral being sent to the skilled nursing facility. Critical access hospitals exceeding 2,000 swing bed days must maintain documentation that they have contacted skilled nursing facilities within 25 miles to determine if any skilled nursing facility beds are available that are willing to admit the patient and the patient agrees to the referral being sent to the skilled nursing facility. This paragraph expires January 1, 2020.\n(g) After reaching 2,000 days of swing bed use in a year, an eligible hospital to which this limit applies may admit six additional patients to swing beds each year without seeking approval from the commissioner or being in violation of this subdivision. These six swing bed admissions are exempt from the limit of 2,000 annual swing bed days for hospitals subject to this limit. This paragraph expires January 1, 2020.\n(h) A health care system that is in full compliance with this subdivision may allocate its total limit of swing bed days among the hospitals within the system, provided that no hospital in the system without an attached nursing home may exceed 2,000 swing bed days per year. This paragraph expires January 1, 2020.\n(a) The commissioner of health shall approve a license condition for swing beds if the hospital meets all of the criteria of this subdivision.\n(b) The hospital must meet the eligibility criteria in subdivision 2.\n(c) The hospital must be in compliance with the Medicare conditions of participation for swing beds under Code of Federal Regulations, title 42, section 482.66.\n(d) The hospital must agree, in writing, to limit the length of stay of a patient receiving services in a swing bed to not more than 40 days, or the duration of Medicare eligibility, unless the commissioner of health approves a greater length of stay in an emergency situation. To determine whether an emergency situation exists, the commissioner shall require the hospital to provide documentation that continued services in the swing bed are required by the patient; that no skilled nursing facility beds are available within 25 miles from the patient's home, or in some more remote facility of the resident's choice, that can provide the appropriate level of services required by the patient; and that other alternative services are not available to meet the needs of the patient. If the commissioner approves a greater length of stay, the hospital shall develop a plan providing for the discharge of the patient upon the availability of a nursing home bed or other services that meet the needs of the patient. Permission to extend a patient's length of stay must be requested by the hospital at least ten days prior to the end of the maximum length of stay.\n(e) The hospital must agree, in writing, to limit admission to a swing bed only to (1) patients who have been hospitalized and not yet discharged from the facility, or (2) patients who are transferred directly from an acute care hospital.\n(f) The hospital must agree, in writing, to report to the commissioner of health by December 1, 1985, and annually thereafter, in a manner required by the commissioner (1) the number of patients readmitted to a swing bed within 60 days of a patient's discharge from the facility, (2) the hospital's charges for care in a swing bed during the reporting period with a description of the care provided for the rate charged, and (3) the number of beds used by the hospital for transitional care and similar subacute inpatient care.\n(g) The hospital must agree, in writing, to report statistical data on the utilization of the swing beds on forms supplied by the commissioner. The data must include the number of swing beds, the number of admissions to and discharges from swing beds, Medicare reimbursed patient days, total patient days, and other information required by the commissioner to assess the utilization of swing beds.\nThe commissioner of health shall issue a license condition to a hospital that complies with subdivisions 2 and 3. The license condition must be granted when the license is first issued, when it is renewed, or during the hospital's licensure year. The condition is valid for the hospital's licensure year. The license condition can be renewed at the time of the hospital's license renewal if the hospital complies with subdivisions 2 and 3.\nNotwithstanding section 144.55, subdivision 4, the commissioner of health may conduct inspections of a hospital granted a condition under this section to assess compliance with this section.\nNotwithstanding section 144.55, subdivision 4, if the hospital fails to comply with subdivision 2 or 3, the commissioner of health shall issue a correction order and penalty assessment under section 144.653 or may suspend, revoke, or refuse to renew the license condition under section 144.55, subdivision 6. The penalty assessment for a violation of subdivision 2 or 3 is $500.\n[Obsolete]",
	"repealed": false
}