{
	"id": "118A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/118A.09",
	"title": "118A.09 ADDITIONAL LONG-TERM EQUITY INVESTMENT AUTHORITY.",
	"text": "(a) \"Qualifying government\" means:\n(1) a county or statutory or home rule charter city with a population of more than 100,000; or\n(2) a county or statutory or home rule charter city whose most recent long-term, senior, general obligation rating by one or more national rating organizations in the prior 18-month period is AA or higher.\n(b) A county or statutory or home rule charter city with a population of 100,000 or less that is a qualifying government, but subsequently does not meet the threshold under paragraph (a), clause (2), may not invest additional funds under this section during any time period when it does not meet the threshold, but may continue to manage funds previously invested under subdivision 2.\nQualifying governments may invest the amount described in subdivision 3:\n(1) in index mutual funds based in the United States and indexed to a broad market United States equity index, on the condition that index mutual fund investments must be made directly with the main sales office of the fund; or\n(2) with the Minnesota State Board of Investment subject to such terms and minimum amounts as may be adopted by the board.\n(a) Qualifying governments may only invest under subdivision 2 according to the limitations in this subdivision. A qualifying government under subdivision 1, clause (1) or (2), may only invest its funds that are held for long-term capital plans authorized by the city council or county board, or long-term obligations of the qualifying government. Long-term obligations of the qualifying government include long-term capital plan reserves, funds held to offset long-term environmental exposure, other postemployment benefit liabilities, compensated absences, and other long-term obligations established by applicable accounting standards.\n(b) Qualifying governments under subdivision 1, clause (1) or (2), may invest up to 15 percent of the sum of:\n(1) unassigned cash;\n(2) cash equivalents;\n(3) deposits; and\n(4) investments.\n(c) The calculation in paragraph (b) must be based on the qualifying government's most recent audited statement of net position, which must be compliant and audited pursuant to governmental accounting and auditing standards. Once the amount invested reaches 15 percent of the sum of unassigned cash, cash equivalents, deposits, and investments, no further funds may be invested under this section; however, a qualifying government may continue to manage the funds previously invested under this section even if the total amount subsequently exceeds 15 percent of the sum of unassigned cash, cash equivalents, deposits, and investments.\nBefore investing pursuant to this section, the governing body of the qualifying government must adopt a resolution that includes the following statements:\n(1) the governing body understands that investments under subdivision 2 have a risk of loss;\n(2) the governing body understands the type of funds that are being invested and the specific investment itself; and\n(3) the governing body certifies that all funds designated for investment through the State Board of Investment meet the requirements of this section and the policies and procedures established by the State Board of Investment.\nA qualifying government exercising authority under this section to invest amounts with the State Board of Investment shall establish an account with the Public Employees Retirement Association (PERA), which shall act as the account administrator.\nThe account established under subdivision 5 may only be used for the purposes provided under subdivision 3. PERA may rely on representations made by the qualifying government in exercising its duties as account administrator and has no duty to further verify qualifications, use, or intended use of the funds that are invested or withdrawn.\n(a) A qualifying government may establish an account to be held under the supervision of PERA for the purposes of investing funds with the State Board of Investment under subdivision 2. PERA shall establish a separate account for each qualifying government. PERA may charge participating qualifying governments a fee for reasonable administrative costs. The amount of any fee charged by PERA is annually appropriated to the association from the account. PERA may establish other reasonable terms and conditions for creation and maintenance of these accounts.\n(b) PERA must report to the qualifying government on the investment returns of invested funds and on all investment fees or costs incurred by the account.\n(a) The assets of an account shall be invested and held as required by this subdivision.\n(b) PERA must certify all money in the accounts for which it is account administrator to the State Board of Investment for investment under section 11A.14, subject to the policies and procedures established by the State Board of Investment. Investment earnings must be credited to the account of the individual qualifying government.\n(c) For accounts invested by the State Board of Investment, the investment restrictions shall be the same as those generally applicable to the State Board of Investment.\n(d) A qualifying government may provide investment direction to PERA, subject to the policies and procedures established by the State Board of Investment.\n(a) A government may withdraw some or all of its money or terminate the account.\n(b) A government requesting withdrawal of money from an account created under this section must do so at a time and in the manner required by the executive director of PERA, subject to the policies and procedures established by the State Board of Investment.",
	"repealed": false
}