{
	"id": "62N.27",
	"url": "https://www.revisor.mn.gov/statutes/cite/62N.27",
	"title": "62N.27 DEFINITIONS.",
	"text": "For purposes of sections 62N.27 to 62N.32, the terms defined in this section have the meanings given. Other terms used in those sections have the meanings given in sections 62D.041, 62D.042, and 62D.044.\n\"Net worth\" means admitted assets as defined in subdivision 3, minus liabilities. Liabilities do not include those obligations that are subordinated in the same manner as preferred ownership claims under section 60B.44, subdivision 10. For purposes of this subdivision, preferred ownership claims under section 60B.44, subdivision 10, include promissory notes subordinated to all other liabilities of the community integrated service network.\n\"Admitted assets\" means admitted assets as defined in section 62D.044, except that real estate investments allowed by section 62D.045 are not admitted assets. Admitted assets include the deposit required under section 62N.32.\n\"Accredited capitated provider\" means a health care providing entity that:\n(1) receives capitated payments from a community network under a contract to provide health services to the network's enrollees. For purposes of this section, a health care providing entity is \"capitated\" when its compensation arrangement with a network involves the provider's acceptance of material financial risk for the delivery of a predetermined set of services for a specified period of time;\n(2) is licensed to provide and provides the contracted services, either directly or through an affiliate. For purposes of this section, an \"affiliate\" is any person that directly or indirectly controls, is controlled by, or is under common control with the health care providing entity, and \"control\" exists when any person, directly or indirectly, owns, controls, or holds the power to vote or holds proxies representing no less than 80 percent of the voting securities or governance rights of any other person;\n(3) agrees to serve as an accredited capitated provider of a community network or for the purpose of reducing the network's net worth and deposit requirements under section 62N.28; and\n(4) is approved by the commissioner as an accredited capitated provider for a community network in accordance with section 62N.31.\n\"Percentage of risk ceded\" means the ratio, expressed as a percentage, between capitated payments made or, in the case of a new entity, expected to be made by a community network to all accredited capitated providers during any contract year and the total premium revenue, adjusted to eliminate expected administrative costs, received for the same time period by the community network.\n\"Provider amount at risk\" means a dollar amount certified by a qualified actuary to represent the expected direct costs to an accredited capitated provider for providing the contracted, covered health care services to the enrollees of the network to which it is accredited for a period of 120 days.",
	"repealed": false
}