{
	"id": "296A.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/296A.21",
	"title": "296A.21 STATUTE OF LIMITATIONS.",
	"text": "(a) The commissioner shall make determinations, corrections, assessments, and refunds with respect to taxes and fees under this chapter, including interest, additions to taxes, and assessable penalties. Except as otherwise provided in this section, the amount of taxes assessable must be assessed within 3-1/2 years after the date the return is filed. For purposes of this section, a tax return filed before the last day prescribed by law for filing is considered to be filed on the last day.\n(b) A claim for a refund of an overpayment of state tax or fees must be filed within 3-1/2 years from the date prescribed for filing the return, plus any extension of time granted for filing the return, but only if filed within the extended time; or the claim must be filed within one year from the date of an order assessing tax or fees, or from the date of a return filed by the commissioner, upon payment in full of the tax, fees, penalties, and interest shown on the order or return, whichever period expires later.\nNo action shall be brought for the collection of delinquent taxes and fees under section 270C.61 unless commenced within five years after the date of assessment of the taxes and fees.\nIn the case of a false or fraudulent report with intent to evade taxes or fees or of a failure to file a report, the taxes or fees may be assessed at any time, and a proceeding in court for their collection must be begun within five years after the assessment.\nNotwithstanding subdivision 1, paragraph (b), no refund under section 296A.16, subdivision 2, shall be made unless the claim for refund and invoice are filed with the commissioner within one year from the date of purchase.\nThe period of time during which a tax or fee must be assessed under this chapter or collection proceedings commenced under subdivision 2 or 3 is suspended during the period from the date of filing of a petition in bankruptcy until 30 days after the commissioner of revenue receives notice that the bankruptcy proceedings have been closed or dismissed or the automatic stay has been terminated or has expired. The suspension of the statute of limitations under this subdivision applies to the person against whom the petition in bankruptcy is filed and all other persons who may also be wholly or partially liable for the tax under this chapter.",
	"repealed": false
}