{
	"id": "223.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/223.16",
	"title": "223.16 DEFINITIONS.",
	"text": "For the purpose of sections 223.15 to 223.23, the terms defined in this section have the meanings given them.\n\"Bond\" means an obligation acceptable to and running to the state, as obligee, for the purpose of indemnifying producers of grain against the breach of a contract by a grain buyer.\n(a) \"Cash sale\" means a sale that is not reduced to writing as a voluntary extension of credit contract and for which payment is tendered to the seller not later than the close of business on the next business day after the sale, either in cash or by check, or by mailing or wiring funds to the seller's account.\n(b) For the purposes of this subdivision, \"cash\" means currency or an equivalent manner of payment including but not limited to a certified check; a cashier's check; and a postal, bank, or express money order in which the amount of payment is verified and secured before issuance.\n\"Commissioner\" means the commissioner of agriculture or the commissioner's designee.\n\"Electronic document\" means a document that is generated, sent, received, or stored by electronic, optical, or similar means, including electronic data interchange, electronic mail, telegram, telex, or telecopy. \"Electronic document\" includes, but is not limited to, grain purchase contracts and voluntary extension of credit contracts.\n\"Electronic signature\" means an electronic sound, symbol, or process attached to or logically associated with a record and executed or adopted by a person with the intent to sign the record.\n\"Failure\" means a determination by the commissioner that a grain buyer or grain warehouse has failed to pay for delivered grain, breached a contract, breached more than one contract, or failed to redeliver stored grain to a producer.\n\"Grain\" means all products commonly referred to as grain, including wheat, corn, oats, barley, rye, rice, soybeans, emmer, sorghum, triticale, millet, pulses, dry edible beans, sunflower seed, rapeseed, canola, safflower, flaxseed, mustard seed, crambe, sesame seed, and other products ordinarily stored in grain warehouses.\n\"Grain buyer\" means a person who purchases grain for the purpose of reselling the grain or products made from the grain, with the exception of a person who purchases seed grain for crop production or who purchases grain as feed for the person's own livestock.\n\"Grain warehouse\" means an elevator, flour, cereal or feed mill, malthouse or warehouse in which grain belonging to a person other than the warehouse operator is received for purchase or storage.\n[Repealed, 2012 c 244 art 1 s 83]\n[Repealed, 1983 c 374 s 22]\n\"Person\" means a corporation, company, joint stock company or association, partnership, firm or individual and includes their agents, trustees, assignees or duly appointed receivers.\n\"Private grain warehouse operator\" means a person licensed to operate a grain warehouse for the sole purpose of purchasing, handling, processing and shipping grain or its by-products who is not licensed by the commissioner to accept grain belonging to others for storage. \"Private grain warehouse operator\" includes any person licensed under the United States Warehouse Act, United States Code, title 7, chapter 10.\n\"Producer\" means a person who grows grain on land owned or leased by the person.\n\"Public grain warehouse operator\" means a person operating a grain warehouse in which grain belonging to persons other than the grain warehouse operator is accepted for storage or purchase or who offers grain storage or warehouse facilities to the public for hire or a feed-processing plant that receives and stores grain, the equivalent of which it processes and returns to the grain's owner in amounts, at intervals, and with added ingredients that are mutually agreeable to the grain's owner and the person operating the plant.\n\"Scale ticket\" means a memorandum issued by a grain elevator or warehouse operator to a depositor at the time grain is delivered, showing the weight and kind of grain.\n\"Semitrailer\" means a vehicle described in section 168.002, subdivision 30, used to haul grain.\n\"Trailer\" means a vehicle described in section 168.002, subdivision 35, used to haul grain.\n\"Truck\" means a single unit vehicle described in section 168.002, subdivision 37, used to haul grain.\n\"Voluntary extension of credit contract\" means a contract for the purchase of a specific amount of grain from a producer in which the title to the grain passes to the grain buyer upon delivery, but the price is to be determined or payment for the grain is to be made at a date later than the date of delivery of the grain to the grain buyer. Voluntary extension of credit contracts include deferred or delayed payment contracts, unpriced sales, no price established contracts, average pricing contracts, and all other contractual arrangements with the exception of cash sales and grain storage agreements evidenced by a grain warehouse receipt.",
	"repealed": false
}