{
	"id": "168B.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/168B.08",
	"title": "168B.08 DISPOSITION BY IMPOUND LOT.",
	"text": "(a) If an abandoned or unauthorized vehicle taken into custody by a unit of government or any impound lot is not reclaimed under section 168B.07, subdivision 1, it may be disposed of or sold at auction or sale when eligible pursuant to sections 168B.06 and 168B.07. If the contents of an abandoned or unauthorized vehicle taken into custody by a unit of government or any impound lot is not reclaimed under section 168B.07, subdivision 3, it may be disposed of or sold at auction or sale when eligible pursuant to sections 168B.06 and 168B.07.\n(b) The purchaser shall be given a receipt in a form prescribed by the registrar of motor vehicles which shall be sufficient title to dispose of the vehicle. The receipt shall also entitle the purchaser to register the vehicle and receive a certificate of title, free and clear of all liens and claims of ownership. Before such a vehicle is issued a new certificate of title it must receive a motor vehicle safety check.\nAbandoned or junk vehicles not sold by units of government or public impound lots pursuant to subdivision 1 shall be disposed of in accordance with section 168B.09.\nFrom the proceeds of a sale under this section by a unit of government or public impound lot of an abandoned or unauthorized motor vehicle, the unit of government shall reimburse itself for the cost of towing, preserving and storing the vehicle, and all administrative, notice and publication costs incurred in handling the vehicle pursuant to sections 168B.01 to 168B.101. Any remainder from the proceeds of a sale shall be held for the owner of the vehicle or entitled lienholder for 90 days and then shall be deposited in the treasury of the unit of government.\nThe operator of a nonpublic impound lot may retain any proceeds derived from a sale conducted under the authority of subdivision 1. The operator may retain all proceeds from sale of any personal belongings and contents in the vehicle that were not claimed by the owner or the owner's agent before the sale, except that any suspected contraband or other items that likely would be subject to forfeiture in a criminal trial must be turned over to the appropriate law enforcement agency.",
	"repealed": false
}