{
	"id": "161.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.16",
	"title": "161.16 HIGHWAY DESIGNATION, VACATION, REVERSION, SURVEY.",
	"text": "Until such time as the commissioner definitely locates and constructs the several routes of the trunk highway system, the commissioner shall select practicable existing roads along the general location of such routes and shall maintain them for the benefit of the traveling public. Such roads shall be known as temporary trunk highways. The road authority which had jurisdiction over such road shall, thereupon, be relieved of responsibilities thereto; provided, however, if the definite location of the route shall be other than the location of the temporary trunk highway, the portion of the temporary locations which is not included in the definite location shall, upon notice of the commissioner, revert to the road authority unless the same lies within the corporate limits of a city, in which case it shall become a street of the city, provided that when the portion of the temporary location, which is not included in the definite location lies within a city having a population of less than 5,000, that portion shall revert to the county if it meets the criteria for a county state-aid highway.\nThe commissioner shall by order or orders designate such temporary trunk highways, and on determining the definite location of any trunk highway or portion thereof, the same shall also be designated by order or orders. The definite location of such highway or portion thereof may be in the form of a map or plat showing the lands and interests in lands required for trunk highway purposes. Formal determination or order if by map or plat, shall be certified by the commissioner of transportation on said map or plat. The commissioner may, by similar order or orders, change the definite location of any trunk highway between the fixed termini, as fixed by law, when such changes are necessary in the interest of safety and convenient public travel. The commissioner shall maintain a file of these orders as permanent records.\nWhen the county board of any county requests a public hearing in regard to the definite location or a change in the definite location of any trunk highway within its boundaries, the commissioner shall hold such hearing in such county before making a determination in such matters.\n(a) If the commissioner makes a change in the definite location of a trunk highway as provided in this section, the portion of the existing road that is no longer a part of the trunk highway by reason of the change and all right, title, and interest of the state in the trunk highway shall revert to the road authority originally charged with the care of that trunk highway unless the commissioner, the road authority originally charged with the care of the trunk highway and the road authority of the political subdivision in which the portion is located agree on another disposition, in which case the reversion is as provided in the agreement. When the reversion is to a county and a portion lies partly within a city of under 5,000 population the entire portion shall revert to the county if it meets the criteria for a county state-aid highway.\n(b) If the portion had its origin as a trunk highway, it shall become a county highway unless it lies within the corporate limits of a city, in which case it shall become a street of the city. When the existing road that is no longer a part of the trunk highway by reason of the change lies within a city of less than 5,000 population, the portion shall revert to the county if the portion meets the criteria for a county state-aid highway. In municipalities of over 5,000 population that portion of the road may revert to the county if the appropriate authorities of the state, county and the various cities through which the route passes so agree. Should any city not agree that the portion of the roadway that passes through it shall revert to county jurisdiction, the portion shall not so revert, although the other portions of the roadway in which agreement has been reached shall revert to county jurisdiction. Notwithstanding the other provisions of this chapter or other applicable laws and rules, the commissioner may convey and quitclaim to a county, city, or other political subdivision all or part of the right-of-way of the existing road that is no longer a part of the trunk highway by reason of the commissioner's order or orders. The conveyance shall be for highway purposes, and the future cost of maintenance, improvement, or reconstruction of the highway and the contribution of that highway to the public highway system is reasonable and proper consideration for the conveyance. This subdivision shall apply to all trunk highways reverted before May 29, 1967.\nDamages occasioned by the vacation of any highway or street that had its origin as a trunk highway, if vacated by the county within one year after the commissioner relinquished jurisdiction thereof, shall be paid by the state out of the trunk highway fund. No award of damages determined by the county shall be made for such vacation without the concurrence of the attorney general, and no action brought to recover damages for such vacation shall be settled or otherwise disposed of without the consent of the attorney general. The attorney general may defend any action brought to recover damages for such vacation.\nWhen the definite location of any trunk highway takes the place of and serves the same purpose as any portion of an existing road, however established, the commissioner may make an order vacating such portion of the road. A copy of the order shall be served upon the owners and occupants of the lands on which is located the portion of the road so vacated and, if the road terminates at or abuts upon any public water, a copy of the order also shall be served upon the commissioner of natural resources. The notice under this subdivision is for notification purposes only and does not create a right of intervention by the commissioner of natural resources. A copy of the order, together with proof of service, or affidavit of publication if the owners are unknown or reside outside the state, shall be filed with the county auditor of the county in which such lands lie. Any person claiming to be damaged by the vacation may appeal at any time within 30 days after the service of the order to the district court of the county for a determination of damages, by serving notice of the appeal on the commissioner and filing same with proof of service in the office of the court administrator of the district court. The appeal shall be tried in the same manner as an appeal from an award in proceedings in eminent domain.\n(a) When the physical location of a trunk highway centerline will be changed by order of the commissioner and the commissioner is aware that a property description has been written to the centerline, the commissioner shall file with the recorder in the county where the highway is located a survey of the existing centerline prior to changing or removing the trunk highway.\n(b) The survey of the trunk highway centerline must be prepared on four-mil transparent reproducible film or its equivalent. Sheet size must be 22 inches by 34 inches. A border line must be placed one-half inch inside the outer edge of the sheet on the top and bottom 34-inch sides; and the right 22-inch side; and two inches inside the outer edge of the sheet on the left 22-inch side. If a survey of the trunk highway centerline consists of more than one sheet, the sheets must be numbered consecutively. The survey of the trunk highway centerline must include:\n(1) a graphic depiction of the existing trunk highway centerline;\n(2) distances along the centerline, and ties to the corners of the public land survey, expressed in feet and hundredths of a foot. All straight line segments of the plat must be labeled with the length of the line and bearing or azimuth. All curved line segments of the plat must be labeled with the central angle, arc length, and radius length. If any curve is nontangential, the dimensions must include a long chord bearing or azimuth, and must be labeled nontangential;\n(3) a north arrow and directional orientation note;\n(4) a graphics scale along with the label \"Scale In Feet\";\n(5) the position, description, and ties from the trunk highway centerline to corners of the public land survey;\n(6) identification of the public land survey quarter section or sections, government lot or lots, and the county through which the depicted trunk highway centerline runs; and\n(7) the date of the survey.\n(c) The survey of the trunk highway centerline must be certified by the commissioner of transportation or the commissioner's designated assistant and by a licensed land surveyor.\n(d) Upon submission to the recorder in the county where the depicted trunk highway centerline is located, and upon payment of appropriate fees, the survey of the trunk highway centerline must be filed of record.",
	"repealed": false
}