{
	"id": "62B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/62B.07",
	"title": "62B.07 REGULATION OF RATES AND FORMS.",
	"text": "All policies, certificates of insurance, notices of proposed insurance, applications for insurance, endorsements and riders delivered or issued for delivery in this state and the schedules of premium rates pertaining thereto shall be filed with the commissioner.\nThe commissioner shall within 60 days after the filing of policies, certificates of insurance, notices of proposed insurance, applications for insurance, endorsements and riders, disapprove any such form if the premium rates charged or to be charged are excessive in relation to benefits, or if it contains provisions which are unjust, unfair, inequitable, misleading, deceptive or encourage misrepresentation of the coverage, or are contrary to any provision of the insurance laws or of any rule promulgated thereunder. In order to determine whether the premium to be charged under a particular policy form submitted by an insurer is excessive in relation to benefits, and to facilitate the submission and approval of policy forms and premium rates to be used in connection therewith, the commissioner shall give full consideration to and make reasonable allowances for underwriting expenses including, but not limited to, claim adjustment expenses, general administrative expenses including costs for handling return premiums, compensation to agents, expense allowances to creditors, if any, branch and field expenses and other acquisition costs, the types of policies actually issued and authorized as defined in section 62B.03, clauses (1), (2), (3), (4), (5), and (6), and any and all other factors and trends demonstrated to be relevant. An insurer may support these factors by statistical information, experience, actuarial computations, and/or estimates certified by an executive officer of the insurer, and the commissioner shall give due consideration to such supporting data.\nIf the commissioner notifies the insurer that the form is disapproved, it is unlawful thereafter for the insurer to issue or use it. In the notice, the commissioner shall specify the reason for disapproval and state that a hearing will be granted within 20 days after a request in writing by the insurer. No policy, certificate of insurance, notice of proposed insurance, nor any application, endorsement or rider, shall be issued or used until the expiration of 60 days after it has been filed, unless the commissioner gives prior written approval thereto.\nThe commissioner may, at any time after a hearing held not less than 20 days after written notice to the insurer, withdraw approval of a form on any ground set forth in subdivision 2 above. The written notice of the hearing shall state the reason for the proposed withdrawal.\nIt is not lawful for the insurer to issue forms after the effective date of their withdrawal by the commissioner.\nIf a group policy of credit life insurance, credit accident and health insurance, or credit involuntary unemployment insurance\n(1) has been delivered in this state before May 28, 1967, or\n(2) has been or is delivered in another state before or after May 28, 1967, the insurer shall be required to file only the group certificate and notice of proposed insurance delivered or issued for delivery in this state as specified in subdivisions 2 and 4 of section 62B.06 and the forms shall be approved by the commissioner if they conform to the requirements specified in those subdivisions and if the schedules of premium rates applicable to the insurance evidenced by the certificate or notice are not in excess of the insurer's schedules of premium rates filed with the commissioner; provided, however, the premium rate in effect on existing group policies may be continued until the first policy anniversary date following May 28, 1967, as provided in section 62B.12.\nAny order or final determination of the commissioner under the provisions of this section shall be subject to judicial review.\nEach insurer that sold insurance regulated under this chapter in this state or to a Minnesota resident during the preceding calendar year shall file, as a supplement to its annual statement, a report covering that calendar year. The report must include the following data for coverage regulated by this chapter and sold in this state or to a Minnesota resident, all shown separately for each rate for each policy form or certificate form used for credit insurance regulated under this chapter:\n(1) claims incurred;\n(2) premiums earned;\n(3) expenses other than claims;\n(4) the data described in clauses (1), (2), and (3), shown separately for policies sold at each premium rate used by the insurer;\n(5) a statement as to whether the insurer applies or has applied underwriting criteria to coverage sold under this chapter, a description of any such criteria and the specific policies or certificates to which the criteria are applied;\n(6) information as to the compensation paid in regard to the sale of credit insurance regulated under this chapter as follows:\n(i) the name and address of each person or company to whom compensation was paid;\n(ii) the total compensation paid to each person or company; and\n(iii) the total premiums written by each person or company for which the compensation in clause (2) was paid; and\n(7) any other information requested by the commissioner.\nFor purposes of this section, \"compensation\" includes pecuniary or nonpecuniary remuneration of any kind relating to the sale or renewal of the policy or certificate, including but not limited to bonuses, gifts, prizes, awards, dividends, experience refunds, retrospective commissions, finder's fees, and increased or decreased prices for other transactions with the insurer.",
	"repealed": false
}