{
	"id": "609A.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/609A.06",
	"title": "609A.06 EXPUNGEMENT AND RESENTENCING OF FELONY CANNABIS OFFENSES.",
	"text": "(a) The Cannabis Expungement Board is created with the powers and duties established by law.\n(b) The Cannabis Expungement Board is composed of the following members:\n(1) the chief justice of the supreme court or a designee;\n(2) the attorney general or a designee;\n(3) one public defender, appointed by the governor upon recommendation of the state public defender;\n(4) the commissioner of corrections or a designee; and\n(5) one public member with relevant experience, appointed by the governor.\n(c) In appointing the public member described in paragraph (b), clause (5), the governor shall prioritize appointment of an individual with experience as an advocate for victim's rights.\n(d) Subject to the notice requirements in section 15.0575, subdivision 4, a member may be removed by the appointing authority at any time (1) for cause, after notice and hearing, or (2) after missing three consecutive meetings. Vacancies shall be filled by the appointing authority.\n(e) Members are eligible for compensation pursuant to section 15.0575, subdivision 3.\n(f) The Cannabis Expungement Board shall have the following powers and duties:\n(1) to obtain and review the records, including but not limited to all matters, files, documents, and papers incident to the arrest, indictment, information, trial, appeal, or dismissal and discharge, which relate to a charge for sale or possession of a controlled substance;\n(2) to determine whether a person committed an act involving the sale or possession of cannabis flower or cannabinoid products that would either be a lesser offense or no longer be a crime after August 1, 2023;\n(3) to determine whether a person's conviction should be vacated, charges should be dismissed, and records should be expunged, or whether the person should be resentenced to a lesser offense;\n(4) to identify violations of section 152.027, subdivisions 3 and 4, that were not automatically expunged pursuant to section 609A.055; and\n(5) to notify the judicial branch of individuals eligible for an expungement or resentencing to a lesser offense.\n(g) The Cannabis Expungement Board shall determine when it has completed its work.\n(a) The governor must appoint the initial executive director of the Cannabis Expungement Board. The executive director must be knowledgeable about expungement law and criminal justice. The executive director serves at the pleasure of the board in the unclassified service as an executive branch employee. Any vacancy shall be filled by the board.\n(b) The executive director may obtain office space and supplies and hire administrative staff necessary to carry out the board's official functions, including providing administrative support to the board and attending board meetings. Any additional staff serve in the classified service.\n(c) At the direction of the board, the executive director may enter into interagency agreements with the Department of Corrections or any other agency to obtain material and personnel support necessary to carry out the board's mandates, policies, activities, and objectives.\n(a) A person is eligible for an expungement or resentencing to a lesser offense if:\n(1) the person was convicted of, or adjudication was stayed for, a violation of any of the following involving the sale or possession of marijuana or tetrahydrocannabinols:\n(i) section 152.021, subdivision 1, clause (6);\n(ii) section 152.021, subdivision 2, clause (6);\n(iii) section 152.022, subdivision 1, clause (5), or clause (7), item (iii);\n(iv) section 152.022, subdivision 2, clause (6);\n(v) section 152.023, subdivision 1, clause (5);\n(vi) section 152.023, subdivision 2, clause (5);\n(vii) section 152.024, subdivision (4); or\n(viii) section 152.025, subdivision 2, clause (1);\n(2) the offense did not involve a dangerous weapon, the intentional infliction of bodily harm on another, an attempt to inflict bodily harm on another, or an act committed with the intent to cause fear in another of immediate bodily harm or death;\n(3) the act on which the charge was based would either be a lesser offense or no longer be a crime after August 1, 2023; and\n(4) the person did not appeal the conviction, any appeal was denied, or the deadline to file an appeal has expired.\n(b) For purposes of this subdivision, a \"lesser offense\" means a nonfelony offense if the person was charged with a felony.\n(a) The Bureau of Criminal Apprehension shall identify convictions and sentences where adjudication was stayed that qualify for review under subdivision 3, paragraph (a), clause (1).\n(b) The Bureau of Criminal Apprehension shall notify the Cannabis Expungement Board of:\n(1) the name and date of birth of a person whose record is eligible for review; and\n(2) the court file number of the eligible conviction or stay of adjudication.\n(c) For the purposes of identifying background studies records that may be expunged or resentenced, the Bureau of Criminal Apprehension shall share the information provided to the Cannabis Expungement Board under paragraph (b) with the Department of Human Services. The Bureau of Criminal Apprehension and the Department of Human Services shall consult about the form and manner of information sharing.\nNotwithstanding chapter 13 or any law to the contrary, the Cannabis Expungement Board shall have free access to records, including but not limited to all matters, files, documents, and papers incident to the arrest, indictment, information, trial, appeal, or dismissal and discharge that relate to a charge and conviction or stay of adjudication for sale or possession of a controlled substance held by law enforcement agencies, prosecuting authorities, and court administrators. The Cannabis Expungement Board may issue subpoenas for and compel the production of books, records, accounts, documents, and papers. If any person fails or refuses to produce any books, records, accounts, documents, or papers material in the matter under consideration after having been lawfully required by order or subpoena, any judge of the district court in any county of the state where the order or subpoena was made returnable, on application of the commissioner of management and budget or commissioner of administration, as the case may be, shall compel obedience or punish disobedience as for contempt, as in the case of disobedience of a similar order or subpoena issued by such court.\n(a) The Cannabis Expungement Board shall hold meetings at least monthly and shall hold a meeting whenever the board takes formal action on a review of a conviction or stay of adjudication for an offense involving the sale or possession of marijuana or tetrahydrocannabinols. All board meetings shall be open to the public and subject to chapter 13D.\n(b) Any victim of a crime being reviewed and any law enforcement agency may submit an oral or written statement at the meeting, giving a recommendation on whether a person's record should be expunged or the person should be resentenced to a lesser offense. The board must consider the victim's and the law enforcement agency's statement when making the board's decision.\n(c) Section 13D.05 governs the board's treatment of not public data, as defined by section 13.02, subdivision 8a, discussed at open meetings of the board. Notwithstanding section 13.03, subdivision 11, the board shall assign an anonymous, unique identifier to each victim of a crime and person whose conviction or stay of adjudication the board reviews. The identifier shall be used in any discussion in a meeting open to the public and on any records available to the public to protect the identity of the person whose records are being considered.\n(a) The Cannabis Expungement Board shall review all available records to determine whether the conviction or stay of adjudication is eligible for an expungement or resentencing to a lesser offense. An expungement under this section is presumed to be in the public interest unless there is clear and convincing evidence that an expungement or resentencing to a lesser offense would create a risk to public safety.\n(b) If the Cannabis Expungement Board determines that an expungement is in the public interest, the board shall determine whether a person's conviction should be vacated and charges should be dismissed.\n(c) If the Cannabis Expungement Board determines that an expungement is in the public interest, the board shall determine whether the limitations under section 609A.03, subdivision 5a, apply.\n(d) If the Cannabis Expungement Board determines that an expungement is in the public interest, the board shall determine whether the limitations under section 609A.03, subdivision 7a, paragraph (b), clause (5), apply.\n(e) If the Cannabis Expungement Board determines that an expungement is not in the public interest, the board shall determine whether the person is eligible for resentencing to a lesser offense.\n(f) In making a determination under this subdivision, the Cannabis Expungement Board shall consider:\n(1) the nature and severity of the underlying crime, including but not limited to the total amount of marijuana or tetrahydrocannabinols possessed by the person and whether the offense involved a dangerous weapon, the intentional infliction of bodily harm on another, an attempt to inflict bodily harm on another, or an act committed with the intent to cause fear in another of immediate bodily harm or death;\n(2) whether an expungement or resentencing the person a lesser offense would increase the risk, if any, the person poses to other individuals or society;\n(3) if the person is under sentence, whether an expungement or resentencing to a lesser offense would result in the release of the person and whether release earlier than the date that the person would be released under the sentence currently being served would present a danger to the public or would be compatible with the welfare of society;\n(4) aggravating or mitigating factors relating to the underlying crime, including the person's level of participation and the context and circumstances of the underlying crime;\n(5) statements from victims and law enforcement, if any;\n(6) if an expungement or resentencing the person to a lesser offense is considered, whether there is good cause to restore the person's right to possess firearms and ammunition;\n(7) if an expungement is considered, whether an expunged record of a conviction or stay of adjudication may be opened for purposes of a background check required under section 122A.18, subdivision 8; and\n(8) other factors deemed relevant by the Cannabis Expungement Board.\n(g) In making a determination under this subdivision, the Cannabis Expungement Board shall not consider the impact the expungement would have on the offender based on any records held by the Department of Health; Department of Children, Youth, and Families; or Department of Human Services.\n(h) The affirmative vote of three members is required for action taken at any meeting.\nThe board shall identify violations of section 152.027, subdivisions 3 and 4, that were not automatically expunged pursuant to section 609A.055. Pursuant to subdivision 10, the board shall notify the judicial branch that any identified records are eligible for expungement.\nUntil the board completes its work, the board shall issue a report by January 15 of each year to the legislative committees and divisions with jurisdiction over public safety policy and finance on the board's work. The report shall contain summary data and must include:\n(1) the total number of cases reviewed in the previous year;\n(2) the total number of cases in which the board determined that an expungement is in the public interest;\n(3) the total number of cases in which the board determined that resentencing to a lesser offense is appropriate, the original sentence in those cases, and the lesser offense recommended by the board;\n(4) the total number of cases in which the board determined that no change to the original sentence was appropriate; and\n(5) the total number of cases remaining to be reviewed.\n(a) The Cannabis Expungement Board shall identify any conviction or stay of adjudication that qualifies for an order of expungement or resentencing to a lesser offense and notify the judicial branch of:\n(1) the name and date of birth of a person whose conviction or stay of adjudication is eligible for an order of expungement or resentencing to a lesser offense;\n(2) the court file number of the eligible conviction or stay of adjudication;\n(3) whether the person is eligible for an expungement;\n(4) if the person is eligible for an expungement, whether the person's conviction should be vacated and charges should be dismissed;\n(5) if the person is eligible for an expungement, whether there is good cause to restore the offender's right to possess firearms and ammunition;\n(6) if the person is eligible for an expungement, whether the limitations under section 609A.03, subdivision 7a, paragraph (b), clause (5), apply; and\n(7) if the person is eligible for resentencing to a lesser offense, the lesser sentence to be imposed.\n(b) The Cannabis Expungement Board shall make a reasonable and good faith effort to notify any person whose conviction or stay of adjudication qualifies for an order of expungement that the offense qualifies and notice is being sent to the judicial branch. Notice sent pursuant to this paragraph shall inform the person that, following the order of expungement, any records of an arrest, conviction, or incarceration should not appear on any background check or study.\nAll data collected, created, received, maintained, or disseminated by the Cannabis Expungement Board in which each victim of a crime and person whose conviction or stay of adjudication that the Cannabis Expungement Board reviews is or can be identified as the subject of the data is classified as private data on individuals, as defined in section 13.02, subdivision 12.\n(a) Upon receiving notice that an offense qualifies for expungement, the court shall issue an order sealing all records relating to an arrest, indictment or information, trial, verdict, or dismissal and discharge for an offense described in subdivision 3. The courts shall not order the Department of Health; the Department of Children, Youth, and Families; or the Department of Human Services to seal records under this section. If the Cannabis Expungement Board determined that the person's conviction should be vacated and charges should be dismissed, the order shall vacate and dismiss the charges.\n(b) If the Cannabis Expungement Board determined that there is good cause to restore the person's right to possess firearms and ammunition, the court shall issue an order pursuant to section 609.165, subdivision 1d.\n(c) If the Cannabis Expungement Board determined that an expunged record of a conviction or stay of adjudication may not be opened for purposes of a background check required under section 122A.18, subdivision 8, the court shall direct the order specifically to the Professional Educator Licensing and Standards Board.\n(d) The court administrator shall send a copy of an expungement order issued under this section to each agency and jurisdiction whose records are affected by the terms of the order and send a letter to the last known address of the person whose offense has been expunged identifying each agency to which the order was sent.\n(e) In consultation with the commissioner of human services, the court shall establish a schedule on which it shall provide the commissioner of human services a list identifying the name and court file number or, if no court file number is available, the citation number of each record for a person who received an expungement under this section.\n(f) Data on the person whose offense has been expunged in a letter sent under this subdivision are private data on individuals as defined in section 13.02, subdivision 12.\n(a) If the Cannabis Expungement Board determined that a person is eligible for resentencing to a lesser offense and the person is currently under sentence, the court shall proceed as if the appellate court directed a reduction of the conviction to an offense of lesser degree pursuant to rule 28.02, subdivision 12, of the Rules of Criminal Procedure.\n(b) If the Cannabis Expungement Board determined that a person is eligible for resentencing to a lesser offense and the person completed or has been discharged from the sentence, the court may issue an order amending the conviction to an offense of lesser degree without holding a hearing.\n(c) If the Cannabis Expungement Board determined that there is good cause to restore the person's right to possess firearms and ammunition, the court shall, as necessary, issue an order pursuant to section 609.165, subdivision 1d.\n(d) In consultation with the commissioner of human services, the court shall establish a schedule on which it shall provide the commissioner of human services a list identifying the name and court file number or, if no court file number is available, the citation number of each record for a person who was resentenced under this section.",
	"repealed": false
}