{
	"id": "148.705",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.705",
	"title": "148.705 APPLICATION.",
	"text": "An applicant for licensure as a physical therapist or physical therapist assistant shall submit a written application on forms provided by the board together with the appropriate fee in the amount set by the board. No portion of the fee is refundable. No applicant will be approved to sit for the national examination until the application is complete, as determined by the board.\n(a) The application must include the following information:\n(1) evidence satisfactory to the board that the applicant has met the educational requirements of section 148.721 or 148.722 as demonstrated by a certified copy of a transcript;\n(2) recommendations by two physical therapists registered or licensed to practice physical therapy in the United States or Canada attesting to the applicant's ethical and moral character;\n(3) a recent full-face photograph of the applicant attached to the application with the affidavit on the form completed and notarized;\n(4) a record of the applicant's high school, college, and board-approved physical therapy school education listing the names, locations, dates of attendance, and diplomas, degrees, or certificates awarded;\n(5) a record of the applicant's postgraduate work and military service;\n(6) a listing of the United States jurisdictions, and countries in which the applicant is currently licensed or registered, or has been in the past, including the applicant's license or registration certificate number, the date the license or registration was obtained, and the method by which the license or registration was received;\n(7) a record of the applicant's current and previous physical therapy practice experience;\n(8) a record of disciplinary action taken on past complaints, refusal of licensure or registration, or denial of examination eligibility by another state board or physical therapy society against the applicant;\n(9) a record of the applicant's personal use or administration of any controlled substances and any treatment for alcohol or drug abuse;\n(10) a record by the applicant of any disease, illness, or injury that impairs the applicant's ability to practice physical therapy;\n(11) a record of any convictions for crimes related to the practice of physical therapy, felonies, gross misdemeanors, and crimes involving moral turpitude;\n(12) a listing of any memberships in a physical therapy professional association;\n(13) the applicant's name and address;\n(14) the applicant's Social Security number, alien registration card number, or tax identification number, whichever is applicable;\n(15) completed copies of credentials verification forms provided by the board; and\n(16) any information deemed necessary by the board to evaluate the applicant.\n(b) A person who has previously practiced in another state shall submit the following information for the five-year period of active practice preceding the date of filing application in this state:\n(1) the name and address of the person's professional liability insurer in the other state; and\n(2) the number, date, and disposition of any malpractice settlement or award made to a plaintiff relating to the quality of services provided.",
	"repealed": false
}