{
	"id": "471.564",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.564",
	"title": "471.564 BONDS.",
	"text": "A municipality may by resolution authorize, issue, and sell revenue bonds payable from all or any portion of a municipality's economic development loan repayments to finance any expenditure the municipality is authorized to make under section 471.563. The bonds may be issued in one or more series and sold at public or private sale and at the prices the municipality may determine. The bonds may be secured, bear interest at the rate or rates, have the rank or priority, be executed in the manner, mature and be subject to the defaults, redemptions, repurchases, tender options, or other terms that the municipality determines. The municipality may enter into and perform all contracts deemed necessary or desirable by it to issue the bonds and apply the proceeds of the bonds, including an indenture of trust with a trustee within or without the state, a loan agreement, lease or installment sale contract in connection with the project to be financed, or a guaranty of the bonds or related instrument. The bonds may be further secured by any pledge or mortgage securing the economic development loan repayments pledged to the bonds. The bonds, and the bonds shall so state, shall not be payable from nor charged upon any funds other than the economic development loan repayments and property pledged or mortgaged to the payment thereof. The municipality shall not have the power to obligate itself to pay the bonds from funds other than the economic development loan repayments and properties pledged and mortgaged. No owner or owners of the bonds shall ever have the right to compel any exercise of the taxing powers of the municipality to pay the principal of or interest on any such bonds or to enforce payment thereof against any other property of the municipality. Bonds may be issued under this section and their proceeds loaned to a nongovernmental person or entity, only if the municipality estimates that the economic development loan repayments pledged to the payment of principal and interest, exclusive of economic development loan repayments to be made by the person or entity, if paid to the municipality in accordance with their terms, are sufficient to pay principal and interest on the bonds when due.",
	"repealed": false
}