{
	"id": "123B.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.51",
	"title": "123B.51 SCHOOLHOUSES AND SITES; USES FOR SCHOOL AND NONSCHOOL PURPOSES; CLOSINGS.",
	"text": "According to section 126C.40, subdivision 1, or 465.71, when funds are available, the board may locate and acquire necessary sites of schoolhouses or enlargements, or additions to existing schoolhouse sites by lease, purchase or condemnation under the power of eminent domain; it may erect schoolhouses on the sites; it may erect or purchase garages for district-owned school buses. When property is taken by eminent domain by authority of this subdivision when needed by the district for such purposes, the fact that the property has been acquired by the owner under the power of eminent domain or is already devoted to public use, shall not prevent its acquisition by the district. The board may sell or exchange schoolhouses or sites, and execute deeds of conveyance thereof.\nThe board may authorize the use of any schoolhouses in the district for divine worship, Sunday schools, public meetings, elections, postsecondary instruction, and other community purposes that, in its judgment, will not interfere with their use for school purposes. Before permitting any of these uses, the board may require a cash or corporate surety bond in a reasonable amount conditioned for the proper use of the schoolhouse, payment of all rent, and repair of all damage caused by the use. It may determine a reasonable charge for using the schoolhouse.\nIt may authorize the use of any schoolhouses or buildings owned or leased by the district for primaries, elections, registrations, and related activities if the board determines that the use will not interfere with school purposes. It may impose reasonable regulations and conditions upon the use as may seem necessary and proper.\nWhen necessary, the board may lease real property for school purposes.\n(a) The board may lease to any person, business, or organization real property that is not needed for school purposes, or part of the property that is not needed for school purposes if the board determines that leasing part of the property does not interfere with the educational programs taking place on the property. The board may charge and collect reasonable consideration for the lease and may determine the terms and conditions of the lease.\n(b) In districts with outstanding bonds, the net proceeds of the lease must be first deposited in the debt retirement fund of the district in an amount sufficient to meet when due that percentage of the principal and interest payments for outstanding bonds that is ascribable to the payment of expenses necessary and incidental to the construction or purchase of the particular building or property that is leased. Any remaining net proceeds in these districts may be deposited in either the debt redemption fund or operating capital account. All net proceeds of the lease in districts without outstanding bonds shall be deposited in the operating capital account of the district.\n(c) The board may make capital improvements to the real property, not exceeding in cost the replacement value of the property, to facilitate its rental, and the lease of the improved property, or part of it, shall provide for rentals which will recover the cost of the improvements over the initial term of the lease. Notwithstanding paragraph (b), the portion of the rentals representing the cost of the improvements shall be deposited in the operating capital account of the district and the balance of the rentals shall be used as provided in paragraph (b).\nThe board may close a schoolhouse only after a public hearing on the question of the necessity and practicability of the proposed closing. Published notice of the hearing shall be given for two weeks in the official newspaper of the district. The time and place of the meeting, the description and location of the schoolhouse, and a statement of the reasons for the closing must be specified in the notice. Parties requesting to give testimony for and against the proposal shall be heard by the board before it makes a final decision to close or not to close the schoolhouse.\nA school district that proposes to temporarily close a schoolhouse or that intends to lease the facility to another entity for use as a schoolhouse for three or fewer years is not subject to subdivision 5 if the school board holds a public meeting and allows public comment on the schoolhouse's future.\n(a) Proceeds of the sale or exchange of school buildings or real property of the district must be used as provided in this subdivision.\n(b) In districts with outstanding bonds, the proceeds of the sale or exchange shall first be deposited in the debt retirement fund of the district in an amount sufficient to meet when due that percentage of the principal and interest payments for outstanding bonds which is ascribable to the payment of expenses necessary and incidental to the construction or purchase of the particular building or property which is sold.\n(c) After satisfying the requirements of paragraph (b), a district with outstanding bonds may deposit proceeds of the sale or exchange in its general fund reserved for operating capital account if the amount deposited is used for the following:\n(1) for expenditures for the cleanup of polychlorinated biphenyls, if the method for cleanup is approved by the department;\n(2) for capital expenditures for the betterment, as defined in section 475.51, subdivision 8, of district-owned school buildings; or\n(3) to replace the building or property sold.\n(d) In a district with outstanding bonds, the amount of the proceeds of the sale or exchange remaining after the application of paragraphs (b) and (c), which is sufficient to meet when due that percentage of the principal and interest payments for the district's outstanding bonds which is not governed by paragraph (b), shall be deposited in the debt retirement fund.\n(e) Any proceeds of the sale or exchange remaining in districts with outstanding bonds after the application of paragraphs (b), (c), and (d), and all proceeds of the sale or exchange in districts without outstanding bonds shall be deposited in the general fund reserved for operating capital account of the district.\n(f) Notwithstanding paragraphs (c) and (d), a district with outstanding bonds may deposit in its general fund reserved for operating capital account and use for any lawful operating capital expenditure without the reduction of any levy limitation the same percentage of the proceeds of the sale or exchange of a building or property as the percentage of the initial cost of purchasing or constructing the building or property which was paid using revenue from the general fund reserved for operating capital account.\n(a) In addition to the protections provided in existing building and fire code rules and standards, the following alternatives apply for existing school buildings:\n(1) rooms occupied by preschool, kindergarten, and first and second grade students for classrooms, latchkey, day care, early childhood family education or teen parent or similar programs may be located on any floor level below the fourth story of a school building if the building is protected throughout by a complete automatic sprinkler system and a complete automatic fire alarm system consisting of automatic smoke detection throughout the exit system and approved smoke detection in all rooms and areas other than classrooms and offices;\n(2) rooms used by preschool, kindergarten, or first grade students for classrooms, latchkey, day care, early childhood family education or teen parent or similar programs, must be located on the story of exit discharge, and rooms used by second grade students, for any purpose, must be located on the story of exit discharge or one story above unless one of the following conditions is met:\n(i) a complete automatic sprinkler system is provided throughout the building, the use of the affected room or space is limited to one grade level at a time, and exiting is provided from the affected room or space which is independent from the exiting system used by older students; or\n(ii) a complete approved automatic fire alarm system is installed throughout the building consisting of automatic smoke detection throughout the exit system and approved detection in all rooms and areas other than classrooms and offices, the use of the affected room or space is limited to one grade level at a time and exiting is provided from the affected room or space which is independent from the exiting system used by older students.\n(b) For purposes of paragraph (a), clause (2), pupils from second grade down are considered one grade level.\n(c) Accessory spaces, including gymnasiums, cafeterias, media centers, auditoriums, libraries, and band and choir rooms, which are used on an occasional basis by preschool, kindergarten, and first and second grade students are permitted to be located one level above or one level below the story of exit discharge, provided the building is protected throughout by a complete automatic sprinkler system or a complete approved corridor smoke detection system.\n(d) Paragraphs (a) and (c) supersede any contrary provisions of the State Fire Code or State Building Code and rules relating to those codes must be amended by the state agencies having jurisdiction of them.\n(e) Paragraphs (a) to (d) are effective for new school buildings beginning July 1, 1994.",
	"repealed": false
}