{
	"id": "424A.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/424A.015",
	"title": "424A.015 GENERALLY APPLICABLE FIREFIGHTERS RELIEF ASSOCIATION PENSION PLAN REGULATION.",
	"text": "(a) No service pension is payable to a person while the person remains an active member of the respective fire department, and a person who is receiving a service pension is not entitled to receive any other benefits from the special fund of the relief association.\n(b) No relief association as defined in section 424A.001, subdivision 4, may pay a service pension or disability benefit to a former member of the relief association if that person has not separated from active service with the fire department to which the relief association is directly associated, unless:\n(1) the person discontinues volunteer firefighter and paid on-call firefighter duties with the fire department and performs duties within the fire department on a part-time or full-time basis;\n(2) the governing body of the municipality, of the independent nonprofit firefighting corporation, or of the joint powers entity has filed its determination with the board of trustees of the relief association that the person's experience with and service to the fire department in that person's part-time or full-time capacity would be difficult to replace; and\n(3) the bylaws of the relief association were amended to provide for the payment of a service pension or disability benefit for such part-time or full-time employees.\nExcept as provided in sections 424A.05, 518.58, 518.581, and 518A.53:\n(1) a service pension or ancillary benefits paid or payable from the special fund of a relief association to any person receiving or entitled to receive a service pension or ancillary benefits is not subject to garnishment, judgment, execution, or other legal process; and\n(2) no person entitled to a service pension or ancillary benefits from the special fund of a relief association may assign any service pension or ancillary benefit payments, and the association does not have the authority to recognize any assignment or pay over any sum which has been assigned.\nA relief association that provides a service pension in a single payment, if the governing articles of incorporation or bylaws so provide, may purchase an annuity contract on behalf of a retiring member in an amount equal to the service pension otherwise payable at the request of the person and in place of a direct payment to the person. The annuity contract must be purchased from an insurance carrier licensed to do business in this state.\nA relief association that is a qualified pension plan under section 401(a) of the Internal Revenue Code, as amended, and that provides a single payment service pension, at the written request of the applicable retiring member or, following the death of the active member, at the written request of the deceased member's surviving spouse, may directly transfer on an institution-to-institution basis the eligible member's lump-sum pension or the survivor benefit attributable to the member, whichever applies, to the requesting person's individual retirement account under section 408(a) of the Internal Revenue Code, as amended.\nA relief association may directly transfer on an institution-to-institution basis the eligible member's lump-sum pension amount to the requesting member's account in the Minnesota deferred compensation plan, if:\n(1) the governing articles of incorporation or bylaws so provide;\n(2) the firefighter participates in the Minnesota deferred compensation plan at the time of retirement; and\n(3) the applicable retiring firefighter requests in writing that the relief association do so.\nA service pension or ancillary benefit payable under this chapter is governed by and must be calculated under the general statute, special law, relief association articles of incorporation, or relief association bylaw provisions applicable on the earlier of the following dates:\n(1) the date on which the member separates from active service with the fire department and active membership in the relief association; or\n(2) the date on which the member begins a break in service with the fire department that continues until the member separates from active service with the fire department and active membership in the relief association.\n(a) A member with credit for service as an active firefighter in more than one firefighters relief association is entitled to a service pension from each participating relief association if:\n(1) the articles of incorporation or bylaws of the relief associations provide for such combined service pensions;\n(2) the applicable requirements of paragraphs (b) to (e) are met; and\n(3) the member otherwise qualifies.\n(b) A member receiving a service pension under this subdivision must be at least partially vested under the bylaws of the first participating relief association on the date on which the member terminates active service with that relief association. The service pension paid from the first participating relief association shall be based on the years of active service accrued in the first relief association and the vesting percentage applicable to those years of active service.\n(c) To receive a service pension from each subsequent relief association, the member must be at least partially vested under the bylaws of the subsequent relief association, taking into consideration the member's total service credit accrued in all participating relief associations to the date the member terminates active service with the subsequent relief association. The service pension paid from each subsequent relief association shall be based on the years of active service accrued solely in that relief association and the vesting percentage applicable to the combined amount of total service credit accrued in all of the participating relief associations.\n(d) The member must have one or more years of service credit in each participating relief association. The service pension must be based on:\n(1) for defined benefit relief associations, the service pension amount in effect for the relief association on the date on which the member's active firefighting services covered by that relief association terminate; and\n(2) for defined contribution relief associations, the member's individual account balance on the date on which the member's active firefighting services covered by that relief association terminate.\n(e) To receive a service pension under this subdivision, the member must become a member of the subsequent relief association within two years of the date of termination of active service with the prior relief association. If requested by the member or a subsequent relief association, the secretary of each prior relief association must provide written notice to the member and the subsequent relief association regarding the amount of active service accrued by the member in the prior relief association.",
	"repealed": false
}