{
	"id": "260E.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.39",
	"title": "260E.39 CHILD FATALITY AND NEAR FATALITY REVIEW.",
	"text": "For purposes of this section, the following terms have the meanings given:\n(1) \"critical incident\" means a child fatality or near fatality in which maltreatment was a known or suspected contributing cause;\n(2) \"joint review\" means the critical incident review conducted by the child mortality review panel jointly with the local review team under subdivision 4, paragraph (b);\n(3) \"local review\" means the local critical incident review conducted by the local review team under subdivision 4, paragraph (c);\n(4) \"local review team\" means a local child mortality review team established under subdivision 2; and\n(5) \"panel\" means the child mortality review panel established under subdivision 3.\n(a) Each county shall establish a multidisciplinary local child mortality review team and shall participate in local critical incident reviews that are based on safety science principles to support a culture of learning. The local welfare agency's child protection team may serve as the local review team. The local review team shall include but not be limited to professionals with knowledge of the critical incident being reviewed and, if the critical incident being reviewed involved an Indian child as defined in section 260.755, subdivision 8, at least one representative from the child's Tribe.\n(b) The local review team shall conduct reviews of critical incidents jointly with the child mortality review panel or as otherwise required under subdivision 4, paragraph (c).\n(a) The commissioner shall establish a child mortality review panel to review critical incidents attributed to child maltreatment. The purpose of the panel is to identify systemic changes to improve child safety and well-being and recommend modifications in statute, rule, policy, and procedure.\n(b) The panel shall consist of:\n(1) the commissioner of children, youth, and families, or a designee;\n(2) the commissioner of human services, or a designee;\n(3) the commissioner of health, or a designee;\n(4) the commissioner of education, or a designee;\n(5) the superintendent of the Bureau of Criminal Apprehension, or a designee;\n(6) a judge, appointed by the Minnesota judicial branch; and\n(7) other members appointed by the governor, including but not limited to:\n(i) a physician who is a medical examiner;\n(ii) a physician who is a child abuse specialist pediatrician;\n(iii) a county attorney who works on child protection cases;\n(iv) two current child protection supervisors for local welfare agencies, each of whom has previous experience as a frontline child protection worker;\n(v) a current local welfare agency director who has previous experience as a frontline child protection worker or supervisor;\n(vi) two current child protection supervisors or directors for Tribal child welfare agencies, each of whom has previous experience as a frontline child protection worker or supervisor;\n(vii) a county or Tribal public health worker; and\n(viii) a member representing law enforcement.\n(c) The governor shall designate one member as chair of the panel from the members listed in paragraph (b), clauses (6) and (7).\n(d) Members of the panel shall serve terms of four years for an unlimited number of terms. A member of the panel may be removed by the appointing authority for the member.\n(e) The commissioner shall employ an executive director for the panel to:\n(1) provide administrative support to the panel and the chair, including providing the panel with critical incident notices submitted by local welfare agencies;\n(2) compile and synthesize information for the panel;\n(3) draft recommendations and reports for the panel's final approval; and\n(4) conduct or otherwise direct training and consultation under subdivision 7.\n(a) A local welfare agency that has determined that maltreatment was the cause of or a contributing factor in a critical incident must notify the commissioner and the executive director of the panel within three business days of making the determination.\n(b) The panel shall conduct a joint review with the local review team for:\n(1) any critical incident relating to a family, child, or caregiver involved in a local welfare agency family assessment or investigation within the 12 months preceding the critical incident;\n(2) a critical incident the governor or commissioner directs the panel to review; and\n(3) any other critical incident the panel chooses for review.\n(c) The local review team must review all critical incident cases not subject to joint review under paragraph (b).\n(d) Within 120 days of initiating a joint review or local review of a critical incident, except as provided under paragraph (h), the panel or local review team shall complete the joint review or local review and compile a report. The report must include any systemic learnings that may increase child safety and well-being, and may include policy or practice considerations for systems changes that may improve child well-being and safety.\n(e) A local review team must provide its report following a local review to the panel within three business days after the report is complete. After receiving the local review team report, the panel may conduct a further joint review.\n(f) Following the panel's joint review or after receiving a local review team report, the panel may make recommendations to any state or local agency, branch of government, or system partner to improve child safety and well-being.\n(g) The commissioner shall conduct additional information gathering as requested by the panel or the local review team. The commissioner must conduct information gathering for all cases for which the panel requests assistance. The commissioner shall compile a summary report for each critical incident for which information gathering is conducted and provide the report to the panel and the local welfare agency that reported the critical incident.\n(h) If the panel or local review team requests information gathering from the commissioner, the panel or local review team may conduct the joint review or local review and compile its report under paragraph (d) after receiving the commissioner's summary information-gathering report. The timeline for a local or joint review under paragraph (d) may be extended if the panel or local review team requests additional information gathering to complete their review. If the local review team extends the timeline for its review and report, the local welfare agency must notify the executive director of the panel of the extension and the expected completion date.\n(i) The review of any critical incident shall proceed as specified in this section, regardless of the status of any pending litigation or other active investigation.\n(a) In conducting reviews, the panel, the local review team, and the commissioner shall have access to not public data under chapter 13 maintained by state agencies, statewide systems, or political subdivisions that are related to the child's critical incident or circumstances surrounding the care of the child. The panel, the local review team, and the commissioner shall also have access to records of private hospitals as necessary to carry out the duties prescribed by this section. A state agency, statewide system, or political subdivision shall provide the data upon request from the commissioner. Not public data may be shared with members of the panel, a local review team, or the commissioner in connection with an individual case.\n(b) Notwithstanding the data's classification in the possession of any other agency, data acquired by a local review team, the panel, or the commissioner in the exercise of their duties are protected nonpublic or confidential data as defined in section 13.02 but may be disclosed as necessary to carry out the duties of the review team, panel, or commissioner. The data are not subject to subpoena or discovery.\n(c) The commissioner shall disclose information regarding a critical incident upon request but shall not disclose data that was classified as confidential or private data on decedents under section 13.10 or private, confidential, or protected nonpublic data in the disseminating agency, except that the commissioner may disclose local social service agency data as provided in section 260E.35 on individual cases involving a critical incident with a person served by the local social service agency prior to the date of the critical incident.\n(d) A person attending a local review team or child mortality review panel meeting shall not disclose what transpired at the meeting except to carry out the purposes of the local review team or panel. The commissioner shall not disclose what transpired during its information-gathering process except to carry out the duties of the commissioner. The proceedings and records of the local review team, the panel, and the commissioner are protected nonpublic data as defined in section 13.02, subdivision 13, and are not subject to discovery or introduction into evidence in a civil or criminal action. Information, documents, and records otherwise available from other sources are not immune from discovery or use in a civil or criminal action solely because they were presented during proceedings of the local review team, the panel, or the commissioner.\n(e) A person who presented information before the local review team, the panel, or the commissioner or who is a member of the local review team or the panel, or an employee conducting information gathering as designated by the commissioner, shall not be prevented from testifying about matters within the person's knowledge. However, in a civil or criminal proceeding, a person may not be questioned about the person's presentation of information to the local review team, the panel, or the commissioner, or about the information reviewed or discussed during a critical incident review or the information-gathering process, any conclusions drawn or recommendations made related to information gathering or a critical incident review, or opinions formed by the person as a result of the panel or review team meetings.\n(f) A person who presented information before the local review team, the panel, or the commissioner, or who is a member of the local review team or the panel, or an employee conducting information gathering as designated by the commissioner, is immune from any civil or criminal liability that might otherwise result from the person's presentation or statements if the person was acting in good faith and assisting with information gathering or in a critical incident review under this section.\nBeginning December 15, 2026, and on or before December 15 annually thereafter, the commissioner shall publish a report of the child mortality review panel. The report shall include but not be limited to de-identified summary data on the number of critical incidents reported to the panel, the number of critical incidents reviewed by the panel and local review teams, and systemic learnings identified by the panel or local review teams during the period covered by the report. The report shall also include recommendations on improving the child protection system, including modifications to statutes, rules, policies, and procedures. The panel may make recommendations to the legislature or any state or local agency at any time, outside of its annual report.\nThe commissioner shall provide training and support to local review teams and the panel to assist with local or joint review processes and procedures. The commissioner shall also provide consultation to local review teams and the panel conducting local or joint reviews pursuant to this section.\nThe local review teams and panel shall advance and support a culture of learning and improvement within Minnesota's child welfare system.",
	"repealed": false
}