{
	"id": "403.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/403.37",
	"title": "403.37 POWERS OF STATEWIDE RADIO BOARD.",
	"text": "In addition to any other powers specifically provided by law, the Statewide Radio Board has the powers necessary to oversee the planning, implementation, and maintenance of the ARMER system given in this section.\nThe board shall coordinate the statewide, shared radio and communication system project plan with local and regional plans and modify the plan as necessary to facilitate the implementation of the backbone of the statewide, shared radio and communication system.\nThe board shall define the backbone of the system, the timing and regions of system backbone development, the geographic scope of each region, and the standards for system backbone performance necessary to assure systemwide development that maximizes interoperability throughout the system.\nThe board shall oversee the implementation of the plan and ensure that the system is built, owned, operated, and maintained in accordance with the plan.\nThe board shall oversee the assignment of frequencies to local users and to subsystems.\nThe board shall determine how capital and operating costs of the system backbone are apportioned to users, including the cost of additional participants.\nThe board shall determine how excess capacity provided in the system backbone design will be allocated.\nThe board shall coordinate the extent to which local governments, quasi-public service corporations, and private entities eligible to use the system may provide system enhancements at their own expense.\nThe board shall establish and enforce performance and technical standards for the operation of the system backbone.\nThe board shall establish and enforce priorities or protocols for the system that facilitate statewide uniformity.\nThe board shall coordinate the integration of the statewide, shared radio and communication system among regions, adjoining states, federal entities, and to the extent permitted by law, with Canadian public safety entities.\nThe board shall allocate money available to the Statewide Radio Board among regional radio boards or to local entities within a region to encourage local and regional participation in the system. This does not limit the authority of regional radio boards and local entities to individually or collectively seek funding of local and regional enhancements and subsystems to the system backbone.",
	"repealed": false
}