{
	"id": "126C.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.55",
	"title": "126C.55 STATE PAYMENT OF DEBT OBLIGATION UPON POTENTIAL DEFAULT; REPAYMENT; STATE OBLIGATION NOT DEBT.",
	"text": "For the purposes of this section, the term \"debt obligation\" means:\n(1) a certificate of indebtedness issued under section 126C.52;\n(2) a certificate of participation issued under section 126C.40, subdivision 6; or\n(3) a general obligation bond.\n(a) If a school district or intermediate school district believes that it may be unable to make a principal or interest payment on any outstanding debt obligation on the date that payment is due, it must notify the commissioner as soon as possible, but not less than 15 working days before the date that principal or interest payment is due. The notice must include the name of the school district or intermediate school district, an identification of the debt obligation issue in question, the date the payment is due, the amount of principal and interest due on the payment date, the amount of principal or interest that the school district or intermediate school district will be unable to repay on that date, the paying agent for the debt obligation, the wire transfer instructions to transfer funds to that paying agent, and an indication as to whether a payment is being requested by the school district or intermediate school district under this section. If a paying agent becomes aware of a potential default, it shall inform the commissioner of that fact. After receipt of a notice which requests a payment under this section, after consultation with the school district or intermediate school district and the paying agent, and after verification of the accuracy of the information provided, the commissioner shall notify the commissioner of management and budget of the potential default. The notice must include a final figure as to the amount due that the school district or intermediate school district will be unable to repay on the date due.\n(b) Except as provided in subdivision 9, upon receipt of this notice from the commissioner, the commissioner of management and budget shall issue a payment and authorize the commissioner of education to pay to the paying agent for the debt obligation the specified amount on or before the date due. The amounts needed for the purposes of this subdivision are annually appropriated to the department from the state general fund.\n(c) The Departments of Education and Management and Budget must jointly develop detailed procedures for school districts and intermediate school districts to notify the state that they have obligated themselves to be bound by the provisions of this section, procedures for school districts or intermediate school districts and paying agents to notify the state of potential defaults and to request state payment under this section, and procedures for the state to expedite payments to prevent defaults. The procedures are not subject to chapter 14.\nIf, at the request of a school district or intermediate school district, the state has paid part or all of the principal or interest due on a district's debt obligation on a specific date, the school district or intermediate school district is bound by all provisions of this section and the amount paid shall bear taxable interest from the date paid until the date of repayment at the invested cash rate as it is certified by the commissioner of management and budget. Interest shall only accrue on the amounts paid and outstanding less the reduction in aid under subdivision 4 and other payments received from the district.\nIf, at the request of a school district or intermediate school district, the state has paid part or all of the principal or interest due on a district's debt obligation on a specific date, the pledge of the full faith and credit and unlimited taxing powers of the school district or the member districts of the intermediate district to repay the principal and interest due on those debt obligations shall also, without an election or the requirement of a further authorization, become a pledge of the full faith and credit and unlimited taxing powers of the school district or the member districts of the intermediate district to repay to the state the amount paid, with interest. Amounts paid by the state must be repaid in the order in which the state payments were made. Whenever the state pays under this section interest on bonds for which the issuer is entitled to federal interest subsidy payments, the state is subrogated to the issuer's rights to any federal interest subsidy payments relating to the interest paid by the state, unless and until the state has been reimbursed by the issuer in full.\n(a) Except as provided in this subdivision, the state must reduce the state aid payable to the school district or intermediate school district under this chapter and chapters 122A, 123A, 123B, 124D, 125A, 126C, and 273 by the amount paid by the state under this section on behalf of the district, plus the interest due on it, and the amount reduced must revert from the appropriate account to the state general fund. Payments from the school district endowment fund or any federal aid payments shall not be reduced.\n(b) For an intermediate school district, the state aid payable to the intermediate school district must first be reduced, before any reduction is made to the state aids payable to the member districts. If the state aid payable to the intermediate school district is not sufficient to repay the state, state aid payable to member districts may be reduced proportionately based on the ratio of each member district's adjusted net tax capacity to the total adjusted net tax capacity of all member districts.\n(c) If, after review of the financial situation of the school district or intermediate school district, the commissioner advises the commissioner of management and budget that a total reduction of aids would cause an undue hardship on or an undue disruption of the educational program of the district, the commissioner, with the approval of the commissioner of management and budget, may establish a different schedule for reduction of aids to repay the state. The amount of aids to be reduced is decreased by any amounts repaid to the state by the district from other revenue sources.\n[Repealed, 1Sp2003 c 9 art 12 s 21]\n(a) With the approval of the commissioner, a district may levy in the year the state makes a payment under this section an amount up to the amount necessary to provide funds for the repayment of the amount paid by the state plus interest through the date of estimated repayment by the district. The proceeds of this levy may be used only for this purpose unless they are in excess of the amount actually due, in which case the excess shall be used to repay other state payments made under this section or shall be deposited in the debt redemption fund of the school district. This levy shall be an increase in the levy limits of the district for purposes of section 275.065, subdivision 6. The amount of aids to be reduced to repay the state shall be decreased by the amount levied. This levy by the district is not eligible for debt service equalization under section 123B.53.\n(b) If the state is not repaid in full for a payment made under this section by November 30 of the calendar year following the year in which the state makes the payment, the commissioner shall require the district to certify a property tax levy in an amount up to the amount necessary to provide funds for repayment of the amount paid by the state plus interest through the date of estimated repayment by the school district. To prevent undue hardship, the commissioner may allow the district to certify the levy over a five-year period. The proceeds of the levy may be used only for this purpose unless they are in excess of the amount actually due, in which case the excess shall be used to repay other state payments made under this section or shall be deposited in the debt redemption fund of the district. This levy shall be an increase in the levy limits of the school district for purposes of section 275.065, subdivision 6. If the commissioner orders the district to levy, the amount of aids reduced to repay the state shall be decreased by the amount levied. This levy by the district is not eligible for debt service equalization under section 123B.53 or any successor provision.\n(c) For an intermediate district, a levy made by a member district under paragraph (a) or (b) to pay its pro rata share must be spread by the commissioner as a tax rate based on the total adjusted net tax capacity of the member school districts. The proceeds of the levy must be remitted by the member school district to the intermediate school district and must be used by the intermediate district only to repay the state amounts owed. Any amount in excess of the amount owed to the state must be repaid to the member school districts and the commissioner shall adjust each member district's property tax levy in the next year.\nA school district or intermediate school district may covenant and obligate itself, prior to the issuance of an issue of debt obligations, to notify the commissioner of a potential default and to use the provisions of this section to guarantee payment of the principal and interest on those debt obligations when due. If the district obligates itself to be bound by this section, it must covenant in the resolution that authorizes the issuance of the debt obligations to deposit with the paying agent three business days prior to the date on which a payment is due an amount sufficient to make that payment or to notify the commissioner under subdivision 1 that it will be unable to make all or a portion of that payment. A district that has obligated itself must include a provision in its agreement with the paying agent for that issue that requires the paying agent to inform the commissioner if it becomes aware of a potential default in the payment of principal or interest on that issue or if, on the day two business days prior to the date a payment is due on that issue, there are insufficient funds to make the payment on deposit with the paying agent. Funds invested in a refunding escrow account established under section 475.67 that are to become available to the paying agent on a principal or interest payment date are deemed to be on deposit with the paying agent three business days before the payment date. If a district either covenants to be bound by this section or accepts state payments under this section to prevent a default of a particular issue of debt obligations, the provisions of this section shall be binding as to that issue as long as any debt obligation of that issue remain outstanding. If the provisions of this section are or become binding for more than one issue of debt obligations and a district is unable to make payments on one or more of those issues, the district must continue to make payments on the remaining issues.\nIf the state makes payments on behalf of a school district or intermediate school district under this section or the district defaults in the payment of principal or interest on an outstanding debt obligation, it must submit a plan to the commissioner for approval specifying the measures it intends to implement to resolve the issues which led to its inability to make the payment and to prevent further defaults. The department must provide technical assistance to the district in preparing its plan. If the commissioner determines that a district's plan is not adequate, the commissioner shall notify the district that the plan has been disapproved, the reasons for the disapproval, and that the state shall not make future payments under this section for debt obligations issued after the date specified in that notice until its plan is approved. The commissioner may also notify the district that until its plan is approved, other aids due the district will be withheld after a date specified in the notice.\nIf the commissioner of management and budget determines that the credit rating of the state would be adversely affected thereby, the commissioner of management and budget shall not issue payments under subdivision 2 for the payment of principal or interest on any debt obligations for which a district did not, prior to their issuance, obligate itself to be bound by the provisions of this section.\nThe commissioner of management and budget may enter into written agreements or contracts relating to the continuing disclosure of information needed to facilitate the ability of school districts or intermediate school districts to issue debt obligations according to federal securities laws, rules, and regulations, including securities and exchange commission rules and regulations, section 240.15c2-12. Such agreements or contracts may be in any form the commissioner of management and budget deems reasonable and in the state's best interests.",
	"repealed": false
}