{
	"id": "471.895",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.895",
	"title": "471.895 CERTAIN GIFTS BY INTERESTED PERSONS PROHIBITED.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Gift\" has the meaning given it in section 10A.071, subdivision 1.\n(c) \"Interested person\" means a person or a representative of a person or association that has a direct financial interest in a decision that a local official is authorized to make.\n(d) \"Local official\" means:\n(1) an elected or appointed official of a county or city or of an agency, authority, or instrumentality of a county or city; and\n(2) an elected or appointed member of a school board, a school superintendent, a school principal, or a district school officer of any independent school district.\nAn interested person may not give a gift or request another to give a gift to a local official. A local official may not accept a gift from an interested person.\n(a) The prohibitions in this section do not apply if the gift is:\n(1) a contribution as defined in section 211A.01, subdivision 5;\n(2) services to assist an official in the performance of official duties, including but not limited to providing advice, consultation, information, and communication in connection with legislation, and services to constituents;\n(3) services of insignificant monetary value;\n(4) a plaque or similar memento recognizing individual services in a field of specialty or to a charitable cause;\n(5) a trinket or memento costing $5 or less;\n(6) informational material of unexceptional value; or\n(7) food or a beverage given at a reception, meal, or meeting away from the recipient's place of work by an organization before whom the recipient appears to make a speech or answer questions as part of a program.\n(b) The prohibitions in this section do not apply if the gift is given:\n(1) because of the recipient's membership in a group, a majority of whose members are not local officials, and an equivalent gift is given or offered to the other members of the group;\n(2) by an interested person who is a member of the family of the recipient, unless the gift is given on behalf of someone who is not a member of that family; or\n(3) by a national or multistate organization of governmental organizations or public officials, if a majority of the dues to the organization are paid from public funds, to attendees at a conference sponsored by that organization, if the gift is food or a beverage given at a reception or meal and an equivalent gift is given or offered to all other attendees.",
	"repealed": false
}