{
	"id": "299F.851",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.851",
	"title": "299F.851 TEST METHOD AND PERFORMANCE STANDARD.",
	"text": "(a) Except as provided in this subdivision, no cigarettes may be sold or offered for sale in this state or offered for sale or sold to persons located in this state unless (1) the cigarettes have been tested in accordance with the test method and have met the performance standard specified in this section, (2) a written certification has been filed by the manufacturer with the state fire marshal in accordance with section 299F.852, and (3) the cigarettes have been marked in accordance with section 299F.853.\n(b) Testing of cigarettes must be conducted in accordance with the American Society of Testing and Materials (ASTM) Standard E2187-04, \"Standard Test Method for Measuring the Ignition Strength of Cigarettes.\"\n(c) Testing must be conducted on ten layers of filter paper.\n(d) No more than 25 percent of the cigarettes tested in a test trial in accordance with this section may exhibit full-length burns. Forty replicate tests comprise a complete test trial for each cigarette tested.\n(e) The performance standard required by this subdivision must only be applied to a complete test trial.\n(f) Written certifications must be based upon testing conducted by a laboratory that has been accredited pursuant to standard ISO/IEC 17025 of the International Organization for Standardization (ISO), or other comparable accreditation standard required by the state fire marshal.\n(g) Laboratories conducting testing in accordance with this section shall implement a quality control and quality assurance program that includes a procedure that will determine the repeatability of the testing results. The repeatability value must be no greater than 0.19.\n(h) This subdivision does not require additional testing if cigarettes are tested consistent with sections 299F.850 to 299F.859 for any other purpose.\n(i) Testing performed or sponsored by the state fire marshal to determine a cigarette's compliance with the performance standard required must be conducted in accordance with this section.\nEach cigarette listed in a certification submitted pursuant to section 299F.852 that uses lowered permeability bands in the cigarette paper to achieve compliance with the performance standard set forth in this section must have at least two nominally identical bands on the paper surrounding the tobacco column. At least one complete band must be located at least 15 millimeters from the lighting end of the cigarette. For cigarettes on which the bands are positioned by design, there must be at least two bands fully located at least 15 millimeters from the lighting end and ten millimeters from the filter end of the tobacco column, or ten millimeters from the labeled end of the tobacco column for nonfiltered cigarettes.\nA manufacturer of a cigarette that the state fire marshal determines cannot be tested in accordance with the test method prescribed in subdivision 1, paragraph (b), shall propose a test method and performance standard for the cigarette to the state fire marshal. Upon approval of the proposed test method and a determination by the state fire marshal that the performance standard proposed by the manufacturer is equivalent to the performance standard prescribed in subdivision 1, paragraph (d), the manufacturer may employ such test method and performance standard to certify the cigarette pursuant to section 299F.852. If the state fire marshal determines that another state has enacted reduced cigarette ignition propensity standards that include a test method and performance standard that are the same as those contained in this subdivision, and the state fire marshal finds that the officials responsible for implementing those requirements have approved the proposed alternative test method and performance standard for a particular cigarette proposed by a manufacturer as meeting the fire safety standards of that state's law or regulation under a legal provision comparable to this subdivision, then the state fire marshal shall authorize that manufacturer to employ the alternative test method and performance standard to certify that cigarette for sale in this state, unless the state fire marshal demonstrates a reasonable basis why the alternative test should not be accepted under sections 299F.850 to 299F.859. All other applicable requirements of this section apply to the manufacturer.\nEach manufacturer shall maintain copies of the reports of all tests conducted on all cigarettes offered for sale for a period of three years, and shall make copies of these reports available to the state fire marshal and the attorney general upon written request. Any manufacturer who fails to make copies of these reports available within 60 days of receiving a written request is subject to a civil penalty not to exceed $10,000 for each day after the 60th day that the manufacturer does not make such copies available.\nThe state fire marshal may, by written order published in the State Register, adopt a subsequent ASTM Standard Test Method for Measuring the Ignition Strength of Cigarettes upon a finding that the subsequent method does not result in a change in the percentage of full-length burns exhibited by any tested cigarette when compared to the percentage of full-length burns the same cigarette would exhibit when tested in accordance with ASTM Standard E2187-04 and the performance standard in subdivision 1, paragraph (d). A determination by the state fire marshal under this subdivision is exempt from the rulemaking provisions of chapter 14, and section 14.386 does not apply.\nThe state fire marshal shall review the effectiveness of this section and report findings every three years to the legislature and, if appropriate, make recommendations for legislation to improve the effectiveness of this section. The report and legislative recommendations must be submitted no later than January 2 of each three-year period.\nMS 2022 [Repealed, 2023 c 25 s 190]\nThis section must be implemented in accordance with the implementation and substance of the New York \"Fire Safety Standards for Cigarettes.\"",
	"repealed": false
}