{
	"id": "65B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.02",
	"title": "65B.02 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates a different meaning is intended, the following terms shall, for the purposes of sections 65B.01 to 65B.12, have the meanings ascribed to them.\n\"Qualified applicant\" means a person who:\n(1) is a resident of this state;\n(2) owns a motor vehicle registered in accordance with the laws of this state, or has a valid driver's license, or is required to file a certificate of insurance with the commissioner of public safety; and\n(3) has no unpaid premiums with respect to prior automobile insurance.\n\"Facility\" means the organization formed by insurers to carry out the purposes provided in section 65B.01, subdivision 1, and shall be known as the Minnesota Automobile Insurance Plan.\n\"Member\" means an insurer who is required by sections 65B.01 to 65B.12, to be a member of the facility.\n\"Car years\" means the number of insurance policies written on automobile or licensed drivers by a given insurer in any calendar year; and \"voluntary car years\" means the number of such policies written by a given insurer, exclusive of policies written through the facility.\n\"Private passenger nonfleet automobile\" means motorized vehicles designed for transporting passengers or goods, subject to specific contemporary definitions for insurance purposes as provided in the plan of operation.\n\"Participation ratio\" means the ratio of the member's Minnesota premiums, or other measure of business written approved by the commissioner, in relation to the comparable statewide totals for all members.\n(1) For private passenger nonfleet automobile insurance coverages the participation ratio shall be based on voluntary car years written in this state for the calendar year ending December 31 of the second prior year, as reported by the statistical agent of each member as private passenger nonfleet exposures.\n(2) For insurance coverages on all other automobiles, including insurance for fleets, commercial vehicles, public vehicles and garages, the ratio shall be based on the total Minnesota gross, direct automobile insurance premiums written, including both policy and membership fees less return premiums and premiums on policies not taken, without including reinsurance assumed and without deducting reinsurance ceded, and less the amount of such premiums reported as received for insurance on private passenger nonfleet vehicles, for the calendar year ending December 31 of the second prior year.\n(3) For the purpose of determining each member's responsibility for expenses and assessments, the ratio shall be based on each member's total Minnesota car years and gross, direct premiums written, including both policy and membership fees less return premiums and premiums on policies not taken, without including reinsurance assumed and without deducting reinsurance ceded, for the calendar year ending December 31 of the second prior year, provided, however, that the preliminary determination of each member's responsibility for expenses and assessments may use the calendar year ending December 31 of the third prior year.\n\"Commissioner\" means the commissioner of commerce or one properly acting in the capacity of the commissioner of commerce.",
	"repealed": false
}