{
	"id": "245A.043",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.043",
	"title": "245A.043 LICENSE APPLICATION AFTER CHANGE OF OWNERSHIP.",
	"text": "A license issued under this chapter is only valid for a premises and individual, organization, or government entity identified by the commissioner on the license. A license is not transferable or assignable.\n(a) If the commissioner determines that there is a change in ownership, the commissioner shall require submission of a new license application. This subdivision does not apply to a licensed program or service located in a home where the license holder resides. A change in ownership occurs when:\n(1) except as provided in paragraph (b), the license holder sells or transfers 100 percent of the property, stock, or assets;\n(2) the license holder merges with another organization;\n(3) the license holder consolidates with two or more organizations, resulting in the creation of a new organization;\n(4) there is a change to the federal tax identification number associated with the license holder; or\n(5) except as provided in paragraph (b), all controlling individuals for the original license have changed.\n(b) For changes under paragraph (a), clause (1) or (5), no change in ownership has occurred and a new license application is not required if at least one controlling individual has been affiliated as a controlling individual for the license for at least the previous 12 months immediately preceding the change.\n(a) When a change in ownership is proposed and the party intends to assume operation without an interruption in service longer than 60 days after acquiring the program or service, the license holder must provide the commissioner with written notice of the proposed change on a form provided by the commissioner at least 90 days before the anticipated date of the change in ownership. For purposes of this section, \"party\" means the party that intends to operate the service or program.\n(b) The party must submit a license application under this chapter on the form and in the manner prescribed by the commissioner at least 90 days before the change in ownership is anticipated to be complete and must include documentation to support the upcoming change. The party must comply with background study requirements under chapter 245C and shall pay the application fee required under section 245A.10.\n(c) A party that intends to assume operation without an interruption in service longer than 60 days after acquiring the program or service is exempt from the requirements of sections 245G.03, subdivision 2, paragraph (b), and 254B.03, subdivision 2, paragraphs (c) and (d).\n(d) The commissioner may streamline application procedures when the party is an existing license holder under this chapter and is acquiring a program licensed under this chapter or service in the same service class as one or more licensed programs or services the party operates and those licenses are in substantial compliance. For purposes of this subdivision, \"substantial compliance\" means within the previous 12 months the commissioner did not (1) issue a sanction under section 245A.07 against a license held by the party, or (2) make a license held by the party conditional according to section 245A.06.\n(e) While the standard change of ownership process is pending, the existing license holder remains responsible for operating the program according to applicable laws and rules until a license under this chapter is issued to the party.\n(f) If a licensing inspection of the program or service was conducted within the previous 12 months and the existing license holder's license record demonstrates substantial compliance with the applicable licensing requirements, the commissioner may waive the party's inspection required by section 245A.04, subdivision 4. The party must submit to the commissioner (1) proof that the premises was inspected by a fire marshal or that the fire marshal deemed that an inspection was not warranted, and (2) proof that the premises was inspected for compliance with the building code or that no inspection was deemed warranted.\n(g) If the party is seeking a license for a program or service that has an outstanding action under section 245A.06 or 245A.07, the party must submit a written plan as part of the application process identifying how the party has or will come into full compliance with the licensing requirements.\n(h) The commissioner shall evaluate the party's application according to section 245A.04, subdivision 6. If the commissioner determines that the party has remedied or demonstrates the ability to remedy the outstanding actions under section 245A.06 or 245A.07 and has determined that the program otherwise complies with all applicable laws and rules, the commissioner shall issue a license or conditional license under this chapter. A conditional license issued under this section is final and not subject to reconsideration under section 245A.06, subdivision 4. The conditional license remains in effect until the commissioner determines that the grounds for the action are corrected or no longer exist.\n(i) The commissioner may deny an application as provided in section 245A.05. An applicant whose application was denied by the commissioner may appeal the denial according to section 245A.05.\n(j) This subdivision does not apply to a licensed program or service located in a home where the license holder resides.\n(a) In the event of a death of a license holder or sole controlling individual or a court order or other event that results in the license holder being inaccessible or unable to operate the program or service, a party may submit a request to the commissioner to allow the party to assume operation of the program or service under an emergency change in ownership process to ensure persons continue to receive services while the commissioner evaluates the party's license application.\n(b) To request the emergency change of ownership process, the party must immediately:\n(1) notify the commissioner of the event resulting in the inability of the license holder to operate the program and of the party's intent to assume operations; and\n(2) provide the commissioner with documentation that demonstrates the party has a legal or legitimate ownership interest in the program or service if applicable and is able to operate the program or service.\n(c) If the commissioner approves the party to continue operating the program or service under an emergency change in ownership process, the party must:\n(1) request to be added as a controlling individual or license holder to the existing license;\n(2) notify persons receiving services of the emergency change in ownership in a manner approved by the commissioner;\n(3) submit an application for a new license within 30 days of approval;\n(4) comply with the background study requirements under chapter 245C; and\n(5) pay the application fee required under section 245A.10.\n(d) While the emergency change of ownership process is pending, a party approved under this subdivision is responsible for operating the program under the existing license according to applicable laws and rules until a new license under this chapter is issued.\n(e) The provisions in subdivision 3, paragraphs (c), (d), and (f) to (i) apply to this subdivision.\n(f) Once a party is issued a new license or has decided not to seek a new license, the commissioner must close the existing license.\n(g) This subdivision applies to any program or service licensed under this chapter.\nIf a party's application under subdivision 2 is for a satellite license for a community residential setting under section 245D.23 or day services facility under section 245D.27 and if the party already holds an active license to provide services under chapter 245D, the commissioner may issue a temporary transitional license to the party for the community residential setting or day services facility while the commissioner evaluates the party's application. Until a decision is made to grant or deny a community residential setting or day services facility satellite license, the party must be solely responsible for operating the program according to applicable laws and rules, and the existing license must be closed. The temporary transitional license expires after 12 months from the date it was issued or upon issuance of the community residential setting or day services facility satellite license, whichever occurs first.\nIf the commissioner finds that the applicant or license holder has not fully complied with this section, the commissioner may impose a licensing sanction under section 245A.05, 245A.06, or 245A.07.",
	"repealed": false
}