{
	"id": "245A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/245A.16",
	"title": "245A.16 STANDARDS FOR COUNTY AGENCIES AND PRIVATE AGENCIES.",
	"text": "(a) County agencies that have been designated by the commissioner to perform licensing functions and activities under section 245A.04; to recommend denial of applicants under section 245A.05; to issue correction orders, to issue variances, and recommend a conditional license under section 245A.06; or to recommend suspending or revoking a license or issuing a fine under section 245A.07, shall comply with rules and directives of the commissioner governing those functions and with this section. The following variances are excluded from the delegation of variance authority and may be issued only by the commissioner:\n(1) dual licensure of child foster residence setting and community residential setting;\n(2) until the responsibility for family child foster care transfers to the commissioner of children, youth, and families under Laws 2023, chapter 70, article 12, section 30, dual licensure of family child foster care and family adult foster care;\n(3) until the responsibility for family child care transfers to the commissioner of children, youth, and families under Laws 2023, chapter 70, article 12, section 30, dual licensure of family adult foster care and family child care;\n(4) adult foster care or community residential setting maximum capacity;\n(5) adult foster care or community residential setting minimum age requirement;\n(6) child foster care maximum age requirement;\n(7) variances regarding disqualified individuals;\n(8) the required presence of a caregiver in the adult foster care residence during normal sleeping hours;\n(9) variances to requirements relating to chemical use problems of a license holder or a household member of a license holder; and\n(10) variances to section 142B.46 for the use of a cradleboard for a cultural accommodation.\n(b) Once the respective responsibilities transfer from the commissioner of human services to the commissioner of children, youth, and families, under Laws 2023, chapter 70, article 12, section 30, the commissioners of human services and children, youth, and families must both approve a variance for dual licensure of family child foster care and family adult foster care or family adult foster care and family child care. Variances under this paragraph are excluded from the delegation of variance authority and may be issued only by both commissioners.\n(c) For family adult day services programs, the commissioner may authorize licensing reviews every two years after a licensee has had at least one annual review.\n(d) A license issued under this section may be issued for up to two years.\n(e) During implementation of chapter 245D, the commissioner shall consider:\n(1) the role of counties in quality assurance;\n(2) the duties of county licensing staff; and\n(3) the possible use of joint powers agreements, according to section 471.59, with counties through which some licensing duties under chapter 245D may be delegated by the commissioner to the counties.\nAny consideration related to this paragraph must meet all of the requirements of the corrective action plan ordered by the federal Centers for Medicare and Medicaid Services.\n(f) Licensing authority specific to section 245D.06, subdivisions 5, 6, 7, and 8, or successor provisions; and section 245D.061 or successor provisions, for family child foster care programs providing out-of-home respite, as identified in section 245D.03, subdivision 1, paragraph (b), clause (1), is excluded from the delegation of authority to county agencies.\n(a) The county or private agency shall conduct timely investigations of allegations of maltreatment of children or adults in programs for which the county or private agency is the commissioner's designated representative and record a disposition of each complaint in accordance with applicable law or rule. The county or private agency shall conduct similar investigations of allegations of violations of rules governing licensure of the program.\n(b) If an investigation conducted under paragraph (a) results in evidence that the commissioner should deny an application or suspend, revoke, or make conditional a license, the county or private agency shall make that recommendation to the commissioner within ten working days.\nThe county agency shall not make recommendations to the commissioner regarding licensure without first conducting an inspection. The county agency must forward its recommendation to the commissioner regarding the appropriate licensing action within 20 working days of receipt of a completed application.\nThe county or private agency shall enforce the commissioner's orders under sections 245A.07, 245A.08, subdivision 5, and chapter 245C, according to the instructions of the commissioner. The county attorney shall assist the county agency in the enforcement and defense of the commissioner's orders under sections 245A.07, 245A.08, and chapter 245C, according to the instructions of the commissioner, unless a conflict of interest exists between the county attorney and the commissioner. For purposes of this section, a conflict of interest means that the county attorney has a direct or shared financial interest with the license holder or has a personal relationship or family relationship with a party in the licensing action.\nThe commissioner shall provide instruction and technical assistance to county agencies that are subject to this section. County agencies shall cooperate with the commissioner in carrying out this section by ensuring that affected employees participate in instruction and technical assistance provided by the commissioner.\nThe commissioner shall ensure that rules are uniformly enforced throughout the state by reviewing each county and private agency for compliance with this section and other applicable laws and rules at least every four years. County agencies that comply with this section shall be certified by the commissioner. If a county agency fails to be certified by the commissioner, the commissioner shall certify a reduction of state administrative aids in an amount up to 20 percent of the county's state portion of Vulnerable Children and Adults Act funding.\n[Renumbered 142B.30, subd 7]\nThe county or private agency shall provide written notice to the license holder when the agency recommends a licensing action to the commissioner under subdivision 2 or 3. The written notice shall inform the license holder about the process for determining a licensing action and how the license holder will be notified of a licensing action determination. The notice shall include the following:\n(1) that the county or private agency made a recommendation to the commissioner to deny an application or suspend, revoke, or make conditional a license;\n(2) that the commissioner will review the recommendation from the county or private agency and then determine if a licensing action will be issued;\n(3) that the license holder will receive written notice from the commissioner indicating the reasons for the licensing action issued; and\n(4) instructions on how to request reconsideration or appeal, if a licensing action is issued.\nCounty or private agency recommendations under this section are classified as confidential data under chapter 13 and may only be disclosed as permitted by law.\n[Renumbered 142B.30, subd 9]\nUpon implementation of the provider licensing and reporting hub, county staff who perform licensing functions must use the hub in the manner prescribed by the commissioner.\n[Renumbered 142B.30, subd 11]",
	"repealed": false
}