{
	"id": "383B.915",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.915",
	"title": "383B.915 BONDING AUTHORITY OF CORPORATION.",
	"text": "The corporation shall be considered a \"municipality\" pursuant to section 475.51, subdivision 2, for purposes of bond issuance and shall have all the authority conferred on municipalities by chapter 475, unless that authority is modified in this section.\nSubject to the reserved powers and limitations specified in section 383B.908 and notwithstanding any of the corporation's enumerated powers, the corporation may issue and sell revenue bonds or other revenue obligations to finance capital improvements or for the acquisition and betterment of facilities or other property to be utilized for the delivery of health care and related research, the establishment of reserves for bond payment, or for other proper corporate purposes.\nSubject to the reserved powers and limitations specified in section 383B.908 and notwithstanding any of the corporation's enumerated powers, the bonds may be secured by a mortgage of or security interest in any property owned by the corporation or any interest of the corporation in any property and by a pledge of revenues to be derived from operation of the corporation's facilities as a first and prior lien thereon or as a lien subordinate to the costs of operation and maintenance of the facilities. The bonds must be in an amount, and shall mature, as provided by resolution of the board and may be issued in one or more series and shall bear a date or dates, bear interest at a rate or rates, be in a denomination or denominations, be in the form either coupon or registered, carry the conversion or registration privileges, have rank or priority, be executed in the manner, be payable in medium of payment at the place or places, and be subject to the terms of redemption, with or without premium, as the resolution may provide. The bonds may be sold at public or private sale at a price or prices determined by the resolution. Notwithstanding any law to the contrary, the bonds must be fully negotiable. The corporation may enter into the covenants the board, by resolution, shall deem necessary and proper to secure payment of the bonds. The revenue bonds must state on their face that they are not payable from, nor may be a charge upon, any funds other than the revenues and property pledged or mortgaged for their payment, nor shall the corporation be subject to any liability on them or have the power to obligate itself to pay or pay the revenue bonds from funds other than the revenues and property pledged and mortgaged. No holder or holders of the bonds shall ever have the right to compel any exercise of any taxing power of the county or any other public body to pay the principal of or interest on any of them, nor to enforce payment of them against any property other than that expressly pledged or mortgaged for their payment.",
	"repealed": false
}