{
	"id": "84.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.01",
	"title": "84.01 DEPARTMENT OF NATURAL RESOURCES; COMMISSIONER APPOINTMENT.",
	"text": "The name of the Department of Conservation is changed to the Department of Natural Resources. The name of the commissioner of conservation is changed to the commissioner of natural resources. Subject to the provisions of Laws 1969, chapter 1129, and other applicable laws, the Department of Natural Resources with its commissioner and other officers shall continue to exercise all the powers and duties vested in, or imposed upon its commissioner as existing and constituted immediately prior to the effective date of Laws 1969, chapter 1129.\nThe commissioner of natural resources is appointed by the governor under the provisions of section 15.06. The commissioner may appoint a deputy commissioner.\nSubject to the provisions of Laws 1969, chapter 1129, and to other applicable laws the commissioner shall organize the department and employ up to three assistant commissioners, each of whom shall serve at the pleasure of the commissioner in the unclassified service, one of whom shall have responsibility for coordinating and directing the planning of every division within the agency, and such other officers, employees, and agents as the commissioner may deem necessary to discharge the functions of the department, define the duties of such officers, employees, and agents and to delegate to them any of the commissioner's powers, duties, and responsibilities subject to the control of, and under the conditions prescribed by, the commissioner. Appointments to exercise delegated power shall be by written order filed with the secretary of state.\nBefore entering upon the duties of office the commissioner of natural resources shall take and subscribe an oath.\nThe commissioner of natural resources may request from time to time, as the commissioner deems necessary, information and advice on technical natural resource matters from advisory task forces or individuals having specialized knowledge or experience in such matters. A task force shall expire and the terms, compensation and removal of members shall be as provided in section 15.059. The expenses allowed shall be paid from any money appropriated to the commissioner for salaries, supplies, and expenses.\nThe commissioner of natural resources may appoint attorneys or outside counsel to render title opinions, represent the department in severed mineral interest forfeiture actions brought pursuant to section 93.55, and, notwithstanding any statute to the contrary, represent the state in quiet title or title registration actions affecting land or interests in land administered by the commissioner.",
	"repealed": false
}