{
	"id": "121A.582",
	"url": "https://www.revisor.mn.gov/statutes/cite/121A.582",
	"title": "121A.582 STUDENT DISCIPLINE; REASONABLE FORCE.",
	"text": "(a) A teacher or school principal, in exercising the person's lawful authority, may use reasonable force when it is necessary under the circumstances to correct or restrain a student to prevent bodily harm or death to the student or to another.\n(b) A school employee, school bus driver, or other agent of a district, in exercising the person's lawful authority, may use reasonable force when it is necessary under the circumstances to restrain a student to prevent bodily harm or death to the student or to another.\n(c) Paragraphs (a) and (b) do not authorize conduct prohibited under section 125A.0942.\n(d) Districts must report data on their use of any reasonable force used on a student with a disability to correct or restrain the student to prevent bodily harm or death to the student or another that is consistent with the definition of physical holding under section 125A.0941, paragraph (c), as outlined in section 125A.0942, subdivision 3, paragraph (b).\n(e) Beginning with the 2024-2025 school year, districts must report annually by July 15, in a form and manner determined by the commissioner, data from the prior school year about any reasonable force used on a general education student to correct or restrain the student to prevent bodily harm or death to the student or another that is consistent with the definition of physical holding under section 125A.0941, paragraph (c).\n(a) A teacher or school principal who, in the exercise of the person's lawful authority, uses reasonable force under the standard in subdivision 1, paragraph (a), has a defense against a civil action for damages under section 123B.25.\n(b) A school employee, bus driver, or other agent of a district who, in the exercise of the person's lawful authority, uses reasonable force under the standard in subdivision 1, paragraph (b), has a defense against a civil action for damages under section 123B.25.\n(a) A teacher or school principal who, in the exercise of the person's lawful authority, uses reasonable force under the standard in subdivision 1, paragraph (a), has a defense against a criminal prosecution under section 609.06, subdivision 1.\n(b) A school employee, bus driver, or other agent of a district who, in the exercise of the person's lawful authority, uses reasonable force under the standard in subdivision 1, paragraph (b), has a defense against a criminal prosecution under section 609.06, subdivision 1.\nAny right or defense in this section is supplementary to those specified in section 121A.58, 121A.67, 123B.25, or 609.06, subdivision 1.\nFor the purpose of this section, a school resource officer, as defined in section 626.8482, subdivision 1, paragraph (c), is not a school employee or agent of the district.",
	"repealed": false
}