{
	"id": "103G.285",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.285",
	"title": "103G.285 SURFACE WATER APPROPRIATIONS.",
	"text": "The commissioner may waive a limitation or requirement in subdivisions 2 to 6 for just cause.\nIf data are available, permits to appropriate water from natural and altered natural watercourses must be limited so that consumptive appropriations are not made from the watercourses during periods of specified low flows. The purpose of the limit is to safeguard water availability for in-stream uses and for downstream higher priority users located reasonably near the site of appropriation.\n(a) Permits to appropriate water from water basins must be limited so that the collective annual withdrawals do not exceed a total volume of water amounting to one-half acre-foot per acre of water basin based on Minnesota Department of Conservation Bulletin No. 25, \"An Inventory of Minnesota Lakes,\" published in 1968.\n(b) As a condition to a surface water appropriation permit, the commissioner shall set a protective elevation for the water basin, below which an appropriation is not allowed. During the determination of the protective elevation, the commissioner shall consider:\n(1) the elevation of important aquatic vegetation characteristics related to fish and wildlife habitat;\n(2) existing uses of the water basin by the public and riparian landowners; and\n(3) the total volume within the water basin and the slope of the littoral zone.\nAs part of an application for appropriation of water from a water basin less than 500 acres in surface area, the applicant shall obtain a statement of support with as many signatures as the applicant can obtain from property owners with property riparian to the water basin. The statement of support must:\n(1) state support for the proposed appropriation; and\n(2) show the number of property owners whose signatures the applicant could not obtain.\nPermits issued after June 3, 1977, to appropriate water from streams designated trout streams by the commissioner's orders under section 97C.005 must be limited to temporary appropriations.\nAn application for use of surface waters of the state is not complete until the applicant submits, as part of the application, a contingency plan that describes the alternatives the applicant will use if further appropriation is restricted due to the flow of the stream or the level of a water basin. A surface water appropriation may not be allowed unless the contingency plan is feasible or the permittee agrees to withstand the results of not being able to appropriate water.",
	"repealed": false
}