{
	"id": "297G.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.08",
	"title": "297G.08 SALES TO INDIAN TRIBES.",
	"text": "A wholesaler may set aside the part of the wholesaler's stock necessary to make sales to the established governing body of an Indian tribe recognized by the United States Department of the Interior, without paying the tax required by this chapter. The amount of untaxed stock that wholesalers may deliver to an Indian reservation is limited to amounts necessary to meet the personal consumption needs of qualified purchasers. When shipping or delivering untaxed stock to an Indian tribal organization, the wholesaler shall make a true duplicate invoice. The invoice must show the complete details of the sale or delivery. The wholesaler shall send the duplicate to the commissioner not later than the 18th day of the following calendar month. If a wholesaler fails to comply with the requirements of this section, the commissioner shall revoke the permission granted to the wholesaler to keep a stock of untaxed goods.\nRetailers who are Indian tribal organizations may keep untaxed stock intended for sale to qualified purchasers.\nA qualified purchaser of untaxed liquor means only an enrolled member of the Indian tribe that is offering the liquor for sale.\nA retailer who sells or otherwise disposes of untaxed liquor other than to a qualified purchaser shall collect from the buyer or transferee the tax imposed by this chapter and remit the tax to the Department of Revenue at the same time and manner as required by this chapter. If the retailer fails to collect the tax from the buyer or transferee, or fails to remit the tax, the retailer is personally responsible for the tax and the commissioner may seize any liquor destined to be delivered to the retailer. The procedures outlined in section 297G.20 apply to the seized liquor. The proceeds of the sale of the liquor may be applied to any tax liability owed by the retailer after deducting all costs and expenses.\nThis section does not relieve the buyer or possessor of untaxed liquor from personal liability for the tax.",
	"repealed": false
}