{
	"id": "60L.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/60L.12",
	"title": "60L.12 REPORTS AND REPLIES.",
	"text": "The commissioner may require any of the following from a person subject to regulation under sections 60L.01 to 60L.15:\n(1) statements, reports, answers to questionnaires and other information, and evidence in whatever reasonable form the commissioner designates, and at reasonable intervals as the commissioner chooses;\n(2) full explanation of the programming of any data storage or communication system in use; or\n(3) that information from any books, records, electronic data processing systems, computers, or any other information storage system be made available to the commissioner at a reasonable time and in a reasonable manner.\nThe commissioner may prescribe forms for the reports required under subdivision 1 and specify who shall execute or certify the reports. The forms for the reports required under subdivision 1 must be consistent, so far as practicable, with those prescribed by other jurisdictions.\nThe commissioner may prescribe reasonable minimum standards and techniques of accounting and data handling to ensure that timely and reliable information will exist and will be available to the commissioner.\nAny officer, manager, or general agent of an insurer subject to sections 60L.01 to 60L.15, any person controlling or having a contract under which the person has a right to control the insurer, whether exclusively or otherwise, or a person with executive authority over or in charge of any segment of the insurer's affairs, shall reply promptly in writing or in other reasonably designated form, to a written inquiry from the commissioner requesting a reply.\nThe commissioner may require that any communication made to the commissioner under this section be verified.\nA communication to the commissioner, or to an expert or consultant retained by the commissioner, required under sections 60L.01 to 60L.15, shall not subject the person making it to an action for damages for the communication in the absence of actual malice.\nNotwithstanding subdivision 6, the commissioner may bring suit against any person providing information required under sections 60L.01 to 60L.15 that is not truthful and accurate.",
	"repealed": false
}