{
	"id": "179A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.17",
	"title": "179A.17 NEW EXCLUSIVE REPRESENTATIVES.",
	"text": "If a new or different exclusive representative of teachers employed by a local school district is certified by the commissioner at any time other than the period between 120 days before the termination date of a contract and the termination date of the contract, or if on July 1 of any odd-numbered year a representation proceeding involving the employer and the employer's teachers is before the commissioner, section 179A.18, subdivision 2, clause (1), shall apply. In those cases, however, the employer and the exclusive representative of the teachers shall execute a written contract or memorandum of contract no later than 60 days after a certification by the commissioner of a new or different exclusive representative or the resolution by the commissioner of a representation proceeding. Either party may petition the commissioner for assistance in reaching an agreement. If the employer and the exclusive representative of the teachers fail to execute a contract by 60 days after the certification of a new or different exclusive representative or the resolution by the commissioner of a representation proceeding, they shall be conclusively presumed to be at an impasse after having participated in mediation as specified in section 179A.18, subdivision 2, clause (1)(ii).\nIf a new or different exclusive representative of employees other than teachers employed by a local school district is certified by the commissioner, or if on the expiration date of an existing contract a representation proceeding is before the commissioner, section 179A.18, subdivision 1, clause (1), shall apply. In those cases, however, the employer and the exclusive representative of the employees shall execute a written contract or memorandum of contract no later than 45 days after a certification by the commissioner of a new or different exclusive representative or the resolution by the commissioner of a representation proceeding. Either party may petition the commissioner for assistance in reaching an agreement. If the employer and the exclusive representative fail to execute a contract by 45 days after the certification of a new or different exclusive representative or the resolution by the commissioner of a representation proceeding, they shall be conclusively presumed to be at an impasse after having participated for a period of no less than 45 days in mediation sessions.",
	"repealed": false
}