{
	"id": "299C.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.69",
	"title": "299C.69 OWNER DUTIES IF MANAGER CONVICTED OF CRIME.",
	"text": "(a) If the superintendent's response indicates that the manager has been convicted of a background check crime defined in section 299C.67, subdivision 2, paragraph (a), the owner may not hire the manager or, if the manager was hired pending completion of the background check, shall terminate the manager's employment. Except as provided in paragraph (c), if an owner otherwise knows that a manager has been convicted of a background check crime defined in section 299C.67, subdivision 2, paragraph (a), the owner shall terminate the manager's employment.\n(b) If the superintendent's response indicates that the manager has been convicted of a background check crime defined in section 299C.67, subdivision 2, paragraph (b), the owner may not hire the manager unless more than ten years have elapsed since the date of discharge of the sentence. If the manager was hired pending completion of the background check, the owner shall terminate the manager's employment unless more than ten years have elapsed since the date of discharge of the sentence. Except as provided in paragraph (c), if an owner otherwise knows that a manager has been convicted of a background check crime defined in section 299C.67, subdivision 2, paragraph (b), the owner shall terminate the manager's employment unless more than ten years have elapsed since the date of discharge of the sentence.\n(c) If an owner knows that a manager hired before July 1, 1995, was convicted of a background check crime for an offense committed before July 1, 1995, the owner may continue to employ the manager. However, the owner shall notify all tenants and prospective tenants whose dwelling units would be accessible to the manager of the crime for which the manager has been convicted and of the right of a current tenant to terminate the tenancy under this paragraph, if the manager was convicted of a background check crime defined in:\n(1) section 299C.67, subdivision 2, paragraph (a); or\n(2) section 299C.67, subdivision 2, paragraph (b), unless more than ten years have elapsed since the sentence was discharged.\nNotwithstanding a lease provision to the contrary, a current tenant who receives a notice under this paragraph may terminate the tenancy within 60 days of receipt of the notice by giving the owner at least 14 days' advance notice of the termination date.\n(d) The owner shall notify the manager of any action taken under this subdivision.\n(e) If an owner is required to terminate a manager's employment under paragraph (a) or (b), or terminates a manager's employment in lieu of notifying tenants under paragraph (c), the owner is not liable under any law, contract, or agreement, including liability for unemployment insurance claims, for terminating the manager's employment in accordance with this section. Notwithstanding a lease or agreement governing termination of the tenancy, if the manager whose employment is terminated is also a tenant, the owner may terminate the tenancy immediately upon giving notice to the manager. An eviction action to enforce the termination of the tenancy must be treated as a priority writ under sections 504B.321; 504B.335; 504B.345, subdivision 1; 504B.361, subdivision 2; and 504B.365, subdivision 2.",
	"repealed": false
}