{
	"id": "116L.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.40",
	"title": "116L.40 DEFINITIONS.",
	"text": "When used in sections 116L.40 to 116L.42, the following terms have the meanings given them unless the context requires otherwise.\n\"Agreement\" means the agreement between an employer and the commissioner for a project.\n\"Automation technology\" means a process or procedure performed with minimal human assistance. Automation or automatic control is the use of various control systems for operating equipment such as machinery, processes in factories, or other applications with minimal or reduced human intervention. Adoption, implementation, and utilization of any one of three types of automation in production are acceptable for consideration of this program, including fixed automation, programmable automation, and flexible automation.\n\"Commissioner\" means the commissioner of employment and economic development.\n\"Disability\" has the meaning given under United States Code, title 42, chapter 126.\n\"Employee\" means the individual employed in a new or existing job.\n\"Employer\" means the individual, corporation, partnership, limited liability company, or association providing new jobs or investing in new automation technology and entering into an agreement.\n\"New job\" means a job:\n(1) that is provided by a new or expanding business at a location in Minnesota outside of the metropolitan area, as defined in section 473.121, subdivision 2;\n(2) that provides at least 32 hours of work per week for a minimum of nine months per year and is permanent with no planned termination date;\n(3) that is certified by the commissioner as qualifying under the program before the first employee is hired to fill the job; and\n(4) for which an employee hired was not (i) formerly employed by the employer in the state, or (ii) a replacement worker, including a worker newly hired as a result of a labor dispute.\n\"Program\" means the project or projects established under sections 116L.40 to 116L.42.\n\"Program costs\" means all necessary and incidental costs of providing program services. The term does not include the cost of purchasing equipment to be owned or used by the training or educational institution or service.\n\"Program services\" means training and education specifically directed to new or existing jobs that are determined to be appropriate by the commissioner, including in-house training; services provided by institutions of higher education and federal, state, or local agencies; or private training or educational services. Administrative services and assessment and testing costs are included.\n\"Project\" means a training arrangement that is the subject of an agreement entered into between the commissioner and an employer to provide program services.",
	"repealed": false
}