{
	"id": "626.5534",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.5534",
	"title": "626.5534 USE OF FORCE REPORTING; INDEPENDENT INVESTIGATIONS REQUIRED.",
	"text": "A chief law enforcement officer must provide the information requested by the Federal Bureau of Investigation about each incident of law enforcement use of force resulting in serious bodily injury or death, as those terms are defined in the Federal Bureau of Investigation's reporting requirements, to the superintendent of the Bureau of Criminal Apprehension. The superintendent shall adopt a reporting form for use by law enforcement agencies in making the report required under this section. The report must include for each incident all of the information requested by the Federal Bureau of Investigation.\nA chief law enforcement officer must file the report under subdivision 1 once a month in the form required by the superintendent. The superintendent must summarize and analyze the information received and submit an annual written report to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over public safety. The superintendent shall submit the information to the Federal Bureau of Investigation.\n(a) The Use of Force Investigations Unit within the Bureau of Criminal Apprehension must investigate any officer-involved death as defined in section 299C.80, subdivision 1, paragraph (c), unless the subject of the investigation is a peace officer employed by the Bureau of Criminal Apprehension. Section 299C.80, subdivision 4, applies to an officer-involved death investigation of a peace officer employed by the Bureau of Criminal Apprehension.\n(b) Law enforcement agencies must fully cooperate with and promptly respond to requests for information from the entity conducting an investigation mandated under paragraph (a).\n(c) An entity that conducts an investigation under this subdivision must prepare a report detailing the entity's investigation and promptly deliver the report to the prosecutor for the county in which the incident occurred. If a prosecuting authority determines that there is no basis to file charges against a peace officer involved in the incident, the prosecutor must simultaneously publicly disclose the prosecutor's determination and all inactive investigative data in the report that are public under section 13.82, subdivision 7, or other applicable law. The prosecutor must cooperate with the entity that conducted the investigation in determining what data in the report must be publicly disclosed.",
	"repealed": false
}