{
	"id": "297A.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.91",
	"title": "297A.91 SEIZURE; COURT REVIEW.",
	"text": "(a) If the retailer does not have a sales or use tax permit and has been engaging in transporting personal property into the state without payment of the tax, the commissioner of revenue or the commissioner's agents may seize in the name of the state any truck, automobile, or means of transportation not owned or operated by a for-hire carrier, used in the illegal importation and transportation of any tangible personal property by a retailer or the retailer's agent or employee. The commissioner may demand the forfeiture and sale of the truck, automobile, or other means of transportation together with the property being transported illegally, unless the owner establishes to the satisfaction of the commissioner or the court that the owner had no notice or knowledge or reason to believe that the vehicle was used or intended to be used in any such violation.\n(b) Within ten days after the seizure, the person making the seizure shall serve by certified mail an inventory of the vehicle and property seized on the person from whom the seizure was made, if known, and on any person known or believed to have any right, title, interest, or lien on the vehicle or property, at the last known address. The person making the seizure shall also file a copy of the inventory with the commissioner. The notice must include an explanation of the right to demand a judicial forfeiture determination.\n(a) Within 60 days after the date of service of the inventory, which is the date of mailing, the person from whom the vehicle and property were seized or any person claiming an interest in the vehicle or property may file a demand for a judicial determination of the question of whether the vehicle or property was lawfully subject to seizure and forfeiture.\n(b) The demand must be in the form of a civil complaint and must be filed with the court administrator in the county in which the seizure occurred, together with proof of service or a copy of the complaint on the commissioner of revenue, and the standard filing fee for civil actions unless the petitioner has the right to sue in forma pauperis under section 563.01. If the value of the seized property or vehicle is $15,000 or less, the claimant may file an action in conciliation court for its recovery. If the value of the seized property or vehicle is less than $500, the claimant does not have to pay the conciliation court filing fee.\n(c) The complaint must be captioned in the name of the claimant as plaintiff and the seized property or vehicle as defendant, and must state with specificity the grounds on which the claimant alleges the property or vehicle was improperly seized and the plaintiff's interest in the property or vehicle seized. No responsive pleading is required of the commissioner, and no court fees may be charged for the commissioner's appearance in the matter. The proceedings are governed by the Rules of Civil Procedure. Notwithstanding any law to the contrary, an action for the return of property or a vehicle seized under this subdivision may not be maintained by or on behalf of any person who has been served with an inventory unless the person has complied with this subdivision. The court shall hear the action without a jury and shall determine the issues of fact and law involved. If a judgment of forfeiture is entered and is not stayed pending an appeal, the commissioner may have the forfeited vehicle and property sold at public auction as provided by law.\nIf no demand for judicial determination is made, the vehicle and property seized are considered forfeited to the state by operation of law and may be disposed of by the commissioner as if there were a judgment of forfeiture. The forfeiture and sale of the automobile, truck, or other means of transportation, and of the property being transported illegally in it, are a penalty for the violation of this chapter. After deducting the expense of keeping the vehicle and property, the fee for seizure, and the costs of the sale, the commissioner shall pay liens from the funds collected. The commissioner shall pay all liens, according to their priority, that are established as being bona fide and as existing without the lienor having any notice or knowledge that the vehicle or property was being used or was intended to be used for or in connection with any such violation. The commissioner shall pay the balance of the proceeds into the state treasury to be credited to the general fund. The state is not liable for any liens in excess of the proceeds from the sale after allowable deductions. A sale under this section frees the vehicle and property sold from all liens.",
	"repealed": false
}