{
	"id": "80A.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.41",
	"title": "80A.41 SECTION 102; DEFINITIONS.",
	"text": "In this chapter, unless the context otherwise requires:\n(1) \"Accredited investor\" means an accredited investor as the term is defined in Rule 501(a) of Regulation D adopted pursuant to the Securities Act of 1933.\n(2) \"Administrator\" means the commissioner of commerce.\n(3) \"Agent\" means an individual, other than a broker-dealer, who represents a broker-dealer in effecting or attempting to effect purchases or sales of securities or represents an issuer in effecting or attempting to effect purchases or sales of the issuer's securities. But a partner, officer, or director of a broker-dealer or issuer, or an individual having a similar status or performing similar functions is an agent only if the individual otherwise comes within the term. The term does not include an individual excluded by rule adopted or order issued under this chapter.\n(4) \"Bank\" means:\n(A) a banking institution organized under the laws of the United States;\n(B) a member bank of the Federal Reserve System;\n(C) any other banking institution, whether incorporated or not, doing business under the laws of a state or of the United States, a substantial portion of the business of which consists of receiving deposits or exercising fiduciary powers similar to those permitted to be exercised by national banks under the authority of the Comptroller of the Currency pursuant to Section 1 of Public Law 87-722 (12 U.S.C. Section 92a), and which is supervised and examined by a state or federal agency having supervision over banks, and which is not operated for the purpose of evading this chapter; and\n(D) a receiver, conservator, or other liquidating agent of any institution or firm included in subparagraph (A), (B), or (C).\n(5) \"Broker-dealer\" means a person engaged in the business of effecting transactions in securities for the account of others or for the person's own account. The term does not include:\n(A) an agent;\n(B) an issuer;\n(C) a depository institution; provided such activities are conducted in accordance with such rules as may be adopted by the administrator;\n(D) an international banking institution; or\n(E) a person excluded by rule adopted or order issued under this chapter.\n(6) \"Depository institution\" means:\n(A) a bank; or\n(B) a savings institution, trust company, credit union, or similar institution that is organized or chartered under the laws of a state or of the United States, authorized to receive deposits, and supervised and examined by an official or agency of a state or the United States if its deposits or share accounts are insured to the maximum amount authorized by statute by the Federal Deposit Insurance Corporation, the National Credit Union Share Insurance Fund, or a successor authorized by federal law. The term does not include:\n(i) an insurance company or other organization primarily engaged in the business of insurance;\n(ii) a Morris Plan bank; or\n(iii) an industrial loan company that is not an \"insured depository institution\" as defined in section 3(c)(2) of the Federal Deposit Insurance Act, United States Code, title 12, section 1813(c)(2), or any successor federal statute.\n(7) \"Federal covered investment adviser\" means a person registered under the Investment Advisers Act of 1940.\n(8) \"Federal covered security\" means a security that is, or upon completion of a transaction will be, a covered security under Section 18(b) of the Securities Act of 1933 (15 U.S.C. Section 77r(b)) or rules or regulations adopted pursuant to that provision.\n(9) \"Filing\" means the receipt under this chapter of a record by the administrator or a designee of the administrator.\n(10) \"Fraud,\" \"deceit,\" and \"defraud\" are not limited to common law deceit.\n(11) \"Guaranteed\" means guaranteed as to payment of all principal and all interest.\n(12) \"Institutional investor\" means any of the following, whether acting for itself or for others in a fiduciary capacity:\n(A) a depository institution or international banking institution;\n(B) an insurance company;\n(C) a separate account of an insurance company;\n(D) an investment company as defined in the Investment Company Act of 1940;\n(E) a broker-dealer registered under the Securities Exchange Act of 1934;\n(F) an employee pension, profit-sharing, or benefit plan if the plan has total assets in excess of $10,000,000 or its investment decisions are made by a named fiduciary, as defined in the Employee Retirement Income Security Act of 1974, that is a broker-dealer registered under the Securities Exchange Act of 1934, an investment adviser registered or exempt from registration under the Investment Advisers Act of 1940, an investment adviser registered under this chapter, a depository institution, or an insurance company;\n(G) a plan established and maintained by a state, a political subdivision of a state, or an agency or instrumentality of a state or a political subdivision of a state for the benefit of its employees, if the plan has total assets in excess of $10,000,000 or its investment decisions are made by a duly designated public official or by a named fiduciary, as defined in the Employee Retirement Income Security Act of 1974, that is a broker-dealer registered under the Securities Exchange Act of 1934, an investment adviser registered or exempt from registration under the Investment Advisers Act of 1940, an investment adviser registered under this chapter, a depository institution, or an insurance company;\n(H) a trust, if it has total assets in excess of $10,000,000, its trustee is a depository institution, and its participants are exclusively plans of the types identified in subparagraph (F) or (G), regardless of the size of their assets, except a trust that includes as participants self-directed individual retirement accounts or similar self-directed plans;\n(I) an organization described in Section 501(c)(3) of the Internal Revenue Code (26 U.S.C. Section 501(c)(3)), corporation, Massachusetts trust or similar business trust, limited liability company, or partnership, not formed for the specific purpose of acquiring the securities offered, with total assets in excess of $10,000,000;\n(J) a small business investment company licensed by the Small Business Administration under Section 301(c) of the Small Business Investment Act of 1958 (15 U.S.C. Section 681(c)) with total assets in excess of $10,000,000;\n(K) a private business development company as defined in Section 202(a)(22) of the Investment Advisers Act of 1940 (15 U.S.C. Section 80b-2(a)(22)) with total assets in excess of $10,000,000;\n(L) a federal covered investment adviser acting for its own account;\n(M) a \"qualified institutional buyer\" as defined in Rule 144A(a)(1), other than Rule 144A(a)(1)(i)(H), adopted under the Securities Act of 1933 (17 C.F.R. 230.144A);\n(N) a \"major U.S. institutional investor\" as defined in Rule 15a-6(b)(4)(i) adopted under the Securities Exchange Act of 1934 (17 C.F.R. 240.15a-6);\n(O) any other person, other than an individual or a private fund, of institutional character with total assets in excess of $10,000,000 not organized for the specific purpose of evading this chapter; or\n(P) any other person specified by rule adopted or order issued under this chapter.\n(13) \"Insurance company\" means a company organized as an insurance company whose primary business is writing insurance or reinsuring risks underwritten by insurance companies and which is subject to supervision by the insurance commissioner or a similar official or agency of a state.\n(14) \"Insured\" means insured as to payment of all principal and all interest.\n(15) \"International banking institution\" means an international financial institution of which the United States is a member and whose securities are exempt from registration under the Securities Act of 1933.\n(16) \"Investment adviser\" means a person that, for compensation, engages in the business of advising others, either directly or through publications or writings, as to the value of securities or the advisability of investing in, purchasing, or selling securities or that, for compensation and as a part of a regular business, issues or promulgates analyses or reports concerning securities. The term includes a financial planner or other person that, as an integral component of other financially related services, provides investment advice to others for compensation as part of a business or that holds itself out as providing investment advice to others for compensation. The term does not include:\n(A) an investment adviser representative;\n(B) a lawyer, accountant, engineer, or teacher whose performance of investment advice is solely incidental to the practice of the person's profession;\n(C) a broker-dealer or its agents whose performance of investment advice is solely incidental to the conduct of business as a broker-dealer and that does not receive special compensation for the investment advice;\n(D) a publisher of a bona fide newspaper, news magazine, or business or financial publication of general and regular circulation;\n(E) a federal covered investment adviser;\n(F) a bank or savings institution;\n(G) any other person that is excluded by the Investment Advisers Act of 1940 from the definition of investment adviser; or\n(H) any other person excluded by rule adopted or order issued under this chapter.\n(17) \"Investment adviser representative\" means an individual employed by or associated with an investment adviser or federal covered investment adviser and who makes any recommendations or otherwise gives investment advice regarding securities, manages accounts or portfolios of clients, determines which recommendation or advice regarding securities should be given, provides investment advice or holds herself or himself out as providing investment advice, receives compensation to solicit, offer, or negotiate for the sale of or for selling investment advice, or supervises employees who perform any of the foregoing. The term does not include an individual who:\n(A) performs only clerical or ministerial acts;\n(B) is an agent whose performance of investment advice is solely incidental to the individual acting as an agent and who does not receive special compensation for investment advisory services;\n(C) is employed by or associated with a federal covered investment adviser, unless the individual has a \"place of business\" in this state as that term is defined by rule adopted under Section 203A of the Investment Advisers Act of 1940 (15 U.S.C. Section 80b-3a) and is\n(i) an \"investment adviser representative\" as that term is defined by rule adopted under Section 203A of the Investment Advisers Act of 1940 (15 U.S.C. Section 80b-3a); or\n(ii) not a \"supervised person\" as that term is defined in Section 202(a)(25) of the Investment Advisers Act of 1940 (15 U.S.C. Section 80b-2(a)(25)); or\n(D) is excluded by rule adopted or order issued under this chapter.\n(18) \"Issuer\" means a person that issues or proposes to issue a security, subject to the following:\n(A) The issuer of a voting trust certificate, collateral trust certificate, certificate of deposit for a security, or share in an investment company without a board of directors or individuals performing similar functions is the person performing the acts and assuming the duties of depositor or manager pursuant to the trust or other agreement or instrument under which the security is issued.\n(B) The issuer of an equipment trust certificate or similar security serving the same purpose is the person by which the property is or will be used or to which the property or equipment is or will be leased or conditionally sold or that is otherwise contractually responsible for assuring payment of the certificate.\n(C) The issuer of a fractional undivided interest in an oil, gas, or other mineral lease or in payments out of production under a lease, right, or royalty is the owner of an interest in the lease or in payments out of production under a lease, right, or royalty, whether whole or fractional, that creates fractional interests for the purpose of sale.\n(19) \"Nonissuer transaction\" or \"nonissuer distribution\" means a transaction or distribution not directly or indirectly for the benefit of the issuer.\n(20) \"Offer to purchase\" includes an attempt or offer to obtain, or solicitation of an offer to sell, a security or interest in a security for value. The term does not include a tender offer that is subject to Section 14(d) of the Securities Exchange Act of 1934 (15 U.S.C. Section 78n(d)).\n(21) \"Person\" means an individual; corporation; business trust; estate; trust; partnership; limited liability company; association; joint venture; government; governmental subdivision, agency, or instrumentality; public corporation; or any other legal or commercial entity.\n(22) \"Place of business\" of a broker-dealer, an investment adviser, or a federal covered investment adviser means:\n(A) an office at which the broker-dealer, investment adviser, or federal covered investment adviser regularly provides brokerage or investment advice or solicits, meets with, or otherwise communicates with customers or clients; or\n(B) any other location that is held out to the general public as a location at which the broker-dealer, investment adviser, or federal covered investment adviser provides brokerage or investment advice or solicits, meets with, or otherwise communicates with customers or clients.\n(23) \"Predecessor Act\" means Minnesota Statutes 2002, sections 80A.01 to 80A.31.\n(24) \"Price amendment\" means the amendment to a registration statement filed under the Securities Act of 1933 or, if an amendment is not filed, the prospectus or prospectus supplement filed under the Securities Act of 1933 that includes a statement of the offering price, underwriting and selling discounts or commissions, amount of proceeds, conversion rates, call prices, and other matters dependent upon the offering price.\n(25) \"Principal place of business\" of a broker-dealer or an investment adviser means the executive office of the broker-dealer or investment adviser from which the officers, partners, or managers of the broker-dealer or investment adviser direct, control, and coordinate the activities of the broker-dealer or investment adviser.\n(26) Only for purposes of calculating the number of purchasers under section 80A.46, clauses (1) and (14), \"purchaser\" does not include:\n(A) any relative, spouse, or relative of the spouse of a purchaser who has the same principal residence as the purchaser;\n(B) any trust or estate in which a purchaser and any of the persons related to him as specified in Regulation D, Rule 501(e)(1)(i) or (e)(1)(ii) collectively have more than 50 percent of the beneficial interest (excluding contingent interests);\n(C) any corporation or other organization of which a purchaser and any of the persons related to the purchaser as specified in Regulation D, Rule 501(e)(1)(i) or (e)(1)(ii) collectively are beneficial owners of more than 50 percent of the equity securities (excluding directors' qualifying shares) or equity interests; and\n(D) any accredited investor.\nA corporation, partnership, or other entity must be counted as one purchaser. If, however, that entity is organized for the specific purpose of acquiring the securities offered and is not an accredited investor, then each beneficial owner of equity securities or equity interests in the entity shall count as a separate purchaser for all provisions of Regulation D, except to the extent provided in Regulation D, Rule 501(e)(1).\nA noncontributory employee benefit plan within the meaning of Title I of the Employee Retirement Income Security Act of 1974 shall be counted as one purchaser where the trustee makes all investment decisions for the plan.\n(27) \"Record,\" except in the phrases \"of record,\" \"official record,\" and \"public record,\" means information that is inscribed on a tangible medium or that is stored in an electronic or other medium and is retrievable in perceivable form.\n(28) \"Sale\" includes every contract of sale, contract to sell, or disposition of, a security or interest in a security for value, and \"offer to sell\" includes every attempt or offer to dispose of, or solicitation of an offer to purchase, a security or interest in a security for value.\n(A) A security given or delivered with, or as a bonus on account of, any purchase of securities or any other thing is considered to constitute part of the subject of the purchase and to have been offered and sold for value.\n(B) A gift of assessable stock is considered to involve an offer and sale.\n(C) A sale or offer of a warrant or right to purchase or subscribe to another security of the same or another issuer and a sale or offer of a security that gives the holder a present or future right or privilege to convert the security into another security of the same or another issuer, are each considered to include an offer of the other security.\n(29) \"Securities and Exchange Commission\" means the United States Securities and Exchange Commission.\n(30) \"Security\" means a note; stock; treasury stock; security future; bond; debenture; evidence of indebtedness; certificate of interest or participation in a profit-sharing agreement; collateral trust certificate; preorganization certificate or subscription; transferable share; investment contract; voting trust certificate; certificate of deposit for a security; fractional undivided interest in oil, gas, or other mineral rights; put, call, straddle, option, or privilege on a security, certificate of deposit, or group or index of securities, including an interest therein or based on the value thereof; put, call, straddle, option, or privilege entered into on a national securities exchange relating to foreign currency; or, in general, an interest or instrument commonly known as a \"security\"; or a certificate of interest or participation in, temporary or interim certificate for, receipt for, guarantee of, or warrant or right to subscribe to or purchase, any of the foregoing. The term:\n(A) includes both a certificated and an uncertificated security;\n(B) does not include an insurance or endowment policy or annuity contract under which an insurance company promises to pay a fixed or variable sum of money either in a lump sum or periodically for life or other specified period;\n(C) does not include an interest in a contributory or noncontributory pension or welfare plan subject to the Employee Retirement Income Security Act of 1974;\n(D) includes as an \"investment contract,\" among other contracts, an interest in a limited partnership and a limited liability company and an investment in a viatical settlement or similar agreement; and\n(E) does not include any equity interest of a closely held corporation or other entity with not more than 35 holders of the equity interest of such entity offered or sold pursuant to a transaction in which 100 percent of the equity interest of such entity is sold as a means to effect the sale of the business of the entity if the transaction has been negotiated on behalf of all purchasers and if all purchasers have access to inside information regarding the entity before consummating the transaction.\n(31) \"Self-regulatory organization\" means a national securities exchange registered under the Securities Exchange Act of 1934, a national securities association of broker-dealers registered under the Securities Exchange Act of 1934, a clearing agency registered under the Securities Exchange Act of 1934, or the Municipal Securities Rulemaking Board established under the Securities Exchange Act of 1934.\n(32) \"Sign\" means, with present intent to authenticate or adopt a record:\n(A) to execute or adopt a tangible symbol; or\n(B) to attach or logically associate with the record an electronic symbol, sound, or process.\n(33) \"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States.\n(34) \"Associated with\" with respect to a person means any partner, officer, director, manager, or employee of such person or any person occupying a similar status or performing similar functions or any person directly or indirectly controlling, controlled by, or in common control with, such person, but does not include a person whose primary duties are ministerial or clerical. \"Employee\" includes an independent contractor who performs advisory functions on behalf of an investment adviser.\n(35) \"Private fund\" means an issuer that would be an investment company as defined in Section 3 of the Investment Company Act of 1940 but for section 3(c)(1) or 3(c)(7) of that act.\n(36) \"Private fund adviser\" means an investment adviser whose only advisory clients are one or more qualifying private funds.\n(37) \"Qualifying private fund\" means a private fund that meets the definition of a qualifying private fund in SEC Rule 203(m)-1, Code of Federal Regulations, title 17, section 275.203(m)-1.\n(38) \"3(c)(1) fund\" means a qualifying private fund that is eligible for the exclusion from the definition of an investment company under section 3(c)(1) of the Investment Company Act of 1940, United States Code, title 15, section 80a-3(c)(1).\n(39) \"Venture capital fund\" means a private fund that meets the definition of a venture capital fund in SEC Rule 203(1)-1, Code of Federal Regulations, title 17, section 275.203(1)-1.\n(40) \"Funding portal\" means any person acting as a funding portal as defined in section 3(a)(80) of the Securities Exchange Act of 1934, United States Code, title 15, section 78c(a)(80), and any rule adopted or order issued thereunder.",
	"repealed": false
}