{
	"id": "340A.412#stat.340A.412.1",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.412#stat.340A.412.1",
	"title": "340A.412 LICENSE RESTRICTIONS; INTOXICATING LIQUOR LICENSES.",
	"text": "MS 1988 [Repealed, 1989 c 49 s 8]\n(a) The city or county having jurisdiction over on-sale licenses to sell intoxicating liquor shall on initial application for an on-sale license or on application for a transfer of an existing license conduct a preliminary background and financial investigation of the applicant. The application must be in the form prescribed by the commissioner and with any additional information as the governing body of the city or county having jurisdiction over the license requires. If the governing body of the city or county having jurisdiction determines or if the commissioner on the commissioner's own initiative determines that a comprehensive background and investigation of the applicant is necessary, the governing body may conduct the investigation itself or contract with the commissioner for the investigation. In addition, an investigation may be required prior to renewal of an existing on-sale license when the governing body of the city or county deems it in the public interest. An investigation fee not to exceed $500 shall be charged an applicant by the city or county if the investigation is conducted within the state, or the actual cost not to exceed $10,000 if the investigation is required outside the state.\n(b) No license may be issued, transferred, or renewed if the results of the investigation show, to the satisfaction of the governing body, that issuance, transfer, or renewal would not be in the public interest.\n(a) A municipality may not issue more than one off-sale intoxicating liquor license to any one person or for any one place.\n(b) A municipality may not allow the same business name to be used by more than one of its off-sale intoxicating liquor licensees.\n(c) For purposes of this subdivision, \"person\" means:\n(1) a holder of an off-sale intoxicating liquor license;\n(2) an officer, director, agent, or employee of a holder of an off-sale intoxicating liquor license; or\n(3) an affiliate of a holder of an off-sale intoxicating liquor license, regardless of whether the affiliation is corporate or by management, direction, or control.\n(a) No license to sell intoxicating liquor may be issued within the following areas:\n(1) where restricted against commercial use through zoning ordinances and other proceedings or legal processes regularly had for that purpose, except licenses may be issued to restaurants in areas which were restricted against commercial uses after the establishment of the restaurant;\n(2) within the Capitol or on the Capitol grounds, except as provided under Laws 1983, chapter 259, section 9, or Laws 1999, chapter 202, section 13;\n(3) on the State Fairgrounds, except as provided under section 37.21, subdivision 2;\n(4) on the campus of the College of Agriculture of the University of Minnesota;\n(5) within 1,000 feet of a state hospital, training school, reformatory, prison, or other institution under the supervision or control, in whole or in part, of the Direct Care and Treatment executive board or the commissioner of corrections;\n(6) in a town or municipality in which a majority of votes at the last election at which the question of license was voted upon were not in favor of license under section 340A.416, or within one-half mile of any such town or municipality, except that intoxicating liquor manufactured within this radius may be sold to be consumed outside it; and\n(7) within 1,500 feet of any public school that is not within a city.\n(b) The restrictions of this subdivision do not apply to a manufacturer or wholesaler of intoxicating liquor or to a drugstore or to a person who had a license originally issued lawfully prior to July 1, 1967.\nAn intoxicating liquor license may not be issued to a person in connection with the premises of another to whom a license could not be issued under the provisions of this chapter. This subdivision does not prevent the granting of a license to a proper lessee because the person has leased the premises of a minor, a noncitizen who is not a resident alien, or a person who has been convicted of a crime other than a violation of this chapter.\nAn off-sale intoxicating liquor license may not be issued to a place where 3.2 percent malt liquor is sold for consumption on the premises. This subdivision does not apply to those places where both an on-sale and off-sale license or a combination license have been issued under section 340A.406.\nNo intoxicating liquor license may be issued to a person operating a drugstore unless the person has operated it for at least two years or has purchased a drugstore that has been in continuous operation for two or more years.\nAll intoxicating liquor licenses issued by a county or a city, other than cities of the first class, must expire on the same date.\nA license may be transferred with the consent of the issuing authority, provided that a license issued to a location at a racetrack licensed under chapter 240 may not be transferred. Where a license is held by a corporation, a change in ownership of ten percent or more of the stock of the corporation must be reported in writing to the authority who issued the license within ten days of the transfer.\nNo person under 18 years of age may serve or sell intoxicating liquor in a retail intoxicating liquor establishment.\nA city having territory in which the sale of intoxicating liquor has been prohibited by law or charter and in which real property taken for a public purpose by negotiation or eminent domain proceedings was, immediately prior to the taking, actually and lawfully used for the sale of intoxicating liquor, may reissue the license previously issued to the location at any otherwise lawful location in the city. A change of location due to taking after July 1, 1972, must have been accomplished by July 1, 1976, but these licenses may be renewed, reissued, transferred, or relocated after that date.\nA holder of a retail intoxicating liquor license or a municipal liquor store may not store any intoxicating liquor at any location other than the licensed premises except with the written permission of the commissioner.\nA city of the first class may not renew an on-sale intoxicating liquor license if the holder of the license has not made on-sales authorized by the license at any time during the one-year period immediately prior to the date of renewal.\n(a) Except as otherwise provided in this subdivision, an exclusive liquor store may sell only the following items:\n(1) alcoholic beverages;\n(2) tobacco products;\n(3) ice;\n(4) beverages, either liquid or powder, specifically designated for mixing with intoxicating liquor;\n(5) soft drinks;\n(6) liqueur-filled candies;\n(7) food products that contain more than one-half of one percent alcohol by volume;\n(8) cork extraction devices;\n(9) books and videos on the use of alcoholic beverages;\n(10) magazines and other publications published primarily for information and education on alcoholic beverages;\n(11) multiple-use bags designed to carry purchased items;\n(12) devices designed to ensure safe storage and monitoring of alcohol in the home, to prevent access by underage drinkers;\n(13) home brewing equipment;\n(14) clothing marked with the specific name, brand, or identifying logo of the exclusive liquor store, and bearing no other name, brand, or identifying logo;\n(15) citrus fruit;\n(16) glassware;\n(17) edible cannabinoid products as defined in section 151.72, subdivision 1, paragraph (e); and\n(18) products that detect the presence of fentanyl or a fentanyl analog.\n(b) An exclusive liquor store that has an on-sale, or combination on-sale and off-sale license may sell food for on-premise consumption when authorized by the municipality issuing the license.\n(c) An exclusive liquor store may offer live or recorded entertainment.\n[See Note.]",
	"repealed": false
}