{
	"id": "347.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.15",
	"title": "347.15 PERSONS DAMAGED, CLAIMS FILED.",
	"text": "The owner of any domestic animals, including poultry and game birds, attacked, chased, worried, injured, or killed by a dog or dogs may, within ten days after the owner shall have knowledge or notice thereof, file a written claim for damages with the clerk of the town or city in which the damage occurred. The form of such claim may be prescribed by the county auditor. Upon presentation of such claim the supervisors of the town, the board of trustees of the statutory city, or the council of the city, or a committee appointed for that purpose by the supervisors, the board of trustees or the council, shall promptly investigate the claim and may subpoena witnesses, administer oaths, and take testimony relative thereto and shall, within 30 days after the filing of the claim, make, certify, and return to the county auditor the claim, a report of the investigation, the testimony taken, and the amount of damages, if any, suffered by the owner of the animals.\nThe form of the report and certification shall be prescribed by the county auditor and shall be subscribed by the supervisors, board, or committee making the same. The county auditor shall lay before the county board, at its first meeting following the receipt of the claim, all claims so filed and reported and the same shall be acted upon and determined by the county board as other claims are determined and acted upon, and the county board shall equalize the values and claims between and within the various towns of the county. The amount of damages filed and reported to the county auditor shall be prima facie proof of the actual damages sustained, but evidence may be taken before the county board relative to the claims as in other cases, and appeals from the action of the county board shall lie as in other cases. On appeal from the action of the county board, the trial shall be by the court without a jury.\nSuch claims shall be solely against the dog license fund and shall create no other liability on the part of the county.\nThe amount allowed by the county board upon any such claim shall in no case exceed $100 for each horse, mule, or bovine; $15 for each sheep or goat; $30 for each swine; or $3 for each fowl. When the claimant shall furnish conclusive evidence as to the ownership of the dog or dogs doing the damage the claimant shall be paid the full amount of the claim submitted.\nDistribution of the dog license fund among claimants for loss of animals by dogs within the license year shall be made at the close of the license year.",
	"repealed": false
}