{
	"id": "144.294",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.294",
	"title": "144.294 RECORDS RELATING TO MENTAL HEALTH.",
	"text": "Upon the written request of a spouse, parent, child, or sibling of a patient being evaluated for or diagnosed with mental illness, a provider shall inquire of a patient whether the patient wishes to authorize a specific individual to receive information regarding the patient's current and proposed course of treatment. If the patient so authorizes, the provider shall communicate to the designated individual the patient's current and proposed course of treatment. Section 144.293, subdivisions 2 and 4, apply to consents given under this subdivision.\nNotwithstanding section 144.293, subdivisions 2 and 4, a provider must disclose health records relating to a patient's mental health to a law enforcement agency if the law enforcement agency provides the name of the patient and communicates that the:\n(1) patient is currently involved in a mental health crisis as defined in section 256B.0624, subdivision 2, paragraph (j), to which the law enforcement agency has responded; and\n(2) disclosure of the records is necessary to protect the health or safety of the patient or of another person.\nThe scope of disclosure under this subdivision is limited to the minimum necessary for law enforcement to safely respond to the mental health crisis. The disclosure may include the name and telephone number of the psychiatrist, psychologist, therapist, mental health professional, practitioner, or case manager of the patient, if known; and strategies to address the mental health crisis. A law enforcement agency that obtains health records under this subdivision shall maintain a record of the requestor, the provider of the information, and the patient's name. Health records obtained by a law enforcement agency under this subdivision are private data on individuals as defined in section 13.02, subdivision 12, and must not be used by law enforcement for any other purpose. A law enforcement agency that obtains health records under this subdivision shall inform the patient that health records were obtained.\n(a) Notwithstanding section 144.293, a provider providing mental health care and treatment may disclose health record information described in paragraph (b) about a patient to a family member of the patient or other person who requests the information if:\n(1) the request for information is in writing;\n(2) the family member or other person lives with, provides care for, or is directly involved in monitoring the treatment of the patient;\n(3) the involvement under clause (2) is verified by the patient's mental health care provider, the patient's attending physician, or a person other than the person requesting the information, and is documented in the patient's medical record;\n(4) before the disclosure, the patient is informed in writing of the request, the name of the person requesting the information, the reason for the request, and the specific information being requested;\n(5) the patient agrees to the disclosure, does not object to the disclosure, or is unable to consent or object, and the patient's decision or inability to make a decision is documented in the patient's medical record; and\n(6) the disclosure is necessary to assist in the provision of care or monitoring of the patient's treatment.\n(b) The information disclosed under this paragraph is limited to diagnosis, admission to or discharge from treatment, the name and dosage of the medications prescribed, side effects of the medication, consequences of failure of the patient to take the prescribed medication, and a summary of the discharge plan.\n(c) If a provider reasonably determines that providing information under this subdivision would be detrimental to the physical or mental health of the patient or is likely to cause the patient to inflict self harm or to harm another, the provider must not disclose the information.\n(d) This subdivision does not apply to disclosures for a medical emergency or to family members as authorized or required under subdivision 1 or section 144.293, subdivision 5, clause (1).",
	"repealed": false
}