{
	"id": "373.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/373.01",
	"title": "373.01 POWERS.",
	"text": "(a) Each county is a body politic and corporate and may:\n(1) Sue and be sued.\n(2) Acquire and hold real and personal property for the use of the county, and lands sold for taxes as provided by law.\n(3) Purchase and hold for the benefit of the county real estate sold by virtue of judicial proceedings, to which the county is a party.\n(4) Sell, lease, and convey real or personal estate owned by the county, and give contracts or options to sell, lease, or convey it, and make orders respecting it as deemed conducive to the interests of the county's inhabitants.\n(5) Make all contracts and do all other acts in relation to the property and concerns of the county necessary to the exercise of its corporate powers.\n(b) No sale, lease, or conveyance of real estate owned by the county, except the lease of a residence acquired for the furtherance of an approved capital improvement project, nor any contract or option for it, shall be valid, without first advertising for bids or proposals in the official newspaper of the county and the county's website for three consecutive weeks, and once in a newspaper of general circulation in the area where the property is located. The notice shall state the time, place, and manner of considering and accepting proposals, contain a legal description of any real estate, and a brief description of any personal property. After publication in the official newspaper, county website, and relevant newspaper of general circulation, bids may be solicited and accepted by the online auction process authorized in section 471.345, subdivision 17. Leases and proposals that do not exceed $15,000 for any one year may be negotiated and are not subject to the competitive bid procedures of this section. All proposals estimated to exceed $15,000 in any one year shall be considered at the time set for accepting proposals, and the one most favorable to the county accepted, but the county board may, in the interest of the county, reject any or all proposals.\n(c) Sales of personal property the value of which is estimated to be $15,000 or more shall be made only after advertising for bids or proposals in the county's official newspaper, on the county's website, or in a recognized industry trade journal. At the same time it posts on its website or publishes in a trade journal, the county must publish in the official newspaper, either as part of the minutes of a regular meeting of the county board or in a separate notice, a summary of all requests for bids or proposals that the county advertises on its website or in a trade journal. After publication in the official newspaper, on the website, or in a trade journal, bids or proposals may be solicited and accepted by the electronic selling process authorized in section 471.345, subdivision 17. Sales of personal property the value of which is estimated to be less than $15,000 may be made either on competitive bids or in the open market, in the discretion of the county board. \"Website\" means a specific, addressable location provided on a server connected to the Internet and hosting World Wide Web pages and other files that are generally accessible on the Internet all or most of a day.\n(d) Notwithstanding anything to the contrary herein, the county may, when acquiring real property for county highway right-of-way, exchange parcels of real property of substantially similar or equal value without advertising for bids. The estimated values for these parcels shall be determined by the county assessor.\n(e) Notwithstanding anything in this section to the contrary, the county may, when acquiring real property for purposes other than county highway right-of-way, exchange parcels of real property of substantially similar or equal value without advertising for bids. The estimated values for these parcels must be determined by the county assessor or a private appraisal performed by a licensed Minnesota real estate appraiser. For the purpose of determining for the county the estimated values of parcels proposed to be exchanged, the county assessor need not be licensed under chapter 82B. Before giving final approval to any exchange of land, the county board shall hold a public hearing on the exchange. At least two weeks before the hearing, the county auditor shall post a notice in the auditor's office and the official newspaper of the county of the hearing that contains a description of the lands affected.\n(f) If real estate or personal property remains unsold after advertising for and consideration of bids or proposals the county may employ a broker to sell the property. The broker may sell the property for not less than 90 percent of its appraised market value as determined by the county. The broker's fee shall be set by agreement with the county but may not exceed ten percent of the sale price and must be paid from the proceeds of the sale.\n(g) A county or its agent may rent a county-owned residence acquired for the furtherance of an approved capital improvement project subject to the conditions set by the county board and not subject to the conditions for lease otherwise provided by paragraph (a), clause (4), and paragraphs (b), (c), (d), (f), and (h).\n(h) In no case shall lands be disposed of without there being reserved to the county all iron ore and other valuable minerals in and upon the lands, with right to explore for, mine and remove the iron ore and other valuable minerals, nor shall the minerals and mineral rights be disposed of, either before or after disposition of the surface rights, otherwise than by mining lease, in similar general form to that provided by section 93.20 for mining leases affecting state lands. The lease shall be for a term not exceeding 50 years, and be issued on a royalty basis, the royalty to be not less than 25 cents per ton of 2,240 pounds, and fix a minimum amount of royalty payable during each year, whether mineral is removed or not. Prospecting options for mining leases may be granted for periods not exceeding one year. The options shall require, among other things, periodical showings to the county board of the results of exploration work done.\n(i) Notwithstanding anything in this subdivision to the contrary, the county may, when selling real property owned in fee simple that cannot be improved because of noncompliance with local ordinances regarding minimum area, shape, frontage, or access, proceed to sell the nonconforming parcel without advertising for bid. At the county's discretion, the real property may be restricted to sale to adjoining landowners or may be sold to any other interested party. The property shall be sold to the highest bidder, but in no case shall the property be sold for less than 90 percent of its fair market value as determined by the county assessor. All owners of land adjoining the land to be sold shall be given a written notice at least 30 days before the sale. This paragraph shall be liberally construed to encourage the sale of nonconforming real property and promote its return to the tax roles.\nNotwithstanding any other contrary law, a county may enter into a rental purchase agreement or conditional sales agreement to acquire road equipment but the seller shall be limited to the remedy of recovery of the property in case of nonpayment of all or part of the purchase price. The purchase price shall be payable over not more than five years.\n(a) A county board may, by resolution and without referendum, issue capital notes subject to the county debt limit to purchase capital equipment useful for county purposes that has an expected useful life at least equal to the term of the notes. The notes shall be payable in not more than 20 years and shall be issued on the terms and in the manner determined by the board. A tax levy shall be made for payment of the principal and interest on the notes, in accordance with section 475.61, as in the case of bonds.\n(b) For purposes of this subdivision, \"capital equipment\" means:\n(1) public safety, ambulance, road construction or maintenance, and medical equipment;\n(2) computer hardware and software, whether bundled with machinery or equipment or unbundled, together with application development services and training related to the use of the computer hardware or software; and\n(3) projects that eliminate R-22, as defined in section 240A.09, paragraph (b), clause (2).\nThe county board of any county may, by resolution, issue and sell as many certificates of indebtedness as may be needed in anticipation of the collection of taxes levied for any fund named in the tax levy for the purpose of raising money for such fund, but the certificates outstanding for any such separate funds shall not on the date on which the certificates are issued exceed 75 percent of the amount of taxes previously levied for such fund remaining uncollected. No certificate shall be issued to become due and payable later than 15 months after the deadline for the certification of the property tax levy under section 275.07, subdivision 1, and the certificates shall not be sold for less than par and accrued interest. The certificates of indebtedness may be issued at any time after the levy has been finally made and certified to the county auditor. They shall be numbered consecutively, be in denominations of $100 or a multiple thereof, may have interest coupons attached, shall be otherwise of such form and terms, and may be made payable at such place, as will best aid in their negotiation, and the proceeds of the tax assessed and collected on account of the fund and the full faith and credit of the county shall be irrevocably pledged for the redemption and payment of the certificates so issued. Such certificates shall be payable primarily from the moneys derived from the levy for the years against which such certificates were issued, but shall constitute unlimited general obligations of the county. Money derived from the sale of such certificates shall be credited to the fund or funds the taxes for which are so anticipated.",
	"repealed": false
}