{
	"id": "90.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.101",
	"title": "90.101 TIMBER SOLD AT PUBLIC AUCTION.",
	"text": "The commissioner may sell the timber on any tract of state land and may determine the number of sections or fractional sections of land to be included in the permit area covered by any one permit issued to the purchaser of timber on state lands, or in any one contract or other instrument relating thereto. No timber shall be sold, except (1) to the highest responsible bidder at public auction, or (2) if unsold at public auction, the commissioner may offer the timber for private sale for a period of no more than one year after the public auction to any responsible bidder who pays the appraised value for the timber. The minimum price shall be the appraised value as fixed by the report of the state appraiser. Sales may include tracts in more than one contiguous county or forestry administrative area and shall be held either in the county or forestry administrative area in which the tract is located or in an adjacent county or forestry administrative area that is nearest the tract offered for sale or that is most accessible to potential bidders. In adjoining counties or forestry administrative areas, sales may not be held less than two hours apart.\nAt least 30 days before the date of sale, the commissioner shall compile a list containing a description of each tract of land upon which any timber to be offered is situated and a statement of the estimated quantity of timber and of the appraised price of each kind of timber thereon as shown by the report of the state appraiser. No description shall be added after the list is posted and no timber shall be sold from land not described in the list. Copies of the list must be furnished to all interested applicants. At least 30 days before the date of sale, a copy of the list must be posted on the Internet or conspicuously posted in the forest office or other public facility most accessible to potential bidders. The commissioner may give other published or posted notice as the commissioner deems proper to reach prospective bidders.",
	"repealed": false
}