{
	"id": "122A.74",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.74",
	"title": "122A.74 PRINCIPALS' LEADERSHIP INSTITUTE.",
	"text": "(a) The commissioner of education may contract with the Minnesota State University Mankato or the regents of the University of Minnesota to establish a Principals' Leadership Institute to provide professional development to school principals by:\n(1) creating a network of leaders in the educational and business communities to communicate current and future trends in leadership techniques;\n(2) helping to create a vision for the school that is aligned with the community and district priorities;\n(3) developing strategies to retain highly qualified teachers and ensure that diverse student populations, including at-risk students, children with disabilities, English learners, and gifted students, among others, have equal access to these highly qualified teachers; and\n(4) providing training to analyze data using culturally competent tools.\n(b) The University of Minnesota must cooperate with participating members of the business community to provide funding and content for the institute.\n(c) Participants must agree to attend the Principals' Leadership Institute for four weeks during the academic summer.\n(d) The Principals' Leadership Institute must incorporate program elements offered by leadership programs at the University of Minnesota and program elements used by the participating members of the business community to enhance leadership within their businesses.\n(a) The board of each school district in the state may select a principal, upon the recommendation of the district's superintendent and based on the principal's leadership potential, to attend the institute.\n(b) The school board annually shall forward its list of recommended participants to the commissioner by February 1. In addition, a principal may submit an application directly to the commissioner by February 1. The commissioner shall notify the school board, the principal candidates, and the University of Minnesota of the principals selected to participate in the Principals' Leadership Institute each year.",
	"repealed": false
}