{
	"id": "128C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/128C.02",
	"title": "128C.02 DUTIES, POLICIES, CRITERIA, RULES OF BOARD.",
	"text": "The board shall establish and adopt policies, including a policy on corporate sponsorships and similar agreements, make decisions on behalf of the league, and establish advisory committees necessary to carry out board functions.\nThe board of the league shall adopt a policy, rules, penalties, and recommendations addressing sexual harassment and sexual violence and hazing toward and by participants in league activities.\nThe board must develop criteria for the league to use when it is asked to arrange for membership in an interscholastic conference by a league member under section 128C.07. The league must give notice and an opportunity for league members to be heard before adopting the criteria. The criteria must include, at least, the distance to be traveled by competing schools, the relative enrollments of the schools, and the comparability of extracurricular activities in the schools.\n[Repealed, 2000 c 498 s 1]\nThe league may adopt a concussion awareness, safety, and protection policy that exceeds the requirements of section 121A.38.\nThe league must provide school coaches with eating disorder prevention education resources developed specifically for school coaches about the nature and risks of eating disorders, including the risk factors, mitigation strategies, effects, and risks of undiagnosed and untreated eating disorders, consistent with current medical research.\nThe rules of the league are exempt from chapter 14, including section 14.386.\n(a) The league shall adopt league rules and regulations governing the athletic participation of pupils attending school in a nonresident district under section 124D.03.\n(b) Notwithstanding other law or league rule or regulation to the contrary, when a student enrolls in or is readmitted to a recovery-focused high school after successfully completing a licensed program for treatment of alcohol or substance abuse, mental illness, or emotional disturbance, the student is immediately eligible to participate on the same basis as other district students in the league-sponsored activities of the student's resident school district. Nothing in this paragraph prohibits the league or school district from enforcing a league or district penalty resulting from the student violating a league or district rule.\n(c) The league shall adopt league rules making a student with an individualized education program who transfers from one public school to another public school as a reasonable accommodation to reduce barriers to educational access immediately eligible to participate in league-sponsored varsity competition on the same basis as other students in the school to which the student transfers. The league also must establish guidelines, consistent with this paragraph, for reviewing the 504 plan of a student who transfers between public schools to determine whether the student is immediately eligible to participate in league-sponsored varsity competition on the same basis as other students in the school to which the student transfers.\nThe board annually shall prepare a written report containing the information about the league that the commissioner is required to obtain and review under section 128C.20. The board shall present copies of the report in a timely manner to the education committees of the legislature.\nThe league shall adopt league rules and policy requiring, to the extent possible, the equal employment of women as referees for high school activities and sports contests, from game level to tournament level.\n[Repealed, 1Sp2003 c 9 art 2 s 56]\nIn purchasing goods and services, the league must follow all laws that apply to school districts under sections 123B.52 and 471.345.",
	"repealed": false
}