{
	"id": "120B.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.241",
	"title": "120B.241 COMPUTER SCIENCE EDUCATION ADVANCEMENT PROGRAM.",
	"text": "(a) \"Computer science\" means the study of computers and algorithmic processes, including their principles, their hardware and software designs, their implementation, and their impact on society.\n(b) \"Computer science courses and content\" means courses at:\n(1) elementary and middle schools that teach computer science as standalone implementations or embedded in other subjects; and\n(2) high schools that teach computer science as standalone courses and focus on teaching students how to create new technologies.\n(c) \"High-quality computer science educator training\" means activities that:\n(1) clarify the conceptual foundations of computer science;\n(2) teach research-based practices, including hands-on and inquiry-based learning;\n(3) are primarily intended for existing teachers with or without prior exposure to computer science with options for advanced training for teachers; and\n(4) align to existing integrated computer science standards in Minnesota or nationally recognized standards, including the Computer Science Teachers' Association's kindergarten through grade 12 computer science education standards.\n(d) \"High-quality computer science professional learning providers\" means institutions of higher education, nonprofits, other state-funded entities, or private entities that have successfully designed, implemented, and scaled high-quality computer science professional learning for teachers as defined in paragraph (c).\n(e) \"STEAM\" means science, technology, engineering, arts, and mathematics.\nThe Department of Education must employ a computer science supervisor dedicated to:\n(1) the implementation of this section and the implementation of the computer science education strategic plan developed by the working group under subdivision 3;\n(2) outreach to districts that need additional supports to create or advance their computer science programs; and\n(3) supporting districts in using existing and available resources for districts to create and advance their computer science programs.\n(a) The Department of Education shall establish a computer science education working group to develop a state strategic plan for long-term and sustained growth of computer science education in all kindergarten through grade 12 school districts and charter schools. The commissioner of education must appoint members of the working group by October 1, 2023.\n(b) Demographics of the working group must be inclusive and represent the diversity of the state, including but not limited to racial, ethnic, and geographic diversity, and diversity related to gender and sexual orientation.\n(c) Meetings of the advisory committee are subject to the Open Meeting Law under Minnesota Statutes, chapter 13D.\n(d) The computer science education advisory committee shall consist of the following members:\n(1) the commissioner of education or the commissioner's designee;\n(2) the commissioner of higher education or the commissioner's designee;\n(3) one representative of the Professional Educator Licensing and Standards Board;\n(4) one representative of the Computer Science Teachers Association of Minnesota;\n(5) one representative from the business community employing computer scientists or technologists;\n(6) one representative from the Minnesota Technology Association;\n(7) one representative from a nonprofit organization working with students and teachers in computer science;\n(8) one representative from the Minnesota Association of School Administrators;\n(9) one representative from Education Minnesota;\n(10) one representative from the Minnesota Association of Colleges for Teacher Education;\n(11) one representative from CSforAll Minnesota;\n(12) one licensed library media specialist;\n(13) one representative from the Minnesota School Boards Association;\n(14) one representative from SciMathMN;\n(15) one representative from the Tribal Nations Education Committee;\n(16) one high school student enrolled in a school with fewer than 1,000 students and one high school student enrolled in a school with more than 1,000 students; and\n(17) four computer science teachers that teach at schools of different sizes, including at least one teacher of students in kindergarten to grade 5, one teacher of students in grades 6 to 8, and one teacher of students in grades 9 to 12, and one career and technical education teacher.\n(e) The computer science education working group shall develop a state strategic plan for a statewide computer science education program that includes but is not limited to:\n(1) a statement of purpose that describes the objectives or goals the Department of Education will accomplish by implementing a computer science education program, the strategies by which those goals will be achieved, and a timeline for achieving those goals;\n(2) a summary of the current state landscape for kindergarten through grade 12 computer science education, including diversity of students taking these courses;\n(3) the creation or expansion of flexible options to license computer science teachers, which may include approval codes, technical permits, ancillary licenses, and standard licenses;\n(4) a description of how the state will support the expansion of computer science education opportunities in every public school and public charter school in the state within five years, with a focus on ensuring equitable access;\n(5) identifying high-quality computer science professional learning providers for teachers;\n(6) an ongoing evaluation process that is overseen by the Department of Education;\n(7) proposed rules that incorporate the principles of the state strategic plan into the state's public education system as a whole;\n(8) recommendations for long-term expansion and sustainability of computer science education, including:\n(i) implementation of a requirement that every kindergarten through grade 12 public school and public charter school employs at least one certified or endorsed computer science teacher, which may be met through multiple approved processes for certification and endorsement, including but not limited to endorsing a certified teacher as determined by the Professional Educator Licensing and Standards Board endorsed in another subject area;\n(ii) expansion of a high school credit equivalency for computer science;\n(iii) the development of standalone kindergarten through grade 12 standards for computer science; and\n(iv) training preservice teachers in computer science education; and\n(9) a description of existing gaps in computer science education access, participation, and success by geography and subgroup of students and a description of how to equitably address these gaps.\n(f) By February 29, 2024, the Department of Education shall publish the proposed state strategic plan for public feedback.\n(g) By March 22, 2024, the Department of Education shall present the adopted state strategic plan described in paragraph (e) to the chairs of the legislative committees with jurisdiction over education.\n(h) The commissioner of education, or the commissioner of education's designee, may approve updates and changes to the state strategic plan described in paragraph (e) as necessary for the successful implementation of kindergarten through grade 12 computer science education.\n(i) The Department of Education shall update the legislative committees with jurisdiction over education on all changes to the strategic plan described in paragraph (e) approved by the commissioner of education's designee since the last presentation to each respective entity.\n(a) The Department of Education shall develop and implement, or award grants or subcontract with eligible entities, for the development and implementation of high-quality, coordinated teacher recruitment and educator training programs for computer science courses and content as defined in subdivision 1 and aligned to the state strategic plan as developed under subdivision 3.\n(b) For the purposes of this subdivision, eligible entities include:\n(1) a consortium of local educational agencies in the state; and\n(2) high-quality computer science professional learning providers, including institutions of higher education in the state that are reasonably accessible geographically to all Minnesota educators, nonprofits, other state-funded entities, or private entities working in partnership with a consortium of local educational agencies.\n(c) For purposes of this subdivision, eligible uses of funding include:\n(1) high-quality professional learning opportunities for kindergarten through grade 12 computer science content that:\n(i) are created and delivered in a consistent manner across the state;\n(ii) are made available with no out-of-pocket expenses to educators, including teachers, counselors, administrators, and other district employees as approved by the Department of Education, schools, and school districts;\n(iii) are made available asynchronously online, in person, and online or hybrid as determined appropriate by the Department of Education; and\n(iv) include introductory, intermediate, and advanced trainings aligned to the kindergarten through grade 12 academic standards or, as necessary, other standards approved by the Department of Education, specified for each of the grade bands kindergarten through grade 2, grades 3 to 5, grades 6 to 8, and grades 9 to 12;\n(2) professional learning opportunities for educators of students in grades 9 to 12 that may include trainings for advanced placement, international baccalaureate, and concurrent enrollment credit computer science courses;\n(3) travel expenses for kindergarten through grade 12 computer science teachers:\n(i) for attending training opportunities under clauses (1) and (2); and\n(ii) deemed appropriate and approved by the commissioner of education, or the commissioner of education's designee;\n(4) any future credentialing for kindergarten through grade 12 computer science teachers, including Career and Technical Education and academic endorsements;\n(5) supports for kindergarten through grade 12 computer science professional learning, including mentoring and coaching;\n(6) creation and deployment of resources to promote training opportunities and recruitment of kindergarten through grade 12 computer science teachers;\n(7) creation or purchase of resources to support implementation approved by the commissioner of education, or the commissioner of education's designee;\n(8) creation and deployment of resources to promote learning opportunities or recruit students to engage in the learning opportunities;\n(9) development of teacher credentialing programs;\n(10) planning for districts to implement or expand computer science education opportunities; and\n(11) employment, or grant for employment, of personnel or contractors to oversee the statewide initiative, develop programs and trainings, and deliver training opportunities under clause (1).\n(d) As a condition of receiving any funding through grants or subcontracts, eligible entities must submit an application to the Department of Education. The application must, at a minimum, address how the entity will:\n(1) reach new and existing teachers with little to no computer science background;\n(2) attract and support educators from schools that currently do not have established computer science education programs;\n(3) use research- or evidence-based practices for high-quality professional development;\n(4) focus the professional learning on the conceptual foundations of computer science;\n(5) reach and support subgroups underrepresented in computer science;\n(6) provide teachers with concrete experience through hands-on, inquiry-based practices;\n(7) accommodate the particular teacher and student needs in each district and school; and\n(8) ensure that participating districts begin offering courses or content within the same or subsequent school year after the teacher receives the professional learning.\n(e) The Department of Education shall prioritize the following applications:\n(1) consortiums of local educational agencies that are working in partnership with providers of high-quality professional learning for kindergarten through grade 12 computer science;\n(2) proposals that describe strategies to increase enrollment overall, including but not limited to subgroups of students that are traditionally underrepresented in computer science; and\n(3) proposals from rural or urban areas with a low penetration of kindergarten through grade 12 computer science offerings, including local education consortiums within these areas.\n(f) The award recipient shall report, for all funding received under this section annually, at a minimum:\n(1) the number of teachers:\n(i) trained within each elementary, middle, and high school; and\n(ii) trained within trainings offered as outlined in paragraph (c), clause (1), item (iv);\n(2) the number of trainings offered in advanced placement, international baccalaureate, and concurrent enrollment credit computer science courses; and\n(3) the number of teachers, and percentage of teachers trained, that started implementing computer science courses limited to middle and high school implementation.\n(g) The Department of Education shall make these reports public. The publicly released data shall not include student-level personally identifiable information.\nOn and after July 1, 2027, any program of teacher preparation leading to professional certification shall include, as part of the curriculum, instruction in computer science as applied to student learning and classroom instruction that are grade-level and subject-area appropriate.\n(a) The Department of Education shall require all high schools to report data and information about computer science course offerings and enrollment.\n(b) The Department of Education shall develop a plan for the secure and regular reporting of computer science course offerings and enrollment data from schools with kindergarten to grade 8 bands within 90 days of enactment of this act.\n(c) Data collected in processes described in paragraphs (a) and (b) should be disaggregated by gender, race, ethnicity, free and reduced-price meals status, Individuals with Disabilities Education Act status, 504 status, and English language learner status.\nThe Department of Education and Professional Educator Standards and Licensing Board may adopt rules under this section, including rules for flexible options to license computer science teachers, approval codes, technical permits, ancillary licenses, and standard licenses.",
	"repealed": false
}