{
	"id": "13D.015",
	"url": "https://www.revisor.mn.gov/statutes/cite/13D.015",
	"title": "13D.015 STATE ENTITY MEETINGS BY TELEPHONE OR INTERACTIVE TECHNOLOGY.",
	"text": "This section applies to:\n(1) a state agency, board, commission, or department, and a statewide public pension plan defined in section 356A.01, subdivision 24; and\n(2) a committee, subcommittee, board, department, or commission of an entity listed in clause (1).\nAn entity listed in subdivision 1 may conduct a meeting governed by this section and section 13D.01, subdivisions 1, 2, 4, and 5, by telephone or interactive technology so long as the following conditions are met:\n(1) all members of the entity participating in the meeting, wherever their physical location, can hear one another and can hear all discussion and testimony;\n(2) members of the public present at the regular meeting location of the entity can hear all discussion and all votes of members of the entity and participate in testimony;\n(3) at least one member of the entity is physically present at the regular meeting location; and\n(4) all votes are conducted by roll call, so each member's vote on each issue can be identified and recorded.\nEach member of the entity participating in a meeting by telephone or interactive technology is considered present at the meeting for purposes of determining a quorum and participating in all proceedings.\nIf telephone or interactive technology is used to conduct a meeting, the entity, to the extent practical, shall allow a person to monitor the meeting electronically from a remote location.\nIf telephone or interactive technology is used to conduct a regular, special, or emergency meeting, the entity shall provide notice of the regular meeting location, of the fact that some members may participate by interactive technology, and of the provisions of subdivision 4. The timing and method of providing notice is governed by section 13D.04. In addition, the entity must post the notice on its website at least ten days before any regular meeting as defined in section 13D.04, subdivision 1.",
	"repealed": false
}