{
	"id": "90.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.14",
	"title": "90.14 AUCTION SALE PROCEDURE.",
	"text": "(a) All state timber shall be offered and sold by the same unit of measurement as it was appraised. No tract shall be sold to any person other than the responsible bidder in whose name the bid was made. The commissioner may refuse to approve any and all bids received and cancel a sale of state timber for good and sufficient reasons.\n(b) The purchaser at any sale of timber shall, immediately upon the approval of the bid, or, if unsold at public auction, at the time of purchase at a subsequent sale under section 90.101, subdivision 1, pay to the commissioner a down payment of 15 percent of the appraised value. In case any purchaser fails to make such payment, the purchaser shall be liable therefor to the state in a civil action, and the commissioner may reoffer the timber for sale as though no bid or sale under section 90.101, subdivision 1, therefor had been made.\n(c) In lieu of the scaling of state timber required by this chapter, a purchaser of state timber may, at the time of payment by the purchaser to the commissioner of 15 percent of the appraised value, elect in a format prescribed by the commissioner to purchase a permit based solely on the appraiser's estimate of the volume of timber described in the permit, provided that the commissioner has expressly designated the availability of such option for that tract on the list of tracts available for sale as required under section 90.101. A purchaser who elects in a format prescribed by the commissioner to purchase a permit based solely on the appraiser's estimate of the volume of timber described on the permit does not have recourse to the provisions of section 90.281.\n(d) In the case of a public auction sale conducted by a sealed bid process, tracts shall be awarded to the high bidder, who shall pay to the commissioner a down payment of 15 percent of the appraised value that must be received or postmarked within 14 days of the date of the sealed bid opening. If a purchaser fails to make the down payment, the purchaser is liable for the down payment to the state and the commissioner may offer the timber for sale to the next highest bidder as though no higher bid had been made.\n(e) Except as otherwise provided by law, at the time the purchaser signs a permit issued under section 90.151, the commissioner shall require the purchaser to make a bid guarantee payment to the commissioner in an amount equal to 15 percent of the total purchase price of the permit less the down payment amount required by paragraph (b) for any bid increase in excess of $10,000 of the appraised value. If a required bid guarantee payment is not submitted with the signed permit, no harvesting may occur, the permit cancels, and the down payment for timber forfeits to the state. The bid guarantee payment forfeits to the state if the purchaser and successors in interest fail to execute an effective permit.",
	"repealed": false
}