{
	"id": "182.654",
	"url": "https://www.revisor.mn.gov/statutes/cite/182.654",
	"title": "182.654 RIGHTS AND DUTIES OF EMPLOYEES.",
	"text": "Rights and duties of employees include but are not limited to those specified in this section.\nEach employee shall comply with occupational safety and health standards and all rules and orders issued pursuant to this chapter which are applicable to the employee's own actions and conduct.\nAny employee or association of employees is entitled to participate in the development, revision and revocation of standards by submission of comments on proposed standards, participation in hearings on proposed standards, or by requesting the development of standards on a given issue, under section 182.655.\nEach employee or an authorized representative shall be notified by an employer of any application for a temporary order granting the employer a variance from any provision of this chapter or standard or rule promulgated pursuant to this chapter.\nThe employee representative shall be given the opportunity to participate in any hearing which concerns an application by an employer for a variance from a standard promulgated under this chapter.\nAny employee who may be adversely affected by a standard or variance issued pursuant to section 182.655 may file a petition stating a position with regard to proposed standard or variance with the commissioner.\nAn employee who has been exposed or is being exposed to hazardous substances or harmful physical agents in concentrations or at levels in excess of that provided for by an applicable standard shall be provided by the employer with the opportunities provided in section 182.655, subdivision 10a.\nSubject to rules issued pursuant to this chapter any employee or authorized representative of employees has the right to request an inspection and to consult with the commissioner at the time of the physical inspection of any workplace as provided in section 182.659.\nNo employee shall be discharged or in any way discriminated against because such employee has filed any complaint or instituted or caused to be instituted any proceeding or inspection under or related to this chapter or has testified or is about to testify in any such proceeding or because of the exercise by such employee on behalf of the employee or others of any right afforded by this chapter. Discriminatory acts are subject to the sanctions contained in section 182.669.\nAn employee, except an employee employed in a farming operation with ten or fewer employees and no temporary labor camp, or the designated representative of the employee has the right to request and receive from the employer, within a reasonable period of time, access to information the employer is required to provide the employee under section 182.653, subdivision 4b, 4c, 4d, or 4e. For the purposes of this subdivision and section 182.668, subdivision 5, \"designated representative\" means a labor organization, as defined in section 179.01, subdivision 6, that represents employees under a valid collective bargaining agreement, or another employee whom an employee or former employee has authorized, in writing, to exercise the employee's rights under this chapter.\nEvery employee employed in a farming operation with ten or fewer employees and no temporary labor camp, and any agricultural employee association or union representing that employee, shall have the right, upon request, to receive from their employer, within a reasonable period of time, any information on a label that is required by any federal or state health and safety law to be on the container of any substance or chemical to which the employee is routinely exposed.\nAn employee acting in good faith has the right to refuse to work under conditions which the employee reasonably believes present an imminent danger of death or serious physical harm to the employee.\nA reasonable belief of imminent danger of death or serious physical harm includes but is not limited to a reasonable belief of the employee that the employee has been assigned to work in an unsafe or unhealthful manner with a hazardous substance, harmful physical agent or infectious agent.\nAn employer may not discriminate against an employee for a good faith refusal to perform assigned tasks if the employee has requested that the employer correct the hazardous conditions but the conditions remain uncorrected.\nAn employee who has refused in good faith to perform assigned tasks and who has not been reassigned to other tasks by the employer shall, in addition to retaining a right to continued employment, receive pay for the tasks which would have been performed if (1) the employee requests the commissioner to inspect and determine the nature of the hazardous condition, and (2) the commissioner determines that the employee, by performing the assigned tasks, would have been placed in imminent danger of death or serious physical harm.\nAdditionally, an administrative law judge may order, in addition to the relief found in section 182.669:\n(1) reinstatement of the worker to the same position held before any adverse personnel action or to an equivalent position; reinstatement of full fringe benefits and seniority rights; compensation for unpaid wages, benefits, and other remuneration; or front pay in lieu of reinstatement; and\n(2) compensatory damages payable to the aggrieved worker equal to the greater of $5,000 or twice the actual damages, including unpaid wages, benefits, and other remuneration and punitive damages.",
	"repealed": false
}