{
	"id": "120B.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/120B.35",
	"title": "120B.35 STUDENT ACADEMIC ACHIEVEMENT AND GROWTH.",
	"text": "The commissioner must develop and implement a system for measuring and reporting academic achievement and individual student growth, consistent with the statewide educational accountability and reporting system. The system components must measure and separately report the federal expectations of schools and the growth of individual students: students' current achievement in schools under subdivision 2; and individual students' educational growth over time under subdivision 3. The system also must include statewide measures of student academic growth that identify schools with high levels of growth, and also schools with low levels of growth that need improvement. The data must include both statewide measures of student achievement and, to the extent annual tests are administered, indicators of achievement growth that take into account a student's prior achievement. Indicators of achievement and prior achievement must be based on highly reliable statewide or districtwide assessments. Indicators that take into account a student's prior achievement must not be used to disregard a school's low achievement or to exclude a school from a program to improve low achievement levels.\n(a) Each school year, a school district must determine if the student achievement levels at each school site meet federal expectations. If student achievement levels at a school site do not meet federal expectations, the district must work with the school site to adopt a plan to raise student achievement levels to meet federal expectations. The commissioner of education shall establish student academic achievement levels to comply with this paragraph.\n(b) School sites identified as not meeting federal expectations must develop continuous improvement plans in order to meet federal expectations for student academic achievement. The department, at a district's request, must assist the district and the school sites in developing a plan to improve student achievement. The plan must include parental involvement components.\n(c) The commissioner must:\n(1) assist school sites and districts identified as not meeting federal expectations; and\n(2) provide technical assistance to schools that integrate student achievement measures into the school continuous improvement plan.\n(d) The commissioner shall establish and maintain a continuous improvement website designed to make aggregated and disaggregated student growth and, under section 120B.11, subdivision 2, clause (2), student learning and outcome data on every school and district available to parents, teachers, administrators, community members, and the general public, consistent with this section.\n(a)(1) The state's educational assessment system measuring individual students' educational growth is based on indicators of current achievement that show growth relative to an individual student's prior achievement. Indicators of achievement and prior achievement must be based on highly reliable statewide or districtwide assessments.\n(2) For purposes of paragraphs (b), (c), and (d), the commissioner must analyze and report separate categories of information using the student categories identified under the federal Elementary and Secondary Education Act, as most recently reauthorized, and, in addition to \"other\" for each race and ethnicity, and the Karen community, seven of the most populous Asian and Pacific Islander groups, three of the most populous Native groups, seven of the most populous Hispanic/Latino groups, and five of the most populous Black and African Heritage groups as determined by the total Minnesota population based on the most recent American Community Survey; English learners under section 124D.59; home language; free or reduced-price meals; and all students enrolled in a Minnesota public school who are currently or were previously in foster care, except that such disaggregation and cross tabulation is not required if the number of students in a category is insufficient to yield statistically reliable information or the results would reveal personally identifiable information about an individual student.\n(b) The commissioner, in consultation with a stakeholder group that includes assessment and evaluation directors, district staff, experts in culturally responsive teaching, and researchers, must implement an appropriate growth model that compares the difference in students' achievement scores over time, and includes criteria for identifying schools and school districts that demonstrate academic progress or progress toward English language proficiency. The model may be used to advance educators' professional development and replicate programs that succeed in meeting students' diverse learning needs. Data on individual teachers generated under the model are personnel data under section 13.43. The model must allow users to:\n(1) report student growth consistent with this paragraph; and\n(2) for all student categories, report and compare aggregated and disaggregated state student growth and, under section 120B.11, subdivision 2, clause (2), student learning and outcome data using the student categories identified under the federal Elementary and Secondary Education Act, as most recently reauthorized, and other student categories under paragraph (a), clause (2).\nThe commissioner must report measures of student growth and, under section 120B.11, subdivision 2, clause (2), student learning and outcome data, consistent with this paragraph, including the English language development, academic progress, and oral academic development of English learners and their native language development if the native language is used as a language of instruction, and include data on all pupils enrolled in a Minnesota public school course or program who are currently or were previously counted as an English learner under section 124D.59.\n(c) When reporting student performance under section 120B.36, subdivision 1, the commissioner annually, beginning July 1, 2011, must report two core measures indicating the extent to which current high school graduates are being prepared for postsecondary academic and career opportunities:\n(1) a preparation measure indicating the number and percentage of high school graduates in the most recent school year who completed course work important to preparing them for postsecondary academic and career opportunities, consistent with the core academic subjects required for admission to Minnesota's public colleges and universities as determined by the Office of Higher Education under chapter 136A; and\n(2) a rigorous coursework measure indicating the number and percentage of high school graduates in the most recent school year who successfully completed one or more college-level advanced placement, international baccalaureate, postsecondary enrollment options including concurrent enrollment, other rigorous courses of study under section 120B.021, subdivision 1a, or industry certification courses or programs.\nWhen reporting the core measures under clauses (1) and (2), the commissioner must also analyze and report separate categories of information using the student categories identified under the federal Elementary and Secondary Education Act, as most recently reauthorized, and other student categories under paragraph (a), clause (2).\n(d) When reporting student performance under section 120B.36, subdivision 1, the commissioner annually, beginning July 1, 2014, must report summary data on school safety and students' engagement and connection at school, consistent with the student categories identified under paragraph (a), clause (2). The summary data under this paragraph are separate from and must not be used for any purpose related to measuring or evaluating the performance of classroom teachers. The commissioner, in consultation with qualified experts on student engagement and connection and classroom teachers, must identify highly reliable variables that generate summary data under this paragraph. The summary data may be used at school, district, and state levels only. Any data on individuals received, collected, or created that are used to generate the summary data under this paragraph are nonpublic data under section 13.02, subdivision 9.\n(e) For purposes of statewide educational accountability, the commissioner must identify and report measures that demonstrate the success of learning year program providers under sections 123A.05 and 124D.68, among other such providers, in improving students' graduation outcomes. The commissioner, beginning July 1, 2015, must annually report summary data on:\n(1) the four- and six-year graduation rates of students under this paragraph;\n(2) the percent of students under this paragraph whose progress and performance levels are meeting career and college readiness benchmarks under section 120B.307; and\n(3) the success that learning year program providers experience in:\n(i) identifying at-risk and off-track student populations by grade;\n(ii) providing successful prevention and intervention strategies for at-risk students;\n(iii) providing successful recuperative and recovery or reenrollment strategies for off-track students; and\n(iv) improving the graduation outcomes of at-risk and off-track students.\nThe commissioner may include in the annual report summary data on other education providers serving a majority of students eligible to participate in a learning year program.\n(f) The commissioner, in consultation with recognized experts with knowledge and experience in assessing the language proficiency and academic performance of all English learners enrolled in a Minnesota public school course or program who are currently or were previously counted as an English learner under section 124D.59, must identify and report appropriate and effective measures to improve current categories of language difficulty and assessments, and monitor and report data on students' English proficiency levels, program placement, and academic language development, including oral academic language.\n(g) When reporting four- and six-year graduation rates, the commissioner or school district must disaggregate the data by student categories according to paragraph (a), clause (2).\n(h) A school district must inform parents and guardians that volunteering information on student categories not required by the most recent reauthorization of the Elementary and Secondary Education Act is optional and will not violate the privacy of students or their families, parents, or guardians. The notice must state the purpose for collecting the student data.\nConsistent with the requirements of this section, beginning June 20, 2012, the commissioner of education must annually report to the public and the legislature best practices implemented in those schools that are identified as high performing under federal expectations.\nMS 2022 [Repealed, 2023 c 55 art 2 s 66]",
	"repealed": false
}