{
	"id": "326B.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/326B.49",
	"title": "326B.49 APPLICATIONS, FEES.",
	"text": "(a) Applications for master and journeyworker plumber's licenses shall be made to the commissioner, with all fees required by section 326B.092. Unless the applicant is entitled to a renewal, the applicant shall be licensed by the commissioner only after passing a satisfactory examination developed and administered by the commissioner, based upon rules adopted by the Plumbing Board, showing fitness.\n(b) All journeyworker plumber's licenses shall expire on December 31 of each odd-numbered year after issuance or renewal. All master plumber's licenses shall expire on December 31 of each even-numbered year after issuance or renewal. All renewed master and journeyworker plumber's licenses shall be two-year licenses.\n(c) Applications for contractor licenses shall be made to the commissioner, with all fees required by section 326B.092. All contractor licenses shall expire on December 31 of each odd-numbered year after issuance or renewal.\n(d) For purposes of calculating license fees and renewal license fees required under section 326B.092:\n(1) the following licenses shall be considered business licenses: plumbing contractor and restricted plumbing contractor;\n(2) the following licenses shall be considered master licenses: master plumber and restricted master plumber;\n(3) the following licenses shall be considered journeyworker licenses: journeyworker plumber and restricted journeyworker plumber; and\n(4) the registration of an unlicensed individual under section 326B.47, subdivision 3, shall be considered an entry level license.\n(e) For each filing of a certificate of responsible individual by an employer, the fee is $100.\n(f) The commissioner shall charge each person giving bond under section 326B.46, subdivision 2, paragraph (b), a biennial bond filing fee of $100, unless the person is a licensed contractor.\nPlumbing system plans and specifications that are submitted to the commissioner for review shall be accompanied by the appropriate plan examination fees. If the commissioner determines, upon review of the plans, that inadequate fees were paid, the necessary additional fees shall be paid prior to plan approval. The commissioner shall charge the following fees for plan reviews and audits of plumbing installations for public, commercial, and industrial buildings:\n(1) systems with both water distribution and drain, waste, and vent systems and having:\n(i) 25 or fewer drainage fixture units, $150;\n(ii) 26 to 50 drainage fixture units, $250;\n(iii) 51 to 150 drainage fixture units, $350;\n(iv) 151 to 249 drainage fixture units, $500;\n(v) 250 or more drainage fixture units, $3 per drainage fixture unit to a maximum of $4,000; and\n(vi) interceptors, separators, or catch basins, $70 per interceptor, separator, or catch basin design;\n(2) building sewer service only, $150;\n(3) building water service only, $150;\n(4) building water distribution system only, no drainage system, $5 per supply fixture unit or $150, whichever is greater;\n(5) storm drainage system, a minimum fee of $150 or:\n(i) $50 per drain opening, up to a maximum of $500; and\n(ii) $70 per interceptor, separator, or catch basin design;\n(6) manufactured home park or campground, one to 25 sites, $300;\n(7) manufactured home park or campground, 26 to 50 sites, $350;\n(8) manufactured home park or campground, 51 to 125 sites, $400;\n(9) manufactured home park or campground, more than 125 sites, $500; and\n(10) revision to previously reviewed or incomplete plans:\n(i) review of plans for which the commissioner has issued two or more requests for additional information, per review, $100 or ten percent of the original fee, whichever is greater;\n(ii) proposer-requested revision with no increase in project scope, $50 or ten percent of original fee, whichever is greater; and\n(iii) proposer-requested revision with an increase in project scope, $50 plus the difference between the original project fee and the revised project fee.\n(a) Before commencement of a plumbing installation to be inspected by the commissioner, the plumbing contractor or registered plumbing employer performing the plumbing work must submit to the commissioner an application for a permit and the permit and inspection fees in paragraphs (b) to (f).\n(b) The permit fee is $100.\n(c) The residential inspection fee is $50 for each inspection trip.\n(d) The public, commercial, and industrial inspection fees are as follows:\n(1) for systems with water distribution, drain, waste, and vent system connection:\n(i) $25 for each fixture, permanently connected appliance, floor drain, or other appurtenance;\n(ii) $25 for each water conditioning, water treatment, or water filtration system; and\n(iii) $25 for each interceptor, separator, catch basin, or manhole;\n(2) roof drains, $25 for each drain;\n(3) building sewer service only, $100;\n(4) building water service only, $100;\n(5) building water distribution system only, no drainage system, $5 for each fixture supplied;\n(6) storm drainage system, a minimum fee of $25 for each drain opening, interceptor, separator, or catch basin;\n(7) manufactured home park or campground, $25 for each site;\n(8) reinspection fee to verify corrections, regardless of the total fee submitted, $100 for each reinspection; and\n(9) each $100 in fees paid covers one inspection trip.\n(e) In addition to the fees in paragraph (d), the fee submitter must pay an hourly rate of $80 during regular business hours, or $120 when inspections are requested to be performed outside of normal work hours or on weekends and holidays, with a two-hour minimum where the fee submitter requests inspections of installations as systems are being installed.\n(f) The fee submitter must pay a fee equal to two hours at the hourly rate of $80 when inspections scheduled by the submitter are not able to be completed because the work is not complete.",
	"repealed": false
}