{
	"id": "518.1751",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.1751",
	"title": "518.1751 PARENTING TIME DISPUTE RESOLUTION.",
	"text": "Upon request of either party, the parties' stipulation, or upon the court's own motion, the court may appoint a parenting time expeditor to resolve parenting time disputes that occur under a parenting time order while a matter is pending under this chapter, chapter 257 or 518D, or after a decree is entered.\nA party may not be required to refer a parenting time dispute to a parenting time expeditor under this section if:\n(1) one of the parties claims to be the victim of domestic abuse by the other party;\n(2) the court determines there is probable cause that one of the parties or a child of the parties has been physically abused or threatened with physical abuse by the other party; or\n(3) the party is unable to pay the costs of the expeditor, as provided under subdivision 2a.\nIf the court is satisfied that the parties have been advised by counsel and have agreed to use the parenting time expeditor process and the process does not involve face-to-face meeting of the parties, the court may direct that the parenting time expeditor process be used.\n(a) The purpose of a parenting time expeditor is to resolve parenting time disputes by enforcing, interpreting, clarifying, and addressing circumstances not specifically addressed by an existing parenting time order and, if appropriate, to make a determination as to whether the existing parenting time order has been violated. A parenting time expeditor may be appointed to resolve a onetime parenting time dispute or to provide ongoing parenting time dispute resolution services.\n(b) For purposes of this section, \"parenting time dispute\" means a disagreement among parties about parenting time with a child, including a dispute about an anticipated denial of future scheduled parenting time. \"Parenting time dispute\" includes a claim by a parent that the other parent is not spending time with a child as well as a claim by a parent that the other parent is denying or interfering with parenting time.\n(c) A \"parenting time expeditor\" is a neutral person authorized to use a mediation-arbitration process to resolve parenting time disputes. A parenting time expeditor shall attempt to resolve a parenting time dispute by facilitating negotiations between the parties to promote settlement and, if it becomes apparent that the dispute cannot be resolved by an agreement of the parties, the parenting time expeditor shall make a decision resolving the dispute.\n(a) The parties may stipulate to the appointment of a parenting time expeditor or a team of two expeditors without appearing in court by submitting to the court a written agreement identifying the names of the individuals to be appointed by the court; the nature of the dispute; the responsibilities of the parenting time expeditor, including whether the expeditor is appointed to resolve a specific issue or on an ongoing basis; the term of the appointment; and the apportionment of fees and costs. The court shall review the agreement of the parties.\n(b) If the parties cannot agree on a parenting time expeditor, the court shall provide to the parties a copy of the court administrator's roster of parenting time expeditors and require the parties to exchange the names of three potential parenting time expeditors by a specific date. If after exchanging names the parties are unable to agree upon a parenting time expeditor, the court shall select the parenting time expeditor and, in its discretion, may appoint one expeditor or a team of two expeditors. In the selection process the court must give consideration to the financial circumstances of the parties and the fees of those being considered as parenting time expeditors. Preference must be given to persons who agree to volunteer their services or who will charge a variable fee for services based on the ability of the parties to pay for them.\n(c) An order appointing a parenting time expeditor must identify the name of the individual to be appointed, the nature of the dispute, the responsibilities of the expeditor including whether the expeditor is appointed to resolve a specific issue or on an ongoing basis, the term of the appointment, the apportionment of fees, and notice that if the parties are unable to reach an agreement with the assistance of the expeditor, the expeditor is authorized to make a decision resolving the dispute which is binding upon the parties unless modified or vacated by the court.\nPrior to appointing the parenting time expeditor, the court shall give the parties notice that the fees of the expeditor will be apportioned among the parties. In its order appointing the expeditor, the court shall apportion the fees of the expeditor among the parties, with each party bearing the portion of fees that the court determines is just and equitable under the circumstances. If a party files a pro se motion regarding a parenting time dispute and there is not a court order that provides for apportionment of the fees of an expeditor, the court administrator may require the party requesting the appointment of an expeditor to pay the fees of the expeditor in advance. Neither party may be required to submit a dispute to a visitation expeditor if the party cannot afford to pay for the fees of an expeditor and an affordable expeditor is not available, unless the other party agrees to pay the fees. After fees are incurred, a party may by motion request that the fees be reapportioned on equitable grounds. The court may consider the resources of the parties, the nature of the dispute, and whether a party acted in bad faith. The court may consider information from the expeditor in determining bad faith.\nEach court administrator shall maintain and make available to the public and judicial officers a roster of individuals available to serve as parenting time expeditors, including each individual's name, address, telephone number, and fee charged, if any. A court administrator shall not place on the roster the name of an individual who has not completed the training required in subdivision 2c. If the use of a parenting time expeditor is initiated by stipulation of the parties, the parties may agree upon a person to serve as an expeditor even if that person has not completed the training described in subdivision 2c. The court may appoint a person to serve as an expeditor even if the person is not on the court administrator's roster, but may not appoint a person who has not completed the training described in subdivision 2c, unless so stipulated by the parties. To maintain one's listing on a court administrator's roster of parenting time expeditors, an individual shall annually submit to the court administrator proof of completion of continuing education requirements.\nTo qualify for listing on a court administrator's roster of parenting time expeditors, an individual shall complete a minimum of 40 hours of family mediation training that has been certified by the Minnesota Supreme Court, which must include certified training in domestic abuse issues as required under Rule 114 of the Minnesota General Rules of Practice for the District Courts. To maintain one's listing on a court administrator's roster of parenting time expeditors, an individual shall annually attend three hours of continuing education about alternative dispute resolution subjects.\n(a) Within five days of notice of the appointment, or within five days of notice of a subsequent parenting time dispute between the same parties, the parenting time expeditor shall meet with the parties together or separately and shall make a diligent effort to facilitate an agreement to resolve the dispute. If a parenting time dispute requires immediate resolution, the parenting time expeditor may confer with the parties through a telephone conference or similar means. An expeditor may make a decision without conferring with a party if the expeditor made a good faith effort to confer with the party, but the party chose not to participate in resolution of the dispute.\n(b) If the parties do not reach an agreement, the expeditor shall make a decision resolving the dispute as soon as possible but not later than five days after receiving all information necessary to make a decision and after the final meeting or conference with the parties. The expeditor is authorized to award compensatory parenting time under section 518.175, subdivision 6, and may recommend to the court that the noncomplying party pay attorney's fees, court costs, and other costs under section 518.175, subdivision 6, paragraph (d), if the parenting time order has been violated. The expeditor shall not lose authority to make a decision if circumstances beyond the expeditor's control make it impracticable to meet the five-day timelines.\n(c) Unless the parties mutually agree, the parenting time expeditor shall not make a decision that is inconsistent with an existing parenting time order, but may make decisions interpreting or clarifying a parenting time order, including the development of a specific schedule when the existing court order grants \"reasonable parenting time.\"\n(d) The expeditor shall put an agreement or decision in writing and provide a copy to the parties. The expeditor may include or omit reasons for the agreement or decision. An agreement of the parties or a decision of the expeditor is binding on the parties unless vacated or modified by the court. If a party does not comply with an agreement of the parties or a decision of the expeditor, any party may bring a motion with the court and shall attach a copy of the parties' written agreement or decision of the expeditor. The court may enforce, modify, or vacate the agreement of the parties or the decision of the expeditor.\nThis section does not preclude the parties from voluntarily agreeing to submit their parenting time dispute to a neutral third party or from otherwise resolving parenting time disputes on a voluntary basis.\n(a) Statements made and documents produced as part of the parenting time expeditor process which are not otherwise discoverable are not subject to discovery or other disclosure and are not admissible into evidence for any purpose at trial or in any other proceeding, including impeachment.\n(b) Sworn testimony may be used in subsequent proceedings for any purpose for which it is admissible under the Rules of Evidence. Parenting time expeditors, and lawyers for the parties to the extent of their participation in the parenting time expeditor process, must not be subpoenaed or called as witnesses in court proceedings.\n(c) Notes, records, and recollections of parenting time expeditors are confidential and must not be disclosed to the parties, the public, or anyone other than the parenting time expeditor unless:\n(1) all parties and the expeditor agree in writing to the disclosure; or\n(2) disclosure is required by law or other applicable professional codes.\nNotes and records of parenting time expeditors must not be disclosed to the court unless after a hearing the court determines that the notes or records should be reviewed in camera. Those notes or records must not be released by the court unless it determines that they disclose information showing illegal violation of the criminal law of the state.\nA parenting time expeditor is immune from civil liability for actions taken or not taken when acting under this section.\nIf a parenting time expeditor has been appointed on a long-term basis, a party or the expeditor may file a motion seeking to have the expeditor removed for good cause shown.\nSubject to subdivision 1a, a judicial district may establish a mandatory parenting time dispute resolution program as provided in this subdivision. In a district where a program has been established, parties may be required to submit parenting time disputes to a parenting time expeditor as a prerequisite to a motion on the dispute being heard by the court, or either party may submit the dispute to an expeditor. A party may file a motion with the court for purposes of obtaining a court date, if necessary, but a hearing may not be held until resolution of the dispute with the parenting time expeditor. The appointment of an expeditor must be in accordance with subdivision 2. Expeditor fees must be paid in accordance with subdivision 2a.\n[Repealed by amendment, 1997 c 245 art 2 s 3]",
	"repealed": false
}