{
	"id": "609.375",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.375",
	"title": "609.375 NONSUPPORT OF SPOUSE OR CHILD.",
	"text": "Whoever is legally obligated to provide court-ordered support to a spouse or child, whether or not the child's custody has been granted to another, and knowingly omits and fails to do so is guilty of a misdemeanor, and upon conviction may be sentenced to imprisonment for not more than 90 days or to payment of a fine of not more than $1,000, or both.\nA person who violates subdivision 1 is guilty of a gross misdemeanor and may be sentenced to imprisonment for not more than 364 days or to payment of a fine of not more than $3,000, or both, if:\n(1) the violation continues for a period in excess of 90 days but not more than 180 days; or\n(2) the person is in arrears in court-ordered child support or maintenance payments, or both, in an amount equal to or greater than six times but less than nine times the person's total monthly support and maintenance payments.\nA person who violates subdivision 1 is guilty of a felony and upon conviction may be sentenced to imprisonment for not more than two years or to payment of a fine of not more than $5,000, or both, if:\n(1) the violation continues for a period in excess of 180 days; or\n(2) the person is in arrears in court-ordered child support or maintenance payments, or both, in an amount equal to or greater than nine times the person's total monthly support and maintenance payments.\nA person may not be charged with violating this section unless there has been an attempt to obtain a court order holding the person in contempt for failing to pay support or maintenance under chapter 518 or 518A. This requirement is satisfied by a showing that reasonable attempts have been made at service of the order.\n[Repealed, 1997 c 203 art 6 s 93; 1997 c 245 art 1 s 34]\n[Repealed, 1997 c 203 art 6 s 93; 1997 c 245 art 1 s 34]\nA person who violates this section may be prosecuted and tried in the county in which the support obligor resides or in the county in which the obligee or the child resides.\n[Repealed, 1997 c 203 art 6 s 93; 1997 c 245 art 1 s 34]\nUpon conviction under this section, a defendant may obtain work release only upon the imposition of an automatic income withholding order, and may be required to post a bond in avoidance of jail time and conditioned upon payment of all court-ordered support owed. Nonpayment of court-ordered support is a violation of any probation granted following conviction under subdivision 2a.\nIt is an affirmative defense to criminal liability under this section if the defendant proves by a preponderance of the evidence that the omission and failure to provide court-ordered support were with lawful excuse.",
	"repealed": false
}