{
	"id": "145A.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.02",
	"title": "145A.02 DEFINITIONS.",
	"text": "Definitions in this section apply to this chapter.\n\"Areas of public health responsibility\" means:\n(1) assuring an adequate local public health infrastructure;\n(2) promoting healthy communities and healthy behaviors;\n(3) preventing the spread of communicable disease;\n(4) protecting against environmental health hazards;\n(5) preparing for and responding to emergencies; and\n(6) assuring health services.\n[Repealed, 2014 c 291 art 7 s 29]\n\"City\" means a statutory city or home rule charter city as defined in section 410.015.\n\"Commissioner\" means the Minnesota commissioner of health.\n\"Community health board\" means the governing body for local public health in Minnesota. The community health board may be comprised of a single county, multiple contiguous counties, or in a limited number of cases, a single city as specified in section 145A.03, subdivision 1. CHBs have the responsibilities and authority under this chapter.\n\"Community health services\" means activities designed to protect and promote the health of the general population within a community health service area by emphasizing the prevention of disease, injury, disability, and preventable death through the promotion of effective coordination and use of community resources, and by extending health services into the community.\n\"Community health services administrator\" means a person who meets personnel standards for the position established under section 145A.06, subdivision 3b, and is working under a written agreement with, employed by, or under contract with a community health board to provide public health leadership and to discharge the administrative and program responsibilities on behalf of the board.\n\"Community health service area\" means a city, county, or multicounty area that is organized as a community health board and for which a local public health grant is received under sections 145A.11 to 145A.131.\n\"County board\" or \"county\" means a county board of commissioners as defined in chapter 375.\n\"Essential public health services\" means the public health activities that all communities should undertake. These services serve as the framework for the National Public Health Performance Standards. In Minnesota they refer to activities that are conducted to accomplish the areas of public health responsibility. The ten essential public health services are to:\n(1) monitor health status to identify and solve community health problems;\n(2) diagnose and investigate health problems and health hazards in the community;\n(3) inform, educate, and empower people about health issues;\n(4) mobilize community partnerships and action to identify and solve health problems;\n(5) develop policies and plans that support individual and community health efforts;\n(6) enforce laws and regulations that protect health and ensure safety;\n(7) link people to needed personal health services and assure the provision of health care when otherwise unavailable;\n(8) maintain a competent public health workforce;\n(9) evaluate the effectiveness, accessibility, and quality of personal and population-based health services; and\n(10) contribute to research seeking new insights and innovative solutions to health problems.\n\"Local health department\" means an operational entity that is responsible for the administration and implementation of programs and services to address the areas of public health responsibility. It is governed by a community health board.\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n\"Medical consultant\" means a physician licensed to practice medicine in Minnesota who is working under a written agreement with, employed by, or on contract with a community health board to provide advice and information, to authorize medical procedures through protocols, and to assist a community health board and its staff in coordinating their activities with local medical practitioners and health care institutions.\n\"Performance management\" means the systematic process of using data for decision making by identifying outcomes and standards; measuring, monitoring, and communicating progress; and engaging in quality improvement activities in order to achieve desired outcomes.\n\"Performance measures\" means quantitative ways to define and measure performance.\n\"Population\" means the total number of residents of the state or any city or county as established by the last federal census, by a special census taken by the United States Bureau of the Census, by the state demographer under section 4A.02, or by an estimate of city population prepared by the Metropolitan Council, whichever is the most recent as to the stated date of count or estimate.\n\"Public health nuisance\" means any activity or failure to act that adversely affects the public health.\n\"Public health nurse\" means a person who is licensed as a registered nurse by the Minnesota Board of Nursing under sections 148.171 to 148.285 and who meets the voluntary registration requirements established by the Board of Nursing.",
	"repealed": false
}