{
	"id": "62Q.665",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.665",
	"title": "62Q.665 COVERAGE FOR ORTHOTIC AND PROSTHETIC DEVICES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Accredited facility\" means any entity that is accredited to provide comprehensive orthotic or prosthetic devices or services by a Centers for Medicare and Medicaid Services approved accrediting agency.\n(c) \"Orthosis\" means:\n(1) an external medical device that is:\n(i) custom-fabricated or custom-fitted to a specific patient based on the patient's unique physical condition;\n(ii) applied to a part of the body to correct a deformity, provide support and protection, restrict motion, improve function, or relieve symptoms of a disease, syndrome, injury, or postoperative condition; and\n(iii) deemed medically necessary by a prescribing physician or licensed health care provider who has authority in Minnesota to prescribe orthotic and prosthetic devices, supplies, and services; and\n(2) any provision, repair, or replacement of a device that is furnished or performed by:\n(i) an accredited facility in comprehensive orthotic services; or\n(ii) a health care provider licensed in Minnesota and operating within the provider's scope of practice which allows the provider to provide orthotic or prosthetic devices, supplies, or services.\n(d) \"Orthotics\" means:\n(1) the science and practice of evaluating, measuring, designing, fabricating, assembling, fitting, adjusting, or servicing and providing the initial training necessary to accomplish the fitting of an orthotic device for the support, correction, or alleviation of a neuromuscular or musculoskeletal dysfunction, disease, injury, or deformity;\n(2) evaluation, treatment, and consultation related to an orthotic device;\n(3) basic observation of gait and postural analysis;\n(4) assessing and designing orthosis to maximize function and provide support and alignment necessary to prevent or correct a deformity or to improve the safety and efficiency of mobility and locomotion;\n(5) continuing patient care to assess the effect of an orthotic device on the patient's tissues; and\n(6) proper fit and function of the orthotic device by periodic evaluation.\n(e) \"Prosthesis\" means:\n(1) an external medical device that is:\n(i) used to replace or restore a missing limb, appendage, or other external human body part; and\n(ii) deemed medically necessary by a prescribing physician or licensed health care provider who has authority in Minnesota to prescribe orthotic and prosthetic devices, supplies, and services; and\n(2) any provision, repair, or replacement of a device that is furnished or performed by:\n(i) an accredited facility in comprehensive prosthetic services; or\n(ii) a health care provider licensed in Minnesota and operating within the provider's scope of practice which allows the provider to provide orthotic or prosthetic devices, supplies, or services.\n(f) \"Prosthetics\" means:\n(1) the science and practice of evaluating, measuring, designing, fabricating, assembling, fitting, aligning, adjusting, or servicing, as well as providing the initial training necessary to accomplish the fitting of, a prosthesis through the replacement of external parts of a human body lost due to amputation or congenital deformities or absences;\n(2) the generation of an image, form, or mold that replicates the patient's body segment and that requires rectification of dimensions, contours, and volumes for use in the design and fabrication of a socket to accept a residual anatomic limb to, in turn, create an artificial appendage that is designed either to support body weight or to improve or restore function or anatomical appearance, or both;\n(3) observational gait analysis and clinical assessment of the requirements necessary to refine and mechanically fix the relative position of various parts of the prosthesis to maximize function, stability, and safety of the patient;\n(4) providing and continuing patient care in order to assess the prosthetic device's effect on the patient's tissues; and\n(5) assuring proper fit and function of the prosthetic device by periodic evaluation.\n(a) A health plan must provide coverage for orthotic and prosthetic devices, supplies, and services, including repair and replacement, at least equal to the coverage provided under federal law for health insurance for the aged and disabled under sections 1832, 1833, and 1834 of the Social Security Act, United States Code, title 42, sections 1395k, 1395l, and 1395m, but only to the extent consistent with this section.\n(b) A health plan must not subject orthotic and prosthetic benefits to separate financial requirements that apply only with respect to those benefits. A health plan may impose co-payment and coinsurance amounts on those benefits, except that any financial requirements that apply to such benefits must not be more restrictive than the financial requirements that apply to the health plan's medical and surgical benefits, including those for internal restorative devices.\n(c) A health plan may limit the benefits for, or alter the financial requirements for, out-of-network coverage of prosthetic and orthotic devices, except that the restrictions and requirements that apply to those benefits must not be more restrictive than the financial requirements that apply to the out-of-network coverage for the health plan's medical and surgical benefits.\n(d) A health plan must cover orthoses and prostheses when furnished under an order by a prescribing physician or licensed health care prescriber who has authority in Minnesota to prescribe orthoses and prostheses, and that coverage for orthotic and prosthetic devices, supplies, accessories, and services must include those devices or device systems, supplies, accessories, and services that are customized to the covered individual's needs.\n(e) A health plan must cover orthoses and prostheses determined by the enrollee's provider to be the most appropriate model that meets the medical needs of the enrollee for purposes of performing physical activities, as applicable, including but not limited to running, biking, and swimming, and maximizing the enrollee's limb function.\n(f) A health plan must cover orthoses and prostheses for showering or bathing.\nA health plan may require prior authorization for orthotic and prosthetic devices, supplies, and services in the same manner and to the same extent as prior authorization is required for any other covered benefit.\n(a) The commissioner of commerce must reimburse health plan companies for coverage under this section. Reimbursement is available only for coverage that would not have been provided by the health plan without the requirements of this section. Treatments and services covered by the health plan as of January 1, 2024, are ineligible for payment under this subdivision by the commissioner of commerce.\n(b) Health plan companies must report to the commissioner of commerce quantified costs attributable to the additional benefit under this section in a format developed by the commissioner. A health plan's coverage as of January 1, 2024, must be used by the health plan company as the basis for determining whether coverage would not have been provided by the health plan for purposes of this subdivision.\n(c) The commissioner of commerce must evaluate submissions and make payments to health plan companies as provided in Code of Federal Regulations, title 45, section 155.170.\nEach fiscal year, an amount necessary to make payments to health plan companies to defray the cost of providing coverage under this section is appropriated to the commissioner of commerce.",
	"repealed": false
}