{
	"id": "148E.120",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.120",
	"title": "148E.120 REQUIREMENTS OF SUPERVISORS.",
	"text": "(a) Except as provided in subdivision 2, to be eligible to provide supervision under this section, a social worker must:\n(1) have completed 30 hours of training in supervision through coursework from an accredited college or university, or through continuing education in compliance with sections 148E.130 and 148E.145;\n(2) be competent in the activities being supervised; and\n(3) attest, on a form provided by the board, that the social worker has met the applicable requirements specified in this section and sections 148E.100 to 148E.115. The board may audit the information provided to determine compliance with the requirements of this section.\n(b) A licensed independent clinical social worker providing clinical licensing supervision to a licensed graduate social worker or a licensed independent social worker must have at least 2,000 hours of experience in authorized social work practice, including 1,000 hours of experience in clinical practice after obtaining a licensed independent clinical social worker license.\n(c) A licensed social worker, licensed graduate social worker, licensed independent social worker, or licensed independent clinical social worker providing nonclinical licensing supervision must have completed the supervised practice requirements specified in section 148E.100, 148E.105, 148E.106, 148E.110, or 148E.115, as applicable.\n(a) The board may approve an alternate supervisor as determined in this subdivision. The board shall approve up to 25 percent of the required supervision hours by a mental health professional who is competent and qualified to provide supervision according to the mental health professional's respective licensing board, as established by section 245I.04, subdivision 2.\n(b) The board shall approve up to 100 percent of the required supervision hours by an alternate supervisor if the board determines that:\n(1) there are five or fewer supervisors in the county where the licensee practices social work who meet the applicable licensure requirements in subdivision 1;\n(2) the supervisor is an unlicensed social worker who is employed in, and provides the supervision in, a setting exempt from licensure by section 148E.065, and who has qualifications equivalent to the applicable requirements specified in sections 148E.100 to 148E.115;\n(3) the supervisor is a social worker engaged in authorized social work practice in Iowa, Manitoba, North Dakota, Ontario, South Dakota, or Wisconsin, and has the qualifications equivalent to the applicable requirements in sections 148E.100 to 148E.115; or\n(4) the applicant or licensee is engaged in nonclinical authorized social work practice outside of Minnesota and the supervisor meets the qualifications equivalent to the applicable requirements in sections 148E.100 to 148E.115, or the supervisor is an equivalent mental health professional, as determined by the board, who is credentialed by a state, territorial, provincial, or foreign licensing agency; or\n(5) the applicant or licensee is engaged in clinical authorized social work practice outside of Minnesota and the supervisor meets qualifications equivalent to the applicable requirements in section 148E.115, or the supervisor is an equivalent mental health professional as determined by the board, who is credentialed by a state, territorial, provincial, or foreign licensing agency.\n(c) In order for the board to consider an alternate supervisor under this section, the licensee must:\n(1) request in the supervision plan and verification submitted according to section 148E.125 that an alternate supervisor conduct the supervision; and\n(2) describe the proposed supervision and the name and qualifications of the proposed alternate supervisor. The board may audit the information provided to determine compliance with the requirements of this section.",
	"repealed": false
}