{
	"id": "84.8205",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.8205",
	"title": "84.8205 SNOWMOBILE STATE TRAIL PASS.",
	"text": "(a) A snowmobile that is not registered in the state under section 84.82, subdivision 3, paragraph (a), or that is registered by a manufacturer or dealer under section 84.82, subdivision 3, paragraph (b) or (c), may not be operated on a state or grant-in-aid snowmobile trail unless a snowmobile state trail pass is available for inspection by a peace officer, a conservation officer, or an employee designated under section 84.0835.\n(b) The commissioner of natural resources shall issue a pass upon application and payment of a fee. The fee is:\n(1) $50 for a one-year snowmobile state trail pass purchased by an individual; and\n(2) $15 for a one-year snowmobile state trail pass purchased by a dealer or manufacturer.\n(c) In addition to other penalties prescribed by law, an individual in violation of this subdivision must purchase an annual state trail pass for a fee of $70. The pass is valid from November 1 through June 30. Fees collected under this section, except for the issuing fee for licensing agents, shall be deposited in the state treasury and credited to the snowmobile trails and enforcement account in the natural resources fund and, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, must be used for grants-in-aid, trail maintenance, grooming, and easement acquisition.\n(d) A state trail pass is not required under this section for:\n(1) a snowmobile that is owned and used by the United States, an Indian tribal government, another state, or a political subdivision thereof that is exempt from registration under section 84.82, subdivision 6;\n(2) a collector snowmobile that is operated as provided in a special permit issued for the collector snowmobile under section 84.82, subdivision 7a;\n(3) a person operating a snowmobile only on the portion of a trail that is owned by the person or the person's spouse, child, or parent; or\n(4) a snowmobile while being used to groom a state or grant-in-aid trail.\nMS 2022 [Repealed by amendment, 2024 c 90 art 1 s 10]\nThe commissioner may appoint agents to issue and sell state trail passes. The commissioner may revoke the appointment of an agent at any time. The commissioner may adopt additional rules as provided in section 97A.485, subdivision 11. An agent shall observe all rules adopted by the commissioner for accounting and handling of passes pursuant to section 97A.485, subdivision 11. An agent shall promptly deposit and remit all money received from the sale of the passes, exclusive of the issuing fee, to the commissioner.\nThe commissioner and agents shall issue and sell snowmobile state trail passes.\nIn addition to the fee for a pass, an issuing fee of $1 per pass shall be charged. The issuing fee may be retained by the seller of the pass. Issuing fees for passes issued by the commissioner shall be deposited in the snowmobile trails and enforcement account in the natural resources fund and retained for the operation of the electronic licensing system.\nThe commissioner and agents shall issue a duplicate pass to persons whose pass is lost or destroyed using the process established under section 97A.405, subdivision 3, and rules promulgated thereunder. The fee for a duplicate state trail pass is $2, with an issuing fee of 50 cents.",
	"repealed": false
}