{
	"id": "473J.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/473J.03",
	"title": "473J.03 DEFINITIONS.",
	"text": "For the purposes of this chapter, the terms defined in this section have the meanings given them, except as otherwise expressly provided or indicated by the context.\n\"Annual adjustment factor\" means for any year, the increase, if any, in the amounts of the city of Minneapolis taxes, imposed under a special law originally enacted in 1986, that are received by the commissioner of revenue in the preceding year over the amount received in the year prior to the preceding year, expressed as a percentage of the amount received in the year prior to the preceding year; provided that the adjustment factor for any year must not be less than zero percent nor more than five percent.\n\"Authority\" means the Minnesota Sports Facilities Authority established under section 473J.07.\n\"City\" means the city of Minneapolis.\n\"Net actual taxes\" means the amount of revenues collected from the taxes in that year minus any refunds and costs of collection.\nThe \"NFL\" means the National Football League.\n\"NFL team\" means the owner and operator of the NFL professional football team known, as of the effective date of this chapter, as the Minnesota Vikings or any team owned and operated by someone who purchases or otherwise takes ownership or control of or reconstitutes the NFL team known as the Minnesota Vikings.\n\"Stadium\" means the stadium suitable for professional football to be designed, constructed, and financed under this chapter. A stadium must have a roof that covers the stadium, as set forth in section 473J.11, subdivision 3.\n\"Stadium costs\" means the costs of acquiring land, the costs of stadium infrastructure, and of designing, constructing, equipping, and financing a stadium suitable for professional football.\n\"Stadium infrastructure\" means plazas, parking structures, rights-of-way, connectors, skyways and tunnels, and other such property, facilities, and improvements, owned by the authority or determined by the authority to facilitate the use and development of the stadium.\n\"Stadium plaza\" means the open air portion of the stadium adjacent to the stadium.\n\"Stadium site\" means all or portions of the current site of the existing football stadium and adjacent areas, bounded generally by Park and Eleventh Avenues and Third and Sixth Streets in the city of Minneapolis, the definitive boundaries of which shall be determined by the authority and agreed to by the NFL team.",
	"repealed": false
}