{
	"id": "272.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.115",
	"title": "272.115 CERTIFICATE OF VALUE; FILING.",
	"text": "Except as otherwise provided in subdivision 5, 6, or 7, whenever any real estate is sold for a consideration in excess of $3,000, whether by warranty deed, quitclaim deed, contract for deed or any other method of sale, the grantor, grantee or the legal agent of either shall file a certificate of value with the county auditor in the county in which the property is located when the deed or other document is presented for recording. Contract for deeds are subject to recording under section 507.235, subdivision 1. Value shall, in the case of any deed not a gift, be the amount of the full actual consideration thereof, paid or to be paid, including the amount of any lien or liens assumed. The items and value of personal property transferred with the real property must be listed and deducted from the sale price. The certificate of value shall include the classification to which the property belongs for the purpose of determining the fair market value of the property, and shall include any proposed change in use of the property known to the person filing the certificate that could change the classification of the property. The certificate shall include financing terms and conditions of the sale which are necessary to determine the actual, present value of the sale price for purposes of the sales ratio study. If the property is being acquired as part of a like-kind exchange under section 1031 of the Internal Revenue Code of 1986, as amended through December 31, 2006, that must be indicated on the certificate. The commissioner of revenue shall promulgate administrative rules specifying the financing terms and conditions which must be included on the certificate. The certificate of value must include the Social Security number or the federal employer identification number of the grantors and grantees. However, a married person who is not an owner of record and who is signing a conveyance instrument along with the person's spouse solely to release and convey their marital interest, if any, in the real property being conveyed is not a grantor for the purpose of the preceding sentence. A statement in the deed that is substantially in the following form is sufficient to allow the county auditor to accept a certificate for filing without the Social Security number of the named spouse: \"(Name) claims no ownership interest in the real property being conveyed and is executing this instrument solely to release and convey a marital interest, if any, in that real property.\" The identification numbers of the grantors and grantees are private data on individuals or nonpublic data as defined in section 13.02, subdivisions 9 and 12, but, notwithstanding that section, the private or nonpublic data may be disclosed to the commissioner of revenue for purposes of tax administration. The information required to be shown on the certificate of value is limited to the information required as of the date of the acknowledgment on the deed or other document to be recorded.\nMS 1992 [Repealed, 1993 c 375 art 5 s 43]\nThe certificate of value shall require such facts and information as may be determined by the commissioner to be reasonably necessary in the administration of the state education aid formulas. The commissioner shall prescribe the content, format, and manner of the certificate of value pursuant to section 270C.30, except that a \"law administered by the commissioner\" includes the property tax laws.\nThe county auditor shall transmit the certificate of value to the assessor who shall insert into the certificate of value the most recent market value and when available, the year of original construction of each parcel of property, and shall transmit the certificate of value to the Department of Revenue. Upon the request of a city council located within the county, a copy of each certificate of value for property located in that city shall be made available to the governing body of the city. The assessor shall remove the homestead classification for the following assessment year from a property which is sold or transferred, unless the grantee or the person to whom the property is transferred completes a homestead application under section 273.124, subdivision 13, and qualifies for homestead status.\nNo real estate sold or transferred for which a certificate of real estate value is required under this section shall be classified as a homestead, unless a certificate of value has been filed with the county auditor in accordance with this section.\nThis subdivision shall apply to any real estate taxes that are payable the year or years following the sale or transfer of the property.\nA certificate of real estate value is not required when the real estate is being conveyed to the state of Minnesota, a political subdivision of the state, or any combination of them, for highway or roadway right-of-way purposes, provided that the agency or governmental unit has agreed to file a list of the real estate conveyed to the agency or governmental unit with the commissioner of revenue by June 1 of the year following the year of the conveyance.\nA certificate of real estate value is not required when the transfer is made by an instrument which qualifies as a designated transfer as defined in section 287.20, subdivision 3a, and the instrument indicates on the first page or the signature page that the conveyance is a designated transfer pursuant to section 287.20, subdivision 3a.\nA certificate of real estate value is not required when the transfer is made by a deed in fulfillment of a contract for deed when the deed refers to a recorded contract for deed by document number or book and page and the consideration paid for the real estate described in the contract for deed.",
	"repealed": false
}