{
	"id": "626A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/626A.37",
	"title": "626A.37 ISSUANCE OF ORDER FOR PEN REGISTER, TRAP AND TRACE DEVICE, OR MOBILE TRACKING DEVICE.",
	"text": "Upon an application made under section 626A.36, the court may enter an ex parte order authorizing the installation and use of a pen register, trap and trace device, or mobile tracking device within the jurisdiction of the court if the court finds on the basis of the information submitted by the applicant that there is reason to believe that the information likely to be obtained by the installation and use is relevant to an ongoing criminal investigation.\n(a) An order issued under this section must specify:\n(1) the identity, if known, of the person to whom is leased or in whose name is listed the telephone line to which the pen register or trap and trace device is to be attached or of the person to be traced by the mobile tracking device;\n(2) the identity, if known, of the person who is the subject of the criminal investigation;\n(3) the number and, if known, physical location of the telephone line to which the pen register or trap and trace device is to be attached or the identity or nature of the object or objects to which the mobile tracking device is to be attached, and, in the case of a trap and trace device, the geographic limits of the trap and trace order;\n(4) a statement of the offense to which the information likely to be obtained by the pen register, trap and trace device, or mobile tracking device relates;\n(5) the identity of the law enforcement or investigative officer responsible for installation and use of the pen register, trap and trace device, or mobile tracking device; and\n(6) the period during which the use of the pen register, trap and trace device, or mobile tracking device is authorized.\n(b) An order issued under this section must direct, upon the request of the applicant, the furnishing of information, facilities, and technical assistance necessary to accomplish the installation of the pen register, trap and trace device, or mobile tracking device under section 626A.38.\n(a) An order issued under this section must authorize the installation and use of a pen register, a trap and trace device, or a mobile tracking device for a period not to exceed 60 days, or the period necessary to achieve the objective of the authorization, whichever is less.\n(b) Extensions of an order may be granted, but only upon an application for an order under section 626A.36 and upon the judicial finding required by subdivision 1. The extension must include a statement of any changes in the information required in subdivision 2. The period of extension must be for a period not to exceed 60 days, or the period necessary to achieve the objective for which it is granted, whichever is less.\n(a) An order authorizing or approving the installation and use of a pen register, trap and trace device, or a mobile tracking device must direct that:\n(1) the order be sealed until otherwise ordered by the court; and\n(2) the person owning or leasing the line to which the pen register or a trap and trace device is attached, or who has been ordered by the court to provide assistance to the applicant, not disclose the existence of the pen register, trap and trace device, mobile tracking device, or the existence of the investigation to the listed subscriber, or to any other person, unless or until otherwise ordered by the court.\n(b) Paragraph (a) does not apply to an order that involves location information of electronic devices, as defined in section 626A.42. Instead, the filing, sealing, and reporting requirements for those orders are governed by section 626A.42, subdivision 4. However, any portion of an order that does not involve location information of electronic devices continues to be governed by paragraph (a).\nA warrant or other order for a mobile tracking device issued under this section or other authority may authorize the use of a mobile tracking device within the jurisdiction of the court and outside of that jurisdiction as long as the device is installed in the jurisdiction.",
	"repealed": false
}