{
	"id": "60A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.19",
	"title": "60A.19 FOREIGN COMPANIES.",
	"text": "Any insurance company of another state, upon compliance with all laws governing such corporations in general and with the foregoing provisions so far as applicable and the following requirements, shall be admitted to do business in this state:\n(1) It shall deposit with the commissioner a certified copy of its charter or certificate of incorporation and its bylaws, and a statement showing its financial condition and business, verified by its president and secretary or other proper officers;\n(2) It shall furnish the commissioner satisfactory evidence of its legal organization and authority to transact the proposed business and that its capital, assets, deposits with the proper official of its own state, amount insured, number of risks, reserve and other securities, and guaranties for protection of policyholders, creditors, and the public, comply with those required of like domestic companies;\n(3) By a duly executed instrument filed in the office of the commissioner, it shall appoint the commissioner and successors in office its lawful attorneys in fact and therein irrevocably agree that legal process in any action or proceeding against it may be served upon them with the same force and effect as if personally served upon it, so long as any of its liability exists in this state;\n(4) It shall appoint, as its agents in this state, residents thereof, and obtain from the commissioner a license to transact business;\n(5) Regardless of what lines of business an insurer of another state is seeking to write in this state, the lines of business it is licensed to write in its state of incorporation shall be the basis for establishing the financial requirements it must meet for admission in this state or for continuance of its authority to write business in this state;\n(6) No insurer of another state shall be admitted to do business in this state for a line of business that it is not authorized to write in its state of incorporation, unless the statutes of that state prohibit all insurers from writing that line of business.\nWhen garnishee process is served upon the commissioner, as attorney for any insurance company, no garnishee fee shall be paid the commissioner. After the receipt of copy of the process the insurance company may demand of the attorney of the person making the garnishee the proper fees, and if the demand is not complied with before the day fixed for the disclosure of the garnishee, the proceeding may be dismissed.\nBefore any corporation, association, or company issuing policies of insurance of any character and not organized or existing pursuant to the laws of this state is admitted to or authorized to transact the business of insurance in this state, it shall, by a duly executed instrument to be filed in the office of the commissioner, constitute and appoint the commissioner and successors in office its true and lawful attorney, upon whom proofs of loss, any notice authorized or required by any contract with the company to be served on it, summonses and all lawful processes in any action or legal proceeding against it may be served, and that the authority thereof shall continue in force irrevocable so long as any liability of the company remains outstanding in this state.\nThis instrument shall contain a provision and agreement declaring that the company, association, or corporation desires to transact the business of insurance in this state, and that it will accept a license therefor according to the laws of this state.\nIn case of the failure of any such insurance company to comply with any of the provisions of this subdivision and subdivision 4, or if it shall violate any of the conditions or agreements contained in the instrument filed, its right to transact insurance business in this state shall cease and it shall be the duty of the commissioner to immediately declare its license revoked; and, in case of revocation, the company shall not be again licensed to transact business in this state for the period of one year from date of the revocation.\nThe service of process authorized by this section shall be made in compliance with section 45.028, subdivision 2.\n(1) Deposit. Such company of any foreign country, except fraternal benefit societies, shall not be admitted until, besides complying with the foregoing requirements, it has made a deposit with the commissioner in accordance with section 60A.10, subdivision 4, or with the proper officer of some other state of the United States, of a sum not less than the deposit required of a like company by the laws of this state and this deposit shall be of the same class of securities and subject to the same limitations required for the deposit of domestic companies that must by law maintain a deposit.\nThis deposit shall be in exclusive trust for all its policyholders and creditors in the United States, and for all purposes of the insurance laws shall be deemed assets of the company.\n(2) Trustees, investments and funds. Any company of a foreign country may duly appoint one or more citizens of the United States, approved by the commissioner, to hold funds or other property for the benefit of its policyholders and creditors therein. A certified copy of their appointment and of the instrument of trust shall be filed with the commissioner, who shall have the same authority in the premises as in the case of the affairs of all companies. These funds shall be invested in the same securities as required of other insurance companies and, together with the deposits required, shall constitute the assets of the company in respect to its policyholders and creditors in the United States.\n(1) In the event that a domestic insurance company, after complying with all reasonable laws and rulings of any other state or country, is refused permission by that state or country to transact business therein after the commissioner of commerce of Minnesota has determined that that company is solvent and properly managed and after the commissioner has so certified to the proper authority of that other state or country, then, and in every such case, the commissioner may forthwith suspend or cancel the certificate of authority of every insurance company organized under the laws of that other state or country to the extent that it insures, or seeks to insure, in this state against any of the risks or hazards which that domestic company seeks to insure against in that other state or country. Without limiting the application of the foregoing provision, it is hereby determined that any law or ruling of any other state or country which prescribes to a Minnesota domestic insurance company the premium rate or rates for life insurance issued or to be issued outside that other state or country shall not be reasonable.\n(2) This section does not apply to insurance companies organized or domiciled in a state or country, the laws of which do not impose retaliatory taxes, fines, deposits, penalties, licenses, or fees or which grant, on a reciprocal basis, exemptions from retaliatory taxes, fines, deposits, penalties, licenses, or fees to insurance companies domiciled in this state.\nNo policy of insurance issued to a resident of this state shall be invalidated by the occurrence of hostilities between any foreign country and the United States.\nMS 2010 [Renumbered, 60A.198 subd 8]",
	"repealed": false
}