{
	"id": "333.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/333.055",
	"title": "333.055 TERM OF CERTIFICATE.",
	"text": "Filing of a certificate hereunder shall be effective upon filing and shall remain in effect as long as an annual renewal for the certificate is filed in each calendar year following the calendar year in which the original filing was filed. The certificate expires in the calendar year following a calendar year in which the annual renewal was not filed. Notice of the annual renewal requirement must be provided to the person or entity submitting the certificate at the time of the original filing.\nAssumed name certificates on file with the secretary of state on September 5, 2011, are exempt from the renewal requirements of this section until the expiration of the original ten-year term.\nAny assumed name certificate that expires as a result of failing to file the annual renewal, and any assumed name certificate filed prior to September 5, 2011, that expires because of the expiration of the original or renewed ten-year term, may be reinstated by filing the annual renewal with the $25 reinstatement fee.\nThe annual renewal filed under subdivision 1 must include the assumed name and the address of the principal place of business.\nThe secretary of state shall charge and collect a fee of $30 for each filing submitted with respect to an assumed name except for the annual renewal, for which no fee will be charged.\nThe secretary of state shall accept for filing all certificates and renewals thereof which comply with the provisions of sections 333.001 to 333.06 and which are accompanied by the prescribed fees, notwithstanding the fact that the assumed name disclosed therein may not be distinguishable from one or more other assumed names already filed with the secretary of state. The secretary of state shall not accept for filing a certificate that discloses an assumed name that is not distinguishable from a corporate, limited liability company, limited liability partnership, cooperative, or limited partnership name in use or reserved in this state by another or a trade or service mark registered with the secretary of state, unless there is filed with the certificate a written consent, court decree of prior right, or affidavit of nonuser of the kind required by section 302A.115, subdivision 1, clause (d). The secretary of state shall determine whether a name is distinguishable from another name for purposes of this subdivision.",
	"repealed": false
}