{
	"id": "123A.49",
	"url": "https://www.revisor.mn.gov/statutes/cite/123A.49",
	"title": "123A.49 APPEALS.",
	"text": "Any district or any person aggrieved by final order of the county board or final order of the county auditor, made pursuant to the provisions of this code, may appeal from such final order to the district court upon the following grounds:\n(1) That the county board or the county auditor had no jurisdiction to act;\n(2) That the county board or the county auditor exceeded its jurisdiction;\n(3) That the action appealed from is arbitrary, fraudulent, capricious or oppressive or in unreasonable disregard of the best interest of the territory affected;\n(4) That the order of action appealed from is based upon an erroneous theory of law.\nAn appeal from a final order of a county board or the county auditor shall be taken by serving a notice of appeal upon the county auditor. An appeal from a final order of a county board or a county auditor shall be taken to the district court in the county of the board or auditor. Notice of appeal must be served within 30 days of the issuance of the order appealed from and shall be accompanied by a corporate surety bond in the amount of $250, conditioned for the payment of all costs taxed against appellant on such appeal. The notice of appeal shall be filed with the court administrator of the district court and noticed for hearing in the manner provided for the trial of civil actions by Minnesota Rules of Civil Procedure.\nIn an appeal from an order of a county auditor effecting a consolidation the action of the commissioner approving the plat is reviewable and the commissioner may be called by either party as a witness in such appeal proceedings and may be examined under the Rules of Civil Procedure relating to the cross-examination of adverse parties.\nAny school district or any person affected by final order of the county board or final order of the county auditor shall be permitted to intervene in appeals under this section as a party respondent.\nAn appeal lies from the district court in accordance with the Rules of Civil Appellate Procedure.\nUnless otherwise provided by law, any school district or any person aggrieved by a final order of the commissioner made pursuant to provisions of this code may proceed under the provisions of sections 14.57 to 14.69.",
	"repealed": false
}