{
	"id": "342.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/342.16",
	"title": "342.16 CANNABIS BUSINESSES; GENERAL OWNERSHIP DISQUALIFICATIONS AND REQUIREMENTS.",
	"text": "(a) A license holder or applicant must meet each of the following requirements, if applicable, to hold or receive a cannabis license issued under this chapter:\n(1) be at least 21 years of age;\n(2) have completed an application for licensure or application for renewal;\n(3) have paid the applicable application fee and license fee;\n(4) if the applicant or license holder is a business entity, be incorporated in the state or otherwise formed or organized under the laws of the state;\n(5) not be employed by the office or any state agency with regulatory authority under this chapter or the rules adopted pursuant to this chapter;\n(6) not be a licensed peace officer, as defined in section 626.84, subdivision 1, paragraph (c);\n(7) never have had a license previously issued under this chapter revoked, and never have had a cannabis license, a registration, an agreement, or another authorization to operate a cannabis business issued under the laws of another state revoked;\n(8) have filed any previously required tax returns for a cannabis business;\n(9) have paid and remitted any business taxes, gross receipts taxes, interest, or penalties due relating to the operation of a cannabis business;\n(10) have fully and truthfully complied with all information requests of the office relating to license application and renewal;\n(11) not be disqualified under section 342.15;\n(12) not employ an individual who is disqualified from working for a cannabis business under this chapter;\n(13) meet the ownership and operational requirements for the type of license and, if applicable, endorsement sought or held; and\n(14) not have had any confirmed labor violation with the Department of Labor, National Labor Relations Board, or the Occupational Safety and Health Administration within the last five years.\n(b) A health care practitioner who certifies qualifying medical conditions for patients is prohibited from:\n(1) holding a direct or indirect economic interest in a cannabis business;\n(2) serving as a cooperative member, director, manager, general partner, or employee of a cannabis business; or\n(3) advertising with a cannabis business in any way.\n(c) If the license holder or applicant is a business entity, every officer, director, manager, and general partner of the business entity must meet each of the requirements of this section.\n(d) The ownership disqualifications and requirements under this section do not apply to a hemp business license holder or applicant.",
	"repealed": false
}