{
	"id": "17.54",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.54",
	"title": "17.54 COUNCILS.",
	"text": "A commodity research and promotion council may be created for the producers of each agricultural commodity by filing with the commissioner a petition requesting that the producers of such commodity be subjected to the provisions of sections 17.51 to 17.69. The petition must be signed by 1,000 producers or 15 percent of the producers proposed to be covered by the promotion order, whichever is less. At least two producers shall certify under oath that the petition has been signed only by producers of the commodity involved.\nUpon petition of the required number of producers the commissioner shall, after consultation with the various producer or commodity organizations of the particular commodity petitioning for a referendum, determine the size of the council and distribution of the council membership.\nWithin 30 days after the filing of the petition by the required number of producers of an agricultural commodity the commissioner shall appoint a nominating committee of at least five producers of that commodity who shall, within 60 days from the filing of the petition, nominate at least two producer candidates for each council position and certify the names of such nominees to the commissioner. Nominees shall be selected with a view to establishing a fair representation of all producers of the particular commodity throughout the area to be organized, which shall comprise the entire state unless the commissioner determines that at least 95 percent of the production of the commodity is in a lesser area, in which event the commissioner shall define the area following county lines. Whenever possible, the areas represented by council members shall correspond to state crop reporting districts as defined by the Minnesota crop and livestock reporting service.\nUpon receipt of the nominations the commissioner shall promptly arrange an election to be held at places designated by the commissioner reasonably convenient to all producers in the organized area and provide notice of the election to all of the media having a general circulation in the organized area. Ballots setting forth the names of the nominated candidates and providing for write-in candidates shall be made available at all polling places. Only producers of the agricultural commodity involved shall be qualified to vote. General polling procedures shall be established by the commissioner by rule pursuant to chapter 14 to avoid voting by other than qualified producers. An impartial committee appointed by the commissioner shall tabulate the votes, and the candidates receiving the most votes shall be declared elected to the first council.\nAfter the first council for a commodity is elected, an election shall be held annually to elect members of the council. The election shall be held in the same manner as prescribed for the first council election except that the manner of choosing nominating committee members, the time of nominations and the time and place of elections shall be fixed by the commissioner. Mail balloting may be permitted by the commissioner.\nAt the first meeting of the first council for each commodity the commissioner shall determine by lot one-third of the council members whose terms shall expire June 30 in the calendar year following the year of the first election, one-third of the council members whose terms shall expire June 30 in the second calendar year and the remaining council members whose terms shall expire June 30 in the third calendar year. In the event the commissioner has designated specific areas for representation on the council, the terms of council members in any one area shall not expire in the same year. All council members elected in succeeding elections shall serve three-year terms and until their successors are elected and qualified. All terms shall expire on June 30 of the last year of the term unless another date is established by the commissioner for specific councils. In the event a council member ceases to have any of the qualifications herein established, that office shall be deemed vacant. An interim vacancy on the council shall be filled by the council for the remainder of the term vacated. The successor so appointed shall be a commodity producer residing in the same crop reporting district as the former member.\n(a) The commissioner shall serve as a member of each council without vote. Each council shall elect from its own membership a chair, a vice-chair, a secretary, and other officers the council deems appropriate. An executive committee of no more than five members including the officers may also be elected. Except as provided in paragraph (b), terms of the officers shall expire on June 30 of each year; however, they may serve until their successors have been elected but not beyond July 15.\n(b) If the commissioner establishes an alternative expiration date for a specific council under subdivision 5 or 13, council members may serve on the council until their successors have been elected but not beyond 15 days after the expiration date.\nSubject to the requirements of sections 17.51 to 17.69, a council shall meet at times and places as it may determine or upon call of the chair or of any three members or one-third of the council, whichever is greater. A majority of the voting members of a council shall constitute a quorum for the transaction of all business in carrying out the duties of the council.\nAny council established pursuant to any act on or before July 1, 1982, may maintain the number and regional distribution of council members in effect at that time and council members elected under the provisions of any act in effect prior to July 1, 1982, may serve out their terms according to those provisions. Any promotional order in effect prior to July 1, 1982, shall remain in effect until the promotional order would terminate under the terms of the promotional order itself, or under the provisions of the legislation authorizing that promotional order, or until the promotional order is terminated pursuant to section 17.64, whichever occurs first. No referendum need be held by the commissioner to establish any promotion order in effect prior to July 1, 1982. No referendum need be held by the commissioner to bring any promotion order into early compliance with Laws 1982, chapter 582, sections 1 to 11, when the proposed changes in the promotion order are requested by the council members and approved by the commissioner.\nFor the purpose of the administration of sections 17.51 to 17.69 as they pertain to a Minnesota Area Potato Research and Promotion Council established pursuant to Laws 1967, chapter 417, as amended, the state is divided into two areas. Area number one includes the counties of Kittson, Marshall, Polk, Pennington, Red Lake, Norman, Mahnomen, Clay, Wilkin, Roseau, Lake of the Woods, Beltrami, Clearwater, and Becker. Area number two includes the rest of the counties of the state. Sections 17.51 to 17.69 shall apply to any of the above areas of the state where the commissioner has determined that the area was organized prior to July 1, 1982, pursuant to section 30.464, subdivision 3, as amended through June 30, 1982.\nFor the purposes of sections 17.51 to 17.69, any area potato council established pursuant to section 30.465, prior to July 1, 1982, shall maintain the number and distribution of council members in effect at that time. Council members elected or appointed under the provisions of section 30.465 may serve out their terms. For the purposes of sections 17.51 to 17.69, the provisions of sections 30.462, 30.463, 30.467, 30.469 and 30.472 as amended through June 30, 1982, shall be considered to be the promotional order for an area potato council, and shall remain in effect as a promotional order until terminated or modified by referendum.\nNotwithstanding subdivisions 3, 4, and 5, any area potato council which continues in existence pursuant to subdivision 10 shall include one voting member who represents potato wash plants. This member shall be appointed by the governor for a four-year term coterminous with that of the governor.\nFor the purpose of the administration of sections 17.51 to 17.69 as they pertain to the Dairy Research and Promotion Council established pursuant to Laws 1969, chapter 851, as amended, the vote in the name of a cooperative association of producers may be deemed the vote of all members of that cooperative association. The commissioner shall schedule and specify procedures for bloc voting by a cooperative. A ballot prepared by the council and the commissioner shall be sent by each cooperative to all member and nonmember producers with a return envelope addressed to the commissioner. The ballot shall indicate that the cooperative association intends to vote in favor of or in opposition to the question. In the case of members the ballot shall indicate the expiration date of the ballot and state that if the ballot is not returned by that date the ballot shall be considered to be in favor of the vote of the association. The cooperative shall return the completed bloc vote ballot to the commissioner. A cooperative association shall not be required to bloc vote its producers but in that event it shall inform each producer of its decision and provide each producer with an individual referendum ballot with a return envelope addressed to the commissioner.\nEach private processor of dairy products and each cooperative shall file with the commissioner a list of producers who market the bulk of their production with that private processor or cooperative. The polling procedures established by the commissioner pursuant to subdivision 4 shall ensure that dairy producers marketing the bulk of their production with a private processor have the option to vote in any referendum held pursuant to Laws 1982, chapter 586, sections 1 to 11.\nNotwithstanding subdivision 5, the term of office of members of any council established for the producers of cows' milk or products derived from cows' milk shall be as provided in this subdivision. The term of office shall be two years, with the terms of half the council members expiring in odd-numbered years, and the terms of the remaining council members expiring in even-numbered years. All terms expire on June 30 of the last year of the term unless another date is established by the commissioner for the council.",
	"repealed": false
}