{
	"id": "347.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.61",
	"title": "347.61 CIVIL ENFORCEMENT.",
	"text": "(a) The board may issue a correction order requiring a commercial breeder to correct a violation of state statutes, rules, and regulations governing breeding facilities. The correction order must state the deficiencies that constitute the violation; the specific statute, rule, or regulation violated; and when the violation must be corrected.\n(b) A commercial breeder may ask the board to reconsider any portion of the correction order that the commercial breeder believes is in error. The request for reconsideration must be made in writing by certified mail or electronically in a method approved by the board within seven days after receipt of the correction order. The request for reconsideration does not stay the correction order. The board must respond to the request for reconsideration within 15 days after receiving a request. The board's disposition of a request for reconsideration is final. The board may extend the time for complying with a correction order after receiving a request for reconsideration if necessary.\n(c) The board must reinspect the facility within 15 days after the time for correcting the violation has passed to determine whether the violation has been corrected. If the violation has been corrected, the board must notify the commercial breeder in writing that the commercial breeder is in compliance with the correction order. The board may charge a reinspection fee to determine if a previous violation has been corrected.\nAfter the inspection required under subdivision 1, paragraph (c), the board may issue an order requiring violations to be corrected and administratively assessing monetary penalties for violations. The administrative penalty order must include a citation of the statute, rule, or regulation violated; a description of the violation; and the amount of the penalty for each violation. A single correction order may assess a maximum administrative penalty of $5,000.\nIn addition to any other remedy provided by law, the board may bring an action for injunctive relief in the district court in Ramsey County or in the county in which a violation of the statutes, rules, or regulations governing the breeding of cats and dogs occurred to enjoin the violation.\nThe board must issue an order to cease a practice if its continuation would result in an immediate risk to animal welfare or public health. An order issued under this subdivision is effective for a maximum of 72 hours. The board or its designated agent must seek an injunction or take other administrative action authorized by law to restrain a practice beyond 72 hours. The issuance of a cease-and-desist order does not preclude other enforcement action by the board.\n(a) The board may suspend, revoke, or refuse to renew a license as follows:\n(1) for failure to comply with a correction order;\n(2) for failure to pay an administrative penalty;\n(3) for failure to meet the requirements of section 347.58 or 347.59; or\n(4) for falsifying information requested by the board.\nA license suspension, revocation, or nonrenewal may be appealed through the Office of Administrative Hearings. A notice of intent to appeal must be filed in writing with the board within 20 days after receipt of the notice of suspension, revocation, or nonrenewal.\n(b) The board must revoke a license if a commercial breeder has been convicted of cruelty to animals under Minnesota law or a substantially similar animal cruelty law of another jurisdiction, or for the denial, revocation, or suspension of a similar license by another federal or state authority. A license revocation under this subdivision may be appealed through the Office of Administrative Hearings. A notice of intent to appeal must be filed in writing with the board within 20 days after receipt of the notice of revocation.\n(c) A commercial breeder whose license is revoked may not reapply for licensure for two years after the date of revocation. The license is permanently revoked if the basis for the revocation was a gross misdemeanor or felony conviction for animal cruelty.\n(d) A commercial breeder whose license is suspended or revoked two times is permanently barred from licensure.\n(a) Except as provided in paragraph (b), if the board proposes to refuse to renew, suspend, or revoke a license, the board must first notify the commercial breeder in writing of the proposed action and provide an opportunity to request a hearing under the contested case provisions of chapter 14. If the commercial breeder does not request a hearing within 20 days after receipt of the notice of the proposed action, the board may proceed with the action without a hearing.\n(b) The contested case provisions of chapter 14 do not apply when the board denies a license based on an applicant's failure to meet the minimum qualifications for licensure.\n(c) A commercial breeder may appeal the amount of an administrative penalty order through the Office of Administrative Hearings pursuant to the procedures set forth in chapter 14. A commercial breeder wishing to file an appeal must notify the board in writing within 20 days after receipt of the administrative penalty order.\nThe board may accept as prima facie evidence of grounds for an enforcement action under this section any enforcement or disciplinary action from another jurisdiction, if the underlying violation would be grounds for a violation under the provisions of this section.\nA final order by the board may be appealed to the Minnesota Court of Appeals.",
	"repealed": false
}