{
	"id": "10A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/10A.20",
	"title": "10A.20 CAMPAIGN REPORTS.",
	"text": "(a) The treasurer of a political committee, political fund, principal campaign committee, or party unit must begin to file the reports required by this section for the first year it receives contributions or makes expenditures that require it to register under section 10A.14 and must continue to file until the committee, fund, or party unit is terminated.\n(b) If, on or before the last date included in a reporting period, a political committee, political fund, principal campaign committee, or party unit received contributions or made expenditures that would require it to register under section 10A.14, the political committee, political fund, principal campaign committee, or party unit must both register with the board under section 10A.14 and report under this section by the date that the report for that reporting period is due.\n(c) The reports must be filed electronically in a standards-based open format specified by the board. For good cause shown, the board must grant exemptions to the requirement that reports be filed electronically.\nIf the position of treasurer of a principal campaign committee, political committee, political fund, or party unit is vacant, the candidate, chair of a political committee or party unit, or association officer of a political fund is responsible for filing reports required by this section.\nA report filed under this section is nonpublic data until 8:00 a.m. on the day following the day the report was due.\n[Repealed, 2015 c 73 s 27]\n(a) The reports must be filed with the board on or before January 31 of each year and additional reports must be filed as required and in accordance with paragraphs (b) to (f).\n(b) In each year in which the name of a candidate for legislative or district court judicial office is on the ballot, the report of the principal campaign committee must be filed 15 days before a primary election and ten days before a general election, seven days before a special primary election and seven days before a special general election, and ten days after a special election cycle.\n(c) In each general election year, a political committee, a political fund, a state party committee, and a party unit established by all or a part of the party organization within a house of the legislature must file reports on the following schedule:\n(1) a first-quarter report covering the calendar year through March 31, which is due April 14;\n(2) a report covering the calendar year through May 31, which is due June 14;\n(3) a pre-primary-election report due 15 days before a primary election;\n(4) a pre-general-election report due 42 days before the general election; and\n(5) a pre-general-election report due ten days before a general election.\n(d) In each general election year, a party unit not included in paragraph (c) must file reports 15 days before a primary election and ten days before a general election.\n(e) In each year in which a constitutional office or appellate court judicial seat is on the ballot, the principal campaign committee of a candidate for that office or seat must file reports on the following schedule:\n(1) a first-quarter report covering the calendar year through March 31, which is due April 14;\n(2) a report covering the calendar year through May 31, which is due June 14;\n(3) a pre-primary-election report due 15 days before a primary election;\n(4) a pre-general-election report due 42 days before the general election;\n(5) a pre-general-election report due ten days before a general election; and\n(6) for a special election, a constitutional office candidate whose name is on the ballot must file reports seven days before a special primary election, seven days before a special general election, and ten days after a special election cycle.\n(f) Notwithstanding paragraphs (a) to (e):\n(1) the principal campaign committee of a candidate who did not file for office is not required to file the report due June 14, the report due 15 days before the primary election, or the report due seven days before a special primary election; and\n(2) the principal campaign committee of a candidate whose name will not be on the general election ballot is not required to file the report due 42 days before the general election, the report due ten days before a general election, or the report due seven days before a special general election.\n(a) This subdivision applies to a political committee, political fund, or political party unit that during a non-general election year:\n(1) spends in aggregate more than $200 to influence the nomination or election of local candidates;\n(2) spends in aggregate more than $200 to make independent expenditures on behalf of local candidates; or\n(3) spends in aggregate more than $200 to promote or defeat ballot questions defined in section 10A.01, subdivision 7, clause (2), (3), or (4).\n(b) In addition to the reports required by subdivision 2, the entities listed in paragraph (a) must file the following reports in each non-general election year:\n(1) a first-quarter report covering the calendar year through March 31, which is due April 14;\n(2) a report covering the calendar year through May 31, which is due June 14;\n(3) a July report due 15 days before the local primary election date specified in section 205.065;\n(4) a pre-general-election report due 42 days before the local general election; and\n(5) a pre-general-election report due ten days before a local general election.\nThe reporting obligations in this paragraph begin with the first report due after the reporting period in which the entity reaches the spending threshold specified in paragraph (a). The July report required under clause (3) is required for all entities required to report under paragraph (a), regardless of whether the candidate or issue is on the primary ballot or a primary is not conducted.\n(a) The report required by this section must include each of the items listed in paragraphs (b) to (q) that are applicable to the filer. The board shall prescribe forms based on filer type indicating which of those items must be included on the filer's report.\n(b) The report must disclose the amount of liquid assets on hand at the beginning of the reporting period.\n(c) The report must disclose the name, address, employer, or occupation if self-employed, and registration number if registered with the board, of each individual or association that has made one or more contributions to the reporting entity, including the purchase of tickets for a fundraising effort, that in aggregate within the year exceed $200 for legislative or statewide candidates or more than $500 for ballot questions, together with the amount and date of each contribution, and the aggregate amount of contributions within the year from each source so disclosed. A donation in kind must be disclosed at its fair market value. An approved expenditure must be listed as a donation in kind. A donation in kind is considered consumed in the reporting period in which it is received. The names of contributors must be listed in alphabetical order. Contributions from the same contributor must be listed under the same name. When a contribution received from a contributor in a reporting period is added to previously reported unitemized contributions from the same contributor and the aggregate exceeds the disclosure threshold of this paragraph, the name, address, and employer, or occupation if self-employed, of the contributor must then be listed on the report.\n(d) The report must disclose the sum of contributions to the reporting entity during the reporting period.\n(e) The report must disclose each loan made or received by the reporting entity within the year in aggregate in excess of $200, continuously reported until repaid or forgiven, together with the name, address, occupation, principal place of business, if any, and registration number if registered with the board of the lender and any endorser and the date and amount of the loan. If a loan made to the principal campaign committee of a candidate is forgiven or is repaid by an entity other than that principal campaign committee, it must be reported as a contribution for the year in which the loan was made.\n(f) The report must disclose each receipt over $200 during the reporting period not otherwise listed under paragraphs (c) to (e).\n(g) The report must disclose the sum of all receipts of the reporting entity during the reporting period.\n(h) The report must disclose the name, address, and registration number if registered with the board of each individual or association to whom aggregate expenditures, approved expenditures, independent expenditures, and ballot question expenditures have been made by or on behalf of the reporting entity within the year in excess of $200, together with the amount, date, and purpose of each expenditure, including an explanation of how the expenditure was used, and the name and address of, and office sought by, each candidate or local candidate on whose behalf the expenditure was made, identification of the ballot question that the expenditure was intended to promote or defeat and an indication of whether the expenditure was to promote or to defeat the ballot question, and in the case of independent expenditures made in opposition to a candidate or local candidate, the candidate's or local candidate's name, address, and office sought. A reporting entity making an expenditure on behalf of more than one candidate or local candidate must allocate the expenditure among the candidates and local candidates on a reasonable cost basis and report the allocation for each candidate or local candidate. The report must list on separate schedules any independent expenditures made on behalf of local candidates and any expenditures made for ballot questions as defined in section 10A.01, subdivision 7, clause (2), (3), or (4).\n(i) The report must disclose the sum of all expenditures made by or on behalf of the reporting entity during the reporting period.\n(j) The report must disclose the amount and nature of an advance of credit incurred by the reporting entity, continuously reported until paid or forgiven. If an advance of credit incurred by the principal campaign committee of a candidate is forgiven by the creditor or paid by an entity other than that principal campaign committee, it must be reported as a donation in kind for the year in which the advance of credit was made.\n(k) The report must disclose the name, address, and registration number if registered with the board of each political committee, political fund, principal campaign committee, local candidate, or party unit to which contributions have been made that aggregate in excess of $200 within the year and the amount and date of each contribution. The report must list on separate schedules any contributions made to state candidates' principal campaign committees and any contributions made to local candidates.\n(l) The report must disclose the sum of all contributions made by the reporting entity during the reporting period and must separately disclose the sum of all contributions made to local candidates by the reporting entity during the reporting period.\n(m) The report must disclose the name, address, and registration number if registered with the board of each individual or association to whom noncampaign disbursements have been made that aggregate in excess of $200 within the year by or on behalf of the reporting entity and the amount, date, and purpose of each noncampaign disbursement, including an explanation of how the expenditure was used.\n(n) The report must disclose the sum of all noncampaign disbursements made within the year by or on behalf of the reporting entity.\n(o) The report must disclose the name and address of a nonprofit corporation that provides administrative assistance to a political committee or political fund as authorized by section 211B.15, subdivision 17, the type of administrative assistance provided, and the aggregate fair market value of each type of assistance provided to the political committee or political fund during the reporting period.\n(p) Legislative, statewide, and judicial candidates, party units, and political committees and funds must itemize contributions that in aggregate within the year exceed $200 for legislative or statewide candidates or more than $500 for ballot questions on reports submitted to the board. The itemization must include the date on which the contribution was received, the individual or association that provided the contribution, and the address of the contributor. Additionally, the itemization for a donation in kind must provide a description of the item or service received. Contributions that are less than the itemization amount must be reported as an aggregate total.\n(q) Legislative, statewide, and judicial candidates, party units, political committees and funds, and committees to promote or defeat a ballot question must itemize expenditures and noncampaign disbursements that in aggregate exceed $200 in a calendar year on reports submitted to the board. The itemization must include the date on which the committee made or became obligated to make the expenditure or disbursement, the name and address of the vendor that provided the service or item purchased, and a description of the service or item purchased, including an explanation of how the expenditure was used. Expenditures and noncampaign disbursements must be listed on the report alphabetically by vendor.\n[Repealed by amendment, 1999 c 220 s 23]\nA report must cover the period from January 1 of the reporting year to seven days before the filing date, except that the report due on January 31 must cover the period from January 1 to December 31 of the reporting year.\n(a) Any loan, contribution, or contributions:\n(1) to a political committee or political fund from any one source totaling more than $1,000;\n(2) to the principal campaign committee of a candidate for an appellate court judicial office totaling more than $2,000;\n(3) to the principal campaign committee of a candidate for district court judge totaling more than $400; or\n(4) to the principal campaign committee of a candidate for constitutional office or for the legislature totaling more than 50 percent of the election segment contribution limit for the office,\nreceived between the last day covered in the last report before an election and the election must be reported to the board in the manner provided in paragraph (b).\n(b) A loan, contribution, or contributions required to be reported to the board under paragraph (a) must be reported to the board either:\n(1) in person by the end of the next business day after its receipt; or\n(2) by electronic means sent by the end of the next business day after its receipt.\n(c) These loans and contributions must also be reported in the next required report.\n(d) This notice requirement does not apply in a primary election to a candidate who is unopposed in the primary, in a primary election to a ballot question political committee or fund, or in a general election to a candidate whose name is not on the general election ballot. The board must post the report on its website by the end of the next business day after it is received.\n(e) This subdivision does not apply to a ballot question or independent expenditure political committee or fund that has not met the registration threshold of section 10A.14, subdivision 1a. However, if a contribution that would be subject to this section triggers the registration requirement in section 10A.14, subdivision 1a, then both registration under that section and reporting under this section are required.\n(a) A candidate who does not designate and cause to be formed a principal campaign committee and who makes campaign expenditures in aggregate in excess of $750 in a year must file with the board a report containing the information required by subdivision 3. Reports required by this subdivision must be filed by the dates on which reports by principal campaign committees must be filed.\n(b) An individual who makes independent expenditures that aggregate more than $1,500 in a calendar year or expenditures to promote or defeat a ballot question that aggregate more than $5,000 in a calendar year must file with the board a report containing the information required by subdivision 3. A report required by this subdivision must be filed by the date on which the next report by political committees and political funds must be filed.\nAn individual, political committee, political fund, or party unit filing a report or statement disclosing an independent expenditure under subdivision 3 or 6 must file with the report a sworn statement that the disclosed expenditures were not made with the authorization or expressed or implied consent of, or in cooperation or in concert with, or at the request or suggestion of any candidate; any candidate's principal campaign committee or agent; any local candidate, or any local candidate's agent.\n[Repealed, 2010 c 327 s 29]\nIf a principal campaign committee, party unit, or political committee has no receipts or expenditures during a reporting period, the treasurer must file with the board at the time required by this section a statement to that effect.\nAn association is not required to file any statement or report for a reporting period when the association accepted no contributions into the association's political fund and made no expenditures from its political fund since the last date included in its most recent filed report. If the association maintains a separate checking account for its political fund, the receipt of interest on the proceeds of that account and the payment of fees to maintain that account do not constitute activity that requires the filing of a report for an otherwise inactive political fund.\nThe board must exempt a member of or contributor to an association or any other individual, from the requirements of this section if the member, contributor, or other individual demonstrates by clear and convincing evidence that disclosure would expose the member or contributor to economic reprisals, loss of employment, or threat of physical coercion.\nAn association may seek an exemption for all of its members or contributors if it demonstrates by clear and convincing evidence that a substantial number of its members or contributors would suffer a restrictive effect on their freedom of association if members were required to seek exemptions individually.\n[Repealed, 1978 c 463 s 109]\nAn individual or association seeking an exemption under subdivision 8 must submit a written application for exemption to the board. The board, without hearing, must grant or deny the exemption within 30 days after receiving the application and must issue a written order stating the reasons for its action. The board must publish its order in the State Register and give notice to all parties known to the board to have an interest in the matter. If the board receives a written objection to its action from any party within 20 days after publication of its order and notification of interested parties, the board must hold a contested case hearing on the matter. Upon the filing of a timely objection from the applicant, an order denying an exemption is suspended pending the outcome of the contested case. If no timely objection is received, the exemption continues in effect until a written objection is filed with the board in a succeeding election year. The board by rule must establish a procedure so that an individual seeking an exemption may proceed anonymously if the individual would be exposed to the reprisals listed in subdivision 8 if the individual's identity were to be revealed for the purposes of a hearing.\n[Renumbered 10A.36]\n(a) If an individual or association fails to file a report required by this section or section 10A.202, the board may impose a late filing fee and a civil penalty as provided in this subdivision.\n(b) If a candidate, political committee, political fund, principal campaign committee, or party unit fails to file a report required by this section that is due January 31, the board may impose a late filing fee of $25 per day, not to exceed $1,000, commencing the day after the report was due.\n(c) Except for reports governed by paragraph (b), if an individual, political committee, political fund, principal campaign committee, party unit, or association fails to file a report required by subdivision 2, 2a, or 5, or by section 10A.202, the board may impose a late filing fee of $50 per day, not to exceed $1,000, commencing on the day after the date the statement was due. If the total expenditures or disbursements that occurred during the reporting period exceeds $25,000, then the board may also impose a late filing fee of up to two percent of the expenditures or disbursements that should have been reported, per day, commencing on the day after the report was due, not to exceed 100 percent of the amount that should have been reported.\n(d) If an individual, political committee, political fund, principal campaign committee, party unit, or association has been assessed a late filing fee or civil penalty under this subdivision during the prior four years, the board may impose a late filing fee, a civil penalty, or both of up to twice the amount otherwise authorized by this subdivision. If an individual, political committee, political fund, principal campaign committee, party unit, or association has been assessed a late filing fee under this subdivision more than two times during the prior four years, the board may impose a late filing fee of up to three times the amount otherwise authorized by this subdivision.\n(e) Within ten business days after the report was due or receipt by the board of information disclosing the potential failure to file a report required by this section, the board must send notice by certified mail that the individual or association may be subject to a civil penalty for failure to file the report. An individual who fails to file the report within seven days after the certified mail notice was sent by the board is subject to a civil penalty imposed by the board of up to $2,000 in addition to the late filing fees imposed by this subdivision.\nAn individual or association filing a report disclosing an expenditure or noncampaign disbursement that must be reported and itemized under subdivision 3, paragraph (h) or (m), that is a reimbursement to a third party must report the purpose of each expenditure or disbursement for which the third party is being reimbursed. In the alternative, the reporting individual or association may report individually each of the underlying expenditures being reimbursed. An expenditure or disbursement is a reimbursement to a third party if it is for goods or services that were not directly provided by the individual or association to whom the expenditure or disbursement is made. Third-party reimbursements include payments to credit card companies and reimbursement of individuals for expenses they have incurred.\nAn individual or association, other than a candidate or the members of a candidate's principal campaign committee, that directly solicits and causes others to make contributions to candidates or a party unit in a house of the legislature, that aggregate more than $5,000 between January 1 of a general election year and the end of the reporting period must file with the board a report disclosing the amount of each contribution, the names of the contributors, and to whom the contributions were given. The report must be filed 15 days before a primary and ten days before a general election. The report for each calendar year must be filed with the board by January 31 of the following year.\nA candidate whose opponent does not timely file the report due 15 days before the primary, the report due ten days before the general election, or the notice required under section 10A.25, subdivision 10, may petition the district court for immediate equitable relief to enforce the filing requirement. A prevailing party under this subdivision may be awarded attorney fees and costs by the court.",
	"repealed": false
}