{
	"id": "609.652",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.652",
	"title": "609.652 FRAUDULENT DRIVERS' LICENSES AND IDENTIFICATION CARDS; PENALTY.",
	"text": "For purposes of this section:\n(1) \"driver's license or identification card\" means a driver's license or identification card issued by the Driver and Vehicle Services Division of the Department of Public Safety or receipts issued by its authorized agents or those of any state as defined in section 171.01 that issues licenses recognized in this state for the operation of a motor vehicle or that issues identification cards recognized in this state for the purpose of indicating a person's legal name and age;\n(2) \"fraudulent driver's license or identification card\" means a document purporting to be a driver's license or identification card, but that is not authentic; and\n(3) \"sell\" means to sell, barter, deliver, exchange, distribute, or dispose of to another.\n(a) A person who does any of the following for consideration and with intent to manufacture, sell, issue, publish, or pass more than one fraudulent driver's license or identification card or to cause or permit any of the items listed in clauses (1) to (5) to be used in forging or making more than one false or counterfeit driver's license or identification card is guilty of a crime:\n(1) has in control, custody, or possession any plate, block, press, stone, digital image, computer software program, encoding equipment, computer optical scanning equipment, or digital photo printer, or other implement, or any part of such an item, designed to assist in making a fraudulent driver's license or identification card;\n(2) engraves, makes, or amends, or begins to engrave, make, or amend, any plate, block, press, stone, or other implement for the purpose of producing a fraudulent driver's license or identification card;\n(3) uses a photocopier, digital camera, photographic image, or computer software to generate a fraudulent driver's license or identification card;\n(4) has in control, custody, or possession or makes or provides paper or other material adapted and designed for the making of a fraudulent driver's license or identification card; or\n(5) prints, photographs, or in any manner makes or executes an engraved photograph, print, or impression purporting to be a driver's license or identification card.\n(b) Notwithstanding section 171.22, a person who manufactures or possesses more than one fraudulent driver's license or identification card with intent to sell is guilty of a crime.\nA person who commits any act described in subdivision 2 is guilty of a gross misdemeanor. A person convicted of a second or subsequent offense of this subdivision may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $10,000, or both.",
	"repealed": false
}