{
	"id": "325G.203",
	"url": "https://www.revisor.mn.gov/statutes/cite/325G.203",
	"title": "325G.203 DEFINITIONS.",
	"text": "For purposes of sections 325G.203 to 325G.208, the terms in this section have the meanings given them.\n\"Assistive device\" is an item, piece of equipment, or product system that is designed and used to increase, maintain, or improve functional capabilities of individuals with disabilities in the areas of seeing, hearing, speaking, walking, breathing, performing manual tasks, learning, caring for oneself, or working. The term includes, but is not limited to: manual wheelchairs, motorized wheelchairs, motorized scooters, and other aids that enhance the mobility of an individual; hearing aids, assistive listening devices, and other aids that enhance an individual's ability to hear or communicate; voice-synthesized computer modules, optical scanners, talking software, Braille printers, large print materials, and other devices that enhance an individual's ability to access print or communicate; and other assistive devices such as environmental controls, adaptive transportation aids, communication boards, and modified environments. \"Assistive device\" does not include a transcutaneous electrical nerve stimulator, neuromuscular electrical stimulator, or dynamic range of motion splint, if the stimulator or splint is already covered by a warranty.\n\"Assistive device dealer\" means a person who is in the business of selling new assistive devices.\n\"Assistive device lessor\" means a person who leases new assistive devices to consumers, or who holds the lessor's rights, under a written lease.\n\"Collateral costs\" means expenses incurred by a consumer in connection with the repair of a nonconformity, including the cost of sales tax and of obtaining an alternative assistive device.\n\"Consumer\" or \"agency\" means any of the following:\n(1) the purchaser of an assistive device, if the assistive device was purchased from an assistive device dealer or manufacturer for purposes other than resale;\n(2) a person to whom the assistive device is transferred for purposes other than resale, if the transfer occurs before the expiration of an express warranty applicable to the assistive device;\n(3) a person who may enforce the warranty; or\n(4) a person who leases an assistive device from an assistive device lessor under a written lease.\n\"Demonstrator\" means an assistive device used primarily for the purpose of demonstration to the public.\n\"Early termination cost\" means an expense or obligation that an assistive device lessor incurs as a result of both the termination of a written lease before the termination date set forth in that lease and the return of an assistive device to the manufacturer. The term includes a penalty for prepayment under a finance arrangement.\n\"Early termination savings\" means an expense or obligation that an assistive device lessor avoids as a result of both the termination of a written lease before the termination date set forth in that lease and the return of an assistive device to a manufacturer. The term includes an interest charge that the assistive device lessor would have paid to finance the assistive device or, if the assistive device lessor does not finance the assistive device, the difference between the total period of the lease term remaining after the early termination and the present value of that amount at the date of the early termination.\n\"Manufacturer\" means a person who manufactures or assembles assistive devices and agents of that person, including an importer, a distributor, a factory branch, distributor branch, and a warrantor of the manufacturer's assistive device. The term does not include an assistive device dealer or lessor.\n\"Nonconformity\" means a specific condition or generic defect or malfunction, or a defect or condition that substantially impairs the use, value, or safety of an assistive device, but does not include a condition or defect that is the result of abuse or unauthorized modification or alteration of the assistive device by the consumer.\nFor those assistive devices regulated under section 148.5197, \"nonconformity\" does not include a condition of the device that is the result of normal use which could be resolved through fitting adjustments, cleaning, or proper care.\n\"Reasonable attempt to repair\" means any of the following occurring within the term of an express warranty applicable to a new assistive device:\n(1) the manufacturer, assistive device lessor, or any of the manufacturer's authorized assistive device dealers accepts return of the new assistive device for repair at least two times; or\n(2) the assistive device is out of service for an aggregate of at least 30 cumulative days because of warranty nonconformities.",
	"repealed": false
}