{
	"id": "297E.12",
	"url": "https://www.revisor.mn.gov/statutes/cite/297E.12",
	"title": "297E.12 CIVIL PENALTIES.",
	"text": "If a tax is not paid within the time specified for payment, a penalty is added to the amount required to be shown as tax. The penalty is five percent of the unpaid tax if the failure is for not more than 30 days, with an additional penalty of five percent of the amount of tax remaining unpaid during each additional 30 days or fraction of 30 days during which the failure continues, not exceeding 15 percent in the aggregate.\nIf the taxpayer has not filed a return, for purposes of this subdivision the time specified for payment is the final date a return should have been filed.\nIf a taxpayer fails to make and file a return within the time prescribed or an extension, a penalty is added to the tax. The penalty is five percent of the amount of tax not paid on or before the date prescribed for payment of the tax.\n[Repealed, 1999 c 243 art 16 s 39]\nIf part of an additional assessment is due to negligence or intentional disregard of the provisions of this chapter or rules of the commissioner of revenue (but without intent to defraud), there is added to the tax an amount equal to ten percent of the additional assessment.\nIf a person files a false or fraudulent return, or attempts in any manner to evade or defeat a tax or payment of tax, there is imposed on the person a penalty equal to 50 percent of the tax found due for the period to which the return related, less amounts paid by the person on the basis of the false or fraudulent return.\nIf there is a pattern by a person of repeated failures to timely file returns or timely pay taxes, and written notice is given that a penalty will be imposed if such failures continue, a penalty of 25 percent of the amount of tax not timely paid as a result of each such subsequent failure is added to the tax. The penalty can be abated under the abatement authority in section 270C.34.\nA distributor who engages in, or whose representative engages in, the offering for sale, sale, transport, delivery, or furnishing of gambling equipment to a person, firm, or organization, after the distributor's license or permit has been revoked or suspended, or has expired, and until such license or permit has been reinstated or renewed, is liable for a penalty of $1,000 for each day the distributor continues to engage in the activity. This subdivision does not apply to the transport of gambling equipment for the purpose of returning the equipment to a licensed manufacturer.\nThe penalties imposed by this section must be collected and paid in the same manner as taxes.\nThe civil penalties imposed by this section are in addition to the criminal penalties imposed by this chapter.\n[Repealed, 2005 c 151 art 1 s 117; art 8 s 20]",
	"repealed": false
}