{
	"id": "145.883",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.883",
	"title": "145.883 DEFINITIONS.",
	"text": "For purposes of sections 145.882 and 145.883, the terms defined in this section shall have the meanings given them.\n\"Commissioner\" means the commissioner of health.\n\"Qualified program\" means a program with professional maternal and child health care staff which is established for the purpose of providing one or more essential services in maternal and child health care to target populations of low income and high risk persons. Nothing in this subdivision shall imply that every person served must take a means test.\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n\"Low income\" means an individual or family income determined to be at or below 175 percent of the official poverty line established by the Office of Management and Budget and revised annually in accordance with United States Code, title 42, section 9902, as amended. With respect to an individual who is a high risk person, \"low income\" means that the income of the high risk person or the person's family is determined to be at or below 200 percent of the official poverty line established by the Office of Management and Budget and revised annually in accordance with United States Code, title 42, section 9902, as amended, or determined to meet the income eligibility requirements of medical assistance, MinnesotaCare, or the special supplemental food program for women, infants and children (WIC). The commissioner shall establish the low income level for eligibility for services to children with disabilities.\n\"High risk person\" means a mother or child with a condition which significantly increases the probability of disease, injury, death, or other adverse health-related problem. Determination that a condition results in high risk shall be based on well-validated, scientific studies.\n[Repealed, 1Sp2003 c 14 art 8 s 32]\n\"Maternal and child health block grant money\" means the money received by the state from the federal maternal and child health block grant. The commissioner shall carry forward from state fiscal year 1985, and succeeding years, only sufficient money for qualified programs approved through the federal award period.\n\"Community health board\" means a community health board established, operating, and eligible for a local public health grant under sections 145A.11 to 145A.131.",
	"repealed": false
}