{
	"id": "270.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.41",
	"title": "270.41 BOARD OF ASSESSORS.",
	"text": "A Board of Assessors is created. The board shall review, supervise, coordinate, and approve courses in assessment practices, and establish criteria for determining assessor's qualifications. The board shall also consider other matters relating to assessment administration brought before it by the commissioner of revenue. The board may grant, renew, suspend, or revoke an assessor's license.\nFor purposes of sections 270.41 to 270.50, \"board\" means the Board of Assessors.\nThe board shall consist of nine members, who shall be appointed by the commissioner of revenue, in the manner provided herein. The members shall include:\n(1) two from the Department of Revenue;\n(2) two county assessors;\n(3) two assessors who are not county assessors, one of whom shall be a township assessor;\n(4) one from the private appraisal field holding a professional appraisal designation; and\n(5) two public members as defined by section 214.02.\nThe appointment provided in clauses (2) and (3) may be made from a list of not less than three names submitted to the commissioner of revenue by the Minnesota Association of Assessing Officers or its successor organization containing recommendations for the appointment of appointees described in clauses (2) and (3). The list must be submitted 30 days before the commencement of the term. In the case of a vacancy, a new list shall be furnished to the commissioner immediately. A member of the board who is no longer engaged in the capacity that was the basis of appointment is disqualified from membership in the board.\nThe board shall annually elect a chair and a vice-chair of the board.\n(a) The board may (i) refuse to grant or renew, or may suspend or revoke, a license of an applicant or licensee, or (ii) censure, warn, or fine any licensed assessor, or any other person employed by an assessment jurisdiction or contracting with an assessment jurisdiction for the purpose of valuing or classifying property for property tax purposes, for any of the following causes or acts:\n(1) failure to complete required training;\n(2) inefficiency or neglect of duty;\n(3) failure to comply with the Code of Conduct and Ethics for Licensed Minnesota Assessors adopted by the board pursuant to Laws 2005, First Special Session chapter 3, article 1, section 38;\n(4) conviction of a crime involving moral turpitude;\n(5) failure to faithfully and fully perform his or her duties through malfeasance, misfeasance, or nonfeasance; or\n(6) any other cause or act that in the board's opinion warrants a refusal to issue a license or the imposition of a sanction provided under this subdivision.\n(b) When appropriate for the level of infraction, a written warning must be given to assessors who have no prior identified infractions. The warning must identify the infraction and, as appropriate, detail future expectations of performance and behavior. Fines must not exceed $1,000 for the first occurrence and must not exceed $3,000 for each occurrence thereafter, and suspensions must not exceed one year for each occurrence, depending in each case upon the severity of the infraction and the level of negligence or intent. An action by the board to impose a sanction is subject to review in a contested case hearing under chapter 14.\nWhen issuing the report required under section 214.07, the board must include the number and types of disciplinary actions recommended by the commissioner of revenue under section 273.0645, subdivision 2, and the disposition of those recommendations by the board. The report must be presented to the house of representatives and senate committees with jurisdiction over property taxes in addition to the recipients required under section 214.07.\nMS 2006 [Repealed, 2008 c 154 art 13 s 50]\nA licensed assessor or other person employed by an assessment jurisdiction or contracting with an assessment jurisdiction for the purpose of valuing or classifying property for property tax purposes is prohibited from making appraisals or analyses, accepting an appraisal assignment, or preparing an appraisal report as defined in section 82B.021, subdivisions 2, 4, 6, and 7, on any property within the assessment jurisdiction where the individual is employed or performing the duties of the assessor under contract. Violation of this prohibition shall result in immediate revocation of the individual's license to assess property for property tax purposes. This prohibition must not be construed to prohibit an individual from carrying out any duties required for the proper assessment of property for property tax purposes or performing duties enumerated in section 273.061, subdivision 7 or 8. If a formal resolution has been adopted by the governing body of a governmental unit, which specifies the purposes for which such work will be done, this prohibition does not apply to appraisal activities undertaken on behalf of and at the request of the governmental unit that has employed or contracted with the individual. The resolution may only allow appraisal activities which are related to condemnations, right-of-way acquisitions, land exchanges, or special assessments.",
	"repealed": false
}