{
	"id": "15.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.72",
	"title": "15.72 PROGRESS PAYMENTS ON PUBLIC CONTRACTS; RETAINAGE.",
	"text": "Unless the terms of the contract provide otherwise, a public contracting agency shall make progress payments on a public contract for a public improvement monthly as the work progresses. Payments shall be based upon estimates of work completed as approved by the public contracting agency. A progress payment shall not be considered acceptance or approval of any work or waiver of any defects therein.\n(a) A public contracting agency may reserve as retainage from any progress payment on a public contract for a public improvement an amount not to exceed five percent of the payment. A public contracting agency may reduce the amount of the retainage and may eliminate retainage on any monthly contract payment if, in the agency's opinion, the work is progressing satisfactorily.\n(b) The public contracting agency must release all retainage no later than 60 days after substantial completion, subject to the terms of this subdivision. If the public contracting agency reduces the amount of retainage, the contractor must reduce retainage for any subcontractors at the same rate.\n(c) A contractor on a public contract for a public improvement must pay all remaining retainage to its subcontractors no later than ten days after receiving payment of retainage from the public contracting agency, unless there is a dispute about the work under a subcontract. If there is a dispute about the work under a subcontract, the contractor must pay out retainage to any subcontractor whose work is not involved in the dispute, and must provide a written statement detailing the amount and reason for the withholding to the affected subcontractor.\n(d) Upon written request of a subcontractor, the public contracting agency shall notify the subcontractor of a progress payment, retainage payment, or final payment made to the contractor.\n(e) After substantial completion, a public contracting agency may withhold no more than:\n(1) 250 percent of the cost to correct or complete work known at the time of substantial completion; and\n(2) one percent of the value of the contract or $500, whichever is greater, pending completion and submission of all final paperwork by the contractor or subcontractor. For purposes of this subdivision, \"final paperwork\" means documents required to fulfill contractual obligations, including, but not limited to, operation manuals, payroll documents for projects subject to prevailing wage requirements, and the withholding exemption certificate required by section 270C.66.\nIf the public contracting agency withholds payment under this paragraph, the public contracting agency must promptly provide a written statement detailing the amount and basis of withholding to the contractor. The public contracting agency and contractor must provide a copy of this statement to any subcontractor that requests it. Any amounts withheld under clause (1) must be paid within 60 days after completion of the work. Any amounts withheld under clause (2) must be paid within 60 days after submission of all final paperwork.\n(f) As used in this subdivision, \"substantial completion\" shall be determined as provided in section 541.051, subdivision 1, paragraph (a). For construction, reconstruction, or improvement of streets and highways, including bridges, substantial completion means the date when construction-related traffic devices and ongoing inspections are no longer required.\n(g) Withholding retainage for warranty work is prohibited. This provision does not waive any rights for warranty claims.\n(h) For a project funded with federal or state aid, the public contracting agency is not required to pay that portion of the contract funded by federal or state aid until the federal or state aid payments have been received.\n(i) Nothing in this section requires payment for a portion of a contract that is not complete or for which an invoice has not been submitted.\n(a) An indemnification agreement contained in, or executed in connection with, a contract for a public improvement is unenforceable except to the extent that:\n(1) the underlying injury or damage is attributable to the negligent or otherwise wrongful act or omission, including breach of a specific contractual duty, of the promisor or the promisor's independent contractors, agents, employees, or delegatees; or\n(2) an owner, a responsible party, or a governmental entity agrees to indemnify a contractor directly or through another contractor with respect to strict liability under environmental laws.\n(b) A provision in a public building or construction contract that requires a party to provide insurance coverage to one or more other parties, including third parties, for the negligence or intentional acts or omissions of any of those other parties, including third parties, is against public policy and is void and unenforceable.\n(c) Paragraph (b) does not affect the validity of a provision that requires a party to provide or obtain workers' compensation insurance, construction performance or payment bonds, builder's risk policies, owner or contractor-controlled insurance programs or policies, or project-specific insurance for claims arising out of the promisor's negligent acts or omissions or the negligent acts or omissions of the promisor's independent contractors, agents, employees, or delegatees.\n(d) Paragraph (b) does not affect the validity of a provision that requires the promisor to provide or obtain insurance coverage for the promisee's vicarious liability, or liability imposed by warranty, arising out of the acts or omissions of the promisor.\n(e) Paragraph (b) does not apply to building and construction contracts for work within 50 feet of public or private railroads, or railroads regulated by the Federal Railroad Administration.",
	"repealed": false
}