{
	"id": "340A.307",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.307",
	"title": "340A.307 UNLAWFUL DISCRIMINATION.",
	"text": "All licensed importers and manufacturers must offer for sale on an equal basis to all licensed wholesalers and manufacturers all intoxicating liquor brought into or produced in the state of Minnesota.\nWithout limiting subdivision 1, the following are failures to offer intoxicating liquor for sale on an equal basis and are unlawful:\n(1) A refusal to sell to a wholesaler or manufacturer intoxicating liquor offered for sale to any other wholesaler or manufacturer, except when a wholesaler or manufacturer is in arrears on payments for past purchases from the importer or manufacturer who refuses to sell.\n(2) A sale of intoxicating liquor to a wholesaler or manufacturer at a price different from that offered to another wholesaler or manufacturer, exclusive of shipping costs, except that quantity discounts based on actual cost savings may be uniformly offered to all wholesalers and manufacturers.\n(3) A sale of intoxicating liquor to a wholesaler or manufacturer on terms of purchase different from those offered another wholesaler or manufacturer, except that when the importer or manufacturer reasonably believes that a wholesaler or manufacturer will be unable to comply with the existing terms of credit, other terms may be employed, including denial of credit.\n(4) Discrimination among wholesalers and manufacturers in satisfying their respective demands for intoxicating liquor.\n(5) A sale conditioned on an agreement which restricts the wholesaler or manufacturer with respect to customers, area for distribution, or resale price, or which otherwise restrains the wholesaler or manufacturer from competing in trade and commerce.\n(6) For purposes of this subdivision and subdivision 1 only, the term \"intoxicating liquor\" does not include \"pop wines\" as they are defined by rule of the commissioner.\nMS 1986 [Repealed, 1987 c 310 s 14]\nNothing in this section applies to wine or malt liquor of any alcohol content.",
	"repealed": false
}