{
	"id": "161.114",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.114",
	"title": "161.114 CONSTITUTIONAL TRUNK HIGHWAYS.",
	"text": "The trunk highway routes, numbered 1 through 70, as described in the constitutional amendment adopted November 2, 1920, are designated as the constitutional routes of the trunk highway system.\nThe constitutional routes are described as follows:\nRoute No. 1. Beginning at a point on the boundary line between the states of Minnesota and Iowa, southeasterly at Albert Lea and thence extending in a northwesterly direction to a point in Albert Lea and thence extending in a northerly direction to a point and on the southerly limits of the city of St. Paul and then beginning at a point on the northerly limits of the city of St. Paul and thence extending in a northerly direction to a point on the westerly limits of the city of Duluth and then beginning at a point on the northerly limits of the city of Duluth and thence extending in a northeasterly direction to a point on the boundary line between the state of Minnesota and the province of Ontario, affording Albert Lea, Owatonna, Faribault, Northfield, Farmington, St. Paul, White Bear, Forest Lake, Wyoming, Rush City, Pine City, Hinckley, Sandstone, Moose Lake, Carlton, Duluth, Two Harbors, Grand Marais and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 2. Beginning at a point on Route No. 1 on the westerly limits of the city of Duluth and thence extending in a southwesterly direction along said Route No. 1 to a point on said route at Carlton and thence extending in a westerly direction to a point on the east bank of the Red River of the North at Moorhead, affording Duluth, Carlton, McGregor, Aitkin, Brainerd, Motley, Staples, Wadena, Detroit, Moorhead and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 3. Beginning at a point on the boundary line between the states of Minnesota and Wisconsin, westerly of La Crosse, Wisconsin, and thence extending in a northwesterly direction to a point on the easterly limits of the city of St. Paul and then beginning at a point on the westerly limits of the city of Minneapolis and thence extending in a northwesterly direction to a point on the east bank of the Red River of the North at Breckenridge, affording La Crescent, Winona, Kellogg, Wabasha, Lake City, Red Wing, Hastings, St. Paul, Minneapolis, Osseo, Champlin, Anoka, Elk River, Big Lake, St. Cloud, Albany, Sauk Centre, Alexandria, Elbow Lake, Fergus Falls, Breckenridge and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 4. Beginning at a point on the boundary line between the states of Minnesota and Iowa, southwesterly of Jackson and thence extending in a northerly direction to a point on Route No. 3, southeasterly of Sauk Centre and thence extending in a northwesterly direction along said Route No. 3 to a point on said route at Sauk Centre and thence extending in a northerly direction to a point at International Falls, affording Jackson, Windom, Sanborn, Redwood Falls, Morton, Olivia, Willmar, Paynesville, Sauk Centre, Long Prairie, Wadena, Park Rapids, Itasca State Park, Bemidji, International Falls and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 5. Beginning at a point on the boundary line between the states of Minnesota and Iowa, southerly of Blue Earth and thence extending in a northeasterly direction to a point on the southerly limits of the city of Minneapolis and then beginning at a point on the northerly limits of the city of Minneapolis and thence extending in a northerly direction to a point in Swan River on Route No. 8, hereinafter described, affording Blue Earth, Winnebago, Mankato, St. Peter, Le Sueur, Jordan, Shakopee, Minneapolis, Cambridge, Mora, McGregor, Swan River and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 6. Beginning at a point on the boundary line between the states of Minnesota and Iowa, southerly of Ash Creek, and thence extending in a northerly direction to a point on the boundary line between the state of Minnesota and the province of Manitoba, near St. Vincent, affording Luverne, Pipestone, Lake Benton, Ivanhoe, Canby, Madison, Bellingham, Odessa, Ortonville, Graceville, Dumont, Wheaton, Breckenridge, Moorhead, Kragnes, Georgetown, Perley, Hendrum, Ada, Crookston, Warren, Donaldson, Hallock and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 7. Beginning at a point on Route No. 3 at Winona and thence extending in a westerly direction to a point on the boundary line between the states of Minnesota and South Dakota, westerly of Lake Benton, affording Winona, St. Charles, Rochester, Kasson, Dodge Center, Claremont, Owatonna, Waseca, Mankato, St. Peter, New Ulm, Springfield, Tracy, Lake Benton and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 8. Beginning at a point on the westerly limits of the city of Duluth and thence extending in a northwesterly direction to a point on Route No. 6 near Crookston and thence extending in a westerly and northerly direction along said Route No. 6 to a point on said route northerly of Crookston and thence extending in a northwesterly direction to a point on the east bank of the Red River of the North at East Grand Forks, affording Duluth, Floodwood, Swan River, Grand Rapids, Cass Lake, Bemidji, Bagley, Erskine, Crookston, East Grand Forks and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 9. Beginning at a point on Route No. 3 at La Crescent and thence extending in a westerly direction to a point on the boundary line between the states of Minnesota and South Dakota southwesterly of Beaver Creek, affording La Crescent, Hokah, Houston, Rushford, Lanesboro, Preston, Fountain, Spring Valley, Austin, Albert Lea, Blue Earth, Fairmont, Jackson, Worthington, Luverne and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 10. Beginning at a point on the westerly limits of the city of Minneapolis and thence extending in a northwesterly direction to a point on Route No. 6 at or near Wheaton, affording Minneapolis, Montrose, Cokato, Litchfield, Willmar, Benson, Morris, Herman, Wheaton and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 11. Beginning at a point on Route No. 8 at the westerly limits of the city of Duluth and thence extending in a northwesterly and northerly direction to a point on Route No. 4 at International Falls and thence extending in a southwesterly direction along said Route No. 4 to a point on said route southwesterly of International Falls and thence extending in a westerly direction to a point on Route No. 6 at Donaldson, affording Duluth, Eveleth, Virginia, Cook, Orr, Cussons, International Falls, Baudette, Warroad, Roseau, Greenbush, Donaldson and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 12. Beginning at a point on the west bank of the St. Croix River near Hudson, Wisconsin and thence extending in a westerly direction to a point on the easterly limits of the city of St. Paul and then beginning at a point on the westerly limits of the city of Minneapolis and thence extending in a westerly direction to a point on Route No. 6 at Madison, affording St. Paul, Minneapolis, Hopkins, Norwood, Glencoe, Olivia, Granite Falls, Montevideo, Dawson, Madison and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 13. Beginning at a point on Route No. 9 at Albert Lea and thence extending in a northerly direction to a point on Route No. 5 at Jordan affording Albert Lea, Waseca, Waterville, Montgomery, New Prague, Jordan and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 14. Beginning at a point on Route No. 6 at Ivanhoe and thence extending in an easterly direction to a point on Route No. 4 at Redwood Falls and thence extending in an easterly direction along said Route No. 4 to a point on said route at Morton and thence extending in an easterly direction to a point on Route No. 22, hereinafter described, at Gaylord affording Ivanhoe, Marshall, Redwood Falls, Morton, Winthrop, Gaylord and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 15. Beginning at a point on the boundary line between the states of Minnesota and Iowa southerly of Fairmont and thence extending in a northerly direction to a point on Route No. 14 at Winthrop, affording Fairmont, Madelia, New Ulm, Winthrop and intervening and adjacent communities a reasonable means of communication each with the other and other places within the state.\nRoute No. 16. Beginning at a point on Route No. 5 southwesterly of Mankato and thence extending westerly to a point on Route No. 15 at Madelia and thence extending in a southerly direction along said Route No. 15 to a point on said route southerly of Madelia and thence extending in a westerly direction to a point on Route No. 4 northerly of Windom and thence extending in a southerly direction along said Route No. 4 to a point on said route at Windom and thence extending in a westerly direction to a point at Fulda and thence extending in a southerly direction to a point on Route No. 9 at Worthington, affording Mankato, Madelia, St. James, Windom, Fulda, Worthington and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 17. Beginning at a point on Route No. 16 at Fulda and thence extending in a northerly direction to a point on Route No. 12 at Granite Falls, affording Fulda, Slayton, Garvin, Marshall, Granite Falls and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 18. Beginning at a point on Route No. 3 at Elk River and thence extending in a northerly direction to a point on Route No. 2 easterly of Brainerd, affording Elk River, Princeton, Milaca, Onamia and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 19. Beginning at a point on Route No. 2 at Brainerd and thence extending in a northwesterly direction to a point on Route No. 8 at Cass Lake, affording Brainerd, Pine River, Walker, Cass Lake and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 20. Beginning at a point on the boundary line between the states of Minnesota and Iowa near Canton and thence extending in a northwesterly direction to a point on Route No. 9 at or near Preston and thence extending in a northwesterly direction along said Route No. 9 to a point on said route at Fountain and thence extending in a northwesterly direction to a point on Route No. 3 in the town of Douglas, Dakota County (T. 113, R. 17 W.) affording Canton, Harmony, Preston, Fountain, Chatfield, Oronoco, Pine Island, Zumbrota, Cannon Falls and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 21. Beginning at a point on Route No. 20 at Zumbrota and thence extending in a westerly direction to a point on Route No. 5 at St. Peter, affording Zumbrota, Kenyon, Faribault, Le Sueur Center, Cleveland, St. Peter and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 22. Beginning at a point on Route No. 5 at St. Peter and thence extending in a northwesterly direction to a point on Route No. 4 at Paynesville, affording St. Peter, Gaylord, Glencoe, Hutchinson, Litchfield, Paynesville and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 23. Beginning at a point on Route No. 4 at Paynesville and thence extending in a northeasterly direction through the village of Richmond, Coldspring, Rockville and Waite Park to a point on Route No. 3 westerly of St. Cloud, and thence extending in a northeasterly direction to a point on Route No. 5 southerly of Mora, and thence extending in a northerly direction along said Route No. 5 to a point on said route at Mora, and thence extending in an easterly direction to a point on Route No. 1 southerly of Hinckley, affording Paynesville, St. Cloud, Foley, Milaca, Ogilvie, Mora and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 24. Beginning at a point on Route No. 10 at Litchfield and thence extending in a northeasterly direction to a point on Route No. 3 at St. Cloud, affording Litchfield, St. Cloud and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 25. Beginning at a point on Route No. 5 at or near Belle Plaine and thence extending in a northerly direction to a point on Route No. 3 at Big Lake, affording Belle Plaine, Norwood, Watertown, Montrose, Buffalo, Monticello, Big Lake and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 26. Beginning at a point on Route No. 10 at Benson and thence extending in a westerly direction to a point on Route No. 6 near Ortonville, affording Benson, Ortonville and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 27. Beginning at a point on Route No. 3 at St. Cloud and thence extending in a northerly direction to a point on Route No. 2 at Brainerd, affording St. Cloud, Sauk Rapids, Royalton, Little Falls, Brainerd and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 28. Beginning at a point on Route No. 27 at Little Falls and thence extending in a southwesterly direction to a point on the boundary line between the states of Minnesota and South Dakota at Browns Valley, affording Little Falls, Sauk Centre, Glenwood, Starbuck, Morris, Graceville, Browns Valley and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 29. Beginning at a point on Route No. 28 at Glenwood and thence extending in a northerly direction to a point on Route No. 2 westerly of Wadena affording Glenwood, Alexandria, Parkers Prairie, Deer Creek and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 30. Beginning at a point on Route No. 3 at Fergus Falls, and thence extending in a northerly direction to a point on Route No. 8 at Erskine, affording Fergus Falls, Pelican Rapids, Detroit, Mahnomen, Erskine and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 31. Beginning at a point on Route No. 6 at Ada, and thence extending in an easterly direction to a point on Route No. 30 near Mahnomen, affording Ada, Mahnomen and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 32. Beginning at a point on Route No. 8 easterly of Crookston and thence extending in a northerly direction to a point on Route No. 11 at Greenbush, affording Red Lake Falls, Thief River Falls, Middle River, Greenbush and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 33. Beginning at a point on Route No. 32 at Thief River Falls and thence extending in a northwesterly direction to a point on Route No. 6 at Warren, affording Thief River Falls, Warren and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 34. Beginning at a point on Route No. 2 at Detroit and thence extending in a northeasterly direction to a point on Route No. 8 westerly of Grand Rapids, affording Detroit, Park Rapids, Walker, Remer, Grand Rapids and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 35. Beginning at a point on Route No. 18 near Mille Lacs Lake and thence extending in a northerly direction to a point at Grand Rapids and thence extending in a northeasterly direction to a point at Ely, affording Aitkin, Grand Rapids, Hibbing, Chisholm, Buhl, Mountain Iron, Virginia, Gilbert, McKinley, Biwabik, Aurora, Tower, and Ely and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 36. Beginning at a point on Route No. 3 at Fergus Falls and thence extending in an easterly direction to a point on Route No. 29 easterly of Henning, affording Fergus Falls, Henning and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 37. Beginning at a point on Route No. 27 at Little Falls and thence extending in a northwesterly direction to a point on Route No. 2 at Motley, affording Little Falls, Motley and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 38. Beginning at a point on Route No. 12 at Montevideo and thence extending in a northerly direction to a point on Route No. 28 at Starbuck, affording Montevideo, Benson, Starbuck and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 39. Beginning at a point on Route No. 7 at Mankato and thence extending in a southeasterly direction to a point on Route No. 9 westerly of Albert Lea, affording Mankato, Mapleton, Minnesota Lake, Wells and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 40. Beginning at a point on the boundary line between the states of Minnesota and Iowa at Lyle and thence extending in a northwesterly direction to a point on Route No. 7 at Owatonna, affording Lyle, Austin, Blooming Prairie, Owatonna and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 41. Beginning at a point on Route No. 40 at or near Blooming Prairie and thence extending in an easterly direction to a point on Route No. 56, hereinafter described, near Hayfield, affording Blooming Prairie, Hayfield and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 42. Beginning at a point on Route No. 7 easterly of Rochester and thence extending in a northeasterly direction to a point on Route No. 3 at Kellogg, affording Rochester, Elgin, Plainview, Kellogg and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 43. Beginning at a point on Route No. 9 at Rushford and thence extending in a northeasterly direction to a point on Route No. 3 at Winona, affording Rushford, Winona and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 44. Beginning at a point on Route No. 9 at Hokah and thence extending in a southwesterly direction to a point on Route No. 20 near Canton, affording Hokah, Caledonia, Canton and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 45. Beginning at a point on the west bank of the St. Croix River at Stillwater and thence extending in a southwesterly direction to a point on the easterly limits of the city of St. Paul, affording Stillwater, Lake Elmo, St. Paul and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 46. Beginning at a point on the west bank of the St. Croix River at Taylors Falls and thence extending in a southwesterly direction to a point on Route No. 1 near Wyoming, affording Taylors Falls, Center City, Wyoming and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 47. Beginning at a point on Route No. 17 at Slayton and thence extending in a westerly direction to a point on Route No. 6 at Pipestone, affording Slayton, Pipestone and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 48. Beginning at a point on Route No. 17 westerly of Granite Falls and thence extending in a westerly direction to a point on Route No. 6 at Canby, affording Granite Falls, Clarkfield, Canby and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 49. Beginning at a point on Route No. 12 easterly of Montevideo and thence extending in a northeasterly direction to a point on Route No. 4 southerly of Willmar, affording Montevideo, Clara City, Willmar and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 50. Beginning at a point on Route No. 20 at Cannon Falls and thence extending in a northwesterly direction to a point on the southerly limits of the city of Minneapolis, affording Cannon Falls, Farmington, Minneapolis and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 51. Beginning at a point on Route No. 5 at Shakopee and thence extending in a northerly direction to a point on Route No. 12 northerly of Shakopee, affording a connection between said Route No. 5 and said Route No. 12.\nRoute No. 52. Beginning at a point on Route No. 5 south of the city of Minneapolis and thence extending in a northeasterly direction to a point on the westerly limits of the United States military reservation at Fort Snelling, affording St. Paul and adjacent communities a reasonable communication with said Route No. 5.\nRoute No. 53. Beginning at a point on Route No. 3 at Hastings and thence extending in a northwesterly direction to a point on the southerly limits of the city of South St. Paul, affording Hastings, South St. Paul and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 54. Beginning at a point on Route No. 3 at Elbow Lake and thence extending in a southwesterly direction to a point on Route No. 10 at Herman, affording Elbow Lake, Herman and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 55. Beginning at a point on Route No. 2 northwesterly of Carlton and thence extending in a northerly direction to a point in Cloquet, affording Carlton, Cloquet and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 56. Beginning at a point on Route No. 9 easterly of Austin and thence extending in a northerly direction to a point on Route No. 21 at or near Kenyon, affording Brownsdale, Hayfield, Dodge Center, West Concord, Kenyon and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 57. Beginning at a point in Mantorville and extending in a southerly direction to a point on Route No. 7 southerly of Mantorville, affording Mantorville a reasonable means of communication with said Route No. 7.\nRoute No. 58. Beginning at a point on Route No. 20 at Zumbrota and thence extending in a northeasterly direction to a point on Route No. 3 at Red Wing, affording Zumbrota, Red Wing and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 59. Beginning at a point on the boundary line between the states of Minnesota and Iowa southerly of Spring Valley and thence extending in a northerly direction to a point on No. 3 at Lake City, affording Spring Valley, Stewartville, Rochester, Zumbrota Falls, Lake City and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 60. Beginning at a point on Route No. 1 at Faribault and thence extending in a southwesterly direction to a point on Route No. 7 at or near Madison Lake, affording Faribault, Morristown, Waterville, Madison Lake and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 61. Beginning at a point on Route No. 8 at Deer River and thence extending in a northerly direction to a point on Route No. 4 at or near Big Falls, affording Deer River, Big Falls and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 62. Beginning at a point on Route No. 3 at Anoka and thence extending in a southeasterly direction to a point on the northerly limits of the city of St. Paul, affording Anoka, St. Paul and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 63. Beginning at a point on Route No. 1 southerly of Forest Lake and thence extending in a southwesterly direction to a point on the northerly and easterly limits of the city of Minneapolis, affording a reasonable means of communication between Route No. 1 and Minneapolis.\nRoute No. 64. Beginning at a point on Route No. 30 northerly of Fergus Falls and thence extending in a northerly and westerly direction to a point on Route No. 6 southerly of Moorhead, affording Fergus Falls, Rothsay, Barnesville, Moorhead and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 65. Beginning at a point on Route No. 8 at Bagley, and thence extending in a northerly and westerly direction to a point on Route No. 32 southerly of Red Lake Falls, affording Bagley, Clearbrook, Gonvick, Gully, Brooks, Terrebonne and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 66. Beginning at a point on Route No. 12 at Montevideo and thence extending in a northwesterly direction to a point on Route No. 26 northerly of Appleton affording Montevideo, Appleton and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 67. Beginning at a point on Route No. 14 southerly of Echo and thence extending in a northerly and westerly direction to a point on Route No. 17 at or near Granite Falls, affording Echo, Granite Falls and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 68. Beginning at a point on Route No. 14 at Marshall and thence extending in a northwesterly direction to a point on Route No. 6 near Canby, affording Marshall, Minneota, Canby and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 69. Beginning at a point on Route No. 25 at Buffalo and thence extending in a northwesterly direction to a point on Route No. 22 southeasterly of Paynesville, affording Buffalo, Maple Lake, Annandale, Eden Valley, Paynesville and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.\nRoute No. 70. Beginning at a point on Route No. 7 westerly of New Ulm and thence extending in a northerly direction to a point on Route No. 12 at or near the village of Hector, affording Fort Ridgely, Fairfax, Hector and intervening and adjacent communities a reasonable means of communication, each with the other and other places within the state.",
	"repealed": false
}