{
	"id": "270C.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.70",
	"title": "270C.70 PERSONAL LIABILITY FOR FAILURE TO HONOR A LEVY.",
	"text": "A person who fails or refuses to surrender property or rights to property subject to a levy served on the person under section 270C.67, 270C.68, or 270C.69 is liable in an amount equal to the value of the property or rights not surrendered, or the amount of taxes, penalties, and interest for the collection of which the levy was made, whichever is less. A financial institution need not surrender funds on deposit until ten days after service of the levy.\nIn addition to the personal liability imposed by subdivision 1, if a person required to surrender property or rights to property fails to do so without reasonable cause, the person is liable for a penalty equal to 25 percent of the amount under subdivision 1.\nThe term \"person\" as used in this section includes an officer or employee of a corporation, or a member or employee of a partnership, who as such officer, employee, or member is under a duty to surrender the property or rights to property or to respond to the levy.\nThe liability imposed by this section may, after demand to honor a levy has been made, be assessed by the commissioner within 60 days after service of the demand. The assessment may be based on information available to the commissioner. The assessment is presumed to be valid, and the burden is on the person assessed to show it is incorrect or invalid. An order assessing liability for failure to honor a levy is reviewable administratively under section 270C.35, and is appealable to Tax Court under chapter 271. The amount assessed, plus interest at the rate specified in section 270C.40, may be collected by any remedy available to the commissioner for the collection of taxes. The proceeds collected are applied first to the liability of the original taxpayer to the extent of the liability under subdivision 1 plus interest, and then to the penalty under subdivision 2.",
	"repealed": false
}