{
	"id": "514.673",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.673",
	"title": "514.673 ENVIRONMENTAL LIEN NOTICE.",
	"text": "An environmental lien notice must state:\n(1) the name of the record owner of the real property where the environmental lien attached;\n(2) the legal description of the real property where the environmental lien attached;\n(3) a statement that the real property described in the notice is subject to or affected by a cleanup action for which cleanup action expenses have been incurred;\n(4) a statement that the owner is potentially liable for cleanup action expenses under section 115B.04 or 115C.04; and\n(5) a statement that an environmental lien has attached to the described real property.\nAny notice, release, or other document required to be filed under sections 514.671 to 514.676 must be filed in the office of the county recorder or the registrar of titles of the county where the real property is located. An attestation, certification, or acknowledgment is not required as a condition of filing. The filing or mailing of any notice, release, or other document under sections 514.671 to 514.676 is the responsibility of the commissioner or the commissioner's designee. A copy of an environmental lien notice must also be sent to each record owner and mortgagee of the real property by registered or certified mail.\n(a) The commissioner may not file an environmental lien notice until the agency board for cleanup action expenses incurred under chapter 115B, or the Petroleum Tank Release Compensation Board for cleanup action expenses incurred under chapter 115C, the person referred to in section 514.672, subdivision 1, and each record owner and mortgagee of the real property have been notified in writing of the commissioner's intention to file the lien notice and the requirements for filing the lien under paragraph (b) have been met.\n(b) By 30 days after receiving notification from the commissioner under paragraph (a), the agency board or Petroleum Tank Release Compensation Board, after notice and opportunity for the person referred to in section 514.672, subdivision 1, to appear before the appropriate board, shall approve or disapprove of the filing of the lien by the commissioner. If the appropriate board disapproves of the filing, the lien may not be filed. If the appropriate board approves of the filing or takes no action on the matter within the 30-day period, the commissioner may file the lien notice.",
	"repealed": false
}