{
	"id": "18G.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/18G.14",
	"title": "18G.14 MOSQUITO ABATEMENT.",
	"text": "The abatement or suppression of mosquitoes is advisable and necessary for the maintenance and improvement of the health, welfare, and prosperity of the people. Areas where mosquitoes incubate or hatch are declared to be public nuisances and may be abated under this section. Mosquito abatement may be undertaken under this section anywhere in the state by any governmental unit.\nA governmental unit may engage in mosquito abatement and establish a mosquito abatement board upon adoption of a resolution to that effect by its governing body or upon adoption of a proposal to that effect by the voters of the governmental unit in the manner provided in subdivision 3.\nIf a petition signed by five percent of the property owners or 250 owners, whichever is less, is presented to a governing body requesting the governmental unit to engage in mosquito abatement, a public hearing must be held on the petition by the governing body within 15 days of presentation of the petition. If the governing body does not, within 15 days after the hearing, adopt a resolution to undertake mosquito abatement, the governing body must order a vote to be taken at the next regular election or town meeting on the proposal to undertake mosquito abatement. The governing body must provide ballots to be used at the election or meeting. The ballot must bear the words \"Shall the (governmental unit) of ....... engage in mosquito abatement?\" If the majority of the votes are affirmative, the governing body must take appropriate action as soon as possible to carry on mosquito abatement. A proposal to undertake mosquito abatement that is rejected by the voters must not be resubmitted to the voters for two years.\nIf a governmental unit by action of its governing body or voters has chosen to engage in mosquito abatement, the abatement program may be discontinued in the following manner:\n(1) if the mosquito abatement was originally undertaken by resolution of the governing body, then by the adoption of a resolution to that effect by the governing body, or by the adoption of a proposal to that effect by the voters of the governmental unit in the manner provided in this subdivision; and\n(2) if the mosquito abatement was originally undertaken by the adoption of a proposal to that effect by the voters of the governmental unit, then only by the adoption of a proposal to that effect by the voters of the governmental unit in the manner provided in subdivision 5.\nIf a petition signed by five percent of the property owners or 250 owners, whichever is less, is presented to the governing body engaged in mosquito abatement requesting it to discontinue mosquito abatement, a public hearing must be held on the petition by the governing body within 15 days after presentation of the petition. If the governing body does not, within 15 days after the hearing, adopt a resolution to discontinue mosquito abatement, the governing body must order a vote to be taken at the next regular election or town meeting on the proposal to discontinue mosquito abatement. The governing body shall provide ballots to be used at the election or meeting. The ballot must bear the words \"Shall the (governmental unit) of ....... discontinue mosquito abatement?\" If a majority of the votes are affirmative, the governing body must take appropriate action as soon as possible to discontinue mosquito abatement. A proposal to discontinue mosquito abatement that is rejected by the voters must not be resubmitted to the voters for two years.\nA governing body that has decided, in the manner required by this section, to engage in mosquito abatement, shall appoint three persons to serve as members of a mosquito abatement board with powers specified in subdivision 8. Each member of the board holds office at the pleasure of the governing body and serves without compensation, except that board members may be reimbursed for actual expenses incurred in fulfilling board duties.\nImmediately after appointment of the board and at the first meeting in each succeeding calendar year, the board shall elect a chair, a secretary, a treasurer, and other necessary officers. The board shall provide for the time and place of holding regular meetings and may establish rules for proceedings. All meetings of the board are open to the public. Two members of the board constitute a quorum, but one member may adjourn from day to day. The board shall keep a written record of its proceedings and an itemized account of all expenditures and disbursements and that record and account must be open at all reasonable times for public inspection.\nA mosquito abatement board and a joint board established under this section may, either by board action or through its members, officers, agents, or employees, as may be appropriate:\n(1) enter any property within the governmental unit at reasonable times to determine whether mosquito breeding exists;\n(2) take necessary and proper steps for the abatement of mosquitoes and other insects and arachnids, such as ticks, mites, and spiders, as the commissioner may designate;\n(3) subject to the paramount control of county and state authorities, lagoon and clean up any stagnant pool of water and clean up shores of lakes and streams and other mosquito breeding places;\n(4) spray with insecticides, approved by the commissioner, areas in the governmental unit found to be breeding places for mosquitoes or other insects or arachnids designated under clause (2);\n(5) purchase supplies and equipment and employ persons necessary and proper for mosquito abatement;\n(6) accept gifts of money or equipment to be used for mosquito abatement; and\n(7) enter into contracts necessary to accomplish mosquito abatement.\nEach mosquito abatement board and each governmental unit engaged in mosquito abatement shall cooperate with the University of Minnesota, the commissioners of agriculture, health, natural resources, and transportation, and the agricultural experiment station.\nAn annual tax may be levied for mosquito abatement purposes on all taxable property in any governmental unit undertaking mosquito abatement under this section. The tax must be certified, levied, and collected in the same manner as other taxes levied by the governmental unit.\nAt any time after the annual tax levy has been certified to the county auditor, and not earlier than October 10 in any year, any governing body may, for the purpose of providing the necessary funds for mosquito abatement for the succeeding year, by resolution, issue and sell as many certificates of indebtedness as may be needed in anticipation of the collection of taxes levied under subdivision 10. Certificates must not be issued in excess of 50 percent of the amount of the tax levy, as spread by the county auditor, to be collected for mosquito abatement. No certificate may be issued to become due and payable later than December 31 of the year succeeding the year in which the tax levy was made. The certificates must not be sold for less than par and accrued interest, and must not bear a greater rate of interest than five percent per annum. Each certificate must state upon its face that the proceeds of the certificate must be used for the mosquito abatement fund, the total amount of the certificates issued, and the amount embraced in the tax levy for that particular purpose. The certificates must be numbered consecutively and be in denominations of $100 or multiples of $100, may have interest coupons attached, and must be otherwise of a form, on terms, and made payable at a place that will best aid in their negotiation. The proceeds of the tax assessed and collected on account of the mosquito abatement fund must be irrevocably pledged for the redemption of the certificates issued. The certificates must be paid solely from the money derived from the levy for the year against which the certificates were issued, or, if they are not sufficient for that purpose, from the levy for the mosquito abatement fund in the next succeeding year. The money derived from the sale of the certificates must be credited to the mosquito abatement fund for the calendar year immediately succeeding the levy and may not be used or spent until the succeeding year. No certificates for any year may be issued until all certificates for prior years have been paid. No certificates may be extended.\nAll money received for mosquito abatement purposes, either by way of tax collection or the sale of certificates of indebtedness, must be deposited in the treasury of the governmental unit to the credit of a special fund to be designated as the mosquito abatement fund, must not be used for any other purpose, and must be drawn upon by the proper officials upon the properly authenticated voucher of the mosquito abatement board. No money may be paid from the fund except on orders drawn upon the officer of the governmental unit having charge of the custody of the mosquito abatement fund and signed by the chair and the secretary of the mosquito abatement board. Each mosquito abatement board shall annually file an itemized statement of all receipts and disbursements with its governing body.\nThe commissioner:\n(1) may establish rules for the conduct of mosquito abatement operations of governmental units and boards engaged in mosquito abatement; and\n(2) is an ex officio member of a mosquito abatement board. The commissioner may appoint representatives to act for the commissioner as ex officio members of boards.\nThe commissioner of natural resources must approve mosquito abatement plans or order modifications the commissioner of natural resources considers necessary for the protection of public water, wild animals, and natural resources before control operations are started on state lands administered by the commissioner of natural resources or in public waters listed on the Department of Natural Resources public waters inventory. The commissioner of natural resources may make necessary modifications in an approved plan or revoke approval of a plan at any time upon written notice to the governing body or mosquito abatement board.\nIf two or more adjacent governmental units have authorized mosquito abatement and appointed the members of the mosquito abatement board, the governing bodies may, by written contract, arrange for pooling mosquito abatement funds, apportioning all costs, cooperating in the use of equipment and personnel, and engaging jointly in mosquito abatement upon terms and conditions and subject to mutually agreed-upon rules. The immediate control and management of the joint project may, by the terms of the written contract, be entrusted to a joint committee composed of the chair of each of the boards or other board members.\nIn any town that is unorganized politically, the county board of the county in which the town is situated has all the rights, powers, and duties conferred by this section upon the governing bodies of towns, including town boards, and the county board must act as though it were the governing body and town board of that town and may authorize and undertake mosquito abatement in the town and cause taxes to be levied for mosquito abatement the same as though the town were organized politically and the county board were the governing body and town board. The cost of mosquito abatement in such a town must be paid solely by a tax levy on the property within the town where mosquito abatement is undertaken and no part of the expense of mosquito abatement in that town may be a county expense or paid by the county.\nThe actual cost to the state of any service rendered or expense incurred by the commissioner of agriculture or natural resources under this section for the benefit of a mosquito abatement board must be reimbursed by the appropriate governmental unit.",
	"repealed": false
}