{
	"id": "297H.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/297H.13",
	"title": "297H.13 DEPOSIT OF REVENUES; USE OF PROCEEDS; REPORT ON RECEIPTS.",
	"text": "The revenues derived from the taxes imposed on waste management services under this chapter shall be deposited by the commissioner of revenue in the state treasury.\n(a) Of the amounts remitted under this chapter, 70 percent must be credited to the environmental fund established in section 16A.531, subdivision 1.\n(b) In addition to the amounts credited to the environmental fund in paragraph (a), in fiscal year 2024 and later, three percent of the amounts remitted under this chapter shall be deposited into the resource management account in the environmental fund.\n(c) The remainder must be deposited into the general fund.\n(d) Beginning in fiscal year 2024 and annually thereafter, the money deposited in the resource management account in the environmental fund under paragraph (b) is appropriated to the commissioner of the Pollution Control Agency for distribution to counties under section 115A.557, subdivision 2, paragraph (a), clauses (1) to (7) and (9) to (11).\n[Repealed, 2003 c 128 art 2 s 56]\n[Repealed, 2003 c 128 art 2 s 56]\nThe commissioner of revenue shall report to the chairs of the house of representatives and senate Environment and Natural Resources Committees; the house of representatives Environment and Natural Resources Finance Division; the senate Environment and Agriculture Budget Division; the house of representatives Tax Committee and the senate Taxes and Tax Laws Committee; and the commissioner of the Pollution Control Agency on the total tax revenues received from the taxes imposed under this chapter. The reports shall be made as follows:\n(1) a report by August 31 of each year based on amounts received by the commissioner of revenue from January 1 through June 30 of that year; and\n(2) a report by February 28 of each year based on amounts received by the commissioner of revenue from July 1 through December 31 of the preceding year.\n[Repealed, 2000 c 370 s 5]",
	"repealed": false
}