{
	"id": "270C.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.07",
	"title": "270C.07 REVENUE NOTICES.",
	"text": "The commissioner may make, adopt, and publish interpretive revenue notices. A \"revenue notice\" is a policy statement that has been published pursuant to subdivision 5 and that provides interpretation, details, or supplementary information concerning the application of state revenue laws or rules promulgated by the commissioner. Revenue notices are published for the information and guidance of taxpayers, local government officials, the department, and others concerned.\nRevenue notices do not have the force and effect of law and have no precedential effect, but may be relied on by taxpayers until revoked or modified. A notice may be expressly revoked or modified by the commissioner, by the issuance of a revenue notice, but may not be revoked or modified retroactively to the detriment of the taxpayers. A change in the law or an interpretation of the law occurring after the revenue notice is issued, whether in the form of a statute, court decision, administrative rule, or revenue notice, results in revocation or modification of the notice to the extent that the change affects the notice.\nRevenue notices are generally interpretive of existing law and therefore are retroactive to the effective date of the applicable law provision unless otherwise stated in the notice.\nThe issuance of revenue notices is at the discretion of the commissioner. The commissioner shall establish procedures governing the issuance of revenue notices and tax information bulletins. At least one week before publication of a revenue notice in the State Register, the commissioner shall provide a copy of the notice to the chairs of the Taxes Committee of the house of representatives and the Taxes and Tax Laws Committee of the senate.\nThe commissioner shall publish the revenue notices in the State Register and in any other manner that makes them accessible to the general public. The commissioner may charge a reasonable fee for publications.",
	"repealed": false
}