{
	"id": "299A.90",
	"url": "https://www.revisor.mn.gov/statutes/cite/299A.90",
	"title": "299A.90 OFFICE FOR MISSING AND MURDERED BLACK WOMEN AND GIRLS.",
	"text": "The commissioner shall establish and maintain an office dedicated to preventing and ending the targeting of Black women and girls within the Minnesota Office of Justice Programs.\n(a) The commissioner must appoint a director who is a person closely connected to the Black community and who is highly knowledgeable about criminal investigations. The commissioner is encouraged to consider candidates for appointment who are recommended by members of the Black community.\n(b) The director may select, appoint, and compensate out of available funds assistants and employees as necessary to discharge the office's responsibilities.\n(c) The director and full-time staff shall be members of the Minnesota State Retirement Association.\n(a) The office has the following duties:\n(1) advocate in the legislature for legislation that will facilitate the accomplishment of mandates identified in the report of the Task Force on Missing and Murdered African American Women;\n(2) advocate for state agencies to take actions to facilitate the accomplishment of mandates identified in the report of the Task Force on Missing and Murdered African American Women;\n(3) develop recommendations for legislative and agency actions to address injustice in the criminal justice system's response to cases of missing and murdered Black women and girls;\n(4) facilitate research to refine the mandates in the report of the Task Force on Missing and Murdered African American Women and to assess the potential efficacy, feasibility, and impact of the recommendations;\n(5) collect data on missing person and homicide cases involving Black women and girls, including the total number of cases, the rate at which the cases are solved, the length of time the cases remain open, and a comparison to similar cases involving different demographic groups;\n(6) collect data on Amber Alerts, including the total number of Amber Alerts issued, the total number of Amber Alerts that involve Black girls, and the outcome of cases involving Amber Alerts disaggregated by the child's race and sex;\n(7) collect data on reports of missing Black girls, including the number classified as voluntary runaways, and a comparison to similar cases involving different demographic groups;\n(8) analyze and assess the intersection between cases involving missing and murdered Black women and girls and labor trafficking and sex trafficking;\n(9) develop recommendations for legislative, agency, and community actions to address the intersection between cases involving missing and murdered Black women and girls and labor trafficking and sex trafficking;\n(10) analyze and assess the intersection between cases involving murdered Black women and girls and domestic violence, including prior instances of domestic violence within the family or relationship, whether an offender had prior convictions for domestic assault or related offenses, and whether the offender used a firearm in the murder or any prior instances of domestic assault;\n(11) develop recommendations for legislative, agency, and community actions to address the intersection between cases involving murdered Black women and girls and domestic violence;\n(12) develop tools and processes to evaluate the implementation and impact of the efforts of the office;\n(13) track and collect Minnesota data on missing and murdered Black women and girls, and provide statistics upon public or legislative inquiry;\n(14) facilitate technical assistance for local and Tribal law enforcement agencies during active cases involving missing and murdered Black women and girls;\n(15) conduct case reviews and report on the results of case reviews for the following types of cases involving missing and murdered Black women and girls: cold cases for missing Black women and girls and death investigation review for cases of Black women and girls ruled as suicide or overdose under suspicious circumstances;\n(16) conduct case reviews of the prosecution and sentencing for cases where a perpetrator committed a violent or exploitative crime against a Black woman or girl. These case reviews must identify those cases where the perpetrator is a repeat offender;\n(17) prepare draft legislation as necessary to allow the office access to the data necessary for the office to conduct the reviews required in this section and advocate for passage of that legislation;\n(18) review sentencing guidelines for crimes related to missing and murdered Black women and girls, recommend changes if needed, and advocate for consistent implementation of the guidelines across Minnesota courts;\n(19) develop and maintain communication with relevant divisions in the Department of Public Safety, including but not limited to the Bureau of Criminal Apprehension, regarding any cases involving missing and murdered Black women and girls and on procedures for investigating cases involving missing and murdered Black women and girls;\n(20) consult with the Council for Minnesotans of African Heritage established in section 15.0145; and\n(21) coordinate, as relevant, with federal efforts, and efforts in neighboring states and Canada.\n(b) As used in this subdivision:\n(1) \"labor trafficking\" has the meaning given in section 609.281, subdivision 5; and\n(2) \"sex trafficking\" has the meaning given in section 609.321, subdivision 7a.\nIn fulfilling its duties, the office may coordinate, as useful, with stakeholder groups that were represented on the Task Force on Missing and Murdered African American Women and state agencies that are responsible for the systems that play a role in investigating, prosecuting, and adjudicating cases involving violence committed against Black women and girls; those who have a role in supporting or advocating for missing or murdered Black women and girls and the people who seek justice for them; and those who represent the interests of Black people. This includes the following entities: Minnesota Chiefs of Police Association; Minnesota Sheriffs' Association; Bureau of Criminal Apprehension; Minnesota Police and Peace Officers Association; Tribal law enforcement; Minnesota County Attorneys Association; United States Attorney's Office; juvenile courts; Minnesota Coroners' and Medical Examiners' Association; United States Coast Guard; state agencies, including the Departments of Health, Human Services, Education, Corrections, and Public Safety; service providers who offer legal services, advocacy, and other services to Black women and girls; Black women and girls who are survivors; and organizations and leadership from urban and statewide Black communities.\nThe office must report on measurable outcomes achieved to meet its statutory duties, along with specific objectives and outcome measures proposed for the following year. The report must include data and statistics on missing and murdered Black women and girls in Minnesota, including names, dates of disappearance, and dates of death, to the extent the data is publicly available. The office must submit the report by January 15 each year to the chairs and ranking minority members of the legislative committees with primary jurisdiction over public safety.\n(a) A missing and murdered Black women and girls account is established in the special revenue fund. Money in the account, including interest earned, is appropriated to the office for the purposes of carrying out the office's duties, including but not limited to issuing grants to community-based organizations.\n(b) Notwithstanding sections 16A.013 to 16A.016, the office may accept funds contributed by individuals and may apply for and receive grants from public and private entities. The funds accepted or received under this subdivision must be deposited in the missing and murdered Black women and girls account created under paragraph (a).\n(a) The office shall issue grants to community-based organizations that provide services designed to prevent or end the targeting of Black women or girls, or to provide assistance to victims of offenses that targeted Black women or girls.\n(b) Grant recipients must use money to:\n(1) provide services designed to reduce or prevent crimes or other negative behaviors that target Black women or girls;\n(2) provide training to the community about how to handle situations and crimes involving the targeting of Black women and girls, including but not limited to training for law enforcement officers, county attorneys, city attorneys, judges, and other criminal justice partners; or\n(3) provide services to Black women and girls who are victims of crimes or other offenses, or to the family members of missing and murdered Black women and girls.\n(c) Applicants must apply in a form and manner established by the office.\n(d) Grant recipients must provide an annual report to the office that includes:\n(1) the services provided by the grant recipient;\n(2) the number of individuals served in the previous year; and\n(3) any other information required by the office.\n(e) On or before February 1 of each year, the office shall report to the legislative committees and divisions with jurisdiction over public safety on the work of grant recipients, including a description of the number of entities awarded grants, the amount of those grants, and the number of individuals served by the grantees.\n(f) The office may enter into agreements with the Office of Justice Programs for the administration of grants issued under this subdivision.\nNotwithstanding section 13.384 or 13.85, the director has access to corrections and detention data and medical data maintained by an agency and classified as private data on individuals or confidential data on individuals to the extent the data is necessary for the office to perform its duties under this section.",
	"repealed": false
}