{
	"id": "103F.902",
	"url": "https://www.revisor.mn.gov/statutes/cite/103F.902",
	"title": "103F.902 LOCAL PLANNING AND APPROVAL.",
	"text": "A willing landowner may apply, on forms provided by the board, to a local unit of government for the establishment or restoration of a wetland on property owned by the landowner in an area that is:\n(1) designated by the board as a high priority wetland region; and\n(2) identified as a high priority wetland area in the local unit of government's comprehensive local water plan.\n(a) Within 30 days after receiving an application, the local unit of government shall hold a public hearing. At least ten days before the hearing, the local unit of government shall give notice of the hearing to the applicant and publish notice in an official newspaper of general circulation in the county.\n(b) At the hearing, the local unit of government shall describe the application and hear comments from interested persons regarding the application and the planned establishment or restoration project.\nWithin 30 days of the public hearing, the local unit of government must give preliminary approval or disapproval of the application.\nAfter preliminary approval, the local unit of government shall direct and pay the costs of a soil and water conservation engineer to conduct a survey of the property where the wetland restoration or establishment project is proposed to be located. The engineer must file a report, including a map of the proposed wetland, that describes the effects of the proposed wetland on:\n(1) the hydrology in the area;\n(2) property of persons other than the applicant;\n(3) groundwater recharge;\n(4) flooding;\n(5) fish and wildlife habitat;\n(6) water quality; and\n(7) other characteristics as determined by the local unit of government.\nWithin 30 days of receiving the completed survey, the local unit of government shall hold a public hearing on the proposed project. At least ten days before the hearing, the local unit of government shall notify the landowner and the commissioner and provide public notice of the hearing and the availability of the survey report in an official newspaper of general circulation in the county. The commissioner may provide comment on the proposed wetland.\nWithin 30 days of the public hearing, the local unit of government shall notify the applicant and the commissioner of the final approval or disapproval of the proposed wetland.",
	"repealed": false
}