{
	"id": "325F.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.072",
	"title": "325F.072 FIREFIGHTING FOAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Class B firefighting foam\" means foam designed to prevent or extinguish a fire in flammable liquids, combustible liquids, petroleum greases, tars, oils, oil-based paints, solvents, lacquers, alcohols, and flammable gases.\n(c) \"PFAS chemicals\" or \"perfluoroalkyl and polyfluoroalkyl substances\" means a class of fluorinated organic chemicals containing at least one fully fluorinated carbon atom.\n(d) \"Political subdivision\" means a county, city, town, or a metropolitan airports commission organized and existing under sections 473.601 to 473.679.\n(e) \"State agency\" means an agency as defined in section 16B.01, subdivision 2.\n(f) \"Testing\" means calibration testing, conformance testing, and fixed system testing.\nBeginning on July 1, 2020, any person, political subdivision, or state agency that discharges, uses, releases, or knows of a discharge, use, or release of class B firefighting foam that contains intentionally added PFAS chemicals must be reported to the Minnesota Fire Incident Reporting System within 24 hours of the discharge, use, or release. The notification must include:\n(1) the time, date, location, and estimated amount of class B firefighting foam discharged, used, or released;\n(2) the purpose or reason of the discharge, use, or release; and\n(3) the containment, treatment, and disposal measures to be taken or used to prevent or minimize the discharge or release of the foam into the environment.\n(a) No person, political subdivision, or state agency shall manufacture or knowingly sell, offer for sale, distribute for sale, or distribute for use in this state, and no person shall use in this state, class B firefighting foam containing PFAS chemicals.\n(b) This subdivision does not apply to the manufacture, sale, distribution, or use of class B firefighting foam for which the inclusion of PFAS chemicals is required by federal law, including but not limited to Code of Federal Regulations, title 14, section 139.317. If a federal requirement to include PFAS chemicals in class B firefighting foam is revoked after January 1, 2024, class B firefighting foam subject to the revoked requirements is no longer exempt under this paragraph effective one year after the day of revocation.\n(c) This subdivision does not apply to the manufacture, sale, distribution, or use of class B firefighting foam for purposes of use at an airport, as defined under section 360.013, subdivision 39, until the state fire marshal makes a determination that:\n(1) the Federal Aviation Administration has provided policy guidance on the transition to fluorine-free firefighting foam;\n(2) a fluorine-free firefighting foam product is included in the Federal Aviation Administration's Qualified Product Database; and\n(3) a firefighting foam product included in the database under clause (2) is commercially available in quantities sufficient to reliably meet the requirements under Code of Federal Regulations, title 14, part 139.\n(d) Until the state fire marshal makes a determination under paragraph (c), the operator of an airport using class B firefighting foam containing PFAS chemicals must, on or before December 31 each calendar year, submit a report to the state fire marshal regarding the status of the airport's conversion to class B firefighting foam products without intentionally added PFAS, the disposal of class B firefighting foam products with intentionally added PFAS, and an assessment of the factors listed in paragraph (c) as applied to the airport.\nA person, political subdivision, or state agency exempted from the prohibitions under subdivision 3 may not discharge class B firefighting foam that contains intentionally added PFAS chemicals for:\n(1) testing purposes, unless the testing facility has implemented appropriate containment, treatment, and disposal measures to prevent releases of foam to the environment; or\n(2) training purposes, unless otherwise required by law, and with the condition that the training event has implemented appropriate containment, treatment, and disposal measures to prevent releases of foam to the environment.\nThe commissioner of the Pollution Control Agency may enforce compliance with this section under sections 115.071 and 116.072. The commissioner must coordinate with the commissioners of commerce and health in enforcing this section.",
	"repealed": false
}