{
	"id": "484.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/484.01",
	"title": "484.01 JURISDICTION.",
	"text": "The district courts shall have original jurisdiction in the following cases:\n(1) all civil actions within their respective districts;\n(2) in all cases of crime committed or triable therein;\n(3) in all special proceedings not exclusively cognizable by some other court or tribunal;\n(4) in law and equity for the administration of estates of deceased persons and all guardianship and incompetency proceedings;\n(5) the jurisdiction of a juvenile court as provided in chapter 260;\n(6) proceedings for the management of the property of persons who have disappeared, and actions relating thereto, as provided in chapter 578; and\n(7) in all other cases wherein such jurisdiction is especially conferred upon them by law.\nThey shall also have appellate jurisdiction in every case in which an appeal thereto is allowed by law from any other court, officer, or body.\nNotwithstanding any law to the contrary, the district court has jurisdiction to review a final decision or order of a civil service commission or board upon the petition of an employee or appointing authority in any first-class city. The employee and appointing authority have standing to seek judicial review in all these cases. Review of the decision or order may be had by securing issuance of a writ of certiorari within 60 days after the date of mailing notice of the decision to the party applying for the writ. To the extent possible, the provisions of rules 110, 111, and 115 of the Rules of Civil Appellate Procedure govern the procedures to be followed. Each reference in those rules to the court of appeals, the trial court, the trial court administrator, and the notice of appeal must be read, where appropriate, as a reference to the district court, the body whose decision is to be reviewed, to the administrator, clerk, or secretary of that body, and to the writ of certiorari, respectively. This subdivision does not alter or amend the application of sections 197.455 and 197.46, relating to veterans preference.",
	"repealed": false
}