{
	"id": "8.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/8.31",
	"title": "8.31 ADDITIONAL DUTIES OF ATTORNEY GENERAL.",
	"text": "The attorney general shall investigate violations of the law of this state respecting unfair, discriminatory, and other unlawful practices in business, commerce, or trade, and specifically, but not exclusively, the Nonprofit Corporation Act (sections 317A.001 to 317A.909), the Act Against Unfair Discrimination and Competition (sections 325D.01 to 325D.07), the Unlawful Trade Practices Act (sections 325D.09 to 325D.16), the Antitrust Act (sections 325D.49 to 325D.66), section 325F.67 and other laws against false or fraudulent advertising, the antidiscrimination acts contained in section 325D.67, the act against monopolization of food products (section 325D.68), the act regulating telephone advertising services (section 325E.39), the Prevention of Consumer Fraud Act (sections 325F.68 to 325F.70), and chapter 53A regulating currency exchanges and assist in the enforcement of those laws as in this section provided.\nWhen the attorney general has information providing a reasonable ground to believe that any person has violated, or is about to violate, any of the laws of this state referred to in subdivision 1, the attorney general shall have power to investigate those violations, or suspected violations, and to take such steps as are necessary to cause the arrest and prosecution of all persons violating any of the statutes specifically mentioned in subdivision 1 or any other laws respecting unfair, discriminatory, or other unlawful practices in business, commerce, or trade. In connection with investigation under this section the attorney general upon specifying the nature of the violation or suspected violation may obtain discovery from any person regarding any matter, fact or circumstance, not privileged, which is relevant to the subject matter involved in the pending investigation, in accordance with the provisions of this subdivision. The discovery may be obtained without commencement of a civil action and without leave of court, except as expressly required by the provisions of subdivision 2a. The applicable protective provisions of rules 26.02, 26.03, and 30.04 of the Rules of Civil Procedure for the district courts shall apply to any discovery procedures instituted pursuant to this section. The attorney general or any person to whom discovery is directed may apply to and obtain leave of the district court in order to reduce or extend the time requirements of this subdivision, and upon a showing of good cause the district court shall order such a reduction or extension. In order to obtain discovery, the attorney general may:\n(a) Serve written interrogatories on any person. Within 20 days after service of interrogatories, separate written answers and objections to each interrogatory shall be mailed to the attorney general.\n(b) Upon reasonable written notice of no less than 15 days, require any person to produce for inspection and copying any documents, papers, books, accounts, letters, photographs, objects, or tangible things which are in the possession, custody, or control of that person.\n(c) Upon reasonable written notice of no less than 15 days, take the testimony of any person by deposition as to any fact or opinion relevant to the subject matter involved in the pending investigation.\nFor the purposes of this subdivision the term \"person\" has the meaning specified in section 325F.68.\nIf any person fails or refuses to answer interrogatories, to produce materials, or to be examined under oath, as required by the provisions of subdivision 2, the attorney general may apply to a district court, upon notice, and the court, on a showing by the attorney general of cause therefor, may issue such order as may be required to compel compliance with the discovery procedures authorized by this section.\nThe attorney general may accept an assurance of discontinuance of any act or practice the attorney general deems to be in violation of the laws referred to in subdivision 1 from any person the attorney general alleges is engaging in, or has engaged in, the act or practice. The assurance may include a stipulation for the performance, provision or payment by the alleged violator of any remedies allowable under this section. Any assurance shall be in writing and shall be filed with and subject to the approval of the district court of the county in which the alleged violator resides or has a principal place of business or in Ramsey County. An assurance shall not be considered an admission of a violation for any purpose. Failure to comply with the assurance of discontinuance shall be punishable as contempt.\nFor the purposes of this subdivision the term \"person\" has the meaning specified in section 325F.68.\nIf a court of competent jurisdiction finds that a sum recovered under this section for the benefit of injured persons cannot reasonably be distributed to the victims, because the victims cannot readily be located or identified, or because the cost of distributing the money would outweigh the benefit to the victims, then the court may order that the money be paid into the general fund. All sums recovered must be deposited into the state treasury and credited to the general fund.\nIn addition to the penalties provided by law for violation of the laws referred to in subdivision 1, specifically and generally, whether or not injunctive relief is otherwise provided by law, the courts of this state are vested with jurisdiction to prevent and restrain violations of those laws, to require the payment of civil penalties, to require payment into the general fund, and to appoint administrators as provided in subdivision 3c. On becoming satisfied that any of those laws has been or is being violated, or is about to be violated, the attorney general shall be entitled, on behalf of the state; (a) to sue for and have injunctive relief in any court of competent jurisdiction against any such violation or threatened violation without abridging the penalties provided by law; and (b) to sue for and recover for the state, from any person who is found to have violated any of the laws referred to in subdivision 1, a civil penalty, in an amount to be determined by the court, not in excess of $25,000. All sums recovered by the attorney general under this section shall be deposited in the general fund.\nIn addition to the remedies otherwise provided by law, any person injured by a violation of any of the laws referred to in subdivision 1 may bring a civil action and recover damages, together with costs and disbursements, including costs of investigation and reasonable attorney's fees, and receive other equitable relief as determined by the court. The court may, as appropriate, enter a consent judgment or decree without the finding of illegality. In any action brought by the attorney general pursuant to this section, the court may award any of the remedies allowable under this subdivision.\nAny permanent injunction, judgment or order of the court made pursuant to subdivision 3 shall be prima facie evidence in an action brought under subdivision 3a that the defendant used or employed an act or practice in violation of the laws referred to in subdivision 1, provided that this subdivision shall not apply to consent judgments or decrees where the court makes no finding of illegality, including assurances of discontinuance pursuant to subdivision 2b.\nThe courts of this state are vested with jurisdiction to appoint an administrator in actions brought by the attorney general under this section, for purposes of (1) monitoring, maintaining, or winding up the affairs of a business, or (2) collecting, administering, and distributing judgments obtained by the attorney general for the benefit of persons. Upon the order of a court having jurisdiction over the matter, reasonable fees and expenses may be paid to the administrator out of any sums recovered under this section or administered by the administrator.\n[Repealed, 1983 c 290 s 173; 1983 c 301 s 235]",
	"repealed": false
}