{
	"id": "53.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/53.09",
	"title": "53.09 OVERSIGHT AND ADMINISTRATION.",
	"text": "The commissioner shall make examinations for the purposes set forth in section 46.04, subdivision 1, at least once every 18 calendar months, of each authorized place of business of every industrial loan and thrift company with the right to issue thrift certificates for investment organized or operating under this chapter to satisfy the commissioner that the corporation is in a solvent condition and is complying with the requirements of this chapter and operating according to sound business principles. In order to enforce actions in this connection, the commissioner is hereby vested with the same authority as in the examination and regulation of state banks. The corporation so examined shall pay to the commissioner such fees as may be required under section 46.131. The commissioner may maintain an action for the recovery of such costs in any court of competent jurisdiction.\n(1) Each industrial loan and thrift company shall annually on or before the first day of March file a report with the commissioner stating in detail, under appropriate heads, its assets and liabilities at the close of business on the last day of the preceding calendar year and, if applicable, information required under section 47.601, subdivision 4. This report shall be made under oath in the form prescribed by the commissioner.\n(2) Each industrial loan and thrift company which holds authority to accept accounts pursuant to section 53.04, subdivision 5, shall in place of the requirement in clause (1) submit the reports required of state banks pursuant to section 48.48.\n(3) Within 30 days following a change in controlling ownership of the capital stock of an industrial loan and thrift company, it shall file a written report with the commissioner stating in detail the nature of such change in ownership.\nFor the purpose of discovering violations of this chapter or securing information lawfully required by the commissioner under this chapter, the commissioner may, at any time, either personally or by a person or persons duly designated, investigate the loans and business, and examine the books, accounts, records, and files used in the business, of every licensee and of every person engaged in the business whether or not the person acts or claims to act as principal or agent, or under the authority of this chapter. For the purposes of this subdivision, the commissioner and duly designated representatives have free access to the offices and places of business, books, accounts, papers, records, files, safes, and vaults of all these persons. The commissioner and all persons duly designated may require the attendance of and examine, under oath, all persons whose testimony the commissioner may require relative to the loans or business or to the subject matter of an examination, investigation, or hearing. Upon written agreement with the company, the commissioner may conduct examinations applying the procedures for purposes of subdivision 1, and section 46.04, subdivision 1, to facilitate the qualifications of the company to participate in the United States Small Business Administration loan guarantee or similar programs.\nEach licensee shall pay to the commissioner the amount required under section 46.131, and the commissioner may maintain an action for the recovery of the costs in a court of competent jurisdiction.\nThe penalties for violation of this chapter, or for any wrongdoing in connection therewith, shall be the same as those applied to state banks under the laws of this state. In addition to being subject to the penalties in section 48.28, a company in violation of section 53.05, clause (2), may cure this violation in the manner provided in section 48.28.\nThe commissioner may honor requests from interested parties for interpretive opinions in connection with the administration of this chapter. No provision of this chapter or of any other chapter to which this chapter refers which imposes any penalty shall apply to any act done or not done in conformity with any written interpretive opinion of the commissioner, notwithstanding that such written interpretive opinion may, after such act or omission, be amended or rescinded or be determined by judicial or other authority to be invalid for any reason.",
	"repealed": false
}