{
	"id": "62D.121",
	"url": "https://www.revisor.mn.gov/statutes/cite/62D.121",
	"title": "62D.121 REQUIRED REPLACEMENT COVERAGE.",
	"text": "When membership of an enrollee who has individual health coverage is terminated by the health maintenance organization for a reason other than (a) failure to pay the charge for health care coverage; (b) failure to make co-payments required by the health care plan; (c) enrollee moving out of the area served; or (d) a materially false statement or misrepresentation by the enrollee in the application for membership, the health maintenance organization must offer or arrange to offer replacement coverage, without evidence of insurability, without preexisting condition exclusions, and without interruption of coverage.\nIf the health maintenance organization has terminated individuals from coverage in a service area, the replacement coverage shall be health maintenance organization coverage issued by the health maintenance organization terminating coverage unless the health maintenance organization can demonstrate to the commissioner that offering health maintenance organization replacement coverage would not be feasible. In making the determination, the commissioner shall consider (1) loss ratios and forecasts, (2) lack of agreements between health care providers and the health maintenance organization to offer that product, (3) evidence of anticipated premium needs compared with established rates, (4) the financial impact of the replacement coverage on the overall financial solvency of the plan, and (5) the cost to the enrollee of health maintenance organization replacement coverage as compared to cost to the enrollee of the replacement coverage required under subdivision 3.\nThe terminating health maintenance organization may also offer as replacement coverage health maintenance organization coverage issued by another health maintenance organization.\nIf health maintenance organization replacement coverage is not offered by the health maintenance organization, as explained under subdivisions 2 and 2a, the replacement coverage shall provide, for enrollees covered by title XVIII of the Social Security Act, coverage at least equivalent to a basic Medicare supplement plan as defined in section 62A.316, except that the replacement coverage shall also cover the liability for any Medicare Part A and Part B deductible as defined under title XVIII of the Social Security Act. After satisfaction of the Medicare Part B deductible, the replacement coverage shall be at least 80 percent of usual and customary eligible medical expenses and supplies not covered by Medicare Part B eligible expenses. This does not include outpatient prescription drugs. The fee or premium of the replacement coverage shall not exceed the premium charged by the state comprehensive health plan as established under section 62E.08, for a qualified Medicare supplement plan. All enrollees not covered by Medicare shall be given the option of a number three qualified plan or a number two qualified plan as defined in section 62E.06, subdivisions 1 and 2, for replacement coverage. The fee or premium for a number three qualified plan shall not exceed 125 percent of the average of rates charged by the five insurers with the largest number of individuals in a number three qualified plan of insurance in force in Minnesota. The fee or premium for a number two qualified plan shall not exceed 125 percent of the average of rates charged by the five insurers with the largest number of individuals in a number two qualified plan of insurance in force in Minnesota.\nIf the replacement coverage is health maintenance organization coverage, as explained in subdivisions 2 and 2a, the fee shall not exceed 125 percent of the cost of the average fee charged by health maintenance organizations for a similar health plan. The commissioner of health will determine the average cost of the plan on the basis of information provided annually by the health maintenance organizations concerning the rates charged by the health maintenance organizations for the plans offered. Fees or premiums charged under this section must be actuarially justified.\nThe commissioner will approve or disapprove the replacement coverage within 30 days. A health maintenance organization shall not give enrollees a notice of cancellation of coverage until a replacement policy has been filed with the commissioner and approved or disapproved.\nThe health maintenance organization must provide the terminated enrollees with a notice of cancellation 90 days before the date the cancellation takes effect. If the replacement coverage is approved by the commissioner under subdivision 4, the notice shall clearly and completely describe the replacement coverage that the enrollees are eligible to receive and explain the procedure for enrolling. If the replacement coverage is not approved by the commissioner, the health maintenance organization shall provide a cancellation notice with information that the enrollee is entitled to enroll in the state comprehensive health insurance plan with a waiver of the waiting period for preexisting conditions under section 62E.14, subdivisions 1, paragraph (d), and 6.\nThe commissioner may waive the notice required in this section if the commissioner determines that the health maintenance organization has not received information regarding Medicare reimbursement rates from the Centers for Medicare and Medicaid Services before September 1 for contracts renewing on January 1 of the next year. In no event shall enrollees covered by title XVIII of the Social Security Act receive less than 60 days' notice of contract termination.\nIf the commissioner determines that there are not enough providers to assure that enrollees have accessible health services available in a geographic service area, the commissioner shall institute a plan of corrective action that shall be followed by the health maintenance organization. Such a plan may include but not be limited to requiring the health maintenance organization to make payments to nonparticipating providers for health services for enrollees, requiring the health maintenance organization to discontinue accepting new enrollees in that service area, and requiring the health maintenance organization to reduce its geographic service area. If a nonparticipating provider has been a participating provider with the health maintenance organization within the last year, any payments made under this section must not exceed the payment level of the previous contract unless the commissioner determines that without adjusting payments the health maintenance organization will be unable to meet the health care needs of enrollees in the area.",
	"repealed": false
}