{
	"id": "80A.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/80A.84",
	"title": "80A.84 SECTION 607; PUBLIC RECORDS; CONFIDENTIALITY.",
	"text": "(a) Presumption of public records. Except as otherwise provided in subsection (b), records obtained by the administrator or filed under this chapter, including a record contained in or filed with a registration statement, application, notice filing, or report, are public records and are available for public examination.\n(b) Nonpublic records. The following records are not public records and are not available for public examination under subsection (a):\n(1) a record obtained by the administrator in connection with an audit or inspection under section 80A.66(e) or an investigation under section 80A.79;\n(2) a part of a record filed in connection with a registration statement under sections 80A.49 and 80A.51 through 80A.53 or a record under section 80A.66(d) that contains trade secrets or confidential information if the person filing the registration statement or report has asserted a claim of confidentiality or privilege that is authorized by law;\n(3) a record that is not required to be provided to the administrator or filed under this chapter and is provided to the administrator only on the condition that the record will not be subject to public examination or disclosure;\n(4) a nonpublic record received from a person specified in section 80A.85(a);\n(5) any social security number, residential address unless used as a business address, and residential telephone number contained in a record that is filed;\n(6) a record obtained by the administrator through a designee of the administrator that a rule or order under this chapter determines has been:\n(A) expunged from the administrator's records by the designee; or\n(B) determined to be nonpublic or nondisclosable by that designee if the administrator finds the determination to be in the public interest and for the protection of investors; and\n(7) a record furnished to the administrator by a portal operator under section 80A.461, subdivision 7, paragraph (e).\n(c) Administrator discretion to disclose. If disclosure is for the purpose of a civil, administrative, or criminal investigation, action, or proceeding or to a person specified in section 80A.85(a), the administrator may disclose a record obtained in connection with an audit or inspection under section 80A.66(e) or a record obtained in connection with an investigation under section 80A.79.",
	"repealed": false
}