{
	"id": "16C.087",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.087",
	"title": "16C.087 SELECTION OF CERTAIN PROFESSIONAL SERVICE CONTRACTORS.",
	"text": "This section applies to an agency contract for professional services of persons regulated by the Board of Architecture, Engineering, Land Surveying, Landscape Architecture, Geoscience, and Interior Design for which the agency, with the approval of the commissioner, decides to use procedures under this section. If the agency, with the approval of the commissioner, decides to use procedures under this section, it must comply with subdivisions 2, 3, and 4. This section does not apply to an agency contract that is subject to section 16B.33.\nNotwithstanding section 16C.06, subdivision 6, an agency must rank contractors described in subdivision 1 on the basis of qualifications, as described in subdivision 3, for the type of professional service required. An agency may solicit pricing information from a single responder at a time in rank order, commencing with the highest ranked contractor, to determine contractor compensation only after the agency has ranked prospective contractors based on the factors the agency specifies in accordance with subdivisions 3 and 4.\nSubject to subdivision 2, procedures for screening and selection of contractors are within the sole discretion of the agency and must be approved by the commissioner when the agency seeks approval to use this alternative. Procedures may be adjusted to accommodate the agency's cost, scope, and schedule objectives for a particular project. Screening and selection procedures may include a consideration of each contractor's:\n(1) specialized expertise, capabilities, and technical competence as demonstrated by the proposed approach and methodology to meet the project requirements;\n(2) resources available to perform the work, including any specialized services, within the specified time limits for the project;\n(3) record of past performance, including but not limited to price and cost data from previous projects, quality of work, ability to meet schedules, cost control, and contract administration;\n(4) ownership status and employment practices regarding women, minorities, and emerging small businesses or historically underutilized businesses;\n(5) availability to the project locale;\n(6) familiarity with the project locale;\n(7) proposed project management techniques; and\n(8) ability and proven history in handling special project constraints.\n(a) The agency shall rank prospective contractors based on the factors approved by the commissioner, which the agency must specify in the request for proposal, in accordance with this section. The agency and the highest ranked contractor shall mutually discuss and refine the scope of services for the project and shall negotiate conditions, including but not limited to compensation and performance schedule, based on the scope of the services. The compensation level paid must be reasonable and fair to the agency, as determined solely by the agency.\n(b) If the agency and the highest ranked contractor are unable for any reason to negotiate a contract at a compensation level that is reasonable and fair to the agency, the agency shall, either orally or in writing, terminate negotiations with this contractor. The agency may then negotiate with the next highest ranked contractor, as provided in this subdivision. The negotiation process may continue through successive contractors, according to agency ranking, until an agreement is reached or the agency terminates the contracting process.",
	"repealed": false
}