{
	"id": "240A.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/240A.20",
	"title": "240A.20 PROMOTING CONSTRUCTION AND RENOVATION OF PUBLIC SKATE PARKS THROUGHOUT THE STATE.",
	"text": "For purposes of this section, \"skate\" means wheeled, nonmotorized recreation, including skateboarding, roller blading, roller skating, and BMX biking.\nThe Minnesota Amateur Sports Commission shall:\n(1) develop new public skate parks statewide; and\n(2) provide matching grants to local units of government for public skate parks based on the criteria in this section.\n(a) The commission shall administer a site selection process for the skate parks. The commission shall invite proposals from cities, towns, counties, consortia of cities, park boards, and school districts that are eligible to receive a grant under this program. A proposal for a skate park must include matching contributions including in-kind contributions of land, access roadways and access roadway improvements, and necessary utility services, landscaping, and parking.\n(b) The skate park must be accessible to the public without charge for personal use.\n(c) The skate park must be constructed of concrete.\n(d) The location for all proposed facilities must be in areas of maximum demonstrated interest and must maximize accessibility to an arterial highway, transit, or pedestrian or bike path.\n(e) To the extent possible, all proposed facilities must be dispersed equitably, must be located to maximize potential for full utilization, must accommodate noncompetitive family and community skating for all ages, and must encourage use of skate parks by a diverse population.\n(f) The commission will give priority to proposals that come from more than one local government unit.\n(g) The commission may also use the money to upgrade current facilities.\n(h) To the extent possible, 50 percent of all grants must be awarded to communities in greater Minnesota.\n(i) A grant awarded under subdivision 2, clause (2), may not exceed $500,000 unless the grantee demonstrates that the facility will have a regional or statewide draw. A grant awarded under subdivision 2, clause (2), may be for up to $1,000,000 for a skate park with regional impact. A grant awarded under subdivision 2, clause (2), may be for up to $2,000,000 for a skate park that has or will have more than 40,000 square feet.\n(j) In selecting projects to be awarded grants under this section, the commission must give priority to those projects that are designed by experts in the field of concrete skate park design and are to be constructed by professionals with experience in the construction of concrete skate parks.\n(k) To be eligible for a grant under this section, a local government must have engaged or must commit to engage youth in the planning, design, and programming for the concrete skate park.\nTo the extent possible, the commission shall provide technical assistance on skate park planning, design, and operation to communities.\n(a) The Minnesota Amateur Sports Commission may enter into agreements with local units of government and provide financial assistance in the form of grants for the construction of skate parks that, in the determination of the commission, conform to its criteria.\n(b) The commission may enter into cooperative purchasing agreements under section 471.59 with local governments to purchase skate park equipment and services through state contracts. The cooperative skate park equipment purchasing revolving fund is a separate account in the state treasury. The commission may charge a fee to cover the commission's administrative expenses to government units that have joint or cooperative purchasing agreements with the state under section 471.59. The fees collected must be deposited in the revolving fund established by this subdivision. Money in the fund is appropriated to the commission to administer the programs and services covered by this subdivision.\nNotwithstanding section 471.345, cities, towns, counties, park boards, and school districts may solicit and award a design-build or construction manager at-risk contract for a construction or upgrade project funded under this section on the basis of a best value selection process. The city, town, county, park board, or school district must consider at least three proposals when awarding a design-build contract under this section.\nA grant of money from an appropriation under this program is available to each grantee until the project that is the subject of the grant is completed or abandoned, subject to section 16A.642.",
	"repealed": false
}