{
	"id": "435.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/435.37",
	"title": "435.37 EASEMENT FOR CARTWAY.",
	"text": "(a) Upon petition presented to the city council by the owner of a tract of land containing at least five acres, who has no access thereto except over a navigable waterway or over the lands of others, or whose access thereto is less than two rods in width, the city council by resolution shall establish a cartway at least two rods wide connecting the petitioner's land with a public road.\n(b) The city council may select an alternative route other than that petitioned for if the alternative is deemed by the city council to be less disruptive and damaging to the affected landowners and in the public's best interest.\n(c) The amount of damages must be paid by the petitioner to the city before the cartway is opened. For the purposes of this subdivision, damages means the compensation, if any, awarded to the owner of the land upon which the cartway is established together with the cost of professional and other services, hearing costs, administrative costs, recording costs, and other costs and expenses that the city may incur in connection with the proceedings for the establishment of the cartway. The city council may by resolution require the petitioner to post a bond or other security acceptable to the city council for the total estimated damages before the city council takes action on the petition.\n(d) The city may not expend street or bridge funds on the cartway unless the city council, by resolution, determines that an expenditure is in the public interest. If no resolution is adopted to that effect, the grading or other construction work and the maintenance of the cartway is the responsibility of the petitioner.\n(e) After the cartway has been constructed, the city council may by resolution designate the cartway as a private driveway with the written consent of the affected landowner, in which case from the effective date of the resolution no town road and bridge funds may be expended for maintenance of the driveway.\nWhen a cartway is not maintained by the city, one or more of the private property owners who own land adjacent to a cartway, or one or more of the private property owners who has no access to the owner's land except by way of the cartway, may maintain the cartway. The cost of maintenance must be equitably divided among all of the private property owners who own land adjacent to the cartway and all of the private property owners who have no access to their land except by way of the cartway. The following factors may be taken into consideration when determining an equitable share of maintenance expenses: the frequency of use, the type and weight of the vehicles or equipment, and the distance traveled on the cartway to the individual's property. The city council may determine the maintenance costs to be apportioned to each private property owner if the private property owners cannot agree on the division of the costs. The city council's decision may be appealed within 30 days to the district court of the county in which the cartway is located. Private property owners who pay the cost of maintenance have a civil cause of action against any of the private property owners who refuse to pay their share of the maintenance cost.\nFor purposes of this section, \"city\" includes statutory and home rule charter cities.\nFor the purposes of this section, the proceedings of the city council shall be in accordance with the procedures set forth in section 164.07, except that references in section 164.07 to \"town,\" \"town clerk,\" \"town board,\" or \"town costs\" shall be construed to mean references to \"city,\" \"city clerk,\" \"city council,\" or \"city costs,\" respectively, or equivalent terms, as required by the context.",
	"repealed": false
}