{
	"id": "40A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/40A.11",
	"title": "40A.11 DURATION OF AGRICULTURAL PRESERVE.",
	"text": "An agricultural preserve continues in existence until either the owner or the county initiates expiration as provided in this section. The date of expiration by the owner or the county must be at least eight years from the date of notice under this section.\nThe owner may initiate expiration of an agricultural preserve by notifying the county on a form prepared by the commissioner and available in each county. The notice must describe the property involved and must state the date of expiration. The notice may be rescinded by the owner during the first two years following notice.\nThe county may initiate expiration of the agricultural preserve by notifying the owner by registered mail on a form provided by the commissioner, provided that before notification the following conditions are met:\n(1) the agricultural land preservation plan and official controls have been amended so that the land is no longer designated for long-term agricultural use; and\n(2) the commissioner has reviewed and approved the amended plan and official controls for consistency with the guidelines contained in this chapter. The notice must describe the property involved and must state the date of expiration.\nWhen the county receives notice under subdivision 2 or serves notice under subdivision 3, the county shall forward the original notice to the county recorder for recording, or to the registrar of titles if the land is registered, and shall notify the regional development commission, the commissioner, and the county soil and water conservation district of the date of expiration. Designation as an agricultural preserve and the benefits and limitations contained in this chapter and the restrictive covenant filed with the application cease on the date of expiration. If the land is registered, the registrar of titles shall cancel the memorial of the application containing the restrictive covenant upon the certificate of title on the effective date of the expiration.\nAn agricultural preserve may be terminated earlier than as provided in this section only in the event of a public emergency upon petition from the owner or county to the governor. The determination of a public emergency must be made by the governor through executive order under section 4.035 and chapter 12. The executive order must identify the agricultural preserve, the reasons requiring the action, and the date of expiration.",
	"repealed": false
}