{
	"id": "62L.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.09",
	"title": "62L.09 CESSATION OF SMALL EMPLOYER BUSINESS.",
	"text": "A health carrier electing to cease doing business in the small employer market shall notify the commissioner 180 days prior to the effective date of the cessation. The health carrier shall simultaneously provide a copy of the notice to each small employer covered by a health benefit plan issued by the health carrier. For purposes of this section, \"cease doing business\" means to discontinue issuing new health benefit plans to small employers and to refuse to renew all of the health carrier's existing health benefit plans issued to small employers, the terms of which permit refusal to renew under the circumstances specified in this subdivision. This section does not permit cancellation of a health benefit plan, unless permitted under its terms.\nUpon making the notification, the health carrier shall not offer or issue new business in the small employer market. The health carrier shall renew its current small employer business due for renewal within 120 days after the date of the notification but shall not renew any small employer business more than 120 days after the date of the notification. The renewal period for business renewed during that 120-day period shall end on the effective date of the cessation.\nA health carrier that elects to cease doing business in the small employer market shall continue to be governed by this chapter with respect to any continuing small employer business conducted by the health carrier.\n[Repealed, 1993 c 345 art 7 s 16]\n(a) Except as otherwise provided in paragraph (b), a health carrier that ceases to do business in the small employer market after July 1, 1993, is prohibited from writing new business in the small employer market in this state for a period of five years from the date of notice to the commissioner. This subdivision applies to any health maintenance organization that ceases to do business in the small employer market in one service area with respect to that service area only. Nothing in this subdivision prohibits an affiliated health maintenance organization from continuing to do business in the small employer market in that same service area.\n(b) The commissioner of commerce or the commissioner of health may permit a health carrier that ceases to do business in the small employer market in this state after July 1, 1993, to begin writing new business in the small employer market if:\n(1) since the carrier ceased doing business in the small employer market, legislative action has occurred that has significantly changed the effect on the carrier of its decision to cease doing business in the small employer market; and\n(2) the commissioner deems it appropriate.\nA health carrier that ceases to do business in the small employer market remains liable for assessments levied by the association as provided in section 62L.22.",
	"repealed": false
}