{
	"id": "70A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/70A.14",
	"title": "70A.14 LICENSING.",
	"text": "A rate service organization applying for a license as required by section 70A.13, subdivision 1, shall include with its application:\n(1) a copy of its constitution, charter, articles of organization, agreement, association or incorporation, and a copy of its bylaws, plan of operation and any other rules or regulations governing the conduct of its business;\n(2) a list of its members and subscribers;\n(3) the name and address of one or more residents of this state upon whom notices, process affecting it or orders of the commissioner may be served;\n(4) a statement showing its technical qualifications for acting in the capacity for which it seeks a license; and\n(5) any other relevant information and documents that the commissioner may require.\nEvery organization which has applied for a license under subdivision 1 shall thereafter promptly notify the commissioner of every material change in the facts or in the documents on which its application was based.\nIf the commissioner finds that the applicant and the natural persons through whom it acts are competent, trustworthy, and technically qualified to provide the services proposed, and that all requirements of law are met, the commissioner shall issue a license specifying the authorized activity of the applicant. The commissioner shall not issue a license if the proposed activity would tend to create a monopoly or to lessen or destroy price competition.\nLicenses issued pursuant to this section shall remain in effect until the licensee withdraws from the state or until the license is suspended or revoked. The fee for each license shall be $3,000, payable every three years.\nAny amendment to a document filed under subdivision 1, clause (1), shall be filed within 30 days of its adoption. Failure to comply with this subsection shall be a ground for revocation of the license granted under subdivision 3.",
	"repealed": false
}