{
	"id": "256B.4912",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.4912",
	"title": "256B.4912 HOME AND COMMUNITY-BASED WAIVERS; PROVIDERS AND PAYMENT.",
	"text": "(a) For the home and community-based waivers providing services to seniors and individuals with disabilities under chapter 256S and sections 256B.0913, 256B.092, and 256B.49, the commissioner shall establish:\n(1) agreements with enrolled waiver service providers to ensure providers meet Minnesota health care program requirements;\n(2) regular reviews of provider qualifications, and including requests of proof of documentation; and\n(3) processes to gather the necessary information to determine provider qualifications.\n(b) A provider shall not require or coerce any service recipient to change waiver programs or move to a different location, consistent with the informed choice and independent living policies under section 256B.4905, subdivisions 1a, 2a, 3a, 7, and 8.\n(c) Beginning July 1, 2012, staff that provide direct contact, as defined in section 245C.02, subdivision 11, for services specified in the federally approved waiver plans must meet the requirements of chapter 245C prior to providing waiver services and as part of ongoing enrollment. Upon federal approval, this requirement must also apply to consumer-directed community supports.\n(d) Beginning January 1, 2014, service owners and managerial officials overseeing the management or policies of services that provide direct contact as specified in the federally approved waiver plans must meet the requirements of chapter 245C prior to reenrollment or revalidation or, for new providers, prior to initial enrollment if they have not already done so as a part of service licensure requirements.\n(a) As determined by the commissioner, a provider of home and community-based services for the elderly under chapter 256S and section 256B.0913, home and community-based services for people with developmental disabilities under section 256B.092, and home and community-based services for people with disabilities under section 256B.49 shall submit data to the commissioner on the following:\n(1) number of direct-care staff;\n(2) wages of direct-care staff;\n(3) hours worked by direct-care staff;\n(4) overtime wages of direct-care staff;\n(5) overtime hours worked by direct-care staff;\n(6) benefits paid and accrued by direct-care staff;\n(7) direct-care staff retention rates;\n(8) direct-care staff job vacancies;\n(9) amount of travel time paid;\n(10) program vacancy rates; and\n(11) other related data requested by the commissioner.\n(b) The commissioner may adjust reporting requirements for a self-employed direct-care staff.\n(c) For the purposes of this subdivision, \"direct-care staff\" means employees, including self-employed individuals and individuals directly employed by a participant in a consumer-directed service delivery option, providing direct service provision to people receiving services under this section. Direct-care staff does not include executive, managerial, or administrative staff.\n(d) This subdivision also applies to a provider of personal care assistance services under section 256B.0625, subdivision 19a; community first services and supports under section 256B.85; nursing services and home health services under section 256B.0625, subdivision 6a; home care nursing services under section 256B.0625, subdivision 7; or day training and habilitation services for residents of intermediate care facilities for persons with developmental disabilities under section 256B.501.\n(e) This subdivision also applies to financial management services providers for participants who directly employ direct-care staff through consumer support grants under section 256.476; the personal care assistance choice program under section 256B.0659, subdivisions 18 to 20; community first services and supports under section 256B.85; and the consumer-directed community supports option available under the alternative care program, the brain injury waiver, the community alternative care waiver, the community access for disability inclusion waiver, the developmental disabilities waiver, the elderly waiver, and the Minnesota senior health option, except financial management services providers are not required to submit the data listed in paragraph (a), clauses (7) to (11).\n(f) The commissioner shall ensure that data submitted under this subdivision is not duplicative of data submitted under any other section of this chapter or any other chapter.\n(g) A provider shall submit the data annually on a date specified by the commissioner. The commissioner shall give a provider at least 30 calendar days to submit the data. If a provider fails to submit the requested data by the date specified by the commissioner, the commissioner may delay medical assistance reimbursement until the requested data is submitted.\n(h) Individually identifiable data submitted to the commissioner in this section are considered private data on an individual, as defined by section 13.02, subdivision 12.\n(i) The commissioner shall analyze data annually for workforce assessments and how the data impact service access.\n(a) The commissioner shall develop and administer a survey of direct care staff who work for organizations that provide services under the following programs:\n(1) home and community-based services for seniors under chapter 256S and section 256B.0913; home and community-based services for people with developmental disabilities under section 256B.092; and home and community-based services for people with disabilities under section 256B.49;\n(2) personal care assistance services under section 256B.0625, subdivision 19a; community first services and supports under section 256B.85; nursing services and home health services under section 256B.0625, subdivision 6a; and home care nursing services under section 256B.0625, subdivision 7; and\n(3) financial management services for participants who directly employ direct-care staff through consumer support grants under section 256.476; the personal care assistance choice program under section 256B.0659, subdivisions 18 to 20; community first services and supports under section 256B.85; and the consumer-directed community supports option available under the alternative care program, the brain injury waiver, the community alternative care waiver, the community access for disability inclusion waiver, the developmental disabilities waiver, the elderly waiver, and the Minnesota senior health option, except financial management services providers are not required to submit the data listed in subdivision 1a, clauses (7) to (11).\n(b) The survey must collect information about the individual experience of the direct-care staff and any other information necessary to assess the overall economic viability and well-being of the workforce.\n(c) For purposes of this subdivision, \"direct-care staff\" means employees, including self-employed individuals and individuals directly employed by a participant in a consumer-directed service delivery option, providing direct service to participants under this section. Direct-care staff does not include executive, managerial, or administrative staff.\n(d) Individually identifiable data submitted to the commissioner under this section are considered private data on individuals as defined by section 13.02, subdivision 12.\n(e) The commissioner shall analyze data submitted under this section annually to assess the overall economic viability and well-being of the workforce and the impact of the state of the workforce on access to services.\nThe commissioner shall publish annual reports on provider and state-level labor market data, including but not limited to the data outlined in subdivisions 1a and 1b.\n(a) The commissioner shall establish, as defined under section 256B.4914, statewide payment methodologies that meet federal waiver requirements for home and community-based waiver services for individuals with disabilities. The payment methodologies must abide by the principles of transparency and equitability across the state. The methodologies must involve a uniform process of structuring rates for each service and must promote quality and participant choice.\n(b) As of January 1, 2012, counties shall not implement changes to established processes for rate-setting methodologies for individuals using components of or data from research rates.\nThe payment methodologies established under this section shall accommodate:\n(1) supervision costs;\n(2) staff compensation;\n(3) staffing and supervisory patterns;\n(4) program-related expenses;\n(5) general and administrative expenses; and\n(6) consideration of recipient intensity.\n(a) The payment methodologies under this section shall reflect the payment rate criteria in paragraphs (b), (c), and (d).\n(b) Payment rates shall reflect the reasonable, ordinary, and necessary costs of service delivery.\n(c) Payment rates shall be sufficient to enlist enough providers so that care and services are available at least to the extent that such care and services are available to the general population in the geographic area as required by section 1902(a)(30)(A) of the Social Security Act.\n(d) The commissioner must not reimburse:\n(1) unauthorized service delivery;\n(2) services provided under a receipt of a special grant;\n(3) services provided under contract to a local school district;\n(4) extended employment services under Minnesota Rules, parts 3300.6000 to 3300.6070, or vocational rehabilitation services provided under the federal Rehabilitation Act, as amended, Title I, section 110, or Title VI-C, and not through use of medical assistance or county social service funds; or\n(5) services provided to a client by a licensed medical, therapeutic, or rehabilitation practitioner or any other vendor of medical care which are billed separately on a fee-for-service basis.\nCounty and tribal contracts with providers of home and community-based waiver services provided under chapter 256S and sections 256B.0913, 256B.092, and 256B.49 are eliminated effective January 1, 2014.\nThe commissioner of human services must establish uniform program standards for services identified in chapter 245D for persons with disabilities and people age 65 and older. The commissioner must grant licenses according to the provisions of chapter 245A.\nAn applicant or license holder for the home and community-based waivers providing services to seniors and individuals with disabilities under chapter 256S and sections 256B.0913, 256B.092, and 256B.49 that is not enrolled as a Minnesota health care program home and community-based services waiver provider at the time of application must ensure that at least one controlling individual completes a onetime training on the requirements for providing home and community-based services as determined by the commissioner, before a provider is enrolled or license is issued. Within six months of enrollment, a newly enrolled home and community-based waiver service provider must ensure that at least one controlling individual has completed training on waiver and related program billing. Exemptions to new waiver provider training requirements may be granted, as determined by the commissioner.\nBeginning July 1, 2013, facilities and services to be licensed under chapter 245D shall submit data regarding the use of emergency use of manual restraint as identified in section 245D.061 in a format and at a frequency identified by the commissioner.\n(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Controlling individual\" means a public body, governmental agency, business entity, officer, owner, or managerial official whose responsibilities include the direction of the management or policies of a program.\n(c) \"Managerial official\" means an individual who has decision-making authority related to the operation of the program and responsibility for the ongoing management of or direction of the policies, services, or employees of the program.\n(d) \"Owner\" means an individual who has direct or indirect ownership interest in a corporation or partnership, or business association enrolling with the Department of Human Services as a provider of waiver services.\n(a) Except as provided in paragraph (b), the following home and community-based waiver providers must provide, at the time of enrollment and within 30 days of a request, in a format determined by the commissioner, information and documentation that includes proof of liability insurance:\n(1) waiver services providers required to meet the provider standards in chapter 245D;\n(2) foster care providers whose services are funded by the elderly waiver or alternative care program;\n(3) fiscal support entities;\n(4) adult day care providers;\n(5) providers of customized living services; and\n(6) residential care providers.\n(b) Providers of foster care services covered by section 245.814 are exempt from this subdivision.\n(a) A home and community-based service is eligible for reimbursement if:\n(1) the service is provided according to a federally approved waiver plan as authorized under chapter 256S and sections 256B.0913, 256B.092, and 256B.49;\n(2) the service is provided on days and times during the days and hours of operation specified on any license required under chapter 245A or 245D, if applicable; and\n(3) the provider complies with subdivisions 12 to 15, if applicable.\n(b) The provider must maintain documentation that, upon employment and annually thereafter, staff providing a service have attested to reviewing and understanding the following statement: \"It is a federal crime to provide materially false information on service billings for medical assistance or services provided under a federally approved waiver plan as authorized under Minnesota Statutes, chapter 256S, and Minnesota Statutes, sections 256B.0913, 256B.092, and 256B.49.\"\n(c) The department may recover payment according to section 256B.064 and Minnesota Rules, parts 9505.2160 to 9505.2245, for a service that does not satisfy this subdivision.\n(a) Documentation may be collected and maintained electronically or in paper form by providers and must be produced upon request by the commissioner.\n(b) Documentation of a delivered service must be in English and must be legible according to the standard of a reasonable person.\n(c) If the service is reimbursed at an hourly or specified minute-based rate, each documentation of the provision of a service, unless otherwise specified, must include:\n(1) the date the documentation occurred;\n(2) the day, month, and year when the service was provided;\n(3) the start and stop times with a.m. and p.m. designations, except for case management services as defined under chapter 256S and sections 256B.0913, subdivision 7; 256B.092, subdivision 1a; and 256B.49, subdivision 13;\n(4) the service name or description of the service provided; and\n(5) the name, signature, and title, if any, of the provider of service. If the service is provided by multiple staff members, the provider may designate a staff member responsible for verifying services and completing the documentation required by this paragraph.\n(d) If the service is reimbursed at a daily rate or does not meet the requirements in paragraph (c), each documentation of the provision of a service, unless otherwise specified, must include:\n(1) the date the documentation occurred;\n(2) the day, month, and year when the service was provided;\n(3) the service name or description of the service provided; and\n(4) the name, signature, and title, if any, of the person providing the service. If the service is provided by multiple staff, the provider may designate a staff member responsible for verifying services and completing the documentation required by this paragraph.\n(a) A waiver transportation service must be a waiver transportation service that: (1) is not covered by medical transportation under the Medicaid state plan; and (2) is not included as a component of another waiver service.\n(b) In addition to the documentation requirements in subdivision 12, a waiver transportation service provider must maintain:\n(1) odometer and other records pursuant to section 256B.0625, subdivision 17b, paragraph (b), clause (3), sufficient to distinguish an individual trip with a specific vehicle and driver for a waiver transportation service that is billed directly by the mile. A common carrier as defined by Minnesota Rules, part 9505.0315, subpart 1, item B, or a publicly operated transit system provider are exempt from this clause; and\n(2) documentation demonstrating that a vehicle and a driver meet the transportation waiver service provider standards and qualifications according to the federally approved waiver plan.\n(a) In addition to the requirements in subdivision 12, an equipment and supply services provider must for each documentation of the provision of a service include:\n(1) the recipient's assessed need for the equipment or supply;\n(2) the reason the equipment or supply is not covered by the Medicaid state plan;\n(3) the type and brand name of the equipment or supply delivered to or purchased by the recipient, including whether the equipment or supply was rented or purchased;\n(4) the quantity of the equipment or supply delivered or purchased; and\n(5) the cost of the equipment or supply if the amount paid for the service depends on the cost.\n(b) A provider must maintain a copy of the shipping invoice or a delivery service tracking log or other documentation showing the date of delivery that proves the equipment or supply was delivered to the recipient or a receipt if the equipment or supply was purchased by the recipient.\n(a) In addition to the requirements in subdivision 12, a provider of adult day services as defined in section 245A.02, subdivision 2a, and licensed under Minnesota Rules, parts 9555.9600 to 9555.9730, must maintain documentation of:\n(1) a needs assessment and current plan of care according to section 245A.143, subdivisions 4 to 7, or Minnesota Rules, part 9555.9700, for each recipient, if applicable;\n(2) attendance records as specified under section 245A.14, subdivision 14, paragraph (a), including the date of attendance with the day, month, and year; and the pickup and drop-off time in hours and minutes with a.m. and p.m. designations;\n(3) the monthly and quarterly program requirements in Minnesota Rules, part 9555.9710, subparts 1, items E and H; 3; 4; and 6, if applicable;\n(4) the name and qualification of each registered physical therapist, registered nurse, and registered dietitian who provides services to the adult day services or nonresidential program; and\n(5) the location where the service was provided. If the location is an alternate location from the usual place of service, the documentation must include the address, or a description if the address is not available, of both the origin site and destination site; the length of time at the alternate location with a.m. and p.m. designations; and a list of participants who went to the alternate location.\n(b) A provider must not exceed the provider's licensed capacity. If a provider exceeds the provider's licensed capacity, the department must recover all Minnesota health care programs payments from the date the provider exceeded licensed capacity.\nFor homemaker services eligible for reimbursement under the developmental disabilities waiver, the brain injury waiver, the community alternative care waiver, and the community access for disability inclusion waiver, the commissioner must establish rates equal to the rates established under sections 256S.21 to 256S.215 for the corresponding homemaker services.\n[See Note.]",
	"repealed": false
}