{
	"id": "347.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/347.58",
	"title": "347.58 LICENSING AND INSPECTIONS.",
	"text": "(a) The board may grant an operating license to a commercial breeder and must enforce sections 347.58 to 347.64.\n(b) Beginning July 1, 2015, a commercial breeder must obtain an annual license for each facility it owns or operates. More than one building on the same premises is considered one facility. The initial prelicense inspection fee and the annual license fee is $10 per adult intact animal, but each fee must not exceed $250.\n(c) The board must perform an announced initial prelicense inspection within 60 days from the date of receiving a license application. A commercial breeder is not in violation of this section if the commercial breeder has filed a completed license application with the board and the board has not performed the initial prelicense inspection. The board must inspect a commercial breeder's facility before an initial license is issued. The initial prelicense inspection fee must be included with the license application. Upon completion of the inspection, the inspector must provide the commercial breeder an inspection certificate signed by the inspector in a format approved by the board.\n(d) The license application must indicate if a commercial breeder operates under more than one name from a single location or has an ownership interest in any other facility. License holders must keep separate records for each business name.\n(e) The application must include a statement that includes the following information:\n(1) whether any license held by an applicant under this section or under any other federal, state, county, or local law, ordinance, or other regulation relating to breeding cats or dogs was ever suspended, revoked, or denied; and\n(2) whether the applicant was ever convicted of animal cruelty.\n(f) An application from a partnership, corporation, or limited liability company must include the name and address of all partners, directors, officers, or members and must include a notation of any partners, directors, officers, members, or others authorized to represent the partnership, corporation, or limited liability company.\n(g) A nonresident applicant must consent to adjudication of any violation under the laws of the state of Minnesota and in Minnesota courts.\n(h) A license issued under this section is not transferable.\n(i) A license holder must apply for license renewal annually by submitting a renewal application on a form approved by the board. The license renewal application must be postmarked or submitted electronically in a method approved by the board by July 1 of each year. The board may assess a late renewal penalty of up to 50 percent of the license fee. If a license is not renewed by August 1, the board may require the commercial breeder to reapply for an initial license.\n(j) A commercial breeder must submit to the board an annual report by July 1 on a form prepared by the board. The form must include the current number of cats and dogs at the facility on the date of the report, the number of animals during the preceding year that were sold, traded, bartered, leased, brokered, given away, euthanized, or deceased from other causes, and any other information required by the board.\n(k) If a commercial breeder is required to be licensed by the United States Department of Agriculture, United States Department of Agriculture inspection reports and records relating to animal care plans and veterinary care must be made available during an inspection, upon request.\n(l) A commercial breeder must prominently display the commercial breeder's license at each facility.\n(m) A commercial breeder's state license number or a symbol approved by the board must be included in all of the commercial breeder's advertisements or promotions that pertain to animals being sold or traded including, but not limited to, all newspapers, Internet, radio, or flyers.\n(n) A commercial breeder must notify the board by certified mail or electronically in a method approved by the board within ten days of any change in address, name, management, or substantial control and ownership of the business or operation.\n(o) The board must refuse to issue an initial license when a commercial breeder:\n(1) is in violation of section 343.21; 343.24; 343.27; 343.28; 343.31; 343.37; 346.37; 346.38; 346.39; 346.44; or 346.155;\n(2) has failed to meet any of the requirements of this section and section 347.59;\n(3) is in violation of a local ordinance regarding breeders;\n(4) has been convicted, other than a petty misdemeanor conviction, of cruelty to animals under Minnesota law or a substantially similar animal cruelty law of another jurisdiction;\n(5) has had a substantially similar license denied, revoked, or suspended by another federal or state authority within the last five years; or\n(6) has falsified any material information requested by the board.\n(p) A person who has been an officer, agent, direct family member, or employee of a commercial breeder whose license was revoked or suspended and who was responsible for or participated in the violation that was a basis for the revocation or suspension may not be licensed while the revocation or suspension is in effect.\n(a) The board must inspect each licensed facility at least annually. The inspection must be with the commercial breeder or an agent of the commercial breeder present. The inspector must submit an inspection report to the board within ten days of each inspection on a form prepared by the board. The inspection report form must list separately each law, rule, regulation, and ordinance the facility is not in compliance with and what correction is required for compliance. The inspection report form must document the animal inventory on the date of the inspection.\n(b) If, after the prelicense inspection, the commercial breeder has two consecutive years of inspections with no violations, the board must inspect the commercial breeder at least every two years. If the commercial breeder has any violations during an inspection or if the board has cause, the board must inspect the commercial breeder at least annually.\n(c) If a license to operate is suspended, revoked, or denied, the board must be granted access to the facility during normal business hours to verify that it is not operating.\n(a) The commercial breeder must keep records on each animal at the facility that includes:\n(1) the name, address, and United States Department of Agriculture license number, if applicable, from whom an animal was received; the date the commercial breeder received the animal; the date of the animal's birth; the breed, sex, color, and identifying marks of the animal; any identifying tag, tattoo, microchip, or collar number; worming treatments, vaccinations, and name of the person who administered the vaccination; medication received by the animal while in the possession of the commercial breeder; and any disease conditions diagnosed by a veterinarian; and\n(2) the name and address of the person or entity to whom an animal was transferred.\n(b) The commercial breeder must maintain a copy of the records required to be kept under this subdivision for two years.\n(a) A commercial breeder must establish and maintain a written protocol for disease control and prevention, euthanasia, and veterinary care of animals at each facility. The initial protocol must be developed under the direction and supervision of the board. A commercial breeder must maintain a written protocol that is updated at least every 12 months and that is signed and dated by the board or by a veterinarian along with the commercial breeder. The written protocol must be available to the board upon request or at the time of inspection.\n(b) An animal sold or otherwise distributed by a commercial breeder must be accompanied by a veterinary health certificate completed by a veterinarian. The certificate must be completed within 30 days prior to the sale or distribution and must indicate that the animal is current with vaccinations and has no signs of infectious or contagious diseases. The certificate accompanying an adult dog that was not spayed or neutered must indicate that the dog has no signs of infectious or contagious diseases and was tested for canine brucellosis with a test approved by the board and found to be negative.\nThe board must maintain and post in a timely manner on its website a list of commercial breeders licensed and in good standing under this section.",
	"repealed": false
}