{
	"id": "333.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/333.001",
	"title": "333.001 DEFINITIONS.",
	"text": "As used in sections 333.001 to 333.06, the following terms shall have the meanings given, unless the context clearly indicates that a different meaning is intended.\n\"Person\" means one or more natural persons; a limited liability company, whether domestic or foreign; a registered limited liability partnership, whether domestic or foreign; a partnership; a limited partnership; a corporation, including a foreign, domestic, or nonprofit corporation; a trust; or any other business organization.\n\"True name\" means the true full name of the natural person, if a proprietorship; the true full name of each partner, if a partnership; the full corporate name as stated in its articles, if a corporation; the full name of the limited liability company as stated in its articles of organization or certificate of authority; the full name of the limited partnership, if a limited partnership; the full name of the registered limited liability partnership; the true full name of at least one trustee, if a trust; or the true full name of at least one beneficial owner, if any other form of business organization.\n\"Address\" means the full residential address of each natural person, trustee or beneficial owner, limited liability company, whether domestic or foreign, registered limited liability partnership, whether domestic or foreign, or corporation, included in subdivision 3, and the address of the principal place in Minnesota where the business is conducted or transacted.\n\"Executed\" means signed.\n(a) \"Signed\" means that the signature of a person has been written on a document, as provided in section 645.44, subdivision 14, and, with respect to a document required by this chapter to be filed with the secretary of state, means that the document has been signed by a person authorized to do so by the organizational documents, bylaws, agreements, or by a resolution approved by the ultimately responsible managing entity for the business organization.\n(b) A signature on a document may be a facsimile affixed, engraved, printed, placed, stamped with indelible ink, transmitted by facsimile or electronically, or in any other manner reproduced on the document.\n\"Filed with the secretary of state\" means that a document meeting the applicable requirements of this chapter, signed and accompanied by the required filing fee, has been delivered to the secretary of state of this state. The secretary of state shall endorse on the document the word \"Filed\" and the month, day, and year of filing, record the document in the Office of the Secretary of State, and return a document to the person who delivered it for filing.",
	"repealed": false
}