{
	"id": "62Q.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.80",
	"title": "62Q.80 COMMUNITY-BASED HEALTH CARE COVERAGE PROGRAM.",
	"text": "(a) Any community-based health care initiative may develop and operate community-based health care coverage programs that offer to eligible individuals and their dependents the option of purchasing through their employer health care coverage on a fixed prepaid basis without meeting the requirements of chapter 60A, 62A, 62C, 62D, 62M, 62N, 62Q, 62T, or 62U, or any other law or rule that applies to entities licensed under these chapters.\n(b) Each initiative shall establish health outcomes to be achieved through the programs and performance measurements in order to determine whether these outcomes have been met. The outcomes must include, but are not limited to:\n(1) a reduction in uncompensated care provided by providers participating in the community-based health network;\n(2) an increase in the delivery of preventive health care services; and\n(3) health improvement for enrollees with chronic health conditions through the management of these conditions.\nIn establishing performance measurements, the initiative shall use measures that are consistent with measures published by nonprofit Minnesota or national organizations that produce and disseminate health care quality measures.\n(c) Any program established under this section shall not constitute a financial liability for the state, in that any financial risk involved in the operation or termination of the program shall be borne by the community-based initiative and the participating health care providers.\n[Repealed by amendment, 2012 c 247 art 2 s 1]\n(a) For purposes of this section, the following definitions apply:\n(b) \"Community-based\" means located in or primarily relating to the community, as determined by the board of a community-based health initiative that is served by the community-based health care coverage program.\n(c) \"Community-based health care coverage program\" or \"program\" means a program administered by a community-based health initiative that provides health care services through provider members of a community-based health network or combination of networks to eligible individuals and their dependents who are enrolled in the program.\n(d) \"Community-based health initiative\" or \"initiative\" means a nonprofit corporation that is governed by a board that has at least 80 percent of its members residing in the community and includes representatives of the participating network providers and employers, or a county-based purchasing organization as defined in section 256B.692.\n(e) \"Community-based health network\" means a contract-based network of health care providers organized by the community-based health initiative to provide or support the delivery of health care services to enrollees of the community-based health care coverage program on a risk-sharing or nonrisk-sharing basis.\n(f) \"Dependent\" means an eligible employee's spouse or child who is under the age of 26 years.\n(a) Prior to the operation of a community-based health care coverage program, a community-based health initiative, defined in subdivision 2, paragraph (d), shall submit to the commissioner of health for approval the community-based health care coverage program developed by the initiative. The commissioner shall ensure that each program meets the requirements described in this section and is actuarially sound based on a review of appropriate records and methods utilized by the community-based health initiative in establishing premium rates for the community-based health care coverage programs.\n(b) Prior to approval, the commissioner shall also ensure that:\n(1) the benefits offered comply with subdivision 8 and that there are adequate numbers of health care providers participating in the community-based health network to deliver the benefits offered under the program;\n(2) the activities of the program are limited to activities that are exempt under this section or otherwise from regulation by the commissioner of commerce;\n(3) the complaint resolution process meets the requirements of subdivision 10; and\n(4) the data privacy policies and procedures comply with state and federal law.\nThe initiative shall establish and operate upon approval by the commissioner of health community-based health care coverage programs. The operational structure established by the initiative shall include, but is not limited to:\n(1) establishing a process for enrolling eligible individuals and their dependents;\n(2) collecting and coordinating premiums from enrollees and employers of enrollees;\n(3) providing payment to participating providers;\n(4) establishing a benefit set according to subdivision 8 and establishing premium rates and cost-sharing requirements;\n(5) creating incentives to encourage primary care and wellness services; and\n(6) initiating disease management services, as appropriate.\nTo be eligible for the community-based health care coverage program, an individual must:\n(1) reside in or work within the designated community-based geographic area served by the program;\n(2) be employed by a qualifying employer, be an employee's dependent, or be self-employed on a full-time basis;\n(3) not be enrolled in or have currently available health coverage, except for catastrophic health care coverage; and\n(4) not be eligible for or enrolled in medical assistance, and not be enrolled in MinnesotaCare or Medicare.\n(a) To qualify for participation in the community-based health care coverage program, an employer must:\n(1) employ at least one but no more than 50 employees at the time of initial enrollment in the program;\n(2) pay its employees a median wage that equals 350 percent of the federal poverty guidelines or less for an individual; and\n(3) not have offered employer-subsidized health coverage to its employees for at least 12 months prior to the initial enrollment in the program. For purposes of this section, \"employer-subsidized health coverage\" means health care coverage for which the employer pays at least 50 percent of the cost of coverage for the employee.\n(b) To participate in the program, a qualifying employer agrees to:\n(1) offer health care coverage through the program to all eligible employees and their dependents regardless of health status;\n(2) participate in the program for an initial term of at least one year;\n(3) pay a percentage of the premium established by the initiative for the employee; and\n(4) provide the initiative with any employee information deemed necessary by the initiative to determine eligibility and premium payments.\nAny health care provider participating in the community-based health network must accept as payment in full the payment rate established by the initiatives and may not charge to or collect from an enrollee any amount in access of this amount for any service covered under the program.\n(a) The initiatives shall establish the health care benefits offered through the community-based health care coverage programs. The benefits established shall include, at a minimum:\n(1) child health supervision services up to age 18, as defined under section 62A.047; and\n(2) preventive services, including:\n(i) health education and wellness services;\n(ii) health supervision, evaluation, and follow-up;\n(iii) immunizations; and\n(iv) early disease detection.\n(b) Coverage of health care services offered by the program may be limited to participating health care providers or health networks. All services covered under the programs must be services that are offered within the scope of practice of the participating health care providers.\n(c) The initiatives may establish cost-sharing requirements. Any co-payment or deductible provisions established may not discriminate on the basis of age, sex, race, disability, economic status, or length of enrollment in the programs.\n(d) If any of the initiatives amends or alters the benefits offered through the program from the initial offering, that initiative must notify the commissioner of health and all enrollees of the benefit change.\n(a) The initiatives must provide an individual or family who enrolls in the program a clear and concise written statement that includes the following information:\n(1) health care services that are covered under the program;\n(2) any exclusions or limitations on the health care services covered, including any cost-sharing arrangements or prior authorization requirements;\n(3) a list of where the health care services can be obtained and that all health care services must be provided by or through a participating health care provider or community-based health network;\n(4) a description of the program's complaint resolution process, including how to submit a complaint; how to file a complaint with the commissioner of health; and how to obtain an external review of any adverse decisions as provided under subdivision 10;\n(5) the conditions under which the program or coverage under the program may be canceled or terminated; and\n(6) a precise statement specifying that this program is not an insurance product and, as such, is exempt from state regulation of insurance products.\n(b) The commissioner of health must approve a copy of the written statement prior to the operation of the program.\n(a) The initiatives must establish a complaint resolution process. The process must make reasonable efforts to resolve complaints and to inform complainants in writing of the initiative's decision within 60 days of receiving the complaint. Any decision that is adverse to the enrollee shall include a description of the right to an external review as provided in paragraph (c) and how to exercise this right.\n(b) The initiatives must report any complaint that is not resolved within 60 days to the commissioner of health.\n(c) The initiatives must include in the complaint resolution process the ability of an enrollee to pursue the external review process provided under section 62Q.73 with any decision rendered under this external review process binding on the initiatives.\nThe initiatives shall establish data privacy policies and procedures for the program that comply with state and federal data privacy laws.\n(a) The initiatives may limit enrollment in the program. If enrollment is limited, a waiting list must be established.\n(b) The initiatives shall not restrict or deny enrollment in the program except for nonpayment of premiums, fraud or misrepresentation, or as otherwise permitted under this section.\n(c) The initiatives may require a certain percentage of participation from eligible employees of a qualifying employer before coverage can be offered through the program.\nEach initiative shall submit an annual status report to the commissioner of health on January 15 of each year, with the first report due January 15, 2008. Each status report shall include:\n(1) the financial status of the program, including the premium rates, cost per member per month, claims paid out, premiums received, and administrative expenses;\n(2) a description of the health care benefits offered and the services utilized;\n(3) the number of employers participating, the number of employees and dependents covered under the program, and the number of health care providers participating;\n(4) a description of the health outcomes to be achieved by the program and a status report on the performance measurements to be used and collected; and\n(5) any other information requested by the commissioner of health or commerce or the legislature.\n[Repealed by amendment, 2012 c 247 art 2 s 1]",
	"repealed": false
}