{
	"id": "116R.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/116R.11",
	"title": "116R.11 AIRCRAFT FACILITIES FUNDS AND DEBT SERVICE ACCOUNTS.",
	"text": "The commissioner or any trustee appointed by the commissioner under sections 116R.01 to 116R.15 shall establish and maintain an aircraft facilities fund for the project described in section 116R.02, subdivision 5. Except for amounts required by the commissioner to be deposited in a debt service account, proceeds of each issue of bonds authorized under section 116R.02, subdivision 1, must be deposited in a separate account, debt service reserve, or other account designated by the commissioner. Money in the account is appropriated to the commissioner. The commissioner or the owner of the project described in section 116R.02, subdivision 5, may withdraw proceeds of bonds for application to the appropriated purposes in the manner provided by order of the commissioner or in any indenture authorized by order of the commissioner. The commissioner may establish whatever accounts might be necessary to carry out sections 116R.01 to 116R.15. All deposits into and disbursements from accounts for the purposes and from the sources of revenue authorized by sections 116R.01 to 116R.15 and provided in an order of the commissioner or an indenture or other agreement authorized by the commissioner are appropriated for that purpose.\nThe commissioner of management and budget or any trustee appointed by the commissioner under sections 116R.01 to 116R.15 shall maintain permanently on official books and records debt service accounts separate from all other funds and accounts, to record all receipts and disbursements of money for principal and interest payments on each series of bonds. No later than the due date of each principal and interest payment on the bonds, the commissioner shall withdraw from the proceeds of the bonds, or from revenues on hand and available for the purpose, and shall deposit in the debt service accounts the amount, if any, required to be deposited in the account by the order of the commissioner or any indenture authorized by an order of the commissioner. All amounts in any debt service account are appropriated for the payment of principal, premiums, and interest for the bonds to which the account relates. If the Minnesota Constitution, article XI, section 7, applies to any series of bonds, amounts in the debt service account and any debt service reserve account established under section 116R.13 for the bonds, regardless of who holds or invests the amounts, must be special accounts of the state bond fund, for which the commissioner of management and budget shall maintain records. Amounts in the accounts must reduce any levy otherwise required by the Minnesota Constitution for payment of principal or interest on the bonds.",
	"repealed": false
}