{
	"id": "31.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.01",
	"title": "31.01 DEFINITIONS.",
	"text": "Unless the language or context clearly indicates that a different meaning is intended, the words, terms, and phrases defined in this section shall for the purposes of this chapter, have the meanings given to them.\n\"Person\" has the meaning given in section 34A.01, subdivision 10.\n\"Food\" has the meaning given in section 34A.01, subdivision 4.\n\"Sell\" and \"sale\" have the meanings given in section 34A.01, subdivision 12.\n[Repealed, 1974 c 84 s 38]\n[Renumbered 32.55, subd 2]\n[Renumbered 32.55, subd 3]\n[Renumbered 32.55, subd 4]\n[Renumbered 32.55, subd 5]\n[Renumbered 32.55, subd 6]\n[Renumbered 32.55, subd 7]\n[Renumbered 32.55, subd 8]\n[Renumbered 32.55, subd 9]\n[Renumbered 32.55, subd 10]\n[Renumbered 32.55, subd 11]\n[Renumbered 32.55, subd 12]\n[Renumbered 32.55, subd 13]\n\"Commissioner\" means the commissioner of the Department of Agriculture.\n[Repealed, 1974 c 84 s 38]\n\"Consumer commodity,\" except as otherwise specifically provided by this subdivision, means any food as defined in subdivision 3 or by the federal act. Such term does not include:\n(1) any tobacco or tobacco product;\n(2) any commodity subject to packaging or labeling requirements imposed under chapter 24;\n(3) any drug subject to the provisions of sections 151.34 to 151.40;\n(4) any beverage subject to the provisions of chapter 340A; or\n(5) any commodity subject to the provisions of chapter 21.\n\"Label\" has the meaning given in section 34A.01, subdivision 6.\n\"Principal display panel\" means that part of a label that is most likely to be displayed, presented, shown, or examined under normal and customary conditions of display for retail sale.\n\"Immediate container\" does not include package liners.\n\"Package\" means any container or wrapping in which any consumer commodity is enclosed for use in the delivery or display of that consumer commodity to retail purchases, but does not include:\n(1) shipping containers or wrappings used solely for the transportation of any consumer commodity in bulk or in quantity to manufacturers, packers, or processors, or to wholesale or retail distributors thereof; or\n(2) shipping containers or outer wrappings used by retailers to ship or deliver any commodity to retail customers if such containers and wrappings bear no printed matter pertaining to any particular commodity.\n\"Labeling\" has the meaning given in section 34A.01, subdivision 7.\n\"Advertisement\" means all representations disseminated in any manner or by any means, other than by labeling, for the purpose of inducing, or which are likely to induce, directly or indirectly, the purchase of food.\n\"Contaminated with filth\" applies to any food not securely protected from dust, dirt and, as far as may be necessary by all reasonable means, from all foreign or injurious contaminations.\n\"Pesticide\" has the meaning given in section 18B.01, subdivision 18.\n\"Raw agricultural commodity\" means any food in its raw or natural state, including all fruits that are washed, colored, or otherwise treated in their unpeeled natural form prior to marketing.\n\"Food additive\" means any substance the intended use of which results or may be reasonably expected to result, directly or indirectly, in its becoming a component or otherwise affecting the characteristics of any food; including any substance intended for use in producing, manufacturing, packing, processing, preparing, treating, packaging, transporting, or holding food; and including any source of radiation intended for any such use; if such substance is not generally recognized, among experts qualified by scientific training and experience to evaluate its safety, as having been adequately shown through scientific procedures, or in the case of a substance used in a food prior to January 1, 1958, through either scientific procedures or experience based on common use in food, to be safe under the conditions of its intended use; except that such term does not include:\n(1) a pesticide chemical in or on a raw agricultural commodity;\n(2) a pesticide chemical to the extent that it is intended for use or is used in the production, storage, or transportation of any raw agricultural commodity;\n(3) a color additive; or\n(4) any substance used in accordance with a sanction or approval granted prior to the enactment of the food additives amendment of 1958, pursuant to the federal act; the Poultry Products Inspection Act (United States Code, title 21, section 451 et seq.) of the Meat Inspection Act of March 4, 1907 (Statutes at Large, volume 34, page 1260), as amended and extended (United States Code, title 21, section 71 et seq.).\n\"Color additive\" means a material which\n(1) is a dye, pigment, or other substance made by a process of synthesis or similar artifice, or extracted, isolated, or otherwise derived, with or without intermediate or final change of identity, from the vegetable, animal, mineral, or other source, and\n(2) when added or applied to a food is capable, alone or through reaction with other substance, of imparting color thereto; except that such term does not include any material which has been or hereafter is exempted under the federal act.\n\"Color\" includes black, white and intermediate grays. Nothing in this subdivision shall be construed to apply to any pesticide chemical, soil or plant nutrient, or other agricultural chemical solely because of its effect in aiding, retarding, or otherwise affecting, directly or indirectly, the growth or other natural physiological process of produce of the soil and thereby affecting its color, whether before or after harvest.\n\"Federal act\" means the Federal Food, Drug, and Cosmetic Act, as amended (United States Code, title 21, section 301 et seq.).",
	"repealed": false
}