{
	"id": "148E.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.055",
	"title": "148E.055 LICENSE REQUIREMENTS.",
	"text": "In order to practice social work, as defined in section 148E.010, subdivisions 6 and 11, an individual must have a social work license under this section or section 148E.060, except when the individual is exempt from licensure according to section 148E.065.\nTo be licensed as a licensed social worker, an applicant for licensure by examination must provide evidence satisfactory to the board that the applicant:\n(1) has received a baccalaureate degree in social work from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates;\n(2) has passed the bachelor's or equivalent examination administered by the Association of Social Work Boards or a similar examination body that the board designates. An examination is not valid if the applicant took and passed the examination eight or more years prior to submitting an application for licensure under this section. An applicant must take the examination no more than six months prior to completing degree requirements;\n(3) has submitted a completed, signed application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(4) has completed the criminal background check according to section 214.075 and paid the required fees;\n(5) has paid all applicable fees specified in section 148E.180; and\n(6) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270.\n(a) To be licensed as a licensed social worker, an applicant for licensure by endorsement must provide evidence satisfactory to the board that the applicant:\n(1) holds an active license or credential as a baccalaureate-level social worker in another jurisdiction;\n(2) holds a bachelor's degree from an accredited college or university;\n(3) has submitted a completed, signed application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(4) has completed the criminal background check according to section 214.075 and paid the required fees;\n(5) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270; and\n(6) has paid all applicable fees specified in section 148E.180.\n(b) An individual licensed under this subdivision is not required to meet the supervised practice requirements in section 148E.100 provided that the applicant has practiced baccalaureate-level social work in another jurisdiction for at least 4,000 hours while actively licensed or credentialed as a baccalaureate-level social worker during the four years immediately preceding the applicant's submission of an application under this subdivision.\nTo be licensed as a licensed social worker, an applicant for licensure by completion of provisional license requirements must provide evidence satisfactory to the board that the applicant:\n(1) completed all requirements under section 148E.0551, subdivisions 1 to 6; and\n(2) continues to meet the requirements of subdivision 2, clauses (1) and (3) to (6).\nTo be licensed as a licensed graduate social worker, an applicant for licensure by examination must provide evidence satisfactory to the board that the applicant:\n(1) has received a graduate degree in social work from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates, or a doctorate in social work from an accredited university;\n(2) has passed the master's or equivalent examination administered by the Association of Social Work Boards or a similar examination body that the board designates. An examination is not valid if the applicant took and passed the examination eight or more years prior to submitting an application for licensure under this section. The applicant must take the examination no more than six months prior to completing degree requirements;\n(3) has submitted a completed, signed application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(4) has completed the criminal background check according to section 214.075 and paid the required fees;\n(5) has paid all applicable fees specified in section 148E.180; and\n(6) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270.\n(a) To be licensed as a licensed graduate social worker, an applicant for licensure by endorsement must provide evidence satisfactory to the board that the applicant:\n(1) holds an active license or credential as a graduate or master's level social worker in another jurisdiction;\n(2) holds a master's degree from an accredited college or university;\n(3) has submitted a completed, signed application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(4) has completed the criminal background check according to section 214.075 and paid the required fees;\n(5) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270; and\n(6) has paid all applicable fees specified in section 148E.180.\n(b) An individual licensed under this subdivision is not required to meet the supervised practice requirements in section 148E.105 provided that the applicant has practiced nonclinical graduate or master's level social work in another jurisdiction for at least 4,000 hours while actively licensed or credentialed as a graduate or master's level social worker during the four years immediately preceding submission of an application under this subdivision.\n(c) An individual licensed under this subdivision engaged in clinical social work practice must comply with the supervised practice requirements in section 148E.106.\nTo be licensed as a licensed graduate social worker, an applicant for licensure by completion of provisional license requirements must provide evidence satisfactory to the board that the applicant:\n(1) completed all requirements under section 148E.0551, subdivisions 1 to 6; and\n(2) continues to meet the requirements of subdivision 3, clauses (1) and (3) to (6).\nTo be licensed as a licensed independent social worker, an applicant for licensure by examination must provide evidence satisfactory to the board that the applicant:\n(1) has received a graduate degree in social work from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates, or a doctorate in social work from an accredited university;\n(2) has practiced social work as defined in section 148E.010, and has met the supervised practice requirements specified in sections 148E.100 to 148E.125;\n(3) has passed the advanced generalist or equivalent examination administered by the Association of Social Work Boards or a similar examination body that the board designates. An examination is not valid if the applicant took and passed the examination eight or more years prior to submitting an application for licensure under this section;\n(4) has submitted a completed, signed application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(5) has completed the criminal background check according to section 214.075 and paid the required fees;\n(6) has paid all applicable fees specified in section 148E.180; and\n(7) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270.\n(a) To be licensed as a licensed independent social worker, an applicant for licensure by endorsement must provide evidence satisfactory to the board that the applicant:\n(1) holds an active license or credential as an advanced practice graduate or master's level social worker in another jurisdiction;\n(2) holds a master's degree from an accredited college or university;\n(3) has submitted a completed, signed application form that the board provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(4) has completed the criminal background check according to section 214.075 and paid the required fees;\n(5) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270; and\n(6) has paid all applicable fees specified in section 148E.180.\n(b) An individual licensed under this subdivision engaged in clinical social work practice must comply with the supervised practice requirements in section 148E.110.\nTo be licensed as a licensed independent social worker, an applicant for licensure by completion of provisional license requirements must provide evidence satisfactory to the board that the applicant:\n(1) completed all requirements under section 148E.0551, subdivisions 1 to 6; and\n(2) continues to meet the requirements of subdivision 4, clauses (1), (2), and (4) to (7).\n(a) To be licensed as a licensed independent clinical social worker, an applicant for licensure by examination must provide evidence satisfactory to the board that the applicant:\n(1) has received a graduate degree in social work from a program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates, or a doctorate in social work from an accredited university;\n(2) has completed 360 clock hours (one semester credit hour = 15 clock hours) in the following clinical knowledge areas:\n(i) 108 clock hours (30 percent) in differential diagnosis and biopsychosocial assessment, including normative development and psychopathology across the life span;\n(ii) 36 clock hours (ten percent) in assessment-based clinical treatment planning with measurable goals;\n(iii) 108 clock hours (30 percent) in clinical intervention methods informed by research and current standards of practice;\n(iv) 18 clock hours (five percent) in evaluation methodologies;\n(v) 72 clock hours (20 percent) in social work values and ethics, including cultural context, diversity, and social policy; and\n(vi) 18 clock hours (five percent) in culturally specific clinical assessment and intervention;\n(3) has practiced clinical social work as defined in section 148E.010, including both diagnosis and treatment, and has met the supervised practice requirements specified in sections 148E.100 to 148E.125;\n(4) has passed the clinical or equivalent examination administered by the Association of Social Work Boards or a similar examination body that the board designates. An examination is not valid if the applicant took and passed the examination eight or more years prior to submitting an application for licensure under this section;\n(5) has submitted a completed, signed application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(6) has completed the criminal background check according to section 214.075 and paid the required fees;\n(7) has paid all applicable license fees specified in section 148E.180; and\n(8) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270.\n(b) The requirement in paragraph (a), clause (2), may be satisfied through:\n(1) a graduate degree program accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accreditation body that the board designates; or a doctorate in social work from an accredited university. An academic institution must certify clinical clock hours in the clinical knowledge areas on a form that the board has provided to meet this requirement;\n(2) graduate coursework from an accredited institution of higher learning. An academic institution must certify clinical clock hours in the clinical knowledge areas on a form that the board has provided to meet this requirement; or\n(3) up to 120 continuing education hours, which the applicant may complete via continuing education independent learning as defined in section 148E.010, subdivision 7d. The applicant must include documents verifying completion of clinical clock hours in the clinical knowledge areas to meet this requirement as specified in section 148E.130, subdivision 11.\nTo be licensed as a licensed independent clinical social worker, an applicant for licensure by endorsement must provide evidence satisfactory to the board that the applicant:\n(1) holds an active license or credential as an independent clinical level social worker in another jurisdiction;\n(2) holds a master's degree from an accredited college or university;\n(3) has submitted a completed, signed application form that the board has provided. For electronic applications, a \"signed application\" means providing an attestation that the board has specified;\n(4) has completed the criminal background check according to section 214.075 and paid the required fees;\n(5) has not engaged in conduct that was or would be in violation of the standards of practice specified in sections 148E.195 to 148E.240. If the applicant has engaged in conduct that was or would be in violation of the standards of practice, the board may take action according to sections 148E.255 to 148E.270; and\n(6) has paid all applicable fees specified in section 148E.180.\nTo be licensed as a licensed independent clinical social worker, an applicant for licensure by completion of provisional license requirements must provide evidence satisfactory to the board that the applicant:\n(1) completed all requirements under section 148E.0551, subdivisions 1 to 6; and\n(2) continues to meet the requirements of subdivision 5, paragraph (a), clauses (1) to (3) and (5) to (8).\nIf an applicant receives a degree from a program outside the United States or Canada that is not accredited by the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar examination body designated by the board, the degree does not fulfill the requirements specified in subdivision 2, clause (1); 3, clause (1); 4, clause (1); or 5, paragraph (a), clause (1), unless the Council on Social Work Education or a similar accreditation body designated by the board has determined through the council's international equivalency determination service that the degree earned is equivalent to the degree required.\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nMS 2018 [Repealed, 2020 c 79 art 3 s 50]\nAn application that is not completed and signed, or that is not accompanied by the correct fee, is void and the board must return it to the applicant, along with any fee submitted.\nBy applying for licensure, an applicant authorizes the board to investigate and request additional information to verify completion of all license qualifications.\n(a) Within one year of the date that the board receives an application for licensure under this section, the applicant must meet all the requirements for licensure and provide all of the information that the board has requested, or the application must be closed.\n(b) If an applicant graduated from a program in candidacy status with the Council on Social Work Education, the Canadian Association of Schools of Social Work, or a similar accrediting body that the board designates, the applicant must meet all of the requirements for licensure and provide all of the information requested within one year of the date that the board receives an application for licensure under this section or within 30 days of the date the program is approved or denied accreditation, whichever is later, or the application must be closed.\nAn initial license is effective on the day that the board receives the applicable license fee from an applicant approved for licensure.\nAn initial license expires on the last day of the licensee's birth month in the second calendar year following the effective date of the initial license.\n(a) A licensee who changes from a licensed social worker to a licensed graduate social worker, or from a licensed graduate social worker to a licensed independent social worker, or from a licensed graduate social worker or licensed independent social worker to a licensed independent clinical social worker, must pay the prorated share of the fee for the new license.\n(b) The new license is effective on the day that the board receives the applicable license fee from an applicant approved for the new license.\n(c) The new license expires on the same expiration date as the license previously held by the licensee prior to the change in the license.",
	"repealed": false
}