{
	"id": "356.303",
	"url": "https://www.revisor.mn.gov/statutes/cite/356.303",
	"title": "356.303 SURVIVOR BENEFIT WITH COMBINED SERVICE.",
	"text": "(a) The terms used in this section are defined in this subdivision.\n(b) \"Average salary\" means the highest average of covered salary for the appropriate period of credited service that is required for the calculation of a survivor annuity or a survivor benefit, whichever applies, by the covered retirement plan and that is drawn from any period of credited service and covered salary in a covered retirement plan.\n(c) \"Covered retirement plan\" or \"plan\" means a retirement plan enumerated in subdivision 4.\n(d) \"Deceased member\" means a person who on the date of death was an active member of a covered retirement plan and who has reached the minimum age, if any, that is required by the covered retirement plan as part of qualifying for a survivor annuity or survivor benefit.\n(e) \"Surviving child\" means a child of a deceased member (1) who is unmarried; (2) who has not reached age 18, or, if a full-time student, who has not reached a higher age as specified by the applicable covered retirement plan; and (3) if specified by that plan, who was actually dependent on the deceased member for a specified proportion of support before the deceased member's death. \"Surviving child\" includes a natural child, an adopted child, or a child of a deceased member who is conceived during the member's lifetime and who is born after the member's death.\n(f) \"Surviving spouse\" means the legally married spouse of the deceased member who was residing with the deceased member on the date of death and who, if specified by the applicable covered retirement plan, had been married to the deceased member for a specified period of time before the death of the deceased member.\n(g) \"Survivor annuity\" means the entitlement to a future amount payable to a survivor as the remainder interest of an optional annuity form implied by law as having been chosen by a deceased member before the date of death and effective on the date of death or provided automatically.\n(h) \"Survivor benefit\" means an entitlement to a future amount payable to a survivor that is not included in the definition of a survivor annuity.\nNotwithstanding any provision of law to the contrary governing a covered retirement plan, a person who is the survivor of a deceased member of a covered retirement plan may receive a combined service survivor benefit from each covered retirement plan in which the deceased member had credit for at least one-half year of allowable service if the deceased member:\n(1) had credit for sufficient allowable service in any combination of covered retirement plans to meet the minimum allowable service credit requirement of the applicable covered retirement fund with the longest allowable service credit requirement for qualification for a survivor benefit or annuity;\n(2) had credit for at least one-half year of allowable service with the most recent covered retirement plan before the date of death and was an active member of that covered retirement plan on the date of death; and\n(3) was not receiving a retirement annuity from any covered retirement plan on the date of death.\n(a) The combined service survivor annuity or survivor benefit from each covered retirement plan must be based on the allowable service in each covered retirement plan, except as provided by paragraphs (b) to (f).\n(b) The survivor annuity or survivor benefit must be governed by the law in effect for each covered retirement plan on the date of the death of the deceased member.\n(c) All plans must base the survivor annuity or survivor benefit on the same average salary figure if the annuity or benefit is salary related.\n(d) If the method of the covered retirement plan used to compute a survivor benefit or annuity varies based on the length of allowable service credit, the benefit accrual formula percentages used by the plan must recognize the allowable service credit in the plan as a continuation of any previous allowable service credit with other covered retirement plans.\n(e) If the covered retirement plan is a defined benefit or formula plan and the method used to compute a survivor benefit or annuity does not vary based on the length of allowable service credit, the portion of the specified benefit or annuity amount from the covered retirement plan must bear the same proportion to the total specified benefit or annuity amount as the allowable service credit in that plan bears to the total allowable service credit in all covered retirement plans. If the covered retirement plan is a defined contribution or nonformula plan, the survivor benefit amount for allowable service under the plan is not affected, but the service and covered salary under the plan must be used in calculations by other covered retirement plans.\n(f) A period for which a deceased member had allowable service credit in more than one covered retirement plan must be used only once in determining the total allowable service credit for calculating the combined service survivor annuity or survivor benefit. A period of duplicated service credit must be handled as provided in section 356.30, subdivision 1, paragraphs (g) and (h).\n(g) If a person is entitled to a minimum benefit payable from a public pension plan named in section 356.30, subdivision 3, the person may receive additional credit for only those years of service in another covered pension plan that, when added to the years of service in the pension plan that is paying the minimum benefit, exceed the years of service on which the minimum benefit is based.\nThis section applies to the following retirement plans:\n(1) the legislators retirement plan, established by chapter 3A;\n(2) the general state employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(3) the correctional state employees retirement plan of the Minnesota State Retirement System, established by chapter 352;\n(4) the State Patrol retirement plan, established by chapter 352B;\n(5) the elective state officers retirement plan, established by chapter 352C;\n(6) the unclassified state employees retirement program, established by chapter 352D;\n(7) the general employees retirement plan of the Public Employees Retirement Association, established by chapter 353;\n(8) the public employees police and fire plan of the Public Employees Retirement Association, established by chapter 353;\n(9) the local government correctional service retirement plan of the Public Employees Retirement Association, established by chapter 353E;\n(10) the Teachers Retirement Association, established by chapter 354;\n(11) the St. Paul Teachers Retirement Fund Association, established by chapter 354A; and\n(12) the judges retirement fund, established by chapter 490.",
	"repealed": false
}