{
	"id": "256B.0946",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0946",
	"title": "256B.0946 CHILDREN'S INTENSIVE BEHAVIORAL HEALTH SERVICES.",
	"text": "(a) Subject to federal approval, medical assistance covers medically necessary intensive behavioral health treatment services when the services are provided by a provider entity certified under and meeting the standards in this section. The provider entity must make reasonable and good faith efforts to report individual client outcomes to the commissioner, using instruments and protocols approved by the commissioner.\n(b) Intensive behavioral health treatment services to children with mental illness residing in foster family settings or with legal guardians that comprise specific required service components provided in clauses (1) to (6) are reimbursed by medical assistance when they meet the following standards:\n(1) psychotherapy provided by a mental health professional or a clinical trainee;\n(2) crisis planning;\n(3) individual, family, and group psychoeducation services provided by a mental health professional or a clinical trainee;\n(4) clinical care consultation provided by a mental health professional or a clinical trainee;\n(5) individual treatment plan development as defined in section 245I.10, subdivisions 7 and 8; and\n(6) service delivery payment requirements as provided under subdivision 4.\nFor the purposes of this section, the following terms have the meanings given them.\n(a) \"At risk\" means the child has experienced severe difficulty in managing mental health and behavior in multiple settings, has received a diagnosis of mental illness within the past 180 days, and meets one of the following criteria:\n(1) has previously been in a residential or inpatient mental health treatment program, including a program licensed under Minnesota Rules, chapter 2960, for mental health issues within the past six months;\n(2) has a history of threatening harm to self or others and has actively engaged in self-harming or threatening behavior in the past 30 days;\n(3) has experienced interventions from mental health service programs, social services, mobile crisis programs, or law enforcement, or experienced the use of seclusion and restraints in school, to maintain safety in the child's home, community, or school within the past 60 days; or\n(4) has a history of repeated intervention from mental health programs, social services, mobile crisis programs, or law enforcement to maintain safety in the child's home, community, or school within the past 60 days.\n(b) \"Clinical care consultation\" means communication from a treating clinician to other providers working with the same client to inform, inquire, and instruct regarding the client's symptoms, strategies for effective engagement, care and intervention needs, and treatment expectations across service settings, including but not limited to the client's school, social services, day care, probation, home, primary care, medication prescribers, disabilities services, and other mental health providers and to direct and coordinate clinical service components provided to the client and family.\n(c) \"Clinical trainee\" means a staff person who is qualified according to section 245I.04, subdivision 6.\n(d) \"Crisis planning\" has the meaning given in section 245.4871, subdivision 9a.\n(e) \"Culturally appropriate\" means providing mental health services in a manner that incorporates the child's cultural influences into interventions as a way to maximize resiliency factors and utilize cultural strengths and resources to promote overall wellness.\n(f) \"Culture\" means the distinct ways of living and understanding the world that are used by a group of people and are transmitted from one generation to another or adopted by an individual.\n(g) \"Standard diagnostic assessment\" means the assessment described in section 245I.10, subdivision 6.\n(h) \"Family\" means a person who is identified by the client or the client's parent or guardian as being important to the client's mental health treatment. Family may include, but is not limited to, parents, foster parents, children, spouse, committed partners, former spouses, persons related by blood or adoption, persons who are a part of the client's permanency plan, or persons who are presently residing together as a family unit.\n(i) \"Foster care\" has the meaning given in section 260C.007, subdivision 18.\n(j) \"Foster family setting\" means the foster home in which the license holder resides.\n(k) \"Individual treatment plan\" means the plan described in section 245I.10, subdivisions 7 and 8.\n(l) \"Mental health certified family peer specialist\" means a staff person who is qualified according to section 245I.04, subdivision 12.\n(m) \"Mental health professional\" means a staff person who is qualified according to section 245I.04, subdivision 2.\n(n) \"Mental illness\" has the meaning given in section 245I.02, subdivision 29.\n(o) \"Parent\" has the meaning given in section 260C.007, subdivision 25.\n(p) \"Psychoeducation services\" means information or demonstration provided to an individual, family, or group to explain, educate, and support the individual, family, or group in understanding a child's symptoms of mental illness, the impact on the child's development, and needed components of treatment and skill development so that the individual, family, or group can help the child to prevent relapse, prevent the acquisition of comorbid disorders, and achieve optimal mental health and long-term resilience.\n(q) \"Psychotherapy\" means the treatment described in section 256B.0671, subdivision 11.\n(r) \"Team consultation and treatment planning\" means the coordination of treatment plans and consultation among providers in a group concerning the treatment needs of the child, including disseminating the child's treatment service schedule to all members of the service team. Team members must include all mental health professionals working with the child, a parent, the child unless the team lead or parent deem it clinically inappropriate, and at least two of the following: an individualized education program case manager; probation agent; children's mental health case manager; child welfare worker, including adoption or guardianship worker; primary care provider; foster parent; and any other member of the child's service team.\n(s) \"Trauma\" has the meaning given in section 245I.02, subdivision 38.\n(t) \"Treatment supervision\" means the supervision described under section 245I.06.\nAn eligible recipient is an individual, from birth through age 20, who is currently placed in a foster home licensed under Minnesota Rules, parts 2960.3000 to 2960.3340, or placed in a foster home licensed under the regulations established by a federally recognized Minnesota Tribe, or who is residing in the legal guardian's home and is at risk, and has received: (1) a standard diagnostic assessment within 180 days before the start of service that documents that intensive behavioral health treatment services are medically necessary to ameliorate identified symptoms and functional impairments; and (2) a level of care assessment as defined in section 245I.02, subdivision 19, that demonstrates that the individual requires intensive intervention without 24-hour medical monitoring, and a functional assessment as defined in section 245I.02, subdivision 17. The level of care assessment and the functional assessment must include information gathered from the placing county, Tribe, or case manager.\n(a) Eligible providers for children's intensive behavioral health services must be certified by the state and must be able to demonstrate the ability to provide all of the services required in this section and meet the standards in chapter 245I, as required in section 245I.011, subdivision 5.\n(b) For purposes of this section, a provider agency must be:\n(1) a county-operated entity certified by the state;\n(2) an Indian Health Services facility operated by a Tribe or Tribal organization under funding authorized by United States Code, title 25, sections 450f to 450n, or title 3 of the Indian Self-Determination Act, Public Law 93-638, section 638 (facilities or providers); or\n(3) a noncounty entity.\n(c) Certified providers that do not meet the service delivery standards required in this section shall be subject to a decertification process.\n(d) For the purposes of this section, all services delivered to a client must be provided by a mental health professional or a clinical trainee.\n(a) To be eligible for payment under this section, a provider must develop and practice written policies and procedures for children's intensive behavioral health services, consistent with subdivision 1, paragraph (b), and comply with the following requirements in paragraphs (b) to (n).\n(b) Each previous and current mental health, school, and physical health treatment provider must be contacted to request documentation of treatment and assessments that the eligible client has received. This information must be reviewed and incorporated into the standard diagnostic assessment and team consultation and treatment planning review process.\n(c) Each client receiving treatment must be assessed for a trauma history, and the client's treatment plan must document how the results of the assessment will be incorporated into treatment.\n(d) The level of care assessment as defined in section 245I.02, subdivision 19, and functional assessment as defined in section 245I.02, subdivision 17, must be updated at least every 180 days or prior to discharge from the service, whichever comes first.\n(e) Each client receiving treatment services must have an individual treatment plan that is reviewed, evaluated, and approved every 180 days using the team consultation and treatment planning process.\n(f) Clinical care consultation must be provided in accordance with the client's individual treatment plan.\n(g) Each client must have a crisis plan within ten days of initiating services and must have access to clinical phone support 24 hours per day, seven days per week, during the course of treatment. The crisis plan must demonstrate coordination with the local or regional mobile crisis intervention team.\n(h) Services must be delivered and documented at least three days per week, equaling at least six hours of treatment per week. If the mental health professional, client, and family agree, service units may be temporarily reduced for a period of no more than 60 days in order to meet the needs of the client and family, or as part of transition or on a discharge plan to another service or level of care. The reasons for service reduction must be identified, documented, and included in the treatment plan. Billing and payment are prohibited for days on which no services are delivered and documented.\n(i) Location of service delivery must be in the client's home, day care setting, school, or other community-based setting that is specified on the client's individualized treatment plan.\n(j) Treatment must be developmentally and culturally appropriate for the client.\n(k) Services must be delivered in continual collaboration and consultation with the client's medical providers and, in particular, with prescribers of psychotropic medications, including those prescribed on an off-label basis. Members of the service team must be aware of the medication regimen and potential side effects.\n(l) Parents, siblings, foster parents, legal guardians, and members of the child's permanency plan must be involved in treatment and service delivery unless otherwise noted in the treatment plan.\n(m) Transition planning for the child must be conducted starting with the first treatment plan and must be addressed throughout treatment to support the child's permanency plan and postdischarge mental health service needs.\n(n) In order for a provider to receive the daily per-client encounter rate, at least one of the services listed in subdivision 1, paragraph (b), clauses (1) to (3), must be provided. The services listed in subdivision 1, paragraph (b), clauses (4) and (5), may be included as part of the daily per-client encounter rate.\nMS 2020 [Repealed, 2021 c 30 art 17 s 113]\n(a) Services in clauses (1) to (7) are not covered under this section and are not eligible for medical assistance payment as components of children's intensive behavioral health services, but may be billed separately:\n(1) inpatient psychiatric hospital treatment;\n(2) mental health targeted case management;\n(3) partial hospitalization;\n(4) medication management;\n(5) children's mental health day treatment services;\n(6) crisis response services under section 256B.0624;\n(7) transportation; and\n(8) mental health certified family peer specialist services under section 256B.0616.\n(b) Children receiving intensive behavioral health services are not eligible for medical assistance reimbursement for the following services while receiving children's intensive behavioral health services:\n(1) psychotherapy and skills training components of children's therapeutic services and supports under section 256B.0943;\n(2) mental health behavioral aide services as defined in section 256B.0943, subdivision 1, paragraph (l);\n(3) home and community-based waiver services;\n(4) mental health residential treatment; and\n(5) medical assistance room and board rate, as defined in section 256B.056, subdivision 5d.\nThe commissioner shall establish a single daily per-client encounter rate for children's intensive behavioral health services. The rate must be constructed to cover only eligible services delivered to an eligible recipient by an eligible provider, as prescribed in subdivision 1, paragraph (b).",
	"repealed": false
}