{
	"id": "238.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/238.24",
	"title": "238.24 CONDITIONS FOR ACCESS.",
	"text": "An installation of cable communications facilities under sections 238.02, subdivisions 1a, 1c, 1d, 21a, 28a, 29a, 31a, and 31d, and 238.22 to 238.27 must conform to reasonable conditions necessary to protect the safety, functioning, and aesthetic appearance of the premises, and the convenience and well-being of the property owner and residents.\nA property owner may require from a cable communications system before installation or modification of cable communications facilities, diagrams showing plans for the placement and securing of the facilities. A property owner may approve or disapprove installation plans. Approval of plans may not be unreasonably withheld.\nThe facilities must be installed in an expeditious and workmanlike manner, must comply with applicable codes, and must be installed parallel to utility lines when economically feasible. A property owner may require a person operating a cable communications system to post a bond or equivalent security in an amount not exceeding the estimated cost of installation of the cable communications facilities on the premises. Any bond filed by a cable communications system with a municipality that would provide coverage to the property owner as provided under this subdivision fulfills the requirements of this subdivision.\nA person operating a cable communications system shall indemnify a property owner for damage caused by the company in the installation, operation, maintenance, or removal of its facilities.\nA property owner may require a cable communications system, after reasonable written notice, to promptly relocate cable communications facilities on or within the premises of the property owner for the purpose of rehabilitation, redecoration, or necessary maintenance of the premises by the property owner.\nNothing in sections 238.02, subdivisions 1a, 1c, 1d, 21a, 28a, 29a, 31a, and 31d, and 238.22 to 238.27 precludes a property owner from entering into an agreement for use of a master antenna television system by a person operating a cable communications system or other television communications service.\nA cable communications system shall bear the entire cost of the installation, operation, maintenance, and removal of a cable communications facility within the initial franchise service area.\n(a) A cable communications system shall:\n(1) compensate the property owner for the diminution in fair market value of the premises resulting directly from the installation of the nonexclusive cable communications system; and\n(2) reimburse the property owner in an amount not to exceed $100 for premises containing less than ten dwelling units, and $200 for other premises, for actual costs incurred by the property owner with respect to the professional review of the plans and drawings regarding installation or modification of the cable communications system, associated contractual materials, and other documentation.\n(b) With respect to paragraph (a), clause (1), any party appearing in a proceeding as provided under section 238.25 may introduce evidence of damages, if any, and special benefits, if any, to the property occurring by reason of the installation of the cable communications system.\nNothing in sections 238.02, subdivisions 1a, 1c, 1d, 21a, 28a, 29a, 31a, and 31d, and 238.22 to 238.27 affects the validity of an agreement effective before June 15, 1983 between a property owner, a person operating a cable communications system, or any other person providing cable communications services on or within the premises of the property owner.\n(a) A property owner must provide access to a franchised person operating a cable communications system, as required under section 238.23, only if that cable system installs equipment with channel capacity sufficient to provide access to other providers of television programming or cable communications services so that residents or association members have a choice of alternative providers of those services. If the equipment is installed, the cable communications system shall allow alternative providers to use the equipment. If some of the residents or association members choose to subscribe to the services of an alternative provider, the cable system that installed the equipment must be reimbursed by the other providers for the cost of equipment and installation on the property on a pro rata basis that reflects the number of subscribers of each provider on that property to the total number of subscribers on that property. In determining the pro rata amount of reimbursement by any alternative provider, the cost of equipment and installation must be reduced to the extent of cumulative depreciation of that equipment at the time the alternative provider begins providing service.\n(b) If equipment is already installed as of June 15, 1983, with channel capacity sufficient to allow access to alternative providers, the access and pro rata reimbursement provisions of paragraph (a) apply.",
	"repealed": false
}