{
	"id": "16C.138",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.138",
	"title": "16C.138 STATE PURCHASING OF ELECTRIC AND PLUG-IN HYBRID ELECTRIC VEHICLES.",
	"text": "(a) As used in this section, \"plug-in hybrid electric vehicle (PHEV)\" means a vehicle containing an internal combustion engine that also allows power to be delivered to the drive wheels by a battery-powered electric motor and that meets applicable federal motor vehicle safety standards. When connected to the electrical grid via an electrical outlet, the vehicle must be able to recharge its battery. The vehicle must have the ability to travel at least 20 miles, powered substantially by electricity.\n(b) As used in this section, \"neighborhood electric vehicle\" means an electrically powered motor vehicle that has four wheels and has a speed attainable in one mile of at least 20 miles per hour but not more than 25 miles per hour on a paved level surface.\n(c) As used in this section, \"electric vehicle\" has the meaning given in section 169.011, subdivision 26a.\nAll solicitation documents for the purchase of a passenger automobile, as defined in section 168.002, subdivision 24; pickup truck, as defined in section 168.002, subdivision 26; or van, as defined in section 168.002, subdivision 40, issued under the jurisdiction of the Department of Administration after June 30, 2006, must contain the following language: \"It is the intention of the state of Minnesota to begin purchasing electric vehicles, plug-in hybrid electric vehicles, neighborhood electric vehicles, and natural gas vehicles if the total life-cycle cost of ownership is less than or comparable to that of gasoline-powered vehicles. It is the intention of the state to purchase electric vehicles, plug-in hybrid electric vehicles, neighborhood electric vehicles, and natural gas vehicles whenever practicable after these conditions have been met and as fleet needs dictate for at least five years after these conditions have been met.\"",
	"repealed": false
}