{
	"id": "325E.0631",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.0631",
	"title": "325E.0631 WARRANTIES.",
	"text": "The requirements of this section apply to all warranty claims submitted by a dealer to a farm equipment manufacturer in which the farm equipment dealer has complied with the reasonable policies and procedures contained in the farm equipment manufacturer's warranty.\nClaims filed for payment under warranty agreements must be approved or disapproved within 30 days of receipt by the farm equipment manufacturer. Unless the farm equipment dealer agrees to a later date, approved claims for payment must be paid within 30 days of their approval. When a claim is disapproved, the farm equipment manufacturer shall notify the dealer within the 30-day period stating the specific grounds on which the disapproval is based. Any claim not specifically disapproved within 30 days of receipt is deemed approved and must be paid within 30 days.\nIf, after termination of a contract, a dealer submits a warranty claim for warranty work performed before the effective date of the termination, the farm equipment manufacturer shall approve or disapprove the claim within 30 days of receipt.\nWarranty work performed by the dealer must be compensated in accordance with the reasonable and customary amount of time required to complete the work, expressed in hours and fractions of hours multiplied by the dealer's established customer hourly retail labor rate, which the dealer shall communicate to the farm equipment manufacturer before performing the warranty work.\nExpenses expressly excluded under the farm equipment manufacturer's warranty to the customer must not be included in claims and are not required to be paid on requests for compensation from the dealer for warranty work performed.\nAll parts used by the dealer in performing warranty work must be paid to the dealer in the amount equal to the dealer's net price for the parts, plus a minimum of 15 percent to reimburse the dealer for reasonable costs of doing business in performing warranty service on the farm equipment manufacturer's behalf, including but not limited to freight and handling costs.\nThe farm equipment manufacturer may adjust for errors discovered during audit, and if necessary, to adjust claims paid in error.\nA dealer may choose to accept alternate reimbursement terms and conditions in lieu of the requirements of subdivisions 2 to 7, provided there is a written dealer agreement between the farm equipment manufacturer and the dealer providing for compensation to the dealer for warranty labor costs either as: (1) a discount in the pricing of the equipment to the dealer; or (2) a lump-sum payment to the dealer. The discount or lump sum must be no less than five percent of the suggested retail price of the equipment. If the requirements of this subdivision are met and alternate terms and conditions are in place, subdivisions 2 to 7 do not apply and the alternate terms and conditions are enforceable.",
	"repealed": false
}