{
	"id": "176.361",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.361",
	"title": "176.361 INTERVENTION.",
	"text": "A person who has an interest in any matter before the Workers' Compensation Court of Appeals, or commissioner, or office such that the person may either gain or lose by an order or decision may intervene in the proceeding by filing a motion in writing stating the facts which show the interest. The commissioner is considered to have an interest and shall be permitted to intervene at the appellate level when a party relies in its claim or defense upon any statute or rule administered by the commissioner, or upon any rule, order, requirement, or agreement issued or made under the statute or rule.\nThe commissioner may adopt rules, not inconsistent with this section to govern intervention. The Workers' Compensation Court of Appeals shall adopt rules to govern the procedure for intervention in matters before it. The office may adopt rules to govern the procedure for intervention in matters before it.\nIf the Department of Human Services or the Department of Employment and Economic Development seeks to intervene in any matter before the division, a compensation judge or the Workers' Compensation Court of Appeals, a nonattorney employee of the department, acting at the direction of the staff of the attorney general, may prepare, sign, serve and file motions for intervention and related documents, attend prehearing conferences, and participate in matters before a compensation judge or the Workers' Compensation Court of Appeals. Any other interested party may intervene using a nonattorney and may participate in any proceeding to the same extent an attorney could. This activity shall not be considered to be the unauthorized practice of law. An intervenor represented by a nonattorney shall be deemed to be represented by an attorney for the purposes of the conclusive presumption of section 176.521, subdivision 2.\nSubdivisions 3 to 6 do not apply to the following proceedings conducted by the Department of Labor and Industry or the office: mediation proceedings; discontinuance conferences under section 176.239; or administrative conferences under section 176.106.\nA person desiring to intervene in a workers' compensation case as a party, including but not limited to a health care provider who has rendered services to an employee or an insurer who has paid benefits under section 176.191, shall submit a timely written motion to intervene to the commissioner, the office, or to the court of appeals, whichever is applicable.\n(a) The motion must be served on all parties, except for other intervenors, either personally, by first class mail, or by registered mail, return receipt requested. A motion to intervene must be served and filed within 60 days after a potential intervenor has been served with notice of a right to intervene or within 30 days of notice of an administrative conference or expedited hearing. Upon the filing of a timely motion to intervene, the potential intervenor shall be granted intervenor status without the need for an order. Objections to the intervention may be subsequently addressed by a compensation judge. Where a motion to intervene is not timely filed under this section, the potential intervenor interest shall be extinguished and the potential intervenor may not collect, or attempt to collect, the extinguished interest from the employee, employer, insurer, or any government program.\n(b) The motion must show how the applicant's legal rights, duties, or privileges may be determined or affected by the case; state the grounds and purposes for which intervention is sought; and indicate the statutory right to intervene. The motion must be accompanied by the following:\n(1) an itemization of disability payments showing the period during which the payments were or are being made; the weekly or monthly rate of the payments; and the amount of reimbursement claimed;\n(2) a summary of the medical or treatment payments, or rehabilitation services provided by the Vocational Rehabilitation Unit, broken down by creditor, showing the total bill submitted, the period of treatment or rehabilitation covered by that bill, the amount of payment on that bill, and to whom the payment was made;\n(3) copies of all medical or treatment bills for which payment is sought;\n(4) copies of the work sheets or other information stating how the payments on medical or treatment bills were calculated;\n(5) a copy of the relevant policy or contract provisions upon which the claim for reimbursement is based;\n(6) the name and telephone number of the person representing the intervenor who has authority to represent the intervenor, including but not limited to the authority to reach a settlement of the issues in dispute;\n(7) proof of service or copy of the registered mail receipt evidencing service on all parties except for other intervenors;\n(8) at the option of the intervenor, a proposed stipulation which states that all of the payments for which reimbursement is claimed are related to the injury or condition in dispute in the case and that, if the petitioner is successful in proving the compensability of the claim, it is agreed that the sum be reimbursed to the intervenor; and\n(9) if represented by an attorney, the name, address, telephone number, and Minnesota Supreme Court license number of the attorney.\nIf the person filing a timely motion to intervene has included a proposed stipulation, all parties shall either execute and return the signed stipulation to the intervenor who must file it with the division or judge or serve upon the intervenor and all other parties and file with the division specific and detailed objections to any services rendered or payments made by the intervenor which are not conceded to be correct and related to the injury or condition the petitioner has asserted is compensable. If a party has not returned the signed stipulation or filed specific and detailed objections within 30 days of service of the motion to intervene, the intervenor's right to reimbursement for the amount sought is deemed established provided that the petitioner's claim is determined to be compensable. The office may establish procedures for filing objections if a timely motion to intervene is filed less than 30 days before a scheduled hearing.\nA person who has submitted a timely written motion to intervene, as required by subdivision 2, is not required to attend settlement or pretrial conferences or the hearing, unless attendance is ordered by the compensation judge assigned to the case, pursuant to a motion to require the intervenor's attendance filed by a party or as a matter of the judge's discretion. A motion to require attendance must be served and filed at least 20 days before a scheduled proceeding, and the compensation judge must serve and file an order granting or denying the motion at least ten days before a scheduled proceeding. If attendance is ordered, failure of the intervenor to attend a proceeding either in person or, if approved by the compensation judge, by telephone or some other electronic medium, shall result in the denial of the claim for reimbursement except upon a showing of good cause. If attendance has not been ordered, this subdivision does not prohibit an intervenor from attending a conference or hearing in person, or from requesting permission from the compensation judge to attend a conference or hearing by telephone or other electronic medium.\nIf a specific and detailed objection to intervention remains following settlement or pretrial conferences, the issue shall be addressed at the hearing. If the intervenor has not been ordered to attend the hearing pursuant to subdivision 4, or has received permission to attend the hearing by telephone or other electronic medium, the intervenor may provide a written response to the objection before the hearing according to subdivision 6 for consideration as a matter of discretion by the judge.\nUnless a stipulation has been signed and filed or the intervenor's right to reimbursement has otherwise been established, the intervenor shall present evidence in support of the claim at or before the hearing. When the intervenor has not been ordered to attend the hearing pursuant to subdivision 4, or has received permission to attend the hearing by telephone or other electronic medium, the office may establish a procedure for submission of the intervenor's evidence and response to outstanding objections to intervention. If the intervenor does not submit a written response to the objection before the hearing, the compensation judge's determination on the objection must be based on the information and evidence submitted prior to or at the hearing, as a matter of judicial discretion.\nExcept as provided in subdivisions 2 and 4, failure to comply with this section shall not result in a denial of the claim for reimbursement unless the compensation judge, or commissioner, determines that the noncompliance has materially prejudiced the interests of the other parties.\nThe chief administrative law judge may issue standing orders to implement this section. The chief administrative law judge has the authority to issue standing orders instead of, or in addition to, the authority granted to the office or compensation judges under this section, provided that any standing order issued by the chief administrative law judge must be consistent with this section.",
	"repealed": false
}