{
	"id": "270C.446",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.446",
	"title": "270C.446 PUBLICATION OF NAMES OF TAX PREPARERS SUBJECT TO PENALTIES.",
	"text": "Notwithstanding any other law, the commissioner must publish as provided in this section a list or lists of tax preparers subject to penalties.\n(a) Subject to the limitations of paragraph (b), the commissioner must publish lists of tax preparers as defined in section 270C.445, subdivision 2, paragraph (h), who have been:\n(1) convicted under section 289A.63;\n(2) assessed penalties in excess of $1,000 under section 289A.60, subdivision 13, paragraph (a);\n(3) convicted for identity theft under section 609.527, or a similar statute, for a return filed with the commissioner, the Internal Revenue Service, or another state;\n(4) assessed a penalty under section 270C.445, subdivision 6, paragraph (a), in excess of $1,000;\n(5) issued a cease and desist order under section 270C.445, subdivision 6, paragraph (b), that has become a final order;\n(6) assessed a penalty under section 270C.445, subdivision 6, paragraph (l), for violating a cease and desist order; or\n(7) assessed a penalty under section 289A.60, subdivision 28, paragraph (c) or (d), in excess of $1,000.\n(b) For the purposes of this section, tax preparers are not subject to publication if:\n(1) an administrative or court action contesting or appealing a penalty described in paragraph (a), clause (2), (4), or (6), has been filed or served and is unresolved at the time when notice would be given under subdivision 3;\n(2) an appeal period to contest a penalty described in paragraph (a), clause (2), (4), or (6), has not expired;\n(3) the commissioner has been notified that the tax preparer is deceased;\n(4) an appeal period to contest a cease and desist order issued under section 270C.445, subdivision 6, paragraph (b), has not expired;\n(5) an administrative or court action contesting or appealing a cease and desist order issued under section 270C.445, subdivision 6, paragraph (b), has been filed or served and is unresolved at the time when notice would be given under subdivision 3;\n(6) a direct appeal of a conviction described in paragraph (a), clause (1) or (3), has been filed or served and is unresolved at the time when the notice would be given under subdivision 3; or\n(7) an appeal period to contest a conviction described in paragraph (a), clause (1) or (3), has not expired.\n(a) At least 30 days before publishing the name of a tax preparer subject to publication under this section, the commissioner shall mail a written notice to the tax preparer, detailing the basis for the publication and the intended publication of the information listed in subdivision 4 related to the penalty. The notice must be sent to the tax preparer addressed to the last known address of the tax preparer. The notice must include information regarding the exceptions listed in subdivision 2, paragraph (b), and must state that the tax preparer's information will not be published if the tax preparer provides information establishing that subdivision 2, paragraph (b), prohibits publication of the tax preparer's name.\n(b) Thirty days after the notice is mailed and if the tax preparer has not proved to the commissioner that subdivision 2, paragraph (b), prohibits publication, the commissioner may publish in a list of tax preparers subject to penalty the information about the tax preparer that is listed in subdivision 4.\nThe list may be published by any medium or method. The list must contain the name, associated business name or names, address or addresses, and violation or violations that make each tax preparer subject to publication.\nThe commissioner shall remove the name of a tax preparer from the list of tax preparers published under this section:\n(1) when the commissioner determines that the name was included on the list in error;\n(2) within three years after the preparer has demonstrated to the commissioner that the preparer fully paid all fines and penalties imposed, served any suspension, satisfied any sentence imposed, successfully completed any probationary period imposed, and successfully completed any remedial actions required by the commissioner, the State Board of Accountancy, or the Lawyers Professional Responsibility Board; or\n(3) when the commissioner has been notified that the tax preparer is deceased.\nIf the commissioner publishes a name under subdivision 1 in error, the tax preparer whose name was erroneously published has a right to request a retraction and apology. If the tax preparer so requests, the commissioner shall publish a retraction and apology acknowledging that the tax preparer's name was published in error. The retraction and apology must appear in the same medium and the same format as the original list that contained the name listed in error.\nActions against the commissioner of revenue or the state of Minnesota arising out of the implementation of this program must be brought under section 270C.275.",
	"repealed": false
}