{
	"id": "299K.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/299K.10",
	"title": "299K.10 ENFORCEMENT.",
	"text": "(a) To carry out its duties, the commission may:\n(1) enforce the federal act;\n(2) issue, enter into, or enforce orders, schedules of compliance, and stipulation agreements;\n(3) conduct investigations, issue notices, and hold hearings that are necessary or useful to discharge its duties;\n(4) examine and copy any books, papers, records, memoranda, or data of a person that is related to data required to be submitted to the commission;\n(5) enter public or private property to take an action authorized by this section including obtaining information from a person who has a duty to provide information to the commission; and\n(6) issue subpoenas requiring the attendance and testimony of witnesses and the production of evidence relevant to matters involved in a hearing or investigation.\n(b) An employee or agent of the commission may examine witnesses and administer oaths in connection with a subpoena. Witnesses must receive the same fees and mileage as in civil actions.\n(c) The commission may delegate its authority under this subdivision to state or local governmental agencies or organizations to conduct investigations, examine and copy records, and enter property.\nThe commission may enforce the federal act through a civil action brought in federal district court under the federal act or in state district court by the attorney general on request of the commission.\nA person may commence a civil action against an owner or operator of a facility in state district court that may be brought in federal district court under the federal act.\nA regional review committee or a local emergency planning committee may commence an action against an owner or operator of a facility in state district court for a violation of the federal act that the local emergency planning committee is authorized to commence in federal district court under the federal act.\nIn addition to other relief granted, the court may grant injunctive relief to restrain violations of the federal act.\n(a) A violation of the federal act is a violation of state law.\n(b) An owner or operator of a facility is liable to the state for civil penalties in the same manner and amount as the owner or operator is liable to the United States under section 11045, subpart (a), subpart (b), paragraphs (1), (2), and (3), and subpart (c), paragraphs (1) and (2), of the federal act.\n(c) The commission may enforce the penalties in state district court in the same manner as the administrator of the United States Environmental Protection Agency may enforce the civil penalties in federal district court under the federal act.\n(d) For purposes of this subdivision, each day of continued violation constitutes a separate violation.\nOn the motion of a party prevailing in an action under this section, the court may award costs, disbursements, and reasonable attorney and witness fees to the prevailing party.\nA civil action authorized by this section may be brought in the District Court in Ramsey County, in the district court where the alleged violation occurred, or in the district court where the defendant is located.\nThe commission may issue an order requiring a violation of the federal act to be corrected and administratively assessing monetary penalties. Except in the case of serious or repeated violations, the penalty assessed in the order must be forgiven if the person who is subject to the order corrects the violation before the 31st day after receiving the order. The procedures in section 116.072 must be followed when issuing administrative penalty orders under this subdivision. The maximum amount of an administrative penalty order under this subdivision is $10,000 for all violations identified in an inspection or a review of compliance.",
	"repealed": false
}