{
	"id": "256.983",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.983",
	"title": "256.983 FRAUD PREVENTION INVESTIGATIONS.",
	"text": "Within the limits of available appropriations, the commissioners of human services and children, youth, and families shall require the maintenance of budget neutral fraud prevention investigation programs in the counties or Tribal agencies participating in the fraud prevention investigation project established under this section. If funds are sufficient, the commissioners may also extend fraud prevention investigation programs to other counties or Tribal agencies provided the expansion is budget neutral to the state. Under any expansion, the commissioners jointly have the final authority in decisions regarding the creation and realignment of individual county, Tribal agency, or regional operations. The commissioners may establish a joint office or interagency agreement to facilitate joint oversight and administration of sections 256.981 to 256.9861 and 256.9866.\nEach participating county and Tribal agency shall develop and submit an annual staffing and funding proposal to the commissioners no later than April 30 of each year. Each proposal shall include, but not be limited to, the staffing and funding of the fraud prevention investigation program, a job description for investigators involved in the fraud prevention investigation program, and the organizational structure of the county or Tribal agency unit, training programs for case workers, and the operational requirements which may be directed by the commissioners. The proposal shall be approved, to include any changes directed or negotiated by the commissioners, no later than June 30 of each year.\nThe commissioners shall establish training programs which shall be attended by all investigative and supervisory staff of the involved county and Tribal agencies. The commissioners shall also develop the necessary operational guidelines, forms, and reporting mechanisms that shall be used by the involved county or Tribal agencies. An individual's application or redetermination form for public assistance benefits, including child care assistance programs and medical care programs, must include an authorization for release by the individual to obtain documentation for any information on that form which is involved in a fraud prevention investigation. The authorization for release is effective for six months after public assistance benefits have ceased.\n(a) County and Tribal agency reimbursement shall be made through the settlement provisions applicable to the Supplemental Nutrition Assistance Program (SNAP), MFIP, child care assistance programs, the medical assistance program, and other federal and state-funded programs.\n(b) The commissioners will maintain program compliance if for any three consecutive month period, a county or Tribal agency fails to comply with fraud prevention investigation program guidelines, or fails to meet the cost-effectiveness standards developed by the commissioners. This result is contingent on the commissioners providing written notice, including an offer of technical assistance, within 30 days of the end of the third or subsequent month of noncompliance. The county or Tribal agency shall be required to submit a corrective action plan to the commissioners within 30 days of receipt of a notice of noncompliance. Failure to submit a corrective action plan or, continued deviation from standards of more than ten percent after submission of a corrective action plan, will result in denial of funding for each subsequent month, or billing the county or Tribal agency for fraud prevention investigation (FPI) service provided by the commissioners, or reallocation of program grant funds, or investigative resources, or both, to other counties or Tribal agencies. The denial of funding shall apply to the general settlement received by the county or Tribal agency on a quarterly basis and shall not reduce the grant amount applicable to the FPI project.\n(a) A county or Tribal agency may conduct investigations of financial misconduct by child care providers as described in sections 142E.50 to 142E.58. Prior to opening an investigation, a county or Tribal agency must contact the commissioners to determine whether an investigation under this chapter may compromise an ongoing investigation.\n(b) If, upon investigation, a preponderance of evidence shows a provider committed an intentional program violation, intentionally gave the county or Tribe materially false information on the provider's billing forms, provided false attendance records to a county, Tribe, or the commissioners, or committed financial misconduct as described in section 142E.50, subdivision 8, the county or Tribal agency may recommend that the commissioners suspend a provider's payment pursuant to sections 142E.50 to 142E.58, or deny or revoke a provider's authorization pursuant to section 142E.17, subdivision 9, paragraph (d), clause (2), prior to pursuing other available remedies.\n[See Note.]",
	"repealed": false
}