{
	"id": "62L.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/62L.18",
	"title": "62L.18 CEDING OF RISK.",
	"text": "For health benefit plans issued on or after July 1, 1993, all health carriers participating in the association may prospectively reinsure an employee or dependent within a small employer group and entire employer groups of seven or fewer eligible employees. A health carrier must determine whether to reinsure an employee or dependent or entire group within 60 days of the commencement of the coverage of the small employer and must notify the association during that time period.\n(a) A health carrier may not reinsure existing small employer business through the association. A health carrier may reinsure an employee or dependent who previously had coverage from MCHA who is now eligible for coverage through the small employer group at the time of enrollment as defined in section 62L.03, subdivision 6. A health carrier may not reinsure individuals who have existing individual health care coverage with that health carrier upon replacement of the individual coverage with group coverage as provided in section 62L.04, subdivision 1.\n(b) A health carrier may cede to the association the risk of any newly eligible employees or continue to reinsure small employer business for employers who, at the time of renewal of coverage by the same health carrier prior to July 1, 1995, have more than 29 current employees but fewer than 49 current employees. This paragraph is effective retroactively for coverage renewed on or after July 1, 1994.\nA health carrier may terminate reinsurance through the association for an employee or dependent or entire group on the anniversary date of coverage for the small employer. If the health carrier terminates the reinsurance, the health carrier may not subsequently reinsure the individual or entire group.\nA health carrier transferring risk to the association is completely responsible for administering its health benefit plans. A health carrier shall apply its case management and claim processing techniques consistently between reinsured and nonreinsured business. Small employers, eligible employees, and dependents shall not be notified that the health carrier has reinsured their coverage through the association.",
	"repealed": false
}