{
	"id": "336.9-5135",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-5135",
	"title": "336.9-5135 TERMINATION OF WRONGFULLY FILED FINANCING STATEMENT; REINSTATEMENT.",
	"text": "(a) Intent to harass. \"Intent to harass\" means from the totality of the information provided in the record it appears obvious to the filing office that there is no valid basis for the filing of the record.\n(b) Affidavit of wrongful filing. A person identified as the debtor in a filed financing statement may deliver to the filing office a notarized affidavit that identifies the financing statement by file number, indicates the person's mailing address, and states that the person believes the filed record identifying the person as the debtor was not authorized to be filed and was communicated or caused to be communicated to the office with the intent to harass or defraud the person identified as the debtor. The office may reject an affidavit that is incomplete or that the office believes was delivered with the intent to harass or defraud the secured party. The secretary of state must provide a form of affidavit for use under this section.\n(c) Termination statement by filing office. If an affidavit is delivered to the filing office under subsection (b) and is not rejected under subsection (b), the office must promptly file a termination statement with respect to the financing statement identified in the affidavit. The termination statement must identify by its file number the initial financing statement it relates to and must indicate that it was filed pursuant to this section. A termination statement filed under this subsection is not effective until 20 days after the date it is filed.\n(d) No fee charged or refunded. The filing office must not charge a fee to file an affidavit under subsection (b) or a termination statement under subsection (c). The office must not return any fee paid to file the financing statement identified in the affidavit, whether or not the financing statement is reinstated under subsection (g).\n(e) Notice of termination statement. Within two business days of the date a filing office files a termination statement under subsection (c), it must send to the secured party of record for the financing statement the termination statement relates to a notice stating the termination statement has been filed and becomes effective 20 days after the date the termination statement was filed. The notice must be sent by certified mail, return receipt requested, to the address provided for the secured party of record in the financing statement, with a copy sent by email to the email address provided by the secured party of record, if any.\n(f) Administrative review; action for reinstatement. If a secured party believes in good faith the filed record identified in an affidavit and delivered to the filing office under subsection (b) was authorized to be filed and was not communicated or caused to be communicated to the filing office with the intent to harass or defraud, the secured party may do the following:\n(1) before the termination statement takes effect, request that the filing office conduct an expedited review of the filed record and any documentation provided by the secured party. The filing office may, as a result of the review, remove from the record the termination statement filed by it under subsection (c) before it takes effect; or\n(2) at any time, commence an action against the filing office seeking reinstatement of the financing statement the filed record relates to. The action must be commenced before the expiration of six months after the date the termination statement was filed under subsection (c) becomes effective. If the person identified as the debtor is not named as a defendant in the action, the secured party must send a copy of the complaint to the person identified as the debtor at the address indicated in the affidavit. The exclusive venue for the action is the district court for the county where the filing office in which the financing statement was filed is located. The action must be considered by the court on an expedited basis.\n(g) Office to file notice of action for reinstatement. Within ten days after the date the filing office is served with process in an action under subsection (f), the filing office must file in the central filing system a notice indicating the action has been commenced. The notice must indicate the file number of the initial financing statement it relates to.\n(h) Action for reinstatement successful. In an action under subsection (f), if the court determines the financing statement was authorized to be filed and was not communicated or caused to be communicated to the filing office with the intent to harass or defraud the person identified as the debtor, the court must order that the financing statement is reinstated. If a reinstatement order is issued by the court, the filing office must promptly file a record that identifies by its file number the initial financing statement the record relates to and indicates the financing statement has been reinstated.\n(i) Effect of reinstatement. Upon the filing of a record reinstating a financing statement under subsection (h), the effectiveness of the financing statement is reinstated and the financing statement is considered to never have been terminated under this section. A continuation statement filed under section 336.9-515(d) after the effective date of a termination statement filed under subsection (c) becomes effective if the financing statement is reinstated.\n(j) Liability for wrongful filing. In an action under subsection (f), if the court determines the filed record identified in an affidavit delivered to the filing office under subsection (b) was not authorized to be filed and was communicated or caused to be communicated to the filing office with the intent to harass or defraud the person identified as the debtor, the filing office and the person identified as the debtor may recover from the secured party that filed the action the costs and expenses, including reasonable attorney fees, that the filing office and the person identified as the debtor incurred in the action. The recovery is under this subsection in addition to any recovery the person identified as the debtor is entitled to under section 336.9-625.",
	"repealed": false
}