{
	"id": "204C.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.36",
	"title": "204C.36 RECOUNTS IN COUNTY, SCHOOL DISTRICT, AND MUNICIPAL ELECTIONS.",
	"text": "(a) Except as provided in paragraphs (b) and (c), a losing candidate for nomination or election to a county, municipal, or school district office may request a recount of the votes cast for the nomination or election to that office if the difference between the vote cast for that candidate and for a winning candidate for nomination or election is less than one-quarter of one percent of the total votes counted for that office. In case of offices where two or more seats are being filled from among all the candidates for the office, the one-quarter of one percent difference is between the elected candidate with the fewest votes and the candidate with the most votes from among the candidates who were not elected.\n(b) A losing candidate for nomination or election to a county, municipal, or school district office may request a recount of the votes cast for nomination or election to that office if the difference between the votes cast for that candidate and for a winning candidate for nomination or election is less than one-half of one percent, and the total number of votes cast for the nomination or election of all candidates is more than 400 but less than 50,000. In cases of offices where two or more seats are being filled from among all the candidates for the office, the one-half of one percent difference is between the elected candidate with the fewest votes and the candidate with the most votes from among the candidates who were not elected.\n(c) A losing candidate for nomination or election to a county, municipal, or school district office may request a recount of the votes cast for nomination or election to that office if the difference between the vote cast for that candidate and for a winning candidate for nomination or election is ten votes or less, and the total number of votes cast for the nomination or election of all candidates is no more than 400. In cases of offices where two or more seats are being filled from among all the candidates for the office, the ten vote difference is between the elected candidate with the fewest votes and the candidate with the most votes from among the candidates who were not elected.\n(d) Candidates for county offices shall file a written request for the recount with the county auditor. Candidates for municipal or school district offices shall file a written request with the municipal or school district clerk as appropriate. All requests under this paragraph shall be filed between the close of the canvass of a primary or special primary and 5:00 p.m. on the fifth day after the canvass of a primary or special primary or between the close of the canvass of a special or general election and 5:00 p.m. on the seventh day of the canvass of a special or general election for which a recount is sought.\n(e) Upon receipt of a request made pursuant to this section, the county auditor shall recount the votes for a county office at the expense of the county, the governing body of the municipality shall recount the votes for a municipal office at the expense of the municipality, and the school board of the school district shall recount the votes for a school district office at the expense of the school district.\n(a) A losing candidate for nomination or election to a county, municipal, or school district office may request a recount in the manner provided in this section at the candidate's own expense when the vote difference is greater than the difference required by subdivision 1, paragraphs (a) to (e). The votes shall be manually recounted as provided in this section if the requesting candidate files with the county auditor, municipal clerk, or school district clerk a bond, cash, or surety in an amount set by the governing body of the jurisdiction or the school board of the school district for the payment of the recount expenses.\n(b) The requesting candidate may provide the filing officer with a list of up to three precincts that are to be recounted first and may waive the balance of the recount after these precincts have been counted. If the candidate provides a list, the recount official must determine the expenses for those precincts in the manner provided by paragraph (b).\n(c) A discretionary recount of a primary must not delay delivery of the notice of nomination to the winning candidate under section 204C.32.\n(d) The results of the recount must be certified by the canvassing board as soon as possible.\n(e) If the winner of the race is changed by the optional recount, the cost of the recount must be paid by the jurisdiction conducting the recount.\n(f) If a result of the vote counting in the manual recount is different from the result of the vote counting reported on election day by a margin greater than two votes and greater than one-quarter of one percent of the number of ballots recounted, the cost of the recount must be paid by the jurisdiction conducting the recount.\nA recount for a ballot question may be requested by any person eligible to vote on the ballot question. A written request for a recount must be filed with the filing officer of the county, municipality, or school district placing the question on the ballot and must be accompanied by a petition containing the signatures of 25 voters eligible to vote on the question. Upon receipt of a written request when the difference between the votes for the question and the number required for passage is less than or equal to the difference provided in subdivision 1, the county auditor shall recount the votes for a county question at the expense of the county, the governing body of the municipality shall recount the votes for a municipal question at the expense of the municipality, and the school board of the school district shall recount the votes for a school district question at the expense of the school district. If the difference between the votes for the question and the number required for passage is greater than the difference provided in subdivision 1, the person requesting the recount shall also file with the filing officer of the county, municipality, or school district a bond, cash, or surety in an amount set by the appropriate governing body for the payment of recount expenses. The written request, petition, and any bond, cash, or surety required must be filed during the time for notice of contest for the election for which the recount is requested.\nIn the case of a question, a person, or a candidate requesting a discretionary recount, is responsible for the following expenses: the compensation of the secretary of state, or designees, and any election judge, municipal clerk, county auditor, administrator, or other personnel who participate in the recount; necessary supplies and travel related to the recount; the compensation of the appropriate canvassing board and costs of preparing for the canvass of recount results; and any attorney fees incurred in connection with the recount by the governing body responsible for the recount.\nTime for notice of contest of a nomination or election to a county office which is recounted pursuant to this section shall begin to run upon certification of the results of the recount by the county canvassing board. Time for notice of contest of a nomination or election to a municipal office which is recounted pursuant to this section shall begin to run upon certification of the results by the governing body of the municipality. Time for notice of contest of a school district election that is recounted under this subdivision begins to run on certification of the results of the recount by the school board.\nA recount conducted as provided in this section is limited in scope to the determination of the number of votes validly cast for the office or question to be recounted. Only the ballots cast in the election and the summary statements certified by the election judges may be considered in the recount process.",
	"repealed": false
}