{
	"id": "142B.70",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.70",
	"title": "142B.70 FAMILY CHILD CARE TRAINING REQUIREMENTS.",
	"text": "(a) License holders, second adult caregivers, and substitutes must comply with the training requirements in this section.\n(b) Helpers who assist with care on a regular basis must complete six hours of training within one year after the date of initial employment.\n(c) Training requirements established under this section that must be completed prior to initial licensure must be satisfied only by a newly licensed child care provider or by a child care provider who has not held an active child care license in Minnesota in the previous 12 months. A child care provider who voluntarily cancels a license or allows the license to lapse for a period of less than 12 months and who seeks reinstatement of the lapsed or canceled license within 12 months of the lapse or cancellation must satisfy the annual, ongoing training requirements, and is not required to satisfy the training requirements that must be completed prior to initial licensure. A child care provider who relocates within the state must (1) satisfy the annual, ongoing training requirements according to the schedules established in this section and (2) not be required to satisfy the training requirements under this section that the child care provider completed prior to initial licensure. If a licensed provider moves to a new county, the new county is prohibited from requiring the provider to complete any orientation class or training for new providers.\n(d) Before a second adult caregiver or substitute cares for a child or assists in the care of a child, the license holder must train the second adult caregiver or substitute on:\n(1) the emergency preparedness plan required under section 142B.71, subdivision 3; and\n(2) allergy prevention and response required under section 142B.71, subdivision 1.\nFor the purposes of this section, the following terms have the meanings given:\n(1) \"second adult caregiver\" means an adult who cares for children in the licensed program along with the license holder for a cumulative total of more than 500 hours annually;\n(2) \"helper\" means a minor, ages 13 to 17, who assists in caring for children; and\n(3) \"substitute\" means an adult who assumes responsibility for a license holder for a cumulative total of not more than 500 hours annually.\nAn adult who cares for children in the licensed program along with the license holder for a cumulative total of not more than 500 hours annually has the same training requirements as a substitute.\n(a) For purposes of family and group family child care, the license holder and each second adult caregiver shall complete and document at least four hours of child development and learning and behavior guidance training prior to initial licensure, and before caring for children. For purposes of this subdivision, \"child development and learning training\" means training in understanding how children develop physically, cognitively, emotionally, and socially and learn as part of the children's family, culture, and community. \"Behavior guidance training\" means training in the understanding of the functions of child behavior and strategies for managing challenging situations. The training shall be developed or approved by the commissioner of children, youth, and families.\n(b) Notwithstanding initial child development and learning and behavior guidance training requirements in paragraph (a), individuals are exempt from this requirement if they:\n(1) have taken a three-credit course on early childhood development within the past five years;\n(2) have received a baccalaureate or master's degree in early childhood education or school-age child care within the past five years;\n(3) are licensed in Minnesota as a prekindergarten teacher, an early childhood educator, a kindergarten to grade 6 teacher with a prekindergarten specialty, an early childhood special education teacher, or an elementary teacher with a kindergarten endorsement; or\n(4) have received a baccalaureate degree with a Montessori certificate within the past five years.\n(c) The license holder and each second adult caregiver must annually take at least two hours of child development and learning or behavior guidance training. A three-credit course about early childhood development meets the requirements of this paragraph.\n(a) Before initial licensure and before caring for a child, license holders, second adult caregivers, and substitutes must be trained in pediatric first aid. The first aid training must have been provided by an individual approved to provide first aid instruction. First aid training may be less than eight hours and persons qualified to provide first aid training include individuals approved as first aid instructors. License holders, second adult caregivers, and substitutes must repeat pediatric first aid training every two years within 90 days of the date the training was previously taken.\n(b) Video training reviewed and approved by the county licensing agency satisfies the training requirement of this subdivision.\n(a) Before initial licensure and before caring for a child, license holders, second adult caregivers, and substitutes must be trained in pediatric cardiopulmonary resuscitation (CPR), including CPR techniques for infants and children, and in the treatment of obstructed airways. The CPR training must have been provided by an individual approved to provide CPR instruction. License holders, second adult caregivers, and substitutes must repeat pediatric CPR training at least once every two years within 90 days of the date the training was previously taken, and the training must be documented in the license holder's records.\n(b) Persons providing CPR training must use CPR training that has been developed:\n(1) by the American Heart Association or the American Red Cross and incorporates psychomotor skills to support the instruction; or\n(2) using nationally recognized, evidence-based guidelines for CPR training and incorporates psychomotor skills to support the instruction.\n(a) License holders must ensure and document that before the license holder, second adult caregivers, substitutes, and helpers assist in the care of infants, they are instructed on the standards in section 142B.46 and receive training on reducing the risk of sudden unexpected infant death. In addition, license holders must ensure and document that before the license holder, second adult caregivers, substitutes, and helpers assist in the care of infants and children under school age, they receive training on reducing the risk of abusive head trauma from shaking infants and young children. The training in this subdivision may be provided as initial training under subdivision 1 or ongoing annual training under subdivision 8.\n(b) Sudden unexpected infant death reduction training required under this subdivision must, at a minimum, address the risk factors related to sudden unexpected infant death, means of reducing the risk of sudden unexpected infant death in child care, and license holder communication with parents regarding reducing the risk of sudden unexpected infant death.\n(c) Abusive head trauma training required under this subdivision must, at a minimum, address the risk factors related to shaking infants and young children, means of reducing the risk of abusive head trauma in child care, and license holder communication with parents regarding reducing the risk of abusive head trauma.\n(d) Training for family and group family child care providers must be developed by the commissioner in conjunction with the Minnesota Sudden Infant Death Center and approved by the Minnesota Center for Professional Development. Sudden unexpected infant death reduction training and abusive head trauma training may be provided in a single course of no more than two hours in length.\n(e) Sudden unexpected infant death reduction training and abusive head trauma training required under this subdivision must be completed in person or as allowed under subdivision 11, clause (1) or (2), at least once every two years. On the years when the individual receiving training is not receiving training in person or as allowed under subdivision 11, clause (1) or (2), the individual receiving training in accordance with this subdivision must receive sudden unexpected infant death reduction training and abusive head trauma training through a video of no more than one hour in length. The video must be developed or approved by the commissioner.\n(f) An individual who is related to the license holder as defined in section 142B.01, subdivision 15, and who is involved only in the care of the license holder's own infant or child under school age and who is not designated to be a second adult caregiver, helper, or substitute for the licensed program, is exempt from the sudden unexpected infant death and abusive head trauma training.\n(a) A license holder must comply with all seat belt and child passenger restraint system requirements under section 169.685.\n(b) Family and group family child care programs licensed by the Department of Children, Youth, and Families that serve a child or children under eight years of age must document training that fulfills the requirements in this subdivision.\n(1) Before a license holder, second adult caregiver, substitute, or helper transports a child or children under age eight in a motor vehicle, the person placing the child or children in a passenger restraint must satisfactorily complete training on the proper use and installation of child restraint systems in motor vehicles. Training completed under this subdivision may be used to meet initial training under subdivision 1 or ongoing training under subdivision 8.\n(2) Training required under this subdivision must be at least one hour in length, completed at initial training, and repeated at least once every five years. At a minimum, the training must address the proper use of child restraint systems based on the child's size, weight, and age, and the proper installation of a car seat or booster seat in the motor vehicle used by the license holder to transport the child or children.\n(3) Training under this subdivision must be provided by individuals who are certified and approved by the Department of Public Safety, Office of Traffic Safety. License holders may obtain a list of certified and approved trainers through the Department of Public Safety website or by contacting the agency.\n(c) Child care providers that only transport school-age children as defined in section 142B.01, subdivision 13, paragraph (f), in child care buses as defined in section 169.448, subdivision 1, paragraph (e), are exempt from this subdivision.\n(a) For purposes of family and group family child care, the license holder and each second adult caregiver must complete 16 hours of ongoing training each year. Repeat of topical training requirements in subdivisions 3 to 9 shall count toward the annual 16-hour training requirement. Additional ongoing training subjects to meet the annual 16-hour training requirement must be selected from the following areas:\n(1) child development and learning training in understanding how a child develops physically, cognitively, emotionally, and socially, and how a child learns as part of the child's family, culture, and community;\n(2) developmentally appropriate learning experiences, including training in creating positive learning experiences, promoting cognitive development, promoting social and emotional development, promoting physical development, promoting creative development; and behavior guidance;\n(3) relationships with families, including training in building a positive, respectful relationship with the child's family;\n(4) assessment, evaluation, and individualization, including training in observing, recording, and assessing development; assessing and using information to plan; and assessing and using information to enhance and maintain program quality;\n(5) historical and contemporary development of early childhood education, including training in past and current practices in early childhood education and how current events and issues affect children, families, and programs;\n(6) professionalism, including training in knowledge, skills, and abilities that promote ongoing professional development; and\n(7) health, safety, and nutrition, including training in establishing healthy practices; ensuring safety; and providing healthy nutrition.\n(b) A provider who is approved as a trainer through the Develop data system may count up to two hours of training instruction toward the annual 16-hour training requirement in paragraph (a). The provider may only count training instruction hours for the first instance in which they deliver a particular content-specific training during each licensing year. Hours counted as training instruction must be approved through the Develop data system with attendance verified on the trainer's individual learning record and must be in Knowledge and Competency Framework content area VII A (Establishing Healthy Practices) or B (Ensuring Safety).\n(a) The training required of family and group family child care providers and staff must include training in the cultural dynamics of early childhood development and child care. The cultural dynamics and disabilities training and skills development of child care providers must be designed to achieve outcomes for providers of child care that include, but are not limited to:\n(1) an understanding and support of the importance of culture and differences in ability in children's identity development;\n(2) understanding the importance of awareness of cultural differences and similarities in working with children and their families;\n(3) understanding and support of the needs of families and children with differences in ability;\n(4) developing skills to help children develop unbiased attitudes about cultural differences and differences in ability;\n(5) developing skills in culturally appropriate caregiving; and\n(6) developing skills in appropriate caregiving for children of different abilities.\nThe commissioner shall approve the curriculum for cultural dynamics and disability training.\n(b) The provider must meet the training requirement in section 142B.41, subdivision 9, paragraph (a), clause (4), to be eligible to allow a child cared for at the family child care or group family child care home to use the swimming pool located at the home.\n(a) Courses required by this subdivision must include the following health and safety topics:\n(1) preventing and controlling infectious diseases;\n(2) administering medication;\n(3) preventing and responding to allergies;\n(4) ensuring building and physical premises safety;\n(5) handling and storing biological contaminants;\n(6) preventing and reporting child abuse and maltreatment; and\n(7) emergency preparedness.\n(b) Before initial licensure and before caring for a child, all family child care license holders and each second adult caregiver shall complete and document the completion of the six-hour Supervising for Safety for Family Child Care course developed by the commissioner.\n(c) The license holder must ensure and document that, before caring for a child, all substitutes have completed the four-hour Basics of Licensed Family Child Care for Substitutes course developed by the commissioner, which must include health and safety topics as well as child development and learning.\n(d) The family child care license holder and each second adult caregiver shall complete and document:\n(1) the annual completion of either:\n(i) a two-hour active supervision course developed by the commissioner; or\n(ii) any courses in the ensuring safety competency area under the health, safety, and nutrition standard of the Knowledge and Competency Framework that the commissioner has identified as an active supervision training course; and\n(2) the completion at least once every five years of the two-hour courses Health and Safety I and Health and Safety II. A license holder's or second adult caregiver's completion of either training in a given year meets the annual active supervision training requirement in clause (1).\n(e) At least once every three years, license holders must ensure and document that substitutes have completed the four-hour Basics of Licensed Family Child Care for Substitutes course.\n(a) The commissioner of children, youth, and families must post information on the department's website indicating the specific category within the Knowledge and Competency Framework that will satisfy training requirements for child development and learning, behavior guidance, and active supervision. County licensing staff must accept trainings designated as satisfying training requirements by the commissioner under this paragraph.\n(b) Unless specifically authorized in this section, one training does not fulfill two different training requirements. Courses within the identified knowledge and competency areas that are specific to child care centers or legal nonlicensed providers do not fulfill the requirements of this section.\n(c) County licensing staff must accept training approved by the Minnesota Center for Professional Development, including:\n(1) face-to-face or classroom training;\n(2) online training; and\n(3) relationship-based professional development, such as mentoring, coaching, and consulting.\nNew and increased training requirements under this section must not be imposed on providers until the commissioner establishes statewide accessibility to the required provider training.",
	"repealed": false
}