{
	"id": "354A.25",
	"url": "https://www.revisor.mn.gov/statutes/cite/354A.25",
	"title": "354A.25 AUTHORITY TO ELECT A SURVIVOR ANNUITY FOR A SAME-SEX SPOUSE.",
	"text": "Notwithstanding any law or bylaws to the contrary, an eligible person, as defined in subdivision 2, is authorized to file an amended benefit election to change the eligible person's retirement annuity to a joint and survivor annuity and designate a beneficiary who is the same sex as the eligible person if the eligible person had not previously been allowed to designate a same-sex spouse because the law or bylaws did not permit the designation of a same-sex spouse.\nFor the purposes of this section, the following definitions apply, unless the context clearly indicates another meaning is intended.\n(a) \"Eligible person\" means a person who:\n(1) was formerly a basic member as defined under section 354A.011, subdivision 8, or a coordinated member, as defined under section 354A.011, subdivision 11, of the St. Paul Teachers Retirement Fund Association;\n(2) retired before August 1, 2013, and is receiving a retirement annuity;\n(3) was unmarried at the time of retirement due to the lack of full recognition of same-sex marriages under state law; and\n(4) had a same-sex spouse at the time of retirement who has continued to be the eligible person's same-sex spouse until the time of the filing of the amended benefit election under subdivision 3.\n(b) \"Same-sex spouse\" means a spouse of the same sex as the eligible person who otherwise satisfies the eligibility requirements to receive spousal benefits under the basic plan or coordinated plan of the St. Paul Teachers Retirement Fund Association. Before August 1, 2013, a same-sex spouse is an individual in a relationship with the eligible person that would have caused the individual to satisfy the eligibility requirements to receive spousal benefits under the basic plan or coordinated plan of the St. Paul Teachers Retirement Fund Association had the individual and eligible person been permitted to marry under state law.\n(a) An eligible person may file an amended benefit election to change the eligible person's retirement annuity to a joint and survivor annuity that will pay an annuity for the life of the eligible person and a survivor annuity for the life of the eligible person's same-sex spouse.\n(b) To file an amended benefit election, the eligible person must file an election in the form requested by the executive director of the St. Paul Teachers Retirement Fund Association and must designate the same-sex spouse as the primary designated beneficiary.\nIf the eligible person is a member of the coordinated plan of the St. Paul Teachers Retirement Fund Association, the executive director will recalculate the eligible person's benefit based on the amended benefit election and notify the eligible person of the amount that was overpaid plus interest since the commencement of the retirement annuity. The overpayment plus interest must be recovered in accordance with section 354A.12, subdivision 7, by reducing future monthly pension payments.",
	"repealed": false
}