{
	"id": "477A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.40",
	"title": "477A.40 TRIBAL NATION AID.",
	"text": "Aid distributions under this section are not a substitute for reparations to eligible Tribal Nations, their members, or their members' descendants.\nFor the purposes of this section, the following terms have the meanings given:\n(1) \"distribution share\" means the number of enrolled members in an eligible Tribal Nation divided by the total number of enrolled members for all eligible Tribal Nations certified under this section; and\n(2) \"eligible Tribal Nation\" means any of the 11 federally recognized Indian Tribes located in Minnesota which submit an application under subdivision 4.\nAn eligible Tribal Nation's annual aid amount is equal to the sum of:\n(1) the quotient of:\n(i) 0.5 times the amount appropriated under this section; divided by\n(ii) the number of eligible Tribal Nations; plus\n(2) the product of:\n(i) the eligible Tribal Nation's distribution share; multiplied by\n(ii) 0.5 times the amount appropriated under this section.\nAn eligible Tribal Nation may choose to receive an aid distribution under this section by submitting an application under this subdivision. An eligible Tribal Nation which has not received a distribution in a prior aids payable year may elect to begin participation in the program by submitting an application in the manner and form prescribed by the commissioner of revenue by January 15 of the aids payable year. In order to receive a distribution, an eligible Tribal Nation must certify to the commissioner of revenue the most recent estimate of the total number of enrolled members of the eligible Tribal Nation. The information must be annually certified by March 1 in the form prescribed by the commissioner of revenue. The commissioner of revenue must annually calculate and certify the amount of aid payable to each eligible Tribal Nation on or before August 1.\nThe commissioner of revenue must pay Tribal Nation aid annually by December 27 of the year the aid is certified.\n$35,000,000 is annually appropriated from the general fund to the commissioner of revenue to make payments under this section.",
	"repealed": false
}