{
	"id": "617.247",
	"url": "https://www.revisor.mn.gov/statutes/cite/617.247",
	"title": "617.247 POSSESSION OF PORNOGRAPHIC WORK INVOLVING MINORS.",
	"text": "It is the policy of the legislature in enacting this section to protect minors from the physical and psychological damage caused by their being used in pornographic work depicting sexual conduct which involves minors. It is therefore the intent of the legislature to penalize possession of pornographic work depicting sexual conduct which involve minors or appears to involve minors in order to protect the identity of minors who are victimized by involvement in the pornographic work, and to protect minors from future involvement in pornographic work depicting sexual conduct.\nFor purposes of this section, the following terms have the meanings given them:\n(a) \"Pornographic work\" has the meaning given to it in section 617.246.\n(b) \"Sexual conduct\" has the meaning given to it in section 617.246.\n(a) A person who disseminates pornographic work to an adult or a minor, knowing or with reason to know its content and character, is guilty of a felony and may be sentenced to imprisonment for not more than seven years or to payment of a fine of not more than $10,000, or both.\n(b) A person who violates paragraph (a) is guilty of a felony and may be sentenced to imprisonment for not more than 15 years or to payment of a fine of not more than $20,000, or both, if:\n(1) the person has a prior conviction or delinquency adjudication for violating this section or section 617.246;\n(2) the violation occurs when the person is a registered predatory offender under section 243.166; or\n(3) the violation involved a minor under the age of 14 years.\n(a) A person who possesses a pornographic work or a computer disk or computer or other electronic, magnetic, or optical storage system or a storage system of any other type, containing a pornographic work, knowing or with reason to know its content and character, is guilty of a felony and may be sentenced to imprisonment for not more than five years or to payment of a fine of not more than $5,000, or both.\n(b) A person who violates paragraph (a) is guilty of a felony and may be sentenced to imprisonment for not more than ten years or to payment of a fine of not more than $10,000, or both, if:\n(1) the person has a prior conviction or delinquency adjudication for violating this section or section 617.246;\n(2) the violation occurs when the person is a registered predatory offender under section 243.166; or\n(3) the violation involved a minor under the age of 14 years.\nThis section does not apply to the performance of official duties by peace officers, court personnel, or attorneys, nor to licensed physicians, psychologists, or social workers or persons acting at the direction of a licensed physician, psychologist, or social worker in the course of a bona fide treatment or professional education program.\nConsent to sexual performance by a minor or the minor's parent, guardian, or custodian is not a defense to a charge of violation of this section.\nIf a person is convicted of a second or subsequent violation of this section within 15 years of the prior conviction, the court shall order a mental examination of the person. The examiner shall report to the court whether treatment of the person is necessary.\nIt shall be an affirmative defense to a charge of violating this section that the pornographic work was produced using only persons who were 18 years or older.\n[See Note.]\nNotwithstanding the statutory maximum sentence otherwise applicable to the offense or any provision of the sentencing guidelines, when a court commits a person to the custody of the commissioner of corrections for violating this section, the court shall provide that after the person has been released from prison, the commissioner shall place the person on conditional release for five years. If the person has previously been convicted of a violation of this section, section 609.342, 609.343, 609.344, 609.345, 609.3451, 609.3453, or 617.246, or any similar statute of the United States, this state, or any state, the commissioner shall place the person on conditional release for 15 years. The terms of conditional release are governed by section 609.3455, subdivision 8.",
	"repealed": false
}