{
	"id": "103C.321",
	"url": "https://www.revisor.mn.gov/statutes/cite/103C.321",
	"title": "103C.321 OFFICERS AND EMPLOYEES.",
	"text": "(a) The supervisors shall elect or appoint officers for the district and the district board.\n(b) A chair of the district board shall be elected from its own members.\n(c) A secretary and a treasurer shall be appointed who need not be members of the board.\n(d) Officers serve at the pleasure of the supervisors. Officers shall have the powers and duties incident to their respective offices, and other powers and duties expressly prescribed by law or directed by the district board.\nThe district board may employ technical experts and other officers, agents, and employees, permanent and temporary, as the board may require. The supervisors shall determine their qualifications, duties, and compensation.\nThe district board shall provide for the execution of surety bonds for all employees and officers who are entrusted with funds or property.\nThe county attorney of the county where the major portion of the district is located or one otherwise employed by the board shall be the attorney for the district and its supervisors. The district board may call upon the county attorney for necessary legal counsel and advice and service.\nThe district board may delegate to its chair or other officer, to one or more supervisors, or to one or more agents or employees the powers and duties they deem proper.\nThe supervisors may authorize the use of a credit card by any soil and water conservation district officer or employee otherwise authorized to make a purchase on behalf of the soil and water conservation district. If a soil and water conservation district officer or employee makes a purchase by credit card that is not approved by the supervisors, the officer or employee is personally liable for the amount of the purchase. A purchase by credit card must otherwise comply with all statutes, rules, or soil and water conservation district policy applicable to soil and water conservation district purchases.",
	"repealed": false
}