{
	"id": "92.21",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.21",
	"title": "92.21 REDEMPTION OF FORFEITED STATE LANDS.",
	"text": "If the holder of a certificate of sale of state land sold before January 6, 1934, forfeits rights for failure to pay the interest due under the certificate, the holder may redeem the rights as follows. Before resale at public auction of the lands described in the certificate, the holder shall pay the commissioner of management and budget the amount of interest then due and payable on the certificate, with interest at four percent from the time when it became due. The payment is a redemption of the rights of the certificate holder, and the certificate is reinstated, if the following conditions are met:\n(1) If the default in payment occurred before July 1, 1941, the amount required for redemption must be paid not later than December 31, 1941.\n(2) If the default in payment occurred on or after July 1, 1941, the amount required for redemption must be paid within six months after the default.\n(3) If the time for payment of the principal specified in the certificate has expired but an extension of time by law has not expired, the amount due on the principal with interest and all other sums due the state on the land must be paid. After payment, a patent for the land must be issued to the certificate holder as provided by law.\n(4) No redemption is permitted if the time for payment of the principal as specified in the certificate and its lawful extensions have expired, or if the certificate of sale has been absolutely terminated and made void without right of redemption under any prior or existing law, or if the land has become absolutely forfeited to the state for delinquent taxes.\n(5) This section does not affect any proceedings for the resale of state public land unless redemption is made before sale of the land to an actual purchaser.\nIf a certificate of sale of state public land sold before January 6, 1934, is canceled after default by reappraisal and reoffer of the land for sale, and the default is not redeemed and the certificate reinstated as provided by this section, the certificate is absolutely canceled and void, and all right, title, and interest of the purchaser or heirs, representatives, or assigns of the purchaser, in the land terminate without further act of the state. This subdivision does not preclude any other method of termination prescribed by law.",
	"repealed": false
}