{
	"id": "79A.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/79A.11",
	"title": "79A.11 REIMBURSEMENT FOR OBLIGATIONS PAID AND ASSUMED.",
	"text": "The security fund shall have the right and obligation to obtain reimbursement from an insolvent private self-insurer up to the amount of the private self-insurer's workers' compensation obligations paid and assumed by the security fund, including reasonable administrative and legal costs. This right includes, but is not limited to, a right to claim for wages and other necessities of life advanced to claimants as subrogee of the claimants in any action to collect against the private self-insurer as debtor.\nThe security fund shall have the right and obligation to obtain and retain the security deposit of an insolvent private self-insurer to apply to the private self-insurer's current or future compensation obligations, including reasonable administrative and legal costs, paid or assumed by the security fund and to other current or future obligations of the security fund. Reimbursement of administrative costs, including legal costs, shall be subject to approval by a majority of the security fund's voting trustees. The security fund shall be a party in interest in any action to obtain the security deposit for the payment of compensation obligations of an insolvent self-insurer.\nThe insolvent self-insurer may obtain an insurance policy as described in section 79A.06, subdivision 5, to discharge further workers' compensation obligations assumed by the self-insurers' security fund on behalf of the insolvent insurer. At the self-insurers' security fund's option and in its sole discretion, any part of the insolvent self-insurer's security deposit may be used to fund the acquisition of this policy. After the security deposit has been used to: (1) fund the acquisition of this policy; (2) pay all direct and indirect administrative and professional expenses of the fund related to the insolvent self-insurer; and (3) to the extent not covered by the insurance policy, pay the insolvent self-insurer's losses, allocated loss expense and unallocated loss expense, any part of the insolvent self-insurer's security deposit that remains must be promptly returned to the insolvent self-insurer.\nThe security fund shall have the right to bring an action against any person or entity to recover compensation paid and liability assumed by the security fund, including, but not limited to, any excess insurance carrier of the insolvent private self-insurer, and any person or entity whose negligence or breach of any obligation contributed to any underestimation of the private self-insurer's total accrued liability as reported to the commissioner.\nThe security fund may be a party in interest in any action brought by any other person seeking damages resulting from the failure of an insolvent private self-insurer to pay workers' compensation required pursuant to this subdivision.",
	"repealed": false
}