{
	"id": "239.791",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.791",
	"title": "239.791 OXYGENATED GASOLINE.",
	"text": "(a) Except as provided in subdivisions 10 to 14, a person responsible for the product shall ensure that all gasoline sold or offered for sale in Minnesota must contain at least the quantity of biofuel required by clause (1) or (2), at the option of the person responsible for the product:\n(1) the greater of:\n(i) 10.0 percent conventional biofuel by volume; or\n(ii) the maximum percent of conventional biofuel by volume authorized in a waiver granted by the United States Environmental Protection Agency; or\n(2) 10.0 percent of a biofuel, other than a conventional biofuel, by volume authorized in a waiver granted by the United States Environmental Protection Agency or a biofuel formulation registered by the United States Environmental Protection Agency under United States Code, title 42, section 7545.\n(b) For purposes of enforcing the requirement of paragraph (a), clause (1), item (i), a gasoline/biofuel blend will be construed to be in compliance if the biofuel content, exclusive of denaturants and other permitted components, comprises not less than 9.2 percent by volume and not more than 10.0 percent by volume of the blend as determined by an appropriate United States Environmental Protection Agency or American Society of Testing Materials standard method of analysis.\n(c) The aggregate amount of biofuel blended pursuant to this subdivision may be any biofuel; however, conventional biofuel must comprise no less than the portion specified on and after the specified dates:\n[Repealed, 2013 c 114 art 2 s 69]\n[Repealed, 1993 c 250 s 3]\n(a) Before a waiver granted by the United States Environmental Protection Agency under United States Code, title 42, section 7545, may alter the minimum content level required by subdivision 1, paragraph (a), clause (1), item (ii), the waiver must:\n(1) apply to all gasoline-powered motor vehicles irrespective of model year; and\n(2) allow for special regulatory treatment of Reid vapor pressure under Code of Federal Regulations, title 40, part 1090.215, paragraph (b), for blends of gasoline and ethanol up to the maximum percent of denatured ethanol by volume authorized under the waiver.\n(b) The minimum biofuel requirement in subdivision 1, paragraph (a), clause (1), item (ii), shall, upon the grant of the federal waiver, be effective the day after the commissioner of commerce publishes notice in the State Register. In making this determination, the commissioner shall consider the amount of time required by refiners, retailers, pipeline and distribution terminal companies, and other fuel suppliers, acting expeditiously, to make the operational and logistical changes required to supply fuel in compliance with the minimum biofuel requirement.\nNo motor fuel shall be deemed to be a defective product by virtue of the fact that the motor fuel is formulated or blended pursuant to the requirements of subdivision 1, paragraph (a), clause (1), item (ii), under any theory of liability except for simple or willful negligence or fraud. This subdivision does not preclude an action for negligent, fraudulent, or willful acts. This subdivision does not affect a person whose liability arises under chapter 115, water pollution control; 115A, waste management; 115B, environmental response and liability; 115C, leaking underground storage tanks; or 299J, pipeline safety; under public nuisance law for damage to the environment or the public health; under any other environmental or public health law; or under any environmental or public health ordinance or program of a municipality as defined in section 466.01.\nNotwithstanding any other law or rule, fuel dispensing equipment authorized to dispense fuel under subdivision 1, paragraph (a), clause (1), is authorized to dispense fuel under subdivision 1, paragraph (a), clause (2), or subdivision 1a.\nMS 2022 [Repealed, 2024 c 114 art 3 s 104]\n[Repealed, 1995 c 220 s 141]\n[Repealed, 1995 c 220 s 141]\n[Repealed, 1995 c 220 s 141]\nThe director shall audit the records of registered ethanol blenders to ensure that each blender has met all requirements in this chapter. Specific information or data relating to sales figures or to processes or methods of production unique to the blender or that would tend to adversely affect the competitive position of the blender must be only for the confidential use of the director, unless otherwise specifically authorized by the registered blender.\n(a) A refinery or terminal, shall provide, at the time gasoline is sold or transferred from the refinery or terminal, a bill of lading or shipping manifest to the person who receives the gasoline. For oxygenated gasoline, the bill of lading or shipping manifest must include the identity and the volume percentage or gallons of oxygenate included in the gasoline. For nonoxygenated gasoline not exempt under subdivisions 10 to 14, 16, and 17, the bill or manifest must state: \"This fuel is not oxygenated. It must not be sold at retail in Minnesota.\" This subdivision does not apply to sales or transfers of gasoline between refineries, between terminals, or between a refinery and a terminal.\n(b) A delivery ticket required under section 239.092 for biofuel blended with gasoline must state the volume percentage of biofuel blended into gasoline delivered through a meter into a storage tank used for dispensing by persons not exempt under subdivisions 10 to 14, 16, and 17.\n(c) On or before the 23rd day of each month, a person responsible for the product must report to the department, in the form prescribed by the commissioner, the gross number of gallons of intermediate blends sold at retail by the person during the preceding calendar month. The report must identify the number of gallons by blend type. For purposes of this subdivision, \"intermediate blends\" means blends of gasoline and biofuel in which the biofuel content, exclusive of denaturants and other permitted components, is greater than ten percent and no more than 50 percent by volume. This paragraph only applies to a person who is responsible for selling intermediate blends at retail at more than ten locations. A person responsible for the product at fewer than ten locations is not precluded from reporting the gross number of intermediate blends if a report is available.\n(d) All reports provided pursuant to paragraph (c) are nonpublic data, as defined in section 13.02, subdivision 9.\n[Repealed, 1995 c 220 s 141]\nA person responsible for the product may offer for sale, sell, or dispense at an airport, for use in airplanes, gasoline that is not oxygenated in accordance with subdivision 1 if the gasoline is unleaded premium grade as defined in section 239.751, subdivision 4.\nA person responsible for the product may offer for sale, sell, or dispense at a resort, marina, or houseboat rental company gasoline that is not oxygenated in accordance with subdivision 1 if the gasoline has an octane rating of 87 or higher; is delivered into onsite bulk storage; and is not used for a licensed motor vehicle as defined in section 168.002, subdivision 18.\nA person responsible for the product may offer for sale, sell, or dispense at a public or private racecourse, gasoline that is not oxygenated in accordance with subdivision 1 if the gasoline is intended to be used exclusively as a fuel for off-highway motor sports racing events.\n(a) A person responsible for the product may offer for sale, sell, or dispense at a retail gasoline station for use in collector vehicles or vehicles eligible to be licensed as collector vehicles, off-road vehicles, motorcycles, boats, snowmobiles, or small engines, gasoline that is not oxygenated in accordance with subdivision 1 if the person meets the conditions in paragraphs (b) to (d). If the nonoxygenated gasoline is for use in a small engine, it must be dispensed into a can with a capacity of six or fewer gallons.\n(b) The nonoxygenated gasoline must be unleaded premium grade as defined in section 239.751, subdivision 4.\n(c) No more than one storage tank on the premises of the retail gasoline station may be used for storage of the nonoxygenated gasoline offered for sale, sold, or dispensed by the station.\n(d) The pump stands must be posted with a permanent notice stating: \"NONOXYGENATED GASOLINE. FOR USE IN COLLECTOR VEHICLES OR VEHICLES ELIGIBLE TO BE LICENSED AS COLLECTOR VEHICLES, OFF-ROAD VEHICLES, MOTORCYCLES, BOATS, SNOWMOBILES, OR SMALL ENGINES ONLY.\"\nThis notice must be posted at least two feet above the ground. A retail gasoline station that sells nonoxygenated premium gasoline as defined in section 239.791, subdivision 15, must register every two years with the director, or an entity appointed by the director, on forms approved by the director, the total amount of nonoxygenated premium gasoline sold annually.\n(a) A person responsible for the product may offer for sale, sell, and deliver directly to a bulk fuel storage tank gasoline that is not oxygenated in accordance with subdivision 1 if the conditions in paragraphs (b) to (e) are met.\n(b) The nonoxygenated gasoline must be unleaded premium grade as defined in section 239.751, subdivision 4.\n(c) The bulk fuel storage tank must be stationary or permanent.\n(d) The bulk fuel storage tank must be under the control of an owner of littoral or riparian property and located on that littoral or riparian property.\n(e) The nonoxygenated gasoline must be purchased for use in vehicles that would qualify for an exemption under subdivision 12, paragraph (a).\nA person responsible for the product may offer for sale, sell, and deliver directly to a bulk fuel storage tank gasoline that is not oxygenated in accordance with subdivision 1 for use in aircraft if the nonoxygenated gasoline is unleaded premium grade as defined in section 239.751, subdivision 4.\n(a) A person responsible for the product, who offers for sale, sells, or dispenses nonoxygenated premium gasoline under one or more of the exemptions in subdivisions 10 to 14, may sell, offer for sale, or dispense oxygenated gasoline that contains less than the minimum amount of ethanol required under subdivision 1 if all of the following conditions are met:\n(1) the blended gasoline has an octane rating of 88 or greater;\n(2) the gasoline is a blend of oxygenated gasoline meeting the requirements of subdivision 1 with nonoxygenated premium gasoline;\n(3) the blended gasoline contains not more than ten percent nonoxygenated premium gasoline;\n(4) the blending of oxygenated gasoline with nonoxygenated gasoline occurs within the gasoline dispenser; and\n(5) the gasoline station at which the gasoline is sold, offered for sale, or delivered is equipped to store gasoline in not more than two storage tanks.\n(b) This subdivision applies only to those persons who met the conditions in paragraph (a), clauses (1) through (5), on August 1, 2004, and registered with the director by November 1, 2004.\nA person responsible for the product may offer for sale, sell, or dispense gasoline that is not oxygenated according to subdivision 1 if the gasoline is intended to be used exclusively for research and development by a manufacturer of snowmobiles, all-terrain vehicles, motorcycles, or recreational vehicles.\n(a) A person responsible for the product may offer for sale, sell, or deliver a bulk delivery of unleaded premium grade gasoline, as defined in section 239.751, subdivision 4, that is not oxygenated in accordance with subdivision 1 if the conditions in paragraphs (b) to (d) are met.\n(b) Nonoxygenated gas is only for use in vehicles that qualify for an exemption under subdivision 12, paragraph (a).\n(c) No more than one bulk fuel storage tank on the premises may be used for storage of the nonoxygenated gasoline.\n(d) The bulk fuel delivery is 500 gallons or less.",
	"repealed": false
}