{
	"id": "148.515",
	"url": "https://www.revisor.mn.gov/statutes/cite/148.515",
	"title": "148.515 QUALIFICATIONS FOR LICENSURE.",
	"text": "Except as provided in section 148.516 or 148.517, an applicant for speech-language pathology or audiology must meet the requirements in this section.\n[See Note.]\n(a) An applicant for speech-language pathology must possess a master's or doctoral degree that meets the requirements of paragraph (b). If completing a doctoral program in which a master's degree has not been conferred, an applicant must submit a transcript showing completion of course work equivalent to, or exceeding, a master's degree that meets the requirement of paragraph (b). In addition to the transcript, the commissioner may require a letter from the academic department chair or program director documenting that the applicant has completed coursework equivalent to or exceeding a master's degree or that the applicant is eligible for enrollment in current doctoral externship credit.\n(b) All of the speech-language pathology applicant's graduate coursework and clinical practicum required in the professional area for which licensure is sought must have been initiated and completed at an institution whose program meets the current requirements and was accredited by the Educational Standards Board of the Council on Academic Accreditation in Audiology and Speech-Language Pathology, a body recognized by the United States Department of Education, or an equivalent as determined by the commissioner, in the area for which licensure is sought.\n(a) An applicant for audiology must possess a master's degree or doctoral degree that meets the following requirements:\n(1) if graduate training is completed prior to August 30, 2007, an audiology applicant must possess a master's or doctoral degree in audiology from an accredited educational institution; or\n(2) if graduate training is completed after August 30, 2007, an audiology applicant must possess a doctoral degree with an emphasis in audiology, or its equivalent as determined by the commissioner, from an accredited educational institution.\n(b) All of the audiology applicant's graduate coursework and clinical practicum required in the professional area for which licensure is sought must have been initiated and completed at an institution whose program meets the current requirements and was accredited by the Educational Standards Board of the Council on Academic Accreditation in Audiology and Speech-Language Pathology, a body recognized by the United States Department of Education, or an equivalent as determined by the commissioner, in the area for which licensure is sought.\n[Repealed, 2003 c 87 s 53]\nAn applicant must complete the graduate or doctoral clinical experience required by the American Speech-Language-Hearing Association, the American Board of Audiology, or an equivalent, as determined by the commissioner, and must achieve a qualifying examination score on the National Examination in Speech-Language Pathology or Audiology.\n[Repealed, 2003 c 87 s 53]\n(a) Audiologists are exempt from the written examination requirement in section 153A.14, subdivision 2h, paragraph (a), clause (1).\n(b) After July 31, 2005, all applicants for audiologist licensure under sections 148.512 to 148.5198 must achieve a passing score on the practical tests of proficiency described in section 153A.14, subdivision 2h, paragraph (a), clause (2), within the time period described in section 153A.14, subdivision 2h, paragraph (c).\n(c) In order to dispense prescription hearing aids as a sole proprietor, member of a partnership, or for a limited liability company, corporation, or any other entity organized for profit, a licensee who obtained audiologist licensure under sections 148.512 to 148.5198, before August 1, 2005, and who is not certified to dispense prescription hearing aids under chapter 153A, must achieve a passing score on the practical tests of proficiency described in section 153A.14, subdivision 2h, paragraph (a), clause (2), within the time period described in section 153A.14, subdivision 2h, paragraph (c). All other audiologist licensees who obtained licensure before August 1, 2005, are exempt from the practical tests.\n(d) An applicant for an audiology license who obtains a temporary license under section 148.5175 may dispense prescription hearing aids only under supervision of a licensed audiologist who dispenses prescription hearing aids.",
	"repealed": false
}