{
	"id": "120A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/120A.22",
	"title": "120A.22 COMPULSORY INSTRUCTION.",
	"text": "The parent of a child is primarily responsible for assuring that the child acquires knowledge and skills that are essential for effective citizenship.\nUpon request, a noncustodial parent has the right of access to, and to receive copies of, school records and information, to attend conferences, and to be informed about the child's welfare, educational progress, and status, as authorized under section 518.17, subdivision 3. The school is not required to hold a separate conference for each parent.\nThis section and sections 120A.24; 120A.26; 120A.32; and 120A.34 apply only to a child required to receive instruction according to subdivision 5 and to instruction that is intended to fulfill that requirement.\n(a) In this section and sections 120A.24 and 120A.26, \"parent\" means a parent, guardian, or other person having legal custody of a child.\n(b) In sections 125A.03 to 125A.24 and 125A.65, \"parent\" means a parent, guardian, or other person having legal custody of a child under age 18. For an unmarried pupil age 18 or over, \"parent\" means the pupil unless a guardian or conservator has been appointed, in which case it means the guardian or conservator.\n(c) For purposes of sections 125A.03 to 125A.24 and 125A.65, the school district of residence for an unmarried pupil age 18 or over who is a parent under paragraph (b) and who is placed in a center for care and treatment, shall be the school district in which the pupil's biological or adoptive parent or designated guardian resides.\n(d) For a married pupil age 18 or over, the school district of residence is the school district in which the married pupil resides.\n(e) If a district reasonably believes that a student does not meet the residency requirements of the school district in which the student is attending school, the student may be removed from the school only after the district sends the student's parents written notice of the district's belief, including the facts upon which the belief is based, and an opportunity to provide documentary evidence of residency in person to the superintendent or designee, or, at the option of the parents, by sending the documentary evidence to the superintendent, or a designee, who will then make a determination as to the residency status of the student.\nFor the purpose of compulsory attendance, a \"school\" means a public school, as defined in section 120A.05, subdivisions 9, 11, 13, and 17, or a nonpublic school, church or religious organization, or home school in which a child is provided instruction in compliance with this section and section 120A.24.\n(a) Every child between seven and 17 years of age must receive instruction unless the child has graduated. Every child under the age of seven who is enrolled in a half-day kindergarten, or a full-day kindergarten program on alternate days, or other kindergarten programs shall receive instruction. Except as provided in subdivision 6, a parent may withdraw a child under the age of seven from enrollment at any time.\n(b) A school district by annual board action may require children subject to this subdivision to receive instruction in summer school. A district that acts to require children to receive instruction in summer school shall establish at the time of its action the criteria for determining which children must receive instruction.\n(c) A pupil 16 years of age or older who meets the criteria of section 124D.68, subdivision 2, and under clause (5) of that subdivision has been excluded or expelled from school or under clause (11) of that subdivision has been chronically truant may be referred to an area learning center. Such referral may be made only after consulting the principal, area learning center director, student, and parent or guardian and only if, in the school administrator's professional judgment, the referral is in the best educational interest of the pupil. Nothing in this paragraph limits a pupil's eligibility to apply to enroll in other eligible programs under section 124D.68.\n(a) Once a pupil under the age of seven is enrolled in kindergarten or a higher grade in a public school, the pupil is subject to the compulsory attendance provisions of this chapter and section 120A.34, unless the board of the district in which the pupil is enrolled has a policy that exempts children under seven from this subdivision.\n(b) In a district in which children under seven are subject to compulsory attendance under this subdivision, paragraphs (c) to (e) apply.\n(c) A parent or guardian may withdraw the pupil from enrollment in the school for good cause by notifying the district. Good cause includes, but is not limited to, enrollment of the pupil in another school, as defined in subdivision 4, or the immaturity of the child.\n(d) When the pupil enrolls, the enrolling official must provide the parent or guardian who enrolls the pupil with a written explanation of the provisions of this subdivision.\n(e) A pupil under the age of seven who is withdrawn from enrollment in the public school under paragraph (c) is no longer subject to the compulsory attendance provisions of this chapter.\n(f) In a district that had adopted a policy to exempt children under seven from this subdivision, the district's chief attendance officer must keep the truancy enforcement authorities supplied with a copy of the board's current policy certified by the clerk of the board.\n(a) A district, a charter school, or a nonpublic school that receives services or aid under sections 123B.40 to 123B.48 from which a student is transferring must transmit the student's educational records, within ten business days of a request, to the district, the charter school, or the nonpublic school in which the student is enrolling. Districts, charter schools, and nonpublic schools that receive services or aid under sections 123B.40 to 123B.48 must make reasonable efforts to determine the district, the charter school, or the nonpublic school in which a transferring student is next enrolling in order to comply with this subdivision.\n(b) A closed charter school must transfer the student's educational records, within ten business days of the school's closure, to the student's school district of residence where the records must be retained unless the records are otherwise transferred under this subdivision.\n(c) A school district, a charter school, or a nonpublic school that receives services or aid under sections 123B.40 to 123B.48 that transmits a student's educational records to another school district or other educational entity, charter school, or nonpublic school to which the student is transferring must include in the transmitted records information about any formal suspension, expulsion, and exclusion disciplinary action under sections 121A.40 to 121A.56. The district, the charter school, or the nonpublic school that receives services or aid under sections 123B.40 to 123B.48 must provide notice to a student and the student's parent or guardian that formal disciplinary records will be transferred as part of the student's educational record, in accordance with data practices under chapter 13 and the Family Educational Rights and Privacy Act of 1974, United States Code, title 20, section 1232(g).\n(d) Notwithstanding section 138.17, a principal or chief administrative officer must remove from a student's educational record and destroy a probable cause notice received under section 260B.171, subdivision 5, or paragraph (e), if one year has elapsed since the date of the notice and the principal or chief administrative officer has not received a disposition or court order related to the offense described in the notice. This paragraph does not apply if the student no longer attends the school when this one-year period expires.\n(e) A principal or chief administrative officer who receives a probable cause notice under section 260B.171, subdivision 5, or a disposition or court order, must include a copy of that data in the student's educational records if they are transmitted to another school, unless the data are required to be destroyed under paragraph (d) or section 121A.75.\nAny student who is 17 years old who seeks to withdraw from school, and the student's parent or guardian must:\n(1) attend a meeting with school personnel to discuss the educational opportunities available to the student, including alternative educational opportunities; and\n(2) sign a written election to withdraw from school.\nInstruction must be provided in at least the following subject areas:\n(1) basic communication skills including reading and writing, literature, and fine arts;\n(2) mathematics and science;\n(3) social studies including history, geography, economics, government, and citizenship; and\n(4) health and physical education.\nInstruction, textbooks, and materials must be in the English language. Another language may be used pursuant to sections 124D.59 to 124D.61.\nA person who is providing instruction to a child must meet at least one of the following requirements:\n(1) hold a valid Minnesota teaching license in the field and for the grade level taught;\n(2) be directly supervised by a person holding a valid Minnesota teaching license;\n(3) provide instruction in a school that is accredited by an accrediting agency, recognized according to section 123B.445, or recognized by the commissioner;\n(4) hold a baccalaureate degree; or\n(5) be the parent of a child who is assessed according to the procedures in subdivision 11.\nAny person providing instruction in a public school must meet the requirements of clause (1).\n(a) Each year the performance of every child ages seven through 16 and every child ages 16 through 17 for which an initial report was filed pursuant to section 120A.24, subdivision 1, after the child is 16 and who is not enrolled in a public school must be assessed using a nationally norm-referenced standardized achievement examination. The superintendent of the district in which the child receives instruction and the person in charge of the child's instruction must agree about the specific examination to be used and the administration and location of the examination.\n(b) To the extent the examination in paragraph (a) does not provide assessment in all of the subject areas in subdivision 9, the parent must assess the child's performance in the applicable subject area. This requirement applies only to a parent who provides instruction and does not meet the requirements of subdivision 10, clause (1) or (2).\n(c) If the results of the assessments in paragraphs (a) and (b) indicate that the child's performance on the total battery score is at or below the 30th percentile or one grade level below the performance level for children of the same age, the parent must obtain additional evaluation of the child's abilities and performance for the purpose of determining whether the child has learning problems.\n(d) A child receiving instruction from a nonpublic school, person, or institution that is accredited by an accrediting agency, recognized according to section 123B.445, or recognized by the commissioner, is exempt from the requirements of this subdivision.\n(a) A parent, guardian, or other person having control of a child may apply to a school district to have the child excused from attendance for the whole or any part of the time school is in session during any school year. Application may be made to any member of the board, a truant officer, a principal, or the superintendent. The school district may state in its school attendance policy that it may ask the student's parent or legal guardian to verify in writing the reason for the child's absence from school. A note from a physician or a licensed mental health professional stating that the child cannot attend school is a valid excuse. The board of the district in which the child resides may approve the application upon the following being demonstrated to the satisfaction of that board:\n(1) that the child's physical or mental health is such as to prevent attendance at school or application to study for the period required, which includes:\n(i) child illness, medical, dental, orthodontic, or counseling appointments, including appointments conducted through telehealth;\n(ii) family emergencies;\n(iii) the death or serious illness or funeral of an immediate family member;\n(iv) active duty in any military branch of the United States;\n(v) the child has a condition that requires ongoing treatment for a mental health diagnosis; or\n(vi) other exemptions included in the district's school attendance policy;\n(2) that the child has already completed state and district standards required for graduation from high school; or\n(3) that it is the wish of the parent, guardian, or other person having control of the child that the child attend, for a period or periods not exceeding in the aggregate three hours in any week, instruction conducted by a Tribal spiritual or cultural advisor, or a school for religious instruction conducted and maintained by a church, or association of churches, or any Sunday school association incorporated under the laws of this state, or any auxiliary thereof. This instruction must be conducted and maintained in a place other than a public school building, and it must not, in whole or in part, be conducted and maintained at public expense. A child may be absent from school on days that the child attends upon instruction according to this clause.\n(b) Notwithstanding subdivision 6, paragraph (a), a parent may withdraw a child from an all-day, every day kindergarten program and put their child in a half-day program, if offered, or an alternate-day program without being truant. A school board must excuse a kindergarten child from a part of a school day at the request of the child's parent.\nThe clerk or any authorized officer of the board must issue and keep a record of such excuses, under such rules as the board may from time to time establish.",
	"repealed": false
}