{
	"id": "363A.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.35",
	"title": "363A.35 ACCESS TO CASE FILES.",
	"text": "Notwithstanding section 13.39, and except as provided in section 363A.06, subdivision 4, and 363A.28, subdivision 9, the availability of human rights investigative data to persons other than department employees is governed by this section.\n(a) Except as otherwise provided in this subdivision, human rights investigative data contained in an open case file are confidential data on individuals or protected nonpublic data. The name and address of the charging party and respondent, factual basis of the allegations, and the statute under which the action is brought are private data on individuals or nonpublic data but are accessible to the charging party and the respondent.\n(b) After a charge has been filed, the commissioner may disclose information to persons as the commissioner deems necessary (1) to facilitate investigation or disposition of the charge, or (2) to promote public health or safety. The commissioner may also disclose data about an open case file to another governmental entity to assist that entity or the department in processing a complaint or to eliminate duplication of efforts in the investigation of the same or similar facts as alleged in the charge. To the extent that data are disclosed to other governmental entities, it must be stipulated that section 13.03, subdivision 4, applies to the classification of the data.\n(c) After making a finding of probable cause, the commissioner may make human rights investigative data contained in an open case file accessible to a person, government agency, or the public if access will aid the investigative and enforcement process.\n(a) Except as otherwise provided in this subdivision, human rights investigative data contained in a closed case file are private data on individuals or nonpublic data. The name and address of the charging party and respondent, factual basis of the allegations, the statute under which the action is brought, the part of the summary of the investigation that does not contain identifying data on a person other than the complainant or respondent, and the commissioner's memorandum determining whether probable cause has been shown are public data.\n(b) The commissioner may make human rights investigative data contained in a closed case file inaccessible to the charging party or the respondent in order to protect medical or other security interests of the parties or third persons.\n(c) Except for paragraph (b), when the charging party files a case in district court, the commissioner may provide private data or nonpublic data in a closed case file to the charging party and respondent.\nData comprised of materials and documentation provided by a charging party that is part of an open or closed case file is accessible to the charging party in accordance with section 13.04, subdivision 3. The charging party may consent to the release of the data to the charging party's attorney or other legal representative.",
	"repealed": false
}