{
	"id": "363A.36",
	"url": "https://www.revisor.mn.gov/statutes/cite/363A.36",
	"title": "363A.36 CERTIFICATES OF COMPLIANCE FOR PUBLIC CONTRACTS.",
	"text": "(a) No department, agency of the state, the Metropolitan Council, or agency subject to section 473.143, subdivision 1, shall execute a contract for goods or services in excess of $100,000 with a business that has 40 or more full-time employees in this state or a state where the business has its primary place of business on a single day during the prior 12 months, unless the business has a workforce certificate from the commissioner of human rights or has certified in writing that it is exempt. Determinations of exempt status shall be made by the commissioner of human rights. A certificate is valid for four years. A municipality as defined in section 466.01, subdivision 1, that receives state money for any reason is encouraged to prepare and implement an affirmative action plan for the employment of people with disabilities, people of color, and women, and to submit the plan to the commissioner.\n(b) This section does not apply to contracts entered into by the State Board of Investment for investment options under section 356.645.\n(c) The commissioner shall issue a certificate of compliance or notice of denial within 15 days of the application submitted by the business or firm.\n(a) An agency that uses state money to pay for part or all of a capital project is subject to and must comply with the restrictions in subdivision 1, for contracts exceeding $100,000. A political subdivision that uses state money to pay for part or all of a capital project is subject to and must comply with the restrictions in subdivision 1, for contracts exceeding $250,000.\n(b) For the purposes of this subdivision, the following terms have the meanings given them:\n(1) \"agency\" means a state board, commission, authority, department, or other agency of the executive branch of state government; the Metropolitan Council; the Minnesota Historical Society; the Minnesota State Colleges and Universities; or the University of Minnesota;\n(2) \"capital project\" means the acquisition and betterment of land and buildings and other public improvements in the state, including acquisition of real property or an interest in real property, predesign, design, engineering, site preparation and related environmental work, renovation, construction, furnishing, and equipping;\n(3) \"political subdivision\" means a county, home rule charter or statutory city, town, school district, metropolitan or regional agency other than the Metropolitan Council, public corporation established in law, or other special or limited purpose district created or authorized by law; and\n(4) \"state money\" means the proceeds of state general obligation bonds issued under article XI, section 5, clause (a), of the Minnesota Constitution.\n(c) This subdivision applies to a capital project or discrete phase of a capital project for which state money has been appropriated on or after January 1, 2022.\nThe commissioner shall collect a $250 fee for each certificate of compliance issued by the commissioner or the commissioner's designated agent. The proceeds of the fee must be deposited in a human rights fee special revenue account. Money in the account is appropriated to the commissioner to fund the cost of issuing certificates and investigating grievances.\nCertificates of compliance may be suspended or revoked by the commissioner if a holder of a certificate has not made a good faith effort to implement an affirmative action plan that has been approved by the commissioner. If a contractor does not effectively implement an affirmative action plan approved by the commissioner pursuant to subdivision 1, or fails to make a good faith effort to do so, the commissioner may refuse to approve subsequent plans submitted by that firm or business. If a certificate holder is in violation of this section, the commissioner may impose one or both of the following actions:\n(1) issue fines up to $5,000 per calendar year for each contract; or\n(2) suspend or revoke a certificate of compliance until the contractor has paid all outstanding fines and otherwise complies with this section.\nA contract awarded by a department or agency of the state, the Metropolitan Council, or an agency subject to section 473.143, subdivision 1, may be terminated or abridged by the awarding entity because of suspension or revocation of a certificate based upon a contractor's failure to implement or make a good faith effort to implement an affirmative action plan approved by the commissioner under this section. If a contract is awarded to a person who does not have a contract compliance certificate required under subdivision 1, the commissioner may void the contract on behalf of the state.\nIn the case of a contractor whose certificate of compliance has been suspended, the commissioner shall provide technical assistance that may enable the contractor to be recertified within 90 days after the contractor's certificate has been suspended.\nData submitted to the commissioner related to a certificate of compliance are private data on individuals or nonpublic data with respect to persons other than department employees. The commissioner's decision to issue, not issue, revoke, or suspend or otherwise penalize a certificate holder of a certificate of compliance is public data. Applications, forms, or similar documents submitted by a business seeking a certificate of compliance are public data. The commissioner may disclose data classified as private or nonpublic under this subdivision to other state agencies, statewide systems, and political subdivisions for the purposes of achieving compliance with this section.",
	"repealed": false
}