{
	"id": "103D.729",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.729",
	"title": "103D.729 WATER MANAGEMENT DISTRICT.",
	"text": "A watershed district may establish a water management district or districts in the territory within the watershed, for the purpose of collecting revenues and paying the costs of projects initiated under section 103B.231, 103D.701, or 103D.730.\nA watershed district may establish a water management district only by amendment to its plan in accordance with section 103D.401, or 103B.231 for watershed districts in the metropolitan area, and compliance with subdivisions 3 and 4. The amendment must describe with particularity the territory or the area to be included in the water management district, the amount of the necessary charges, the methods used to determine charges, and the length of time the water management district will remain in force. After adoption, the amendment must be filed with the county auditor and county recorder of each county affected by the water management district. Charges must be collected according to section 444.075, subdivision 2a. The water management district may be dissolved by the procedure prescribed for the establishment of the water management district.\nThe managers shall, ten days prior to a hearing or decision on projects implemented under this section, provide notice to the city, town, or county within the affected area. The city, town, or county receiving notice shall submit to the managers concerns relating to the implementation of the project. The managers shall consider the concerns of the city, town, or county in the decision on the project.\nUnresolved differences between local governments and the managers may be brought before the committee on dispute resolution under section 103B.101, subdivision 10. Within 45 days of receiving the request for dispute resolution, the committee must consider the concerns of the local government. The committee has 30 days after meeting to issue a recommendation to the board for final decision.",
	"repealed": false
}