{
	"id": "17A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/17A.10",
	"title": "17A.10 LIVESTOCK SCALES AND WEIGHING.",
	"text": "All livestock scales and monorail scales used for the purpose of buying or selling livestock or livestock carcasses within the state must meet the construction, maintenance, testing, and certification requirements of the Division of Weights and Measures of the Department of Commerce, and be in compliance with the scales and weighing regulations of the Packers and Stockyards Administration of the United States Department of Agriculture and be tested and certified by the state Division of Weights and Measures. The Division of Weights and Measures or an authorized scale company shall test all livestock scales at least twice per year. The Department of Agriculture may perform scale maintenance inspections at least twice per year at intervals that will provide alternate testing or inspection of each scale every 90 days. Special tests may be required as necessary. The basic maintenance tolerance for livestock scales is one pound per 1,000 pounds of test load. The responsibility for compliance of a scale with these requirements rests with the owner or manager of the scale.\nThe commissioner shall appoint state employees as necessary to provide state weighing service at public stockyards, packing plants, slaughtering houses, buying stations, or livestock market agencies on application from the business entity requesting official state livestock weighing. State livestock weighmasters shall weigh all livestock coming to these places for sale, keep a record of the weights, and furnish the interested parties a certificate of state weight stating the number of animals weighed and the weight of the animals. The certificate is prima facie evidence of the facts certified. An application for official state livestock weighing constitutes an agreement between the business entity requesting state weighing and the commissioner. The agreement is for one year beginning July 1 and ending the following June 30. The agreement automatically renews each year unless the business entity gives the commissioner a written notice of intent to terminate at least 360 days prior to July 1. Otherwise the commissioner shall continue to provide state weighing services in accordance with this chapter.\nState livestock weighmasters have charge over the scales on which official certificates of state weight are issued to ensure compliance with scale maintenance and testing requirements and proper weighing procedures.\nThe commissioner shall appoint law compliance personnel as necessary to provide maintenance inspections, checkweighing, comparison weighing, and record audits and to investigate complaints in order to enforce this chapter.\nThe regulations pertaining to livestock and monorail scales adopted by the Packers and Stockyards Administration of the United States Department of Agriculture are applicable in Minnesota, and a memorandum of understanding with the Packers and Stockyards Administration provides for a cooperative state and federal enforcement program.",
	"repealed": false
}