{
	"id": "16E.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.07",
	"title": "16E.07 ONLINE GOVERNMENT INFORMATION SERVICES.",
	"text": "(a) The definition in this subdivision applies to this section.\n(b) \"Government unit\" means a state department, agency, commission, council, board, task force, or committee; a constitutional office; a court entity; the Minnesota State Colleges and Universities; a county, statutory or home rule charter city, or town; a school district; a special district; or any other board, commission, district, or authority created under law, local ordinance, or charter provision.\nThe department shall collaborate with state agencies to maintain MN.gov and associated websites that provide online government information services.\nThe legislature determines that the greatest possible access to certain government information and data is essential to allow citizens to participate fully in a democratic system of government. Certain information and data, including, but not limited to the following, must be provided free of charge or for a nominal cost associated with reproducing the information or data:\n(1) directories of government services and institutions;\n(2) legislative and rulemaking information, including an electronic version of the State Register, public information newsletters, bill text and summaries, bill status information, rule status information, meeting schedules, and the text of statutes and rules;\n(3) supreme court and court of appeals opinions and general judicial information;\n(4) opinions of the attorney general;\n(5) Campaign Finance and Public Disclosure Board and election information;\n(6) public budget information;\n(7) local government documents, such as codes, ordinances, minutes, meeting schedules, and other notices in the public interest;\n(8) official documents, releases, speeches, and other public information issued by government agencies; and\n(9) the text of other government documents and publications that government agencies determine are important to public understanding of government activities.\nMS 2022 [Repealed by amendment, 2024 c 123 art 17 s 23]\nMS 2022 [Repealed by amendment, 2024 c 123 art 17 s 23]\nThe office may establish fees for technical and transaction services for government units. The office may not charge a fee for viewing or inspecting data made available through MN.gov or linked facilities, unless specifically authorized by law.\nThe online government information service account is created in the special revenue fund. The account consists of:\n(1) grants received from nonstate entities;\n(2) fees and charges collected by the office;\n(3) gifts, donations, and bequests made to the office; and\n(4) other money credited to the account by law.\nMoney in the account is appropriated to the office to be used to continue the development of online government information services.\nThe office shall plan and develop secure transaction systems to support delivery of government services electronically. A state agency that implements electronic government services for fees, licenses, sales, or other purposes may be required to use secure transaction systems developed in accordance with this section.\nThe office may identify opportunities to aggregate demand for technical services required by government units for online activities and may contract with governmental or nongovernmental entities to provide services. These contracts are not subject to the requirements of chapters 16B and 16C, except sections 16C.04, 16C.08, and 16C.09.\nThe office may promote the availability of government online information and services through public outreach and education.\nMS 2022 [Repealed by amendment, 2024 c 123 art 17 s 23]\n(a) The department may enter into a contract with a private entity to manage, maintain, support, and expand online government information services to citizens and businesses.\n(b) A contract established under paragraph (a) may provide for compensation of the private entity through a fee established under paragraph (c).\n(c) The department, subject to the approval of the agency or department responsible for the data or services involved in the transaction, may charge and may authorize a private entity that enters into a contract under paragraph (a) to charge a convenience fee for users of online government information services up to a total of $2 per transaction, provided that no fee shall be charged for viewing or inspecting data. A fee established under this paragraph is in addition to any fees or surcharges authorized under other law.\n(d) Receipts from the convenience fee shall be deposited in the online government information service account established in subdivision 7. Notwithstanding section 16A.1285, subdivision 2, receipts credited to the account are appropriated to the department for payment to the contracted private entity under paragraph (a). In lieu of depositing the receipts in the online government information service account, the department can directly transfer the receipts to the private entity or allow the private entity to retain the receipts pursuant to a contract established under this subdivision.\n(e) Information regarding any convenience fee receipts collected under paragraph (d) must be reported to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over state government finance by January 15 of each odd-numbered year.",
	"repealed": false
}