{
	"id": "260E.35",
	"url": "https://www.revisor.mn.gov/statutes/cite/260E.35",
	"title": "260E.35 DATA PRACTICES.",
	"text": "Notwithstanding the data's classification in the possession of any other agency, data acquired by the local welfare agency or the agency responsible for assessing or investigating the report during the course of the assessment or investigation are private data on individuals and must be maintained according to this section.\n(a) Data of the commissioner of education collected or maintained during and for the purpose of an investigation of alleged maltreatment in a school are governed by this chapter, notwithstanding the data's classification as educational, licensing, or personnel data under chapter 13.\n(b) In conducting an investigation involving a school facility as defined in section 260E.03, subdivision 6, clause (2), the commissioner of education shall collect investigative reports and data that are relevant to a report of maltreatment from local law enforcement and the school facility.\n(a) A written copy of a report maintained by personnel of agencies, other than welfare or law enforcement agencies, which are subject to chapter 13 shall be confidential. An individual subject of the report may obtain access to the original report as provided by paragraphs (g) to (o).\n(b) All reports and records created, collected, or maintained under this chapter by a local welfare agency or law enforcement agency may be disclosed to a local welfare or other child welfare agency of another state when the agency certifies that:\n(1) the reports and records are necessary to conduct an investigation of actions that would qualify as maltreatment under this chapter; and\n(2) the reports and records will be used only for purposes of a child protection assessment or investigation and will not be further disclosed to any other person or agency.\n(c) The local welfare agency or law enforcement agency in this state shall keep a record of all records or reports disclosed pursuant to this subdivision and of any agency to which the records or reports are disclosed. If, in any case, records or reports are disclosed before a determination is made under section 260E.24, subdivision 3, paragraph (a), or a disposition of a criminal proceeding is reached, the local welfare agency or law enforcement agency in this state shall forward the determination or disposition to any agency that has received a report or record under this subdivision.\n(d) The responsible authority of a local welfare agency or the responsible authority's designee may release private or confidential data on an active case involving assessment or investigation of actions that are defined as maltreatment under this chapter to a court services agency if:\n(1) the court services agency has an active case involving a common client who is the subject of the data; and\n(2) the data are necessary for the court services agency to effectively process the court services agency's case, including investigating or performing other duties relating to the case required by law.\n(e) The data disclosed under paragraph (d) may be used only for purposes of the active court services case described in paragraph (d), clause (1), and may not be further disclosed to any other person or agency, except as authorized by law.\n(f) Records maintained under subdivision 4, paragraph (b), may be shared with another local welfare agency that requests the information because it is conducting an assessment or investigation under this section of the subject of the records.\n(g) Except as provided in paragraphs (b), (h), (i), (o), and (p); subdivision 1; and sections 260E.22, subdivision 2; and 260E.23, all records concerning individuals maintained by a local welfare agency or agency responsible for assessing or investigating the report under this chapter, including any written reports filed under sections 260E.06 and 260E.09, shall be private data on individuals, except insofar as copies of reports are required by section 260E.12, subdivision 1 or 2, to be sent to the local police department or the county sheriff.\n(h) All records concerning determinations of maltreatment by a facility are nonpublic data as maintained by the Department of Education, except insofar as copies of reports are required by section 260E.12, subdivision 1 or 2, to be sent to the local police department or the county sheriff.\n(i) Reports maintained by any police department or the county sheriff shall be private data on individuals, except the reports shall be made available to the investigating, petitioning, or prosecuting authority, including a county medical examiner or county coroner.\n(j) Section 13.82, subdivisions 8, 9, and 14, apply to law enforcement data other than the reports.\n(k) The local welfare agency or agency responsible for assessing or investigating the report shall make available to the investigating, petitioning, or prosecuting authority, including a county medical examiner or county coroner or a professional delegate, any records that contain information relating to a specific incident of maltreatment that is under investigation, petition, or prosecution and information relating to any prior incident of maltreatment involving any of the same persons. The records shall be collected and maintained according to chapter 13.\n(l) An individual subject of a record shall have access to the record according to those sections, except that the name of the reporter shall be confidential while the report is under assessment or investigation except as otherwise permitted by this section.\n(m) Any person conducting an investigation or assessment under this section who intentionally discloses the identity of a reporter before the completion of the investigation or assessment is guilty of a misdemeanor. After the assessment or investigation is completed, the name of the reporter shall be confidential. The subject of the report may compel disclosure of the name of the reporter only with the consent of the reporter or upon a written finding by the court that the report was false and that there is evidence that the report was made in bad faith. This subdivision does not alter disclosure responsibilities or obligations under the Rules of Criminal Procedure.\n(n) Upon request of the legislative auditor, data on individuals maintained under this chapter must be released to the legislative auditor in order for the auditor to fulfill the auditor's duties under section 3.971. The auditor shall maintain the data according to chapter 13.\n(o) Active law enforcement investigative data received by a local welfare agency or agency responsible for assessing or investigating the report under this chapter are confidential data on individuals. When this data become inactive in the law enforcement agency, the data are private data on individuals.\n(p) Section 13.03, subdivision 4, applies to data received by the commissioner of education from a licensing entity.\n(a) A local welfare or child protection agency or the agency responsible for assessing or investigating the report of maltreatment shall provide relevant private data on individuals obtained under this chapter to a mandated reporter who made the report and who has an ongoing responsibility for the health, education, or welfare of a child affected by the data, unless the agency determines that providing the data would not be in the best interests of the child.\n(b) The agency may provide the data to other mandated reporters with ongoing responsibility for the health, education, or welfare of the child. Mandated reporters with ongoing responsibility for the health, education, or welfare of a child affected by the data include the child's teachers or other appropriate school personnel, foster parents, health care providers, respite care workers, therapists, social workers, child care providers, residential care staff, crisis nursery staff, probation officers, and court services personnel. Under this chapter, a mandated reporter need not have made the report to be considered a person with ongoing responsibility for the health, education, or welfare of a child affected by the data. Data provided under this chapter must be limited to data pertinent to the individual's responsibility for caring for the child.\n(c) A reporter who receives private data on individuals under this subdivision must treat the data according to that classification, regardless of whether the reporter is an employee of a government entity. The remedies and penalties under sections 13.08 and 13.09 apply if a reporter releases data in violation of this chapter or other law.\nThe commissioner of education must be provided with all requested data that are relevant to a report of maltreatment and are in possession of a school facility as defined in section 260E.03, subdivision 6, clause (2), when the data are requested pursuant to an assessment or investigation of a maltreatment report of a student in a school. If the commissioner of education makes a determination of maltreatment involving an individual performing work within a school facility who is licensed by a board or other agency, the commissioner shall provide a copy of its offender maltreatment determination report to the licensing entity with all student-identifying information removed. The offender maltreatment determination report shall include but is not limited to the following sections: report of alleged maltreatment; legal standard; investigation; summary of findings; determination; corrective action by a school; reconsideration process; and a listing of records related to the investigation. Notwithstanding section 13.03, subdivision 4, data received by a licensing entity under this paragraph are governed by section 13.41 or other applicable law governing data of the receiving entity, except that this section applies to the classification of and access to data on the reporter of the maltreatment.\n(a) Notwithstanding sections 138.163 and 138.17, a record maintained or a record derived from a report of maltreatment by a local welfare agency, agency responsible for assessing or investigating the report, court services agency, or school under this chapter shall be destroyed as provided in paragraphs (b) to (e) by the responsible authority.\n(b) For a report alleging maltreatment that was not accepted for an assessment or an investigation, a family assessment case, a noncaregiver human trafficking assessment case, and a case where an investigation results in no determination of maltreatment or the need for child protective services, the record must be maintained for a period of five years after the date that the report was not accepted for assessment or investigation or the date of the final entry in the case record. A record of a report that was not accepted must contain sufficient information to identify the subjects of the report, the nature of the alleged maltreatment, and the reasons why the report was not accepted. Records under this paragraph may not be used for employment, background checks, or purposes other than to assist in future screening decisions and risk and safety assessments.\n(c) All records relating to reports that, upon investigation, indicate maltreatment or a need for child protective services shall be maintained for ten years after the date of the final entry in the case record.\n(d) All records regarding a report of maltreatment, including a notification of intent to interview that was received by a school under section 260E.22, subdivision 7, shall be destroyed by the school when ordered to do so by the agency conducting the assessment or investigation. The agency shall order the destruction of the notification when other records relating to the report under investigation or assessment are destroyed under this subdivision.\n(e) Private or confidential data released to a court services agency under subdivision 3, paragraph (d), must be destroyed by the court services agency when ordered to do so by the local welfare agency that released the data. The local welfare agency or agency responsible for assessing or investigating the report shall order destruction of the data when other records relating to the assessment or investigation are destroyed under this subdivision.\n[See Note.]\n(a) Notwithstanding any other provision of law and subject to this subdivision, a public agency shall disclose to the public, upon request, the findings and information related to a child fatality or near fatality if:\n(1) a person is criminally charged with having caused the child fatality or near fatality;\n(2) a county attorney certifies that a person would have been charged with having caused the child fatality or near fatality but for that person's death; or\n(3) a child protection investigation resulted in a determination of maltreatment.\n(b) Findings and information disclosed under this subdivision consist of a written summary that includes any of the following information the agency is able to provide:\n(1) the cause and circumstances regarding the child fatality or near fatality;\n(2) the age and gender of the child;\n(3) information on any previous reports of maltreatment that are pertinent to the maltreatment that led to the child fatality or near fatality;\n(4) information on any previous investigations that are pertinent to the maltreatment that led to the child fatality or near fatality;\n(5) the result of any investigations described in clause (4);\n(6) actions of and services provided by the local welfare agency on behalf of a child that are pertinent to the maltreatment that led to the child fatality or near fatality; and\n(7) the result of any review of the state child mortality review panel, a local child mortality review panel, a local community child protection team, or any public agency.\n(c) Nothing in this subdivision authorizes access to the private data in the custody of a local welfare agency or the disclosure to the public of the records or content of any psychiatric, psychological, or therapeutic evaluation or the disclosure of information that would reveal the identities of persons who provided information related to maltreatment of the child.\n(d) A person whose request is denied may apply to the appropriate court for an order compelling disclosure of all or part of the findings and information of the public agency. The application must set forth, with reasonable particularity, factors supporting the application. The court has jurisdiction to issue these orders. Actions under this chapter must be set down for immediate hearing and subsequent proceedings in those actions must be given priority by the appellate courts.\n(e) A public agency or its employees acting in good faith in disclosing or declining to disclose information under this chapter are immune from criminal or civil liability that might otherwise be incurred or imposed for that action.\nWhen interviewing a child under this chapter, an individual does not include the parent or guardian of the child for purposes of section 13.04, subdivision 2, when the parent or guardian is the alleged offender.",
	"repealed": false
}