{
	"id": "144G.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.31",
	"title": "144G.31 VIOLATIONS AND FINES.",
	"text": "Correction orders for violations are categorized by both level and scope.\nCorrection orders for violations are categorized by level as follows:\n(1) Level 1 is a violation that has no potential to cause more than a minimal impact on the resident and does not affect health or safety;\n(2) Level 2 is a violation that did not harm a resident's health or safety but had the potential to have harmed a resident's health or safety, but was not likely to cause serious injury, impairment, or death;\n(3) Level 3 is a violation that harmed a resident's health or safety, not including serious injury, impairment, or death, or a violation that has the potential to lead to serious injury, impairment, or death; and\n(4) Level 4 is a violation that results in serious injury, impairment, or death.\nLevels of violations are categorized by scope as follows:\n(1) isolated, when one or a limited number of residents are affected or one or a limited number of staff are involved or the situation has occurred only occasionally;\n(2) pattern, when more than a limited number of residents are affected, more than a limited number of staff are involved, or the situation has occurred repeatedly but is not found to be pervasive; and\n(3) widespread, when problems are pervasive or represent a systemic failure that has affected or has the potential to affect a large portion or all of the residents.\n(a) Fines and enforcement actions under this subdivision may be assessed based on the level and scope of the violations described in subdivisions 2 and 3 as follows and may be imposed immediately with no opportunity to correct the violation prior to imposition:\n(1) Level 1, no fines or enforcement;\n(2) Level 2, a fine of $500 per violation, in addition to any enforcement mechanism authorized in section 144G.20 for widespread violations;\n(3) Level 3, a fine of $3,000 per violation, in addition to any enforcement mechanism authorized in section 144G.20;\n(4) Level 4, a fine of $5,000 per violation, in addition to any enforcement mechanism authorized in section 144G.20; and\n(5) for maltreatment violations for which the licensee was determined to be responsible for the maltreatment under section 626.557, subdivision 9c, paragraph (c), a fine of $1,000 per incident. A fine of $5,000 per incident may be imposed if the commissioner determines the licensee is responsible for maltreatment consisting of sexual assault, death, or abuse resulting in serious injury.\n(b) When a fine is assessed against a facility for substantiated maltreatment, the commissioner shall not also impose an immediate fine under this chapter for the same circumstance.\n(a) For every Level 3 or Level 4 violation, the commissioner may issue an immediate fine. The licensee must still correct the violation in the time specified. The issuance of an immediate fine may occur in addition to any enforcement mechanism authorized under section 144G.20. The immediate fine may be appealed as allowed under this chapter.\n(b) The licensee must pay the fines assessed on or before the payment date specified. If the licensee fails to fully comply with the order, the commissioner may issue a second fine or suspend the license until the licensee complies by paying the fine. A timely appeal shall stay payment of the fine until the commissioner issues a final order.\n(c) A licensee shall promptly notify the commissioner in writing when a violation specified in the order is corrected. If upon reinspection the commissioner determines that a violation has not been corrected as indicated by the order, the commissioner may issue an additional fine. The commissioner shall notify the licensee by mail to the last known address in the licensing record that a second fine has been assessed. The licensee may appeal the second fine as provided under this subdivision.\n(d) A facility that has been assessed a fine under this section has a right to a reconsideration or hearing under this chapter and chapter 14.\nWhen a fine has been assessed, the licensee may not avoid payment by closing, selling, or otherwise transferring the license to a third party. In such an event, the licensee shall be liable for payment of the fine.\nIn addition to any fine imposed under this section, the commissioner may assess a penalty amount based on costs related to an investigation that results in a final order assessing a fine or other enforcement action authorized by this chapter.\nFines collected under this section shall be deposited in a dedicated special revenue account. On an annual basis, the balance in the special revenue account shall be appropriated to the commissioner for special projects to improve resident quality of care and outcomes in assisted living facilities licensed under this chapter in Minnesota as recommended by the advisory council established in section 144A.4799.",
	"repealed": false
}