{
	"id": "144G.62",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.62",
	"title": "144G.62 DELEGATION AND SUPERVISION.",
	"text": "(a) Assisted living facilities must have a registered nurse available for consultation by staff performing delegated nursing tasks and must have an appropriate licensed health professional available if performing other delegated services such as therapies.\n(b) The appropriate contact person must be readily available either in person, by telephone, or by other means to the staff at times when the staff is providing services.\n(a) A registered nurse or licensed health professional may delegate tasks only to staff who are competent and possess the knowledge and skills consistent with the complexity of the tasks and according to the appropriate Minnesota practice act. The assisted living facility must establish and implement a system to communicate up-to-date information to the registered nurse or licensed health professional regarding the current available staff and their competency so the registered nurse or licensed health professional has sufficient information to determine the appropriateness of delegating tasks to meet individual resident needs and preferences.\n(b) When the registered nurse or licensed health professional delegates tasks to unlicensed personnel, that person must ensure that prior to the delegation the unlicensed personnel is trained in the proper methods to perform the tasks or procedures for each resident and is able to demonstrate the ability to competently follow the procedures and perform the tasks. If an unlicensed personnel has not regularly performed the delegated assisted living task for a period of 24 consecutive months, the unlicensed personnel must demonstrate competency in the task to the registered nurse or appropriate licensed health professional. The registered nurse or licensed health professional must document instructions for the delegated tasks in the resident's record.\n(a) Staff who only provide assisted living services specified in section 144G.08, subdivision 9, clauses (1) to (5), must be supervised periodically where the services are being provided to verify that the work is being performed competently and to identify problems and solutions to address issues relating to the staff's ability to provide the services. The supervision of the unlicensed personnel must be done by staff of the facility having the authority, skills, and ability to provide the supervision of unlicensed personnel and who can implement changes as needed, and train staff.\n(b) Supervision includes direct observation of unlicensed personnel while the unlicensed personnel are providing the services and may also include indirect methods of gaining input such as gathering feedback from the resident. Supervisory review of staff must be provided at a frequency based on the staff person's competency and performance.\n(a) Staff who perform delegated nursing or therapy tasks must be supervised by an appropriate licensed health professional or a registered nurse according to the assisted living facility's policy where the services are being provided to verify that the work is being performed competently and to identify problems and solutions related to the staff person's ability to perform the tasks. Supervision of staff performing medication or treatment administration shall be provided by a registered nurse or appropriate licensed health professional and must include observation of the staff administering the medication or treatment and the interaction with the resident.\n(b) The direct supervision of staff performing delegated tasks must be provided within 30 calendar days after the date on which the individual begins working for the facility and first performs the delegated tasks for residents and thereafter as needed based on performance. This requirement also applies to staff who have not performed delegated tasks for one year or longer.\nA facility must retain documentation of supervision activities in the personnel records.",
	"repealed": false
}