{
	"id": "319B.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/319B.03",
	"title": "319B.03 AUTHORITY OF MINNESOTA FIRMS TO FURNISH PROFESSIONAL SERVICES; ELECTION TO INVOKE THE ACT.",
	"text": "(a) A Minnesota firm that has in effect an election under subdivision 2 may furnish professional services within Minnesota as provided in sections 319B.01 to 319B.12. A Minnesota firm may furnish professional services within Minnesota without making an election under subdivision 2 only if:\n(1) no Minnesota statute, Minnesota rule, or tenet of Minnesota common law requires the Minnesota firm to make that election in order to furnish professional services within Minnesota; and\n(2) no Minnesota statute, Minnesota rule, or tenet of Minnesota common law precludes the Minnesota firm from furnishing professional services within Minnesota in the absence of that election.\n(b) A Minnesota professional firm may provide professional services and exercise the ancillary powers permitted under section 319B.06, subdivision 1, paragraph (c), in another state if:\n(1) the Minnesota professional firm is authorized to provide the services and exercise the powers within Minnesota;\n(2) the Minnesota firm's organizational document does not prohibit the Minnesota professional firm from providing the services or exercising the powers in the other state;\n(3) in the case of a Minnesota professional firm that is a limited liability partnership, the partnership agreement does not prohibit the Minnesota professional firm from providing the services or exercising the powers in the other state; and\n(4) the Minnesota professional firm complies with all applicable laws of that other state regulating the furnishing of professional services and exercising of ancillary powers in that state.\nTo elect to become a Minnesota professional firm and be authorized to furnish professional services according to sections 319B.01 to 319B.12, a Minnesota firm must in its organizational document:\n(1) state that the Minnesota firm elects to operate under those sections;\n(2) acknowledge that the Minnesota firm is subject to those sections; and\n(3) specify from the list stated in section 319B.02, subdivision 19, the category or categories of professional services the Minnesota firm is authorized to provide.\nThe statement, acknowledgment, and specification may be made when a Minnesota firm initially files the organizational document or may be added at a later time by updating that document.\n(a) A Minnesota professional firm may rescind its election by updating its organizational document to delete the statement, acknowledgment, and specification required by subdivision 2.\n(b) A Minnesota professional firm may update its organizational document to change the specification required by subdivision 2, clause (3).\nIf a Minnesota firm has an election under subdivision 2 in effect and the Minnesota firm's generally applicable governing law conflicts with sections 319B.01 to 319B.12, sections 319B.01 to 319B.12 govern.",
	"repealed": false
}