{
	"id": "297I.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/297I.30",
	"title": "297I.30 DUE DATES FOR FILING RETURNS.",
	"text": "On or before March 1, every taxpayer subject to taxation under section 297I.05, subdivisions 1 to 5; 7, paragraph (b); 12; and 14, shall file an annual return for the preceding calendar year in the form prescribed by the commissioner.\nOn or before February 15 and August 15 of each year, every surplus lines broker subject to taxation under section 297I.05, subdivision 7, paragraph (a), shall file a return with the commissioner for the preceding six-month period ending December 31, or June 30, in the form prescribed by the commissioner.\n[Repealed, 1Sp2001 c 5 art 13 s 15]\n[Repealed, 2010 c 389 art 6 s 20]\n[Repealed, 2010 c 389 art 6 s 20]\n[Repealed, 2010 c 389 art 6 s 20]\n(a) By June 30 of each year, every company required to pay the surcharge under section 297I.10, subdivision 1, shall file a return for the seven-month period ending May 31 in the form prescribed by the commissioner.\n(b) By November 30 of each year, every company required to pay the surcharge under section 297I.10, subdivision 1, shall file a return for the five-month period ending October 31 in the form prescribed by the commissioner.\nOn or before May 15, August 15, November 15, and February 15 of each year, every insurer required to pay the surcharge under section 297I.06, subdivisions 1 and 2, shall file a return with the commissioner for the preceding three-month period ending March 31, June 30, September 30, and December 31, in the form prescribed by the commissioner.\nWhen, in the commissioner's judgment, good cause exists, the commissioner may extend the time for filing returns for not more than six months.\nOn or before May 1, August 1, November 1, and February 1 of each year, every insurer required to pay the surcharge under section 297I.11 shall file a return with the commissioner for the preceding three-month period ending March 31, June 30, September 30, and December 31, in the form prescribed by the commissioner.\nThe commissioner shall prescribe the content, format, and manner of returns or other documents pursuant to section 270C.30.",
	"repealed": false
}