{
	"id": "447.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/447.38",
	"title": "447.38 DISSOLUTION: DETACHMENT OF TERRITORY.",
	"text": "A hospital district created or reorganized pursuant to sections 447.31 to 447.37 may be dissolved upon a petition to the hospital district board. The petition must state the grounds for dissolution, be signed by an authorized officer or officers of the governing body of any city or town included in the hospital district pursuant to a resolution of the governing body, and contain a proposal for distribution of the remaining funds of the district, if any, among the related governmental subdivisions. Except as otherwise provided, a proceeding for dissolution is governed by the provisions relating to proceedings for the organization of districts, so far as applicable. If the board determines that the conditions for the creation of the district no longer exist, that all indebtedness of the district has been paid, and that all property of the district except funds has been disposed of, it may make an order dissolving the district and directing the distribution of its remaining funds, if any, among the related governmental subdivisions on a basis the board determines to be just and equitable, to be specified in the order. Certified copies of the order for dissolution must be transmitted and filed as provided for an order creating a district. The clerk of the board shall also transmit a certified copy of the order to the treasurer of the district. The treasurer shall then distribute the remaining funds of the district as directed by the order, and is responsible for the funds until distributed.\nA city or town included in the hospital district may be detached from it by the same procedure provided for dissolution of the district. On detachment, all taxable property within the detached area remains subject to taxation for any existing bonded indebtedness of the district to the same extent as it would have been if not detached. The property remains subject to taxation for any other existing indebtedness of the district incurred for any purpose beneficial to the area to the extent the board finds just and equitable, to be specified in the order for detachment. The proper officers shall levy further taxes on the property accordingly.",
	"repealed": false
}