{
	"id": "308B.725",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.725",
	"title": "308B.725 ALLOCATIONS AND DISTRIBUTIONS TO PATRON MEMBERS.",
	"text": "A cooperative may set aside a portion of net income allocated to the patron membership interests as the board determines advisable to create or maintain a capital reserve.\nIn addition to a capital reserve, the board may, for patron membership interests:\n(1) set aside an amount not to exceed five percent of the annual net income of the cooperative for promoting and encouraging cooperative organization; and\n(2) establish and accumulate reserves for new buildings, machinery and equipment, depreciation, losses, and other proper purposes.\nNet income allocated to patron members in excess of dividends on equity and additions to reserves shall be distributed to patron members on the basis of patronage. A cooperative may establish allocation units, whether the units are functional, divisional, departmental, geographic, or otherwise and pooling arrangements and may account for and distribute net income to patrons on the basis of allocation units and pooling arrangements. A cooperative may offset the net loss of an allocation unit or pooling arrangement against the net income of other allocation units or pooling arrangements.\nDistribution of net income shall be made at least annually. The board shall present to the members at their annual meeting a report covering the operations of the cooperative during the preceding fiscal year.\nA cooperative may distribute net income to patron members in cash, capital credits, allocated patronage equities, revolving fund certificates, or its own or other securities.\nThe cooperative may provide in the bylaws that nonmember patrons are allowed to participate in the distribution of net income payable to patron members on equal terms with patron members.\nIf a nonmember patron with patronage credits is not qualified or eligible for membership, a refund due may be credited to the patron's individual account. The board may issue a certificate of interest to reflect the credited amount. After the patron is issued a certificate of interest, the patron may participate in the distribution of income on the same basis as a patron member.",
	"repealed": false
}