{
	"id": "626.845",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.845",
	"title": "626.845 POWERS AND DUTIES.",
	"text": "The board shall have the following powers and duties:\n(1) to certify postsecondary schools to provide programs of professional peace officer education based on a set of board-approved professional peace officer education learning objectives;\n(2) to issue certificates to postsecondary schools, and to revoke certification when necessary to maintain the objectives and purposes of sections 626.841 to 626.863;\n(3) to license peace officers who have met the education and experience requirements and passed examinations as required by the board;\n(4) to develop and administer licensing examinations based on the board's learning objectives;\n(5) to consult and cooperate with continuing education providers for the development of in-service training programs for peace officers;\n(6) to consult and cooperate with postsecondary schools for the development and improvement of professional peace officer education;\n(7) to consult and cooperate with other departments and agencies of the state and federal government concerned with peace officer standards and training;\n(8) to perform such other acts as may be necessary and appropriate to carry out the powers and duties of sections 626.841 to 626.863;\n(9) to obtain criminal conviction data for persons seeking a license to be issued or possessing a license issued by the board. The board shall have authority to obtain criminal conviction data to the full extent that any other law enforcement agency, as that term is defined by state or federal law, has to obtain the data;\n(10) to prepare and transmit annually to the governor a report of its activities with respect to allocation of money appropriated to it for peace officers training, including the name of each recipient of money for that purpose and the amount awarded; and\n(11) to assist and cooperate with any political subdivision or state law enforcement agency that employs persons licensed by the board to establish written policies as mandated by the state pertaining to persons licensed by the board, and to enforce licensing sanctions for failure to implement these policies.\nIn addition, the board may maintain data received from law enforcement agencies under section 626.87, subdivision 5, provide the data to requesting law enforcement agencies who are conducting background investigations, and maintain data on applicants and licensees as part of peace officer license data. The data that may be maintained include the name of the law enforcement agency conducting the investigation and data on the candidate provided under section 626.87, subdivision 5, clauses (1) and (2).\n[Repealed, 1988 c 563 s 8]\nThe board, in consultation with the Minnesota Chiefs of Police Association, Minnesota Sheriffs' Association, and Minnesota Police and Peace Officers Association, shall create a central repository for peace officer data. The database shall be designed to receive, in real time, the data required to be submitted to the board by law enforcement agencies in section 626.8457, subdivision 3, paragraph (b). To ensure the anonymity of individuals, the database must use encrypted data to track information transmitted on individual peace officers.",
	"repealed": false
}