{
	"id": "116J.5491",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.5491",
	"title": "116J.5491 ENERGY TRANSITION OFFICE.",
	"text": "(a) For purposes of sections 116J.5491 to 116J.5493, the following terms have the meanings given.\n(b) \"Impacted community\" means a municipality, Tribal government, or county in which an impacted facility is located.\n(c) \"Impacted facility\" means an electric generating unit powered by coal, nuclear energy, or natural gas that is or was owned by a public utility, as defined in section 216B.02, subdivision 4, and that:\n(1) is currently operating and (i) is projected, estimated, or scheduled to cease operations, or (ii) whose cessation of operations has been proposed in an integrated resource plan filed with the Public Utilities Commission under section 216B.2422; or\n(2) ceased operations or was removed from the local property tax base no earlier than five years before July 1, 2021.\n(d) \"Impacted worker\" means a Minnesota resident:\n(1) employed at an impacted facility and who is facing the loss of employment as a result of the impacted facility's retirement; or\n(2) employed by a company that, under contract, regularly performs construction, maintenance, or repair work at an impacted facility and who is facing the loss of employment or of work opportunities as a result of the impacted facility's retirement.\n(a) The Energy Transition Office is established in the Department of Employment and Economic Development.\n(b) The director of the Energy Transition Office is appointed by the commissioner of employment and economic development. The director must be qualified by experience in issues related to energy, economic development, and the environment.\n(c) The office may employ staff necessary to carry out the duties required in this section.\nThe purpose of the office is to:\n(1) address economic dislocations experienced by impacted workers after an impacted facility is retired;\n(2) implement recommendations of the Minnesota energy transition plan developed in section 116J.5493;\n(3) improve communication among local, state, federal, and private entities regarding impacted facility retirement planning and implementation;\n(4) address local tax and fiscal issues related to the impacted facility's retirement and develop strategies to reduce the resulting economic dislocation experienced by impacted communities and impacted workers; and\n(5) assist the establishment and implementation of economic support programs, including but not limited to property tax revenue replacement, community energy transition programs, and economic development tools, for impacted communities and impacted workers.\nThe office is authorized to:\n(1) administer programs to support impacted communities and impacted workers;\n(2) coordinate local, state, and federal resources to support impacted communities and impacted workers;\n(3) coordinate the development of statewide policies addressing impacted communities and impacted workers;\n(4) deliver programs and resources to impacted communities and impacted workers;\n(5) support impacted workers by establishing benefits and educating impacted workers on applying for benefits;\n(6) act as a liaison among impacted communities, impacted workers, and state agencies;\n(7) assist state agencies to (i) address local tax, land use, economic development, and fiscal issues related to an impacted facility's retirement, and (ii) develop strategies to support impacted communities and impacted workers;\n(8) review existing programs supporting impacted workers and identify gaps that need to be addressed;\n(9) support activities of the energy transition advisory committee members;\n(10) monitor transition efforts in other states and localities;\n(11) identify impacted facility closures and estimate job losses and the effect on impacted communities and impacted workers;\n(12) maintain communication with all affected parties regarding closure dates; and\n(13) monitor and participate in administrative proceedings that affect the office's activities, including matters before the Public Utilities Commission, the Department of Commerce, the Department of Revenue, and other entities.\n(a) Beginning January 15, 2023, and each year thereafter, the Energy Transition Office must submit a written report to the chairs and ranking minority members of the legislative committees with jurisdiction over energy, economic development, and tax policy and finance on the office's activities during the previous year.\n(b) The report must contain:\n(1) a list of impacted facility closures, projected associated job losses, and the effect on impacted communities and impacted workers;\n(2) recommendations to support impacted communities and impacted workers;\n(3) information on the administration of assistance programs administered by the office; and\n(4) updates on implementation of the Minnesota energy transition plan.\nThe office may accept gifts and grants on behalf of the state that constitute donations to the state. Funds received under this subdivision are appropriated to the commissioner of employment and economic development to support the purposes of the office.\nThis section expires five years after the date the last impacted facility in Minnesota ceases operations.",
	"repealed": false
}