{
	"id": "308A.635",
	"url": "https://www.revisor.mn.gov/statutes/cite/308A.635",
	"title": "308A.635 MEMBER VOTING RIGHTS.",
	"text": "A member of a cooperative is only entitled to one vote, except that a member of a cooperative described in section 308A.641 may be entitled to more than one vote as provided in that section.\nIf a vote of members is taken on any matter, including a petition pursuant to section 216B.02, subdivision 4, the spouse of the member may vote on behalf of the member unless the member has indicated otherwise.\nA member or delegate may exercise voting rights on any matter that is before the members at a members' meeting from the time the member or delegate arrives at the members' meeting, unless the articles or bylaws specify an earlier and specific time for closing the right to vote.\nA member's vote at a members' meeting must be in person or by mail if a mail vote is authorized by the board, or by electronic means if an electronic vote is authorized by the board, and not by proxy except as provided in subdivisions 2 and 5.\n(a) A cooperative may provide in the articles or bylaws that local units of members are entitled to be represented at members' meetings by delegates chosen by the members of the unit. The delegates may vote on matters at the members' meeting in the same manner as a member. The delegates may only exercise the voting rights on a basis and with the number of votes as prescribed in the articles or bylaws.\n(b) If the approval of a certain portion of the members is required for adoption of amendments, a dissolution, a merger, a consolidation, or a sale of assets, the votes of delegates shall be counted as votes by the members represented by the delegate.\nNotwithstanding the provisions of this section, the requirements and procedures for membership voting for a health care cooperative shall be as provided in the bylaws.\n(a) A member who is absent from a members' meeting may vote by mail or by electronic means on the ballot prescribed in this subdivision on any motion, resolution, or amendment that the board submits for vote by mail to the members.\n(b) The ballot shall be in the form prescribed by the board and contain:\n(1) the exact text of the proposed motion, resolution, or amendment to be acted on at the meeting; and\n(2) spaces opposite the text of the motion, resolution, or amendment in which the member may indicate an affirmative or negative vote.\n(c) If the vote is by mail, the member shall express a choice by marking an \"X\" in the appropriate space on the ballot and mail or deliver the ballot to the cooperative in a plain, sealed envelope inside another envelope bearing the member's name.\n(d) The member may vote by electronic means if the cooperative is able to authenticate that it is the cooperative member who is casting the vote.\n(e) A properly executed ballot shall be accepted by the board and counted as the vote of the absent member at the meeting.",
	"repealed": false
}