{
	"id": "216B.1675",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.1675",
	"title": "216B.1675 PERFORMANCE REGULATION PLAN FOR GAS UTILITY SERVICE.",
	"text": "Performance-based regulation plans for public utilities offering natural gas services are authorized in order to provide quality service at rates that can reasonably and reliably be expected to be materially lower than rates would be under current regulation and to reduce the cost of regulation. Performance-based regulation plans are intended to provide the utility with increased earnings for efficient performance and decreased earnings for inefficient performance.\nA public utility that furnishes natural gas service may petition and file with the commission for its approval a performance regulation plan pursuant to this section. The plan applies to the utility's rates for providing natural gas distribution service, excluding the portion of the rates recovering the cost of natural gas supplies. If adopted, the plan must apply to all of the utility's customers, except that nothing in this section requires the utility to adjust the rates collected from customers receiving service under tariffs authorized by sections 216B.16, subdivision 15, and 216B.163. A petition may be filed:\n(1) as part of a general rate filing pursuant to section 216B.16, in which case the time provided for the commission to suspend rates and make a final determination shall be extended by two months; or\n(2) as a miscellaneous tariff filing pursuant to section 216B.16, in which case the commission shall, within 120 days of the date of the filing, determine whether the utility's current rates are reasonable based on financial information for the most recent calendar year, amended to reflect appropriate regulatory adjustments. If the commission cannot resolve all material issues concerning the reasonableness of the utility's current rates to its satisfaction, it shall dismiss the filing. If the filing is not dismissed, the commission shall issue its decision on the plan within ten months from the date of the filing. The rates at the beginning of the plan shall be the same as the rates on file with the commission prior to the filing.\nThe commission may approve a performance regulation plan for natural gas distribution services upon finding that the plan:\n(1) contains a benchmark or measure of gas distribution costs that is a reasonable and reliable predictor of the utility's rates for gas distribution service under cost-of-service regulation;\n(2) ensures that rates for gas distribution services to customers under the plan will be materially lower than the rates would be under cost-of-service regulation as predicted by the benchmark in clause (1);\n(3) links the utility's earnings to its performance by permitting higher utility earnings than under cost-of-service regulation only when the utility's performance is more efficient than the benchmark;\n(4) can be reasonably and reliably expected to offer lower administrative costs than would otherwise be experienced under cost-of-service regulation;\n(5) contains a reasonable limit on utility earnings;\n(6) has adequate provisions to prevent the degradation of service quality; and\n(7) provides for gathering of relevant data and evaluation of the plan's effect on rates, service quality, utility earnings, competition in providing natural gas, and regulatory costs.\nThe initial rate adjustment under the plan may not be implemented for a minimum of 18 months following the final determination by the commission on the plan. The plan shall provide a methodology and procedures for changing rates thereafter not more frequently than on an annual basis. The commission may allow the utility to change rates to reflect material changes in cost due to compliance with government mandates provided that the cost is one that the commission would otherwise allow to be recovered in rates. Increases or decreases in revenues under the plan shall be applied on an equal percentage basis to each customer class, excluding the portion of the rate recovering the cost of natural gas supplies. Miscellaneous rate changes may be approved outside the operation of the plan.\nInterested parties have, unless the commission otherwise orders, 45 days from the date a petition containing a proposed plan is filed to submit comments on whether the plan, as proposed, addresses each of the requirements of this section sufficiently to merit further consideration. If the commission does not dismiss the petition proposing a plan as insufficient within 120 days from the date of the filing, the petition shall be deemed accepted for filing. A petition accepted for filing shall not be presumed accepted for final adoption.\nA plan must require the filing of information needed to administer the plan.\nThe petitioning utility must provide notice of the proposed plan to its customers and to the governing body of each municipality and county in the area affected, along with a summary description of the plan provisions and a notice of the dates, times, and locations of any public meetings scheduled by the commission.\nIn reviewing a proposed plan, the commission shall:\n(1) conduct public meetings that it considers appropriate; and\n(2) grant discovery, as appropriate.\nThe commission shall issue findings concerning the appropriateness of the proposed plan. The commission may approve, reject, or modify the plan in a manner which meets the requirements of this section. An approved or modified plan becomes effective unless the plan is withdrawn by the utility within 30 days of a final appealable order. If the utility withdraws an approved or modified plan, all of the administrative costs related to the plan that are charged by the commission or the department to the utility may not be recovered from ratepayers in current or subsequent rates. A utility that withdraws an approved or modified plan may not file another plan under this section for a period of one year following the withdrawal of the plan.\nThe plan shall specify its term, which shall not be less than three years. Not less than six months before the completion of the term of an approved plan, the commission shall, at the request of the utility, commence a review of the plan to determine whether to renew the plan for an additional term. The commission may approve, reject, or modify the renewal plan in a manner that meets the requirements of this section. A plan approved or modified under this subdivision becomes effective unless the plan is withdrawn by the utility within 30 days of a final appealable order.\nOn its own motion or upon the petition of any party other than the utility, the commission may initiate an investigation to determine whether to terminate the plan. The commission shall issue findings on the investigation within 120 days. If the commission finds that the plan has failed to meet the requirements of this section and is inconsistent with the public interest, it shall terminate the plan and may order the utility to initiate any proceedings necessary to correct the failure of the plan, including but not limited to, filing a general rate proceeding under section 216B.16. The utility must be allowed at least 120 days after the date of the commission's order to initiate the general rate proceeding.\nA plan must include an evaluation process and mechanism that is reasonable and capable of supporting a full review of the utility's performance under the plan. The commission shall evaluate the various customer and utility impacts of a plan based on this evaluation process and mechanism, including the impact on customer bills and service quality, over time, the impact on utility revenues, and the effectiveness of the plan in meeting the purposes of this section. The evaluation must occur within a reasonable time following the end of the plan.\nThe commission shall evaluate the effectiveness of all plans approved under this section and submit its findings to the legislature by January 1, 2012.",
	"repealed": false
}