{
	"id": "629.291",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.291",
	"title": "629.291 TRANSFER OF STATE INMATES TO FEDERAL DISTRICT COURT.",
	"text": "The attorney general of the United States, or any of the attorney general's assistants, or the United States attorney for the district of Minnesota, or any of the United States attorney's assistants, may file a petition with the governor requesting the state of Minnesota to consent to transfer an inmate, serving a sentence in a Minnesota correctional facility for violation of a Minnesota criminal law, to the United States District Court for the purpose of being tried for violation of a federal criminal law. In order for a petition to be filed under this section, the inmate must at the time of the filing of the petition be under indictment in the United States District Court for Minnesota for violation of a federal criminal law. The petition must name the inmate for whom transfer is requested and the Minnesota correctional facility in which the inmate is imprisoned. The petition must be verified and have a certified copy of the federal indictment attached to it. The petitioner must agree in the petition to pay all expenses incurred by the state in transferring the inmate to the United States court for trial.\nUpon hearing a petition, the governor may consent to transfer of the inmate on behalf of the state of Minnesota if satisfied as to the identity of the inmate sought to be transferred. Upon receiving proper process issued by the United States District Court stating the time and place where the inmate will be tried, the governor may issue an order directing the chief executive officer of the correctional facility in which the inmate is imprisoned to transfer the inmate to the United States District Court for the district of Minnesota. The order must direct the chief executive officer of the facility to retain custody of the inmate during the trial in federal court and, at conclusion of the trial after judgment is pronounced by the United States District Court, direct the federal court to return the inmate to the correctional facility from which the inmate was taken. The order must require that an inmate sentenced for a violation of a federal criminal law after transfer under this section and trial serve the remainder of the sentence imposed for violation of a Minnesota criminal law before being released to the federal authorities.\nBefore release of an inmate who has been sentenced for a violation of a federal criminal law in United States District Court, the chief executive officer of the correctional facility in which the inmate is serving a sentence for violation of a Minnesota criminal law shall notify the United States marshal for the district of Minnesota. Upon release of the inmate, the chief executive officer shall surrender the inmate to the federal authorities to be dealt with in accordance with the laws of the United States.",
	"repealed": false
}