{
	"id": "82.55",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.55",
	"title": "82.55 DEFINITIONS.",
	"text": "For the purposes of this chapter the terms defined in this section have the meanings given to them.\nFor purposes of this chapter, \"automated valuation model\" means a computerized model used by mortgage originators and secondary market issuers to determine the collateral worth of a mortgage secured, or to be secured, by a consumer's principal dwelling.\nFor purposes of this chapter, \"broker price opinion\" or \"BPO\" means an estimate prepared by a real estate broker, real estate salesperson, or licensed real estate appraiser that details the probable selling price of a particular parcel of real property and provides a varying level of detail about the property's condition, market, and neighborhood, and information on comparable sales, but does not include an automated valuation model.\n\"Brokerage\" or \"business entity\" means a corporation, partnership, limited liability company, limited liability partnership, or other business structure that holds a real estate broker license.\n\"Business of financial planning\" means providing, or offering to provide, financial planning services or financial counseling or advice, on a group or individual basis. A person who, on advertisements, cards, signs, circulars, letterheads, or in any other manner, indicates that the person is a \"financial planner,\" \"financial counselor,\" \"financial adviser,\" \"investment counselor,\" \"estate planner,\" \"investment adviser,\" \"financial consultant,\" or any other similar designation or title or combination thereof, is considered to be representing himself or herself to be engaged in the business of financial planning.\n\"Buyer's broker\" means a licensee who represents a buyer under a signed buyer's broker agreement. A buyer's broker owes to the buyer fiduciary duties.\n\"Closing agent\" or \"real estate closing agent\" means any person whether or not acting as an agent for a title insurance agent, a licensed attorney, real estate broker, or real estate salesperson, who for another and with or without a commission, fee, or other valuable consideration or with or without the intention or expectation of receiving a commission, fee, or other valuable consideration, directly or indirectly provides closing services incident to the sale, trade, lease, or loan of residential real estate, including drawing or assisting in drawing papers incident to the sale, trade, lease, or loan, or advertises or claims to be engaged in these activities.\n\"Commissioner\" means the commissioner of commerce or a designee.\n\"Dual agency\" means a situation in which a licensee owes a duty to more than one party to the transaction.\nCircumstances which establish dual agency include the following:\n(1) when one licensee represents both the buyer and the seller in a real estate transaction; or\n(2) when two or more licensees, licensed to the same broker, each represent a party to the transaction.\n\"Electronic agent\" means a computer program or an electronic or other automated means used independently to initiate an action or respond to electronic records or performances, in whole or in part, without review or action by an individual.\n\"Electronic record\" means a record created, generated, sent, communicated, received, or stored by electronic means.\n\"Electronic signature\" means an electronic sound, symbol, or process attached to or logically associated with a record and executed or adopted by a person with the intent to sign the record.\n\"Licensee\" means a person duly licensed under this chapter.\n\"Loan broker\" means a licensed real estate broker or salesperson who, for another and for an advance fee or with the intention or expectation of receiving the same, directly or indirectly, negotiates or offers or attempts to negotiate a loan secured or to be secured by a mortgage or other encumbrance on real estate, or represents himself or herself or otherwise holds himself or herself out as a licensed real estate broker or salesperson, either in connection with any transaction in which he or she directly or indirectly negotiates or offers or attempts to negotiate a loan, or in connection with the conduct of his or her ordinary business activities as a loan broker.\n\"Loan broker\" does not include a licensed real estate broker or salesperson who, in the course of representing a purchaser or seller of real estate, incidentally assists the purchaser or seller in obtaining financing for the real property in question if the licensee does not receive a separate commission, fee, or other valuable consideration for this service.\nFor the purposes of this subdivision, an \"advance fee\" means a commission, fee, charge, or compensation of any kind paid before the closing of a loan, that is intended in whole or in part as payment for finding or attempting to find a loan for a borrower. Advance fee does not include pass-through fees or commitment or extended lock fees or other fees as determined by the commissioner.\n\"Overpayment\" means any payment of money in excess of a statutory fee or for a license for which a person does not qualify.\n\"Override clause\" means:\n(1) a provision in a listing agreement or similar instrument allowing the broker to receive compensation when, after the listing agreement has expired, the property is sold to persons with whom a broker or salesperson had negotiated or shown the property prior to the expiration of the listing agreement; or\n(2) a provision in the buyer's representation agreement or similar instrument allowing the broker to receive compensation when, after the buyer's representation agreement has expired, the buyer has purchased a property the salesperson had shown the buyer prior to the expiration of the buyer's agreement.\n\"Person\" means a natural person, firm, partnership, corporation or association, and the officers, directors, employees and agents thereof.\n\"Primary broker\" means the broker on whose behalf salespersons are licensed to act pursuant to section 82.63, subdivision 4. In the case of a corporation licensed as a broker, \"primary broker\" means each officer of the corporation who is individually licensed to act as broker for the corporation. In the case of a partnership, \"primary broker\" means each partner licensed to act as a broker for the partnership. In the case of a limited liability company licensed as a broker, \"primary broker\" means each officer of the company who is individually licensed to act as a broker for the company.\n\"Protective list\" means:\n(1) the written list of names and addresses of prospective buyers with whom a licensee has negotiated the sale or rental of the property or to whom a licensee has exhibited the property before the expiration of the listing agreement. For the purposes of this subdivision, \"property\" means the property that is the subject of the listing agreement in question; or\n(2) the written list of addresses of properties that a licensee has negotiated the sale or rental of before the expiration of the buyer's agreement.\n[Repealed, 2014 c 199 s 37]\nFor purposes of this chapter, \"real estate\" shall also include a manufactured home, when such manufactured home is affixed to land. Manufactured home means any factory built structure or structures equipped with the necessary service connections and made so as to be readily movable as a unit or units and designed to be used as a dwelling unit or units.\n\"Real estate broker\" or \"broker\" means any person who:\n(a) for another and for commission, fee, or other valuable consideration or with the intention or expectation of receiving the same directly or indirectly lists, sells, exchanges, buys or rents, manages, or offers or attempts to negotiate a sale, option, exchange, purchase or rental of an interest or estate in real estate, or advertises or holds out as engaged in these activities;\n(b) for another and for commission, fee, or other valuable consideration or with the intention or expectation of receiving the same directly or indirectly negotiates or offers or attempts to negotiate a loan, secured or to be secured by a mortgage or other encumbrance on real estate, which is not a residential mortgage loan as defined by section 58.02, subdivision 18;\n(c) \"real estate broker\" or \"broker\" as set forth in clause (b) shall not apply to the originating, making, processing, selling, or servicing of a loan in connection with the ordinary business activities of a mortgagee, lender, or servicer approved or certified by the secretary of Housing and Urban Development, or approved or certified by the administrator of Veterans Affairs, or approved or certified by the administrator of the Farmers Home Administration, or approved as a multifamily seller/servicer by the Federal Home Loan Mortgage Corporation, or as a multifamily partner approved by the Federal National Mortgage Association;\n(d) for another and for commission, fee, or other valuable consideration or with the intention or expectation of receiving the same directly or indirectly lists, sells, exchanges, buys, rents, manages, offers or attempts to negotiate a sale, option, exchange, purchase or rental of any business opportunity or business, or its good will, inventory, or fixtures, or any interest therein;\n(e) for another and for commission, fee, or other valuable consideration or with the intention or expectation of receiving the same directly or indirectly offers, sells or attempts to negotiate the sale of property that is subject to the registration requirements of chapter 83, concerning subdivided land;\n(f) for another and for commission, fee, or other valuable consideration or with the intention or expectation of receiving the same, promotes the sale of real estate by advertising it in a publication issued primarily for this purpose, if the person:\n(1) negotiates on behalf of any party to a transaction;\n(2) disseminates any information regarding the property to any party or potential party to a transaction subsequent to the publication of the advertisement, except that in response to an initial inquiry from a potential purchaser, the person may forward additional written information regarding the property which has been prepared prior to the publication by the seller or broker or a representative of either;\n(3) counsels, advises, or offers suggestions to the seller or a representative of the seller with regard to the marketing, offer, sale, or lease of the real estate, whether prior to or subsequent to the publication of the advertisement;\n(4) counsels, advises, or offers suggestions to a potential buyer or a representative of the seller with regard to the purchase or rental of any advertised real estate; or\n(5) engages in any other activity otherwise subject to licensure under this chapter;\n(g) engages wholly or in part in the business of selling real estate to the extent that a pattern of real estate sales is established, whether or not the real estate is owned by the person. A person shall be presumed to be engaged in the business of selling real estate if the person engages as principal in five or more transactions during any 12-month period, unless the person is represented by a licensed real estate broker or salesperson.\n\"Real estate salesperson\" means one who acts on behalf of a real estate broker in performing any act authorized by this chapter to be performed by the broker.\n\"Rental service\" means a person who gathers and catalogs information concerning apartments or other units of real estate available for rent, and who, for a fee, provides information intended to meet the individual needs of specifically identified lessors or prospective lessees. \"Rental service\" does not apply to newspapers or other periodicals with a general circulation or individual listing contracts between an owner or lessor of property and a licensee.\n\"Responsible person\" means a natural person that is an officer of a corporation, a partner of a partnership, a general partner of a limited liability partnership, or a manager of a limited liability company.\n\"Residential real property\" or \"residential real estate\" means property occupied by, or intended to be occupied by, one to four families as their residence.\n\"Seller's broker\" means a licensee who represents a seller under a signed seller's broker agreement. A seller's broker owes to the seller fiduciary duties.\n\"Sponsor\" means a person offering or providing real estate education.\n\"Trust account\" means, for purposes of this chapter, a savings account, negotiable order of withdrawal account, demand deposit or checking account maintained for the purpose of segregating trust funds from other funds. A trust account must be an interest-bearing account paying the highest current passbook savings account rate of interest and must not allow the financial institution a right of set off against money owed it by the licensee.\n\"Trust funds\" means funds received by a broker, salesperson, or closing agent in a fiduciary capacity as a part of a real estate or business opportunity transaction, pending the consummation or termination of a transaction, and includes all down payments, earnest money deposits, rents for clients, tax and insurance escrow payments, damage deposits, and any funds received on behalf of any person.",
	"repealed": false
}