{
	"id": "518.1705",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.1705",
	"title": "518.1705 PARENTING PLANS.",
	"text": "\"Domestic abuse\" for the purposes of this section has the meaning given in section 518B.01, subdivision 2.\n(a) A parenting plan must include the following:\n(1) a schedule of the time each parent spends with the child;\n(2) a designation of decision-making responsibilities regarding the child; and\n(3) a method of dispute resolution.\n(b) A parenting plan may include other issues and matters the parents agree to regarding the child.\n(c) Parents voluntarily agreeing to parenting plans may substitute other terms for physical and legal custody, including designations of joint or sole custody, provided that the terms used in the substitution are defined in the parenting plan.\n(a) Upon the request of both parents, a parenting plan must be created in lieu of an order for child custody and parenting time unless the court makes detailed findings that the proposed plan is not in the best interests of the child.\n(b) If both parents do not agree to a parenting plan, the court may create one on its own motion, except that the court must not do so if it finds that a parent has committed domestic abuse against a parent or child who is a party to, or subject of, the matter before the court. If the court creates a parenting plan on its own motion, it must not use alternative terminology unless the terminology is agreed to by the parties.\n(c) If an existing order does not contain a parenting plan, the parents must not be required to create a parenting plan as part of a modification order under section 518A.39.\n(d) A parenting plan must not be required during an action under section 518A.82.\n(e) If the parents do not agree to a parenting plan and the court does not create one on its own motion, orders for custody and parenting time must be entered under sections 518.17 and 518.175 or section 257.541, as applicable.\nA final judgment and decree that includes a parenting plan using alternate terms to designate decision-making responsibilities or allocation of residential time between the parents must designate whether the parents have joint legal custody or joint physical custody or which parent has sole legal custody or sole physical custody, or both. This designation is solely for enforcement of the final judgment and decree where this designation is required for that enforcement and has no effect under the laws of this state, any other state, or another country that do not require this designation.\nIf both parents agree to the use of a parenting plan but are unable to agree on all terms, the court may create a parenting plan under this section. If the court is considering a parenting plan, it may require each parent to submit a proposed parenting plan at any time before entry of the final judgment and decree. If parents seek the court's assistance in deciding the schedule for each parent's time with the child or designation of decision-making responsibilities regarding the child, the court may order an evaluation and should consider the appointment of a guardian ad litem. Parenting plans, whether entered on the court's own motion, following a contested hearing, or reviewed by the court pursuant to a stipulation, must be based on the best interests factors in section 518.17 or 257.025, as applicable.\n(a) Dispute resolution processes other than the judicial process may not be required in the preparation of a parenting plan if a parent is alleged to have committed domestic abuse toward a parent or child who is a party to, or subject of, the matter before the court. In these cases, the court shall consider the appointment of a guardian ad litem and a parenting plan evaluator.\n(b) The court may not require a parenting plan that provides for joint legal custody or use of dispute resolution processes, other than the judicial process, if the court finds that section 518.179 applies or the court finds that either parent has engaged in the following toward a parent or child who is a party to, or subject of, the matter before the court:\n(1) acts of domestic abuse, including physical harm, bodily injury, and infliction of fear of physical harm, assault, terroristic threats, or criminal sexual conduct;\n(2) physical, sexual, or a pattern of emotional abuse of a child; or\n(3) willful abandonment that continues for an extended period of time or substantial refusal to perform parenting functions.\nParents may agree upon the legal standard that will govern a decision concerning removal of a child's residence from this state, provided that:\n(1) both parents were represented by counsel when the parenting plan was approved; or\n(2) the court found the parents were fully informed, the agreement was voluntary, and the parents were aware of its implications.\n(a) Parents creating a parenting plan are subject to the requirements of the child support guidelines under chapter 518A.\n(b) Parents may include in the parenting plan an allocation of expenses for the child. The allocation is an enforceable contract between the parents.\n(a) Parents may modify the schedule of the time each parent spends with the child or the decision-making provisions of a parenting plan by agreement. To be enforceable, modifications must be confirmed by court order. A motion to modify decision-making provisions or the time each parent spends with the child may be made only within the time limits provided by section 518.18.\n(b) The parties may agree, but the court must not require them, to apply the best interests standard in section 257.025 or 518.17, as applicable, for deciding a motion for modification that would change the child's primary residence, provided that:\n(1) both parties were represented by counsel when the parenting plan was approved; or\n(2) the court found the parties were fully informed, the agreement was voluntary, and the parties were aware of its implications.\n(c) If the parties do not agree to apply the best interests standard, section 518.18, paragraph (d), applies.",
	"repealed": false
}