{
	"id": "126C.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.72",
	"title": "126C.72 ISSUANCE AND SALE OF BONDS.",
	"text": "On or before October 1 in each year, the commissioner shall certify to the commissioner of management and budget the amount anticipated to be needed for debt service loans and capital loans to be made under the Maximum Effort School Aid Law prior to October 1 in the following year. Each such certification of the commissioner shall also state an estimate of the dates and amounts the certified amount will be needed in the maximum effort school loan fund and an estimate as to the years and amounts in which payments on debt service loans and capital loans will be received.\nUpon receipt of each such certification, subject to authorization as provided in subdivision 4, the commissioner of management and budget shall from time to time as needed issue and sell state of Minnesota school loan bonds in the aggregate principal amount stated in the commissioner's certificate, for the prompt and full payment of which, with the interest thereon, the full faith, credit, and taxing powers of the state are hereby irrevocably pledged. The commissioner of management and budget shall credit the net proceeds of the sale of the bonds to the purposes for which they are appropriated by section 126C.66, subdivision 1. The bonds shall be issued and sold at such price, in such manner, in such number of series, at such times, and in such form and denominations, shall bear such dates of issue and of maturity, either without option of prior redemption or subject to prepayment upon such notice and at such times and prices, shall bear interest at such rate or rates and payable at such intervals, shall be payable at such bank or banks within or without the state, with such provisions for registration, conversion, and exchange, and for the issuance of notes in anticipation of the sale and delivery of definitive bonds, and in accordance with such further provisions as the commissioner of management and budget shall determine subject to the limitations stated in this subdivision (but not subject to chapter 14, including section 14.386). The maturity date must not be more than 20 years after the date of issue of any bond and the principal amounts. The due dates must conform as near as may be with the commissioner's estimates of dates and amounts of payments to be received on debt service and capital loans. The bonds and any interest coupons attached to them must be executed by the commissioner of management and budget under official seal. The signature of the commissioner and the seal may be printed, lithographed, stamped, engraved, or otherwise reproduced thereon. Each bond must be authenticated by the manual signature on its face of the commissioner or a person authorized to sign on behalf of a bank or trust company designated by the commissioner to act as registrar or other authenticating agent. The commissioner of management and budget is authorized and directed to ascertain and certify to purchasers of the bonds the performance and existence of all acts, conditions, and things necessary to make them valid and binding general obligations of the state of Minnesota in accordance with their terms.\nThe commissioner of management and budget shall maintain a separate school loan bond account in the state bond fund, showing all money transferred to that fund for the payment of school loan bonds and all income received from the investment of such money. On December 1, the commissioner of management and budget shall transfer to the bond account as much of the money then on hand in the loan repayment account in the maximum effort school loan fund as will be sufficient, with the balance then on hand in said bond account, to pay all principal and interest due and to become due within the next ensuing year and July 1 in the second ensuing year on school loan bonds issued and sold pursuant to this section. If money is not available for the transfer in the full amount required, and if any principal or interest on school loan bonds should become due at any time when there is not on hand a sufficient amount from any of the sources herein appropriated for the payment thereof, the moneys must be paid out of the general fund in the state treasury according to section 16A.641, and the amount necessary therefor is hereby appropriated.\nBonds shall be issued pursuant to this section only when authorized by a law specifying the purpose thereof and the maximum amount of the proceeds authorized to be expended for that purpose. Any act authorizing the issuance of bonds in the manner provided in this section shall, together with this section, constitute complete authority for the issue, and the bonds shall not be subject to the restrictions or limitations contained in any other law. Bonds issued pursuant hereto may be sold at public or private sale and shall be deemed \"authorized securities\" within the provisions of section 50.14 and acts amendatory thereof or supplemental thereto.",
	"repealed": false
}