{
	"id": "246C.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/246C.18",
	"title": "246C.18 FUNDING, REDESIGNS, AND CLOSURES.",
	"text": "The executive board shall notify the chairs and ranking minority members of the relevant legislative committees regarding the redesign, closure, or relocation of state-operated services programs.\n(a) The executive board is prohibited from closing any regional treatment center or state-operated nursing home or any program at any of the regional treatment centers or state-operated nursing homes, without specific legislative authorization.\n(b) Prior to closing or downsizing a regional treatment center, the executive board is responsible for assuring that community-based alternatives developed in response are adequate to meet the program needs identified by each county within the catchment area and do not require additional local county property tax expenditures.\n(c) The nonfederal share of the cost of alternative treatment or care developed as the result of the closure of a regional treatment center, including costs associated with fulfillment of responsibilities under chapter 253B must be paid from state money appropriated for purposes specified in section 246C.11.\nThe executive board must not divert state money used for providing for care or treatment of persons residing in a regional treatment center for purposes unrelated to the care and treatment of such persons.\nIf the closure of a state-operated facility is proposed, and the executive board and respective bargaining units fail to arrive at a mutually agreed upon solution to transfer affected state employees to other state jobs, the closure of the facility requires legislative approval.\n(a) The executive board shall publicize the planned changes to the facilities operated by the executive board. A parent, other involved family member, private guardian, or health care agent of a resident of a facility must be notified of the changes planned for each facility. When new services developed for a person require the person to move, the executive board shall provide each parent, family member, health care agent, and guardian of that person with the following:\n(1) names and telephone numbers of the state and county contacts;\n(2) information on types of services to be developed;\n(3) information on how the individual planning process works, including how alternative placements will be determined, and how family members can be involved;\n(4) information on the process to be followed when a parent, other family member, health care agent, or guardian disagrees with the proposed services; and\n(5) a list of additional resources such as advocates, local volunteer coordinators, and family groups.\n(b) At least one staff person in each facility must be available to provide information about:\n(1) community placements;\n(2) the opportunity for interested family members, guardians, and health care agents to participate in program planning; and\n(3) family support groups.",
	"repealed": false
}