{
	"id": "259.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.52",
	"title": "259.52 FATHERS' ADOPTION REGISTRY.",
	"text": "(a) The commissioner of health shall establish a fathers' adoption registry for the purpose of determining the identity and location of a putative father interested in a minor child who is, or is expected to be, the subject of an adoption proceeding, in order to provide notice of the adoption proceeding to the putative father who is not otherwise entitled to notice under section 259.49, subdivision 1, paragraph (a) or (b), clauses (1) to (7). The commissioner of health may establish informational material and public service announcements necessary to implement this section. Any limitation on a putative father's right to assert an interest in the child as provided in this section applies only in adoption proceedings and only to those putative fathers not entitled to notice and consent under sections 259.24 and 259.49, subdivision 1, paragraph (a) or (b), clauses (1) to (7). The commissioner of health has no independent obligation to gather or update the information to be maintained on the registry. It is the registrant's responsibility to update his personal information on the registry.\n(b) The fathers' adoption registry must contain the following information:\n(1) with respect to the putative father, the:\n(i) name, including any other names by which the putative father may be known and that he may provide to the registry;\n(ii) address at which he may be served with notice of a petition under this chapter, including any change of address;\n(iii) Social Security number, if known;\n(iv) date of birth; and\n(v) if applicable, a certified copy of an order by a court of another state or territory of the United States adjudicating the putative father to be the father of this child;\n(2) with respect to the mother of the child:\n(i) name, including all other names known to the putative father by which the mother may be known;\n(ii) if known to the putative father, her last address;\n(iii) Social Security number, if known; and\n(iv) date of birth;\n(3) if known to the putative father, the name, gender, place of birth, and date of birth or anticipated date of birth of the child;\n(4) the date that the commissioner of health received the putative father's registration, which is the date the registration is postmarked or the date it was delivered by means other than mail to the address on the registration form; and\n(5) other information the commissioner of health determines by rule to be necessary for the orderly administration of the registry.\n(c) The commissioner of health shall notify the mother of the child whenever a putative father has registered with the father's adoption registry under this section. Notice shall be sent to the name and address submitted by the putative father under paragraph (b), clause (2). If no current address for the mother is submitted by the putative father under paragraph (b), clause (2), the commissioner of health shall not notify the mother. The commissioner of health has no independent obligation to locate the mother. The notice shall be mailed within 14 days of the date that the commissioner received the putative father's adoption registration unless a search has been requested under subdivision 2. There shall be no charge to the birth mother for this notice.\n(d) The commissioner of health shall set reasonable fees for the use of the registry; however, a putative father shall not be charged a fee for registering. Revenues generated by the fee must be deposited in the state government special revenue fund and appropriated to the commissioner of health to administer the fathers' adoption registry.\nNo petition for adoption may be granted unless the agency supervising the adoptive placement, the birth mother of the child, the putative father who registered or the legal father, or, in the case of a stepparent or relative adoption, the county agency responsible for the report required under section 259.53, subdivision 1, requests that the commissioner of health search the registry to determine whether a putative father is registered in relation to a child who is or may be the subject of an adoption petition. The search required by this subdivision must be conducted no sooner than 31 days following the birth of the child. A search of the registry may be proven by the production of a certified copy of the registration form or by a certified statement of the commissioner of health that after a search no registration of a putative father in relation to a child who is or may be the subject of an adoption petition could be located. The filing of a certified copy of an order from a juvenile protection matter under chapter 260C containing a finding that certification of the requisite search of the Minnesota Fathers' Adoption Registry was filed with the court in that matter shall also constitute proof of search. Certification that the Minnesota Fathers' Adoption Registry has been searched must be filed with the court prior to entry of any final order of adoption. In addition to the search required by this subdivision, the agency supervising the adoptive placement, the birth mother of the child, or, in the case of a stepparent or relative adoption, the social services agency responsible for the report under section 259.53, subdivision 1, or the responsible social services agency that is a petitioner in a juvenile protection matter under chapter 260C may request that the commissioner of health search the registry at any time. Search requirements of this section do not apply when the responsible social services agency is proceeding under Safe Place for Newborns, section 260C.139.\nA public authority responsible for child support enforcement that is attempting to establish a child support obligation may request that the commissioner of health search the registry to determine whether a putative father is registered in relation to a child who is or may be the subject of a child support obligation. A search of the registry may be proven by the production of a certified copy of the registration form or by a certified statement of the commissioner of health that after a search, no registration of a putative father in relation to the child could be located. No fee may be charged to the public authority for use of the registry.\n(a) Data in the fathers' adoption registry, including all data provided in requesting the search of the registry, are private data on individuals, as defined in section 13.02, subdivision 2, and are nonpublic data with respect to data not on individuals, as defined in section 13.02, subdivision 9. Data in the registry may be released to:\n(1) a person who is required to search the registry under subdivision 2, if the data relate to the child who is or may be the subject of the adoption petition;\n(2) the mother of the child listed on the putative father's registration form who the commissioner of health is required to notify under subdivision 1, paragraph (c);\n(3) the putative father who registered himself or the legal father;\n(4) a public authority as provided in subdivision 3; or\n(5) an attorney who has signed an affidavit from the commissioner of health attesting that the attorney represents the birth mother, the putative or legal father, or the prospective adoptive parents.\n(b) A person who receives data under this subdivision may use the data only for purposes authorized under this section or other law.\nA person who knowingly or intentionally registers false information under this section is guilty of a misdemeanor.\nAny putative father may register with the Minnesota Fathers' Adoption Registry. Any limitation on a putative father's right to assert an interest in the child as provided in this section applies only in adoption proceedings, termination of parental rights proceedings under chapter 260C, and only to those putative fathers not entitled to notice and consent under sections 259.24 and 259.49, subdivision 1, paragraph (a) or (b), clauses (1) to (7).\nA putative father may register with the Department of Health before the birth of the child but must register no later than 30 days after the birth of the child. Registrations must be in writing and signed by the putative father. A registration is timely if the date the registration is postmarked or the date it was delivered by means other than mail to the address specified on the registration form is not later than 30 days after the birth of the child.\nExcept for a putative father who is entitled to notice and consent under sections 259.24 and 259.49, subdivision 1, paragraph (a) or (b), clauses (1) to (7), a putative father who fails to timely register with the fathers' adoption registry under subdivision 7:\n(1) is barred thereafter from bringing or maintaining an action to assert any interest in the child during the pending adoption proceeding concerning the child;\n(2) is considered to have waived and surrendered any right to notice of any hearing in any judicial proceeding for adoption of the child, and consent of that person to the adoption of the child is not required; and\n(3) is considered to have abandoned the child.\nFailure to register under subdivision 7 is prima facie evidence of sufficient grounds to support termination of the putative father's parental rights under section 260C.301, subdivision 1.\nA putative father who has not timely registered under subdivision 7 is considered to have timely registered if he proves by clear and convincing evidence that:\n(i) it was not possible for him to register within the period of time specified in subdivision 7;\n(ii) his failure to register was through no fault of his own; and\n(iii) he registered within ten days after it became possible for him to file.\nA lack of knowledge of the pregnancy or birth is not an acceptable reason for failure to register.\nAny time after conception, an interested party, including persons intending to adopt a child, a child welfare agency with whom the mother has placed or has given written notice of her intention to place a child for adoption, the mother of a child, or any attorney representing an interested party, may serve by certified mail a notice to registered putative father, an intent to claim parental rights form, a denial of paternity form, and a consent to adoption form pursuant to subdivision 11. These documents may be served on a putative father in the same manner as a summons is served in other civil proceedings, or, in lieu of personal service, service may be made as follows:\n(a) The interested party or that party's attorney shall mail to the putative father, at the address provided to the registry, the copy of the notice to registered putative father, the intent to claim parental rights form, the denial of paternity form, and the consent to adoption form by certified mail, return receipt requested, and shall provide notice of the jurisdiction in which the adoption petition will be filed. The receipt for certified mail must state the name and address of the addressee and the date of mailing and must be attached to the original notice.\n(b) The return receipt, when filed with the court, must be attached to the original notice to registered putative father, the intent to claim parental rights form, the denial of paternity form, and the consent to adoption form and constitutes proof of service.\n(c) The court administrator shall note the fact of service in a permanent record.\nWithin 30 days of receipt of the notice to registered putative father, the intent to claim parental rights form, the denial of paternity form, and the consent to adoption form, the putative father must file a completed intent to claim parental rights form with the court administrator in the county in which the adoption petition will be filed as provided by the petitioner, stating that he intends to initiate a paternity action within 30 days of receipt of the notice to registered putative father in order to preserve the right to maintain an interest in the child and receive notice during the pending adoption proceeding. Failure to initiate a paternity action within 30 days of receipt of the notice to registered putative father does not act as a bar to receiving notice under section 259.49. If good cause is shown, the putative father must be allowed more time to initiate the paternity action. A putative father who files a completed denial of paternity form and consent to adoption form or who fails to timely file an intent to claim parental rights form with the court:\n(1) is barred from later bringing or maintaining an action to assert any interest in the child during the pending adoption proceeding concerning the child;\n(2) is considered to have waived and surrendered a right to notice of a hearing in any judicial proceeding for adoption of the child, and consent of that person to the adoption of the child is not required; and\n(3) is considered to have abandoned the child.\nFailure to register is prima facie evidence of sufficient grounds to support termination of the putative father's parental rights.\nThe Office of the State Court Administrator shall develop the following forms:\n(1) notice to registered putative father;\n(2) intent to claim parental rights;\n(3) denial of paternity;\n(4) consent to adoption; and\n(5) notice to registered putative father of the county in which the adoption petition will be filed.\nUpon proof of indigency, a putative father who has registered with the fathers' adoption registry, has received a notice to registered putative father, and has timely filed an intent to claim paternal rights form with the court administrator, must have counsel appointed at public expense.\nIn an action involving an American Indian child, sections 260.751 to 260.835, and the Indian Child Welfare Act, United States Code, title 25, sections 1901 to 1923, control to the extent that the provisions of this section are inconsistent with those laws. The public acts, records, and judicial proceedings of any Indian tribe that provide an acknowledgment of paternity or that establish paternity pursuant to tribal law or custom shall be given full faith and credit as provided in United States Code, title 25, section 1911(d). Nothing in this section defeats the right of an Indian father who has acknowledged or established his paternity pursuant to tribal law or custom to commence a paternity proceeding, except that no father may file a paternity proceeding after the entry of a final decree of adoption.\nThe district court administrator in every judicial district shall, in addition to any other filing fees, assess a $75 adoption filing fee surcharge on each adoption petition filed in the district court for the purpose of implementing and maintaining the fathers' adoption registry. The court administrator shall forward fees collected under this subdivision to the commissioner of management and budget for deposit into the state government special revenue fund to be appropriated to the commissioner of health to administer the fathers' adoption registry established under this section.\nThis section does not apply to international adoptions.",
	"repealed": false
}