{
	"id": "424B.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/424B.01",
	"title": "424B.01 DEFINITIONS.",
	"text": "Unless the context of the provision indicates that a different meaning is intended, each of the terms in the following subdivisions has the meaning indicated.\n\"Applicable municipality\" means the municipality or municipalities in which a consolidating relief association is located and to which a consolidating relief association is associated by virtue of the presence of at least one municipal official on the relief association board of trustees under section 424A.04.\n\"Board of trustees\" means the governing board of a relief association.\n\"Consolidating relief association\" means a firefighters relief association organized under chapter 317A and governed by chapter 424A that has initiated or has completed the process of consolidating with one or more other relief associations under this chapter.\n\"Conversion effective date\" means the date designated by the board of trustees under section 424B.13, subdivision 2, on which the assets of the defined benefit plan have been allocated to accounts under the defined contribution plan.\n\"Defined benefit plan\" means a retirement plan that provides a retirement benefit under section 424A.02.\n\"Defined benefit relief association\" means a relief association that has established and administers a retirement plan that is a defined benefit plan.\n\"Defined contribution plan\" means a retirement plan that provides a retirement benefit under section 424A.016.\n\"Defined contribution relief association\" means a relief association that has established and administers a retirement plan that is a defined contribution plan.\n\"Firefighting corporation\" means an independent nonprofit firefighting corporation that is organized under chapter 317A and that operates primarily for firefighting purposes.\n(a) \"Member\" means a person:\n(1) who is or was employed by or who provides or provided services to a fire department or independent nonprofit firefighting corporation;\n(2) who has been credited with at least one year of service toward a retirement benefit under the retirement plan of a relief association that is affiliated with the fire department or independent nonprofit firefighting corporation; and\n(3) whose retirement benefit under the retirement plan has not yet been distributed in a lump sum or has not yet begun to be distributed in periodic installments or as a monthly pension.\n(b) A member may be an active firefighter, an inactive firefighter, or a former firefighter who has a benefit under the retirement plan but has not become eligible to receive the benefit.\n\"Municipality\" has the meaning given in section 424A.001, subdivision 3. A reference in chapter 424B to municipality in connection with a power that may be exercised by or a requirement that is imposed on the municipality means each city or township that is party to a joint powers agreement, unless the joint powers agreement identifies one city or township with the authority to act on behalf of the other parties to the agreement or with the responsibility for fulfilling requirements imposed on the other parties to the agreement.\n\"Other benefit recipient\" means:\n(1) a person who is entitled to receive all or a portion of the benefit of a participant under a retirement plan due to the person having one of the following relationships to the participant:\n(i) the participant's surviving spouse;\n(ii) the participant's former spouse who is the alternate payee under a state domestic relations order that meets the requirements of section 414(p) of the Internal Revenue Code or who is a recipient of a court-ordered distribution of marital property, as provided in section 518.58; or\n(iii) a nonspousal beneficiary of the participant; or\n(2) the participant's estate.\n(a) Under a defined contribution plan, \"participant\" means any individual who provides services to or is employed by a municipality or firefighting corporation and who satisfies the eligibility requirements to receive an allocation to the individual's account under the defined contribution plan. An individual who becomes a participant and has an account in the plan to which an allocation was credited shall be considered a participant until the earlier of the individual's death or the distribution or forfeiture of the individual's entire account in the plan.\n(b) Under a defined benefit plan, \"participant\" means any individual who provides services to or is employed by a municipality or firefighting corporation and who satisfies the eligibility requirements to begin to accrue a benefit under the defined benefit plan. An individual who becomes a participant and has accrued a benefit under the plan shall be considered a participant until the earlier of the individual's death or the distribution or forfeiture of the individual's entire accrued benefit under the plan.\n(c) If an individual satisfies paragraph (a) or (b), the individual must be considered a participant, notwithstanding other terms used in applicable law or the relief association's articles or bylaws to describe the individual. A participant includes a member, active member, deferred member, inactive member, and retiree in pay status.\n\"Prior relief associations\" means the two or more volunteer firefighters relief associations that have initiated the consolidation process under this chapter by action of the board of trustees of the relief association.\n\"Relief association\" or \"firefighters relief association\" has the meaning given in section 424A.001, subdivision 4.\n\"Relief association membership\" means all active members of the firefighters relief association, all deferred retirees and other vested inactive members of the firefighters relief association, and any persons regularly receiving a service pension or other retirement benefit from the firefighters relief association.\n\"Required contribution\" means a contribution made by the municipality to the special fund of a relief association in satisfaction of a minimum municipal obligation required under section 424A.092 or 424A.093.\n\"Retiree in pay status\" means a participant who is receiving a monthly pension or periodic installment payments from a retirement plan.\n\"Retirement benefit\" means the benefit to which a participant is entitled under a retirement plan.\n\"Retirement plan\" means the defined benefit plan or defined contribution plan established and administered by a relief association.\n\"Subsequent relief association\" means the firefighters relief association that is designated to be the successor relief association in the consolidation initiative resolutions of the board of trustees of the prior relief associations or the firefighters relief association organized under chapters 317A and 424A for the purpose of operating as the successor relief association after consolidation under this chapter.\n\"Surplus\" means the amount by which the assets in a defined benefit plan exceed accrued liabilities.",
	"repealed": false
}