{
	"id": "430.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/430.101",
	"title": "430.101 PEDESTRIAN MALLS.",
	"text": "A pedestrian mall acquired under section 430.01 or improved under section 430.07 may be used under the direction of the city council for any purpose or activity that will enhance the movement, safety, convenience, or enjoyment of pedestrians, including seating, sidewalk cafes, displays of merchandise, exhibits, advertising, telephone, transit, newsstands, bus shelters, plantings, adornment, protection against the elements, and any other use or activity permitted by an applicable pedestrian mall ordinance adopted under section 430.011 or other applicable law, ordinance, or power.\nAfter a pedestrian mall ordinance has been adopted or land has been acquired for a pedestrian mall, the city engineer shall prepare a plan and submit it to the city council. The plan must be prepared with the assistance of the city attorney and any consulting engineer or landscape architect or other consultant employed by the council to assist an advisory board appointed under subdivision 3. The plan must include:\n(1) the initial distribution and location of movable furniture, sculpture, or pedestrian traffic-control devices, flowers, and other facilities belonging to the pedestrian mall and not otherwise located or fixed by the plans and specifications;\n(2) the initial uses to be permitted on the mall to occupants of abutting property, a transit or telephone utility, vendors, and others to serve the convenience and enjoyment of pedestrians, and the location of those uses;\n(3) proposed regulations governing charges in the distribution of movables and permitted uses, the issuance of permits for uses, and fees and rentals to be charged for permits and uses; and\n(4) the operation of any lighting, heating, or other facilities in the mall, replacing flowers, and maintaining the furniture and facilities in the mall.\nThe plan must be filed with the city clerk and be open to inspection. The city council shall by ordinance approve and adopt the plan and regulations with additions or modifications it considers proper after notice and hearings before it or its appropriate committee that the council considers necessary or desirable. The council may amend the plan and regulations. Any furniture, structure, facility, or use located or permitted under the plan or a pedestrian mall improvement in the street covered by the plan or improvement is not, because of that location or use, a nuisance or unlawful obstruction or condition. Neither the city nor any user acting under permit is liable for any injury to person or property unless the furniture, structure, facility, or use is negligently constructed, maintained, or operated.\nIn its discretion, the city council may create and appoint an advisory board. A majority of the members must be owners or occupants of properties adjoining a pedestrian mall or their representatives. The board shall advise the city council and the city engineer on the acquisition, construction, and improvement of a pedestrian mall, the making of a plan for the mall, and the operation and maintenance of the mall, and meet and make recommendations on complaints and requests of members of the public and owners and occupants of adjoining property. An advisory board may elect an executive secretary, who need not be a member of the board, to keep its minutes, records, and correspondence and to communicate with the city council, the city engineer, other officials, owners and occupants of adjoining properties, and users of the pedestrian mall.",
	"repealed": false
}