{
	"id": "260C.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.001",
	"title": "260C.001 TITLE, INTENT, AND CONSTRUCTION.",
	"text": "(a) Sections 260C.001 to 260C.637 may be cited as the juvenile protection provisions of the Juvenile Court Act.\n(b) Juvenile protection proceedings include:\n(1) a child in need of protection or services matters;\n(2) permanency matters, including termination of parental rights;\n(3) postpermanency reviews under sections 260C.317 and 260C.521; and\n(4) adoption matters including posttermination of parental rights proceedings that review the responsible social services agency's reasonable efforts to finalize adoption.\n(a) The paramount consideration in all juvenile protection proceedings is the health, safety, and best interests of the child. In proceedings involving an American Indian child, as defined in section 260.755, subdivision 8, the best interests of the child must be determined consistent with sections 260.751 to 260.835 and the Indian Child Welfare Act, United States Code, title 25, sections 1901 to 1923.\n(b) The purpose of the laws relating to juvenile protection proceedings is:\n(1) to secure for each child under the jurisdiction of the court, the care and guidance, preferably in the child's own home, as will best serve the spiritual, emotional, mental, and physical welfare of the child;\n(2) to provide judicial procedures that protect the welfare of the child;\n(3) to preserve and strengthen the child's family ties whenever possible and in the child's best interests, removing the child from the custody of parents only when the child's welfare or safety cannot be adequately safeguarded without removal;\n(4) to ensure that when removal from the child's own family is necessary and in the child's best interests, the responsible social services agency has legal responsibility for the child removal either:\n(i) pursuant to a voluntary placement agreement between the child's parent or guardian or the child, when the child is over age 18, and the responsible social services agency; or\n(ii) by court order pursuant to section 260C.151, subdivision 6; 260C.178; 260C.201; 260C.325; or 260C.515;\n(5) to ensure that, when placement is pursuant to court order, the court order removing the child or continuing the child in foster care contains an individualized determination that placement is in the best interests of the child that coincides with the actual removal of the child;\n(6) to ensure that when the child is removed, the child's care and discipline is, as nearly as possible, equivalent to that which should have been given by the parents and is either in:\n(i) the home of a noncustodial parent pursuant to section 260C.178 or 260C.201, subdivision 1, paragraph (a), clause (1);\n(ii) the home of a relative pursuant to emergency placement by the responsible social services agency under chapter 245A; or\n(iii) foster care licensed under chapter 245A; and\n(7) to ensure appropriate permanency planning for children in foster care including:\n(i) unless reunification is not required under section 260.012, developing a permanency plan for the child that includes a primary plan for reunification with the child's parent or guardian and a secondary plan for an alternative, legally permanent home for the child in the event reunification cannot be achieved in a timely manner;\n(ii) identifying, locating, and assessing both parents of the child as soon as possible and offering reunification services to both parents of the child as required under sections 260.012 and 260C.219;\n(iii) identifying, locating, and notifying relatives of both parents of the child according to section 260C.221;\n(iv) making a placement with a family that will commit to being the legally permanent home for the child in the event reunification cannot occur at the earliest possible time while at the same time actively supporting the reunification plan; and\n(v) returning the child home with supports and services, as soon as return is safe for the child, or when safe return cannot be timely achieved, moving to finalize another legally permanent home for the child.\nThe purpose of the laws relating to permanency, termination of parental rights, and children who come under the guardianship of the commissioner of children, youth, and families is to ensure that:\n(1) when required and appropriate, reasonable efforts have been made by the social services agency to reunite the child with the child's parents in a home that is safe and permanent;\n(2) if placement with the parents is not reasonably foreseeable, to secure for the child a safe and permanent placement according to the requirements of section 260C.212, subdivision 2, preferably with a relative through an adoption or a transfer of permanent legal and physical custody or, if that is not possible or in the best interests of the child, with a nonrelative caregiver through adoption; and\n(3) when a child is under the guardianship of the commissioner of children, youth, and families, reasonable efforts are made to finalize an adoptive home for the child in a timely manner.\nNothing in this section requires reasonable efforts to prevent placement or to reunify the child with the parent or guardian to be made in circumstances where the court has determined that the child has been subjected to egregious harm, when the child is an abandoned infant, the parent has involuntarily lost custody of another child through a proceeding under section 260C.515, subdivision 4, or similar law of another state, the parental rights of the parent to a sibling have been involuntarily terminated, or the court has determined that reasonable efforts or further reasonable efforts to reunify the child with the parent or guardian would be futile.\nThe paramount consideration in all proceedings for permanent placement of the child under sections 260C.503 to 260C.521, or the termination of parental rights is the best interests of the child. In proceedings involving an American Indian child, as defined in section 260.755, subdivision 8, the best interests of the child must be determined consistent with the Indian Child Welfare Act of 1978, United States Code, title 25, section 1901, et seq.\nThe laws relating to the juvenile protection proceedings shall be liberally construed to carry out these purposes.",
	"repealed": false
}