{
	"id": "501C.0602",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.0602",
	"title": "501C.0602 REVOCATION OR AMENDMENT OF REVOCABLE TRUST.",
	"text": "(a) Unless the terms of a trust expressly provide that the trust is revocable, the settlor may not revoke or amend the trust.\n(b) If a revocable trust is created or funded by more than one settlor:\n(1) to the extent the trust consists of community property, the trust may be revoked by either spouse acting alone but may be amended only by joint action of both spouses;\n(2) to the extent the trust consists of property other than community property, each settlor may revoke or amend the trust with regard to the portion of the trust property attributable to that settlor's contribution; and\n(3) upon the revocation or amendment of the trust by fewer than all of the settlors, the trustee shall promptly notify the other settlors of the revocation or amendment.\n(c) The settlor may revoke or amend a revocable trust:\n(1) by substantial compliance with a method provided in the terms of the trust; or\n(2) if the terms of the trust do not provide a method or the method provided in the terms is not expressly made exclusive, by:\n(i) if the trust is created pursuant to a writing, by another writing manifesting clear and convincing evidence of the settlor's intent to revoke or amend the trust; or\n(ii) if the trust is an oral trust, by any other method manifesting clear and convincing evidence of the settlor's intent.\n(d) Upon revocation of a revocable trust, the trustee shall deliver the trust property as the settlor directs.\n(e) A settlor's powers with respect to revocation, amendment, or distribution of trust property may be exercised by an agent under a power of attorney only to the extent expressly authorized by the terms of the trust or the power.\n(f) A conservator of the settlor may exercise a settlor's powers with respect to revocation, amendment, or distribution of trust property only with the approval of the court supervising the conservatorship.\n(g) A trustee who does not know that a trust has been revoked or amended is not liable to the settlor or settlor's successors in interest for distributions made and other actions taken on the assumption that the trust had not been amended or revoked.",
	"repealed": false
}