{
	"id": "518A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.29",
	"title": "518A.29 CALCULATION OF GROSS INCOME.",
	"text": "(a) Subject to the exclusions and deductions in this section, gross income includes any form of periodic payment to an individual, including, but not limited to, salaries, wages, commissions, self-employment income under section 518A.30, workers' compensation, unemployment benefits, annuity payments, military and naval retirement, pension and disability payments, spousal maintenance received under a previous order or the current proceeding, Social Security or veterans benefits provided for a joint child under section 518A.31, and potential income under section 518A.32. Salaries, wages, commissions, or other compensation paid by third parties shall be based upon gross income before participation in an employer-sponsored benefit plan that allows an employee to pay for a benefit or expense using pretax dollars, such as flexible spending plans and health savings accounts. No deductions shall be allowed for contributions to pensions, 401-K, IRA, or other retirement benefits.\n(b) Gross income does not include compensation received by a party for employment in excess of a 40-hour work week, provided that:\n(1) child support is ordered in an amount at least equal to the guideline amount based on gross income not excluded under this clause; and\n(2) the party demonstrates, and the court finds, that:\n(i) the excess employment began after the filing of the petition for dissolution or legal separation or a petition related to custody, parenting time, or support;\n(ii) the excess employment reflects an increase in the work schedule or hours worked over that of the two years immediately preceding the filing of the petition;\n(iii) the excess employment is voluntary and not a condition of employment;\n(iv) the excess employment is in the nature of additional, part-time or overtime employment compensable by the hour or fraction of an hour; and\n(v) the party's compensation structure has not been changed for the purpose of affecting a support or maintenance obligation.\n(c) Expense reimbursements or in-kind payments received by a parent in the course of employment, self-employment, or operation of a business shall be counted as income if they reduce personal living expenses.\n(d) Gross income may be calculated on either an annual or monthly basis. Weekly income shall be translated to monthly income by multiplying the weekly income by 4.33.\n(e) Gross income does not include a child support payment received by a party. It is a rebuttable presumption that adoption assistance payments, Northstar kinship assistance payments, and foster care subsidies are not gross income.\n(f) Gross income does not include the income of the obligor's spouse and the obligee's spouse.\n(g) Spousal maintenance payments ordered by a court for a former spouse or ordered payable to the other party as part of the current proceeding are deducted from other periodic payments received by a party for purposes of determining gross income.\n(h) Gross income does not include public assistance benefits received under section 518A.81 or other forms of public assistance based on need.",
	"repealed": false
}