{
	"id": "171.306",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.306",
	"title": "171.306 IGNITION INTERLOCK DEVICE PROGRAM.",
	"text": "(a) As used in this section, the terms in this subdivision have the meanings given them.\n(b) \"Ignition interlock device\" or \"device\" means equipment that is designed to measure breath alcohol concentration and to prevent a motor vehicle's ignition from being started by a person whose breath alcohol concentration measures 0.02 or higher on the equipment.\n(c) \"Location tracking capabilities\" means the ability of an electronic or wireless device to identify and transmit its geographic location through the operation of the device.\n(d) \"Program participant\" means a person who has qualified to take part in the ignition interlock program under this section, and whose driver's license has been:\n(1) revoked, canceled, or denied under section 169A.52; 169A.54; 171.04, subdivision 1, clause (10); or 171.177; or\n(2) revoked under section 171.17, subdivision 1, paragraph (a), clause (1), or suspended under section 171.187, for a violation of section 609.2113, subdivision 1, clause (2), item (i) or (iii), (3), or (4); subdivision 2, clause (2), item (i) or (iii), (3), or (4); or subdivision 3, clause (2), item (i) or (iii), (3), or (4); or 609.2114, subdivision 2, clause (2), item (i) or (iii), (3), or (4), resulting in bodily harm, substantial bodily harm, or great bodily harm.\n(e) \"Qualified prior impaired driving incident\" has the meaning given in section 169A.03, subdivision 22.\n(a) The commissioner shall establish performance standards and a process for certifying devices used in the ignition interlock program, except that the commissioner may not establish standards that, directly or indirectly, require devices to use or enable location tracking capabilities without a court order.\n(b) The manufacturer of a device must apply annually for certification of the device by submitting the form prescribed by the commissioner. The commissioner shall require manufacturers of certified devices to:\n(1) provide device installation, servicing, and monitoring to indigent program participants at a discounted rate, according to the standards established by the commissioner;\n(2) include in an ignition interlock device contract a provision that a program participant who voluntarily terminates participation in the program is only liable for servicing and monitoring costs incurred during the time the device is installed on the motor vehicle, regardless of whether the term of the contract has expired; and\n(3) include in an ignition interlock device contract a provision that requires manufacturers of certified devices to pay any towing or repair costs caused by device failure or malfunction, or by damage caused during device installation, servicing, or monitoring.\n(c) The manufacturer of a certified device must include with an ignition interlock device contract a separate notice to the program participant regarding any location tracking capabilities of the device.\n(a) The commissioner shall establish guidelines for participation in the ignition interlock program. A person who seeks to participate in the program shall sign a written acknowledgment that the person has received, reviewed, and agreed to abide by the program guidelines.\n(b) The commissioner must enter a notation on a person's driving record to indicate that the person is a program participant.\n(c) A person under the age of 18 years is not eligible to be a program participant.\n(d) A program participant shall pay costs associated with an ignition interlock device on every motor vehicle that the participant operates or intends to operate.\n(e) A program participant shall participate in any treatment recommended in a chemical use assessment report.\n(f) A program participant shall bring the device-equipped motor vehicle or vehicles operated by the program participant to an approved service provider for device calibration and servicing according to the schedule established by the commissioner and as indicated by the ignition interlock device.\n(g) The commissioner shall not permit location tracking capabilities on any ignition interlock device to be enabled except as provided in this paragraph. The commissioner shall require the activation of location tracking capabilities on an ignition interlock device when ordered by a court.\nA program participant in the ignition interlock device program may operate an off-road recreational vehicle or a motorboat only if it is equipped with an approved ignition interlock device as provided under this section and sections 84.765, subdivision 2, and 86B.33, subdivision 2.\n(a) The commissioner shall issue a class D driver's license, subject to the applicable limitations and restrictions of this section, to a program participant who meets the requirements of this section and the program guidelines. The commissioner shall not issue a license unless the program participant has provided satisfactory proof that:\n(1) a certified ignition interlock device has been installed on the participant's motor vehicle at an installation service center designated by the device's manufacturer; and\n(2) the participant has insurance coverage on the vehicle equipped with the ignition interlock device. If the participant has previously been convicted of violating section 169.791, 169.793, or 169.797 or the participant's license has previously been suspended, revoked, or canceled under section 169.792 or 169.797, the commissioner shall require the participant to present an insurance identification card that is certified by the insurance company to be noncancelable for a period not to exceed 12 months.\n(b) A license issued under authority of this section must contain a restriction prohibiting the program participant from driving, operating, or being in physical control of any motor vehicle not equipped with a functioning ignition interlock device certified by the commissioner. A participant may drive an employer-owned vehicle not equipped with an interlock device while in the normal course and scope of employment duties pursuant to the program guidelines established by the commissioner and with the employer's written consent.\n(c) A program participant whose driver's license has been: (1) revoked under section 169A.52, subdivision 3, paragraph (a), clause (1), (2), or (3), or subdivision 4, paragraph (a), clause (1), (2), or (3); 169A.54, subdivision 1, clause (1), (2), (3), or (4); or 171.177, subdivision 4, paragraph (a), clause (1), (2), or (3), or subdivision 5, paragraph (a), clause (1), (2), or (3); or (2) revoked under section 171.17, subdivision 1, paragraph (a), clause (1), or suspended under section 171.187, for a violation of section 609.2113, subdivision 1, clause (2), item (i) or (iii), (3), or (4); subdivision 2, clause (2), item (i) or (iii), (3), or (4); or subdivision 3, clause (2), item (i) or (iii), (3), or (4); or 609.2114, subdivision 2, clause (2), item (i) or (iii), (3), or (4), resulting in bodily harm, substantial bodily harm, or great bodily harm, where the participant has fewer than two qualified prior impaired driving incidents within the past ten years or fewer than three qualified prior impaired driving incidents ever; may apply for conditional reinstatement of the driver's license, subject to the ignition interlock restriction.\n(d) A program participant whose driver's license has been: (1) revoked, canceled, or denied under section 169A.52, subdivision 3, paragraph (a), clause (4), (5), or (6), or subdivision 4, paragraph (a), clause (4), (5), or (6); 169A.54, subdivision 1, clause (5), (6), or (7); or 171.177, subdivision 4, paragraph (a), clause (4), (5), or (6), or subdivision 5, paragraph (a), clause (4), (5), or (6); or (2) revoked under section 171.17, subdivision 1, paragraph (a), clause (1), or suspended under section 171.187, for a violation of section 609.2113, subdivision 1, clause (2), item (i) or (iii), (3), or (4); subdivision 2, clause (2), item (i) or (iii), (3), or (4); or subdivision 3, clause (2), item (i) or (iii), (3), or (4); or 609.2114, subdivision 2, clause (2), item (i) or (iii), (3), or (4), resulting in bodily harm, substantial bodily harm, or great bodily harm, where the participant has two or more qualified prior impaired driving incidents within the past ten years or three or more qualified prior impaired driving incidents ever; may apply for conditional reinstatement of the driver's license, subject to the ignition interlock restriction, if the program participant is enrolled in a licensed substance use disorder treatment or rehabilitation program as recommended in a chemical use assessment. As a prerequisite to eligibility for eventual reinstatement of full driving privileges, a participant whose chemical use assessment recommended treatment or rehabilitation shall complete a licensed substance use disorder treatment or rehabilitation program. If the program participant's ignition interlock device subsequently registers a positive breath alcohol concentration of 0.02 or higher, the commissioner shall extend the time period that the participant must participate in the program until the participant has reached the required abstinence period described in section 169A.55, subdivision 4.\n(e) Notwithstanding any statute or rule to the contrary, the commissioner has authority to determine when a program participant is eligible for restoration of full driving privileges, except that the commissioner shall not reinstate full driving privileges until the program participant has met all applicable prerequisites for reinstatement under section 169A.55 and until the program participant's device has registered no positive breath alcohol concentrations of 0.02 or higher during the preceding 90 days.\n(a) If a program participant tampers with, circumvents, or bypasses a device; drives, operates, or exercises physical control over a motor vehicle not equipped with a device certified by the commissioner; violates a condition of a license conditionally reinstated under subdivision 4 and section 171.30; or violates the program guidelines of subdivision 3, the commissioner shall extend the person's revocation period under section 169A.52, 169A.54, or 171.177 by:\n(1) 180 days for a first violation;\n(2) one year for a second violation; or\n(3) 545 days for a third and each subsequent violation.\n(b) Notwithstanding paragraph (a), the commissioner may terminate participation in the program by any person when, in the commissioner's judgment, termination is necessary to the interests of public safety and welfare. In the event of termination, the commissioner shall not reduce the applicable revocation period under section 169A.52, 169A.54, or 171.177 by the amount of time during which the person possessed a limited or restricted driver's license issued under the authority of subdivision 4.\n(a) A person who lends, rents, or leases a motor vehicle that is not equipped with a functioning ignition interlock device certified by the commissioner to a person with a license issued under this section knowing that the person is subject to the ignition interlock restriction is guilty of a misdemeanor.\n(b) A person who tampers with, circumvents, or bypasses the ignition interlock device, or assists another to tamper with, circumvent, or bypass the device, is guilty of a misdemeanor except when the action was taken for emergency purposes or for mechanical repair, and the person limited to the use of an ignition interlock device does not operate the motor vehicle while the device is disengaged.\nIn addition to the provisions of Rule 24 of the Rules of Criminal Procedure and section 627.01, a violation of subdivision 6 or section 171.09, subdivision 1, paragraph (g), may be prosecuted in:\n(1) the county in which the vehicle involved in the offense is found;\n(2) the county in which the accused resides;\n(3) any county through which the vehicle traveled in the course of the trip during or after which the offense was committed; or\n(4) the county in which the impaired driving incident occurred, which resulted in the accused being issued a driver's license with an ignition interlock restriction.\nIn establishing the performance standards and certification process of subdivision 2, the program guidelines of subdivision 3, and any other rules necessary to implement this section, the commissioner is subject to chapter 14.\n(a) A judicial officer, county agency, or probation office may not require or suggest that a person participating in the ignition interlock program under this section use a particular ignition interlock vendor but may provide the person with a list of all Minnesota vendors of certified devices.\n(b) Paragraph (a) does not apply in counties where a contract exists for a specific vendor to provide interlock device service for program participants who are indigent pursuant to subdivision 2, paragraph (b), clause (1).",
	"repealed": false
}