{
	"id": "51A.37",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.37",
	"title": "51A.37 INVESTMENT IN LOANS.",
	"text": "Every association shall have power to invest in loans and other investments as set forth in this section.\nLoans secured by its savings accounts.\nReal estate loans in any amount, subject to the following conditions:\n(a) An association may participate with one or more financial institutions or other entities in any real estate loan of the type in which the association is authorized to invest on its own account.\n(b) The aggregate balances outstanding of real estate loans on real estate located outside the primary lending area of an association shall at no time exceed ten percent of the assets of the association, except that (1) loans insured or guaranteed in whole or in part by the United States, or a federal agency and (2) loans in which an association owns or has purchased no more than a 75 percent participation interest are not subject to this restriction.\n(c) Real estate loans on home property by mortgage or contract for deed, as provided in paragraphs (a) and (b) with no limit on purchase or sale thereof; and may participate with other lenders in the making, purchasing, or selling of the loans.\n(d) An association may purchase, at any sheriff's, judicial, or other sale, public or private, any real estate upon which it has a mortgage, judgment, or other lien, or in which it has any interest. It may acquire title to any real estate on which it holds any lien, in full or part satisfaction thereof, and may sell, convey, hold, lease, or mortgage the same. In transactions involving the purchase by a vendee of real estate, an association may, when authorized by its bylaws, acquire the title thereof, and it may give to the vendee a contract to convey the same as upon a sale thereof. Provided, that no association shall hereafter invest more than 50 percent of its assets in such contracts to convey. Upon default in the conditions of the contract, the association may terminate the interest of the vendee or the vendee's representatives or assigns by serving the notice provided by section 559.21, upon the vendee, or the vendee's representative or assigns.\nLoans secured by the pledge of policies of life insurance, the assignment of which is properly acknowledged by the insurer.\nProperty improvement loans made pursuant to the provisions of any title of the National Housing Act, and, other loans, secured or unsecured, to home owners and other property owners for the maintenance, repair, alteration, modernization, landscaping, improvements, including new construction, furnishings, and equipment installed and intended for use as part of the structure.\nLoans made for the purpose of manufactured home financing, subject to any limitations as to maximum loan amount which may be prescribed by rule of the commissioner for all associations. For the purposes of this subsection \"manufactured home\" shall mean a movable accommodation or relocatable housing used or designed for use as living quarters.\n[Repealed, 1988 c 666 s 75]\nLoans made for the payment of expenses of college or university education but the aggregate of such loans shall not exceed five percent of the association's assets. These loans may be secured, partially secured, or unsecured, and the association may require a comaker or comakers, insurance, guarantee under a governmental loan guarantee plan, or other protection against contingencies and subject to rules of the commissioner. The term \"college or university education\" means education at an institution which awards a bachelor's degree or which provides not less than a two-year program which is acceptable for full credit toward such a degree.\n[Repealed, 1988 c 666 s 75]\nConsumer loans.\nLoans to organizations and natural persons for business purposes.\nLoans for agricultural purposes.\n(a) No mutual association shall make a loan to one borrower if the sum of (1) the amount of the loan and (2) the total balances of all outstanding loans owed to the association by the borrower exceeds an amount equal to ten percent of the association's savings liability or an amount equal to the sum of the association's reserves for losses and undivided profits, whichever amount is less, except that any such loan may be made if the sum of clauses (1) and (2) does not exceed $500,000.\n(b) No stock association shall make a loan to one borrower if the sum of (1) the amount of the loan and (2) the total balances of all outstanding loans owed to the association by the borrower exceeds an amount equal to ten percent of the association's savings liability or an amount equal to the sum of the association's reserves for losses and capital and surplus, whichever amount is less, except that any such loan may be made if the sum of clauses (1) and (2) does not exceed $500,000.",
	"repealed": false
}