{
	"id": "150A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/150A.08",
	"title": "150A.08 LICENSURE AND REGISTRATION ACTIONS.",
	"text": "The board may refuse or by order suspend or revoke, limit or modify by imposing conditions it deems necessary, the license of a dentist, dental therapist, dental hygienist, or dental assistant upon any of the following grounds:\n(1) fraud or deception in connection with the practice of dentistry or the securing of a license certificate;\n(2) conviction, including a finding or verdict of guilt, an admission of guilt, or a no contest plea, in any court of a felony or gross misdemeanor reasonably related to the practice of dentistry as evidenced by a certified copy of the conviction;\n(3) conviction, including a finding or verdict of guilt, an admission of guilt, or a no contest plea, in any court of an offense involving moral turpitude as evidenced by a certified copy of the conviction;\n(4) habitual overindulgence in the use of intoxicating liquors;\n(5) improper or unauthorized prescription, dispensing, administering, or personal or other use of any legend drug as defined in chapter 151, of any chemical as defined in chapter 151, or of any controlled substance as defined in chapter 152;\n(6) conduct unbecoming a person licensed to practice dentistry, dental therapy, dental hygiene, or dental assisting, or conduct contrary to the best interest of the public, as such conduct is defined by the rules of the board;\n(7) gross immorality;\n(8) any physical, mental, emotional, or other disability which adversely affects a dentist's, dental therapist's, dental hygienist's, or dental assistant's ability to perform the service for which the person is licensed;\n(9) revocation or suspension of a license or equivalent authority to practice, or other disciplinary action or denial of a license application taken by a licensing or credentialing authority of another state, territory, or country as evidenced by a certified copy of the licensing authority's order, if the disciplinary action or application denial was based on facts that would provide a basis for disciplinary action under this chapter and if the action was taken only after affording the credentialed person or applicant notice and opportunity to refute the allegations or pursuant to stipulation or other agreement;\n(10) failure to maintain adequate safety and sanitary conditions for a dental office in accordance with the standards established by the rules of the board;\n(11) employing, assisting, or enabling in any manner an unlicensed person to practice dentistry;\n(12) failure or refusal to attend, testify, and produce records as directed by the board under subdivision 7;\n(13) violation of, or failure to comply with, any other provisions of sections 150A.01 to 150A.12, the rules of the Board of Dentistry, or any disciplinary order issued by the board, sections 144.291 to 144.298 or 595.02, subdivision 1, paragraph (d), or for any other just cause related to the practice of dentistry. Suspension, revocation, modification or limitation of any license shall not be based upon any judgment as to therapeutic or monetary value of any individual drug prescribed or any individual treatment rendered, but only upon a repeated pattern of conduct;\n(14) knowingly providing false or misleading information that is directly related to the care of that patient unless done for an accepted therapeutic purpose such as the administration of a placebo; or\n(15) aiding suicide or aiding attempted suicide in violation of section 609.215 as established by any of the following:\n(i) a copy of the record of criminal conviction or plea of guilty for a felony in violation of section 609.215, subdivision 1 or 2;\n(ii) a copy of the record of a judgment of contempt of court for violating an injunction issued under section 609.215, subdivision 4;\n(iii) a copy of the record of a judgment assessing damages under section 609.215, subdivision 5; or\n(iv) a finding by the board that the person violated section 609.215, subdivision 1 or 2. The board shall investigate any complaint of a violation of section 609.215, subdivision 1 or 2.\nMS 1974 [Repealed, 1976 c 222 s 209]\nAny licensee whose license has been suspended or revoked may have the license reinstated or a new license issued, as the case may be, when the board deems the action is warranted.\n(a) The board may impose a civil penalty not exceeding $10,000 for each separate violation, the amount of the civil penalty to be fixed so as to deprive a licensee of any economic advantage gained by reason of the violation, to discourage similar violations by the licensee or any other licensee, or to reimburse the board for the cost of the investigation and proceeding, including, but not limited to, fees paid for services provided by the Office of Administrative Hearings, legal and investigative services provided by the Office of the Attorney General, court reporters, witnesses, reproduction of records, board members' per diem compensation, board staff time, and travel costs and expenses incurred by board staff and board members.\n(b) In addition to costs and penalties imposed under paragraph (a), the board may also:\n(1) order the dentist, dental therapist, dental hygienist, or dental assistant to provide unremunerated service;\n(2) censure or reprimand the dentist, dental therapist, dental hygienist, or dental assistant; or\n(3) any other action as allowed by law and justified by the facts of the case.\nThe executive secretary of the board shall keep a record of all licenses and registration certificates issued, suspended, or revoked.\nIf the board has probable cause to believe that a dentist, dental therapist, dental hygienist, dental assistant, or applicant engages in acts described in subdivision 1, clause (4) or (5), or has a condition described in subdivision 1, clause (8), it shall direct the dentist, dental therapist, dental hygienist, dental assistant, or applicant to submit to a mental or physical examination or a substance use disorder assessment. For the purpose of this subdivision, every dentist, dental therapist, dental hygienist, or dental assistant licensed under this chapter or person submitting an application for a license is deemed to have given consent to submit to a mental or physical examination when directed in writing by the board and to have waived all objections in any proceeding under this section to the admissibility of the examining physician's testimony or examination reports on the ground that they constitute a privileged communication. Failure to submit to an examination without just cause may result in an application being denied or a default and final order being entered without the taking of testimony or presentation of evidence, other than evidence which may be submitted by affidavit, that the licensee or applicant did not submit to the examination. A dentist, dental therapist, dental hygienist, dental assistant, or applicant affected under this section shall at reasonable intervals be afforded an opportunity to demonstrate ability to start or resume the competent practice of dentistry or perform the duties of a dental therapist, dental hygienist, or dental assistant with reasonable skill and safety to patients. In any proceeding under this subdivision, neither the record of proceedings nor the orders entered by the board is admissible, is subject to subpoena, or may be used against the dentist, dental therapist, dental hygienist, dental assistant, or applicant in any proceeding not commenced by the board. Information obtained under this subdivision shall be classified as private pursuant to the Minnesota Government Data Practices Act.\nNotwithstanding contrary provisions of sections 13.384 and 144.651 or any other statute limiting access to medical or other health data, the board may obtain medical data and health records of a licensee or applicant without the licensee's or applicant's consent if the information is requested by the board as part of the process specified in subdivision 5. The medical data may be requested from a provider, as defined in section 144.291, subdivision 2, paragraph (h), an insurance company, or a government agency, including the Department of Human Services. A provider, insurance company, or government agency shall comply with any written request of the board under this subdivision and shall not be liable in any action for damages for releasing the data requested by the board if the data are released pursuant to a written request under this subdivision, unless the information is false and the provider giving the information knew, or had reason to believe, the information was false. Information obtained under this subdivision shall be classified as private under the Minnesota Government Data Practices Act.\nNo person is excused from attending and testifying at any proceeding initiated by the board or from producing any document before the board on the ground that the testimony or evidence required may tend to incriminate the person; but no person may be prosecuted for any crime related to the matter about which the person testifies or produces evidence required or requested by the board if the person first claims a privilege against self-incrimination. This immunity from criminal prosecution does not apply to prosecution for perjury or contempt committed in testifying or producing the evidence.\nIn addition to any other remedy provided by law, the board may, through its designated board members pursuant to section 214.10, subdivision 2, temporarily suspend a license without a hearing if the board finds that the licensee has violated a statute or rule which the board is empowered to enforce and continued practice by the licensee would create an imminent risk of harm to others. The suspension shall take effect upon written notice to the licensee served by first class mail specifying the statute or rule violated, and the time, date, and place of the hearing before the board. If the notice is returned by the post office, the notice shall be effective upon reasonable attempts to locate and serve the licensee. Within ten days of service of the notice, the board shall hold a hearing before its own members on the sole issue of whether there is a reasonable basis to continue, modify, or lift the suspension. Evidence presented by the board or licensee shall be in affidavit form only. The licensee or counsel of the licensee may appear for oral argument. Within five working days after the hearing, the board shall issue its order and, if the suspension is continued, the board shall schedule a disciplinary hearing to be held pursuant to the Administrative Procedure Act within 45 days of issuance of the order. The administrative law judge shall issue a report within 30 days of the closing of the contested case hearing record. The board shall issue a final order within 30 days of receiving that report. The board may allow a person who was licensed by any state to practice dentistry and whose license has been suspended to practice dentistry under the supervision of a licensed dentist for the purpose of demonstrating competence and eligibility for reinstatement.\n(a) In addition to the grounds provided in subdivision 1 and notwithstanding subdivision 3, the board may not issue or renew a license to practice dentistry if the commissioner of revenue notifies the board and the licensee or applicant for a license that the licensee or applicant owes the state delinquent taxes in the amount of $500 or more. The board may issue or renew the license only if (1) the commissioner of revenue issues a tax clearance certificate and (2) the commissioner of revenue or the licensee or applicant forwards a copy of the clearance to the board. The commissioner of revenue may issue a clearance certificate only if the licensee or applicant does not owe the state any uncontested delinquent taxes.\n(b) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Taxes\" are all taxes payable to the commissioner of revenue, including penalties and interest due on those taxes.\n(2) \"Delinquent taxes\" do not include a tax liability if (i) an administrative or court action that contests the amount or validity of the liability has been filed or served, (ii) the appeal period to contest the tax liability has not expired, or (iii) the licensee or applicant has entered into a payment agreement to pay the liability and is current with the payments.\n(c) In lieu of the notice and hearing requirements of subdivision 8, when a licensee or applicant is required to obtain a clearance certificate under this subdivision, a contested case hearing must be held if the licensee or applicant requests a hearing in writing to the commissioner of revenue within 30 days of the date of the notice provided in paragraph (a). The hearing must be held within 45 days of the date the commissioner of revenue refers the case to the Office of Administrative Hearings. Notwithstanding any law to the contrary, the licensee or applicant must be served with 20 days' notice in writing specifying the time and place of the hearing and the allegations against the licensee or applicant. The notice may be served personally or by mail.\n(d) The board shall require all licensees or applicants for a license to practice dentistry to provide their Social Security number and Minnesota business identification number on all license applications. Upon request of the commissioner of revenue, the board must provide to the commissioner of revenue a list of all licensees and applicants for a license to practice dentistry including the name and address, Social Security number, and business identification number. The commissioner of revenue may request a list of the licensees and applicants no more than once each calendar year.",
	"repealed": false
}