{
	"id": "203B.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.23",
	"title": "203B.23 ABSENTEE BALLOT BOARD.",
	"text": "The county auditor must establish an absentee ballot board for ballots issued under sections 203B.16 to 203B.27. The board may consist of staff trained as election judges, in which case, the board is exempt from sections 204B.19, subdivision 5, and 204C.15, relating to party balance in appointment of judges and to duties to be performed by judges of different major political parties.\n(a) The absentee ballot board must examine all returned absentee ballot envelopes for ballots issued under sections 203B.16 to 203B.27 and accept or reject the absentee ballots in the manner provided in section 203B.24. If the certificate of voter eligibility is not printed on the signature envelope, the certificate must be attached to the ballot envelope.\n(b) The absentee ballot board must immediately examine the signature envelopes or certificates of voter eligibility that are attached to the ballot envelopes and mark them \"accepted\" or \"rejected\" during the 45 days before the election. If an envelope has been rejected at least five days before the election, the ballots in the envelope must be considered spoiled ballots and the official in charge of the absentee ballot board must provide the voter with a replacement absentee ballot and envelopes in place of the spoiled ballot.\n(c) If a county has delegated the responsibility for administering absentee balloting to a municipality under section 203B.05, accepted absentee ballots must be delivered to the appropriate municipality's absentee ballot board. The absentee ballot board with the authority to open and count the ballots must do so in accordance with section 203B.121, subdivisions 4 and 5.\nExcept as otherwise provided in this section, all the laws applicable to absentee ballots and absentee voters and all other provisions of the Minnesota Election Law apply to an absentee ballot board.",
	"repealed": false
}