{
	"id": "116J.9922",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.9922",
	"title": "116J.9922 CENTRAL MINNESOTA OPPORTUNITY GRANT PROGRAM.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Commissioner\" means the commissioner of employment and economic development.\n(c) \"Community initiative\" means a nonprofit organization which provides services to central Minnesota communities of color in one or more of the program areas listed in subdivision 4, paragraph (a).\n(d) \"Foundation\" means the Central Minnesota Community Foundation.\nThe commissioner shall establish a central Minnesota opportunity grant program, administered by the foundation, to identify and support community initiatives in the St. Cloud area that enhance long-term economic self-sufficiency by improving education, housing, and economic outcomes for central Minnesota communities of color.\nThe commissioner shall award all grant funds to the foundation, which shall administer the central Minnesota opportunity grant program. The foundation may use up to five percent of grant funds for administrative costs.\n(a) The foundation must award funds through a competitive grant process to community initiatives that will provide services, either alone or in partnership with another nonprofit organization, in one or more of the following areas:\n(1) economic development, including but not limited to programs to foster entrepreneurship or small business development;\n(2) education, including but not limited to programs to encourage civic engagement or provide youth after-school or recreation programs; or\n(3) housing, including but not limited to, programs to prevent and respond to homelessness or to provide access to loans or grants for housing stability and affordability.\n(b) To receive grant funds, a community initiative must submit a written application to the foundation, using a form developed by the foundation. This grant application must include:\n(1) a description of the activities that will be funded by the grant;\n(2) an estimate of the cost of each grant activity;\n(3) the total cost of the project;\n(4) the sources and amounts of nonstate funds supplementing the grant;\n(5) how the project aims to achieve stated outcomes in areas including improved job training; workforce development; small business support; early childhood, kindergarten through grade 12, and higher education achievement; and access to housing, including loans; and\n(6) any additional information requested by the foundation.\n(c) In awarding grants under this subdivision, the foundation shall give weight to applications from organizations that demonstrate:\n(1) a history of successful provision of the services listed in paragraph (a); and\n(2) a history of successful fundraising from private sources for such services.\n(d) In evaluating grant applications, the foundation shall not consider the composition of a community initiative's governing board.\n(e) Grant funds may be used by a community initiative for the following purposes:\n(1) operating costs, including but not limited to staff, office space, computers, software, and web development and maintenance services;\n(2) program costs;\n(3) travel within Minnesota;\n(4) consultants directly related to and necessary for delivering services listed in paragraph (a); and\n(5) capacity building.\nBy January 15, 2019, and each January 15 thereafter through 2022, the commissioner must submit a report to the chairs and ranking minority members of the house of representatives and the senate committees with jurisdiction over economic development that details the use of grant funds. This report must include data on the number of individuals served and, to the extent practical, measures of progress toward achieving the outcomes stated in subdivision 4, paragraph (b), clause (5).",
	"repealed": false
}