{
	"id": "462D.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/462D.03",
	"title": "462D.03 ESTABLISHMENT OF ACCOUNTS.",
	"text": "An individual may open an account with a financial institution and designate the account as a first-time home buyer savings account to be used to pay or reimburse the designated qualified beneficiary's eligible costs.\n(a) The account holder must designate a first-time home buyer as the qualified beneficiary of the account in a form and manner prescribed by the commissioner following the taxable year in which the account was established. The account holder may be the qualified beneficiary. The account holder may change the designated qualified beneficiary at any time, but no more than one qualified beneficiary may be designated for an account at any one time. For purposes of the one beneficiary restriction, a married couple qualifies as one beneficiary. Changing the designated qualified beneficiary of an account does not affect computation of the ten-year period under section 462D.06, subdivision 2.\n(b) The commissioner shall establish a process for account holders to notify the state that permits recording of the account, the account holder or holders, any transfers under section 462D.04, subdivision 2, and the designated qualified beneficiary for each account. This may be done upon filing the account holder's income tax return or in any other way the commissioner determines to be appropriate.\nAn individual may jointly own a first-time home buyer account with another person if the joint account holders file a married joint income tax return.\n(a) An individual may be the account holder of more than one first-time home buyer savings account, but must not hold or own multiple accounts that designate the same qualified beneficiary.\n(b) An individual may be designated as the qualified beneficiary on more than one first-time home buyer savings account.\nOnly cash may be contributed to a first-time home buyer savings account. Individuals other than the account holder may contribute to an account. No more than $14,000 ($28,000 for married joint filers) may be contributed in any year and no more than $50,000 ($100,000 for married joint filers) may be contributed in all years. The maximum amount in any account is limited to $150,000.",
	"repealed": false
}