{
	"id": "179A.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.13",
	"title": "179A.13 UNFAIR LABOR PRACTICES.",
	"text": "(a) The practices specified in this section are unfair labor practices. Any employee, employer, employee or employer organization, exclusive representative, or any other person or organization aggrieved by an unfair labor practice as defined in this section may file an unfair labor practice charge with the board.\n(b) Whenever it is charged that any party has engaged in or is engaging in any unfair labor practice, an investigator designated by the board shall promptly conduct an investigation of the charge. Unless after the investigation the board finds that the charge has no reasonable basis in law or fact, the board shall promptly issue a complaint and cause to be served upon the party a complaint stating the charges, accompanied by a notice of hearing before a qualified hearing officer designated by the board at the offices of the bureau or other location as the board deems appropriate, not more than 30 days after serving the complaint absent mutual agreement of the parties, provided that no complaint shall be issued based upon any unfair labor practice occurring more than six months prior to the filing of a charge. A complaint issued under this subdivision may be amended by the board at any time prior to the issuance of an order based thereon. The party who is the subject of the complaint has the right to file an answer to the original or amended complaint prior to hearing and to appear in person or by a representative and give testimony at the place and time fixed in the complaint. In the discretion of the hearing officer conducting the hearing or the board, any other party may be allowed to intervene in the proceeding and to present testimony. The board or designated hearing officers shall not be bound by the rules of evidence applicable to courts, except as to the rules of privilege recognized by law.\n(c) Designated investigators must conduct the investigation of charges.\n(d) Hearing officers must have a juris doctor and must conduct the hearings and issue recommended decisions and orders.\n(e) The board or its designees shall have the power to issue subpoenas and administer oaths. If any party willfully fails or neglects to appear or testify or to produce books, papers, and records pursuant to the issuance of a subpoena, the board may apply to a court of competent jurisdiction to request that the party be ordered to appear to testify or produce the requested evidence.\n(f) A full and complete record shall be kept of all proceedings before the board or designated hearing officer and shall be transcribed by a reporter appointed by the board.\n(g) The party on whom the burden of proof rests shall be required to sustain the burden by a preponderance of the evidence.\n(h) At any time prior to the close of a hearing, the parties may by mutual agreement request referral to mediation, at which time the commissioner shall appoint a mediator, and the hearing shall be suspended pending the results of the mediation.\n(i) If, upon a preponderance of the evidence taken, the hearing officer determines that any party named in the charge has engaged in or is engaging in an unfair labor practice, then a recommended decision and order shall be issued stating findings of fact and conclusions, and requiring the party to cease and desist from the unfair labor practice, to post a cease-and-desist notice in the workplace, and ordering any appropriate relief to effectuate the policies of this section, including but not limited to reinstatement, back pay, and any other remedies that make a charging party whole. If back pay is awarded, the award must include interest at the rate of seven percent per annum. The order further may require the party to make reports from time to time, and demonstrate the extent to which the party has complied with the order.\n(j) If there is no preponderance of evidence that the party named in the charge has engaged in or is engaging in the unfair labor practice, then the hearing officer shall issue a recommended decision and order stating findings of fact and dismissing the complaint.\n(k) Parties may file exceptions to the hearing officer's recommended decision and order with the board no later than 30 days after service of the recommended decision and order. The board shall review the recommended decision and order upon timely filing of exceptions or upon its own motion. If no timely exceptions have been filed, the parties must be deemed to have waived their exceptions. Unless the board reviews the recommended decision and order upon its own motion, it must not be legal precedent and must be final and binding only on the parties to the proceeding as issued in an order issued by the board. If the board does review the recommended decision and order, the board may adopt all, part, or none of the recommended decision and order, depending on the extent to which it is consistent with the record and applicable laws. The board shall issue and serve on all parties its decision and order. The board shall retain jurisdiction over the case to ensure the parties' compliance with the board's order. Unless overturned by the board, the parties must comply with the recommended decision and order.\n(l) Until the record has been filed in the court of appeals or district court, the board at any time, upon reasonable notice and in a manner it deems appropriate, may modify or set aside, in whole or in part, any finding or order made or issued by it.\n(m) Upon a final order that an unfair labor practice has been committed, the board or the charging party may petition the district court for the enforcement of the order and for appropriate temporary relief or a restraining order. When the board petitions the court, the charging party may intervene as a matter of right.\n(n) Whenever it appears that any party has violated a final order of the board issued pursuant to this section, the board must petition the district court for an order directing the party and its officers, agents, servants, successors, and assigns to comply with the order of the board. The board shall be represented in this action by its general counsel, who has been appointed by the board. The court may grant or refuse, in whole or in part, the relief sought, provided that the court also may stay an order of the board pending disposition of the proceedings. The court may punish a violation of its order as in civil contempt.\n(o) The board shall have power, upon issuance of an unfair labor practice complaint alleging that a party has engaged in or is engaging in an unfair labor practice, to petition the district court for appropriate temporary relief or a restraining order. Upon the filing of any such petition, the court shall cause notice thereof to be served upon such parties, and thereupon shall have jurisdiction to grant to the board or commissioner temporary relief or a restraining order as it deems appropriate. Nothing in this paragraph precludes a charging party from seeking injunctive relief in district court after filing the unfair labor practice charge.\n(p) The proceedings in paragraphs (m), (n), and (o) shall be commenced in the district court for the county in which the unfair labor practice which is the subject of the order or administrative complaint was committed, or where a party alleged to have committed the unfair labor practice resides or transacts business.\nPublic employers, their agents and representatives are prohibited from:\n(1) interfering, restraining, or coercing employees in the exercise of the rights guaranteed in sections 179A.01 to 179A.25;\n(2) dominating or interfering with the formation, existence, or administration of any employee organization or contributing other support to it;\n(3) discriminating in regard to hire or tenure to encourage or discourage membership in an employee organization;\n(4) discharging or otherwise discriminating against an employee because the employee has signed or filed an affidavit, petition, or complaint or given information or testimony under sections 179A.01 to 179A.25;\n(5) refusing to meet and negotiate in good faith with the exclusive representative of its employees in an appropriate unit;\n(6) refusing to comply with grievance procedures contained in an agreement;\n(7) distributing or circulating a blacklist of individuals exercising a legal right or of members of a labor organization for the purpose of preventing blacklisted individuals from obtaining or retaining employment;\n(8) violating rules established by the commissioner regulating the conduct of representation elections;\n(9) refusing to comply with a valid decision of a binding arbitration panel or arbitrator;\n(10) violating or refusing to comply with any lawful order or decision issued by the commissioner or the board;\n(11) refusing to provide, upon the request of the exclusive representative, all information pertaining to the public employer's budget both present and proposed, revenues, and other financing information provided that in the executive branch of state government this clause may not be considered contrary to the budgetary requirements of sections 16A.10 and 16A.11;\n(12) granting or offering to grant the status of permanent replacement employee to a person for performing bargaining unit work for the employer during a lockout of employees in an employee organization or during a strike authorized by an employee organization that is an exclusive representative;\n(13) failing or refusing to provide information that is relevant to enforcement or negotiation of a contract as soon as reasonable after receiving a request by an exclusive representative, not to exceed 30 days for information relevant to contract enforcement or 60 days for information relevant to contract negotiation absent mutual agreement by the parties, provided that a state agency may request and the commissioner may extend these timelines based upon estimated need and after consultation with the exclusive representative; or\n(14) refusing to reassign a position after the commissioner has determined the position was not placed into the correct bargaining unit.\nEmployee organizations, their agents or representatives, and public employees are prohibited from:\n(1) restraining or coercing employees in the exercise of rights provided in sections 179A.01 to 179A.25;\n(2) restraining or coercing a public employer in the election of representatives to be employed to meet and negotiate or to adjust grievances;\n(3) refusing to meet and negotiate in good faith with a public employer, if the employee organization is the exclusive representative of employees in an appropriate unit;\n(4) violating rules established by the commissioner regulating the conduct of representation elections;\n(5) refusing to comply with a valid decision of an arbitration panel or arbitrator;\n(6) calling, instituting, maintaining, or conducting a strike or boycott against any public employer on account of any jurisdictional controversy;\n(7) coercing or restraining any person with the effect to:\n(i) force or require any public employer to cease dealing or doing business with any other person;\n(ii) force or require a public employer to recognize for representation purposes an employee organization not certified by the commissioner;\n(iii) refuse to handle goods or perform services; or\n(iv) prevent an employee from providing services to the employer;\n(8) committing any act designed to damage or actually damaging physical property or endangering the safety of persons while engaging in a strike;\n(9) forcing or requiring any employer to assign particular work to employees in a particular employee organization or in a particular trade, craft, or class rather than to employees in another employee organization or in another trade, craft, or class;\n(10) causing or attempting to cause a public employer to pay or deliver or agree to pay or deliver any money or other thing of value, in the nature of an exaction, for services which are not performed or not to be performed;\n(11) engaging in an unlawful strike;\n(12) picketing which has an unlawful purpose such as secondary boycott;\n(13) picketing which unreasonably interferes with the ingress and egress to facilities of the public employer;\n(14) seizing or occupying or destroying property of the employer;\n(15) violating or refusing to comply with any lawful order or decision issued by the commissioner or the board.",
	"repealed": false
}