{
	"id": "525A.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/525A.08",
	"title": "525A.08 PRECLUSIVE EFFECT OF ANATOMICAL GIFT, AMENDMENT, OR REVOCATION.",
	"text": "(a) Except as otherwise provided in paragraph (g) and subject to paragraph (f), in the absence of an express, contrary indication by the donor, a person other than the donor is barred from making, amending, or revoking an anatomical gift of a donor's body or part if the donor made an anatomical gift of the donor's body or part under section 525A.05 or an amendment to an anatomical gift of the donor's body or part under section 525A.06. An anatomical gift made in a will, a designation on a driver's license or identification card, or a health care directive under chapter 145C, and not revoked, establishes the intent of the person making the designation and may not be overridden by any other person.\n(b) A donor's revocation of an anatomical gift of the donor's body or part under section 525A.06 is not a refusal and does not bar another person specified in section 525A.04 or 525A.09 from making an anatomical gift of the donor's body or part under section 525A.05 or 525A.10.\n(c) If a person other than the donor makes an unrevoked anatomical gift of the donor's body or part under section 525A.05 or an amendment to an anatomical gift of the donor's body or part under section 525A.06, another person may not make, amend, or revoke the gift of the donor's body or part under section 525A.10.\n(d) A revocation of an anatomical gift of a donor's body or part under section 525A.06 by a person other than the donor does not bar another person specified in section 525A.09 from making an anatomical gift of the body or part under section 525A.05 or 525A.10.\n(e) In the absence of an express, contrary indication by the donor or other person authorized to make an anatomical gift under section 525A.04, an anatomical gift of a part is neither a refusal to give another part nor a limitation on the making of an anatomical gift of another part at a later time by the donor or another person.\n(f) In the absence of an express, contrary indication by the donor or other person authorized to make an anatomical gift under section 525A.04, an anatomical gift of a part for one or more of the purposes set forth in section 525A.04 is not a limitation on the making of an anatomical gift of the part for any of the other purposes by the donor or any other person under section 525A.05 or 525A.10.\n(g) If a donor who is an unemancipated minor dies, a parent of the donor who is reasonably available may revoke or amend an anatomical gift of the donor's body or part.\n(h) If an unemancipated minor who signed a refusal dies, a parent of the minor who is reasonably available may revoke the minor's refusal.",
	"repealed": false
}