{
	"id": "245C.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.02",
	"title": "245C.02 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Access to persons served by a program\" means physical access to persons receiving services, access to the persons' personal property, or access to the persons' personal, financial, or health information, without continuous, direct supervision, as defined in subdivision 8.\n\"Alternative background study\" means:\n(1) the collection and processing of a background study subject's fingerprints, including the process of obtaining a background study subject's classifiable fingerprints and photograph as required by section 245C.05, subdivision 5, paragraph (c); and\n(2) a review of records conducted by the commissioner pursuant to section 245C.08 in order to forward the background study investigating information to the entity that submitted the alternative background study request under section 245C.031, subdivision 2. The commissioner shall not make any eligibility determinations on background studies conducted under section 245C.031.\n\"Annual\" or \"annually\" has the meaning given in section 245A.02, subdivision 2b.\n\"Applicant\" has the meaning given in section 245A.02, subdivision 3.\n\"Authorized fingerprint collection vendor\" means a qualified organization under a written contract with the commissioner to provide services in accordance with section 245C.05, subdivision 5, paragraph (c).\n\"Background study\" means the review of records conducted by the commissioner to determine whether a subject is disqualified from direct contact with persons served by a program and, where specifically provided in statutes, whether a subject is disqualified from having access to persons served by a program and from working in a children's residential facility or foster residence setting.\nMS 2020 [Renumbered subd 12a]\n\"Child\" has the meaning given in section 245A.02, subdivision 4.\n(a) \"Child care background study subject\" means an individual who is affiliated with a licensed child care center, certified license-exempt child care center, licensed family child care program, or legal nonlicensed child care provider authorized under chapter 142E, and who is:\n(1) employed by a child care provider for compensation;\n(2) assisting in the care of a child for a child care provider;\n(3) a person applying for licensure, certification, or enrollment;\n(4) a controlling individual as defined in section 245A.02, subdivision 5a;\n(5) an individual 13 years of age or older who lives in the household where the licensed program will be provided and who is not receiving licensed services from the program;\n(6) an individual ten to 12 years of age who lives in the household where the licensed services will be provided when the commissioner has reasonable cause as defined in section 245C.02, subdivision 15;\n(7) an individual who, without providing direct contact services at a licensed program, certified program, or program authorized under chapter 142E, may have unsupervised access to a child receiving services from a program when the commissioner has reasonable cause as defined in section 245C.02, subdivision 15;\n(8) a volunteer, contractor providing services for hire in the program, prospective employee, or other individual who has unsupervised physical access to a child served by a program and who is not under supervision by an individual listed in clause (1) or (5), regardless of whether the individual provides program services; or\n(9) an authorized agent in a license-exempt certified child care center as defined in section 142C.01, subdivision 3.\n(b) Notwithstanding paragraph (a), an individual who is providing services that are not part of the child care program is not required to have a background study if:\n(1) the child receiving services is signed out of the child care program for the duration that the services are provided;\n(2) the licensed child care center, certified license-exempt child care center, licensed family child care program, or legal nonlicensed child care provider authorized under chapter 142E has obtained advanced written permission from the parent authorizing the child to receive the services, which is maintained in the child's record;\n(3) the licensed child care center, certified license-exempt child care center, licensed family child care program, or legal nonlicensed child care provider authorized under chapter 119B maintains documentation on site that identifies the individual service provider and the services being provided; and\n(4) the licensed child care center, certified license-exempt child care center, licensed family child care program, or legal nonlicensed child care provider authorized under chapter 119B ensures that the service provider does not have unsupervised access to a child not receiving the provider's services.\n\"Children's residential facility\" means a children's residential facility licensed by the commissioner of corrections or the commissioner of human services under Minnesota Rules, chapter 2960.\n\"Commissioner\" has the meaning given in section 245A.02, subdivision 5.\n\"Conservator\" has the meaning given in section 524.1-201, clause (10), and includes proposed and current conservators.\n\"Continuous, direct supervision\" means an individual is within sight or hearing of the program's supervising individual to the extent that the program's supervising individual is capable at all times of intervening to protect the health and safety of the persons served by the program.\nMS 2022 [Repealed, 2023 c 70 art 17 s 63]\n\"Conviction\" has the meaning given in section 609.02, subdivision 5.\n\"County agency\" has the meaning given in section 245A.02, subdivision 6.\n\"Direct contact\" means providing face-to-face care, training, supervision, counseling, consultation, or medication assistance to persons served by the program.\nMS 2020 [Renumbered subd 11d]\nMS 2020 [Renumbered subd 11e]\n[Renumbered 245C.02, subd 11g]\n[Renumbered 245C.02, subd 11h]\n[Renumbered 245C.02, subd 11i]\n\"Employee\" means an individual who provides services or seeks to provide services for or through the entity with which they are required to be affiliated in NETStudy 2.0 and who is subject to oversight by the entity, which includes but is not limited to continuous, direct supervision by the entity and being subject to immediate removal from providing direct contact services by the entity when required. This subdivision does not apply to child care background study subjects under subdivision 6a.\n\"Entity\" means any program, organization, license holder, or agency required to initiate or submit a background study.\n[Renumbered 245C.02, subd 11j]\n\"Foster family setting\" has the meaning given in Minnesota Rules, part 2960.3010, subpart 23.\n\"Foster residence setting\" has the meaning given in Minnesota Rules, part 2960.3010, subpart 26, and includes settings licensed by the commissioner of corrections or the commissioner of human services.\n\"Guardian\" has the meaning given in section 524.1-201, clause (27), and includes proposed and current guardians.\n\"License\" has the meaning given in section 245A.02, subdivision 8.\n\"License-exempt child care center certification holder\" has the meaning given for \"certification holder\" in section 142C.01, subdivision 5.\n\"License holder\" has the meaning given in section 245A.02, subdivision 9.\nMS 2020 [Renumbered subd 13d]\nMS 2020 [Renumbered subd 13e]\n(a) \"National criminal history record check\" means a check of records maintained by the Federal Bureau of Investigation through submission of fingerprints through the Minnesota Bureau of Criminal Apprehension to the Federal Bureau of Investigation, when specifically required by law.\n(b) For the purposes of this chapter, \"national crime information database,\" \"national criminal records repository,\" \"criminal history with the Federal Bureau of Investigation,\" and \"national criminal record check\" refer to a national criminal history record check as defined in this subdivision.\n\"NETStudy\" means the commissioner's online system implemented in July 2004 and used by entities for submitting background study requests required under this chapter.\n(a) \"NETStudy 2.0\" means the commissioner's system that replaces both NETStudy and the department's internal background study processing system. NETStudy 2.0 is designed to enhance protection of children and vulnerable adults by improving the accuracy of background studies through fingerprint-based criminal record checks and expanding the background studies to include a review of information from the Minnesota Court Information System and the national crime information database. NETStudy 2.0 is also designed to increase efficiencies in and the speed of the hiring process by:\n(1) providing access to and updates from public web-based data related to employment eligibility;\n(2) decreasing the need for repeat studies through electronic updates of background study subjects' criminal records;\n(3) supporting identity verification using subjects' Social Security numbers and photographs;\n(4) using electronic employer notifications;\n(5) issuing immediate verification of subjects' eligibility to provide services as more studies are completed under the NETStudy 2.0 system; and\n(6) providing electronic access to certain notices for entities and background study subjects.\n(b) Information obtained by entities from public web-based data through NETStudy 2.0 under paragraph (a), clause (1), or any other source that is not direct correspondence from the commissioner is not a notice of disqualification from the commissioner under this chapter.\n\"Person\" means a child as defined in subdivision 6 or an adult as defined in section 245A.02, subdivision 2.\n\"Private agency\" has the meaning given in section 142B.01, subdivision 22.\nMS 2022 [Repealed, 2023 c 70 art 7 s 47]\n\"Reasonable cause\" means information or circumstances exist that provide the commissioner with articulable suspicion that further pertinent information may exist concerning a subject. The commissioner has reasonable cause to require a background study when the commissioner has received a report from the subject, the license holder, or a third party indicating that the subject has a history that would disqualify the individual or that may pose a risk to the health or safety of persons receiving services.\n(a) \"Reasonable cause to require a national criminal history record check\" means information or circumstances exist that provide the commissioner with articulable suspicion that further pertinent information may exist concerning a background study subject that merits conducting a national criminal history record check on that subject. The commissioner has reasonable cause to require a national criminal history record check when:\n(1) information from the Bureau of Criminal Apprehension indicates that the subject is a multistate offender;\n(2) information from the Bureau of Criminal Apprehension indicates that multistate offender status is undetermined;\n(3) the commissioner has received a report from the subject or a third party indicating that the subject has a criminal history in a jurisdiction other than Minnesota; or\n(4) information from the Bureau of Criminal Apprehension for a state-based name and date of birth background study in which the subject is a minor that indicates that the subject has a criminal history.\n(b) In addition to the circumstances described in paragraph (a), the commissioner has reasonable cause to require a national criminal history record check if the subject is not currently residing in Minnesota or resided in a jurisdiction other than Minnesota during the previous five years.\n\"Recurring maltreatment\" means more than one incident of maltreatment for which there is a preponderance of evidence that the maltreatment occurred and that the subject was responsible for the maltreatment.\n\"Results\" means a determination that a study subject is eligible, disqualified, set aside, granted a variance, or that more time is needed to complete the background study.\n[Repealed, 2004 c 288 art 1 s 83]\n(a) \"Roster\" means the electronic method used to identify the entity or entities required to conduct background studies under this chapter with which a background subject is affiliated. There are three types of rosters: active roster, inactive roster, and master roster.\n(b) \"Active roster\" means the list of individuals specific to an entity who have been determined eligible under this chapter to provide services for the entity and who the entity has identified as affiliated. An individual shall remain on the entity's active roster and is considered affiliated until the commissioner determines the individual is ineligible or the entity removes the individual from the entity's active roster.\n(c) \"Inactive roster\" means the list maintained by the commissioner of individuals who are eligible under this chapter to provide services and are not on an active roster. Individuals shall remain on the inactive roster for no more than 180 consecutive days, unless the individual submits a written request to the commissioner requesting to remain on the inactive roster for a longer period of time. Upon the commissioner's receipt of information that may cause an individual on the inactive roster to be disqualified under this chapter, the commissioner shall remove the individual from the inactive roster, and if the individual again seeks a position requiring a background study, the individual shall be required to complete a new background study.\n(d) \"Master roster\" means the list maintained by the commissioner of all individuals who, as a result of a background study under this chapter, and regardless of affiliation with an entity, are determined by the commissioner to be eligible to provide services for one or more entities. The master roster includes all background study subjects on rosters under paragraphs (b) and (c).\n(a) \"Serious maltreatment\" means sexual abuse, maltreatment resulting in death, neglect resulting in serious injury which reasonably requires the care of a physician, advanced practice registered nurse, or physician assistant whether or not the care of a physician, advanced practice registered nurse, or physician assistant was sought, or abuse resulting in serious injury.\n(b) For purposes of this definition, \"care of a physician, advanced practice registered nurse, or physician assistant\" is treatment received or ordered by a physician, physician assistant, or advanced practice registered nurse, but does not include:\n(1) diagnostic testing, assessment, or observation;\n(2) the application of, recommendation to use, or prescription solely for a remedy that is available over the counter without a prescription; or\n(3) a prescription solely for a topical antibiotic to treat burns when there is no follow-up appointment.\n(c) For purposes of this definition, \"abuse resulting in serious injury\" means: bruises, bites, skin laceration, or tissue damage; fractures; dislocations; evidence of internal injuries; head injuries with loss of consciousness; extensive second-degree or third-degree burns and other burns for which complications are present; extensive second-degree or third-degree frostbite and other frostbite for which complications are present; irreversible mobility or avulsion of teeth; injuries to the eyes; ingestion of foreign substances and objects that are harmful; near drowning; and heat exhaustion or sunstroke.\n(d) Serious maltreatment includes neglect when it results in criminal sexual conduct against a child or vulnerable adult.\n\"Subject of a background study\" means an individual on whom a background study is required or completed.\n\"Substance use disorder treatment field\" means a program exclusively serving individuals 18 years of age and older and that is required to be:\n(1) licensed under chapter 245G; or\n(2) registered under section 157.17 as a board and lodge establishment that predominantly serves individuals being treated for or recovering from a substance use disorder.\n\"Title IV-E eligible\" means a children's residential facility or foster residence setting that is designated by the commissioner as eligible to receive Title IV-E payments for a child placed at the children's residential facility or foster residence setting.\n\"Volunteer\" means an individual who:\n(1) provides or seeks to provide services for or through an entity without direct compensation for services provided or resides in the home where services are being provided;\n(2) is required to be affiliated in NETStudy 2.0 with the entity; and\n(3) is subject to oversight by the entity, including but not limited to continuous, direct supervision and immediate removal from providing direct contact services when required.\nThis subdivision does not apply to child care background study subjects under subdivision 6a.",
	"repealed": false
}