{
	"id": "16C.073",
	"url": "https://www.revisor.mn.gov/statutes/cite/16C.073",
	"title": "16C.073 PURCHASE AND USE OF PAPER STOCK; PRINTING.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Copier paper\" means paper purchased for use in copying machines.\n(c) \"Office paper\" means notepads, loose-leaf fillers, tablets, and other paper commonly used in offices.\n(d) \"Postconsumer material\" means a finished material that would normally be discarded as a solid waste, having completed its life cycle as a consumer item.\n(e) \"Practicable\" means capable of being used, consistent with performance, in accordance with applicable specifications, and availability within a reasonable time.\n(f) \"Printing paper\" means paper designed for printing, other than newsprint, such as offset and publication paper.\n(g) \"Public entity\" means the state, an office, agency, or institution of the state, the Metropolitan Council, a metropolitan agency, the Metropolitan Mosquito Control District, the legislature, the courts, a county, a statutory or home rule charter city, a town, a school district, another special taxing district, or any contractor acting pursuant to a contract with a public entity.\n(h) \"Soy-based ink\" means printing ink made from soy oil.\n(i) \"Uncoated\" means not coated with plastic, clay, or other material used to create a glossy finish.\n(a) Whenever practicable, a public entity shall:\n(1) purchase uncoated copy paper, office paper, and printing paper;\n(2) purchase recycled content copy paper with at least 30 percent postconsumer material by weight and purchase printing and office paper with at least ten percent postconsumer material by weight;\n(3) purchase copy, office, and printing paper which has not been dyed with colors, excluding pastel colors;\n(4) purchase recycled content copy, office, and printing paper that is manufactured using little or no chlorine bleach or chlorine derivatives;\n(5) use reusable binding materials or staples and bind documents by methods that do not use glue;\n(6) use soy-based inks;\n(7) purchase printer or duplication cartridges that:\n(i) have ten percent postconsumer material; or\n(ii) are purchased as remanufactured; or\n(iii) are backed by a vendor-offered program that will take back the printer cartridges after their useful life, ensure that the cartridge is recycled, and comply with the definition of recycling in section 115A.03, subdivision 25b;\n(8) produce reports, publications, and periodicals that are readily recyclable; and\n(9) purchase paper which has been made on a paper machine located in Minnesota.\n(b) Paragraph (a), clause (1), does not apply to coated paper that is made with at least 50 percent postconsumer material.\n(c) A public entity shall print documents on both sides of the paper where commonly accepted publishing practices allow.\n(a) Notwithstanding section 365.37, 375.21, 412.311, or 473.705, a public entity may purchase recycled materials when the price of the recycled materials does not exceed the price of nonrecycled materials by more than ten percent. In order to maximize the quantity and quality of recycled materials purchased, a public entity also may use other appropriate procedures to acquire recycled materials at the most economical cost to the public entity.\n(b) When purchasing commodities and services, a public entity shall apply and promote the preferred waste management practices listed in section 115A.02, with special emphasis on reduction of the quantity and toxicity of materials in waste. A public entity, in developing bid specifications, shall consider the extent to which a commodity or product is durable, reusable, or recyclable and marketable through the applicable local or regional recycling program and the extent to which the commodity or product contains postconsumer material. When a project by a public entity involves the replacement of carpeting, the public entity may require all persons who wish to bid on the project to designate a carpet recycling company in their bids.",
	"repealed": false
}