{
	"id": "219.761",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.761",
	"title": "219.761 RESPONSE TO TRAIN-RELATED FIRE OR OTHER EMERGENCY; REIMBURSEMENT.",
	"text": "(a) A railroad operating in Minnesota is liable for all reasonable expenses of a fire or other emergency that is proximately caused by a railroad locomotive, rolling stock or its contents, or employees on a railroad right-of-way, operating property, or other property. If an emergency responder, local government entity, or nonprofit firefighting corporation responds to a fire or responds to another emergency and deems that it is entitled to reimbursement for its expenses, it shall, within 60 days after the first full day after the emergency response, give the railroad written notice stating the circumstances of the fire or other emergency as then known. The notice may be given to the railroad at any address at which the owner has an office, agent, or other place of business in this state. The date of the mailing is the date or service of the notice. For purposes of this paragraph, reasonable response expenses include all expenses incurred by a fire department or other emergency responder in supplying mutual aid assistance, regardless of whether the fire department or emergency responder is entitled to reimbursement from the entity requesting assistance.\n(b) If after notice and claim for reimbursement, the railroad refuses to reimburse the local government, or nonprofit firefighting corporation, or other emergency responders for expenses incurred, the claimant may recover by civil action reasonable expenses, costs, disbursements, and attorney's fees.\nAll claims must set forth the basis of the claim including the time, date, place, and circumstances of the claim. A claim must also include an itemization of costs incurred to extinguish the fire or respond to the emergency. The state Fire Marshal, in consultation with fire department chiefs, representatives of the interested railroads, representatives of local government entities, nonprofit firefighting corporations, and other emergency responders, may recommend that additional information be included in a claim.\n(a) If the railroads are required to pay property taxes pursuant to chapter 272 or any other law, they shall also pay the fees and assessments required of property owners situated within the same political subdivision for firefighting and protection expenses.\n(b) Neither the enactment of this section nor its subsequent repeal or termination alters the statutory or common law rights, duties, or obligations of railroad companies with regard to fires and other emergencies caused directly or indirectly by a railroad locomotive, rolling stock, contents, or railroad employees on a railroad right-of-way, operating property, or other property, or caused directly or indirectly by spill, tear, discharge, or combustion of train contents.",
	"repealed": false
}