{
	"id": "116J.8733",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8733",
	"title": "116J.8733 MINNESOTA EXPANDING OPPORTUNITY FUND PROGRAM.",
	"text": "The Minnesota Expanding Opportunity Fund Program is established to capitalize Minnesota nonprofit corporations, Tribal economic development entities, and community development financial institutions to increase lending activities with Minnesota small businesses.\nThe department may make long-term loans of ten to 12 years at 0.5 percent or lower interest rates to nonprofit corporations, Tribal economic development entities, and community development financial institutions to enable nonprofit corporations, Tribal economic development entities, and community development financial institutions to make more loans to Minnesota small businesses. The department may use the interest received to offset the cost of administering small business lending programs.\n(a) The eligible nonprofit corporation, Tribal economic development entity, or community development financial institution must not meet the definition of recipient under section 116J.993, subdivision 6.\n(b) The commissioner may enter into loan agreements with Minnesota nonprofit corporations, Tribal economic development entities, and community development financial institutions that apply to participate in the Minnesota Expanding Opportunity Fund Program. The commissioner shall evaluate applications from applicant nonprofit corporations, Tribal economic development entities, and community development financial institutions. In evaluating applications, the department must consider, among other things, whether the nonprofit corporation, Tribal economic development entity, or community development financial institution:\n(1) meets the statutory definition of a community development financial institution as defined in section 103 of the Riegle Community Development and Regulatory Improvement Act of 1994, United States Code, title 12, section 4702;\n(2) has a board of directors or loan or credit committee that includes citizens experienced in small business services and community development;\n(3) has the technical skills to analyze small business loan requests;\n(4) is familiar with other available public and private funding sources and economic development programs;\n(5) is enrolled in one or more eligible federally funded state programs; and\n(6) has the administrative capacity to manage a loan portfolio.\n(a) The commissioner shall establish a revolving loan fund to make loans to nonprofit corporations, Tribal economic development entities, and community development financial institutions for the purpose of increasing nonprofit corporation, Tribal economic development entity, and community development financial institution capital and lending activities with Minnesota small businesses.\n(b) Nonprofit corporations, Tribal economic development entities, and community development financial institutions that receive loans from the commissioner under the program must establish appropriate accounting practices for the purpose of tracking eligible loans.\n(a) The fee or interest rate charged by a nonprofit corporation, Tribal economic development entity, or community development financial institution for a loan under this subdivision must not exceed the Wall Street Journal prime rate plus two percent, with a maximum of ten percent. A nonprofit corporation, Tribal economic development entity, or community development financial institution participating in the Minnesota Expanding Opportunity Fund Program may charge a loan closing fee equal to or less than two percent of the loan value.\n(b) The nonprofit corporation, Tribal economic development entity, or community development financial institution may retain all earnings from fees and interest from loans to small businesses.\n(c) The department must provide the nonprofit corporation, Tribal economic development entity, or community development financial institution making the loan with a fee equal to one percent of the loan value for every loan closed to offset related expenses for loan processing, loan servicing, legal filings, and reporting.\nA nonprofit corporation, Tribal economic development entity, or community development financial institution that receives a program loan shall cooperate with other organizations, including but not limited to community development corporations, community action agencies, and the Minnesota small business development centers.\n(a) A nonprofit corporation, Tribal economic development entity, or community development financial institution that receives a program loan must submit an annual report to the commissioner by February 15 of each year that includes:\n(1) the number of businesses to which a loan was made;\n(2) a description of businesses supported by the program;\n(3) demographic information, as specified by the commissioner, regarding each borrower;\n(4) an account of loans made during the calendar year;\n(5) the program's impact on job creation and retention;\n(6) the source and amount of money collected and distributed by the program;\n(7) the program's assets and liabilities; and\n(8) an explanation of administrative expenses.\n(b) A nonprofit corporation, Tribal economic development entity, or community development financial institution that receives a program loan must provide for an independent annual audit to be performed in accordance with generally accepted accounting practices and auditing standards and submit a copy of each annual audit report to the commissioner.",
	"repealed": false
}