{
	"id": "126C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/126C.05",
	"title": "126C.05 DEFINITION OF PUPIL UNITS.",
	"text": "Pupil units for each Minnesota resident pupil under the age of 21 or who meets the requirements of section 120A.20, subdivision 1, paragraph (c), in average daily membership enrolled in the district of residence, in another district under sections 123A.05 to 123A.08, 124D.03, 124D.08, or 124D.68; in a charter school under chapter 124E; or for whom the resident district pays tuition under sections 123A.18, 123A.22, 123A.30, 123A.32, 123A.44, 123A.488, 123B.88, subdivision 4, 124D.04, 124D.05, 125A.03 to 125A.24, 125A.51, or 125A.65, shall be counted according to this subdivision.\n(a) A prekindergarten pupil with a disability who is enrolled in a program approved by the commissioner and has an individualized education program is counted as the ratio of the number of hours of assessment and education service to 825 times 1.0 with a minimum average daily membership of 0.28, but not more than 1.0 pupil unit.\n(b) A prekindergarten pupil who is assessed but determined not to be disabled is counted as the ratio of the number of hours of assessment service to 825 times 1.0.\n(c) A prekindergarten pupil who is not included in paragraph (a) or (b) and is enrolled in an approved voluntary prekindergarten program under section 142D.08 is counted as the ratio of the number of hours of instruction to 850 times 1.0, but not more than 0.6 pupil units.\n(d) A kindergarten pupil is counted as 1.0 pupil unit if the pupil is enrolled in a free all-day, every day kindergarten program available to all kindergarten pupils at the pupil's school that meets the minimum hours requirement in section 120A.41, or is counted as .55 pupil unit, if the pupil is not enrolled in a free all-day, every day kindergarten program available to all kindergarten pupils at the pupil's school.\n(e) A pupil who is in any of grades 1 to 6 is counted as 1.0 pupil unit.\n(f) A pupil who is in any of grades 7 to 12 is counted as 1.2 pupil units.\n(g) A pupil who is in the postsecondary enrollment options program is counted as 1.2 pupil units.\n(h) A prekindergarten pupil who:\n(1) is not included in paragraph (a), (b), or (c);\n(2) is enrolled in a school readiness plus program under section 142D.07; and\n(3) has one or more of the risk factors specified by the eligibility requirements for a school readiness plus program,\nis counted as the ratio of the number of hours of instruction to 850 times 1.0, but not more than 0.6 pupil units. A pupil qualifying under this paragraph must be counted in the same manner as a voluntary prekindergarten student for all general education and other school funding formulas.\nNotwithstanding section 124D.02, subdivision 3, or any other law to the contrary, a foreign exchange pupil enrolled in a district under a cultural exchange program registered with the Office of the Secretary of State under section 5A.02 may be counted as a resident pupil for the purposes of this chapter and chapters 120B, 122A, 123A, 123B, 124D, 124E, 125A, and 127A, even if the pupil has graduated from high school or the equivalent.\nCompensation revenue pupil units must be computed according to this subdivision.\n(a) The compensation revenue concentration percentage for each building in a district equals the product of 100 times the ratio of:\n(1) the sum of the number of pupils enrolled in the building eligible to receive free meals plus one-half of the pupils eligible to receive reduced-priced meals on October 1 of the previous fiscal year; to\n(2) the number of pupils enrolled in the building on October 1 of the previous fiscal year.\n(b) The compensation revenue pupil weighting factor for a building equals the lesser of one or the quotient obtained by dividing the building's compensation revenue concentration percentage by 80.0.\n(c) The compensation revenue pupil units for a building equals the product of:\n(1) the sum of the number of pupils enrolled in the building eligible to receive free meals and one-half of the pupils eligible to receive reduced-priced meals on October 1 of the previous fiscal year; times\n(2) the compensation revenue pupil weighting factor for the building; times\n(3) .60.\n(d) Notwithstanding paragraphs (a) to (c), for voluntary prekindergarten programs under section 142D.08, charter schools, and contracted alternative programs in the first year of operation, compensation revenue pupil units shall be computed using data for the current fiscal year. If the voluntary prekindergarten program, charter school, or contracted alternative program begins operation after October 1, compensatory revenue pupil units shall be computed based on pupils enrolled on an alternate date determined by the commissioner, and the compensation revenue pupil units shall be prorated based on the ratio of the number of days of student instruction to 170 days.\n(e) The percentages in this subdivision must be based on the count of individual pupils and not on a building average or minimum.\n(f) Notwithstanding paragraphs (a) to (e), for revenue in fiscal year 2025 only, the compensation revenue pupil units for each building in a district equals the greater of the building's actual compensation revenue pupil units computed according to paragraphs (a) to (e) for revenue in fiscal year 2025, or the building's actual compensation revenue pupil units computed according to paragraphs (a) to (e) for revenue in fiscal year 2024.\n[See Note.]\n[Repealed, 1999 c 159 s 154; 1999 c 241 art 1 s 69]\nAdjusted pupil units for a district or charter school means the sum of:\n(1) the number of pupil units served, according to subdivision 7, plus\n(2) pupil units according to subdivision 1 for whom the district or charter school pays tuition under section 123A.18, 123A.22, 123A.30, 123A.32, 123A.44, 123A.488, 123B.88, subdivision 4, 124D.04, 124D.05, 125A.03 to 125A.24, 125A.51, or 125A.65, minus\n(3) pupil units according to subdivision 1 for whom the district or charter school receives tuition under section 123A.18, 123A.22, 123A.30, 123A.32, 123A.44, 123A.488, 123B.88, subdivision 4, 124D.04, 124D.05, 125A.03 to 125A.24, 125A.51, or 125A.65.\nResident pupil units for a district means the number of pupil units according to subdivision 1 residing in the district.\nPupil units served for a district or charter school means the number of pupil units according to subdivision 1 enrolled in the district or charter school.\n(a) Membership for pupils in grades kindergarten through 12 and for prekindergarten pupils with disabilities shall mean the number of pupils on the current roll of the school, counted from the date of entry until withdrawal. The date of withdrawal shall mean the day the pupil permanently leaves the school or the date it is officially known that the pupil has left or has been legally excused. However, a pupil, regardless of age, who has been absent from school for 15 consecutive school days during the regular school year or for five consecutive school days during summer school or intersession classes of flexible school year programs without receiving instruction in the home or hospital shall be dropped from the roll and classified as withdrawn. Nothing in this section shall be construed as waiving the compulsory attendance provisions cited in section 120A.22. Average daily membership equals the sum for all pupils of the number of days of the school year each pupil is enrolled in the district's schools divided by the number of days the schools are in session or are providing e-learning days due to inclement weather. Days of summer school or intersession classes of flexible school year programs are only included in the computation of membership for pupils with a disability not appropriately served primarily in the regular classroom. A student must not be counted as more than 1.2 pupils in average daily membership under this section and section 126C.10, subdivision 2a, paragraph (c). When the initial total average daily membership exceeds 1.2 for a pupil enrolled in more than one school district during the fiscal year, each district's average daily membership must be reduced proportionately.\n(b) A student must not be counted as more than one pupil in average daily membership except for purposes of section 126C.10, subdivision 2a.\nNotwithstanding subdivision 8, pupils granted transitional year status shall continue to be counted as members on the current roll of the school for the remainder of the school year. For purposes of computing average daily membership, transitional year pupils must be considered to be enrolled every day school is in session for the remainder of the school year.\nNotwithstanding subdivision 8, pupils enrolled in the Minnesota National Guard program shall be construed to be in attendance, for purposes of computing average daily membership, during any period of the regular school year, but not to include summer school, during which the pupil is attending military active duty training pursuant to that program. During that period of military active duty training, the pupil shall earn all aid for the district of residence or attendance which would be otherwise earned by the pupil's presence.\nNotwithstanding subdivision 8, in cases when school is in session but pupils are prevented from attending for more than 15 consecutive school days during the regular school year or five consecutive school days during summer school or intersession classes of flexible school year programs, because of epidemic, calamity, weather, fuel shortage, or other justifiable cause, the commissioner, upon application, may allow the district to continue to count these pupils in average daily membership. A lawful employees' strike is not a justifiable cause for purposes of this subdivision.\n[Repealed, 1Sp2003 c 9 art 9 s 10]\nThe average daily membership for a pupil participating in the postsecondary enrollment options program equals the lesser of\n(a) 1.00, or\n(b) the greater of\n(1) .12, or\n(2) the ratio of (i) the sum of the number of instructional hours the pupil is enrolled in the secondary school during quarters, trimesters, or semesters during which the pupil participates in PSEO, and hours enrolled in the secondary school during the remainder of the school year, to (ii) the actual number of instructional days in the school year times the length of day in the school.\nIn computing pupil units for a prior year, the number of pupil units shall be adjusted to reflect any change for the current year in relative weightings by grade level or category of special assistance, any change in measurement from average daily attendance to average daily membership, any change in the limit on average daily membership that can be generated by a pupil for a fiscal year as provided in subdivisions 8 and 15, and any change in school district boundaries.\n(a) When a pupil is enrolled in a learning year program under section 124D.128, an area learning center or an alternative learning program approved by the commissioner under sections 123A.05 and 123A.06, or a contract alternative program under section 124D.68, subdivision 3, paragraph (d), or subdivision 4, for more than 1,020 hours in a school year for a secondary student, more than 935 hours in a school year for an elementary student, more than 850 hours in a school year for a kindergarten student in an all-day kindergarten program, or more than 425 hours in a school year for a half-day kindergarten student, that pupil may be counted as more than one pupil in average daily membership for purposes of section 126C.10, subdivision 2a. The amount in excess of one pupil must be determined by the ratio of the number of hours of instruction provided to that pupil in excess of: (i) the greater of 1,020 hours or the number of hours required for a full-time secondary pupil in the district to 1,020 for a secondary pupil; (ii) the greater of 935 hours or the number of hours required for a full-time elementary pupil in the district to 935 for an elementary pupil in grades 1 through 6; and (iii) the greater of 850 hours or the number of hours required for a full-time kindergarten student in the district to 850 for a kindergarten student. Hours that occur after the close of the instructional year in June shall be attributable to the following fiscal year. A student in kindergarten or grades 1 through 12 must not be counted as more than 1.2 pupils in average daily membership under this subdivision.\n(b)(i) To receive general education revenue for a pupil in an area learning center or alternative learning program that has an independent study component, a district must meet the requirements in this paragraph. The district must develop, for the pupil, a continual learning plan consistent with section 124D.128, subdivision 3. Each school district that has an area learning center or alternative learning program must reserve revenue in an amount equal to at least 90 and not more than 100 percent of the district average general education revenue per pupil unit, minus an amount equal to the product of the formula allowance according to section 126C.10, subdivision 2, times .0466, calculated without basic skills revenue, local optional revenue, and transportation sparsity revenue, times the number of pupil units generated by students attending an area learning center or alternative learning program. The amount of reserved revenue available under this subdivision may only be spent for program costs associated with the area learning center or alternative learning program. Basic skills revenue generated according to section 126C.10, subdivision 4, by pupils attending the eligible program must be allocated to the program.\n(ii) General education revenue for a pupil in a state-approved alternative program without an independent study component must be prorated for a pupil participating for less than a full year, or its equivalent. The district must develop a continual learning plan for the pupil, consistent with section 124D.128, subdivision 3. Each school district that has an area learning center or alternative learning program must reserve revenue in an amount equal to at least 90 and not more than 100 percent of the district average general education revenue per pupil unit, minus an amount equal to the product of the formula allowance according to section 126C.10, subdivision 2, times .0466, calculated without basic skills revenue, local optional revenue, and transportation sparsity revenue, times the number of pupil units generated by students attending an area learning center or alternative learning program. The amount of reserved revenue available under this subdivision may only be spent for program costs associated with the area learning center or alternative learning program. Basic skills revenue generated according to section 126C.10, subdivision 4, by pupils attending the eligible program must be allocated to the program.\n(iii) General education revenue for a pupil in a state-approved alternative program that has an independent study component must be paid for each hour of teacher contact time and each hour of independent study time completed toward a credit or graduation standards necessary for graduation. Average daily membership for a pupil shall equal the number of hours of teacher contact time and independent study time divided by 1,020.\n(iv) For a state-approved alternative program having an independent study component, the commissioner shall require a description of the courses in the program, the kinds of independent study involved, the expected learning outcomes of the courses, and the means of measuring student performance against the expected outcomes.\nThe commissioner shall determine the number of children eligible to receive either a free or reduced-price meal on October 1 each year. Children enrolled in a building on October 1 and determined to be eligible to receive free or reduced-price meals by December 15 of that school year shall be counted as eligible on October 1 for purposes of subdivision 3. The commissioner may use federal definitions for these purposes and may adjust these definitions as appropriate. The commissioner may adopt reporting guidelines to assure accuracy of data counts and eligibility. Districts shall use any guidelines adopted by the commissioner.\n[See Note.]\n(a) English learner pupil units for fiscal year 2004 and thereafter shall be determined according to this subdivision.\n(b) The English learner concentration percentage for a district equals the product of 100 times the ratio of:\n(1) the number of eligible English learners in average daily membership enrolled in the district during the current fiscal year; to\n(2) the number of pupils in average daily membership enrolled in the district.\n(c) The English learner pupil units for each eligible English learner in average daily membership equals the lesser of one or the quotient obtained by dividing the English learner concentration percentage for the pupil's district of enrollment by 11.5.\n(d) English learner pupil units shall be counted by the district of enrollment.\n(e) Notwithstanding paragraph (d), for the purposes of this subdivision, pupils enrolled in a cooperative or intermediate school district shall be counted by the district of residence.\n(f) For the purposes of this subdivision, the terms defined in section 124D.59 have the same meaning.\nFor a charter school or contracted alternative program operating during the prior school year but ceasing operations before the end of the current school year, prior year pupil data used in computing revenues for the current school year shall be prorated based on the number of days of student instruction in the current school year to 170.\n(a) The average daily membership for a public school pupil or a pupil enrolled in a school authorized to receive Tribal contract or grant aid under section 124D.83 generating online learning average daily membership according to section 124D.094, subdivision 7, paragraph (b), equals the sum of: (1) the ratio of the sum of the number of instructional hours the pupil is enrolled in a regular classroom setting at the enrolling school to the actual number of instructional hours in the school year at the enrolling school, plus (2) .12 times the initial online learning average daily membership according to section 124D.094, subdivision 7, paragraph (b).\n(b) When the sum of the average daily membership under paragraph (a) and the adjusted online learning average daily membership under section 124D.094, subdivision 7, paragraph (b), exceeds the maximum allowed for the student under subdivision 8 or 15, as applicable, the average daily membership under paragraph (a) shall be reduced by the excess over the maximum, but shall not be reduced below .12. The adjusted online learning average daily membership according to section 124D.094, subdivision 7, paragraph (b), shall be reduced by any remaining excess over the maximum.\n(a) Project-based is an instructional program where students complete coursework for credit at an individual pace that is primarily student-led and may be completed on site, in the community, or online. A project-based program may be made available to all or designated students and grades in a school. To receive general education revenue for a pupil enrolled in a public school with a project-based program, a school must meet the requirements in this paragraph. The school must:\n(1) apply and receive approval from the commissioner as a project-based program at least 90 days prior to starting the program;\n(2) provide a minimum teacher contact of no less than one hour per week per project-based credit for each pupil;\n(3) ensure that the program will not increase the total average daily membership generated by the student and that there will be the expectation that the students will be making typical progression towards high school graduation;\n(4) maintain a record system that shows when each credit or portion thereof was reported for membership for each pupil; and\n(5) report pupil membership consistent with paragraph (b).\n(b) The commissioner must develop a formula for reporting pupil membership to compute average daily membership for each approved project-based program. Average daily membership for a pupil in an approved project-based program is the lesser of:\n(1) 1.0; or\n(2) the ratio of (i) the number of membership hours generated by project-based credits completed during the school year plus membership hours generated by credits completed in a seat-based setting to (ii) the annual required instructional hours at that grade level. Membership hours for a partially completed project-based credit must be prorated. General education revenue for a pupil in a project-based program must be prorated for a pupil participating for less than a full year, or its equivalent.\n(c) For a program that has not been approved by the commissioner for project-based learning but an auditor or other site visit deems that any portion or credits awarded by the school are project-based, student membership must be computed according to paragraph (b).",
	"repealed": false
}