{
	"id": "325E.1151",
	"url": "https://www.revisor.mn.gov/statutes/cite/325E.1151",
	"title": "325E.1151 LEAD ACID BATTERY PURCHASE AND RETURN.",
	"text": "(a) A person who purchases a lead acid battery at retail, except a lead acid battery that is designed to provide power for a boat motor that is purchased at the same time as the battery, must:\n(1) return a lead acid battery to the retailer; or\n(2) pay the retailer a surcharge of at least $10.\n(b) A person who has paid a surcharge under paragraph (a) must receive a refund of the surcharge from the retailer if the person returns a lead acid battery with a receipt for the purchase of a new battery from that retailer within 30 days after purchasing a new lead acid battery.\n(c) A retailer may keep the unrefunded surcharges for lead acid batteries not returned within 30 days.\n(a) A person who sells lead acid batteries at retail must accept lead acid batteries from consumers and may not charge to receive the lead acid batteries. A consumer may not deliver more than five lead acid batteries to a retailer at one time.\n(b) A retailer of lead acid batteries must recycle the lead acid batteries received from consumers.\n(c) A retailer who violates paragraph (b) is guilty of a misdemeanor. Each lead acid battery that is not recycled is a separate violation.\n(a) A person who sells lead acid batteries at retail must post the notice in paragraph (b) in a manner clearly visible to a consumer making purchasing decisions.\n(b) The notice must be at least 8-1/2 inches by 11 inches and contain the universal recycling symbol and state:\n\"NOTICE: USED BATTERIES\nThis retailer is required to accept your used lead acid batteries, EVEN IF YOU DO NOT PURCHASE A BATTERY. When you purchase a new battery, you will be charged an additional amount of at least $10 unless you return a used battery within 30 days.\nIt is a crime to put a motor vehicle battery in the garbage.\"\n(a) An advertisement for sale of new lead acid batteries at retail in newspapers published in this state must contain the notice in paragraph (b).\n(b) The notice must state:\n\"At least $10 additional charge unless a used lead acid battery is returned. Improper disposal of a lead acid battery is a crime.\"",
	"repealed": false
}