{
	"id": "289A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/289A.19",
	"title": "289A.19 EXTENSIONS FOR FILING RETURNS.",
	"text": "When, in the commissioner's judgment, good cause exists, the commissioner may extend the time for filing entertainment tax returns for not more than six months. The commissioner shall grant an automatic extension of six months to file a partnership, \"S\" corporation, or fiduciary income tax return if all of the taxes imposed on the entity for the year by chapter 290 and section 289A.08, subdivision 7, have been paid by the date prescribed by section 289A.18, subdivision 1.\nCorporations or mining companies shall receive an extension of seven months or the amount of time granted by the Internal Revenue Service, whichever is longer, for filing the return of a corporation subject to tax under chapter 290 or for filing the return of a mining company subject to tax under sections 298.01 and 298.015. Interest on any balance of tax not paid when the regularly required return is due must be paid at the rate specified in section 270C.40, from the date such payment should have been made if no extension was granted, until the date of payment of such tax.\nIf a corporation or mining company does not:\n(1) pay at least 90 percent of the amount of tax shown on the return on or before the regular due date of the return, the penalty prescribed by section 289A.60, subdivision 1, shall be imposed on the unpaid balance of tax; or\n(2) pay the balance due shown on the regularly required return on or before the extended due date of the return, the penalty prescribed by section 289A.60, subdivision 1, shall be imposed on the unpaid balance of tax from the original due date of the return.\nThe commissioner shall grant an automatic extension of 60 days to file a withholding tax return with the commissioner provided all the withholding taxes have been paid by the date prescribed by section 289A.20, subdivision 2. In any case where good cause exists, the commissioner may grant an extension of time of not more than 60 days for filing a withholding return.\nThe time for filing an estate tax return shall be extended for either six months or the amount of time granted under section 6081 of the Internal Revenue Code to file the federal estate tax return, whichever is longer.\nWhere good cause exists, the commissioner may extend the time for filing sales and use tax returns for not more than 60 days.\n[Repealed, 1991 c 291 art 6 s 47]\nWhen an extension of time to file a partnership, fiduciary income tax, or S corporation tax return is granted by the Internal Revenue Service, the commissioner shall grant an automatic extension to file the comparable Minnesota return for that period. An extension granted under this subdivision does not affect the due date for making payments of tax.",
	"repealed": false
}