{
	"id": "62E.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/62E.04",
	"title": "62E.04 DUTIES OF INSURERS.",
	"text": "For each type of qualified plan described in section 62E.06, an insurer or fraternal issuing individual policies of accident and health insurance in this state, other than group conversion policies, shall develop and file with the commissioner an individual policy which meets the minimum standards of that type of qualified plan. An insurer or fraternal issuing individual policies of accident and health insurance in this state shall offer each type of qualified plan to each person who applies and is eligible for accident and health insurance from that insurer or fraternal.\nAn insurer or fraternal issuing Medicare supplement plans in this state shall develop and file with the commissioner a Medicare supplement policy which meets the minimum standards of a qualified Medicare supplement plan. An insurer or fraternal issuing Medicare supplement plans in this state shall offer a qualified medicare supplement plan to each person who is eligible for coverage and who applies for a Medicare supplement plan.\nFor each type of qualified plan described in section 62E.06, an insurer or fraternal issuing group policies of accident and health insurance in this state shall develop and file with the commissioner a group policy which provides for each member of the group the minimum benefits required by that type of qualified plan. An insurer or fraternal issuing group policies of accident and health insurance in this state shall offer each type of qualified plan to each eligible applicant for group accident and health insurance.\nEach insurer and fraternal shall affirmatively offer coverage of major medical expenses to every applicant who applies to the insurer or fraternal for a new unqualified policy, which has a lifetime benefit limit of less than $1,000,000, at the time of application and annually to every holder of such an unqualified policy of accident and health insurance renewed by the insurer or fraternal. The coverage shall provide that when a covered individual incurs out-of-pocket expenses of $5,000 or more within a calendar year for services covered in section 62E.06, subdivision 1, benefits shall be payable, subject to any co-payment authorized by the commissioner, and shall not contain a lifetime maximum on essential health benefits. The offer of coverage of major medical expenses may consist of the offer of a rider on an existing unqualified policy or a new policy which is a qualified plan.\nNo policy of accident and health insurance may be issued or renewed in this state 180 days after July 1, 1976 by an insurer or a fraternal which has not complied with the requirements of this section.\nAn insurer or fraternal may fulfill its obligations under this section by issuing the required coverages in their own name and reinsuring the risk and administration of the coverages with the association in accordance with section 62E.10, subdivision 7, clauses (e) and (f).\nNothing in this section shall require an insurer or fraternal to offer or issue a policy to any person who does not meet the underwriting or membership requirements of the insurer or fraternal.\nNo policy of accident and health insurance shall contain any provision denying or reducing benefits because services are rendered to an insured or dependent who is eligible for or receiving benefits pursuant to chapters 256B and 256D, or sections 252.27; 260B.331, subdivision 2; 260C.331, subdivision 2; 393.07, subdivision 1 or 2.\n[Repealed, 1995 c 207 art 10 s 25]\n[Repealed, 1995 c 207 art 10 s 25]\nFor any policy of accident and health insurance subject to the requirements of the Affordable Care Act, as defined under section 62A.011, subdivision 1a, that is offered, sold, issued, or renewed on or after January 1, 2018, the requirements of this section do not apply.",
	"repealed": false
}