{
	"id": "216I.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/216I.18",
	"title": "216I.18 APPLICATION TO LOCAL REGULATION AND OTHER STATE PERMITS.",
	"text": "To assure the paramount and controlling effect of the provisions herein over other state agencies, regional, county, and local governments, and special purpose government districts, the issuance of a site permit or route permit and subsequent purchase and use of the site or route locations for large energy infrastructure facility purposes is the sole site or route approval required to be obtained by the permittee. The permit supersedes and preempts all zoning, building, or land use rules, regulations, or ordinances promulgated by regional, county, local and special purpose government.\nNotwithstanding anything herein to the contrary, a permittee must obtain state permits that may be required to construct and operate large energy infrastructure facilities. A state agency in processing a permittee's facility permit application is bound to the decisions of the commission with respect to (1) the site or route designation, and (2) other matters for which authority has been granted to the commission by this chapter.\n(a) A state agency authorized to issue permits required to construct or operate a large energy infrastructure facility must participate during routing and siting at public hearings and all other activities of the commission on specific site or route designations and design considerations of the commission, and must clearly state whether the site or route being considered for designation or permit and other design matters under consideration for approval complies with state agency standards, rules, or policies.\n(b) An applicant for a permit under this section or under chapter 216G must notify the commissioner of agriculture if the proposed project impacts cultivated agricultural land. The commissioner may participate and advise the commission as to whether to grant a permit for the project and the best options for mitigating adverse impacts to agricultural lands if the permit is granted. The Department of Agriculture is the lead agency on the development of any agricultural mitigation plan required for the project.\n(c) The Minnesota State Historic Preservation Office must participate in the commission's siting and routing activities described in this section. The commission's consideration and resolution of Minnesota State Historic Preservation Office's comments satisfies the requirements of section 138.665, when applicable.",
	"repealed": false
}