{
	"id": "197.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.60",
	"title": "197.60 COUNTY VETERANS SERVICE OFFICERS; APPOINTMENT; COMPENSATION.",
	"text": "The county board of any county, or the county boards of any two or more counties acting pursuant to section 197.602, shall appoint a county veterans service officer and may appoint one or more assistant county veterans service officers who are qualified under section 197.601. The county board or boards shall provide necessary clerical help, office space, equipment, and supplies for the officer, and reimbursement for mileage and other traveling expenses necessarily incurred in the performance of duties. Subject to the direction and control of the county veterans service officer, the assistant county veterans service officer may exercise all the powers, and shall perform the duties, of the county veterans service officer, and is subject to all the provisions of sections 197.60 to 197.606 relating to a county veterans service officer. Every county officer and agency shall cooperate with the county veterans service officer and shall provide the officer with information necessary in connection with the performance of duties.\nExcept as otherwise prescribed in sections 197.60 to 197.606, the term of appointment of a county veterans service officer appointed pursuant to this section shall be for four years with the first 12 months of the initial appointment being a probationary period, unless removed for cause upon written charges and after a hearing thereon. If the board of county commissioners does not intend to reappoint a county veterans service officer who has been certified by the Department of Veteran Affairs, the board shall present written notice to the county veterans service officer, not later than 90 days before the termination of the county veterans service officer's term, that it does not intend to reappoint the county veterans service officer. If written notice is not timely made, the county veterans service officer must automatically be reappointed by the board of county commissioners.\nExcept as otherwise prescribed in sections 197.60 to 197.606, the county board shall fix the compensation of the county veterans service officer and assistant county veterans service officers which shall be paid in the same manner and at the same time as the county officers. The county board may fix the compensation of the county veterans service officer at a level commensurate with other county officials with the same level of responsibility.\nIn each county employing a county veterans service officer, the county board may levy a tax annually sufficient to defray the estimated cost of all salaries and expenses necessarily incident to the performance by the county veterans service officer of duties during the succeeding year, and to make up any deficiency in the fund raised for that purpose during the preceding year. The tax so levied may be levied in excess of and over and above all taxing limitations, including, but not restricted to, limitations based upon population or local tax rates.\nEvery county veterans service officer, before entering upon duties, shall take and subscribe the oath required of public officials.",
	"repealed": false
}