{
	"id": "31.94",
	"url": "https://www.revisor.mn.gov/statutes/cite/31.94",
	"title": "31.94 ORGANIC AGRICULTURE; COMMISSIONER DUTIES.",
	"text": "(a) In order to promote opportunities for organic agriculture in Minnesota, the commissioner shall:\n(1) survey producers and support services and organizations to determine information and research needs in the area of organic agriculture practices;\n(2) work with the University of Minnesota and other research and education institutions to demonstrate the on-farm applicability of organic agriculture practices to conditions in this state;\n(3) direct the programs of the department so as to work toward the promotion of organic agriculture in this state;\n(4) inform agencies about state or federal programs that support organic agriculture practices; and\n(5) work closely with producers, producer organizations, the University of Minnesota, and other appropriate agencies and organizations to identify opportunities and needs as well as ensure coordination and avoid duplication of state agency efforts regarding research, teaching, marketing, and extension work relating to organic agriculture.\n(b) By November 15 of each year that ends in a zero or a five, the commissioner, in conjunction with the task force created in paragraph (c), shall report on the status of organic agriculture in Minnesota to the legislative policy and finance committees and divisions with jurisdiction over agriculture. The report must include available data on organic acreage and production, available data on the sales or market performance of organic products, and recommendations regarding programs, policies, and research efforts that will benefit Minnesota's organic agriculture sector.\n(c) A Minnesota Organic Advisory Task Force shall advise the commissioner and the University of Minnesota on policies and programs that will improve organic agriculture in Minnesota, including how available resources can most effectively be used for outreach, education, research, and technical assistance that meet the needs of the organic agriculture sector. The task force must consist of the following residents of the state:\n(1) three organic farmers;\n(2) one wholesaler or distributor of organic products;\n(3) one representative of organic certification agencies;\n(4) two organic processors;\n(5) one representative from University of Minnesota Extension;\n(6) one University of Minnesota faculty member;\n(7) one representative from a nonprofit organization representing producers;\n(8) two public members;\n(9) one representative from the United States Department of Agriculture;\n(10) one retailer of organic products; and\n(11) one organic consumer representative.\nThe commissioner, in consultation with the director of the Minnesota Agricultural Experiment Station; the dean and director of University of Minnesota Extension and the dean of the College of Food, Agricultural and Natural Resource Sciences, shall appoint members to serve three-year terms.\nCompensation and removal of members are governed by section 15.059, subdivision 6. The task force must meet at least twice each year and expires on June 30, 2034.\n(d) For the purposes of expanding, improving, and developing production and marketing of the organic products of Minnesota agriculture, the commissioner may receive funds from state and federal sources and spend them, including through grants or contracts, to assist producers and processors to achieve certification, to conduct education or marketing activities, to enter into research and development partnerships, or to address production or marketing obstacles to the growth and well-being of the industry.\n(e) The commissioner may facilitate the registration of state organic production and handling operations including those exempt from organic certification according to Code of Federal Regulations, title 7, section 205.101, and accredited certification agencies operating within the state.",
	"repealed": false
}