{
	"id": "65B.28",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.28",
	"title": "65B.28 ACCIDENT PREVENTION COURSE PREMIUM REDUCTIONS.",
	"text": "An insurer must provide an appropriate premium reduction of at least ten percent on its policies of private passenger vehicle insurance, as defined in section 65B.001, subdivision 2, issued, delivered, or renewed in this state, to insureds 55 years old and older who successfully complete an accident prevention course or refresher course established under subdivisions 2 and 3.\n(a) The commissioner of public safety must adopt rules establishing and regulating a motor vehicle accident prevention course for persons 55 years old and older.\n(b) The rules must, at a minimum, include provisions:\n(1) establishing curriculum requirements; and\n(2) providing for the issuance of a course completion certification and requiring its submission to an insured as evidence of completion of the course.\n(c) The accident prevention course must be a total of four hours.\nThe Department of Public Safety, in consultation with other traffic safety and medical professionals, may establish a refresher course for persons who have completed the original course under subdivision 2. The refresher course shall be no more than four hours, and based on the curriculum established under subdivision 2. The Department of Public Safety shall establish criteria for and approve training agencies or organizations authorized to conduct the refresher course.\nA person 55 years old and older may retake the original course or take the refresher course every three years and receive a course completion certificate to remain eligible for the premium reduction in subdivision 1. A person 58 years old and older who successfully completes a retaking of the original course or a refresher course more than three years from the date the person last was eligible for the premium reduction in subdivision 1 is entitled to reinstatement of this eligibility. The Department of Public Safety shall provide criteria for the issuance of the course completion certificates.",
	"repealed": false
}