{
	"id": "508A.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/508A.22",
	"title": "508A.22 EXAMINER'S DIRECTIVE; FEES.",
	"text": "The examiner of titles, upon being satisfied that the applicant is entitled to a CPT, but not earlier than 20 days from the date of mailing of the notice required by section 508A.13, shall issue a written directive to the registrar of titles directing that the first CPT be issued and entered in the name of the applicant, subject only to the following: (a) the exceptions set out in section 508A.25; (b) separate memorials showing all outstanding rights, titles, estates, liens, and interests set forth in the examiner's report and any additional liens, encumbrances, or other interests affecting the land, arising after the filing of the application; and (c) a memorial of the examiner's directive which must state that the land described in the directive is subject to the rights of persons in possession, if any, and any rights which would be disclosed by a survey except as those rights are limited by section 508A.02, subdivision 1. The examiner's directive shall contain an accurate description of the land and shall set forth the address of the applicant and, if the applicant is an individual, whether the applicant is 18 years of age or older, and whether married or unmarried, and if married, the name of the spouse; if the applicant is under any legal incapacity, the nature of it shall be stated. The examiner's directive shall also be recorded with the county recorder and indexed in the tract index to show that the CPT application was granted and the land is converted to registered property. The examiner's directive is recordable without an acknowledgment. The examiner shall deliver the abstract of title to the registrar of titles who shall retain it, but it must not be entered as a memorial on the CPT. From the date of filing the examiner's directive with the registrar of titles, all instruments affecting title to the land which are registered shall be filed in the office of the registrar of titles and be memorialized upon the CPT.\nMS 2000 [Repealed, 2001 c 50 s 37]\nUpon the filing with the registrar of titles of the examiner's directive pursuant to subdivision 1, there shall be paid by the applicant to the registrar the fee provided by section 508A.82, subdivision 1, clause (2), for registering a first CPT, and there shall be paid to the county recorder the fee provided by section 357.18 for recording an instrument.",
	"repealed": false
}