{
	"id": "256B.0753",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0753",
	"title": "256B.0753 PAYMENT RESTRUCTURING; CARE COORDINATION PAYMENTS.",
	"text": "The commissioner of human services, in coordination with the commissioner of health, shall develop a payment system that provides per-person care coordination payments to health care homes certified under section 62U.03 for providing care coordination services and directly managing on-site or employing care coordinators. The care coordination payments under this section are in addition to the quality incentive payments in section 256B.0754, subdivision 1. The care coordination payment system must vary the fees paid by thresholds of care complexity, with the highest fees being paid for care provided to individuals requiring the most intensive care coordination. In developing the criteria for care coordination payments, the commissioner shall consider the feasibility of including the additional time and resources needed by patients with limited English-language skills, cultural differences, or other barriers to health care. The commissioner may determine a schedule for phasing in care coordination fees such that the fees will be applied first to individuals who have, or are at risk of developing, complex or chronic health conditions.\nThe commissioner of human services shall implement care coordination payments as specified under this section by July 1, 2010, or upon federal approval, whichever is later. For enrollees served under the fee-for-service system, the care coordination payment shall be determined by the commissioner in contracts with certified health care homes. For enrollees served by managed care or county-based purchasing plans, the commissioner's contracts with these plans shall require the payment of care coordination fees to certified health care homes.\nIf initial savings from implementation of health care homes are not sufficient to allow implementation of the care coordination fee in a cost-neutral manner, the commissioner may make recommendations to the legislature on reallocating costs within the health care system.",
	"repealed": false
}