{
	"id": "3.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.30",
	"title": "3.30 LEGISLATIVE ADVISORY COMMISSION.",
	"text": "A general contingent appropriation for each year of the biennium is authorized in the amount the legislature deems sufficient. Additional special contingent appropriations as the legislature deems necessary are authorized. Transfers from the appropriations to the appropriations of the various departments and agencies may be made by the commissioner of management and budget subject to the following provisions:\n(a) Transfers may be authorized by the commissioner of management and budget not exceeding $5,000 for the same purpose for any quarterly period.\n(b) Transfers exceeding $5,000 but not exceeding $10,000 may be authorized by the commissioner of management and budget with the approval of the governor.\n(c) Transfers exceeding $10,000 may be authorized by the governor but no transfer exceeding $10,000 may be made until the governor has consulted the Legislative Advisory Commission and it has made its recommendation on the transfer. Its recommendation is advisory only. Failure or refusal of the commission to make a recommendation is a negative recommendation.\nThe commissioner of management and budget shall return to the appropriate contingent account any funds transferred under this subdivision that the commissioner determines are not needed.\n(a) The majority leader of the senate or a designee, the chair of the senate Committee on Finance, and the chair of the senate Division of Finance responsible for overseeing the items being considered by the commission, the speaker of the house or a designee, the chair of the house of representatives Committee on Ways and Means, and the chair of the appropriate finance committee, or division of the house of representatives committee responsible for overseeing the items being considered by the commissioner, constitute the Legislative Advisory Commission. The division chair of the Finance Committee in the senate and the division chair of the appropriate finance committee or division in the house of representatives shall rotate according to the items being considered by the commission. If any of the members elect not to serve on the commission, the house of which they are members, if in session, shall select some other member for the vacancy. If the legislature is not in session, vacancies in the house of representatives membership of the commission shall be filled by the last speaker of the house or, if the speaker is not available, by the last chair of the house of representatives Rules Committee, and by the last senate Committee on Committees or other appointing authority designated by the senate rules in case of a senate vacancy. The commissioner of management and budget shall be secretary of the commission and keep a permanent record and minutes of its proceedings, which are public records. The commissioner of management and budget shall post to the agency website all actions of the commission. Members shall receive traveling and subsistence expenses incurred attending meetings of the commission. The commission shall meet from time to time upon the call of the governor or upon the call of the secretary at the request of two or more of its members. A recommendation of the commission must be made at a meeting of the commission unless a written recommendation is signed by all the members entitled to vote on the item.\n(b) The chair alternates between a member of the senate and a member of the house of representatives in January of each odd-numbered year.\n[Repealed, 1976 c 231 s 34]\nThis section does not prevent the appropriation of separate contingent funds to the governor and the attorney general or limit their use as authorized by other law.\n[Repealed by amendment, 1988 c 469 art 1 s 1]",
	"repealed": false
}