{
	"id": "151.38",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.38",
	"title": "151.38 EMBARGOES.",
	"text": "(1) Whenever a duly authorized agent of the board finds or has probable cause to believe that any drug or medicine is adulterated, or so misbranded as to be dangerous or fraudulent, or is being sold, delivered, or offered for sale in violation of section 151.361, the agent shall affix thereto an appropriate marking, giving notice that the article is, or is suspected of being, adulterated, misbranded or sold, delivered, or offered for sale in violation of section 151.361 and has been embargoed, and warning that it is unlawful for any person to remove or dispose of the embargoed article by sale or otherwise without permission from the agent or the court.\n(2) When an embargoed article has been found by the agent to be adulterated or misbranded, or is being sold, delivered, or offered for sale in violation of section 151.361, the board shall, within 30 days, petition the district court in whose jurisdiction the article is embargoed for an order of condemnation. When an embargoed article is not so found by the agent, the agent shall remove the marking.\n(3) If the court finds that an embargoed article is adulterated or misbranded, or is being sold, delivered, or offered for sale in violation of section 151.361, the article shall be destroyed at the expense of the claimant thereof, who shall also pay all court costs and fees, storage and other proper expenses. If the adulteration or misbranding, or lack of manufacturer disclosure as required by section 151.361 can be corrected by proper labeling or processing of the article, or by filing the proper documents with the court, the court, after the costs, fees, and expenses have been paid and a sufficient bond has been executed, may order that the article be delivered to the claimant for labeling, processing or filing under supervision of an agent of the board. The expense of the supervision shall be paid by claimant. The bond shall be returned to the claimant on the representation to the court by the board that the article is no longer in violation of this chapter and that the expenses of supervision have been paid.",
	"repealed": false
}