{
	"id": "145.9266",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.9266",
	"title": "145.9266 FETAL ALCOHOL SYNDROME CAMPAIGN AND EDUCATION.",
	"text": "The commissioner of health shall design and implement an ongoing statewide campaign to raise public awareness and educate the public about fetal alcohol syndrome and other effects of prenatal alcohol exposure. The campaign shall include messages directed to the general population as well as culturally specific and community-based messages. A toll-free resource and referral telephone line shall be included in the messages. The commissioner of health shall conduct an evaluation to determine the effectiveness of the campaign.\nA statewide network of regional fetal alcohol syndrome diagnostic clinics shall be developed between the Department of Health and the University of Minnesota. This collaboration shall be based on a statewide needs assessment and shall include involvement from consumers, providers, and payors. By the end of calendar year 1998, a plan shall be developed for the clinic network, and shall include a comprehensive evaluation component. Sites shall be established in calendar year 1999. The commissioner shall not access or collect individually identifiable data for the statewide network of regional fetal alcohol syndrome diagnostic clinics. Data collected at the clinics shall be maintained according to applicable data privacy laws, including sections 144.291 to 144.298.\n(a) The commissioner of health, in collaboration with the Board of Medical Practice, the Board of Nursing, and other professional boards and state agencies, shall develop materials about fetal alcohol syndrome for professional training of health care providers, social service providers, educators, and judicial and corrections systems professionals. The training shall increase knowledge and develop practical skills of professionals to help them address the needs of at-risk pregnant women and the needs of individuals affected by fetal alcohol syndrome or fetal alcohol effects and their families.\n(b) Training for health care providers shall focus on skill building for screening, counseling, referral, and follow-up for women using or at risk of using alcohol while pregnant. Training for health care professionals shall include methods for diagnosis and evaluation of fetal alcohol syndrome and fetal alcohol effects. Training for education, judicial, and corrections professionals shall involve effective education strategies, methods to identify the behaviors and learning styles of children with alcohol-related birth defects, and methods to identify available referral and community resources.\n(c) Training and education for social service providers shall focus on resources for assessing, referring, and treating at-risk pregnant women, changes in the mandatory reporting and commitment laws, and resources for affected children and their families.\nThe commissioner of health shall administer a grant education program to provide money to community organizations and coalitions to collaborate on fetal alcohol syndrome prevention and intervention strategies and activities. The commissioner shall disburse grant money through a request for proposal process or sole-source distribution where appropriate, and shall include at least one grant award for transitional skills and services for individuals with fetal alcohol syndrome or fetal alcohol effects.\n(a) The commissioner of education shall award up to four grants to schools for pilot programs to identify and implement effective educational strategies for individuals with fetal alcohol syndrome and other alcohol-related birth defects.\n(b) One grant shall be awarded in each of the following age categories:\n(1) birth to three years;\n(2) three to five years;\n(3) six to 12 years; and\n(4) 13 to 18 years.\n(c) Grant proposals must include an evaluation plan, demonstrate evidence of a collaborative or multisystem approach, provide parent education and support, and show evidence of a child- and family-focused approach consistent with research-based best educational practices and other guidelines developed by the Department of Education.\n(d) Children participating in the pilot program sites may be identified through child find activities or a diagnostic clinic. No identification activity may be undertaken without the consent of a child's parent or guardian.\n[Repealed, 2007 c 133 art 2 s 13]\n[Repealed, 2007 c 133 art 2 s 13]",
	"repealed": false
}