{
	"id": "609.762",
	"url": "https://www.revisor.mn.gov/statutes/cite/609.762",
	"title": "609.762 FORFEITURE OF GAMBLING DEVICES, PRIZES AND PROCEEDS.",
	"text": "The following are subject to forfeiture:\n(1) devices used or intended for use, including those defined in section 349.30, subdivision 2, as a gambling device, except as authorized in sections 299L.07 and 349.11 to 349.23;\n(2) all moneys, materials, and other property used or intended for use as payment to participate in gambling or a prize or receipt for gambling;\n(3) books, records, and research products and materials, including formulas, microfilm, tapes, and data used or intended for use in gambling; and\n(4) property used or intended to be used to illegally influence the outcome of a horse race.\nProperty subject to forfeiture under subdivision 1 may be seized by any law enforcement agency upon process issued by any court having jurisdiction over the property. Seizure without process may be made if:\n(1) the seizure is incident to an arrest or a search under a search warrant;\n(2) the property subject to seizure has been the subject of a prior judgment in favor of the state in a criminal injunction or forfeiture proceeding; or\n(3) the law enforcement agency has probable cause to believe that the property was used or is intended to be used in a gambling violation and the delay occasioned by the necessity to obtain process would result in the removal, loss, or destruction of the property.\nProperty taken or detained under subdivision 2 is not subject to a replevin action, but is considered to be in the custody of the law enforcement agency subject only to the orders and decrees of the court having jurisdiction over the forfeiture proceedings.\nProperty must be forfeited after a conviction for a gambling violation according to the following procedure:\n(1) a separate complaint must be filed against the property describing it, charging its use in the specified violation, and specifying the time and place of its unlawful use;\n(2) if the person charged with a gambling offense is acquitted, the court shall dismiss the complaint and order the property returned to the persons legally entitled to it; and\n(3) if after conviction the court finds the property, or any part of it, was used in violation as specified in the complaint, it shall order that the property be sold or retained by the law enforcement agency for official use. Proceeds from the sale of forfeited property may be retained for official use and shared equally between the law enforcement agency investigating the offense involved in the forfeiture and the prosecuting agency that prosecuted the offense involved in the forfeiture and handled the forfeiture proceedings.\nProperty may not be seized or forfeited under this section if the owner shows to the satisfaction of the court that the owner had no notice or knowledge or reason to believe that the property was used or intended to be used in violation of this section.\nThe law enforcement and prosecuting agencies shall report on forfeitures occurring under this section as described in section 609.5315, subdivision 6.",
	"repealed": false
}