{
	"id": "629.34",
	"url": "https://www.revisor.mn.gov/statutes/cite/629.34",
	"title": "629.34 WHEN ARREST MAY BE MADE WITHOUT WARRANT.",
	"text": "(a) A peace officer, as defined in section 626.84, subdivision 1, paragraph (c), who is on or off duty within the jurisdiction of the appointing authority, or on duty outside the jurisdiction of the appointing authority pursuant to section 629.40, may arrest a person without a warrant as provided under paragraph (c).\n(b) A part-time peace officer, as defined in section 626.84, subdivision 1, clause (d), who is on duty within the jurisdiction of the appointing authority, or on duty outside the jurisdiction of the appointing authority pursuant to section 629.40 may arrest a person without a warrant as provided under paragraph (c).\n(c) A peace officer or part-time peace officer who is authorized under paragraph (a) or (b) to make an arrest without a warrant may do so under the following circumstances:\n(1) when a public offense has been committed or attempted in the officer's presence;\n(2) when the person arrested has committed a felony, although not in the officer's presence;\n(3) when a felony has in fact been committed, and the officer has reasonable cause for believing the person arrested to have committed it;\n(4) upon a charge based upon reasonable cause of the commission of a felony by the person arrested;\n(5) under the circumstances described in clause (2), (3), or (4), when the offense is a gross misdemeanor violation of section 609.52, 609.595, 609.631, 609.749, or 609.821;\n(6) under circumstances described in clause (2), (3), or (4), when the offense is a nonfelony violation of section 518B.01, subdivision 14; 609.748, subdivision 6; or 629.75, subdivision 2, or a nonfelony violation of any other restraining order or no contact order previously issued by a court;\n(7) under the circumstances described in clause (2), (3), or (4), when the offense is a gross misdemeanor violation of section 609.485 and the person arrested is a juvenile committed to the custody of the commissioner of corrections; or\n(8) if the peace officer has probable cause to believe that within the preceding 72 hours, exclusive of the day probable cause was established, the person has committed nonfelony domestic abuse, as defined in section 518B.01, subdivision 2, even though the assault did not take place in the presence of the peace officer.\n(d) To make an arrest authorized under this subdivision, the officer may break open an outer or inner door or window of a dwelling house if, after notice of office and purpose, the officer is refused admittance.\nAn officer in the United States Customs and Border Protection or the United States Citizenship and Immigration Services may arrest a person without a warrant under the circumstances specified in clauses (1) and (2):\n(1) when the officer is on duty within the scope of assignment and one or more of the following situations exist:\n(i) the person commits an assault in the fifth degree, as defined in section 609.224, against the officer;\n(ii) the person commits an assault in the fifth degree, as defined in section 609.224, on any other person in the presence of the officer, or commits any felony;\n(iii) the officer has reasonable cause to believe that a felony has been committed and reasonable cause to believe that the person committed it; or\n(iv) the officer has received positive information by written, teletypic, telephonic, radio, or other authoritative source that a peace officer holds a warrant for the person's arrest; or\n(2) when the assistance of the officer has been requested by another Minnesota law enforcement agency.",
	"repealed": false
}