{
	"id": "18G.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/18G.06",
	"title": "18G.06 ESTABLISHMENT OF QUARANTINE RESTRICTIONS.",
	"text": "The commissioner may impose a quarantine restricting or regulating the production, movement, or existence of plants, plant products, agricultural commodities, crop seed, farm products, or other articles or materials in order that the introduction or spread of a plant pest may be prevented or limited or an existing plant pest may be controlled or eradicated.\n(a) The commissioner may issue orders to take prompt regulatory action in plant pest emergencies on regulated articles. If continuing quarantine action is required, a formal quarantine may be imposed. Orders may be issued to retain necessary quarantine action on a few properties if eradication treatments have been applied and continuing quarantine action is no longer necessary for the majority of the regulated area.\n(b) The commissioner may place an emergency regulation or quarantine in effect without prior public notice in order to take immediate regulatory action to prevent the introduction or establishment of a plant pest.\n(c) The commissioner may enter into cooperative agreements with the United States Department of Agriculture and other federal, state, city, or county agencies to assist in the enforcement of federal quarantines. The commissioner may adopt a quarantine or regulation against a plant pest or an area not covered by a federal quarantine. The commissioner may seize, destroy, or require treatment of products moved from a federally regulated area if they were not moved in accordance with the federal quarantine regulations or, if certified, they were found to be infested with the pest organism.\n(d) The commissioner may impose a quarantine against a plant pest that is not quarantined in other states to prevent the spread of the plant pest within this state. The commissioner may enact a quarantine against a plant pest of regional or national significance even when no federal domestic quarantine has been adopted. These quarantines regulate intrastate movement between quarantined and nonquarantined areas of this state. The commissioner may enact a parallel state quarantine if there is a federal quarantine applied to a portion of the state.\n(e) The commissioner may impose a state exterior quarantine if the plant pest is not established in this state but is established in other states. State exterior quarantines may be enacted even if no federal domestic quarantine has been adopted. The commissioner may issue control orders at destinations necessary to prevent the introduction or spread of plant pests.\n(a) The regulated area to be described in a quarantine may involve the entire state, portions of the state, or certain names and locations of infested properties.\n(b) Regulated quarantine areas may be subdivided into suppression areas and generally infested areas if it is desirable to control movement into suppression areas from generally infested areas.\n(c) Quarantine provisions or areas regulated may be amended by the commissioner through publication of a notice to that effect in local newspapers or through direct written notice to affected property owners.\n(d) If an infestation in a specific regulated area has been eliminated to the extent that movement of the regulated articles no longer present a pest risk, the quarantine in that area may be removed. The commissioner may also exempt areas from specified requirements until eradication has been achieved.\n(a) A regulated article may be refused entry into this state if it is prohibited or is required to be certified and comes from an area regulated by a state or federal quarantine. The owner or carrier of regulated articles that are reportedly originating in nonregulated areas of a quarantined state must provide proof of origin of the regulated articles. An invoice, waybill, or other shipping document satisfactory to the receiving state regulatory official is acceptable as proof of origin.\n(b) Certificates or permits are required for the movement of regulated articles from a regulated area to any point outside the regulated area. Certificates or permits are not required for a regulated article originating outside of a regulated area moving to another nonregulated area or moving through or reshipped from a regulated area when the point of origin of the article is clearly indicated on a waybill, bill of lading, shipper's invoice, or other similar document accompanying the shipment. Shipments moving through or being reshipped from a regulated area must be safeguarded against infestation while within the regulated area.\n(a) For plant pest threats of imminent concern, the commissioner may declare an emergency quarantine or enact emergency orders.\n(b) If circumstances permit, public notice and a public hearing must be held to solicit comments regarding the proposed state quarantine. If a plant pest threat is of imminent concern and there is insufficient time to allow full public comment on the proposed quarantine, the commissioner may impose an emergency quarantine until a state quarantine can be implemented.\n(c) Upon establishment of a state quarantine, and upon institution of modifications or repeal, notices must be sent to the principal parties of interest, including federal and state authorities, and to organizations representing the public involved in the restrictive measures.\nA quarantine may be repealed when its purpose has been accomplished. If a quarantine has attained its objective or if the progress of events has clearly proved that attainment is not possible by the restrictions adopted, a quarantine may be modified or repealed.",
	"repealed": false
}