{
	"id": "524.5-304",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-304",
	"title": "524.5-304 JUDICIAL APPOINTMENT OF GUARDIAN: PRELIMINARIES TO HEARING.",
	"text": "(a) Upon receipt of a petition to establish a guardianship, the court shall set a date and time for hearing the petition and may appoint a visitor. The duties and reporting requirements of the visitor are limited to the relief requested in the petition.\n(b) A proposed person subject to guardianship has the right to be represented by counsel at any proceeding under this article. The court shall appoint counsel to represent the proposed person subject to guardianship for the initial proceeding held pursuant to section 524.5-307 if neither the proposed person subject to guardianship nor others provide counsel unless in a meeting with a visitor the proposed person subject to guardianship makes an informed decision in writing to specifically waive the right to counsel. Before appointment, and at any time during the course of the representation when a risk of a conflict of interest may arise, the proposed or appointed counsel shall disclose to the court, the proposed person subject to guardianship or person subject to guardianship, and interested persons whether there are concurrent proceedings in which the counsel is the attorney for the proposed guardian or guardian and whether there is a risk of a conflict of interest under Rule 1.7 of the Rules of Professional Conduct so that the representation of the proposed person subject to guardianship or person subject to guardianship will be materially limited by counsel's concurrent responsibilities to the proposed guardian or guardian. If there is a risk of a conflict of interest, the counsel must not be appointed or new counsel must be appointed, unless:\n(1) the court determines that the proposed person subject to guardianship or person subject to guardianship is able to give informed consent to the representation and, if the proposed person subject to guardianship or person subject to guardianship consents, the consent is confirmed in writing pursuant to Rule 1.7; or\n(2) the court determines that there is not a risk of a conflict of interest under Rule 1.7 requiring the appointment of different counsel.\n(c) Counsel must be appointed immediately after any petition under this article is served under section 524.5-308. Counsel has the full right of subpoena. In all proceedings under this article, counsel shall:\n(1) consult with the proposed person subject to guardianship before any hearing;\n(2) be given adequate time to prepare for all hearings; and\n(3) continue to represent the person throughout any proceedings under section 524.5-307, provided that such appointment shall expire upon the expiration of the appeal time for the order appointing guardian or the order dismissing a petition, or upon such other time or event as the court may direct.\nThe court need not appoint counsel to represent the proposed person subject to guardianship on a voluntary petition, and the court may remove a court-appointed attorney at any time if the court finds that the proposed person subject to guardianship has made a knowing and intelligent waiver of the right to counsel or has obtained private counsel.\n(d) The visitor shall personally serve the notice and petition upon the respondent and shall offer to read the notice and petition to the respondent, and if so requested the visitor shall read the notice and petition to such person. The visitor shall also interview the respondent in person, and to the extent that the respondent is able to understand:\n(1) explain to the respondent the substance of the petition; the nature, purpose, and effect of the proceeding; the respondent's rights at the hearing; and the general powers and duties of a guardian;\n(2) determine the respondent's views about the proposed guardian, the proposed guardian's powers and duties, and the scope and duration of the proposed guardianship;\n(3) inform the respondent of the right to employ and consult with a lawyer at the respondent's own expense and the right to request a court-appointed lawyer; and\n(4) inform the respondent that all costs and expenses of the proceeding, including respondent's attorneys fees, will be paid from the respondent's estate.\n(e) In addition to the duties in paragraph (d), the visitor shall make any other investigation the court directs.\n(f) The visitor shall promptly file, as a confidential document consistent with the bill of particulars under section 524.5-121, a report in writing with the court, which must include:\n(1) recommendations regarding the appropriateness of guardianship, including whether less restrictive means of intervention are available, the type of guardianship, and, if a limited guardianship, the powers to be granted to the limited guardian;\n(2) a statement as to whether the respondent approves or disapproves of the proposed guardian, and the powers and duties proposed or the scope of the guardianship; and\n(3) any other matters the court directs.\n(g) The county social service agency may create a screening committee to review a petition involving an indigent person. The screening committee must consist of individuals selected by the agency with knowledge of alternatives that are less restrictive than guardianship. If the agency has created a screening committee, the court shall make its decision after the screening committee has reviewed the petition. For an indigent person, the court may appoint a guardian under contract with the county to provide these services.",
	"repealed": false
}