{
	"id": "169.223",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.223",
	"title": "169.223 MOTORIZED BICYCLE.",
	"text": "Section 169.974 relating to motorcycles is applicable to motorized bicycles, except as otherwise provided in this section and except that:\n(1) protective headgear includes headgear that meets the standards under Code of Federal Regulations, title 16, part 1203, or successor requirements;\n(2) a motorized bicycle equipped with a headlight and taillight meeting the requirements of lighting for motorcycles may be operated during nighttime hours;\n(3) protective headgear is not required for operators 18 years of age or older; and\n(4) the provisions of section 169.222, subdivision 9, governing the parking of bicycles apply to motorized bicycles.\n(a) A motorized bicycle may be operated under either a driver's license or a motorized bicycle permit issued under section 171.02, subdivision 3.\n(b) A person under the age of 16 operating a motorized bicycle under a motorized bicycle permit is subject to the restrictions imposed by section 169.974, subdivision 2, on operation of a motorcycle under a two-wheel instruction permit, except that:\n(1) a parent or guardian of an operator under the age of 16 may also ride on the motorized bicycle as a passenger or operator if the motorized bicycle is equipped with a seat and footrests for a second passenger;\n(2) a motorized bicycle equipped with a headlight and taillight meeting the requirements of lighting for motorcycles may be operated during nighttime hours;\n(3) protective headgear includes headgear described in subdivision 1; and\n(4) protective headgear is required only until the operator reaches the age of 18 years.\nNo person shall operate a motorized bicycle upon a sidewalk at any time, except when such operation is necessary for the most direct access to a roadway from a driveway, alley or building. No person shall operate a motorized bicycle that is carrying any person other than the operator, except as allowed under subdivision 2.\nThe provisions of section 169.974, subdivision 5, paragraph (k), apply to motorized bicycles that are equipped with headlights. A new motorized bicycle sold or offered for sale in Minnesota must be equipped with a headlight.\n[See Note.]\n(a) A person operating a motorized bicycle on a roadway shall ride as close as practicable to the right-hand curb or edge of the roadway except in one of the following situations:\n(1) when overtaking and passing another vehicle proceeding in the same direction;\n(2) when preparing for a left turn at an intersection or into a private road or driveway; or\n(3) when reasonably necessary to avoid conditions, including fixed or moving objects, vehicles, pedestrians, animals, surface hazards, or narrow width lanes, that make it unsafe to continue along the right-hand curb or edge.\n(b) Persons operating motorized bicycles on a roadway may not ride more than two abreast and may not impede the normal and reasonable movement of traffic. On a laned roadway, a person operating a motorized bicycle shall ride within a single lane.\n(c) This section does not permit the operation of a motorized bicycle on a bicycle path or bicycle lane that is reserved for the exclusive use of nonmotorized traffic.",
	"repealed": false
}