{
	"id": "62M.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/62M.05",
	"title": "62M.05 PROCEDURES FOR REVIEW DETERMINATION.",
	"text": "A utilization review organization must have written procedures to ensure that reviews are conducted in accordance with the requirements of this chapter.\nA utilization review organization may review ongoing inpatient stays based on the severity or complexity of the enrollee's condition or on necessary treatment or discharge planning activities. Such review must not be consistently conducted on a daily basis.\nA utilization review organization must have written procedures for providing notification of all its adverse determinations and authorizations in accordance with this section.\n(a) A standard review determination on all requests for utilization review must be communicated to the provider and enrollee in accordance with this subdivision within five business days after receiving the request, regardless of how the request was received, provided that all information reasonably necessary to make a determination on the request has been made available to the utilization review organization.\n(b) When a determination is made to authorize, notification must be provided promptly by telephone to the provider. The utilization review organization shall send written notification to the provider or shall maintain an audit trail of the determination and telephone notification. For purposes of this subdivision, \"audit trail\" includes documentation of the telephone notification, including the date; the name of the person spoken to; the enrollee; the service, procedure, or admission authorized; and the date of the service, procedure, or admission. If the utilization review organization indicates authorization by use of a number, the number must be called the \"authorization number.\" For purposes of this subdivision, notification may also be made by facsimile to a verified number or by electronic mail to a secure electronic mailbox. These electronic forms of notification satisfy the \"audit trail\" requirement of this paragraph.\n(c) When an adverse determination is made, notification must be provided within the time periods specified in paragraph (a) by telephone, by facsimile to a verified number, or by electronic mail to a secure electronic mailbox to the attending health care professional and hospital or physician office as applicable. Written notification must also be sent to the hospital or physician office as applicable and attending health care professional if notification occurred by telephone. For purposes of this subdivision, notification may be made by facsimile to a verified number or by electronic mail to a secure electronic mailbox. Written notification must be sent to the enrollee and may be sent by United States mail, facsimile to a verified number, or by electronic mail to a secure mailbox. The written notification must include all reasons relied on by the utilization review organization for the determination and the process for initiating an appeal of the determination. Upon request, the utilization review organization shall provide the provider or enrollee with the criteria used to determine the necessity, appropriateness, and efficacy of the health care service and identify the database, professional treatment parameter, or other basis for the criteria. Reasons for an adverse determination may include, among other things, the lack of adequate information to authorize after a reasonable attempt has been made to contact the provider or enrollee.\n(d) When an adverse determination is made, the written notification must inform the enrollee and the attending health care professional of the right to submit an appeal to the internal appeal process described in section 62M.06 and the procedure for initiating the internal appeal. The written notice shall be provided in a culturally and linguistically appropriate manner consistent with the provisions of the Affordable Care Act as defined under section 62A.011, subdivision 1a.\n(a) An expedited determination must be utilized if the attending health care professional believes that an expedited determination is warranted.\n(b) Notification of an expedited determination to authorize or an expedited adverse determination must be provided to the hospital, the attending health care professional, and the enrollee as expeditiously as the enrollee's medical condition requires, but no later than 48 hours and must include at least one business day after the initial request. When an expedited adverse determination is made, the utilization review organization must also notify the enrollee and the attending health care professional of the right to submit an appeal to the expedited internal appeal as described in section 62M.06 and the procedure for initiating an expedited internal appeal.\nA utilization review organization must have written procedures to address the failure of a provider or enrollee to provide the information necessary to make a determination on the request. If the enrollee or provider will not release the necessary information to the utilization review organization, the utilization review organization may make an adverse determination in accordance with its own policy or the policy described in the health benefit plan.\nIf the utilization review organization and the claims administrator are separate entities, the utilization review organization must forward, electronically or in writing, a notification of an authorization or adverse determination to the appropriate claims administrator for the health benefit plan. If it is determined by the claims administrator that the authorized health care service is not covered by the health benefit plan, the claims administrator must promptly notify the claimant and provider of this information.",
	"repealed": false
}