{
	"id": "216C.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.145",
	"title": "216C.145 COMMUNITY ENERGY EFFICIENCY AND RENEWABLE ENERGY LOAN PROGRAM.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Community energy efficiency and renewable energy projects\" means solar thermal water heating, solar electric or photovoltaic equipment, small wind energy conversion systems of less than 250 kW, anaerobic digester gas systems, microhydro systems up to 100 kW, heating and cooling applications using solar thermal or ground source technology, and cost-effective energy efficiency projects installed in industrial, commercial, or public buildings, or health care facilities.\n(c) \"Health care facilities\" means a hospital licensed under sections 144.50 to 144.56, or a nursing home licensed under chapter 144A.\n(d) \"Industrial customer\" means a business that is classified under the North American Industrial Classification System under codes 21, 31 to 33, 48, 49, or 562.\n(e) \"Small business\" means a business that employs 50 or fewer employees.\n(f) \"Unit of local government\" means any home rule charter or statutory city, county, commission, district, authority, or other political subdivision or instrumentality of this state, including a sanitary district, park district, the Metropolitan Council, a port authority, an economic development authority, or a housing and redevelopment authority.\nThe commissioner of commerce shall develop, implement, and administer a community energy efficiency and renewable energy loan program under this section.\n(a) The commissioner may issue low-interest, long-term loans to units of local government to:\n(1) finance community-owned or publicly owned renewable energy systems or cost-effective energy efficiency improvements to public buildings; or\n(2) provide loans or other aids to industrial or commercial businesses or health care facilities for cost-effective energy efficiency projects or to install renewable energy systems.\n(b) The commissioner may participate in loans made by the Housing Finance Agency to residential property owners, private developers, nonprofit organizations, or units of local government under sections 462A.05, subdivisions 14 and 18; and 462A.33 for the construction, purchase, or rehabilitation of residential housing to facilitate the installation of renewable energy systems in residential housing and cost-effective energy conservation improvements identified in an energy efficiency audit. The commissioner shall assist the Housing Finance Agency in assessing the technical qualifications of loan applicants.\n(c) If an industrial, commercial, or health care facility customer seeks a loan under paragraph (a), clause (2), the commissioner may require an individual industrial, commercial, or health care facility customer to provide its energy usage data for the limited purpose of assessing the energy and cost savings of the project that is subject to the loan. Industrial, commercial, or health care facility customer's energy usage data may only be released upon the express, written consent of the individual industrial, commercial, or health care facility customer. The commissioner shall not require an industrial, commercial, or health care facility customer to provide energy usage data or aggregation of energy usage data that includes an industrial, commercial, or health care facility customer for any other loan under this section. Any individual industrial, commercial, or health care facility customer's energy usage data provided under this section shall be classified as nonpublic data as defined in section 13.02, subdivision 9.\nThe commissioner shall determine technical standards for community energy efficiency and renewable energy projects to qualify for loans under this section.\n(a) At least once a year, the commissioner shall publish in the State Register a request for proposals from units of local government for a loan under this section. Within 45 days after the deadline for receipt of proposals, the commissioner shall select proposals based on the following criteria:\n(1) the reliability and cost-effectiveness of the renewable or energy efficiency technology to be installed under the proposal;\n(2) the extent to which the proposal effectively integrates with the conservation and energy efficiency programs or goals of the energy utilities serving the proposer;\n(3) the total life cycle energy use and greenhouse gas emissions reductions per dollar of installed cost;\n(4) the diversity of the renewable energy or energy efficiency technology installed under the proposal;\n(5) the geographic distribution of projects throughout the state;\n(6) the percentage of total project cost requested;\n(7) the proposed security for payback of the loan; and\n(8) other criteria the commissioner may determine to be necessary and appropriate.\nA loan under this section must be issued at the lowest interest rate required to recover principal and interest plus the costs of issuing the loan, and must be for a minimum of 15 years, unless the commissioner determines that a shorter loan period of no less than five years is necessary and feasible.\nA community energy efficiency and renewable energy loan account is established in the state treasury. Money in the account consists of the proceeds of revenue bonds issued under section 216C.146, interest and other earnings on money in the account, money received in repayment of loans from the account, legislative appropriations, and money from any other source credited to the account.\nMoney in the account is appropriated to the commissioner of commerce to make community energy efficiency and renewable energy loans under this section and to the commissioner of management and budget to pay debt service and other costs under section 216C.146. Payment of debt service costs and funding reserves take priority over use of money in the account for any other purpose.",
	"repealed": false
}