{
	"id": "65B.61",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.61",
	"title": "65B.61 BENEFITS PRIMARY; SUBTRACTIONS; COORDINATION.",
	"text": "Basic economic loss benefits shall be primary with respect to benefits, except for those paid or payable under a workers' compensation law, which any person receives or is entitled to receive from any other source as a result of injury arising out of the maintenance or use of a motor vehicle. Where workers' compensation benefits paid or payable are primary, the reparation obligor shall make an appropriate rebate or reduction in the premiums of the plan of reparation security. The amount of the rebate or rate reduction shall be not less than the amount of the projected reduction in benefits and claims for which the reparation obligor will be liable on that class of risks. The projected reduction or rebate in benefits and claims shall be based upon sound actuarial principles.\nIf benefits are paid or payable under a workers' compensation law because of the injury, no disability income loss benefits are payable unless the weekly workers' compensation disability benefits are less than the weekly disability benefit as set out in section 65B.44, subdivision 3, in which case the reparation obligor shall pay to the injured person the amount that the weekly disability and income loss benefits payable under section 65B.44, subdivision 3, exceeds the weekly workers' compensation disability benefits.\nIf benefits are paid or payable under a workers' compensation law because of death, no survivors' economic loss benefits are payable unless the weekly workers' compensation dependency allowance is less than the weekly survivors' economic loss benefit rate as set out in section 65B.44, subdivision 6, in which case the reparation obligor shall pay to the surviving dependents the amount that the weekly survivors' economic loss benefits payable under section 65B.44, subdivision 6, exceed the weekly workers' compensation dependency allowances.\n[Repealed, 1984 c 420 s 2]\nAny legal entity, other than a reparation obligor obligated to pay benefits under a plan of reparation security or an insurer or employer obligated to pay benefits under a workers' compensation law, may coordinate any benefits it is obligated to pay for loss incurred as a result of injury arising out of the maintenance or use of a motor vehicle with basic economic loss benefits. No entity may coordinate benefits pursuant to this subdivision, unless it provides an appropriately reduced premium rate. The amount of this rate reduction shall be not less than the amount of the projected reduction in benefits and claims for which the entity will be liable on that class of risks, less the additional reasonable expenses incurred to administer the plan coordinating benefits. The projected reduction in benefits and claims shall be based upon sound actuarial principles.\n[Repealed, 1979 c 57 s 2]",
	"repealed": false
}