{
	"id": "355.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/355.01",
	"title": "355.01 DEFINITIONS.",
	"text": "For the purposes of this chapter, each of the terms defined in this section has the meaning ascribed to it herein.\n[Repealed, 2002 c 392 art 8 s 36]\n\"Constitutional officer\" means a person who serves as the governor, lieutenant governor, attorney general, secretary of state, or state auditor, who is duly elected and who was sworn into office.\n\"Director\" means the executive director of the Public Employees Retirement Association.\n\"Duluth teacher\" means a person employed by Independent School District No. 709, Duluth, who holds a position covered by the Teachers Retirement Association under section 354.73 and Laws 2014, chapter 296, article 6, section 46.\n\"Educational employee\" means an employee of the state of Minnesota or of a public subdivision of the state who performs services in a position covered by the Teachers Retirement Association under chapter 354.\n\"Employee\" means a person employed by the state of Minnesota or by a political subdivision of the state and includes an officer of the state of Minnesota or of a political subdivision of the state.\n\"Employee tax\" means the tax imposed by section 3101 of the Internal Revenue Code of 1986.\n(a) \"Employment\" means any service performed by an employee in the employ of the state, or any political subdivision thereof, for that employer, except:\n(1) service which in the absence of an agreement entered into under this chapter, as amended, would constitute \"employment\" as defined in the Social Security Act; or\n(2) service which under the Social Security Act is not permitted to be included in an agreement between the state and the federal Secretary of Health and Human Services entered into under this chapter.\n(b) Service which under the Social Security Act is permitted to be included in an agreement only upon certification by the governor in accordance with section 218(d) (3) of that act must be included in the term \"employment\" if and when the governor issues, with respect to that service, the appropriate federal certificate to the federal Secretary of Health and Human Services.\n\"Federal Insurance Contributions Act\" means subchapters A and B of chapter 21 of the Internal Revenue Code of 1986, as amended through December 31, 2000.\n\"Governmental employer\" means any political subdivision as defined in section 218 of the Social Security Act. The term includes a city, county, town, hospital district, or other body, politic and corporate, located in Minnesota.\n\"Higher education employee\" means an employee of the state of Minnesota who performs services in a Minnesota State Colleges and Universities system in a position covered by the individual retirement account plan under section 354B.211 and who remains a member of the Teachers Retirement Association for purposes of Social Security coverage only.\n\"Hospital employee\" means an officer or employee of a public hospital who performs services in a position covered by the Public Employees Retirement Association under chapter 353.\n\"Judge\" means a judge as defined in section 490.121, subdivision 21b.\n\"Legislator\" means a member of the legislature who is duly elected and who was sworn into office.\n\"Local governmental subdivision\" means:\n(1) a political subdivision as defined in section 218(b) of the Social Security Act;\n(2) an instrumentality of the state;\n(3) an instrumentality of one or more of the political subdivisions of the state;\n(4) an instrumentality of the state and one or more of its political subdivisions;\n(5) a governmental subdivision as defined in section 353.01, subdivision 6; and\n(6) any instrumentality established under a joint powers agreement under section 471.59 wherein the instrumentality is responsible for the employment and the payment of the salaries of the employees of the instrumentality.\n\"Minneapolis teacher\" means a person employed by Special School District No. 1, Minneapolis, who holds a position covered by the Teachers Retirement Association under section 354.70.\n\"Political subdivision\" means any political subdivision as defined in section 218(b) of the Social Security Act, and includes any instrumentality of the state, any instrumentality of one or more of its political subdivisions, including the League of Minnesota Municipalities, any instrumentality of the state and one or more of its political subdivisions, and an instrumentality established under a joint powers agreement under section 471.59, wherein the instrumentality is responsible for the employment and payment of the salaries of employees of the instrumentality.\n\"Public employee\" means an officer or an employee of a local governmental subdivision of the state who performs services in a position covered by the Public Employees Retirement Association established under chapter 353. The term does not include any person who was a member of the former Minneapolis Employees Retirement Fund on June 29, 2010, while the person is employed in a position that was transferred to the Public Employees Retirement Association.\n\"Public hospital\" means a hospital that is owned or operated by a governmental employer or a combination of governmental employers, or a hospital that is an integral part of a governmental employer or of a combination of governmental employers.\n\"St. Paul teacher\" means a person employed by Independent School District No. 625, St. Paul, who holds a position covered by the St. Paul Teachers Retirement Fund Association established under chapter 354A.\n[Repealed, 2002 c 392 art 8 s 36]\n[Repealed, 2002 c 392 art 8 s 36]\n\"Secretary of Health and Human Services\" means the secretary of the federal Department of Health and Human Services and includes any individual to whom the Secretary of Health and Human Services has delegated functions under the Social Security Act with respect to coverage of employees of states and their political subdivisions.\n[Repealed, 1967 c 687 s 24]\n\"Social Security Act\" means the Act of Congress approved August 14, 1935, chapter 531, Statutes at Large, volume 49, page 620, officially cited as the \"Social Security Act,\" as amended (including the relevant regulations and requirements).\n[Repealed, 2002 c 392 art 8 s 36]\n[Repealed, 2002 c 392 art 8 s 36]\n\"Special authority or district\" means a municipal housing and redevelopment authority organized under sections 469.001 to 469.047, a soil and water conservation district organized under chapter 103C, a port authority organized under sections 469.048 to 469.068, an economic development authority organized under sections 469.090 to 469.108, or a hospital district organized or reorganized under sections 447.31 to 447.37.\n\"Special authority or district employee\" means an employee, other than an elected official, of a municipal housing and redevelopment authority organized under sections 469.001 to 469.047, of a soil and water conservation district organized under chapter 103C, of a port authority organized under sections 469.048 to 469.068, of an economic development authority organized under sections 469.090 to 469.108, or of a hospital district organized or reorganized under sections 447.31 to 447.37.\n\"State employee\" means an employee of the state of Minnesota or of a political subdivision who performs services in a position covered by the general state employees retirement plan of the Minnesota State Retirement System governed by chapter 352, except any position for which the compensation is on a fee basis.\n\"Wages\" means all remuneration for employment, including the cash value of all remuneration paid in any medium other than cash. The term does not include that part of the remuneration which, even if it were for employment within the meaning of the Federal Insurance Contributions Act, would not constitute wages within the meaning of that act.",
	"repealed": false
}