{
	"id": "523.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/523.23",
	"title": "523.23 STATUTORY SHORT FORM OF GENERAL POWER OF ATTORNEY; FORMAL REQUIREMENTS; JOINT AGENTS.",
	"text": "The following form may be used to create a power of attorney, and, when used, it must be construed in accordance with sections 523.23 and 523.24:\nSTATUTORY SHORT FORM POWER OF ATTORNEY\nMINNESOTA STATUTES, SECTION 523.23\nBefore completing and signing this form, the principal must read and initial the IMPORTANT NOTICE TO PRINCIPAL that appears after the signature lines in this form. Before acting on behalf of the principal, the attorney(s)-in-fact must sign this form acknowledging having read and understood the IMPORTANT NOTICE TO ATTORNEY(S)-IN-FACT that appears after the notice to the principal.\nPRINCIPAL (Name and Address of Person Granting the Power)\nI, (the above-named Principal) hereby appoint the above named Attorney(s)-in-Fact to act as my attorney(s)-in-fact:\nFIRST: To act for me in any way that I could act with respect to the following matters, as each of them is defined in Minnesota Statutes, section 523.24:\n(To grant to the attorney-in-fact any of the following powers, make a check or \"x\" on the line in front of each power being granted. You may, but need not, cross out each power not granted. Failure to make a check or \"x\" on the line in front of the power will have the effect of deleting the power unless the line in front of the power of (N) is checked or x-ed.)\nSECOND: (You must indicate below whether or not this power of attorney will be effective if you become incapacitated or incompetent. Make a check or \"x\" on the line in front of the statement that expresses your intent.)\nTHIRD: My attorney(s)-in-fact MAY NOT make gifts to the attorney(s)-in-fact, or anyone the attorney(s)-in-fact are legally obligated to support, UNLESS I have made a check or an \"x\" on the line in front of the second statement below and I have written in the name(s) of the attorney(s)-in-fact. The second option allows you to limit the gifting power to only the attorney(s)-in-fact you name in the statement.\nMinnesota Statutes, section 523.24, subdivision 8, clause (2), limits the annual gift(s) made to my attorney(s)-in-fact, or to anyone the attorney(s)-in-fact are legally obligated to support, to an amount, in the aggregate, that does not exceed the federal annual gift tax exclusion amount in the year of the gift.\nFOURTH: (You may indicate below whether or not the attorney-in-fact is required to make an accounting. Make a check or \"x\" on the line in front of the statement that expresses your intent.)\nIn Witness Whereof I have hereunto signed my name this ................ day of ........................, ............\nIMPORTANT NOTICE TO THE PRINCIPAL\nREAD THIS NOTICE CAREFULLY. The power of attorney form that you will be signing is a legal document. It is governed by Minnesota Statutes, chapter 523. If there is anything about this form that you do not understand, you should seek legal advice.\nPURPOSE: The purpose of the power of attorney is for you, the principal, to give broad and sweeping powers to your attorney(s)-in-fact, who is the person you designate to handle your affairs. Any action taken by your attorney(s)-in-fact pursuant to the powers you designate in this power of attorney form binds you, your heirs and assigns, and the representative of your estate in the same manner as though you took the action yourself.\nPOWERS GIVEN: You will be granting the attorney(s)-in-fact power to enter into transactions relating to any of your real or personal property, even without your consent or any advance notice to you. The powers granted to the attorney(s)-in-fact are broad and not supervised. THIS POWER OF ATTORNEY DOES NOT GRANT ANY POWERS TO MAKE HEALTH CARE DECISIONS FOR YOU. TO GIVE SOMEONE THOSE POWERS, YOU MUST USE A HEALTH CARE DIRECTIVE THAT COMPLIES WITH MINNESOTA STATUTES, CHAPTER 145C.\nDUTIES OF YOUR ATTORNEY(S)-IN-FACT: Your attorney(s)-in-fact must keep complete records of all transactions entered into on your behalf. You may request that your attorney(s)-in-fact provide you or someone else that you designate a periodic accounting, which is a written statement that gives reasonable notice of all transactions entered into on your behalf. Your attorney(s)-in-fact must also render an accounting if the attorney-in-fact reimburses himself or herself for any expenditure they made on behalf of you.\nAn attorney-in-fact is personally liable to any person, including you, who is injured by an action taken by an attorney-in-fact in bad faith under the power of attorney or by an attorney-in-fact's failure to account when the attorney-in-fact has a duty to account under this section. The attorney(s)-in-fact must act with your interests utmost in mind.\nTERMINATION: If you choose, your attorney(s)-in-fact may exercise these powers throughout your lifetime, both before and after you become incapacitated. However, a court can take away the powers of your attorney(s)-in-fact because of improper acts. You may also revoke this power of attorney if you wish. This power of attorney is automatically terminated if the power is granted to your spouse and proceedings are commenced for dissolution, legal separation, or annulment of your marriage.\nThis power of attorney authorizes, but does not require, the attorney(s)-in-fact to act for you. You are not required to sign this power of attorney, but it will not take effect without your signature. You should not sign this power of attorney if you do not understand everything in it, and what your attorney(s)-in-fact will be able to do if you do sign it.\nPlease place your initials on the following line indicating you have read this IMPORTANT NOTICE TO THE PRINCIPAL: .......\nIMPORTANT NOTICE TO THE ATTORNEY(S)-IN-FACT\nYou have been nominated by the principal to act as an attorney-in-fact. You are under no duty to exercise the authority granted by the power of attorney. However, when you do exercise any power conferred by the power of attorney, you must:\n(1) act with the interests of the principal utmost in mind;\n(2) exercise the power in the same manner as an ordinarily prudent person of discretion and intelligence would exercise in the management of the person's own affairs;\n(3) render accountings as directed by the principal or whenever you reimburse yourself for expenditures made on behalf of the principal;\n(4) act in good faith for the best interest of the principal, using due care, competence, and diligence;\n(5) cease acting on behalf of the principal if you learn of any event that terminates this power of attorney or terminates your authority under this power of attorney, such as revocation by the principal of the power of attorney, the death of the principal, or the commencement of proceedings for dissolution, separation, or annulment of your marriage to the principal;\n(6) disclose your identity as an attorney-in-fact whenever you act for the principal by signing in substantially the following manner:\nSignature by a person as \"attorney-in-fact for (name of the principal)\" or \"(name of the principal) by (name of the attorney-in-fact) the principal's attorney-in-fact\";\n(7) acknowledge you have read and understood this IMPORTANT NOTICE TO THE ATTORNEY(S)-IN-FACT by signing the power of attorney form.\nYou are personally liable to any person, including the principal, who is injured by an action taken by you in bad faith under the power of attorney or by your failure to account when the duty to account has arisen.\nThe meaning of the powers granted to you is contained in Minnesota Statutes, chapter 523. If there is anything about this document or your duties that you do not understand, you should seek legal advice.\nAny of the powers of the form in subdivision 1 or a form prepared under section 523.231 which is not checked or X-ed is withheld by the principal from the attorney-in-fact unless the power of (N) of the form in subdivision 1 or a comparable provision in a form prepared under section 523.231 is checked or X-ed.\nExcept for a form prepared under section 523.231, to constitute a \"statutory short form power of attorney,\" as this phrase is used in this chapter the wording and content of the form in subdivision 1 must be duplicated exactly and with no modifications, parts First, Second, and Third must be properly completed, and the signature of the principal must be acknowledged. Failure to name a successor attorney-in-fact, to provide an expiration date, or to complete part Fourth does not invalidate the power as a statutory short form power of attorney. A power of attorney that does not satisfy the requirements of this subdivision or a form prepared under section 523.231, but purports to be a statutory short form power of attorney, may constitute a common law power of attorney that incorporates by reference the definitions of powers contained in section 523.24; however, a party refusing to accept the authority of the common law attorney-in-fact is not liable under section 523.20.\nUse of a street address instead of a legal description under the power of (A) in part First of the statutory short form power of attorney invalidates the power of (A) for all real property transactions, but does not affect the powers of (B) to (M), nor does it affect the power of (N) except with respect to real property transactions.\nAll powers enumerated in section 523.24 may be legally performed by an attorney-in-fact acting on behalf of a principal.\nThe attorney-in-fact acting under a statutory short form power of attorney is authorized to reimburse the attorney-in-fact for expenditures the attorney-in-fact has made on behalf of the principal even if the principal has not authorized the attorney-in-fact to receive transfers directly under part Third. In the event a reimbursement is made, the attorney-in-fact shall render an accounting in accordance with section 523.21.\nThe amendments to the form under subdivision 1 and to section 523.24, subdivision 8, that are contained in Laws 2013, chapter 23, are effective January 1, 2014, and apply to powers of attorney executed on or after that date. These amendments do not invalidate or impair a power of attorney executed before that date.",
	"repealed": false
}