{
	"id": "325C.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/325C.01",
	"title": "325C.01 DEFINITIONS.",
	"text": "As used in sections 325C.01 to 325C.07, the terms defined in these sections have the meanings given them, unless the context requires otherwise.\n\"Improper means\" includes theft, bribery, misrepresentation, breach or inducement of a breach of a duty to maintain secrecy, or espionage through electronic or other means.\n\"Misappropriation\" means:\n(i) acquisition of a trade secret of another by a person who knows or has reason to know that the trade secret was acquired by improper means; or\n(ii) disclosure or use of a trade secret of another without express or implied consent by a person who\n(A) used improper means to acquire knowledge of the trade secret; or\n(B) at the time of disclosure or use, knew or had reason to know that the discloser's or user's knowledge of the trade secret was\n(I) derived from or through a person who had utilized improper means to acquire it;\n(II) acquired under circumstances giving rise to a duty to maintain its secrecy or limit its use; or\n(III) derived from or through a person who owed a duty to the person seeking relief to maintain its secrecy or limit its use; or\n(C) before a material change of the discloser's or user's position, knew or had reason to know that it was a trade secret and that knowledge of it had been acquired by accident or mistake.\n\"Person\" means a natural person, corporation, business trust, estate, trust, partnership, association, joint venture, government, governmental subdivision or agency, or any other legal or commercial entity.\n\"Trade secret\" means information, including a formula, pattern, compilation, program, device, method, technique, or process, that:\n(i) derives independent economic value, actual or potential, from not being generally known to, and not being readily ascertainable by proper means by, other persons who can obtain economic value from its disclosure or use, and\n(ii) is the subject of efforts that are reasonable under the circumstances to maintain its secrecy.\nThe existence of a trade secret is not negated merely because an employee or other person has acquired the trade secret without express or specific notice that it is a trade secret if, under all the circumstances, the employee or other person knows or has reason to know that the owner intends or expects the secrecy of the type of information comprising the trade secret to be maintained.",
	"repealed": false
}