{
	"id": "626.843",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.843",
	"title": "626.843 RULES, STANDARDS; EXECUTIVE DIRECTOR.",
	"text": "The board shall adopt rules with respect to:\n(1) the certification of postsecondary schools to provide programs of professional peace officer education;\n(2) minimum courses of study and equipment and facilities to be required at each certified school within the state;\n(3) minimum qualifications for coordinators and instructors at certified schools offering a program of professional peace officer education located within this state;\n(4) minimum standards of physical, mental, and educational fitness which shall govern the admission to professional peace officer education programs and the licensing of peace officers within the state, by any state, county, municipality, or joint or contractual combination thereof, including members of the Minnesota State Patrol;\n(5) board-approved continuing education courses that ensure professional competence of peace officers and part-time peace officers;\n(6) minimum standards of conduct which would affect the individual's performance of duties as a peace officer. These standards shall be established and published. The board shall review the minimum standards of conduct described in this clause for possible modification in 1998 and every three years after that time;\n(7) a set of educational learning objectives that must be met within a certified school's professional peace officer education program. These learning objectives must concentrate on the knowledge, skills, and abilities deemed essential for a peace officer. Education in these learning objectives shall be deemed satisfactory for the completion of the minimum basic training requirement;\n(8) the establishment and use by any political subdivision or state law enforcement agency that employs persons licensed by the board of procedures for investigation and resolution of allegations of misconduct by persons licensed by the board. The procedures shall be in writing and shall be established on or before October 1, 1984;\n(9) the issues that must be considered by each political subdivision and state law enforcement agency that employs persons licensed by the board in establishing procedures under section 626.5532 to govern the conduct of peace officers who are in pursuit of a vehicle being operated in violation of section 609.487, and requirements for the training of peace officers in conducting pursuits. The adoption of specific procedures and requirements is within the authority of the political subdivision or agency;\n(10) supervision of part-time peace officers and requirements for documentation of hours worked by a part-time peace officer who is on active duty. These rules shall be adopted by December 31, 1993;\n(11) citizenship requirements for peace officers and part-time peace officers;\n(12) driver's license requirements for peace officers and part-time peace officers; and\n(13) such other matters as may be necessary consistent with sections 626.84 to 626.863. Rules promulgated by the attorney general with respect to these matters may be continued in force by resolution of the board if the board finds the rules to be consistent with sections 626.84 to 626.863.\n[Repealed, 1988 c 563 s 8]\nIf the board adopts rules to establish a subcommittee to investigate licensure actions, the subcommittee must have:\n(1) one voting board member appointed from the general public; and\n(2) three voting board members who are current or former peace officers.\nNo later than January 1, 2024, the board must adopt rules under chapter 14 that permit the board to take disciplinary action on a licensee for a violation of a standard of conduct in Minnesota Rules, chapter 6700, whether or not criminal charges have been filed and in accordance with the evidentiary standards and civil processes for boards under chapter 214.\nAn executive director shall be appointed by and serve in the unclassified service at the pleasure of the board. The executive director shall perform such duties, on behalf of the board, as the board shall prescribe. The board shall appoint such employees, agents and consultants as deemed necessary, prescribe their duties, and provide for reimbursement of their expenses. Such employees shall be in the classified service.\nThe board may, in addition:\n(1) recommend studies, surveys, and reports to be made by the executive director regarding the carrying out of the objectives and purposes of sections 626.841 to 626.863;\n(2) visit and inspect any certified school that offers the professional peace officer education program or for which application for certification has been made;\n(3) make recommendations, from time to time, to the executive director, attorney general, and the governor regarding the carrying out of the objectives and purposes of sections 626.841 to 626.863;\n(4) perform such other acts as may be necessary or appropriate to carry out the powers and duties of the board under sections 626.841 to 626.863; and\n(5) cooperate with and receive financial assistance from and join in projects or enter into contracts with the federal government or its agencies for the furtherance of the purposes of Laws 1977, chapter 433.\nThe board shall report to the attorney general, from time to time, and to the governor at least biennially concerning the activities of the board. The board shall report biannually to the chairs of the senate and house of representatives committees and divisions having jurisdiction over criminal justice funding concerning the activities of the board. In addition to other relevant items, the report must include detailed information concerning the compliance reviews required in section 626.8459.",
	"repealed": false
}