{
	"id": "97A.405",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.405",
	"title": "97A.405 LICENSE REQUIREMENTS.",
	"text": "Unless allowed under the game and fish laws, a person may not take, buy, sell, transport, or possess protected wild animals of this state without a license.\n(a) A person acting under a license or traveling from an area where a licensed activity was performed must have in personal possession:\n(1) the proper paper license;\n(2) a driver's license or Minnesota identification card that bears a valid designation of the proper lifetime license, as provided under section 171.07, subdivision 19;\n(3) the proper paper license identification number or stamp validation, if the license has been sold to the person by electronic means; or\n(4) electronic or other evidence satisfactory to the commissioner that the person has the proper paperless license.\n(b) If possession of a license or a license identification number is required, a person must exhibit, as requested by a conservation officer or peace officer: (1) the proper paper license; (2) a driver's license or Minnesota identification card that bears a valid designation of the proper lifetime license, as provided under section 171.07, subdivision 19; (3) the proper paper license identification number or stamp validation and a valid state driver's license, state identification card, or other form of identification provided by the commissioner; or (4) electronic or other evidence satisfactory to the commissioner that the person has the proper paperless license. A person charged with violating the license possession requirement shall not be convicted if the person produces in court or the office of the arresting officer, the actual license previously issued to that person, which was valid at the time of arrest, or satisfactory proof that at the time of the arrest the person was validly licensed. Upon request of a conservation officer or peace officer, a licensee shall write the licensee's name in the presence of the officer to determine the identity of the licensee.\n(c) Except as provided in paragraph (a), clauses (2) and (4), if the actual license has been issued and received, a receipt for license fees, a copy of a license, or evidence showing the issuance of a license, including the license identification number or stamp validation, does not entitle a licensee to exercise the rights or privileges conferred by a license.\n(d) A pictorial migratory waterfowl, pheasant, trout and salmon, or walleye stamp shall be provided to the licensee after purchase of a stamp validation only if the licensee pays an additional fee that covers the costs of producing and mailing a pictorial stamp. A pictorial turkey stamp may be purchased for a fee that covers the costs of producing and mailing the pictorial stamp. Notwithstanding section 16A.1283, the commissioner may, by written order published in the State Register, establish fees for providing the pictorial stamps. The fees must be set in an amount that does not recover significantly more or less than the cost of producing and mailing the stamps. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.\n(e) Notwithstanding paragraphs (a), (b), and (c), a person may use a digital image of a paper license issued to and received by the person to meet the requirement to possess the proper paper license under paragraph (a), clause (1), and may exhibit to a conservation officer or peace officer a digital image of a paper license issued to and received by the person to meet the requirements of paragraph (b). This paragraph expires March 5, 2025.\n[See Note.]\nThe commissioner shall prescribe rules for issuing duplicate licenses to persons whose licenses are lost or destroyed.\n[See Note.]\n(a) The commissioner may permit licensed deer hunters to change zone, license, or season options. The commissioner may issue a replacement deer license if the applicant pays any increase in cost between the original and the replacement deer license. A refund of the difference in fees may be issued when a person changes from a regular deer license to a youth deer license.\n(b) A replacement deer license may be issued only if the applicant has not harvested a deer under the original deer license or licenses and meets the conditions of paragraph (c).\n(c) A replacement deer license may be issued under the following conditions, or as otherwise prescribed by rule of the commissioner:\n(1) when the season for the deer license being surrendered has not yet opened; or\n(2) when the person is changing from a regular deer license to a youth deer license.\n(d) Notwithstanding section 97A.411, subdivision 3, a replacement deer license is valid immediately upon issuance if the deer license being surrendered is valid at that time.\n[See Note.]\n(a) The commissioner may permit licensed turkey hunters to change permit areas, licenses, or time periods within the fall turkey season, or within the spring turkey season. The commissioner may issue a replacement turkey license if the applicant pays the fee for a replacement license under section 97A.475, subdivision 44.\n(b) A replacement turkey license may be issued only if the applicant has not harvested a turkey under the original turkey license and meets the requirements of paragraph (c).\n(c) A turkey replacement license may be issued under the following conditions, or as otherwise prescribed by rule of the commissioner:\n(1) when the permit area or time period for the turkey license being surrendered has not yet opened; and\n(2) licenses are available for the replacement turkey license permit area or time period for (i) areas that are not lottery areas, (ii) lottery areas that have remaining licenses, or (iii) the applicant is a youth hunter age 17 or younger.\n[See Note.]\n(a) To obtain a resident license, an individual 21 years of age or older must be a resident and:\n(1) possess a current Minnesota driver's license or a valid application receipt for a driver's license that is at least 60 days past the issuance date;\n(2) possess a current identification card issued by the commissioner of public safety or a valid application receipt for an identification card that is at least 60 days past the issuance date;\n(3) present evidence showing proof of residency in cases when clause (1) or (2) would violate the Religious Freedom Restoration Act of 1993, Public Law 103-141; or\n(4) possess a Tribal identification card as provided in paragraph (b).\n(b) For purposes of this subdivision, \"Tribal identification card\" means an unexpired identification card as provided under section 171.072, paragraphs (b) and (c). The Tribal identification card:\n(1) must contain the enrolled Tribal member's Minnesota residence address; and\n(2) may be used to obtain a resident license under paragraph (a) only if the Tribal member does not have a current driver's license or state identification card in any state.\n(c) A person must not have applied for, purchased, or accepted a resident hunting, fishing, or trapping license issued by another state or foreign country within 60 days before applying for a resident license under this section.\nWhen an application deadline is specified, including an application deadline for determining the fee based on age for a lifetime license, an application must be received no later than 4:30 p.m. on the day of the deadline or, if mailed, an application must be postmarked on or before the deadline date.",
	"repealed": false
}