{
	"id": "136A.29",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.29",
	"title": "136A.29 POWERS; DUTIES.",
	"text": "The purpose of the authority shall be to assist institutions of higher education in the construction, financing, and refinancing of projects. The exercise by the authority of the powers conferred by sections 136A.25 to 136A.42, shall be deemed and held to be the performance of an essential public function. For the purpose of sections 136A.25 to 136A.42, the authority shall have the powers and duties set forth in subdivisions 2 to 23.\nThe authority shall annually elect one of its members as chair, one as vice-chair, and one as secretary, as well as elect additional officers deemed necessary by the authority.\nThe authority is authorized and empowered to appoint and employ employees as it may deem necessary to carry out its duties, determine the title of the employees so employed, and fix the salary of said employees. Employees of the authority shall participate in retirement and other benefits in the same manner that employees in the unclassified service of the office participate.\nBy mutual agreement between the authority and the office, authority staff employees may also be members of the office staff. By mutual agreement, authority employees may be provided office space in the office of the Office of Higher Education, and said employees may make use of equipment, supplies, and office space, provided that the authority fully reimburses the office for salaries and for space, equipment, supplies, and materials used. In the absence of such mutual agreement between the authority and the office, the authority may maintain an office at such place or places as it may designate.\nThe authority is authorized and empowered to adopt rules for the conduct of its business.\nThe authority is authorized and empowered to determine the location and character of any project to be financed under the provisions of sections 136A.25 to 136A.42, and to construct, reconstruct, remodel, maintain, manage, enlarge, alter, add to, repair, operate, lease, as lessee or lessor, and regulate the same, to enter into contracts for any or all of such purposes, to enter into contracts for the management and operation of a project, and to designate a participating institution of higher education as its agent to determine the location and character of a project undertaken by such participating institution of higher education under the provisions of sections 136A.25 to 136A.42 and as the agent of the authority, to construct, reconstruct, remodel, maintain, manage, enlarge, alter, add to, repair, operate, lease, as lessee or lessor, and regulate the same, and as the agent of the authority, to enter into contracts for any or all of such purposes, including contracts for the management and operation of such project. Contracts of the authority or of a participating institution of higher education to acquire or to construct, reconstruct, remodel, maintain, enlarge, alter, add to, or repair projects shall not be subject to the provisions of chapter 16C or section 574.26, or any other public contract or competitive bid law.\nThe authority is authorized and empowered to acquire by gift or purchase and hold and mortgage real estate and interests therein and personal property to be used as a project or a part thereof.\nThe authority is authorized and empowered to purchase, construct, reconstruct, enlarge, improve, furnish and equip and lease, sell, exchange, and otherwise dispose of projects or parts thereof.\nThe authority is authorized and empowered to issue revenue bonds whose aggregate principal amount at any time shall not exceed $2,000,000,000 and to issue notes, bond anticipation notes, and revenue refunding bonds of the authority under the provisions of sections 136A.25 to 136A.42, to provide funds for acquiring, constructing, reconstructing, enlarging, remodeling, renovating, improving, furnishing, or equipping one or more projects or parts thereof.\nThe authority is authorized and empowered to issue revenue bonds to acquire projects from or to make loans to participating institutions of higher education and thereby refinance outstanding indebtedness incurred by participating institutions of higher education to provide funds for the acquisition, construction or improvement of a facility before or after the enactment of sections 136A.25 to 136A.42, but otherwise eligible to be and being a project thereunder, whenever the authority finds that such refinancing will enhance or preserve such participating institutions and such facilities or utilization thereof for educational purposes or extend or adjust maturities to correspond to the resources available for their payment, or reduce the tuition, charges or fees imposed on students for the use of the facilities of such participating institutions of higher education or costs met by federal or state public funds, or enhance or preserve educational programs and research or the acquisition or improvement of other facilities eligible to be a project or part thereof by the participating institution of higher education. The amount of revenue bonds to be issued to refinance outstanding indebtedness of a participating institution of higher education shall not exceed the lesser of (a) the fair value of the project to be acquired by the authority from the institution or mortgaged to the authority by the institution or (b) the amount of the outstanding indebtedness including any premium thereon and any interest accrued or to accrue to the date of redemption and any legal, fiscal and related costs in connection with such refinancing and reasonable reserves, as determined by the authority. The provisions of this subdivision do not prohibit the authority from issuing revenue bonds within and charged against the limitations provided in subdivision 9 to provide funds for improvements, alteration, renovation, or extension of the project refinanced.\nThe authority is authorized and empowered to enter into contracts and execute all instruments necessary or appropriate to carry out the purposes of sections 136A.25 to 136A.42.\nThe authority is authorized and empowered generally, to fix and revise from time to time and charge and collect rates, rents, fees and charges for the use of and for the services furnished or to be furnished by a project or any portion thereof and to contract with any person, partnership, association or corporation or other body public or private in respect thereof.\nThe authority is authorized and empowered to pledge, assign, hypothecate, or otherwise encumber as security for the bonds, the rentals, revenues, and other income, charges, and moneys realized from the use, lease, sale, or other disposition of one or more projects or parts thereof as may be designated in the bond proceedings and enter into trust agreements or indentures of mortgage for the benefit of bondholders.\nThe authority is authorized and empowered to establish rules for the use of a project or any portion thereof and to designate a participating institution of higher education as its agent to establish rules for the use of a project undertaken for such participating institution of higher education.\nThe authority is authorized and empowered to employ consulting engineers, architects, attorneys, accountants, construction and financial experts, superintendents, managers, and such other employees and agents as may be necessary in its judgment, and to fix their compensation.\nThe authority is authorized and empowered to receive and accept from any public agency loans or grants for or in aid of the acquisition, construction, or refinancing of a project or any portion thereof, and to receive and accept loans, grants, aid or contributions from any source of either money, property, labor or other things of value to be held, used and applied only for the purposes for which such loans, grants, aid and contributions are made.\nThe authority is authorized and empowered to enter into appropriate arrangements with any federal or state department or agency, county, township, municipal corporation, or other political subdivision, taxing district, or public body or agency for the planning and installation of streets, roads, alleys, water supply and distribution facilities, storm and sanitary sewage collection and disposal facilities, and other necessary appurtenances to a project.\nThe authority is authorized and empowered to purchase fire and extended coverage and liability insurance for a project, and any other insurance the authority may agree to provide under the bond proceedings. The authority is not a municipality subject to the provisions of sections 466.01 to 466.15.\nBefore the issuance of any revenue bonds under the provisions of sections 136A.25 to 136A.42, any member or officer of the authority authorized by resolution of the authority to handle funds or sign checks of the authority shall be covered under a surety or fidelity bond in an amount to be determined by the authority. Each such bond shall be conditioned upon the faithful performance of the duties of the office of the member or officer, shall be executed by a surety company authorized to transact business in the state of Minnesota as surety. The cost of each such bond shall be paid by the authority.\nThe authority is authorized and empowered to sell, lease, release or otherwise dispose of real and personal property or interests therein, or a combination thereof, acquired by the authority under authority of sections 136A.25 to 136A.42 and no longer needed for the purposes of such chapter or of the authority, and grant such easements and other rights in, over, under, or across a project as will not interfere with its use of such property. Such sale, lease, release, disposition, or grant may be made without competitive bidding and in such manner for such consideration as the authority in its judgment deems appropriate.\nThe authority is authorized and empowered to make loans to any participating institution of higher education for the cost of a project in accordance with an agreement between the authority and the participating institution of higher education; provided that no such loan shall exceed the total cost of the project as determined by the participating institution of higher education and approved by the authority.\nThe authority is authorized and empowered to charge to and apportion among participating institutions of higher education its administrative costs and expenses incurred in the exercise of the powers and duties conferred by sections 136A.25 to 136A.42.\nThe authority is authorized and empowered to do all things necessary or convenient to carry out the purposes of sections 136A.25 to 136A.42.",
	"repealed": false
}