{
	"id": "518A.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/518A.83",
	"title": "518A.83 LOCATION OF PARENTS, ACCESS TO RECORDS.",
	"text": "(a) The public authority responsible for child support in this state or any other state, in order to locate a person or to obtain information necessary to establish paternity and child support or to modify or enforce child support or distribute collections, may request information reasonably necessary to the inquiry from the records of (1) state agencies or political subdivisions of this state, as defined in section 13.02, which shall, notwithstanding the provisions of section 268.19 or any other law to the contrary, provide the information necessary for this purpose; and (2) employers, utility companies, insurance companies, financial institutions, credit grantors, and labor associations doing business in this state. They shall provide a response upon written or electronic request within 30 days of service of the request made by the public authority. Information requested and used or transmitted by the commissioner according to the authority conferred by this section may be made available to other agencies, statewide systems, and political subdivisions of this state, and agencies of other states, interstate information networks, federal agencies, and other entities as required by federal regulation or law for the administration of the child support enforcement program.\n(b) For purposes of this section, \"state\" includes the District of Columbia, Puerto Rico, the United States Virgin Islands, and any territory or insular possession subject to the jurisdiction of the United States.\n(a) A request for information by the public authority responsible for child support of this state or any other state may be made to:\n(1) employers when there is reasonable cause to believe that the subject of the inquiry is or was an employee or independent contractor of the employer. Information to be released by employers of employees is limited to place of residence or address, home telephone, work telephone, mobile telephone, email address, employment status, wage or payment information, benefit information, and Social Security number. Information to be released by employers of independent contractors is limited to place of residence or address, home telephone, work telephone, mobile telephone, email address, contract status, payment information, benefit information, and Social Security number or identification number;\n(2) utility companies when there is reasonable cause to believe that the subject of the inquiry is or was a retail customer of the utility company. Customer information to be released by utility companies is limited to place of residence or address, home telephone, work telephone, mobile telephone, email address, source of income, employer and place of employment, and Social Security number;\n(3) insurance companies when there is reasonable cause to believe that the subject of the inquiry is or was receiving funds either in the form of a lump sum or periodic payments. Information to be released by insurance companies is limited to place of residence or address, home telephone, work telephone, mobile telephone, email address, employer, Social Security number, and amounts and type of payments made to the subject of the inquiry;\n(4) labor organizations when there is reasonable cause to believe that the subject of the inquiry is or was a member of the labor association. Information to be released by labor associations is limited to place of residence or address, home telephone, work telephone, mobile telephone, email address, Social Security number, and current and past employment information; and\n(5) financial institutions when there is reasonable cause to believe that the subject of the inquiry has or has had accounts, stocks, loans, certificates of deposits, treasury bills, life insurance policies, or other forms of financial dealings with the institution. Information to be released by the financial institution is limited to place of residence or address, home telephone, work telephone, mobile telephone, email address, identifying information on the type of financial relationships, Social Security number, current value of financial relationships, and current indebtedness of the subject with the financial institution.\n(b) For purposes of this section, utility companies include telephone companies, as defined in section 325F.675, subdivision 3, clause (3), radio common carriers, and telecommunications carriers as defined in section 237.01, and companies that provide electrical, telephone, natural gas, propane gas, oil, coal, or cable or satellite television services to retail customers, and Internet service providers. The term financial institution includes banks, savings and loans, credit unions, brokerage firms, mortgage companies, insurance companies, benefit associations, safe deposit companies, money market mutual funds, or similar entities authorized to do business in the state.\n(c) For purposes of this section, the public authority may request or obtain information from any person or entity enumerated in this section, or from any third party who contracts with any such person or entity to obtain or retain information that may be requested by the public authority.\nA person who releases information to the public authority as authorized under this section is immune from liability for release of the information.",
	"repealed": false
}