{
	"id": "216B.2445",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.2445",
	"title": "216B.2445 DECOMMISSIONING NUCLEAR PLANT; STORING USED FUEL.",
	"text": "(a) The Public Utilities Commission shall, when considering approval of a plan for the accrual of funds for the decommissioning of nuclear facilities filed in accordance with a commission order, include an evaluation of the costs, if any, arising from storage of used nuclear fuel that may be incurred by the state of Minnesota, and any tribal community, county, city, or township where used nuclear fuel is located following the cessation of operations at a nuclear plant.\n(b) To assist the commission in making the determination required in paragraph (a), the filing shall provide cost estimates, including ratepayer impacts, assuming used nuclear fuel will be stored in the state for 60 years, 100 years, and 200 years following the cessation of operation of the nuclear plant.\nA public utility filing a decommissioning plan in accordance with a commission order and this section may include, as part of a general rate case petition, the costs of decommissioning accrual incurred in complying with a commission order implementing this section.\nThe commission shall prepare a nuclear decommissioning report after each of the commission's periodic review of nuclear decommissioning costs. The report shall be submitted within 180 days of the date of the final order related to that review to the chairs and ranking minority members of the legislative committees with primary jurisdiction over energy policy and public safety. That report shall, without limitation, include the following:\n(1) an explanation of the commission's funding decisions regarding nuclear decommissioning;\n(2) the progress of the United States Department of Energy to remove from Minnesota spent fuel produced by nuclear generating plants in Minnesota;\n(3) an analysis of the financial and other obligations related to decommissioning and storage of used fuel of the utility holding title to spent nuclear fuel to the state and to host communities, including affected tribal communities; and\n(4) any recommendations to the legislature on legislation or other actions that may be necessary for addressing long-term or indefinite storage costs.",
	"repealed": false
}