{
	"id": "123B.75",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.75",
	"title": "123B.75 REVENUE; REPORTING.",
	"text": "District revenues must be recognized and reported on the district books of account in accordance with this section.\nFor the purposes of this section, \"school district tax settlement revenue\" means the current, delinquent, and manufactured home property tax receipts collected by the county and distributed to the school district.\nExcept as provided in this section, revenues must be recorded in a manner which clearly indicates that they are applicable to a specific accounting period and fund.\nReceivables must be recorded in a manner which clearly reflects the amounts of money due to a particular fund from public and private sources at the date of each accounting statement.\nAll current levies of local taxes, including portions assumed by the state, shall be recognized as receivable at the beginning of the calendar year during which collection normally takes place.\nTaconite revenue received in a calendar year by a school district under section 298.28, subdivisions 4, paragraphs (b) and (c), and 11, paragraph (d), is fully recognized in the fiscal year in which the February payment falls.\nFor fiscal year 2014 and later years, in June of each year, the school district must recognize as revenue, in the fund for which the levy was made, the lesser of:\n(1) the sum of May, June, and July school district tax settlement revenue received in that calendar year, plus general education aid according to section 126C.13, subdivision 4, received in July and August of that calendar year; or\n(2) the sum of:\n(i) 31 percent of the referendum levy certified according to section 126C.17 in calendar year 2000; plus\n(ii) the entire amount of the levy certified in the prior calendar year according to section 124D.4531; 124D.862, for Special School District No. 1, Minneapolis, Independent School District No. 625, St. Paul, and Independent School District No. 709, Duluth; 126C.41, subdivisions 1, 2, paragraph (a), and 3, paragraphs (b), (c), and (d); 126C.43, subdivision 2; and 126C.48, subdivision 6.\nState aids or grants, that are paid as a matching of an expenditure, shall be recognized as revenues and recorded as receivables in the fiscal year during which the eligible expenditure is recognized.\n[Repealed, 2013 c 116 art 7 s 23]\nIf the amount to be recognized as revenue under subdivision 5 exceeds the May, June, and July school district tax settlement revenue received in that calendar year, the district must recognize an amount of general education aid equal to the difference between the total amount to be recognized as revenue under subdivision 5, and the May, June, and July school district tax settlement revenue received in that calendar year as revenue in the previous fiscal year.\nOther revenues not specified in this section shall be recognized as revenue and shall be recorded in the fiscal year earned.\nDeviations from the principles set forth in this section must be evaluated and explained in footnotes to audited financial statements.\nThe commissioner shall specify the fiscal year or years to which the revenue from any aid or tax levy is applicable if Minnesota Statutes do not so specify. The commissioner must report to the chairs and ranking minority members of the house of representatives and senate committees with jurisdiction over education finance by January 15 of each year any adjustments under this subdivision in the previous year.\n(a) If money collected by an entity providing group insurance under section 471.6161, subdivision 1, for the payment of insurance premiums is above the cost of that coverage and returned to the school district purchasing that coverage as a refund, that school district must negotiate with the exclusive representative regarding the refund amount attributable to the proportionate number of insured lives covered by that exclusive representative.\n(b) If there is no exclusive representative or if the employer and the exclusive representative are unable to come to an agreement within 150 days, the remaining refunds shall be used to pay the full premium to the program for any employees not covered by an agreement negotiated under this section until the proportionate refunds are depleted. These refunds shall be used for a proportional premium payment at the time it is necessary to deplete the balance.",
	"repealed": false
}