{
	"id": "103D.331",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.331",
	"title": "103D.331 ADVISORY COMMITTEE.",
	"text": "The managers must annually appoint an advisory committee to advise and assist the managers on all matters affecting the interests of the watershed district and make recommendations to the managers on all contemplated projects and improvements in the watershed district.\nFor purposes of carrying out its duties under this section the advisory committee shall:\n(1) elect a chair from its membership;\n(2) elect a recorder from its membership;\n(3) establish a meeting schedule, which at a minimum meets annually;\n(4) consider issues pertinent to the functions and purposes of the watershed district;\n(5) review and comment on reports, minutes, activities, and proposed projects of the managers; and\n(6) report to the managers the general content of advisory committee meetings and resulting recommendations.\n(a) The advisory committee consists of at least five members. If practicable, the advisory committee members selected should include a representative from each soil and water conservation district, a representative of each county, a member of a sporting organization, a member of a farm organization, and a representative of each federally recognized Tribal government within the watershed district. Other advisory committee members may be appointed at the discretion of the managers. The members must be residents of the watershed district, except representatives from Tribal nations, soil and water conservation districts, and counties, and serve at the pleasure of the managers.\n(b) In addition, the managers may appoint other interested and technical persons who may or may not reside within the watershed district to serve at the pleasure of the managers.\nThe managers may reimburse members of the advisory committee for actual traveling and other necessary expenses incurred in the performance of duties in the amount as provided for state employees.",
	"repealed": false
}