{
	"id": "245.487",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.487",
	"title": "245.487 CITATION; DECLARATION OF POLICY; MISSION.",
	"text": "Sections 245.487 to 245.4889 may be cited as the \"Minnesota Comprehensive Children's Mental Health Act.\"\nThe legislature finds there is a need for further development of existing clinical services for emotionally disturbed children and their families and the creation of new services for this population. Although the services specified in sections 245.487 to 245.4889 are mental health services, sections 245.487 to 245.4889 emphasize the need for a child-oriented and family-oriented approach of therapeutic programming and the need for continuity of care with other community agencies. At the same time, sections 245.487 to 245.4889 emphasize the importance of developing special mental health expertise in children's mental health services because of the unique needs of this population.\nNothing in sections 245.487 to 245.4889 shall be construed to abridge the authority of the court to make dispositions under chapter 260, but the mental health services due any child with serious and persistent mental illness, as defined in section 245.462, subdivision 20, or with severe emotional disturbance, as defined in section 245.4871, subdivision 6, shall be made a part of any disposition affecting that child.\nAs part of the comprehensive children's mental health system established under sections 245.487 to 245.4889, the commissioner of human services shall create and ensure a unified, accountable, comprehensive children's mental health service system that is consistent with the provision of public social services for children and that:\n(1) identifies children who are eligible for mental health services;\n(2) makes preventive services available to all children;\n(3) assures access to a continuum of services that:\n(i) educate the community about the mental health needs of children;\n(ii) address the unique physical, emotional, social, and educational needs of children;\n(iii) are coordinated with the range of social and human services provided to children and their families by the Departments of Education, Human Services, Health, and Corrections;\n(iv) are appropriate to the developmental needs of children; and\n(v) are sensitive to cultural differences and special needs;\n(4) includes early screening and prompt intervention to:\n(i) identify and treat the mental health needs of children in the least restrictive setting appropriate to their needs; and\n(ii) prevent further deterioration;\n(5) provides mental health services to children and their families in the context in which the children live and go to school;\n(6) addresses the unique problems of paying for mental health services for children, including:\n(i) access to private insurance coverage; and\n(ii) public funding;\n(7) includes the child and the child's family in planning the child's program of mental health services, unless clinically inappropriate to the child's needs; and\n(8) when necessary, assures a smooth transition from mental health services appropriate for a child to mental health services needed by a person who is at least 18 years of age.\n[Repealed, 2014 c 262 art 3 s 18]\n[Repealed, 2014 c 262 art 3 s 18]\nThe commissioner shall seek and apply for federal and other nonstate, nonlocal government funding for mental health services specified in sections 245.487 to 245.4889, in order to maximize nonstate, nonlocal dollars for these services.\nBy July 1, 2013, the commissioner of human services shall develop a list of diagnostic codes to define the range of child and adult mental illnesses for the statewide mental health system. The commissioner may use the International Classification of Diseases (ICD); the American Psychiatric Association's Diagnostic and Statistical Manual (DSM); or a combination of both to develop the list. The commissioner shall establish an advisory committee, comprising mental health professional associations, counties, tribes, managed care organizations, state agencies, and consumer organizations that shall advise the commissioner regarding development of the diagnostic codes list. The commissioner shall annually notify providers of changes to the list.",
	"repealed": false
}