{
	"id": "90.145",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.145",
	"title": "90.145 PURCHASER QUALIFICATIONS, REGISTRATION, AND REQUIREMENTS.",
	"text": "(a) In addition to any other requirements imposed by this chapter, the purchaser of a state timber permit issued under section 90.151 must meet the requirements in paragraphs (b) to (e).\n(b) The purchaser or the purchaser's agents, employees, subcontractors, and assigns conducting logging operations on the timber permit must comply with general industry safety standards for logging adopted by the commissioner of labor and industry under chapter 182. The commissioner of natural resources may require a purchaser to provide proof of compliance with the general industry safety standards.\n(c) The purchaser or the purchaser's agents, subcontractors, and assigns conducting logging operations on the timber permit must comply with the mandatory insurance requirements of chapter 176. The commissioner may require a purchaser to provide a copy of the proof of insurance required by section 176.130 before the start of harvesting operations on any permit.\n(d) Before the start of harvesting operations on any permit, the purchaser must certify that a foreperson or other designated employee who has a current certificate of completion, which includes instruction in site-level forest management guidelines or best management practices, from the Minnesota Logger Education Program (MLEP), the Wisconsin Forest Industry Safety and Training Alliance (FISTA), or any similar continuous education program acceptable to the commissioner, is supervising active logging operations.\n(e) The purchaser and the purchaser's agents, employees, subcontractors, and assigns who will be involved with logging or scaling state timber must be in compliance with this chapter.\nTo facilitate the sale of permits issued under section 90.151, the commissioner may establish a registration system to verify the qualifications of a person or affiliate as a responsible bidder to purchase a timber permit. Any system implemented by the commissioner shall be limited in scope to only that information that is required for the efficient administration of the purchaser qualification requirements of this chapter. The registration system established under this subdivision is not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply.",
	"repealed": false
}