{
	"id": "256S.212",
	"url": "https://www.revisor.mn.gov/statutes/cite/256S.212",
	"title": "256S.212 RATE SETTING; BASE WAGE INDEX.",
	"text": "If any of the SOC codes and positions used in this section are no longer available, the commissioner shall, in consultation with stakeholders, select a new SOC code and position that is the closest match to the previously used SOC position.\nFor customized living and foster care component services, the home management and support services base wage equals 33.33 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aide (SOC code 31-1120); 33.33 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for food preparation workers (SOC code 35-2021); and 33.34 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for maids and housekeeping cleaners (SOC code 37-2012).\nFor customized living and foster care component services, the home care aide base wage equals 75 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120); and 25 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for nursing assistants (SOC code 31-1131).\nFor customized living and foster care component services, the home health aide base wage equals 33.33 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for licensed practical and licensed vocational nurses (SOC code 29-2061); 33.33 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for nursing assistants (SOC code 31-1131); and 33.34 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120).\nFor customized living and foster care component services, the medication setups by licensed nurse base wage equals 25 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for licensed practical and licensed vocational nurses (SOC code 29-2061); and 75 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for registered nurses (SOC code 29-1141).\nThe chore services base wage equals 50 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for landscaping and groundskeeping workers (SOC code 37-3011); and 50 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for maids and housekeeping cleaners (SOC code 37-2012).\nThe companion services base wage equals 80 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120); and 20 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for maids and housekeeping cleaners (SOC code 37-2012).\nThe homemaker assistance with personal care base wage equals 50 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120); and 50 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for nursing assistants (SOC code 31-1131).\nThe homemaker cleaning base wage equals 100 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for maids and housekeeping cleaners (SOC code 37-2012).\nThe homemaker home management base wage equals 50 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120); and 50 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for nursing assistants (SOC code 31-1131).\nThe in-home respite care services base wage equals 15 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for registered nurses (SOC code 29-1141); 75 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120); and ten percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for licensed practical and licensed vocational nurses (SOC code 29-2061).\nThe out-of-home respite care services base wage equals 15 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for registered nurses (SOC code 29-1141); 75 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120); and ten percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for licensed practical and licensed vocational nurses (SOC code 29-2061).\nThe individual community living support base wage equals 60 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for social and human services assistants (SOC code 21-1093); and 40 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for nursing assistants (SOC code 31-1131).\nThe registered nurse base wage equals 100 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for registered nurses (SOC code 29-1141).\nThe unlicensed supervisor base wage equals 100 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for first-line supervisors of personal service workers (SOC code 39-1022).\nThe adult day services base wage equals 75 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for home health and personal care aides (SOC code 31-1120); and 25 percent of the Minneapolis-St. Paul-Bloomington, MN-WI MetroSA average wage for nursing assistants (SOC code 31-1131).",
	"repealed": false
}