{
	"id": "477A.011",
	"url": "https://www.revisor.mn.gov/statutes/cite/477A.011",
	"title": "477A.011 DEFINITIONS.",
	"text": "For the purposes of sections 477A.011 to 477A.014 the following terms shall have these meanings, unless otherwise provided to the contrary.\n\"City\" means a statutory or home rule charter city.\n\"Town\" means a township.\nMS 1994 [Repealed, 1996 c 310 s 1]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\n\"Population\" means the population estimated or established as of July 15 in an aid calculation year by the most recent federal census, by a special census conducted under contract with the United States Bureau of the Census, by a population estimate made by the Metropolitan Council pursuant to section 473.24, or by a population estimate of the state demographer made pursuant to section 4A.02, whichever is the most recent as to the stated date of the count or estimate for the preceding calendar year, and which has been certified to the commissioner of revenue on or before July 15 of the aid calculation year. The term \"per capita\" refers to population as defined by this subdivision. A revision of an estimate or count is effective for these purposes only if it is certified to the commissioner on or before July 15 of the aid calculation year. Clerical errors in the certification or use of the estimates and counts established as of July 15 in the aid calculation year are subject to correction within the time periods allowed under section 477A.014.\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\n\"Population age 65 and over\" means the population age 65 and over established as of July 15 in an aid calculation year by the most recent federal census, by a special census conducted under contract with the United States Bureau of the Census, by a population estimate made by the Metropolitan Council, or by a population estimate of the state demographer made pursuant to section 4A.02, whichever is the most recent as to the stated date of the count or estimate for the preceding calendar year and which has been certified to the commissioner of revenue on or before July 15 of the aid calculation year. A revision to an estimate or count is effective for these purposes only if certified to the commissioner on or before July 15 of the aid calculation year. Clerical errors in the certification or use of estimates and counts established as of July 15 in the aid calculation year are subject to correction within the time periods allowed under section 477A.014.\n\"Transformed population\" means the logarithm to the base 10 of the population.\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1987 Supp [Repealed, 1988 c 719 art 5 s 81]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1982 [Repealed, 1983 c 342 art 5 s 16]\nMS 1982 [Repealed, 1983 c 342 art 5 s 16]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1986 [Repealed, 1988 c 719 art 5 s 81]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\n\"City net tax capacity\" means the city's adjusted net tax capacity under section 273.1325.\nMS 2012 [Repealed, 2013 c 143 art 14 s 111]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1988 [Repealed, 1Sp1989 c 1 art 4 s 15]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\nMS 1992 [Repealed, 1993 c 375 art 4 s 21]\n\"Revenue base\" means the amount levied for taxes payable in the previous year, including the levy on the fiscal disparity distribution under section 276A.06, subdivision 3, clause (1), or 473F.08, subdivision 3, paragraph (a); plus the originally certified local government aid in the previous year under sections 477A.011 and 477A.013; and the taconite aids received in the previous year under sections 298.28 and 298.282.\nMS 2006 [Repealed, 2007 c 13 art 2 s 13]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\n(a) Except as provided in paragraph (b), \"pre-1940 housing percentage\" for a city is 100 times the most recent count by the United States Bureau of the Census of all housing units in the city built before 1940, divided by the total number of all housing units in the city. Housing units includes both occupied and vacant housing units as defined by the federal census.\n(b) For the city of East Grand Forks only, \"pre-1940 housing percentage\" is equal to 100 times the 1990 federal census count of all housing units in the city built before 1940, divided by the most recent count by the United States Bureau of the Census of all housing units in the city. Housing units includes both occupied and vacant housing units as defined by the federal census.\nMS 2022 [Repealed, 2023 c 64 art 4 s 33]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\n(a) For a city with a population equal to or greater than 10,000, \"city revenue need\" is 1.15 times the sum of (1) 8.572 times the pre-1940 housing percentage; plus (2) 11.494 times the city age index; plus (3) 5.719 times the commercial industrial utility percentage; plus (4) 9.484 times peak population decline; plus (5) 293.056.\n(b) For a city with a population equal to or greater than 2,500 and less than 10,000, \"city revenue need\" is 1.15 times the sum of (1) 497.308; plus (2) 6.667 times the pre-1940 housing percentage; plus (3) 9.215 times the commercial industrial utility percentage; plus (4) 16.081 times peak population decline.\n(c) For a city with a population less than 2,500, \"city revenue need\" is the sum of (1) 196.487; plus (2) 220.877 times the city's transformed population.\n(d) For a city with a population of at least 2,500 but less than 3,000, the \"city revenue need\" equals (1) the transition factor times the city's revenue need calculated in paragraph (b); plus (2) the city's revenue need calculated under the formula in paragraph (c) times the difference between one and the transition factor. For a city with a population of at least 10,000 but less than 11,000, the \"city revenue need\" equals (1) the transition factor times the city's revenue need calculated in paragraph (a); plus (2) the city's revenue need calculated under the formula in paragraph (b) times the difference between one and the transition factor. For purposes of the first sentence of this paragraph \"transition factor\" is 0.2 percent times the amount that the city's population exceeds the minimum threshold. For purposes of the second sentence of this paragraph, \"transition factor\" is 0.1 percent times the amount that the city's population exceeds the minimum threshold.\n(e) The city revenue need cannot be less than zero.\n(f) For calendar year 2024 and subsequent years, the city revenue need for a city, as determined in paragraphs (a) to (e), is multiplied by the ratio of the annual implicit price deflator for government consumption expenditures and gross investment for state and local governments as prepared by the United States Department of Commerce, for the most recently available year to the 2022 implicit price deflator for state and local government purchases.\n\"Tax effort rate\" means the net levy for all cities divided by the sum of the city net tax capacity for all cities. For purposes of this section, \"net levy\" means the city levy, after all adjustments, used for calculating the local tax rate under section 275.08 for taxes payable in the year prior to the aid distribution. The fiscal disparity distribution levy under chapter 276A or 473F is included in net levy.\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2002 [Repealed, 1Sp2003 c 21 art 5 s 14]\nMS 2022 [Repealed, 2023 c 64 art 4 s 33]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2012 [Repealed, 2013 c 143 art 2 s 36]\nMS 2022 [Repealed, 2023 c 64 art 4 s 33]\n\"Unmet need\" for a city is equal to the difference between (1) its city revenue need multiplied by its population, and (2) its city net tax capacity multiplied by the tax effort rate.\n\"Peak population decline\" is equal to 100 times the difference between one and the ratio of the city's current population, to the highest city population reported in a federal census from the 1970 census or later. \"Peak population decline\" shall not be less than zero.\nMS 2022 [Repealed, 2023 c 64 art 4 s 33]\n\"City age index\" means 100 times the ratio of (1) the population age 65 and over within the city, to (2) the population of the city.\nThe \"commercial industrial utility percentage\" for a city is 100 times the ratio of (1) the sum of the estimated market values of all real and personal property in the city classified as class 3 under section 273.13, subdivision 24, to (2) the total market value of all taxable real and personal property in the city. The market values are the amounts computed before any adjustments for fiscal disparities under section 276A.06 or 473F.08. The market values used for this subdivision are not equalized.",
	"repealed": false
}