{
	"id": "401.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/401.06",
	"title": "401.06 COMPREHENSIVE PLAN; STANDARDS OF ELIGIBILITY; COMPLIANCE.",
	"text": "(a) A county or Tribal Nation is ineligible for its calculated subsidy under section 401.10 unless its comprehensive plan has been approved by the commissioner.\n(b) A non-CCA jurisdiction providing adult misdemeanant and juvenile probation services to district courts according to section 244.19, subdivision 1b, paragraph (b) or (c), must develop a comprehensive plan in consultation with the commissioner. To the extent consistent with this chapter and section 244.19, a non-CCA jurisdiction under this paragraph is subject to all the subsidy-related standards and requirements under this chapter and to all supervision standards and commissioner-prescribed policies.\n(c) If the commissioner provides probation services to a non-CCA jurisdiction under section 244.19, subdivision 1b, paragraph (d), the commissioner must prepare a comprehensive plan for the non-CCA jurisdiction and present it to the local county board of commissioners or Tribal government. To the extent consistent with this chapter and section 244.19, the commissioner is subject to all the subsidy-related standards and requirements under this chapter and to all supervision standards and commissioner-prescribed policies.\n(d) All comprehensive plans must:\n(1) comply with commissioner-developed standards and reporting requirements, including requirements under section 401.11, subdivision 1;\n(2) provide a budget for planned correctional services and programming; and\n(3) sufficiently address community needs and supervision standards, including strategic planning that ties planned correctional services and programming to successful community supervision outcomes, including but not limited to reducing an individual's assessed level of risk for recidivism and addressing an individual's needs that lead to positive adjustment and prosocial behavior.\n(e) Each CCA and non-CCA jurisdiction must track and report on the use of correctional fees under section 244.18 in their comprehensive plans. At a minimum, each jurisdiction must report on the types of correctional services for which fees were imposed, the aggregate amount of fees imposed, and the amount of fees collected.\n(f) A comprehensive plan is valid for four years, and a corrections advisory board or non-CCA jurisdiction must review and update its plan two years after the plan has been approved or two years after submission to the commissioner, whichever is earlier. An updated plan must include an updated budget and list which services that a county or Tribal Nation plans to provide before its next four-year comprehensive plan.\n(g) All approved comprehensive plans, including updated plans, must be made publicly available on the Department of Corrections website.\nThe commissioner must, in accordance with the Administrative Procedure Act, adopt rules establishing standards of eligibility for counties and Tribal Nations to receive a subsidy and other funds under this chapter.\n(a) To remain eligible for the subsidy, a CCA and non-CCA jurisdiction must maintain substantial compliance with the minimum standards, as applicable, established according to this chapter and the policies and procedures governing the services under section 401.025, subdivision 3, as prescribed by the commissioner.\n(b) A CCA and non-CCA jurisdiction must:\n(1) be in substantial compliance with other correctional operating standards permitted by law and established by the commissioner; and\n(2) report data required by the commissioner in accordance with section 244.21, including but not limited to data under this chapter and information on individuals convicted as an extended jurisdiction juvenile under section 241.016, subdivision 1, paragraph (c).\n(a) The commissioner must review all comprehensive plans, including the facilities and programs operated under the plans. The commissioner may enter any facility operated under the plan and inspect books and records for purposes of recommending needed changes or improvements.\n(b) If the commissioner determines that there are reasonable grounds to believe that a CCA or non-CCA jurisdiction is not in substantial compliance with minimum standards, the commissioner must provide at least 30 days' notice to the CCA or non-CCA jurisdiction of a commissioner-conducted hearing to ascertain whether there is substantial compliance or satisfactory progress being made toward compliance.\n(a) After a hearing, the commissioner may sanction a CCA or non-CCA jurisdiction according to this subdivision if the commissioner determines that the CCA or non-CCA jurisdiction is not maintaining substantial compliance with minimum standards or that satisfactory progress toward compliance has not been made.\n(b) The commissioner may:\n(1) suspend all or a portion of any subsidy without issuing a corrective action plan; or\n(2) issue a corrective action plan.\n(c) A corrective action plan must:\n(1) be in writing;\n(2) identify all deficiencies;\n(3) detail the corrective action required to remedy the deficiencies; and\n(4) provide a deadline to:\n(i) correct each deficiency; and\n(ii) report to the commissioner progress toward correcting the deficiency.\n(d) After the deficiency has been corrected, documentation must be submitted to the commissioner detailing compliance with the corrective action plan. If the commissioner determines that the CCA or non-CCA jurisdiction has not complied with the plan, the commissioner may suspend all or a portion of the subsidy.",
	"repealed": false
}