{
	"id": "125A.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/125A.32",
	"title": "125A.32 INDIVIDUALIZED FAMILY SERVICE PLAN (IFSP).",
	"text": "(a) A team must participate in IFSP meetings to develop the IFSP. The team shall include:\n(1) a parent or parents of the child, as defined in Code of Federal Regulations, title 34, section 303.27;\n(2) other family members, as requested by the parent, if feasible to do so;\n(3) an advocate or person outside of the family, if the parent requests that the person participate;\n(4) the service coordinator who has been working with the family since the initial referral, or who has been designated by the public agency to be responsible for implementation of the IFSP and coordination with other agencies including transition services;\n(5) a person or persons involved in conducting evaluations and assessments; and\n(6) as appropriate, persons who will be providing early intervention services under the plan to the child or family.\n(b) The IFSP must include:\n(1) information about the child's developmental status;\n(2) family information, with the consent of the family;\n(3) measurable results or major outcomes expected to be achieved by the child with the family's assistance, that include developmentally appropriate preliteracy and language skills for the child, and the criteria, procedures, and timelines;\n(4) specific early intervention services based on peer-reviewed research, to the extent practicable, necessary to meet the unique needs of the child and the family to achieve the outcomes;\n(5) payment arrangements, if any;\n(6) medical and other services that the child needs, but that are not required under the Individual with Disabilities Education Act, United States Code, title 20, section 1471 et seq. (Part C, Public Law 108-446) including funding sources to be used in paying for those services and the steps that will be taken to secure those services through public or private sources;\n(7) dates and duration of early intervention services;\n(8) name of the service coordinator;\n(9) steps to be taken to support a child's transition from infant and toddler intervention services to other appropriate services, including convening a transition conference at least 90 days or, at the discretion of all parties, not more than nine months before the child is eligible for preschool services; and\n(10) authorized signatures of the agencies responsible for providing, paying for, or facilitating payment, or any combination of these, for infant and toddler intervention services.",
	"repealed": false
}