{
	"id": "62Q.473",
	"url": "https://www.revisor.mn.gov/statutes/cite/62Q.473",
	"title": "62Q.473 BIOMARKER TESTING.",
	"text": "(a) For the purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Biomarker\" means a characteristic that is objectively measured and evaluated as an indicator of normal biological processes, pathogenic processes, or pharmacologic responses to a specific therapeutic intervention, including but not limited to known gene-drug interactions for medications being considered for use or already being administered. Biomarkers include but are not limited to gene mutations, characteristics of genes, or protein expression.\n(c) \"Biomarker testing\" means the analysis of an individual's tissue, blood, or other biospecimen for the presence of a biomarker. Biomarker testing includes but is not limited to single-analyst tests; multiplex panel tests; protein expression; and whole exome, whole genome, and whole transcriptome sequencing.\n(d) \"Clinical utility\" means a test provides information that is used to formulate a treatment or monitoring strategy that informs a patient's outcome and impacts the clinical decision. The most appropriate test may include information that is actionable and some information that cannot be immediately used to formulate a clinical decision.\n(e) \"Consensus statement\" means a statement that: (1) describes optimal clinical care outcomes, based on the best available evidence, for a specific clinical circumstance; and (2) is developed by an independent, multidisciplinary panel of experts that: (i) uses a rigorous and validated development process that includes a transparent methodology and reporting structure; and (ii) strictly adheres to the panel's conflict of interest policy.\n(f) \"Nationally recognized clinical practice guideline\" means an evidence-based clinical practice guideline that: (1) establishes a standard of care informed by: (i) a systematic review of evidence; and (ii) an assessment of the risks and benefits of alternative care options; and (2) is developed by an independent organization or medical professional society that: (i) uses a transparent methodology and reporting structure; and (ii) adheres to a conflict of interest policy. Nationally recognized clinical practice guideline includes recommendations to optimize patient care.\n(a) A health plan must provide coverage for biomarker testing to diagnose, treat, manage, and monitor illness or disease if the test provides clinical utility. For purposes of this section, a test's clinical utility may be demonstrated by medical and scientific evidence, including but not limited to:\n(1) nationally recognized clinical practice guidelines as defined in this section;\n(2) consensus statements as defined in this section;\n(3) labeled indications for a United States Food and Drug Administration (FDA) approved or FDA-cleared test, indicated tests for an FDA-approved drug, or adherence to warnings and precautions on FDA-approved drug labels; or\n(4) Centers for Medicare and Medicaid Services national coverage determinations or Medicare Administrative Contractor local coverage determinations.\n(b) Coverage under this section must be provided in a manner that limits disruption of care, including the need for multiple biopsies or biospecimen samples.\n(c) Nothing in this section prohibits a health plan company from requiring a prior authorization or imposing other utilization controls when approving coverage for biomarker testing.\n(a) The commissioner of commerce must reimburse health plan companies for coverage under this section. Reimbursement is available only for coverage that would not have been provided by the health plan without the requirements of this section. Treatments and services covered by the health plan as of January 1, 2023, are ineligible for payment under this subdivision by the commissioner of commerce.\n(b) Health plan companies must report to the commissioner of commerce quantified costs attributable to the additional benefit under this section in a format developed by the commissioner. A health plan's coverage as of January 1, 2023, must be used by the health plan company as the basis for determining whether coverage would not have been provided by the health plan for purposes of this subdivision.\n(c) The commissioner of commerce must evaluate submissions and make payments to health plan companies as provided in Code of Federal Regulations, title 45, section 155.170.\nEach fiscal year, an amount necessary to make payments to health plan companies to defray the cost of providing coverage under this section is appropriated to the commissioner of commerce.",
	"repealed": false
}