{
	"id": "15B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/15B.02",
	"title": "15B.02 BOUNDARY OF CAPITOL AREA.",
	"text": "(a) The Capitol Area is that part of the city of St. Paul inside the boundary described in paragraph (b).\n(b)(1) Beginning at the point of intersection of the center line of Pennsylvania Avenue and the center line of Marion Street;\n(2) then go southerly along the center line of Marion Street and its extension to a point 50 feet southerly of the south curb of Concordia Avenue;\n(3) then, southeasterly along a line 50 feet southerly of, and parallel with, the south curb of Concordia Avenue to a point 125 feet westerly of the west curb of southbound John Ireland Boulevard;\n(4) then, southwesterly along a line 125 feet westerly of, and parallel with, the west curb of southbound John Ireland Boulevard to the south curb of Dayton Avenue;\n(5) then, easterly along the south curb of Dayton Avenue to the west curb of southbound John Ireland Boulevard;\n(6) then, northeasterly in a straight line to the intersection of the center line of Old Kellogg Boulevard and the center line of Summit Avenue;\n(7) then, northeasterly along the center line of Summit Avenue to the center line of eastbound new West Kellogg Boulevard;\n(8) then, southeasterly along the center line of eastbound and then, southbound new West Kellogg Boulevard to the easterly right-of-way line of Interstate Highway 35-E;\n(9) then, northeasterly along the easterly right-of-way line of Interstate Highway 35-E to the southerly right-of-way line of Interstate Highway 94;\n(10) then, easterly along the southerly right-of-way line of Interstate Highway 94 to the west curb of St. Peter Street;\n(11) then, southeasterly along the west curb of St. Peter Street to the south curb of Exchange Street;\n(12) then, northeasterly along the south curb of Exchange Street to the west curb of Cedar Street;\n(13) then, northwesterly along the west curb of Cedar Street to the center line of Tenth Street;\n(14) then, northeasterly along the center line of Tenth Street to the center line of Minnesota Street;\n(15) then, northwesterly along the center line of Minnesota Street to the center line of Eleventh Street;\n(16) then, northeasterly along the center line of Eleventh Street to the center line of Jackson Street;\n(17) then, northerly along the center line of Jackson Street to the center line of Pennsylvania Avenue;\n(18) then, westerly along the center line of Pennsylvania Avenue and its extension to the point of beginning.",
	"repealed": false
}