{
	"id": "270C.63",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.63",
	"title": "270C.63 LIEN FOR TAXES.",
	"text": "Tax, and interest and penalties imposed with respect thereto, including any recording fees, sheriff fees, or court costs that may accrue, shall become a lien upon all the property within this state, both real and personal, of the person liable for the payment or collection of the tax, except property exempt under subdivision 8, from and after the date of assessment of the tax.\nThe lien imposed by subdivision 1 is not enforceable against any purchaser, mortgagee, pledgee, holder of a Uniform Commercial Code security interest, mechanic's lienor, or judgment lien creditor whose interest has been duly perfected or is a conveyance or interest entitled to protection against judgments and attachments under section 507.34 or under any other applicable provisions of state law, until a notice of lien has been filed by the commissioner in the office of the county recorder of the county in which real property is situated, or in the case of personal property in the Office of the Secretary of State.\nNotices of liens, and lien releases, transcriptions, and renewals, in a form prescribed by the commissioner, may be filed with the county recorder or the secretary of state by mail, personal delivery, or by electronic transmission by the commissioner or an agent of the department into the computerized filing system of the secretary of state. The secretary of state shall transmit the notice electronically to the office of the county recorder, if that is the place of filing, in the county or counties shown on the computer entry. The filing officer, whether the county recorder or the secretary of state, shall endorse and index a printout of the notice in the same manner as if the notice had been mailed or delivered.\nCounty recorders and the secretary of state shall enter information relative to lien notices, transcriptions, renewals, and releases filed in their offices into the central database of the secretary of state. For notices filed electronically with the county recorders, the date and time of transmission of the notice and county recorder's file number, and for notices filed electronically with the secretary of state, the secretary of state's recording information, must be entered by the filing officer into the central database before the close of the working day following the day of the original data entry by the department. For notices filed electronically with the county recorder, the date and time of filing is no later than 5:00 p.m. on the business day following transmission of the notice by the secretary of state.\nThe filing and indexing of all notices must be in accordance with the filing and indexing of notices of federal liens, certificates of release, and refiled notices under section 272.483.\nNotwithstanding any other law to the contrary, the department is exempt from payment of fees when a lien, lien renewal, or lien transcription is offered for recording. The recording fees must be paid along with the release fee at the end of the month in which the release of lien is recorded, after receipt of a monthly statement from a county recorder or the secretary of state. The department shall add the recording fees to the delinquent tax liability of the taxpayer. Notwithstanding any other law to the contrary, the fee for filing or recording a notice of lien, or lien release, transcription, or renewal is $15.\nThere is appropriated to the commissioner an amount representing the cost of payment of recording fees to the county recorders and the secretary of state. The commissioner shall keep a separate accounting of the costs and of payments for recording fees remitted by taxpayers, and make the records available to the legislature upon request.\nThe lien imposed on personal property by this section, even though properly filed, is not enforceable: (1) against a purchaser with respect to tangible personal property purchased at retail in the ordinary course of the seller's trade or business, unless at the time of purchase the purchaser intends the purchase to or knows the purchase will hinder, evade, or defeat the collection of a tax; or (2) against the personal property listed as exempt in (i) Minnesota Statutes 2022, section 550.37, and (ii) sections 550.38 and 550.39.\nThe lien imposed by this section shall, notwithstanding any other provision of law to the contrary, be enforceable from the time the lien arises and for ten years from the date of filing the notice of lien, which must be filed by the commissioner within five years after the date of assessment of the tax or final administrative or judicial determination of the assessment. A notice of lien filed at the Office of the Secretary of State may be transcribed to any county within ten years after the date of its filing, but the transcription does not extend the period during which the lien is enforceable. A notice of lien filed in one county may be transcribed to the secretary of state or to any other county within ten years after the date of its filing, but the transcription shall not extend the period during which the lien is enforceable. A notice of lien may be renewed by the commissioner before the expiration of the ten-year period for an additional ten years. The taxpayer must receive written notice of the renewal.\nThe lien imposed by this section shall be enforceable by levy as authorized in section 270C.67, or by judgment lien foreclosure as authorized in chapter 550.\nIn the case of a mortgage foreclosure upon real property commenced under chapter 580, or a termination of contract of sale of real property commenced under section 559.21, if the commissioner has filed a lien under this section before the foreclosure sale or date of termination, notice of the mortgage foreclosure or termination of contract of sale shall be mailed to the commissioner not less than 25 days prior to the foreclosure sale or date of termination. Provided, notice need not be given pursuant to this subdivision if the lien of the commissioner has been filed within 30 days or less prior to the foreclosure sale or date of termination. The notice must contain the following information: (1) the name and address of the taxpayer; (2) a copy of the notice of mortgage foreclosure or contract for deed cancellation; (3) a copy of the lien filed by the commissioner; (4) the total unpaid balance of the mortgage or contract for deed; (5) a legal description of the property; and (6) the fair market value of the property.\nExecution of notices of liens or of other notices affecting state tax liens by the original or facsimile signature of the commissioner entitles them to be filed, and no other attestation, certification, or acknowledgment is necessary. For purposes of this subdivision, transmission of notices under subdivision 3 constitutes execution.\nUpon request of any person, the filing officer shall issue a certificate showing whether there is recorded in that filing office, on the date and hour stated in the certificate, any notice of lien or certificate or notice affecting any lien filed on or after ten years before the date of the search certificate, naming a particular person, and giving the date and hour of filing of each notice or certificate naming the person. The fee for a certificate shall be as provided by section 336.9-525 or 357.18, subdivision 1, clause (3). Upon request, the filing officer shall furnish a copy of any notice of state lien, or notice or certificate affecting a state lien, for a fee of $1 per page, except that after the effective date of Laws 2009, chapter 101, article 2, section 11, that section shall govern the fee charged by the secretary of state for a copy or electronically transmitted image.\nA lien imposed under this section upon property defined as homestead property in sections 510.01 and 510.02 may not be enforced against homestead property by levy under section 270C.67, or by judgment lien foreclosure under chapter 550, but notwithstanding section 510.07, is enforceable against the proceeds from the sale, conveyance, or transfer of the homestead.\nAfter the filing of a notice of lien under this section on the property or rights to property of a person, the person may appeal to the commissioner, in the form and at the time prescribed by the commissioner, alleging an error in the filing of the lien and requesting its release. If the commissioner determines that the filing of the notice of any lien was erroneous, within 14 days after the determination, the commissioner must issue a certificate of release of the lien. The certificate must include a statement that the filing of the lien was erroneous. In the event that the lien is erroneous and is not released within the 14-day period, reasonable attorney fees shall be paid. Damages must be paid in accordance with section 3.736, subdivision 7. Even if a lien is not erroneous, the commissioner may withdraw the lien if the filing of the lien was premature or not in accordance with administrative procedures of the commissioner, or withdrawal of the lien will facilitate the collection of the tax liability.\nA fee of $25 must be paid to the commissioner for each duplicate of an original release of lien.\nA notice of tax lien filed under this section has priority over a security interest arising under article 9 of the Uniform Commercial Code that is perfected before the date of filing of the lien imposed by this section, but only if:\n(1) the perfected security interest secures property acquired by the taxpayer or advances made by the secured party after the notice of tax lien is filed; and\n(2) the property is acquired or the advance is made after the 45th day following the day on which the notice of tax lien is filed, or after the secured party has actual notice or knowledge of the tax lien filing, whichever is earlier.\nWhen a lien is filed with a county recorder under subdivisions 2 to 5, the county recorder shall search the registered land records in that county and cause the lien to be memorialized on every certificate of title or certificate of possessory title of registered land in that county which can be reasonably identified as owned by the taxpayer who is named on the lien. The fees for memorializing the lien shall be paid in the manner prescribed by subdivision 6. The county recorders, and their employees and agents, shall not be liable for any loss or damages arising from failure to identify a parcel of registered land owned by the taxpayer who is named on the lien.\nThe commissioner may sell and assign to a third party the right of redemption in specific real property for liens filed under this section. The redemption in the hands of the assignee shall not be enforceable by any of the collection remedies provided to the commissioner by law. The assignee is limited to the same rights of redemption the commissioner would have in any mortgage foreclosure proceeding, but in any bankruptcy proceeding does not obtain the priority of the commissioner as a tax claimant. Should the taxpayer or its assigns exercise the right of redemption the assignment by the commissioner is extinguished.\nAny lien imposed under this section attaches to the proceeds of property with the same priority that the lien has with respect to the property itself. \"Proceeds of property\" means proceeds from the sale, lease, license, exchange, or other disposition of the property, including insurance proceeds arising from the loss or destruction of the property.",
	"repealed": false
}