{
	"id": "145.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.32",
	"title": "145.32 OLD RECORDS MAY BE DESTROYED.",
	"text": "The superintendent or other chief administrative officer of any public or private hospital, by and with the consent and approval of the board of directors or other governing body of the hospital, may divest the files and records of that hospital of any individual case records and, with that consent and approval, may destroy the records. The records shall first have been transferred and recorded as authorized in section 145.30.\nPortions of individual hospital medical records that comprise an individual permanent medical record, as defined by the commissioner of health, shall be retained as authorized in section 145.30. Other portions of the individual medical record, including any miscellaneous documents, papers, and correspondence in connection with them, may be divested and destroyed after seven years without transfer to photographic film, electronic image, or other state-of-the-art electronic preservation technology.\nAll portions of individual hospital medical records of minors shall be maintained for seven years or until the individual reaches the age of majority, whichever occurs last, at which time the individual may request that the patient's hospital records be destroyed, unless the hospital is required to retain the records as part of the individual's permanent medical record as defined in accordance with subdivision 2.\nNothing in this section shall be construed to prohibit the retention of hospital medical records beyond the periods described in this section. Nor shall anything in this section be construed to prohibit patient access to hospital medical records as provided in sections 144.291 to 144.298.\n(a) The commissioner of health shall define by rule the term \"individual permanent medical record\" by enumerating the specific types of records or other information that, at a minimum, must be maintained on a permanent basis by the hospital.\n(b) \"Individual permanent medical record\" includes outpatient diagnostic and laboratory test results.",
	"repealed": false
}