{
	"id": "41A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/41A.17",
	"title": "41A.17 RENEWABLE CHEMICAL PRODUCTION INCENTIVE.",
	"text": "(a) A facility eligible for payment under this section must source from Minnesota at least 80 percent of the biomass used to produce a renewable chemical, except that, if a facility is sited 50 miles or less from the state border, biomass used to produce a renewable chemical may be sourced from outside of Minnesota, but only if at least 80 percent of the biomass is sourced from within a 100-mile radius of the facility or from within Minnesota. The facility must be located in Minnesota, must begin production at a specific location on or before April 1, 2023, and must not begin production of 250,000 pounds of chemicals quarterly before January 1, 2015. Eligible facilities include existing companies and facilities that are adding production capacity, or retrofitting existing capacity, as well as new companies and facilities. Eligible renewable chemical facilities must produce at least 250,000 pounds of renewable chemicals quarterly. Renewable chemicals produced through processes that are fully commercial before January 1, 2000, are not eligible.\n(b) No payments shall be made for renewable chemical production that occurs after June 30, 2035, for those eligible renewable chemical producers under paragraph (a).\n(c) An eligible producer of renewable chemicals shall not transfer the producer's eligibility for payments under this section to a renewable chemical facility at a different location.\n(d) A producer that ceases production for any reason is ineligible to receive payments under this section until the producer resumes production.\n(e) Advanced biofuel production for which payment has been received under section 41A.16, and biomass thermal production for which payment has been received under section 41A.18, are not eligible for payment under this section.\n(a) The commissioner shall make payments to eligible producers of renewable chemicals located in the state. The amount of the payment for each producer's annual production is $0.03 per pound of sugar-derived renewable chemical, $0.03 per pound of cellulosic sugar, starch, oil, or animal fat, and $0.06 per pound of cellulosic-derived renewable chemical produced at a specific location for ten years after the start of production.\n(b) An eligible facility producing renewable chemicals using agricultural cellulosic biomass is eligible for a 20 percent bonus payment for each pound produced from agricultural biomass that is derived from perennial crop or cover crop biomass.\n(c) Total payments under this section to an eligible renewable chemical producer in a fiscal year may not exceed the amount necessary for 99,999,999 pounds of renewable chemical production. Total payments under this section to all eligible renewable chemical producers in a fiscal year may not exceed the amount necessary for 599,999,999 pounds of renewable chemical production. If the total amount for which all producers are eligible in a quarter exceeds the amount available for payments, the commissioner shall make the payments on a pro rata basis.\n(d) An eligible facility may blend renewable chemicals with other chemicals that are not renewable chemicals, but only the percentage attributable to renewable chemicals in the blended product is eligible to receive payment.\n(e) For purposes of this section, an entity that holds a controlling interest in more than one renewable chemical production facility is considered a single eligible producer.\nAll forestry-derived cellulosic biomass used for renewable chemical production must be produced using Minnesota forest biomass harvesting guidelines or the equivalent. All cellulosic biomass from brushlands must be produced using Minnesota brushland biomass harvesting guidelines or the equivalent. Forestry-derived cellulosic biomass that comes from land parcels greater than 160 acres must be certified by the Forest Stewardship Council, the Sustainable Forestry Initiative, or the American Tree Farm System. Uncertified land from parcels of 160 acres or less, tribal lands, and federal land must have a forest management plan, as defined in section 290C.02, subdivision 7, or the equivalent, and be harvested by a logger who has completed training for biomass harvesting from the Minnesota logger education program or the equivalent.\n(a) An eligible producer who utilizes agricultural cellulosic biomass other than corn kernel fiber or biogas must submit a responsible biomass sourcing plan to the commissioner prior to applying for payments under this section. The plan must:\n(1) provide a detailed explanation of how agricultural cellulosic biomass will be produced and managed in a way that preserves soil quality, does not increase soil and nutrient runoff, avoids introduction of harmful invasive species, limits negative impacts on wildlife habitat, and reduces greenhouse gas emissions;\n(2) include the producer's approach to verifying that biomass suppliers are following the plan;\n(3) discuss how new technologies and practices that are not yet commercially viable may be encouraged and adopted during the life of the facility, and how the producer will encourage continuous improvement during the life of the project; and\n(4) include specific numeric goals and timelines for making progress.\n(b) An eligible producer who utilizes agricultural cellulosic biomass and receives payments under this section shall submit an annual report on the producer's responsible biomass sourcing plan to the commissioner by January 15 each year. The report must include data on progress made by the producer in meeting specific goals laid out in the plan. The commissioner shall make the report publicly available. The commissioner shall perform an annual review of submitted reports and may make a determination that the producer is not following the plan based on the reports submitted. The commissioner may take appropriate steps, including reducing or ceasing payments, until the producer is in compliance with the plan.\n(a) By the last day of October, January, April, and July, each eligible renewable chemical producer shall file a claim for payment for renewable chemical production during the preceding three calendar months. An eligible renewable chemical producer that files a claim under this subdivision shall include a statement of the eligible producer's total renewable chemical production in Minnesota during the quarter covered by the claim and certify that the eligible producer will not use payments received under this section to compensate a lobbyist who is required to register with the Campaign Finance and Public Disclosure Board under section 10A.03. For each claim and statement of total renewable chemical production filed under this paragraph, the volume of renewable chemical production must be examined by a CPA firm with a valid permit to practice under chapter 326A, in accordance with Statements on Standards for Attestation Engagements established by the American Institute of Certified Public Accountants.\n(b) The commissioner must issue payments by November 15, February 15, May 15, and August 15. A separate payment must be made for each claim filed.\n(a) A facility eligible for payment under this program must source at least 80 percent biobased content from Minnesota. For the purposes of this subdivision, \"biobased content\" means a chemical, polymer, monomer, or plastic that is not sold primarily for use as food, feed, or fuel and that has a biobased percentage of at least 51 percent as determined by testing representative samples using American Society for Testing and Materials specification D6866. If a facility is sited 50 miles or less from the state border, biobased content must be sourced from within a 100-mile radius. Biobased content must be from agricultural or forestry sources or from solid waste. The facility must be located in Minnesota, must begin production at a specific location after April 1, 2023, and before June 30, 2025, and must not begin production of 750,000 pounds or more of chemicals quarterly before January 1, 2015. Eligible facilities include existing companies and facilities that are adding production capacity, or retrofitting existing capacity, as well as new companies and facilities. Eligible renewable chemical facilities must produce at least 750,000 pounds of renewable chemicals quarterly. Renewable chemicals produced through processes that are fully commercial before January 1, 2000, are not eligible.\n(b) No payments shall be made for renewable chemical production that occurs after June 30, 2035, for those eligible renewable chemical producers under paragraph (a).\n(c) An eligible producer of renewable chemicals shall not transfer the producer's eligibility for payments under this section to a renewable chemical facility at a different location.\n(d) A producer that ceases production for any reason is ineligible to receive payments under this section until the producer resumes production.\n(e) Advanced biofuel production for which payment has been received under section 41A.16, and biomass thermal production for which payment has been received under section 41A.18, are not eligible for payment under this section.",
	"repealed": false
}