{
	"id": "148F.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/148F.11",
	"title": "148F.11 EXCEPTIONS TO LICENSE REQUIREMENT.",
	"text": "(a) Nothing in this chapter prevents members of other professions or occupations from performing functions for which they are qualified or licensed. This exception includes, but is not limited to: licensed physicians; registered nurses; licensed practical nurses; licensed psychologists and licensed psychological practitioners; members of the clergy provided such services are provided within the scope of regular ministries; American Indian medicine men and women; licensed attorneys; probation officers; licensed marriage and family therapists; licensed social workers; social workers employed by city, county, or state agencies; licensed professional counselors; licensed professional clinical counselors; licensed school counselors; registered occupational therapists or occupational therapy assistants; Upper Midwest Indian Council on Addictive Disorders (UMICAD) certified counselors when providing services to Native American people; city, county, or state employees when providing assessments or case management under Minnesota Rules, chapter 9530; and staff persons providing co-occurring substance use disorder treatment in adult mental health rehabilitative programs certified or licensed by the Department of Human Services under section 245I.23, 256B.0622, or 256B.0623.\n(b) Nothing in this chapter prohibits technicians and resident managers in programs licensed by the Department of Human Services from discharging their duties as provided in Minnesota Rules, chapter 9530.\n(c) Any person who is exempt from licensure under this section must not use a title incorporating the words \"alcohol and drug counselor\" or \"licensed alcohol and drug counselor\" or otherwise hold himself or herself out to the public by any title or description stating or implying that he or she is engaged in the practice of alcohol and drug counseling, or that he or she is licensed to engage in the practice of alcohol and drug counseling, unless that person is also licensed as an alcohol and drug counselor. Persons engaged in the practice of alcohol and drug counseling are not exempt from the board's jurisdiction solely by the use of one of the titles in paragraph (a).\nNothing in sections 148F.001 to 148F.11 shall prevent students enrolled in an accredited school of alcohol and drug counseling from engaging in the practice of alcohol and drug counseling while under qualified supervision in an accredited school of alcohol and drug counseling.\n(a) A former student may practice alcohol and drug counseling for 90 days from the former student's degree conferral date from an accredited school or educational program or from the last date the former student received credit for an alcohol and drug counseling course from an accredited school or educational program. The former student's practice must be supervised by an alcohol and drug counselor or an alcohol and drug counselor supervisor, as defined in section 245G.11. The former student's practice is limited to the site where the student completed their internship or practicum. A former student must be paid for work performed during the 90-day period.\n(b) The former student's right to practice automatically expires after 90 days from the former student's degree conferral date or date of last course credit for an alcohol and drug counseling course, whichever occurs last.\nAlcohol and drug counselors practicing alcohol and drug counseling according to standards established by federally recognized tribes, while practicing under tribal jurisdiction, are exempt from the requirements of this chapter. In practicing alcohol and drug counseling under tribal jurisdiction, individuals practicing under that authority shall be afforded the same rights, responsibilities, and recognition as persons licensed under this chapter.",
	"repealed": false
}