{
	"id": "122A.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.19",
	"title": "122A.19 BILINGUAL AND ENGLISH AS A SECOND LANGUAGE TEACHERS; LICENSES.",
	"text": "The Professional Educator Licensing and Standards Board, hereinafter the board, must grant teaching licenses in bilingual education and English as a second language to persons who present satisfactory evidence that they:\n(1) possess competence and communicative skills in English and in another language;\n(2) possess a bachelor's degree or other academic degree approved by the board, and meet such requirements as to course of study and training as the board may prescribe, consistent with subdivision 4; and\n(3) meet all other requirements for a teaching license provided in sections 122A.18 to 122A.184.\nThe board may license a person who holds a teaching license in any tier under sections 122A.181 to 122A.184, respectively, and who presents the board with satisfactory evidence of competence and communicative skills in a language other than English under this section.\n[Repealed, 2014 c 272 art 1 s 18,43]\n(a) For the purpose of licensing bilingual and English as a second language teachers, the board may approve teacher preparation programs designed for their training.\n(b) Programs that prepare English as a second language teachers must provide instruction in implementing research-based practices designed specifically for English learners. The programs must focus on developing English learners' academic language proficiency in English, including oral academic language, giving English learners meaningful access to the full school curriculum, developing culturally relevant teaching practices appropriate for immigrant students, and providing more intensive instruction and resources to English learners with lower levels of academic English proficiency and varied needs, consistent with section 124D.59, subdivisions 2 and 2a.\nAny person licensed under this section is eligible for employment by a school board as a teacher in a bilingual education or English as a second language program in which the language for which the person is licensed is taught or used as a medium of instruction. A board may prescribe only those additional qualifications for teachers licensed under this section that are approved by the board.\nIn hiring for all bilingual education program positions, districts must give preference to and make affirmative efforts to seek, recruit, and employ persons who (1) are native speakers of the language which is the medium of instruction in the bilingual education program or share a native language with the majority of their students, and (2) share the culture of the English learners enrolled in the program. The district shall provide procedures for involving the parent advisory committees in designing the procedures for recruiting, screening, and selecting applicants. This section must not be construed to limit the school board's authority to hire and discharge personnel.",
	"repealed": false
}