{
	"id": "29.021",
	"url": "https://www.revisor.mn.gov/statutes/cite/29.021",
	"title": "29.021 COMMISSIONER'S POWERS AND DUTIES.",
	"text": "The commissioner of agriculture shall have the power to employ such persons as are necessary to carry out the provisions of sections 29.021 to 29.081, and to fix all salaries and provide for expenses generally not inconsistent with law. The commissioner is authorized and directed to formulate and adopt plans whereby owners of poultry flocks and poultry breeding flocks may, upon application, have their flocks culled, inspected, and supervised, to the end that these flocks may be accredited and certified for standard type and egg quality and production; and likewise, poultry hatcheries and dealers may be accredited and certified as hatching and selling products produced only from accredited and certified flocks. The commissioner is authorized to make, publish, and enforce rules to these ends, not inconsistent with law, and to define, prescribe, and authorize the use of uniform terminology to apply to varying degrees of accreditation and certification. The commissioner is authorized to adopt the \"standard breeding plan\" of accreditation and certification sponsored by the United States Department of Agriculture, or any other plan, and to cooperate with that department in matters of poultry improvement, egg quality and production. The commissioner is authorized to prescribe and collect fees for inspection and supervision, and to prescribe and furnish labels, leg bands, and certificates of accreditation and certification and such other supplies as may be necessary, and to prescribe and collect fees for the same. Fees shall be fixed by the commissioner at the beginning of each fiscal year and reviewed and adjusted, if necessary, at the end of each six-month period in order that the fees prescribed shall, insofar as practicable, cover the cost of all services rendered. The commissioner is authorized to do such other things as the commissioner may deem needful and expedient to improve poultry breeding and practices and egg quality and production and to give effect to sections 29.021 to 29.081, in connection with those parties who wish to comply with the programs promulgated in accordance with this section.",
	"repealed": false
}