{
	"id": "103I.210",
	"url": "https://www.revisor.mn.gov/statutes/cite/103I.210",
	"title": "103I.210 SUBMERGED CLOSED LOOP HEAT EXCHANGER SYSTEM; TEMPORARY PERMITS.",
	"text": "For purposes of this section, \"permit holder\" means persons who receive a permit under this section and includes the property owner and licensed well contractor.\n(a) The commissioner must issue a permit for the installation of a submerged closed loop heat exchanger system as provided in this section. The property owner or the property owner's agent must submit to the commissioner a permit application on a form provided by the commissioner, or in a format approved by the commissioner. The application must be legible and must contain:\n(1) the name, license number, and signature of the well contractor installing the submerged closed loop heat exchanger;\n(2) the name, address, and signature of the owner of the submerged closed loop heat exchanger system, and property owner, if different;\n(3) the township number, range number, section, and one quartile, and the property street address if assigned, of the proposed submerged closed loop heat exchanger system;\n(4) a description of existing wells to be utilized or any wells proposed to be constructed including the unique well numbers, locations, well depth, diameters of bore holes and casing, depth of casing, grouting methods and materials, and dates of construction;\n(5) the specifications for piping including the materials to be used for piping, the closed loop water treatment protocol, and the provisions for pressure testing the system;\n(6) a diagram of the proposed system; and\n(7) any additional information the commissioner deems necessary to protect the public health and safety of the groundwater.\n(b) The fees collected under this subdivision must be deposited in the state government special revenue fund.\n(c) Permit holders must allow for the inspection of the submerged closed loop heat exchanger system by the commissioner during working hours.\n(d) The commissioner must not limit the number of permits available for submerged closed loop heat exchanger systems or the size of systems. A system may consist of more than one submerged closed loop heat exchanger. A variance is not required to install or operate a submerged closed loop heat exchanger in the water supply well.\n(e) Permit holders must comply with this section, this chapter, and Minnesota Rules, chapter 4725.\n(f) A permit holder must inform the Minnesota Duty Officer of the failure or leak of a submerged closed loop heat exchanger.\n(g) A water supply well containing a submerged closed loop heat exchanger must meet the isolation distance requirements under Minnesota Rules, part 4725.4450. The commissioner may consider a variance under Minnesota Rules, part 4725.0410, to the isolation distance requirements under Minnesota Rules, part 4725.4450, for a water supply well containing a submerged closed loop heat exchanger for the sole purpose of heating and cooling if the property on which the water supply well will be located has limited space and a water supply well cannot be constructed to meet isolation distance requirements. The commissioner shall consider including isolation distance requirements during the expedited rulemaking process authorized by section 103I.208, subdivision 3.\nPermit holders must construct, install, operate, maintain, and report on the submerged closed loop heat exchanger system to comply with permit conditions identified by the commissioner, which must address:\n(1) notification to the commissioner at intervals specified in the permit conditions;\n(2) material and design specifications and standards;\n(3) heat exchange fluid requirements;\n(4) signage requirements;\n(5) backflow prevention requirements;\n(6) pressure tests of the system;\n(7) documentation of the system construction;\n(8) requirements for maintenance and repair of the system;\n(9) removal of the system upon termination of use or failure;\n(10) disclosure of the system at the time of property transfer;\n(11) requirement to obtain approval from the commissioner prior to deviation of the approved plans and conditions; and\n(12) any additional information the commissioner deems necessary to protect public health and safety of the groundwater.",
	"repealed": false
}