{
	"id": "204C.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/204C.13",
	"title": "204C.13 RECEIVING AND MARKING BALLOTS.",
	"text": "When the election judges are satisfied that an individual is eligible to vote in that precinct, the election judge in charge of the ballots shall give the voter only one ballot of each kind that is to be voted upon at that precinct. Each ballot shall be removed separately as needed for each voter from the previously initialed pile of ballots.\nOne of the election judges shall explain to the voter the proper method of marking the ballots and, during a primary election, the effect of attempting to vote in more than one party's primary. Except as otherwise provided in section 204C.15, the voter shall retire alone to an unoccupied voting booth or, at the voter's discretion, the voter may choose to use another writing surface. The voter shall mark the ballots without undue delay. The voter may take sample ballots into the booth to assist in voting. The election judges may adopt and enforce reasonable rules governing the amount of time a voter may spend in the voting booth marking ballots.\n(a) The voter shall mark each ballot as provided in this subdivision.\n(b) The voter shall fill in the oval or similar mark if a different target shape is used, opposite the printed name of each candidate for whom the individual desires to vote, and in the oval or other target shape before the \"Yes\" or \"No\" if the individual desires to vote for or against a question.\n(c) The voter may write in other names on the lines provided under the printed names of the candidates, except that no names shall be written in on primary ballots.\n(d) At a state primary an individual may vote for candidates of only one major political party on the partisan primary ballot. If a partisan primary ballot contains votes for the candidates of more than one major political party, the ballot is totally defective and no vote on the partisan section of the ballot shall be counted.\n(e) An individual who spoils a ballot may return it to the election judges and receive another.\n[Repealed, 2015 c 70 art 1 s 63]\nThe voter shall then withdraw from the voting booth with the ballots and immediately deposit each ballot in the ballot box. Ballots that have not been initialed by the election judges as provided in section 204C.09, shall not be deposited in the ballot box.\nAt any time before the ballots of any voter are deposited in the ballot boxes, the election judges or any individual who was not present at the time the voter procured the ballots, but not otherwise, may challenge the eligibility of that voter and the deposit of any received absentee ballots in the ballot boxes. The election judges shall determine the eligibility of any voter who is present in the polling place in the manner provided in section 204C.12, and if the voter is found to be not eligible to vote, shall place the ballots of that voter unopened among the spoiled ballots. The election judges shall determine whether to receive or reject the ballots of an absent voter and whether to deposit received absentee ballots in the ballot boxes in the manner provided in sections 203B.121 and 203B.24, and shall dispose of any absentee ballots not received or deposited in the manner provided in section 203B.121. A violation of this subdivision by an election judge is a gross misdemeanor.\nAn individual who has voted or whose ballot has been rejected shall leave the polling place and shall not return except as provided by section 204C.06 or 204C.07.",
	"repealed": false
}