{
	"id": "146A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/146A.10",
	"title": "146A.10 ADDITIONAL REMEDIES.",
	"text": "(a) The commissioner may issue a cease and desist order to stop a person from violating or threatening to violate a statute, rule, or order which the office has issued or is empowered to enforce. The cease and desist order must state the reason for its issuance and give notice of the person's right to request a hearing under sections 14.57 to 14.62. If, within 15 days of service of the order, the subject of the order fails to request a hearing in writing, the order is the final order of the commissioner and is not reviewable by a court or agency.\n(b) A hearing must be initiated by the office not later than 30 days from the date of the office's receipt of a written hearing request. Within 30 days of receipt of the administrative law judge's report, the commissioner shall issue a final order modifying, vacating, or making permanent the cease and desist order as the facts require. The final order remains in effect until modified or vacated by the commissioner.\n(c) When a request for a stay accompanies a timely hearing request, the commissioner may, in the commissioner's discretion, grant the stay. If the commissioner does not grant a requested stay, the commissioner shall refer the request to the Office of Administrative Hearings within three working days of receipt of the request. Within ten days after receiving the request from the commissioner, an administrative law judge shall issue a recommendation to grant or deny the stay. The commissioner shall grant or deny the stay within five days of receiving the administrative law judge's recommendation.\n(d) In the event of noncompliance with a cease and desist order, the commissioner may institute a proceeding in Hennepin County District Court to obtain injunctive relief or other appropriate relief, including a civil penalty payable to the office not exceeding $10,000 for each separate violation.\nIn addition to any other remedy provided by law, including the issuance of a cease and desist order under subdivision 1, the commissioner may in the commissioner's own name bring an action in Hennepin County District Court for injunctive relief to restrain an unlicensed complementary and alternative health care practitioner from a violation or threatened violation of any statute, rule, or order which the commissioner is empowered to regulate, enforce, or issue. A temporary restraining order must be granted in the proceeding if continued activity by a practitioner would create a serious risk of harm to others. The commissioner need not show irreparable harm.\nThe issuance of a cease and desist order or injunctive relief granted under this section does not relieve a practitioner from criminal prosecution by a competent authority or from disciplinary action by the commissioner.",
	"repealed": false
}