{
	"id": "84.035",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.035",
	"title": "84.035 PEATLAND PROTECTION.",
	"text": "Sections 84.035 and 84.036 may be cited as the \"Minnesota Peatland Protection Act.\"\nThe legislature finds that certain Minnesota peatlands possess unique scientific, aesthetic, vegetative, hydrologic, geologic, wildlife, wilderness, and educational values and represent the various peatland ecological types in the state. The legislature finds that it is desirable and appropriate to protect and preserve these patterned peatlands as a peatland management system through establishment and designation of certain peatland core areas as scientific and natural areas.\nUnless language or context clearly indicates that a different meaning is intended, the following terms, for the purposes of sections 84.035 and 84.036, have the meanings given to them.\n(a) \"Winter road\" means an access route which may be used by vehicles only when the substrate is frozen, except as provided in subdivision 5, paragraph (b), clause (3).\n(b) \"Corridors of disturbance\" means rights-of-way which are in existence on the effective date of Laws 1991, chapter 354, such as ditches, ditch banks, transmission lines, pipelines, permanent roads, winter roads, and recreational trails. The existence, on the effective date of Laws 1991, chapter 354, of a corridor of disturbance may be demonstrated by physical evidence, document recorded in the office of county recorder or other public official, aerial survey, or other evidence similar to the above.\n(c) \"State land\" means land owned by the state of Minnesota and administered by the commissioner.\nWithin the peatland areas described in section 84.036, state lands are hereby established and designated as scientific and natural areas to be preserved and managed by the commissioner in accordance with subdivision 5 and section 86A.05, subdivision 5.\nAreas designated in subdivision 4 as peatland scientific and natural areas are subject to the following conditions:\n(a) Except as provided in paragraph (b), all restrictions otherwise applicable to scientific and natural areas designated under section 86A.05, subdivision 5, apply to the surface use and to any use of the mineral estate which would significantly modify or alter the peatland water levels or flows, peatland water chemistry, plant or animal species or communities, or other natural features of the peatland scientific and natural areas, including, but not limited to, the following prohibitions:\n(1) construction of any new public drainage systems after the effective date of Laws 1991, chapter 354, or improvement or repair to a public drainage system in existence on the effective date of Laws 1991, chapter 354, under authority of chapter 103E, or any other alteration of surface water or groundwater levels or flows unless specifically permitted under paragraph (b), clause (5) or (6);\n(2) removal of peat, sand, gravel, or other industrial minerals;\n(3) exploratory boring or other exploration or removal of oil, natural gas, radioactive materials or metallic minerals which would significantly modify or alter the peatland water levels or flows, peatland water chemistry, plant or animal species or communities, or natural features of the peatland scientific and natural areas, except in the event of a national emergency declared by Congress;\n(4) commercial timber harvesting;\n(5) construction of new corridors of disturbance, of the kind defined in subdivision 3, after June 5, 1991; and\n(6) ditching, draining, filling, or any other activities which modify or alter the peatland water levels or flows, peatland water chemistry, plant or animal species or communities, or other natural features of the peatland scientific and natural areas.\n(b) The following activities are allowed:\n(1) recreational activities, including hunting, fishing, trapping, cross-country skiing, snowshoeing, nature observation, or other recreational activities permitted in the management plan approved by the commissioner;\n(2) scientific and educational work and research;\n(3) maintenance of corridors of disturbance, including survey lines and preparation of winter roads, consistent with protection of the peatland ecosystem;\n(4) use of corridors of disturbance unless limited by a management plan adopted by the commissioner under subdivision 6;\n(5) improvements to a public drainage system in existence on the effective date of Laws 1991, chapter 354, only when it is for the protection and maintenance of the ecological integrity of the peatland scientific and natural area and when included in a management plan adopted by the commissioner under subdivision 6;\n(6) repairs to a public drainage system in existence on the effective date of Laws 1991, chapter 354, which crosses a peatland scientific and natural area and is used for the purposes of providing a drainage outlet for lands outside of the peatland scientific and natural area, provided that there are no other feasible and prudent alternative means of providing the drainage outlet. The commissioner shall cooperate with the ditch authority in the determination of any feasible and prudent alternatives. No repairs which would significantly modify or alter the peatland water levels or flows, peatland water chemistry, plant or animal species or communities, or other natural features of the peatland scientific and natural areas shall be made unless approved by the commissioner;\n(7) motorized uses on a corridor of disturbance, if the corridor existed on or before January 1, 1992, provided that recreational motorized uses may occur only when the substrate is frozen, or the corridor is snow packed, subject to a management plan developed in accordance with subdivision 6;\n(8) control of forest insects, disease, and wildfires, as described in a management plan adopted by the commissioner under subdivision 6; and\n(9) geological and geophysical surveys which would not significantly modify or alter the peatland water levels or flows, peatland water chemistry, plant or animal species or communities, or other natural features of the peatland scientific and natural areas.\n(a) The commissioner shall develop in consultation with the affected local government unit a management plan for each peatland scientific and natural area designated under section 84.036.\n(b) The management plan shall address recreational trails. In those peatland scientific and natural areas where no corridor of disturbance was used as a recreational trail on or before January 1, 1992, the plan may permit only one corridor of disturbance, in each peatland scientific and natural area, to be used as a recreational motorized trail.\nThe commissioner shall establish baseline data on the ecology and biological diversity of peatland scientific and natural areas and provide for ongoing, long-term ecological monitoring to determine whether changes are occurring in the peatland scientific and natural areas. This research is intended to identify any changes occurring in peatland scientific and natural areas as a result of any permitted activities outside the peatland scientific and natural areas. This baseline data may include, but is not limited to, the history of the peatlands and their geologic origins, plant and animal communities, hydrology, water chemistry, and contaminants introduced from remote sources of atmospheric deposition.\nIn order to eliminate repairs or improvements to any public drainage system that crosses a peatland scientific and natural area in those instances where the repair or improvement adversely affects an area, the commissioner may petition for the abandonment of parts of the public drainage system under section 103E.811. If the public drainage system is necessary as a drainage outlet for lands outside of the peatland scientific and natural area, the commissioner will cooperate with the ditch authority in the development of feasible and prudent alternative means of providing a drainage outlet which avoids the crossing of and damage to the peatland scientific and natural area. In so doing, the commissioner shall grant flowage easements to the ditch authority for disposal of the outlet water on other state lands. The ditch authority shall approve the abandonment of parts of any public drainage system crossing a peatland scientific and natural area if the public drainage system crossing of those areas is not necessary as a drainage outlet for lands outside of the areas or if there are feasible and prudent alternative means of providing a drainage outlet without crossing such areas. In any abandonment under this subdivision the commissioner may enter into an agreement with the ditch authority regarding apportionment of costs and, contingent upon appropriations of money for that purpose, may agree to pay a reasonable share of the cost of abandonment.\nThe commissioner shall acquire by exchange or eminent domain the surface interests, including peat, on trust fund lands contained in peatland scientific and natural areas established in subdivision 4.\n(a) The commissioner may acquire by purchase the surface interests, including peat, of lands within the boundaries of the peatland areas described in section 84.036, that are owned, or that hereafter become owned, by the state and administered by the local county board.\n(b) The commissioner shall designate any land acquired under this subdivision as peatland scientific and natural area and preserve and administer any land so acquired and designated in accordance with subdivision 5 and section 86A.05.",
	"repealed": false
}