{
	"id": "145.361",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.361",
	"title": "145.361 LONG COVID AND RELATED CONDITIONS; ASSESSMENT AND MONITORING.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Long COVID\" means health problems that people experience four or more weeks after being infected with SARS-CoV-2, the virus that causes COVID-19. Long COVID is also called post-COVID conditions, long-haul COVID, chronic COVID, post-acute COVID, or post-acute sequelae of COVID-19 (PASC).\n(c) \"Related conditions\" means conditions associated with or sequelae of long COVID, including but not limited to myalgic encephalomyelitis/chronic fatigue syndrome (ME/CFS) and dysautonomia, and postural orthostatic tachycardia syndrome (POTS).\nThe commissioner of health shall establish a program to conduct community assessments and epidemiologic investigations to monitor and address impacts of long COVID and related conditions. The purposes of these activities are to:\n(1) monitor trends in: incidence, prevalence, mortality, and health outcomes; changes in disability status, employment, and quality of life; and service needs of individuals with long COVID or related conditions and to detect potential public health problems, predict risks, and assist in investigating long COVID and related conditions health inequities;\n(2) more accurately target information and resources for communities and patients and their families;\n(3) inform health professionals and citizens about risks and early detection;\n(4) promote evidence-based practices around long COVID and related conditions prevention and management and to address public concerns and questions about long COVID and related conditions; and\n(5) research and track related conditions.\nThe commissioner of health shall, in consultation with health care professionals, the commissioner of human services, local public health entities, health insurers, employers, schools, survivors of long COVID or related conditions, and community organizations serving people at high risk of long COVID or related conditions, identify priority actions and activities to address the needs for communication, services, resources, tools, strategies, and policies to support survivors of long COVID or related conditions and their families.\nThe commissioner of health shall coordinate and collaborate with community and organizational partners to implement evidence-informed priority actions through community-based grants and contracts. The commissioner of health shall award grants and enter into contracts to organizations that serve communities disproportionately impacted by COVID-19, long COVID, or related conditions, including but not limited to rural and low-income areas, Black and African Americans, African immigrants, American Indians, Asian American-Pacific Islanders, Latino(a) communities, LGBTQ+ communities, and persons with living disabilities. Organizations may also address intersectionality within the groups. The commissioner shall award grants and award contracts to eligible organizations to plan, construct, and disseminate resources and information to support survivors of long COVID or related conditions, including caregivers, health care providers, ancillary health care workers, workplaces, schools, communities, and local and Tribal public health.",
	"repealed": false
}