{
	"id": "367.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/367.03",
	"title": "367.03 ANNUAL ELECTION OF OFFICERS; VACANCIES; SPECIAL ELECTIONS.",
	"text": "Except in towns operating under option A or in towns operating as provided in subdivision 4, three supervisors shall be elected in each town at the town general election as provided in this section. Each supervisor shall be elected for a term of three years and shall serve until a successor is elected and qualified.\nWhen a new town is organized and supervisors are elected at a town meeting prior to the annual town election, they shall serve only until the next annual town election. At that election three supervisors shall be elected, one for three years, one for two years, and one for one year, so that the term of one shall expire each year. The number of years for which each is elected shall be indicated on the ballot.\nMS 1986 [Repealed, 1988 c 563 s 8]\nWhen two supervisors are to be elected for three-year terms under option A, a candidate shall indicate on the affidavit of candidacy which of the two offices the candidate is filing for. At following annual town elections one supervisor shall be elected for three years to succeed the one whose term expires at that time and shall serve until a successor is elected and qualified.\nMS 1982 [Repealed, 1983 c 359 s 151]\nExcept as provided in subdivision 4a, supervisors and other town officers in towns that hold the town general election in November shall be elected for terms of four years commencing on the first Monday in January and until their successors are elected and qualified. The clerk and treasurer shall be elected in alternate years.\nThe resolution required under section 205.075, subdivision 2, to adopt the alternative November date for town general election may include the proposal and corresponding transition plan to provide for a six-year term for town supervisors. A town that has adopted the alternative November date for general town elections using the four-year terms provided under subdivision 4 may adopt a resolution establishing six-year terms for supervisors as provided under this subdivision. The resolution must include a plan to provide an orderly transition to six-year terms. The resolution adopting the six-year term for town supervisors may be proposed by the town board or by a resolution of the electors adopted at the annual town meeting and is effective upon an affirmative vote of the electors at the next town general election.\nExcept in towns operating under option B or option D, or both, or in towns operating as provided in subdivision 4, at the annual town election in even-numbered years one town clerk and at the annual town election in odd-numbered years one town treasurer shall be elected. The clerk and treasurer each shall serve for two years and until their successors are elected and qualified.\n(a) When a vacancy occurs in a town office, the town board shall fill the vacancy by appointment. Except as provided in paragraph (b), the person appointed shall hold office until the next annual town election, when a successor shall be elected for the unexpired term.\n(b) When a vacancy occurs in a town office:\n(1) with more than one year remaining in the term; and\n(2) on or after the 14th day before the first day to file an affidavit of candidacy for the town election;\nthe vacancy must be filled by appointment. The person appointed serves until the next annual town election following the election for which affidavits of candidacy are to be filed, when a successor shall be elected for the unexpired term.\n(c) A vacancy in the office of supervisor must be filled by an appointment committee comprised of the remaining supervisors and the town clerk.\n(d) Any person appointed to fill the vacancy in the office of supervisor must, upon assuming the office, be an eligible voter, be 21 years of age, and have maintained residence in the town for at least 30 days.\n(e) When, because of a vacancy, more than one supervisor is to be chosen at the same election, candidates for the offices of supervisor shall file for one of the specific terms being filled.\n(f) When, for any reason, the town board or the appointment committee fails to fill a vacancy in the position of an elected town officer by appointment, a special election may be called. To call a special election, the supervisors and town clerk, or any two of them together with at least 12 other town freeholders, must file a statement in the town clerk's office. The statement must tell why the election is called and that the interests of the town require the election. When the town board or the appointment committee fails to fill a vacancy by appointment, a special town election may also be called on petition of 20 percent of the electors of the town. The percentage is of the number of voters at the last general election. A special town election must be conducted in the manner required for the annual town election.\n(g) Law enforcement vacancies must be filled by appointment by the town board.\nIn addition to the events specified in section 351.02, a vacancy in a town office may be declared by the town board when an officer is unable to serve in the office or attend board meetings for a 90-day period because of illness, or because of absence from or refusal to attend board meetings for a 90-day period. If any of the preceding conditions occurs, the town board may, after the board by resolution has declared a vacancy to exist, make an appointment to fill the vacancy at a regular or special meeting for the remainder of the unexpired term or until the ill or absent member is again able to resume duties and attend board meetings, whichever is earlier. If the vacancy is in the office of supervisor, the vacancy must be filled by an appointment committee made up of the remaining supervisors and the town clerk. If the original member is again able to resume duties and attend board meetings, the board shall by resolution so determine and remove the appointed officeholder and restore the original member to office.",
	"repealed": false
}