{
	"id": "554.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/554.10",
	"title": "554.10 STAY.",
	"text": "(a) Except as otherwise provided in paragraphs (d) to (g), on the filing of a motion under section 554.09:\n(1) all other proceedings between the moving party and responding party, including discovery and a pending hearing or motion, are stayed; and\n(2) on motion by the moving party, the court may stay a hearing or motion involving another party, or discovery by another party, if the hearing or ruling on the motion would adjudicate, or the discovery would relate to, an issue material to the motion under section 554.09.\n(b) A stay under paragraph (a) remains in effect until entry of an order ruling on the motion under section 554.09 and expiration of the time under section 554.15 for the moving party to appeal the order.\n(c) Except as otherwise provided in paragraphs (e), (f), and (g), if a party appeals from an order ruling on a motion under section 554.09, all proceedings between all parties in the action are stayed. The stay remains in effect until the conclusion of the appeal.\n(d) During a stay under paragraph (a), the court may allow limited discovery if a party shows that specific information is necessary to establish whether a party has satisfied or failed to satisfy a burden under section 554.13, paragraph (a), and the information is not reasonably available unless discovery is allowed.\n(e) A motion under section 554.16 for costs, attorney fees, and expenses is not subject to a stay under this section.\n(f) A stay under this section does not affect a party's ability voluntarily to dismiss a cause of action or part of a cause of action or move to sever a cause of action.\n(g) During a stay under this section, the court for good cause may hear and rule on:\n(1) a motion unrelated to the motion under section 554.09; and\n(2) a motion seeking a special or preliminary injunction to protect against an imminent threat to public health or safety.",
	"repealed": false
}