{
	"id": "203B.06",
	"url": "https://www.revisor.mn.gov/statutes/cite/203B.06",
	"title": "203B.06 APPLICATIONS; FILING WITH COUNTY AUDITOR OR MUNICIPAL CLERK; DELIVERY OF BALLOT.",
	"text": "Each county auditor and municipal clerk shall prepare and print a sufficient number of blank application forms for absentee ballots. The county auditor or municipal clerk shall deliver a blank application form to any voter who requests one pursuant to section 203B.04.\nIf for any reason an application for absentee ballots is submitted to the wrong county auditor or municipal clerk, that official shall promptly forward it to the proper county auditor or municipal clerk.\n(a) The county auditor, municipal clerk, school district clerk, or full-time clerk of any city or town administering an election pursuant to section 203B.05, shall mail absentee ballots to voters on the permanent absentee ballot list pursuant to section 203B.04, subdivision 5, on the following timelines:\n(1) except as otherwise provided by this section, at least 46 days before each regularly scheduled primary and general election and each special primary and special election;\n(2) as soon as practicable for a special election held pursuant to section 204D.19, subdivisions 2 and 3; and\n(3) at least 30 days before a town general election held in March.\n(b) The commissioner of corrections must provide the secretary of state with a list of the names and mailing addresses of state adult correctional facilities. An application for an absentee ballot that provides an address included on the list provided by the commissioner of corrections must not be accepted and an absentee ballot must not be provided to the applicant. The county auditor or municipal clerk must promptly transmit a copy of the application to the county attorney. The Department of Corrections must implement procedures to ensure that absentee ballots issued under this chapter are not received or mailed by offenders incarcerated at state adult correctional facilities.\n(c) If an application for absentee ballots is accepted at a time when absentee ballots are not yet available for distribution, the county auditor, or municipal clerk accepting the application shall file it and as soon as absentee ballots are available for distribution shall mail them to the address specified in the application. If an application for absentee ballots is accepted when absentee ballots are available for distribution, the county auditor or municipal clerk accepting the application shall promptly:\n(1) mail the ballots to the voter whose signature appears on the application if the application is submitted by mail and does not request commercial shipping under clause (2);\n(2) ship the ballots to the voter using a commercial shipper requested by the voter at the voter's expense;\n(3) deliver the absentee ballots directly to the voter if the application is submitted in person; or\n(4) deliver the absentee ballots in a sealed transmittal envelope to an agent who has been designated to bring the ballots, as provided in section 203B.11, subdivision 4, to a voter who would have difficulty getting to the polls because of incapacitating health reasons, or who is disabled, or who is a patient in a health care facility, a resident of an assisted living facility licensed under chapter 144G, a participant in a residential program for adults licensed under section 245A.02, subdivision 14, or a resident of a shelter for battered women as defined in section 611A.37, subdivision 4.\n(d) If an application does not indicate the election for which absentee ballots are sought, the county auditor or municipal clerk shall mail or deliver only the ballots for the next election occurring after receipt of the application. Only one set of ballots may be mailed, shipped, or delivered to an applicant for any election, except as provided in section 203B.121, subdivision 2, or when a replacement ballot has been requested by the voter for a ballot that has been spoiled or lost in transit.\nIf no official ballots are ready at the time absentee balloting is scheduled to begin or the supply is exhausted before absentee balloting ends, the county auditor or municipal clerk shall prepare unofficial ballots, printed or written as nearly as practicable in the form of the official ballots. These ballots may be used until the official ballots are available.\nUpon receipt of an application for ballots, the county auditor, municipal clerk, or election judge acting pursuant to section 203B.11, who receives the application shall determine whether the applicant is a registered voter. If the applicant is not registered to vote, the county auditor, municipal clerk, or election judge shall include a voter registration application among the election materials provided to the applicant.\nAn application for absentee ballots shall be dated by the county auditor or municipal clerk when it is received and shall be initialed when absentee ballots are mailed or delivered to the applicant. All applications shall be preserved by the county auditor or municipal clerk for 22 months.\nIf an application for absentee ballots requests delivery of absentee ballots to a point outside the continental United States, the absentee ballots must be sent by air mail. The transmittal and return envelopes must contain the text or symbol or both prescribed by the United States Postal Service for transmitting election mail outside the continental United States. Priority in mailing shall be given to all ballots sent by air mail.\nIf the federal government or any of its branches, departments, agencies or other instrumentalities makes any special service available for the mailing of absentee voting materials, any county auditor or municipal clerk may use the service.\nNo envelope, return envelope, or directions for casting an absentee ballot shall contain the name of any candidate whose name appears on any of the absentee ballots.",
	"repealed": false
}