{
	"id": "550.051",
	"url": "https://www.revisor.mn.gov/statutes/cite/550.051",
	"title": "550.051 TERM OF WRIT OF EXECUTION; INVENTORY; SATISFACTION.",
	"text": "The writ of execution expires 180 days after its issuance by the court administrator. A levy that is served with a writ of execution that has expired is void. If the officer or creditor's attorney having the writ levies upon property or earnings before the expiration of 180 days, the officer or creditor's attorney may retain the writ until the officer sells the property or completes the levy upon earnings in the manner prescribed by law. Any levy properly served in accordance with this chapter or chapter 551 prior to the expiration of the writ shall be processed in accordance with the appropriate statutory section until completion, without regard for the date of expiration of the writ. Upon a demand of the judgment creditor or the creditor's attorney within 180 days, the officer shall pay to the judgment creditor or the judgment creditor's attorney all money collected upon execution after deducting the officer's fees. Upon expiration of the writ or full satisfaction of the judgment, if earlier, the officer shall make a full inventory of the property levied on and return it with the execution.\nIn case of satisfaction, either partial or in full, the officer shall return the writ to the court administrator originally issuing it and return a duplicate copy of it to the court administrator of the officer's own county, if execution is upon judgment transcripted from another county. The court administrator to whom a duplicate is returned shall enter the record of the satisfaction upon the judgment docket and note in the margin that the entry is made upon \"duplicate return.\" If the writ of execution is being returned when the judgment has been wholly satisfied, the writ shall be filed with the court administrator within ten days after the final payment or within 30 days if the payment is by check or other noncertified funds. If the writ of execution is being returned partially satisfied, the officer shall include a statement setting forth the dates and amounts of payments made upon the judgment after the most recent partial satisfaction filed, if any.",
	"repealed": false
}