{
	"id": "90.005",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.005",
	"title": "90.005 SURVEYOR GENERAL OFFICE ABOLISHED; FUNCTIONS TRANSFERRED TO NATURAL RESOURCES COMMISSIONER.",
	"text": "[Repealed, 1996 c 310 s 1]\nWhenever in any other general law, or resolution of the legislature heretofore or hereafter adopted, or in any document, record, or proceeding authorized by the same, any word or phrase is used in reference to or descriptive of the surveyor general, or officer or employee thereof, or their respective activities, whose powers, duties, or activities are by Laws 1967, chapter 568 assigned or transferred to the commissioner of natural resources, such word, phrase, or reference shall hereafter be deemed to refer to, include, and describe the commissioner of natural resources, or officers or employees of the commissioner.\nThe Department of Natural Resources is deemed and held to constitute a continuation of the Office of the Surveyor General as to powers and duties of the surveyor general transferred by Laws 1967, chapter 568, and not a new authority for the purpose of succession to all rights, powers, duties and obligations of the surveyor general as constituted at the time of such assignment or transfer, with the same force and effect as if such powers and duties had not been assigned or transferred.\n[Repealed, 1996 c 310 s 1]\n[Repealed, 1996 c 310 s 1]\nAll unexpended funds appropriated to the surveyor general for the purpose of any of its functions, powers, or duties which are transferred by Laws 1967, chapter 568 to the commissioner of natural resources, are hereby transferred to the commissioner. Where unexpended funds appropriated to the surveyor general for the purposes of any of its functions, powers or duties are changed by Laws 1967, chapter 568 so that the functions, powers or duties are in more than one department, commission, or agency, the commissioner of administration shall allocate the appropriation between the state departments, commissions, or agencies concerned, and the funds so allocated are reappropriated therefor.\nExcept as otherwise provided in Laws 1967, chapter 568, all persons in the classified service and employed by the surveyor general for the purposes of any of its functions, powers or duties which are transferred by Laws 1967, chapter 568 to the commissioner of natural resources are hereby transferred to such commissioner. The positions of all persons in the unclassified service and employed by the surveyor general for the purposes of powers or duties which are transferred by Laws 1967, chapter 568 to the commissioner of natural resources are hereby abolished.",
	"repealed": false
}