{
	"id": "169A.284",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.284",
	"title": "169A.284 CHEMICAL DEPENDENCY ASSESSMENT CHARGE; SURCHARGE.",
	"text": "(a) When a court sentences a person convicted of an offense enumerated in section 169A.70, subdivision 2 (chemical use assessment; requirement; form), it shall order the person to pay the cost of the assessment directly to the entity conducting the assessment or providing the assessment services in an amount determined by the entity conducting or providing the service and shall impose a chemical dependency assessment charge of $25. The court may waive the $25 assessment charge, but may not waive the cost for the assessment paid directly to the entity conducting the assessment or providing assessment services. A person shall pay an additional surcharge of $5 if the person is convicted of a violation of section 169A.20 (driving while impaired) within five years of a prior impaired driving conviction or a prior conviction for an offense arising out of an arrest for a violation of section 169A.20 or Minnesota Statutes 1998, section 169.121 (driver under influence of alcohol or controlled substance) or 169.129 (aggravated DWI-related violations; penalty). This section applies when the sentence is executed, stayed, or suspended. The court may not waive payment or authorize payment of the assessment charge and surcharge in installments unless it makes written findings on the record that the convicted person is indigent or that the assessment charge and surcharge would create undue hardship for the convicted person or that person's immediate family.\n(b) The chemical dependency assessment charge and surcharge required under this section are in addition to the surcharge required by section 357.021, subdivision 6 (surcharges on criminal and traffic offenders).\nThe court administrator shall collect and forward the chemical dependency assessment charge and the $5 surcharge, if any, to the commissioner of management and budget to be deposited in the state treasury and credited to the general fund.",
	"repealed": false
}