{
	"id": "14.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.26",
	"title": "14.26 ADOPTION OF PROPOSED RULE; SUBMISSION TO ADMINISTRATIVE LAW JUDGE.",
	"text": "If no hearing is required, the agency shall submit to an administrative law judge assigned by the chief administrative law judge the proposed rule and notice as published, the rule as adopted, any written comments received by the agency, and a statement of need and reasonableness for the rule. The agency shall give notice to all persons who requested to be informed that these materials have been submitted to the administrative law judge. This notice must be given on the same day that the record is submitted. If the proposed rule has been modified, the notice must state that fact, and must also state that a free copy of the proposed rule, as modified, is available upon request from the agency. The rule and these materials must be submitted to the administrative law judge within 180 days of the day that the comment period for the rule is over or the rule is automatically withdrawn. The agency may not adopt the withdrawn rules without again following the procedures of sections 14.05 to 14.28, with the exception of section 14.101, if the noncompliance is approved by the chief administrative law judge. The agency shall report its failure to adopt the rules and the reasons for that failure to the Legislative Coordinating Commission, other appropriate legislative committees, and the governor.\nEven if the 180-day period expires while the administrative law judge reviews the rule, if the administrative law judge rejects the rule, the agency may resubmit it after taking corrective action. The resubmission must occur within 30 days of when the agency receives written notice of the disapproval. If the rule is again disapproved, the rule is withdrawn. An agency may resubmit at any time before the expiration of the 180-day period. If the agency withholds some of the proposed rule, it may not adopt the withheld portion without again following the procedures of sections 14.14 to 14.28.\n(a) Within 14 days, the administrative law judge shall approve or disapprove the rule as to its legality and its form to the extent that the form relates to legality, including the issues of whether the rule if modified is substantially different, as determined under section 14.05, subdivision 2, from the rule as originally proposed, whether the agency has the authority to adopt the rule, and whether the record demonstrates a rational basis for the need for and reasonableness of the proposed rule. If the rule is approved, the administrative law judge shall promptly file four paper copies or an electronic copy of the adopted rule in the Office of the Secretary of State. The secretary of state shall forward one copy of each rule to the revisor of statutes, to the agency, and to the governor. If the rule is disapproved, the administrative law judge shall state in writing the reasons for the disapproval and make recommendations to overcome the defects.\n(b) The written disapproval must be submitted to the chief administrative law judge for approval. If the chief administrative law judge approves of the findings of the administrative law judge, the chief administrative law judge shall send the statement of the reasons for disapproval of the rule to the agency, the Legislative Coordinating Commission, the house of representatives and senate policy committees with primary jurisdiction over state governmental operations, and the revisor of statutes and advise the agency and the revisor of statutes of actions that will correct the defects. The rule may not be filed in the Office of the Secretary of State, nor be published, until the chief administrative law judge determines that the defects have been corrected or, if applicable, that the agency has satisfied the rule requirements for the adoption of a substantially different rule.\n(c) If the chief administrative law judge determines that the need for or reasonableness of the rule has not been established, and if the agency does not elect to follow the suggested actions of the chief administrative law judge to correct that defect, then the agency shall submit the proposed rule to the Legislative Coordinating Commission and to the house of representatives and senate policy committees with primary jurisdiction over state governmental operations for advice and comment. The agency may not adopt the rule until it has received and considered the advice of the commission and committees. However, the agency need not wait for advice for more than 60 days after the commission and committees have received the agency's submission.\n(d) The administrative law judge shall disregard any error or defect in the proceeding due to the agency's failure to satisfy any procedural requirements imposed by law or rule if the administrative law judge finds:\n(1) that the failure did not deprive any person or entity of an opportunity to participate meaningfully in the rulemaking process; or\n(2) that the agency has taken corrective action to cure the error or defect so that the failure did not deprive any person or entity of an opportunity to participate meaningfully in the rulemaking process.\nIf the rule is approved, the administrative law judge shall promptly file an electronic copy of the adopted rule in the Office of the Secretary of State. The secretary of state shall forward one copy of each rule to the revisor of statutes, to the agency, and to the governor.\nThe Office of Administrative Hearings shall assess an agency for the actual cost of processing rules under this section. Each agency shall include in its budget money to pay the assessment. Receipts from the assessment must be deposited in the administrative hearings account created in section 14.54.",
	"repealed": false
}