{
	"id": "142E.52",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.52",
	"title": "142E.52 DUTY TO PROVIDE ACCESS.",
	"text": "A provider, license holder, controlling individual, employee, staff person, or recipient has an affirmative duty to provide access upon request to information specified under section 142E.54 or the program facility.\nFailure to provide access may result in denial or termination of authorizations for or payments to a recipient, provider, license holder, or controlling individual in the child care assistance program.\nWhen a provider fails to provide access, a 15-day notice of denial or termination must be issued to the provider, which prohibits the provider from participating in the child care assistance program. Notice must be sent to recipients whose children are under the provider's care pursuant to Minnesota Rules, part 3400.0185.\nIf the provider continues to fail to provide access at the expiration of the 15-day notice period, child care assistance program payments to the provider must be denied beginning the 16th day following notice of the initial failure or refusal to provide access. The department may rescind the denial based upon good cause if the provider submits in writing a good cause basis for having failed or refused to provide access. The writing must be postmarked no later than the 15th day following the provider's notice of initial failure to provide access. Additionally, the provider, license holder, or controlling individual must immediately provide complete, ongoing access to the department. Repeated failures to provide access must, after the initial failure or for any subsequent failure, result in termination from participation in the child care assistance program.\nThe department, at its own expense, may photocopy or otherwise duplicate records referenced in section 142E.54. Photocopying must be done on the provider's premises on the day of the request or other mutually agreeable time, unless removal of records is specifically permitted by the provider. If requested, a provider, license holder, or controlling individual, or a designee, must assist the investigator in duplicating any record, including a hard copy or electronically stored data, on the day of the request.\nA provider, license holder, controlling individual, employee, or staff person must grant the department access during the department's normal business hours, and any hours that the program is operated, to examine the provider's program or the records listed in section 142E.54. A provider shall make records available at the provider's place of business on the day for which access is requested, unless the provider and the department both agree otherwise. The department's normal business hours are 8:00 a.m. to 5:00 p.m., Monday through Friday, excluding state holidays as defined in section 645.44, subdivision 5.",
	"repealed": false
}