{
	"id": "256B.492",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.492",
	"title": "256B.492 HOME AND COMMUNITY-BASED SETTINGS FOR PEOPLE WITH DISABILITIES.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Community-living setting\" means a single-family home or multifamily dwelling unit where a service recipient or a service recipient's family owns or rents and maintains control over the individual unit as demonstrated by a lease agreement. Community-living setting does not include a home or dwelling unit that the service provider owns, operates, or leases or in which the service provider has a direct or indirect financial interest.\n(c) \"Controlling individual\" has the meaning given in section 245A.02, subdivision 5a.\n(d) \"License holder\" has the meaning given in section 245A.02, subdivision 9.\n(a) Individuals receiving services under a home and community-based waiver under section 256B.092 or 256B.49 may receive services in the following settings:\n(1) home and community-based settings that comply with all requirements identified by the federal Centers for Medicare and Medicaid Services in the Code of Federal Regulations, title 42, section 441.301(c), and with the requirements of the federally approved transition plan and waiver plans for each home and community-based services waiver; and\n(2) settings required by the Housing Opportunities for Persons with AIDS Program.\n(b) The settings in paragraph (a) must not have the qualities of an institution which include, but are not limited to: regimented meal and sleep times, limitations on visitors, and lack of privacy. Restrictions agreed to and documented in the person's individual service plan shall not result in a residence having the qualities of an institution as long as the restrictions for the person are not imposed upon others in the same residence and are the least restrictive alternative, imposed for the shortest possible time to meet the person's needs.\n(a) Individuals receiving services under a home and community-based waiver under section 256B.092 or 256B.49 may receive services in community-living settings. Community-living settings must meet the requirements of subdivision 2, paragraph (a), clause (1).\n(b) For the purposes of this section, direct financial interest exists if payment passes between the license holder or any controlling individual of a licensed program and the service recipient or an entity acting on the service recipient's behalf for the purpose of obtaining or maintaining a dwelling. For the purposes of this section, indirect financial interest exists if the license holder or any controlling individual of a licensed program has an ownership or investment interest in the entity that owns, operates, leases, or otherwise receives payment from the service recipient or an entity acting on the service recipient's behalf for the purpose of obtaining or maintaining a dwelling.\n(c) To ensure a service recipient or the service recipient's family maintains control over the home or dwelling unit, community-living settings are subject to the following requirements:\n(1) service recipients must not be required to receive services or share services;\n(2) service recipients must not be required to have a disability or specific diagnosis to live in the community-living setting;\n(3) service recipients may hire service providers of their choice;\n(4) service recipients may choose whether to share their household and with whom;\n(5) the home or multifamily dwelling unit must include living, sleeping, bathing, and cooking areas;\n(6) service recipients must have lockable access and egress;\n(7) service recipients must be free to receive visitors and leave the settings at times and for durations of their own choosing;\n(8) leases must comply with chapter 504B;\n(9) landlords must not charge different rents to tenants who are receiving home and community-based services; and\n(10) access to the greater community must be easily facilitated based on the service recipient's needs and preferences.\n(d) Nothing in this section prohibits a service recipient from having another person or entity not affiliated with the service provider cosign a lease. Nothing in this section prohibits a service recipient, during any period in which a service provider has cosigned the service recipient's lease, from modifying services with an existing cosigning service provider and, subject to the approval of the landlord, maintaining a lease cosigned by the service provider. Nothing in this section prohibits a service recipient, during any period in which a service provider has cosigned the service recipient's lease, from terminating services with the cosigning service provider, receiving services from a new service provider, or, subject to the approval of the landlord, maintaining a lease cosigned by the new service provider.\n(e) A lease cosigned by a service provider meets the requirements of paragraph (b) if the service recipient and service provider develop and implement a transition plan which must provide that, within two years of cosigning the initial lease, the service provider shall transfer the lease to the service recipient and other cosigners, if any.\n(f) In the event the landlord has not approved the transfer of the lease within two years of the service provider cosigning the initial lease, the service provider must submit a time-limited extension request to the commissioner of human services to continue the cosigned lease arrangement. The extension request must include:\n(1) the reason the landlord denied the transfer;\n(2) the plan to overcome the denial to transfer the lease;\n(3) the length of time needed to successfully transfer the lease, not to exceed an additional two years;\n(4) a description of how the transition plan was followed, what occurred that led to the landlord denying the transfer, and what changes in circumstances or condition, if any, the service recipient experienced; and\n(5) a revised transition plan to transfer the cosigned lease between the service provider and the service recipient to the service recipient.\n(g) The commissioner must approve an extension under paragraph (f) within sufficient time to ensure the continued occupancy by the service recipient.",
	"repealed": false
}