{
	"id": "383C.482",
	"url": "https://www.revisor.mn.gov/statutes/cite/383C.482",
	"title": "383C.482 TAX SEARCH CERTIFICATES.",
	"text": "The St. Louis County auditor, upon written application of any person, shall search the records of the auditor's office and the county treasurer's office, and ascertain the amount of current tax against any lot or parcel of land described in the application and the existence of all tax liens and tax sales as to the lot or parcel of land, and certify the result of the search under the seal of office, giving the description of the lot or parcel of land, the amount of the current tax, if any, and all tax liens and tax sales shown by such records, and the amount of liens and tax sales, the year of tax covered by the lien, and the date of tax sale. For the purpose of ascertaining the current tax against a lot or parcel of land, the county auditor has the right of access to the records of current taxes in the office of the county treasurer.\nFor such certificate the county shall receive a compensation of $2 for each lot or parcel of land described in the certificate, which shall be collected by the county auditor. Any number of contiguous tracts of land not exceeding one section, assessed as broad acres, or adjoining lots in the same block, in the city or village, shall be considered as one parcel of land or lot within the meaning of this section. All moneys received by the county auditor under this section shall immediately be paid to the county treasurer as hereinafter provided.\nIn each county described in subdivision 1 hereof, there is hereby created in the county treasury a tax certificate assurance fund.\nSeventy-five cents of each dollar received under this section shall be paid by the county auditor to the credit of the general revenue fund and 25 cents of each dollar so received shall be paid to the credit of the tax certificate assurance fund. Upon request by the county auditor, the county treasurer, with approval of the board, shall invest the moneys in the tax certificate assurance fund in bonds of the United States of America, or bonds or tax anticipation certificates of the state of Minnesota or of any county or municipality thereof. The county treasurer upon request by the county board shall render a full and detailed report showing all receipts and disbursements not theretofore reported, all investments on account of the fund and all assets on hand. When additional moneys may be needed in said fund, the county treasurer, upon request by the county auditor, approved by the county board, is authorized and directed to sell such bonds or tax anticipation certificates belonging to the fund as may be necessary to provide the moneys needed for disbursement.\nAny person who without negligence sustains any loss or damage by reason of any omission or mistake of the county auditor or a deputy thereof in a certificate made under authority of this section, may make a claim in writing to the county board setting forth in detail all the facts from which the claim arises, and the amount of loss or damage claimed. The county board shall investigate the claim and may order payment to the claimant, by reason of the claim, of such sum of money from the tax certificate assurance fund as it may deem proper. Acceptance of such payment by the claimant is payment in full of all claims for loss or damage against the county, the county auditor and the auditor's deputies arising out of the tax certificate upon which the claim is predicated.",
	"repealed": false
}