{
	"id": "174.634",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.634",
	"title": "174.634 PASSENGER RAIL; FUNDING.",
	"text": "(a) The commissioner may apply for funding from federal, state, regional, local, and private sources to carry out the commissioner's duties in section 174.632.\n(b) Section 174.88, subdivision 2, does not apply to the commissioner's performance of duties and exercise of powers under sections 174.632 to 174.636.\n(a) A passenger rail account is established in the special revenue fund. The account consists of funds as provided in this subdivision and any other money donated, allotted, transferred, collected, or otherwise provided to the account.\n(b) By July 15 annually beginning in calendar year 2027, the commissioner of revenue must transfer an amount from the general fund to the passenger rail account that equals 50 percent of the portion of the state general tax under section 275.025 levied on railroad operating property, as defined under section 273.13, subdivision 24, in the prior calendar year.\n(c) Money in the account is annually appropriated to the commissioner of transportation for the operating and capital maintenance costs of intercity passenger rail, which may include but are not limited to planning, designing, developing, constructing, equipping, administering, operating, promoting, maintaining, and improving passenger rail service within the state, after accounting for operating revenue, federal funds, and other sources.\n(d) By November 1 each year, the commissioner must report on the passenger rail account to the chairs and ranking minority members of the legislative committees with jurisdiction over transportation policy and finance. The report must, at a minimum, include:\n(1) the actual revenue and expenditures in each of the previous two fiscal years;\n(2) the budgeted and forecasted revenue and expenditures in the current fiscal year and each fiscal year within the state forecast period;\n(3) the plan for collection of fees and revenue, as defined and authorized under subdivision 3, in the current fiscal year and each fiscal year within the state forecast period; and\n(4) the uses of expenditures or planned expenditures in each fiscal year included under clauses (1) and (2).\n(a) For purposes of this subdivision, \"fees and revenue\" means:\n(1) ridership fees or fares, including ticket sales;\n(2) revenue from the sale of on-board commissary and convenience goods to the traveling public; and\n(3) revenue from the sale of promotional goods related to passenger rail routes and corridors within Minnesota.\n(b) The commissioner may, directly or through a contractor, vendor, operator, or partnership with a federal or state government entity, including Amtrak, collect fees and revenue related to passenger rail services within the state, as specified under this subdivision.\n(c) Fees and revenue under this subdivision may be collected as determined by the commissioner and are not subject to section 16A.1283, except that, if priced exclusively by the commissioner, a ridership fee or fare must not exceed an annual five percent increase and the price of a commissary, convenience, or promotional good must not exceed an annual ten percent increase.\n(d) Fees and revenue collected under this subdivision must be deposited in the passenger rail account in the special revenue fund.",
	"repealed": false
}