{
	"id": "604.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/604.101",
	"title": "604.101 ECONOMIC LOSS DOCTRINE.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Buyer\" means a person who buys or leases or contracts to buy or lease the goods that are alleged to be defective or the subject of a misrepresentation.\n(c) \"Goods\" means tangible personal property, regardless of whether that property is incorporated into or becomes a component of some different property.\n(d) \"Period of restoration\" means the time a reasonable person would find reasonably necessary to repair, replace, rebuild, or restore other tangible property and real property harmed by the defect in the goods to a quality level reasonably equivalent to the quality level that existed before the defect caused the harm, but excluding in all circumstances:\n(1) time necessary to repair, replace, rebuild, or restore the goods themselves;\n(2) delays or other impediments resulting from a difficulty in obtaining financing; and\n(3) delays or other impediments resulting from zoning or environmental requirements imposed by law that did not apply to the use of the harmed property immediately before the harm occurred.\n(e) \"Product defect tort claim\" means a common law tort claim for damages caused by a defect in the goods but does not include statutory claims. A defect in the goods includes a failure to adequately instruct or warn.\n(f) \"Seller\" means a person who sells or leases or contracts to sell or lease the goods that are alleged to be defective or the subject of a misrepresentation.\n(g) If a good is a component of a manufactured good, harm caused by the component good to the manufactured good is not harm to tangible personal property other than the component good.\nThis section does not apply to claims for injury to the person. This section applies to any claim by a buyer against a seller for harm caused by a defect in the goods sold or leased, or for a misrepresentation relating to the goods sold or leased:\n(1) regardless of whether the seller and the buyer were in privity regarding the sale or lease of the goods; and\n(2) regardless of whether article 2 or 2A of the Uniform Commercial Code under chapter 336 governed the sale or lease that caused the seller to be a seller and buyer to be a buyer.\nA buyer may not bring a product defect tort claim against a seller for compensatory damages unless a defect in the goods sold or leased caused harm to the buyer's tangible personal property other than the goods or to the buyer's real property. In any claim brought under this subdivision, the buyer may recover only for:\n(1) loss of, damage to, or diminution in value of the other tangible personal property or real property, including, where appropriate, reasonable costs of repair, replacement, rebuilding, and restoration;\n(2) business interruption losses, excluding loss of good will and harm to business reputation, that actually occur during the period of restoration; and\n(3) additional family, personal, or household expenses that are actually incurred during the period of restoration.\nA buyer may not bring a common law misrepresentation claim against a seller relating to the goods sold or leased unless the misrepresentation was made intentionally or recklessly.\nThe economic loss doctrine applies to claims only as stated in this section. This section does not alter the elements of a product defect tort claim or a common law claim for misrepresentation.\nThis section governs claims by a buyer against a seller if the sale or lease that caused the seller to be a seller and the sale or lease that caused the buyer to be a buyer both occurred on or after August 1, 2000. Section 604.10 does not apply to a claim governed by this section.",
	"repealed": false
}