{
	"id": "15.039",
	"url": "https://www.revisor.mn.gov/statutes/cite/15.039",
	"title": "15.039 EFFECT OF TRANSFER OF POWERS AMONG AGENCIES.",
	"text": "The provisions of this section apply whenever the responsibilities of an agency are transferred by law to another agency unless the act directing the transfer provides otherwise. The term \"responsibilities\" includes powers, duties, rights, obligations, and other authority imposed by law on an agency. The term \"new agency\" means the agency to which responsibilities have been transferred from another agency.\nThe new agency is a continuation of the former agency as to those matters within the jurisdiction of the former agency that are transferred to the new agency. Following a transfer the new agency shall carry out the assigned responsibilities as though the responsibilities of the former agency had not been transferred. A transfer is not a new authority for the purpose of succession to all responsibilities of the former agency as constituted at the time of the transfer.\nAll rules adopted pursuant to responsibilities that are transferred to another agency remain effective and shall be enforced until amended or repealed in accordance with law by the new agency. Any rulemaking authority that existed to implement the responsibilities that are transferred is transferred to the new agency.\nAny proceeding, court action, prosecution, or other business or matter pending on the effective date of a transfer of responsibilities may be conducted and completed by the new agency in the same manner under the same terms and conditions, and with the same effect, as though it involved or were commenced and conducted or completed by the former agency prior to the transfer.\nThe agency whose responsibilities are transferred shall give all contracts, books, maps, plans, papers, records, and property of every description relating to the transferred responsibilities and within its jurisdiction or control to the new agency. The new agency shall accept the material presented. The transfer shall be made in accordance with the directions of the new agency.\nThe new agency is the legal successor in all respects of the agency whose responsibilities are transferred. The bonds, resolutions, contracts, and liabilities of the agency whose responsibilities are transferred become the bonds, resolutions, contracts, and liabilities of the new agency.\nThe unexpended balance of any appropriation to an agency for the purposes of any responsibilities that are transferred to another agency are reappropriated under the same conditions as the original appropriation to the new agency effective on the date of the transfer of responsibilities. If the responsibilities are transferred to more than one agency, the commissioner of management and budget shall allocate any unexpended appropriation to the agencies affected. The new agencies shall pay all valid claims presented against those appropriations.\nAll classified and unclassified positions associated with the responsibilities being transferred are transferred with their incumbents to the new agency. The approved complement for the agency whose responsibilities are being transferred is decreased accordingly. The approved complement for the new agency is increased accordingly. Personnel changes are effective on the date of transfer of responsibilities. Nothing in this subdivision shall be construed as abrogating or modifying any rights now enjoyed by affected employees under the managerial or commissioner's plan under section 43A.18 or the terms of an agreement between an exclusive representative of public employees and the state or one of its appointing authorities.\nAll transfers of motor vehicles or other tangible personal property between agencies or political subdivisions under this section are exempt from the motor vehicle sales tax under chapter 297B and the general sales tax under chapter 297A.",
	"repealed": false
}