{
	"id": "103D.901",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.901",
	"title": "103D.901 ASSESSMENTS; LEVIES.",
	"text": "(a) After the managers file an approved assessment statement listing the property and corporations benefited or damaged or otherwise affected by a project with the auditor of an affected county, the auditor shall assess the amount specified in the assessment statement against the property, municipalities, or other corporations as specified in the pertinent provisions of chapter 103E.\n(b) For a watershed district entirely within the metropolitan area, the auditor must mail an assessment notice to property owners and corporations benefited and damaged before the assessment is made under paragraph (a). The assessment notice must include:\n(1) the amount to be specially assessed against the property;\n(2) the right of the property owner to prepay the entire assessment and to whom prepayment must be made;\n(3) whether partial prepayment of the assessment is authorized;\n(4) the time within which prepayment may be made without interest being charged; and\n(5) the rate of interest to be charged if the assessment is not prepaid within the required time period.\nAfter the assessment statement is filed with the auditor, the county board of each affected county shall provide funds to meet its proportionate share of the total cost of the project, as shown by the engineer's report and order of the managers. The county may issue bonds of the county in the manner provided by section 103E.635.\n(a) The respective county auditors and county treasurers shall levy and collect the amount shown in the tabular statement and lien as provided in sections 103E.601 to 103E.631.\n(b) For a watershed district entirely within the metropolitan area, the auditor must mail an assessment notice to the owners of affected property as provided in subdivision 1, paragraph (b), before the assessment is levied. The assessment may be prepaid as provided in paragraphs (c) and (d).\n(c) For a watershed district entirely within the metropolitan area, a property owner or corporation may prepay the entire assessment at any time before the first installment of the assessment is entered on the tax lists for the year with the interest that has accrued to the date of payment, except that interest may not be charged on an assessment that is prepaid within 30 days after the assessment notice is mailed.\n(d) After the first installment of an assessment is entered on the tax list, a property owner or corporation may prepay the entire assessment remaining due before November 15 with interest accrued to December 31 of the year in which the prepayment is made.\n(e) The money received by the treasurer of a county from the sale of bonds, assessments, or otherwise, for the benefit of the watershed district shall be accounted for by the auditor and paid to the treasurer of the watershed district.\n(a) An assessment may not be levied against property or corporations benefited under this chapter in excess of the amount of benefits received as set by the order of the managers authorizing the construction or implementation of the project or subsequently determined on appeal.\n(b) If the damages for a project financed by special assessment are awarded and confirmed, the managers must determine that the project's benefits exceed the total costs, including damages awarded.\n(c) The managers shall amend the project's statement filed with the county auditor to reflect the amount of damages awarded.\nBefore entering property for which damages were awarded to begin construction or implementation of the project, the managers shall pay the amount of damages awarded less any assessment against the property from the funds provided by the county board under subdivision 3. If the amount of damages is appealed, damages may not be paid until the final determination of the appeal.",
	"repealed": false
}