{
	"id": "116J.64",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.64",
	"title": "116J.64 LOANS TO INDIANS.",
	"text": "For purposes of this section the following terms shall have the meanings ascribed to them herein.\n\"Indian\" means a person who is an enrolled member of a federally recognized Minnesota-based band or tribe.\n\"Person\" means an individual Indian, or a partnership comprising Indians only, or a corporation whose stock is owned wholly by Indians.\n\"Tribal government\" means the reservation business committee, board of trustees, tribal council, federally recognized tribal entity, or equivalent duly constituted tribal authority.\n\"Agency\" means the Department of Employment and Economic Development.\n\"Eligible organization\" means any organization approved by a tribal government to administer its portion of the Indian business loan fund allotted to the tribal government.\n(a) The remaining 20 percent of the tax revenue received by the county auditor under section 273.165, subdivision 1, shall be remitted by the county auditor to the commissioner of management and budget and shall be deposited in an account in the special revenue fund. The account is established under the jurisdiction and control of the agency, which may engage in a business loan program for Indians as that term is defined in subdivision 2.\n(b) The tribal governments or eligible organization may administer the account, provided that, before making any eligible loans, each tribal government must submit to the agency, for its review and approval, a plan for that government's loan program which specifically describes, as to that program, its content, the application and reporting forms, utilization of money, administration, operation, implementation, and other matters required by the agency. The plan may provide for the tribal government to contract with an eligible organization to administer its loan program.\n(c) All such plans must provide for a reasonable balance in the distribution of money appropriated pursuant to this section to make business loans between Indians residing on and off the reservations within the state. Each tribal government may allocate all, or a portion of, the funds in its account to one or more other tribal governments for purposes of making eligible loans. As a condition to the making of such eligible loans, the tribal governments shall enter into a loan agreement and other contractual arrangements with the agency to carry out this chapter, and shall agree that all official books and records relating to the business loan program shall be subject to audit by the legislative auditor in the same manner prescribed for agencies of state government.\n(d) Whenever money is appropriated by the commissioner of management and budget to the agency solely for the purposes in this subdivision, the agency shall record in the Indian business loan account the receipt and disbursement of the money and of the income, gain and loss from the investment and reinvestment of the money.\n(a) An Indian desiring a loan for the purpose of starting a business enterprise or expanding an existing business shall make application to the appropriate tribal government. The application shall be forwarded to the appropriate eligible organization, if it is participating in the program, for consideration in conformity with the plans submitted by said tribal governments. The tribal government may approve the application if it determines that the loan would advance the goals of the Indian business loan program. If the tribal government is not participating in the program, the agency may directly approve or deny the loan application.\n(b) If the application is approved, the tribal government shall forward the application, together with all relevant documents pertinent thereto, to the commissioner of the agency, who shall request a payment to be issued to the applicant or the applicable tribal government, if it is administering the loan, with appropriate notations identifying the borrower.\n(c) The tribal government, eligible organization, or the agency, if it is administering the loan, shall maintain records of transactions for each borrower in a manner consistent with good accounting practice. The interest rate on a loan shall be established by the tribal government or the agency, but may be no less than two percent per annum nor more than ten percent per annum. When any portion of a debt is repaid, the tribal government, eligible organization, or the agency, if it is administering the loan, shall remit the amount so received plus interest paid thereon to the commissioner of management and budget through the agency. The amount so received shall be credited to the Indian business loan account.\n(d) On the placing of a loan, additional money equal to ten percent of the total amount made available to any tribal government, eligible organization, or the agency, if it is administering the loan, for loans during the fiscal year shall be paid to the tribal government, eligible organization, or the agency, prior to December 31 for the purpose of financing administrative costs.\nLoans made under subdivision 7 shall be limited to a period of ten years, if made for the purpose of financing nonreal estate purchases. Loans made for the purpose of financing real estate purchases, where such real property is to be used for nonresidential purposes only, shall be limited to a period of 20 years, and shall be a lien on the real property so acquired. Under no circumstances shall the state take a position junior to third lien. In instances where it is impossible or undesirable to secure a lien against real property, the state may secure a lien against personal property for an amount equal to, or greater than, the face value of the loan to ensure that adequate collateral is provided.\nAny person misrepresenting facts regarding the Indian ancestry of a prospective borrower for the purpose of securing a loan under subdivision 7, whether such borrower is an individual, partnership or corporation, shall be guilty of a gross misdemeanor.\nThe county auditor shall remit the tax revenue received yearly to the commissioner of management and budget as required by subdivision 6 no later than December 15.\nThere is appropriated annually an amount equal to the tax revenue allotted under subdivision 7.",
	"repealed": false
}