{
	"id": "145A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.05",
	"title": "145A.05 LOCAL ORDINANCES.",
	"text": "A county board may adopt ordinances for all or a part of its jurisdiction to regulate actual or potential threats to the public health under this section and section 375.51, unless the ordinances are preempted by, in conflict with, or less restrictive than standards in state law or rule.\nIn addition to powers under sections 35.67 to 35.69, a county board, city council, or municipality may adopt ordinances to issue licenses or otherwise regulate the keeping of animals, to restrain animals from running at large, to authorize the impounding and sale or summary destruction of animals, and to establish pounds.\nUnless preempted by or in conflict with sections 394.21 to 394.37, a county board may adopt ordinances to prevent bringing, depositing, or leaving within the county any unwholesome substance and to require the owners or occupants of lands to remove unwholesome substances or to provide for removal at the expense of the owner or occupant.\nA county board may adopt ordinances to provide for or regulate the disposal of sewage, garbage, and other refuse.\nA county board may adopt ordinances to provide for cleaning and removal of obstructions from waters in the county and to prevent their obstruction or pollution.\nA county board may adopt ordinances to regulate offensive trades, unless the ordinances are preempted by, in conflict with, or less restrictive than standards under sections 394.21 to 394.37. In this subdivision, \"offensive trade\" means a trade or employment that is hurtful to inhabitants within any county, city, or town, dangerous to the public health, injurious to neighboring property, or from which offensive odors arise.\nA county board may adopt ordinances to define public health nuisances and to provide for their prevention or abatement.\nA county board may adopt an ordinance establishing a countywide curfew for unmarried persons under 18 years of age. If the county board of a county located in the seven-county metropolitan area adopts a curfew ordinance under this subdivision, the ordinance shall contain an earlier curfew for children under the age of 12 than for older children.\nA county board may adopt ordinances consistent with this section to administer and enforce the powers and duties delegated by agreement with the commissioner under section 145A.07.\nThe governing body of a city or town may adopt ordinances relating to the public health authorized by law or agreement with the commissioner under section 145A.07. The ordinances must not conflict with or be less restrictive than ordinances adopted by the county board within whose jurisdiction the city or town is located.",
	"repealed": false
}