{
	"id": "122A.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.68",
	"title": "122A.68 TEACHING RESIDENCY PROGRAM.",
	"text": "A school district with a teaching residency plan approved by the Professional Educator Licensing and Standards Board may hire graduates of approved Minnesota teacher preparation programs as teaching residents. A district shall employ each resident for one school year. The district and the resident may agree to extend the residency for one additional school year. A school may employ no more than one teaching resident for every eight full-time equivalent licensed teachers. No more than 600 eligible teachers may be employed as teacher residents in any one school year.\nPersons eligible to be hired as teaching residents must have received their initial license no more than two years prior to applying for a residency and must have less than nine months of full-time equivalency teaching experience as a licensed teacher.\nIn order to be approved by the Professional Educator Licensing and Standards Board, a school district's residency program must at minimum include:\n(1) training to prepare teachers to serve as mentors to teaching residents;\n(2) a team mentorship approach to expose teaching residents to a variety of teaching methods, philosophies, and classroom environments that includes differentiated instructional strategies, effective use of student achievement data, and support for native and English language development across the curriculum and grade levels, among other things;\n(3) ongoing peer coaching and assessment;\n(4) assistance to the teaching resident in preparing an individual professional development plan that includes goals, activities, and assessment methodologies; and\n(5) collaboration with one or more teacher education institutions, career teachers, and other community experts to provide local or regional professional development seminars or other structured learning experiences for teaching residents.\nA teaching resident's direct classroom supervision responsibilities shall not exceed 80 percent of the instructional time required of a full-time equivalent teacher in the district. During the time a resident does not supervise a class, the resident shall participate in professional development activities according to the individual plan developed by the resident in conjunction with the school's mentoring team. Examples of development activities include observing other teachers, sharing experiences with other teaching residents, and professional meetings and workshops.\nA school district must pay a teaching resident a salary equal to 90 percent of the salary of a first-year teacher with a bachelor's degree in the district. The resident shall be a member of the local bargaining unit and shall be covered under the terms of the contract, except for salary and benefits, unless otherwise provided in this subdivision. The school district must provide health insurance coverage for the resident if the district provides it for teachers, and may provide other benefits upon negotiated agreement.\nA teaching residency shall count as one year of a teacher's probationary period under section 122A.40, subdivision 5, or section 122A.41, subdivision 2. A residency extended for one year shall not count as an additional year under this subdivision.\nA school district with an approved teaching residency program may use learning and development revenue for each teaching resident in kindergarten through grade six. A district also may use the revenue for a paraprofessional who is a person of color enrolled in an approved teacher preparation program. A school district must not use a teaching resident to replace an existing teaching position unless:\n(1) there is no teacher available who is properly licensed to fill the vacancy, who has been placed on unrequested leave of absence in the district, and who wishes to be reinstated; and\n(2) the district's collective bargaining agreement includes a memorandum of understanding that permits teaching residents to fill an existing teaching position.\nThe Professional Educator Licensing and Standards Board must develop for teachers of students in prekindergarten through grade 12, model teaching residency outcomes and assessments, and mentoring programs.",
	"repealed": false
}