{
	"id": "97A.505",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.505",
	"title": "97A.505 POSSESSING WILD ANIMALS.",
	"text": "[Repealed, 1987 c 149 art 1 s 54]\n(a) A person may not possess a wild animal that has been unlawfully taken, bought, sold, or possessed outside the state, or unlawfully shipped into the state.\n(b) When entering the state from Canada, a person who possesses fish that were unlawfully taken or possessed under paragraph (a) may be charged in the same manner as for possessing fish that were unlawfully taken or possessed in the state.\n[Repealed, 1987 c 149 art 1 s 54]\nWild animals lawfully taken, bought, sold, or possessed outside the state may be brought or shipped into the state unless otherwise provided by law.\nWild animals taken and tagged on the Red Lake Reservation lands in accordance with the Red Lake Band's Conservation Code and all applicable federal law are considered lawfully taken and possessed under state law. Possessing wild animals harvested under this subdivision is in addition to any state limits.\nA person that stores protected wild animals for others must plainly mark the package, in ink, with the name and address of the owner, the license number of the person taking the animal, and the number and species in the package.\nLawfully taken protected wild animals may be transferred by gift. A person is not required to have a license to possess and transport protected wild animals acquired by gift.\n[Repealed, 1987 c 149 art 1 s 54]\nThis section does not apply to mounted specimens of wild animals, antlers, tanned hides, and dressed furs lawfully taken.\n(a) Importing Cervidae carcasses procured by any means into Minnesota is prohibited except for:\n(1) cut and wrapped meat;\n(2) quarters or other portions of meat with no part of the spinal column or head attached;\n(3) antlers, hides, or teeth;\n(4) if cleaned of all brain tissue, antlers attached to skull caps or whole skulls; and\n(5) finished taxidermy mounts.\n(b) Cervidae carcasses originating from outside Minnesota may be transported on a direct route through the state by nonresidents.\n(c) Heads from cervids with or without the cape and neck attached that originate from outside Minnesota may be transported into Minnesota only if they are delivered to a licensed taxidermist within 48 hours of entering Minnesota.\nA person may not possess live Cervidae, except as authorized in sections 17.452, 35.153, and 35.155 or 97A.401.",
	"repealed": false
}