{
	"id": "27.19",
	"url": "https://www.revisor.mn.gov/statutes/cite/27.19",
	"title": "27.19 VIOLATIONS, PENALTIES.",
	"text": "(a) A person subject to the provisions of this section and sections 27.01 to 27.14 must not:\n(1) make any false statement or report as to the grade, condition, markings, quality, or quantity of produce, as defined in section 27.069, received or delivered, or act in any manner to deceive a consignor or purchaser;\n(2) refuse to accept a shipment contracted for by the person, unless the refusal is based upon the showing of a state inspection certificate secured with reasonable promptness after the receipt of the shipment showing that the kind and quality of produce, as defined in section 27.069, is other than that purchased or ordered by the person;\n(3) fail to account or make a settlement for perishable farm products within the required time;\n(4) violate or fail to comply with the terms or conditions of a contract entered into by the person for the purchase, production, or sale of perishable farm products;\n(5) purchase for a person's own account any produce received on consignment, either directly or indirectly, without the consent of the consignor;\n(6) issue a false or misleading market quotation, or cancel a quotation during the period advertised by the person;\n(7) increase the sales charges on perishable farm products shipped to the person by means of \"dummy\" or fictitious sales;\n(8) receive decorative forest products and the products of farms and waters from foreign states or countries for sale or resale, either within or outside of the state, and give the purchaser the impression, through any method of advertising or description, that the perishable farm products are of Minnesota origin;\n(9) commit to pay and not pay in full for all perishable farm products committed for. A processor may not pay an amount less than the full contract price if the crop produced is satisfactory for processing and is not harvested for reasons within the processor's control. If the processor sets the date for planting, then bunching, unusual yields, and a processor's inability or unwillingness to harvest must be considered to be within the processor's control. Under this clause growers must be compensated for passed acreage at the same rate for grade and yield as they would have received had the crop been harvested in a timely manner minus any contractual provision for green manure or feed value. Both parties are excused from payment or performance for crop conditions that are beyond the control of the parties; or\n(10) discriminate between different sections, localities, communities, or cities, or between persons in the same community, by purchasing perishable farm products from farmers of the same grade, quality, and kind, at different prices, except that price differentials are allowed if directly related to the costs of transportation, shipping, and handling of the perishable farm products and a person is allowed to meet the prices of a competitor in good faith, in the same locality for the same grade, quality, and kind of perishable farm products. A showing of different prices by the commissioner is prima facie evidence of discrimination.\n(b) Any person violating any provision of this chapter, or any rule adopted under this chapter, is guilty of a misdemeanor.\n(c) A separate violation occurs with respect to each different person involved, each purchase or transaction involved, and each false statement.\n(d) Any prosecuting officer to whom the commissioner reports a violation of this chapter, or a violation of any rule adopted under this chapter, must bring appropriate proceedings in a proper court without delay for the enforcement of the penalties under this chapter.\n[Repealed, 2012 c 244 art 1 s 83]\n[Repealed, 2012 c 244 art 1 s 83]\n(a) The commissioner or the commissioner's authorized representative may enter into a written agreement with a person in settlement of an alleged violation whether or not a hearing is held. An agreement must be construed as a \"no contest\" pleading and may encompass sanctions, penalties, and affirmative actions that are mutually satisfactory and are consistent with the intent and purpose of this chapter.\n(b) The agreement is final and conclusive with respect to the action, except upon a showing of fraud or malfeasance or misrepresentation of a material fact. The matter agreed upon in the agreement may not be reopened or modified by an officer, employee, or agent of the state. In an action, suit, or proceeding, the agreement and any determination or payment made under the agreement is final and conclusive and may not be annulled, modified, set aside, or disregarded.",
	"repealed": false
}