{
	"id": "3.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.225",
	"title": "3.225 PROFESSIONAL AND TECHNICAL SERVICE CONTRACTS.",
	"text": "This section applies to a contract for professional or technical services entered into by the house of representatives, the senate, the Legislative Coordinating Commission, or any group under the jurisdiction of the Legislative Coordinating Commission. For purposes of this section, \"professional or technical services\" has the meaning defined in section 16C.08, subdivision 1, but does not include legal services for official legislative business.\nBefore entering into a contract for professional or technical services, the contracting entity must determine that:\n(1) no current legislative employee is able and available to perform the services called for by the contract;\n(2) the work to be performed under the contract is necessary to the entity's achievement of its responsibilities;\n(3) the contract will not establish an employment relationship between the state or the entity and any persons performing under the contract;\n(4) no current legislative employees will engage in the performance of the contract;\n(5) the entity will assign personnel to manage the contract; and\n(6) the combined contract and amendments will not extend for more than five years.\nBefore an entity may seek to enter into a professional or technical services contract valued in excess of $25,000, it must determine that:\n(1) reasonable efforts were made to publicize the availability of the contract to the public; and\n(2) the entity has established any performance measures or other tools that the entity determines are necessary to evaluate contractor performance.\nThe renewal of a professional or technical service contract must comply with all requirements, including notice, applicable to the original contract. A renewal contract must be identified as such. All notices and reports on a renewal contract must state the date of the original contract and the amount previously paid under the contract.\n(a) The house of representatives, the senate, and the Legislative Coordinating Commission shall submit to the Legislative Reference Library by September 1 of each year a listing of all contracts for professional or technical services executed in the preceding fiscal year. The report must identify the parties and the contract amount, duration, and tasks to be performed.\n(b) The yearly report must:\n(1) be sorted by contracting entity and by contractor;\n(2) show the aggregate value of contracts issued by each agency and issued to each contractor;\n(3) distinguish between contracts that are being issued for the first time and contracts that are being renewed;\n(4) state the termination date of each contract; and\n(5) categorize contracts according to subject matter, including topics such as contracts for training, contracts for research and opinions, and contracts for computer systems.\n(c) Within 30 days of final completion of a contract over $40,000 covered by this subdivision, the chief executive of the entity entering into the contract must file a one-page performance report with the Legislative Reference Library. The report must:\n(1) summarize the purpose of the contract, including why it was necessary to enter into a contract;\n(2) state the amount spent on the contract; and\n(3) explain why this amount was a cost-effective way to enable the entity to provide its services or products better or more efficiently.\n(a) A professional or technical services contract must by its terms permit the contracting entity to unilaterally terminate the contract prior to completion, upon payment of just compensation, if the entity determines that further performance under the contract would not serve entity purposes. If the final product of the contract is a written report, a copy must be filed with the Legislative Reference Library.\n(b) The terms of a contract must provide that no more than 90 percent of the amount due under the contract may be paid until the final product has been reviewed by the person entering into the contract on behalf of the contracting entity, and that person has certified that the contractor has satisfactorily fulfilled the terms of the contract.",
	"repealed": false
}