{
	"id": "473F.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/473F.08",
	"title": "473F.08 NET TAX CAPACITY.",
	"text": "The county auditor shall determine the net tax capacity of each governmental unit within the auditor's county in the manner prescribed by this section.\nThe net tax capacity of a governmental unit is its net tax capacity, as determined in accordance with other provisions of law including section 469.177, subdivision 3, subject to the following adjustments:\n(a) There shall be subtracted from its net tax capacity, in each municipality in which the governmental unit exercises ad valorem taxing jurisdiction, an amount which bears the same proportion to 40 percent of the amount certified in that year under sections 473F.06 and 473F.07 for the municipality as the total preceding year's net tax capacity of commercial-industrial property which is subject to the taxing jurisdiction of the governmental unit within the municipality, determined without regard to section 469.177, subdivision 3, bears to the total preceding year's net tax capacity of commercial-industrial property within the municipality, determined without regard to section 469.177, subdivision 3;\n(b) There shall be added to its net tax capacity, in each municipality in which the governmental unit exercises ad valorem taxing jurisdiction, an amount which bears the same proportion to the areawide net tax capacity for the year attributable to that municipality as the total preceding year's net tax capacity of residential property which is subject to the taxing jurisdiction of the governmental unit within the municipality bears to the total preceding year's net tax capacity of residential property of the municipality.\nThe county auditor shall apportion the levy of each governmental unit in the auditor's county in the manner prescribed by this subdivision. The auditor shall:\n(a) by August 20, determine the areawide portion of the levy for each governmental unit by multiplying the local tax rate of the governmental unit for the preceding levy year times the distribution value set forth in subdivision 2, clause (b);\n(b) by September 5, determine the local portion of the current year's levy by subtracting the resulting amount from clause (a) from the governmental unit's current year's levy;\n(c) for determinations made under clause (a) in the case of school districts, for taxes payable in 2002, exclude the general education tax rate and the portion of the referendum tax rate attributable to the first $415 per pupil unit from the local tax rate for the preceding levy year;\n(d) for determinations made under clause (a) in the case of the Metropolitan Council, for taxes payable in 2002, exclude the transit operating tax rate from the local tax rate for the preceding levy year; and\n(e) for determinations made under clause (a) in the case of transit opt-out cities, for taxes payable in 2002, exclude the opt-out transit rate from the local tax rate for the preceding levy year.\n(a) Beginning in 1987 and each subsequent year through 1998, the city of Bloomington shall determine the interest payments for that year for the bonds which have been sold for the highway improvements pursuant to Laws 1986, chapter 391, section 2, paragraph (g). Effective for property taxes payable in 1988 through property taxes payable in 1999, after the Hennepin County auditor has computed the areawide portion of the levy for the city of Bloomington pursuant to subdivision 3, clause (a), the auditor shall annually add a dollar amount to the city of Bloomington's areawide portion of the levy equal to the amount which has been certified to the auditor by the city of Bloomington for the interest payments for that year for the bonds which were sold for highway improvements. The total areawide portion of the levy for the city of Bloomington including the additional amount for interest repayment certified pursuant to this subdivision shall be certified by the Hennepin County auditor to the administrative auditor pursuant to subdivision 5. The Hennepin County auditor shall distribute to the city of Bloomington the additional areawide portion of the levy computed pursuant to this subdivision at the same time that payments are made to the other counties pursuant to subdivision 7a. For property taxes payable from the year 2009 through 2014, the Hennepin County auditor shall adjust Bloomington's contribution to the areawide gross tax capacity upward each year by a value equal to ten percent of the total additional areawide levy distributed to Bloomington under this subdivision from 1988 to 1999, divided by the areawide tax rate for taxes payable in the previous year.\n(b) For property taxes payable from 2015 through 2018, the administrative auditor shall increase the areawide net tax capacity each year by an amount equal to ten percent of the total additional areawide levy distributed to Bloomington under this subdivision from 1988 to 1999, divided by the areawide tax rate for taxes payable in the previous year. The administrative auditor must notify the commissioner of revenue of the amount determined by multiplying the increase in the areawide net tax capacity by the areawide tax rate determined under subdivision 5. The commissioner of revenue must pay the amount determined each payable year to the administrative auditor in two installments on July 10 and November 10, for distribution and settlement as provided in subdivision 7a.\n(c) A sum sufficient to meet the obligations under this subdivision is annually appropriated from the general fund to the commissioner of revenue.\n(a) The Hennepin County auditor shall certify the city of Bloomington's interest payments for 1987 for the bonds which were sold for highway improvements pursuant to Laws 1986, chapter 391, section 2, paragraph (g), and which were certified as an addition to the city of Bloomington's areawide levy for taxes payable in 1988.\n(b) For taxes payable in 1996 through taxes payable in 1999, the Hennepin County auditor shall certify the amount calculated by subtracting the amount certified under subdivision 3a from the amount in paragraph (a). For taxes payable in 2000 and subsequent years, the Hennepin County auditor shall certify the amount calculated in paragraph (a).\n(c) The Metropolitan Council may annually certify to the Ramsey County auditor the amount calculated under paragraph (b), or a lesser amount, but not to exceed $5,000,000, to be used to provide funds for the cleanup of polluted lands in the metropolitan area.\n(d) The amount certified under paragraph (c) shall be certified annually by the Ramsey County auditor to the administrative auditor as an addition to the Metropolitan Council's areawide levy under subdivision 5.\n(a) When computing the net tax capacity under section 473F.05, the Hennepin County auditor shall exclude the captured tax capacity of Tax Increment Financing Districts No. 1-C and No. 1-G in the city of Bloomington.\n(b) Notwithstanding the provisions of subdivision 2, paragraph (a), the commercial-industrial contribution percentage for the city of Bloomington is the contribution net tax capacity divided by the total net tax capacity of commercial-industrial property in the city, excluding any commercial-industrial property that is captured tax capacity of Tax Increment Financing Districts No. 1-C and No. 1-G.\n(c) The property taxes to be paid on commercial-industrial tax capacity that is included in the captured tax capacity of Tax Increment Financing Districts No. 1-C and No. 1-G in the city of Bloomington must be determined as described in subdivision 6, except that the portion of the tax that is based on the areawide tax rate is to be treated as tax increment under section 469.176.\n(d) The provisions of this subdivision take effect only if the clerk of the city of Bloomington certifies to the Hennepin County auditor that the city has entered into a binding written agreement with the Metropolitan Council to repair and restore, or to replace, the old Cedar Avenue bridge for use by bicycle commuters and recreational users.\n(e) This subdivision expires on the earliest of the following dates:\n(1) when the tax increment financing districts have been decertified in 2024 or 2035, as provided by Laws 2013, chapter 143, article 9, section 22, subdivision 2 or 4; or\n(2) on January 1, 2014, if the city clerk fails to make the certification provided in paragraph (d) or if the city fails to file its local approval of Laws 2013, chapter 143, article 9, section 23, with the secretary of state by December 31, 2013.\nIn 1972 and subsequent years, the county auditor shall divide that portion of the levy determined pursuant to subdivision 3, clause (b), by the net tax capacity of the governmental unit, taking section 469.177, subdivision 3, into account, less that portion subtracted from net tax capacity pursuant to subdivision 2, clause (a). The resulting tax rate shall apply to all taxable property except commercial-industrial property, which shall be taxed in accordance with subdivision 6.\nOn or before August 25 of each year, the county auditor shall certify to the administrative auditor that portion of the levy of each governmental unit determined under subdivisions 3, clause (a), 3a, and 3b. The administrative auditor shall then determine the areawide tax rate sufficient to yield an amount equal to the sum of such levies from the areawide net tax capacity. On or before September 1 of each year, the administrative auditor shall certify the areawide tax rate to each of the county auditors.\nIf a governmental unit is located in two or more counties, the computations and certifications required by subdivisions 3 to 5 with respect to it shall be made by the county auditor who is responsible under other provisions of law for allocating its levies between or among the affected counties.\nThe areawide tax rate determined in accordance with subdivision 5 shall apply to each commercial-industrial property subject to taxation within a municipality, including property located within any tax increment financing district, as defined in section 469.174, subdivision 9, to that portion of the net tax capacity of the item which bears the same proportion to its total net tax capacity as 40 percent of the amount determined under sections 473F.06 and 473F.07 is to the amount determined under section 473F.05. The tax rate determined in accordance with subdivision 4 shall apply in the taxation of the remainder of the net tax capacity of the item.\nMS 1978 [Repealed, 1980 c 437 s 20]\nThe administrative auditor shall determine for each county the difference between the total levy on distribution value pursuant to subdivisions 3, clause (a), 3a, and 3b, within the county and the total tax on contribution value pursuant to subdivision 6, within the county. On or before May 16 of each year, the administrative auditor shall certify the differences so determined to each county auditor. In addition, the administrative auditor shall certify to those county auditors for whose county the total tax on contribution value exceeds the total levy on distribution value the settlement the county is to make to the other counties of the excess of the total tax on contribution value over the total levy on distribution value in the county. On or before June 15 and November 15 of each year, each county treasurer in a county having a total tax on contribution value in excess of the total levy on distribution value shall pay one-half of the excess to the other counties in accordance with the administrative auditor's certification.\nMS 1978 [Repealed, 1980 c 437 s 20]\nIn any year in which the highest classification rate for class 3a property changes from the rate in the previous year, the following adjustments shall be made to the procedures described in sections 473F.06 to 473F.08.\n(1) An initial contribution tax capacity shall be determined for each municipality based on the previous year's classification rates.\n(2) Each jurisdiction's distribution tax capacity shall be determined based upon the areawide tax base determined by summing the tax capacities computed under clause (1) for all municipalities and apportioning the resulting sum pursuant to section 473F.07, subdivision 5.\n(3) Each jurisdiction's distribution levy shall be determined by applying the procedures described in subdivision 3, clause (a), to the distribution tax capacity determined pursuant to clause (2).\n(4) Each municipality's final contribution tax capacity shall be determined equal to its initial contribution tax capacity multiplied by the ratio of the new highest classification rate for class 3a property to the previous year's highest classification rate for class 3a property.\n(5) For the purposes of computing education aids and any other state aids requiring the addition of the fiscal disparities distribution tax capacity to the local tax capacity, each municipality's final distribution tax capacity shall be determined equal to its initial distribution tax capacity multiplied by the ratio of the new highest classification rate for class 3a property to the previous year's highest classification rate for class 3a property.\n(6) The areawide tax rate shall be determined by dividing the sum of the amounts determined in clause (3) by the sum of the values determined in clause (4).\n(7) The final contribution tax capacity determined in clause (4) shall also be used to determined the portion of each commercial/industrial property's tax capacity subject to the areawide tax rate pursuant to subdivision 6.\nMS 1974 [Repealed, 1976 c 191 s 14]\nFor the purpose of computing fiscal capacity under section 473F.02, subdivision 14, a municipality's taxable market value shall be adjusted to reflect the reductions to net tax capacity effected by subdivision 2, clause (a), provided that in determining the taxable market value of commercial-industrial property or any class thereof within a municipality, the reduction required by this subdivision shall be that amount which bears the same proportion to the amount subtracted from the municipality's net tax capacity pursuant to subdivision 2, clause (a), as the taxable market value of commercial-industrial property, or such class thereof, located within the municipality bears to the net tax capacity of commercial-industrial property, or such class thereof, located within the municipality. No adjustment shall be made to taxable market value for the increase in net tax capacity under subdivision 2, clause (b).\nMS 1980 [Repealed, 1Sp1981 c 4 art 1 s 192]",
	"repealed": false
}