{
	"id": "16E.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/16E.01",
	"title": "16E.01 DEPARTMENT OF INFORMATION TECHNOLOGY SERVICES.",
	"text": "The Department of Information Technology Services, which may also be known as Minnesota Information Technology Services or Minnesota IT Services, referred to in this chapter as the \"department,\" is an agency in the executive branch headed by a commissioner, who also is the chief information officer. The appointment of the commissioner is subject to the advice and consent of the senate under section 15.066.\nThe department shall provide oversight, leadership, and direction for information and telecommunications technology policy and the management, delivery, accessibility, and security of executive branch information and telecommunications technology systems and services in Minnesota. The department shall partner with executive branch state agencies to manage strategic investments in information and telecommunications technology systems and services to ensure sufficient access to and efficient delivery of accessible government services and to maximize benefits for the state government as an enterprise.\nThe commissioner may appoint a deputy, assistant commissioners, and a confidential secretary. Each serves at the commissioner's pleasure in the unclassified service.\nThe department may:\n(1) enter into contracts for goods or services with public or private organizations and charge fees for services it provides;\n(2) apply for, receive, and expend money from public agencies;\n(3) apply for, accept, and disburse grants and other aids from the federal government and other public or private sources;\n(4) enter into contracts with agencies of the federal government, local governmental units, the University of Minnesota and other educational institutions, and private persons and other nongovernmental organizations as necessary to perform its statutory duties;\n(5) sponsor and conduct conferences and studies, collect and disseminate information, and issue reports relating to information and communications technology issues;\n(6) review the technology infrastructure of regions of the state and cooperate with and make recommendations to the governor, legislature, state agencies, local governments, local technology development agencies, the federal government, private businesses, and individuals for the realization of information and communications technology infrastructure development potential;\n(7) sponsor, support, and facilitate innovative and collaborative economic and community development and government services projects or initiatives, including technology initiatives related to culture and the arts, with public and private organizations; and\n(8) review and recommend alternative sourcing strategies for state information and communications systems.\n(a) The department shall:\n(1) manage the efficient and effective use of available federal, state, local, and public-private resources to develop statewide information and telecommunications technology systems and services and its infrastructure;\n(2) approve state agency and intergovernmental information and telecommunications technology systems and services development efforts involving state or intergovernmental funding, including federal funding, provide information to the legislature regarding projects and initiatives reviewed, and recommend projects and initiatives for inclusion in the governor's budget under section 16A.11;\n(3) promote cooperation and collaboration among state and local governments in developing intergovernmental information and telecommunications technology systems and services;\n(4) cooperate and collaborate with the legislative and judicial branches in the development of information and communications systems in those branches, as requested;\n(5) continue to collaborate on the development of MN.gov, the state's official comprehensive online service and information initiative;\n(6) manage and promote the regular and periodic reinvestment in the information and telecommunications technology systems and services infrastructure so that state and local government agencies can effectively and efficiently serve their customers;\n(7) facilitate the cooperative development of and ensure compliance with standards and policies for information and telecommunications technology systems and services and electronic data practices and security within the executive branch;\n(8) eliminate unnecessary duplication of existing information and telecommunications technology systems and services provided by state agencies;\n(9) identify, sponsor, develop, and execute shared information and telecommunications technology projects and initiatives, and ongoing operations;\n(10) ensure overall security of the state's information and technology systems and services; and\n(11) manage and direct compliance with accessibility standards for informational technology, including hardware, software, websites, online forms, and online surveys.\n(b) The chief information officer, in consultation with the commissioner of management and budget, must determine when it is cost-effective for agencies to develop and use shared information technology systems, platforms, and services for the delivery of digital government services. The chief information officer may require agencies to use shared information and telecommunications technology systems and services. The chief information officer shall establish reimbursement rates in cooperation with the commissioner of management and budget to be billed to agencies and other governmental entities sufficient to cover the actual development, operating, maintenance, and administrative costs of the shared systems. The methodology for billing may include the use of interagency agreements, or other means as allowed by law.\n(c) A state agency that has an information and telecommunications technology project or initiative, whether funded as part of the biennial budget or by any other means, shall register with the department by submitting basic project or initiative startup documentation as specified by the chief information officer in both format and content. State agency business and technology project leaders, in accordance with policies and standards set forth by the chief information officer, must demonstrate that the project or initiative will be properly managed, ensure alignment with enterprise technology strategic direction, provide updates to the project or initiative documentation as changes are proposed, and regularly report on the current status of the project or initiative on a schedule agreed to with the chief information officer. The chief information officer has the authority to define a project or initiative for the purposes of this chapter.\n(d) The chief information officer shall monitor progress on active information and telecommunications technology projects and initiatives and report on the performance of the projects or initiatives in comparison with plans in terms of time, scope, and budget. The chief information officer may conduct an independent audit of the project or initiative. If an independent audit is conducted, the audit analysis and evaluation of the project or initiative must be presented to agency executive sponsors, the project governance bodies, and the chief information officer. All reports and responses must become part of the project or initiative record.\n(e) For any active information and telecommunications technology project or initiative, with a total expected cost of more than $10,000,000, an annual independent audit that conforms to published audit principles adopted by the department must be conducted.\n(f) The chief information officer shall report by January 15 of each year to the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over the department on the status of the state's comprehensive project and initiatives portfolio. The report must include descriptions of each project and its current status, information technology costs associated with the project, and estimated date on when the information technology project is expected to be completed.",
	"repealed": false
}