{
	"id": "144G.45",
	"url": "https://www.revisor.mn.gov/statutes/cite/144G.45",
	"title": "144G.45 MINIMUM SITE, PHYSICAL ENVIRONMENT, AND FIRE SAFETY REQUIREMENTS.",
	"text": "The following are required for all assisted living facilities:\n(1) public utilities must be available, and working or inspected and approved water and septic systems must be in place;\n(2) the location must be publicly accessible to fire department services and emergency medical services;\n(3) the location's topography must provide sufficient natural drainage and is not subject to flooding;\n(4) all-weather roads and walks must be provided within the lot lines to the primary entrance and the service entrance, including employees' and visitors' parking at the site; and\n(5) the location must include space for outdoor activities for residents.\n(a) Each assisted living facility must comply with the State Fire Code in Minnesota Rules, chapter 7511, and:\n(1) for dwellings or sleeping units, as defined in the State Fire Code:\n(i) provide smoke alarms in each room used for sleeping purposes;\n(ii) provide smoke alarms outside each separate sleeping area in the immediate vicinity of bedrooms;\n(iii) provide smoke alarms on each story within a dwelling unit, including basements, but not including crawl spaces and unoccupied attics;\n(iv) where more than one smoke alarm is required within an individual dwelling unit or sleeping unit, interconnect all smoke alarms so that actuation of one alarm causes all alarms in the individual dwelling unit or sleeping unit to operate; and\n(v) ensure the power supply for existing smoke alarms complies with the State Fire Code, except that newly introduced smoke alarms in existing buildings may be battery operated;\n(2) install and maintain portable fire extinguishers in accordance with the State Fire Code;\n(3) install portable fire extinguishers having a minimum 2-A:10-B:C rating within Group R-3 occupancies, as defined by the State Fire Code, located so that the travel distance to the nearest fire extinguisher does not exceed 75 feet, and maintained in accordance with the State Fire Code; and\n(4) keep the physical environment, including walls, floors, ceiling, all furnishings, grounds, systems, and equipment in a continuous state of good repair and operation with regard to the health, safety, comfort, and well-being of the residents in accordance with a maintenance and repair program.\n(b) Each assisted living facility shall develop and maintain fire safety and evacuation plans. The plans shall include but are not limited to:\n(1) location and number of resident sleeping rooms;\n(2) staff actions to be taken in the event of a fire or similar emergency;\n(3) fire protection procedures necessary for residents; and\n(4) procedures for resident movement, evacuation, or relocation during a fire or similar emergency including the identification of unique or unusual resident needs for movement or evacuation.\n(c) Staff of assisted living facilities shall receive training on the fire safety and evacuation plans upon hiring and at least twice per year thereafter.\n(d) Fire safety and evacuation plans shall be readily available at all times within the facility.\n(e) Residents who are capable of assisting in their own evacuation shall be trained on the proper actions to take in the event of a fire to include movement, evacuation, or relocation. The training shall be made available to residents at least once per year.\n(f) Evacuation drills are required for staff twice per year per shift with at least one evacuation drill every other month. Evacuation of the residents is not required. Fire alarm system activation is not required to initiate the evacuation drill.\n(g) Existing construction or elements, including assisted living facilities that were registered as housing with services establishments under chapter 144D prior to August 1, 2021, shall be permitted to continue in use provided such use does not constitute a distinct hazard to life. Any existing elements that an authority having jurisdiction deems a distinct hazard to life must be corrected. The facility must document in the facility's records any actions taken to comply with a correction order, and must submit to the commissioner for review and approval prior to correction.\nAssisted living facilities shall comply with all applicable state and local governing laws, regulations, standards, ordinances, and codes for fire safety, building, and zoning requirements, except a facility with a licensed resident capacity of six or fewer is exempt from rental licensing regulations imposed by any town, municipality, or county.\n(a) All assisted living facilities with six or more residents must meet the provisions relevant to assisted living facilities in the 2018 edition of the Facility Guidelines Institute \"Guidelines for Design and Construction of Residential Health, Care and Support Facilities\" and of adopted rules. This minimum design standard must be met for all new licenses or new construction. In addition to the guidelines, assisted living facilities shall provide the option of a bath in addition to a shower for all residents.\n(b) If the commissioner decides to update the edition of the guidelines specified in paragraph (a) for purposes of this subdivision, the commissioner must notify the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health care and public safety of the planned update by January 15 of the year in which the new edition will become effective. Following notice from the commissioner, the new edition shall become effective for assisted living facilities beginning August 1 of that year, unless provided otherwise in law. The commissioner shall, by publication in the State Register, specify a date by which facilities must comply with the updated edition. The date by which facilities must comply shall not be sooner than six months after publication of the commissioner's notice in the State Register.\n(a) All assisted living facilities with six or more residents must meet the applicable provisions of the 2018 edition of the NFPA Standard 101, Life Safety Code, Residential Board and Care Occupancies chapter. The minimum design standard shall be met for all new licenses or new construction.\n(b) If the commissioner decides to update the Life Safety Code for purposes of this subdivision, the commissioner must notify the chairs and ranking minority members of the legislative committees and divisions with jurisdiction over health care and public safety of the planned update by January 15 of the year in which the new Life Safety Code will become effective. Following notice from the commissioner, the new edition shall become effective for assisted living facilities beginning August 1 of that year, unless provided otherwise in law. The commissioner shall, by publication in the State Register, specify a date by which facilities must comply with the updated Life Safety Code. The date by which facilities must comply shall not be sooner than six months after publication of the commissioner's notice in the State Register.\n(a) For all new licensure and construction beginning on or after August 1, 2021, the following must be provided to the commissioner:\n(1) architectural and engineering plans and specifications for new construction must be prepared and signed by architects and engineers who are registered in Minnesota. Final working drawings and specifications for proposed construction must be submitted to the commissioner for review and approval;\n(2) final architectural plans and specifications must include elevations and sections through the building showing types of construction, and must indicate dimensions and assignments of rooms and areas, room finishes, door types and hardware, elevations and details of nurses' work areas, utility rooms, toilet and bathing areas, and large-scale layouts of dietary and laundry areas. Plans must show the location of fixed equipment and sections and details of elevators, chutes, and other conveying systems. Fire walls and smoke partitions must be indicated. The roof plan must show all mechanical installations. The site plan must indicate the proposed and existing buildings, topography, roadways, walks and utility service lines; and\n(3) final mechanical and electrical plans and specifications must address the complete layout and type of all installations, systems, and equipment to be provided. Heating plans must include heating elements, piping, thermostatic controls, pumps, tanks, heat exchangers, boilers, breeching, and accessories. Ventilation plans must include room air quantities, ducts, fire and smoke dampers, exhaust fans, humidifiers, and air handling units. Plumbing plans must include the fixtures and equipment fixture schedule; water supply and circulating piping, pumps, tanks, riser diagrams, and building drains; the size, location, and elevation of water and sewer services; and the building fire protection systems. Electrical plans must include fixtures and equipment, receptacles, switches, power outlets, circuits, power and light panels, transformers, and service feeders. Plans must show location of nurse call signals, cable lines, fire alarm stations, and fire detectors and emergency lighting.\n(b) Unless construction is begun within one year after approval of the final working drawing and specifications, the drawings must be resubmitted for review and approval.\n(c) The commissioner must be notified within 30 days before completion of construction so that the commissioner can make arrangements for a final inspection by the commissioner.\n(d) At least one set of complete life safety plans, including changes resulting from remodeling or alterations, must be kept on file in the facility.\n(a) A facility may request that the commissioner grant a variance or waiver from the provisions of this section or section 144G.81, subdivision 5. A request for a waiver must be submitted to the commissioner in writing. Each request must contain:\n(1) the specific requirement for which the variance or waiver is requested;\n(2) the reasons for the request;\n(3) the alternative measures that will be taken if a variance or waiver is granted;\n(4) the length of time for which the variance or waiver is requested; and\n(5) other relevant information deemed necessary by the commissioner to properly evaluate the request for the waiver.\n(b) The decision to grant or deny a variance or waiver must be based on the commissioner's evaluation of the following criteria:\n(1) whether the waiver will adversely affect the health, treatment, comfort, safety, or well-being of a resident;\n(2) whether the alternative measures to be taken, if any, are equivalent to or superior to those permitted under section 144G.81, subdivision 5;\n(3) whether compliance with the requirements would impose an undue burden on the facility; and\n(4) notwithstanding clause (1), for construction existing as of August 1, 2021, the commissioner's evaluation of a variance from the requirement to provide an option for a bath under subdivision 4, paragraph (a), must be based on clauses (2) and (3) and whether the variance will adversely affect the health, treatment, or safety of a resident.\n(c) The commissioner must notify the facility in writing of the decision. If a variance or waiver is granted, the notification must specify the period of time for which the variance or waiver is effective and the alternative measures or conditions, if any, to be met by the facility.\n(d) Alternative measures or conditions attached to a variance or waiver have the force and effect of this chapter and are subject to the issuance of correction orders and fines in accordance with sections 144G.30, subdivision 7, and 144G.31. The amount of fines for a violation of this subdivision is that specified for the specific requirement for which the variance or waiver was requested.\n(e) A request for renewal of a variance or waiver must be submitted in writing at least 45 days before its expiration date. Renewal requests must contain the information specified in paragraph (b). A variance or waiver must be renewed by the commissioner if the facility continues to satisfy the criteria in paragraph (a) and demonstrates compliance with the alternative measures or conditions imposed at the time the original variance or waiver was granted.\n(f) The commissioner must deny, revoke, or refuse to renew a variance or waiver if it is determined that the criteria in paragraph (a) are not met. The facility must be notified in writing of the reasons for the decision and informed of the right to appeal the decision.\n(g) A facility may contest the denial, revocation, or refusal to renew a variance or waiver by requesting a contested case hearing under chapter 14. The facility must submit, within 15 days of the receipt of the commissioner's decision, a written request for a hearing. The request for hearing must set forth in detail the reasons why the facility contends the decision of the commissioner should be reversed or modified. At the hearing, the facility has the burden of proving by a preponderance of the evidence that the facility satisfied the criteria specified in paragraph (b), except in a proceeding challenging the revocation of a variance or waiver.",
	"repealed": false
}