{
	"id": "260C.335",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.335",
	"title": "260C.335 CIVIL JURISDICTION OVER PERSONS CONTRIBUTING TO NEED FOR PROTECTION OR SERVICES; COURT ORDERS.",
	"text": "The juvenile court has civil jurisdiction over persons contributing to the need for protection or services of a child under the provisions of this section.\nA request for jurisdiction over a person described in subdivision 1 shall be initiated by the filing of a verified petition by the county attorney having jurisdiction over the place where the child is found, resides, or where the alleged act of contributing occurred. A prior or pending petition alleging that the child is in need of protection or services is not a prerequisite to a petition under this section. The petition shall allege the factual basis for the claim that the person is contributing to the child's need for protection or services. If the court determines, upon review of the verified petition, that probable cause exists to believe that the person has contributed to the child's need for protection or services, the court shall issue an order to show cause why the person should not be subject to the jurisdiction of the court. The order to show cause and a copy of the verified petition shall be served personally upon the person and shall set forth the time and place of the hearing to be conducted under subdivision 3.\n(a) The court shall conduct a hearing on the petition in accordance with the procedures contained in paragraph (b).\n(b) Hearings under this subdivision shall be without a jury. The rules of evidence promulgated pursuant to section 480.0591 and the provisions under section 260C.165 shall apply. In all proceedings under this section, the court shall admit only evidence that would be admissible in a civil trial. When the respondent is an adult, hearings under this subdivision shall be open to the public. Hearings shall be conducted within five days of personal service of the order to show cause and may be continued for a reasonable period of time if a continuance is in the best interest of the child or in the interests of justice.\n(c) At the conclusion of the hearing, if the court finds by a fair preponderance of the evidence that the person has contributed to the child's need for protection or services, as defined in section 260C.425, the court may make any of the following orders:\n(1) restrain the person from any further act or omission in violation of section 260C.425;\n(2) prohibit the person from associating or communicating in any manner with the child;\n(3) require the person to participate in evaluation or services determined necessary by the court to correct the conditions that contributed to the child's need for protection or services;\n(4) require the person to provide supervision, treatment, or other necessary care;\n(5) require the person to pay restitution to a victim for pecuniary damages arising from an act of the child relating to the child's need for protection or services;\n(6) require the person to pay the cost of services provided to the child or for the child's protection; or\n(7) require the person to provide for the child's maintenance or care if the person is responsible for the maintenance or care, and direct when, how, and where money for the maintenance or care shall be paid. If the person is receiving public assistance for the child's maintenance or care, the court shall authorize the public agency responsible for administering the public assistance funds to make payments directly to vendors for the cost of food, shelter, medical care, utilities, and other necessary expenses.\n(d) An order issued under this section shall be for a fixed period of time, not to exceed one year. The order may be renewed or modified prior to expiration upon notice and motion when there has not been compliance with the court's order or the order continues to be necessary to eliminate the contributing behavior or to mitigate its effect on the child.\nThe county attorney may bring both a criminal proceeding under section 260C.425 and a civil action under this section.",
	"repealed": false
}