{
	"id": "524.5-121",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-121",
	"title": "524.5-121 BILL OF PARTICULARS.",
	"text": "(a) When a bill of particulars is required to be filed under this chapter, it shall be filed pursuant to a form approved by the court. In the absence of a court form, a bill of particulars shall specify the confidential or nonpublic information within the text of the form or as an appendix to the form, including a reference to where the information is located in the pleadings, captioned consistent with the current proceedings, and identification of the bill of particulars as a confidential document. A bill of particulars must be filed consistent with all applicable court rules for submitting confidential or nonpublic documents, including Rule 11 of the Minnesota Rules of General Practice and the Rules of Public Access to Records of the Judicial Branch.\n(b) Notwithstanding any provision of this article or of any other law to the contrary, a bill of particulars filed pursuant to this chapter shall be served upon:\n(1) the respondent or the respondent's attorneys;\n(2) the person subject to guardianship or their attorneys;\n(3) the person subject to conservatorship or their attorneys; and\n(4) interested persons or their attorneys who file objections in a guardianship or conservatorship or protective proceeding or object to a particular account, report or pleading filed with a bill of particulars.\n(c) Notwithstanding any provision of this article or of any other law to the contrary, a bill of particulars filed pursuant to this chapter shall be served upon or otherwise provided to:\n(1) any person upon consent of: the respondent or the respondent's attorneys, the person subject to guardianship or the person's attorneys, the person subject to conservatorship or the person's attorneys, the respondent's guardian or conservator, or the guardian or conservator's attorneys; and\n(2) other persons by order of the court for good cause shown.\n(d) Any person served or provided with a bill of particulars may only disclose the information within it to those authorized to receive the information as provided for in this section. This limitation of disclosure shall be stated in the bill of particulars.\n(e) A filing of a bill of particulars consistent with this chapter is not a violation of the Minnesota Health Records Act or section 144.293.",
	"repealed": false
}