{
	"id": "97B.025",
	"url": "https://www.revisor.mn.gov/statutes/cite/97B.025",
	"title": "97B.025 HUNTER AND TRAPPER EDUCATION.",
	"text": "(a) The commissioner may establish education courses for hunters. The commissioner shall collect a fee from each person attending a course. A fee, to include a $1 issuing fee for licensing agents, shall be collected for issuing a duplicate certificate. The commissioner shall establish the fees in a manner that neither significantly overrecovers nor underrecovers costs, including overhead costs, involved in providing the services. The fees are not subject to the rulemaking provisions of chapter 14, and section 14.386 does not apply. The commissioner may establish the fees notwithstanding section 16A.1283. The fees, except for the issuing fee for licensing agents under this subdivision, shall be deposited in the game and fish fund and the amount thereof, except for the electronic licensing system commission established by the commissioner under section 84.027, subdivision 15, is appropriated annually to the Enforcement Division of the Department of Natural Resources for the administration of the program. In addition to the fee established by the commissioner for each course, instructors may charge each person up to the established fee amount for class materials and expenses. School districts may cooperate with the commissioner and volunteer instructors to provide space for the classroom portion of the training.\n(b) The commissioner shall enter into an agreement with a statewide nonprofit trappers association to conduct a trapper education program. At a minimum, the program must include at least six hours of classroom, electronic, or correspondence instruction and in the field training. The program must include a review of state trapping laws and regulations, trapping ethics, the setting and tending of traps and snares, tagging and registration requirements, and the preparation of pelts. The association shall issue a certificate to persons who complete the program. The association shall be responsible for all costs of conducting the education program, and shall not charge any fee for attending the course.",
	"repealed": false
}