{
	"id": "136A.833",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.833",
	"title": "136A.833 EXEMPTIONS.",
	"text": "A school that seeks an exemption from the provisions of sections 136A.822 to 136A.834 for the school and all of its programs or some of its programs must apply to the office to establish that the school or program meets the requirements of an exemption. An exemption for the school or program expires two years from the date of approval or when a school adds a new program or makes a modification equal to or greater than 25 percent to an existing educational program. If a school is reapplying for an exemption, the application must be submitted to the office 90 days before the current exemption expires. This exemption shall not extend to any school that uses any publication or advertisement that is not truthful and gives any false, fraudulent, deceptive, inaccurate, or misleading impressions about the school or its personnel, programs, services, or occupational opportunities for its graduates for promotion and student recruitment. Exemptions denied under this section are subject to appeal under section 136A.829. If an appeal is initiated, the denial of the exemption is not effective until the final determination of the appeal, unless immediate effect is ordered by the court.\nSections 136A.821 to 136A.832 shall not apply to the following:\n(1) public postsecondary institutions;\n(2) postsecondary institutions registered under sections 136A.61 to 136A.71;\n(3) postsecondary institutions exempt from registration under sections 136A.653, subdivisions 1b, 2, 3, and 3a; 136A.657; and 136A.658;\n(4) private schools complying with the requirements of section 120A.22, subdivision 4;\n(5) courses taught to students in an apprenticeship program registered by the United States Department of Labor or Minnesota Department of Labor and taught by or required by a trade union. A trade union is an organization of workers in the same skilled occupation or related skilled occupations who act together to secure all members favorable wages, hours, and other working conditions;\n(6) private career schools exclusively engaged in training physically or mentally disabled persons;\n(7) private career schools licensed or approved by boards authorized under Minnesota law to issue licenses for training programs except private career schools required to obtain a private career school license due to the use of \"academy,\" \"institute,\" \"college,\" or \"university\" in their names;\n(8) private career schools and educational programs, or training programs, contracted for by persons, firms, corporations, government agencies, or associations, for the training of their own employees, for which no fee is charged the employee, regardless of whether that fee is reimbursed by the employer or third party after the employee successfully completes the training;\n(9) private career schools engaged exclusively in the teaching of purely avocational, recreational, or remedial subjects that are not advertised or maintained for vocational or career advancement, including adult basic education, as determined by the office except private career schools required to obtain a private career school license due to the use of \"college\" or \"university\" in their names;\n(10) classes, courses, or programs conducted by a bona fide trade, professional, or fraternal organization, solely for that organization's membership and not available to the public. In making the determination that the organization is bona fide, the office may request the school provide three certified letters from persons that qualify as evaluators under section 136A.828, subdivision 3, paragraph (l), that the organization is recognized in Minnesota;\n(11) programs in the fine arts provided by organizations exempt from taxation under section 290.05 and registered with the attorney general under chapter 309. For the purposes of this clause, \"fine arts\" means activities resulting in artistic creation or artistic performance of works of the imagination which are engaged in for the primary purpose of creative expression rather than commercial sale, vocational or career advancement, or employment. In making this determination the office may seek the advice and recommendation of the Minnesota Board of the Arts;\n(12) classes, courses, or programs intended to fulfill the continuing education requirements for a bona fide licensure or certification in a profession, that have been approved by a legislatively or judicially established board or agency responsible for regulating the practice of the profession or by an industry-specific certification entity, and that are offered exclusively to individuals with the professional licensure or certification. In making the determination that the licensure or certification is bona fide, the office may request the school provide three certified letters from persons that qualify as evaluators under section 136A.828, subdivision 3, paragraph (l), that the licensure and certification is recognized in Minnesota;\n(13) review classes, courses, or programs intended to prepare students to sit for undergraduate, graduate, postgraduate, or occupational licensing, certification, or entrance examinations and does not include the instruction to prepare students for that license, occupation, certification, or exam;\n(14) classes, courses, or programs providing 16 or fewer clock hours of instruction;\n(15) classes, courses, or programs providing instruction in personal development that is not advertised or maintained for vocational or career advancement, modeling, or acting;\n(16) private career schools with no physical presence in Minnesota engaged exclusively in offering distance instruction that are located in and regulated by other states or jurisdictions if the distance education instruction does not include internships, externships, field placements, or clinical placements for residents of Minnesota; and\n(17) private career schools providing exclusively training, instructional programs, or courses where tuition, fees, and any other charges, regardless of payment or reimbursement method, for a student to participate do not exceed $100.",
	"repealed": false
}