{
	"id": "144.057",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.057",
	"title": "144.057 BACKGROUND STUDIES ON LICENSEES AND OTHER PERSONNEL.",
	"text": "(a) Except as specified in paragraph (b), the commissioner of health shall contract with the commissioner of human services to conduct background studies of:\n(1) individuals providing services that have direct contact, as defined under section 245C.02, subdivision 11, with patients and residents in hospitals, boarding care homes, outpatient surgical centers licensed under sections 144.50 to 144.58; nursing homes and home care agencies licensed under chapter 144A; assisted living facilities and assisted living facilities with dementia care licensed under chapter 144G; and board and lodging establishments that are registered to provide supportive or health supervision services under section 157.17;\n(2) individuals specified in section 245C.03, subdivision 1, who perform direct contact services in a nursing home or a home care agency licensed under chapter 144A; an assisted living facility or assisted living facility with dementia care licensed under chapter 144G; or a boarding care home licensed under sections 144.50 to 144.58. If the individual under study resides outside Minnesota, the study must include a check for substantiated findings of maltreatment of adults and children in the individual's state of residence when the information is made available by that state, and must include a check of the National Crime Information Center database;\n(3) all other employees in assisted living facilities or assisted living facilities with dementia care licensed under chapter 144G, nursing homes licensed under chapter 144A, and boarding care homes licensed under sections 144.50 to 144.58. A disqualification of an individual in this section shall disqualify the individual from positions allowing direct contact or access to patients or residents receiving services. \"Access\" means physical access to a client or the client's personal property without continuous, direct supervision as defined in section 245C.02, subdivision 8, when the employee's employment responsibilities do not include providing direct contact services;\n(4) individuals employed by a supplemental nursing services agency, as defined under section 144A.70, who are providing services in health care facilities;\n(5) controlling persons of a supplemental nursing services agency, as defined under section 144A.70; and\n(6) license applicants, owners, managerial officials, and controlling individuals who are required under section 144A.476, subdivision 1, or 144G.13, subdivision 1, to undergo a background study under chapter 245C, regardless of the licensure status of the license applicant, owner, managerial official, or controlling individual.\n(b) The commissioner of human services shall not conduct a background study on any individual identified in paragraph (a), clauses (1) to (5), if the individual has a valid license issued by a health-related licensing board as defined in section 214.01, subdivision 2, and has completed the criminal background check as required in section 214.075. An entity that is affiliated with individuals who meet the requirements of this paragraph must separate those individuals from the entity's roster for NETStudy 2.0.\n(c) If a facility or program is licensed by the Department of Human Services and subject to the background study provisions of chapter 245C and is also licensed by the Department of Health, the Department of Human Services is solely responsible for the background studies of individuals in the jointly licensed programs.\nThe Department of Human Services shall conduct the background studies required by subdivision 1 in compliance with the provisions of chapter 245C. For the purpose of this section, the term \"residential program\" shall include all facilities described in subdivision 1. The Department of Human Services shall provide necessary forms and instructions, shall conduct the necessary background studies of individuals, and shall provide notification of the results of the studies to the facilities, supplemental nursing services agencies, individuals, and the commissioner of health. Individuals shall be disqualified under the provisions of chapter 245C. If an individual is disqualified, the Department of Human Services shall notify the facility, the supplemental nursing services agency, and the individual and shall inform the individual of the right to request a reconsideration of the disqualification by submitting the request to the Department of Health.\nThe commissioner of health shall review and decide reconsideration requests, including the granting of variances, in accordance with the procedures and criteria contained in chapter 245C. The commissioner must set aside a disqualification for an individual who requests reconsideration and who meets the criteria described in section 245C.22, subdivision 4, paragraph (d). The commissioner's decision shall be provided to the individual and to the Department of Human Services. The commissioner's decision to grant or deny a reconsideration of disqualification is the final administrative agency action, except for the provisions under sections 245C.25, 245C.27, and 245C.28, subdivision 3.\nFacilities and agencies described in subdivision 1 shall be responsible for cooperating with the departments in implementing the provisions of this section. The responsibilities imposed on applicants and licensees under chapters 245A and 245C shall apply to these facilities and supplemental nursing services agencies. The provision of section 245C.09, shall apply to applicants, licensees, registrants, or an individual's refusal to cooperate with the completion of the background studies. Supplemental nursing services agencies subject to the registration requirements in section 144A.71 must maintain records verifying compliance with the background study requirements under this section.",
	"repealed": false
}