{
	"id": "383A.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.16",
	"title": "383A.16 HIGHWAY IMPROVEMENTS.",
	"text": "MS 1992 [Repealed, 1994 c 439 s 4]\n(a) Ramsey County shall appropriate $100,000 annually and pay it to the municipalities in the county who do not receive municipal state-aid street funds, to aid these municipalities in the maintenance of former county roads and county state-aid highways that have been transferred to municipal jurisdiction or town roads as a result of implementation of the recommendation for functional consolidation by the Ramsey County Local Government Services Study Commission in its March 1992 report of the Ramsey County Local Government Services Study Commission.\n(b) This appropriation shall be apportioned by allocating $8,000 per mile for each mile of former county roads and county state-aid highways received by each municipality. These funds shall be spent on municipal roads, streets, or bridges by the governing body of each municipality.\n(c) The $8,000 appropriation shall increase or decrease each year by an amount equal to the overall increase or decrease reflected in the Engineering News Record Index.\n(d) Failure to provide the appropriation will result in the cities returning the \"turnback roads\" to Ramsey County, if the city so chooses.\nOn or before March 15 of each year, the county engineer shall certify the actual number of miles of roads inside and maintained exclusively by the municipalities outside the city of Saint Paul. The mileage so certified shall not include undeveloped roads, even though the plat thereof may have been filed for record.\nIn Ramsey County, the governing body of a city, village or town therein may authorize the county to construct and maintain any or all of its highways without advertising for bids.\nMS 1990 [Repealed, 1991 c 51 s 6]\nRamsey County shall, before transferring any highway jurisdiction under subdivision 2, improve each highway to be transferred to a condition consistent with a Ramsey County pavement management system score of 90.\nFor purposes of this section \"municipality\" means a home rule or statutory city and the town of White Bear.",
	"repealed": false
}