{
	"id": "244.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/244.42",
	"title": "244.42 COMPREHENSIVE ASSESSMENT AND INDIVIDUALIZED REHABILITATION PLAN REQUIRED.",
	"text": "(a) The commissioner must develop a comprehensive assessment process for each person who:\n(1) is committed to the commissioner's custody and confined in a state correctional facility on or after January 1, 2025; and\n(2) has 365 or more days remaining until the person's scheduled supervised release date or parole eligibility date.\n(b) As part of the assessment process, the commissioner must take into account appropriate rehabilitative programs under section 244.03.\nAfter completing the assessment process, the commissioner must ensure the development of an individualized rehabilitation plan, along with identified goals, for every person committed to the commissioner's custody. The individualized rehabilitation plan must be holistic in nature by identifying intended outcomes for addressing:\n(1) the incarcerated person's needs and risk factors;\n(2) the person's identified strengths; and\n(3) available and needed community supports, including victim safety considerations as required under section 244.47, if applicable.\n(a) If an individual is committed to the commissioner's custody for a crime listed in section 609.02, subdivision 16, the commissioner must make reasonable efforts to notify a victim of the opportunity to provide input during the assessment and rehabilitation plan process. Victim input may include:\n(1) a summary of victim concerns relative to release;\n(2) concerns related to victim safety during the committed individual's term of imprisonment; or\n(3) requests for imposing victim safety protocols as additional conditions of imprisonment or supervised release.\n(b) The commissioner must consider all victim input statements when developing an individualized rehabilitation plan and establishing conditions governing confinement or release.\nFor an incarcerated person with less than 365 days remaining until the person's supervised release date, the commissioner, in consultation with the incarcerated person, must develop a transition and release plan.\nThis act is separate and distinct from other legislatively authorized release programs, including the challenge incarceration program, work release, conditional medical release, or the program for the conditional release of nonviolent controlled substance offenders.",
	"repealed": false
}