{
	"id": "8.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/8.15",
	"title": "8.15 ATTORNEY GENERAL COSTS.",
	"text": "The attorney general in consultation with the commissioner of management and budget shall develop a fee schedule to be used by the attorney general in developing the agreements authorized in subdivision 3. The attorney general must submit a billing rate for the next biennium to the commissioner of management and budget by August 1 of each even-numbered year.\nThe attorney general may not assess a county any fee for legal services rendered in connection with a commitment proceeding under chapter 253D for which the attorney general assumes responsibility under section 8.01.\n(a) The attorney general in consultation with the commissioner of management and budget shall designate which agencies will have their legal service requests included in the budget request of the attorney general.\n(b) All other agencies, in consultation with the attorney general and the commissioner of management and budget, shall include a request for legal services in their biennial budget requests.\n(c) The budget request of the attorney general must include a consolidated listing that shows on one page all the appropriations that will be used to support the Office of the Attorney General and the Finance Division from which they will be requested.\n(a) To facilitate the delivery of legal services, the attorney general may:\n(1) enter into agreements with executive branch agencies, political subdivisions, or quasi-state agencies to provide legal services for the benefit of the citizens of Minnesota; and\n(2) in addition to funds otherwise appropriated by the legislature, accept and spend funds received under any agreement authorized in clause (1) for the purpose set forth in clause (1), subject to a report of receipts to the chairs of the senate Finance Committee and the house of representatives Ways and Means Committee by October 15 each year.\n(b) When entering into an agreement for legal services, the attorney general must notify the committees responsible for funding the Office of the Attorney General. When the attorney general enters into an agreement with a state agency, the attorney general must also notify the committees responsible for funding that agency.\nFunds received under this subdivision must be deposited in an account in the special revenue fund and are appropriated to the attorney general for the purposes set forth in this subdivision.\nThe attorney general shall prepare an annual expenditure report describing actual expenditures for each agency or political subdivision receiving legal services. The report shall describe:\n(1) estimated and actual expenditures, including expenditures authorized through agreements;\n(2) the type of services provided; and\n(3) major current and future legal issues.\nThe report shall be submitted to the chairs of the senate Finance Committee and the house of representatives Ways and Means Committee by October 15 each year.\nState agencies receiving legal services from the attorney general for nongeneral funded activities shall reimburse the full cost of those services to the general fund based on periodic billings prepared by the attorney general. Payment must be made to the attorney general for deposit to the general fund as a nondedicated receipt. The attorney general, in consultation with the commissioner of management and budget, shall develop reimbursement policies and procedures related to legal services.",
	"repealed": false
}