{
	"id": "252A.111",
	"url": "https://www.revisor.mn.gov/statutes/cite/252A.111",
	"title": "252A.111 POWERS AND DUTIES OF PUBLIC GUARDIAN.",
	"text": "Except as otherwise provided in this section, sections 524.5-207 and 524.5-313, apply to the powers and duties of a public guardian.\nIn addition to the powers contained in sections 524.5-207 and 524.5-313, the powers of a public guardian that the court may grant include:\n(1) the power to permit or withhold permission for the person subject to public guardianship to marry;\n(2) the power to begin legal action or defend against legal action in the name of the person subject to public guardianship; and\n(3) the power to consent to the adoption of the person subject to public guardianship as provided in section 259.24.\nMS 2000 [Repealed, 1Sp2001 c 9 art 13 s 29]\nIf the person subject to public guardianship has a personal estate beyond that which is necessary for the personal and immediate needs of the person subject to public guardianship, the commissioner shall determine whether a conservator should be appointed. The commissioner shall consult with the parents, spouse, or nearest relative of the person subject to public guardianship. The commissioner may petition the court for the appointment of a private conservator of the person subject to public guardianship. The commissioner cannot act as conservator for public persons subject to public guardianship or public protected persons.\nThe commissioner may carry out the powers and duties prescribed by this chapter directly or through local agencies.\nIn exercising powers and duties under this chapter, the commissioner shall:\n(1) maintain close contact with the person subject to public guardianship, visiting at least twice a year;\n(2) protect and exercise the legal rights of the person subject to public guardianship;\n(3) take actions and make decisions on behalf of the person subject to public guardianship that encourage and allow the maximum level of independent functioning in a manner least restrictive of the personal freedom of the person subject to public guardianship consistent with the need for supervision and protection; and\n(4) permit and encourage maximum self-reliance on the part of the person subject to public guardianship and permit and encourage input by the nearest relative of the person subject to public guardianship in planning and decision making on behalf of the person subject to public guardianship.",
	"repealed": false
}