{
	"id": "160.095",
	"url": "https://www.revisor.mn.gov/statutes/cite/160.095",
	"title": "160.095 DESIGNATION OF MINIMUM-MAINTENANCE ROADS.",
	"text": "A road authority, other than the commissioner, may by resolution designate a road under its jurisdiction as a minimum-maintenance road if it determines that the road or road segment is used only occasionally or intermittently for passenger and commercial travel. The resolution must identify the beginning and end points of the road being designated. After adopting the resolution, the road authority must post signs on the road to notify the motoring public that it is a minimum-maintenance road and that the public travels on the road at its own risk. A road authority must notify the road authorities of adjoining jurisdictions of designations under this section.\nIf an affected road or road segment runs along a county or town line, the designation applies only to that part of the road that is under the jurisdiction of the road authority adopting the resolution.\nDesignation of a minimum-maintenance road is effective on the erection of the signs required under this section. The signs shall be posted at entry points to and at regular intervals along a minimum-maintenance road. Signs posted must conform to the commissioner's Manual on Uniform Traffic Control Devices. Properly posted signs are prima facie evidence that adequate notice of a minimum-maintenance road has been given to the motoring public.\nA trunk highway may not be designated as a minimum-maintenance road. A road may not be designated a minimum-maintenance road if federal-state aid to Minnesota will be reduced as a result. A road authority may not acquire additional right-of-way or easement by eminent domain or otherwise without the consent of the landowner, for the purpose of constructing or designating a minimum-maintenance road, except where necessary for drainage or public safety.\nA minimum-maintenance road may be maintained at a level less than the minimum-maintenance standards required for state-aid highways, roads, and streets, but must be maintained at the level required to serve the occasional or intermittent traffic. Where a road has been designated by resolution as a minimum-maintenance road and signs have been posted under subdivision 2, the road authority with jurisdiction over the road, and its officers and employees, are exempt from liability for any tort claim for injury to person or property arising from travel on the minimum-maintenance road and related to its maintenance or condition. Nothing in this section shall exempt a road authority from its duty to maintain bridges under chapter 165 or other applicable law.",
	"repealed": false
}