{
	"id": "103E.501",
	"url": "https://www.revisor.mn.gov/statutes/cite/103E.501",
	"title": "103E.501 CONTRACT AND BOND.",
	"text": "The county attorney, the engineer, and the attorney for the petitioners shall prepare the contract and bond. The contract and bond must include the provisions required by this chapter and section 574.26 for bonds given by contractors for public works and must be conditioned as provided by section 574.26 for the better security of the contracting counties and parties performing labor and furnishing material in performance of the contract. The prepared contract and bond must be attached and provided to the contractor for execution.\nThe contractor shall file a bond with the auditor for an amount not less than 75 percent of the contract price of the work. The bond must have adequate surety and be approved by the auditor. The bond must provide that the surety for the bond is liable for all damages resulting from a failure to perform work under the contract, whether the work is resold or not, and that any person or political subdivision showing damages from the failure to perform work under the contract may maintain an action against the bond in their own names. Actions may be successive in favor of all persons injured, but the aggregate liability of the surety for all the damages may not exceed the amount of the bond. The surety is liable for the tile work guaranteed by the contractor. The contractor is considered a public officer and the bond an official bond within the meaning of section 574.24 construing the official bonds of public officers as security to all persons and providing for actions on the bonds by a party that is damaged.\nThe contract must contain a specific description of the work to be done, either expressly or by reference to the plans and specifications, and must provide that the work must be done and completed as provided in the plans and specifications and subject to the inspection and approval of the engineer. The contract must provide that time is of the essence of the contract, and that if there is a failure to perform the work according to the terms of the contract within the time given in the original contract or as extended, the contractors shall forfeit and pay the affected counties an amount stated in the contract as liquidated damages. The amount must be fixed by the auditor for each day that the failure of performance continues.\nThe contract must give the engineer the right, with the consent of the drainage authority, to modify the detailed survey report, plans, and specifications as the work proceeds and as circumstances require. The contract must provide that the increased cost resulting from the changes will be paid by the drainage authority to the contractor at a rate not greater than the amount for similar work in the contract. A change may not be made that will substantially impair the usefulness of any part of the drainage project or system, substantially alter its original character, or increase its total cost by more than ten percent of the total original contract price. A change may not be made that will cause the cost to exceed the total estimated benefits found by the drainage authority or that will cause any detrimental effects to the public interest under the environmental, land use, and multipurpose water management criteria in section 103E.015, subdivision 1.\nIf any portion of the work is to be done by the United States or an agency of the United States, a bond or contract is not necessary for that portion of the work, except that a contract must be made if the United States or its agencies require a contract with the local governmental units. The contract must contain the terms, conditions, provisions, and guaranties required by the United States or its agencies to proceed with the work.\nIf tile is used to construct any part of the drainage project, a majority of the persons affected may file a written request with the auditor to contract the tile work separately. The request must be filed before advertising for the sale of the work has begun. If the request is properly made, the tile work must be contracted separately. The contractor must guarantee the tile work under the contract for three years after its completion against any fault or negligence on the part of the contractor. The advertisement for bids must include this requirement.\nThis chapter does not prevent the persons with property affected by the construction of a drainage project from uniting in a written agreement with the contractor and the surety of the contractor's bond to modify the contract as to the manner or time when any portion of the drainage project is constructed, if the modification is recommended, in writing, by the engineer and approved by the drainage authority.",
	"repealed": false
}