{
	"id": "142G.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.51",
	"title": "142G.51 EMPLOYMENT AND TRAINING; PARTICIPANT.",
	"text": "(a) All caregivers must participate in employment services under sections 142G.51 to 142G.53, 142G.55 to 142G.59, and 142G.71 concurrent with receipt of MFIP assistance.\n(b) Participants under paragraph (a) must develop and comply with an employment plan under section 142G.56 or section 142G.57 in the case of a participant under the age of 20 who has not obtained a high school diploma or its equivalent.\n(c) With the exception of participants under the age of 20 who must meet the education requirements of section 142G.57, all participants must meet the hourly participation requirements of TANF or the hourly requirements listed in clauses (1) to (3), whichever is higher.\n(1) In single-parent families with no children under six years of age, the job counselor and the caregiver must develop an employment plan that includes 130 hours per month of work activities.\n(2) In single-parent families with a child under six years of age, the job counselor and the caregiver must develop an employment plan that includes 87 hours per month of work activities.\n(3) In two-parent families, the job counselor and the caregivers must develop employment plans which result in a combined total of at least 55 hours per week of work activities.\n(d) Failure to participate in employment services, including the requirement to develop and comply with an employment plan, including hourly requirements, without good cause under section 142G.71, shall result in the imposition of a sanction under section 142G.70.\nThe participant must inform the job counselor within ten working days regarding any changes related to the participant's employment status.\nMFIP applicants or recipients who move to a different county in Minnesota and are required to participate in employment and training services are subject to the requirements of the destination county. An employment plan that was developed in the county of origin may be continued in the destination county if both the destination county and the participant agree to do so.\nMFIP caregivers must be able to choose from at least two employment and training service providers, unless the county has demonstrated to the commissioner that the provision of multiple employment and training service providers would result in financial hardship for the county, or the county is utilizing a workforce center as specified in section 142G.54, subdivision 4. Both parents in a two-parent family must choose the same employment and training service provider unless a special need, such as bilingual services, is identified but not available through one service provider.",
	"repealed": false
}