{
	"id": "373.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/373.40",
	"title": "373.40 CAPITAL IMPROVEMENT BONDS.",
	"text": "For purposes of this section, the following terms have the meanings given.\n(a) \"Bonds\" means an obligation as defined under section 475.51.\n(b) \"Capital improvement\" means acquisition or betterment of public lands, buildings, or other improvements within the county for the purpose of a county courthouse, administrative building, health or social service facility, correctional facility, jail, law enforcement center, hospital, morgue, library, park, qualified indoor ice arena, roads and bridges, public works facilities, fairground buildings, and records and data storage facilities, and the acquisition of development rights in the form of conservation easements under chapter 84C. An improvement must have an expected useful life of five years or more to qualify. \"Capital improvement\" does not include a recreation or sports facility building (such as, but not limited to, a gymnasium, ice arena, racquet sports facility, swimming pool, exercise room or health spa), unless the building is part of an outdoor park facility and is incidental to the primary purpose of outdoor recreation. For purposes of this section, \"capital improvement\" includes expenditures for purposes described in this paragraph that have been incurred by a county before approval of a capital improvement plan, if such expenditures are included in a capital improvement plan approved on or before the date of the public hearing under subdivision 2 regarding issuance of bonds for such expenditures.\n(c) \"Metropolitan county\" means a county located in the seven-county metropolitan area as defined in section 473.121 or a county with a population of 90,000 or more.\n(d) \"Population\" means the population established by the most recent of the following (determined as of the date the resolution authorizing the bonds was adopted):\n(1) the federal decennial census,\n(2) a special census conducted under contract by the United States Bureau of the Census, or\n(3) a population estimate made either by the Metropolitan Council or by the state demographer under section 4A.02.\n(e) \"Qualified indoor ice arena\" means a facility that meets the requirements of section 373.43.\n(a) Bonds issued by a county to finance capital improvements under an approved capital improvement plan are not subject to the election requirements of section 375.18 or 475.58. The bonds must be approved by vote of at least three-fifths of the members of the county board. In the case of a metropolitan county, the bonds must be approved by vote of at least two-thirds of the members of the county board.\n(b) Before issuance of bonds qualifying under this section, the county must publish a notice of its intention to issue the bonds and the date and time of a hearing to obtain public comment on the matter. The notice must be published in the official newspaper of the county or in a newspaper of general circulation in the county. The notice must be published at least 14, but not more than 28, days before the date of the hearing.\n(c) A county may issue the bonds only upon obtaining the approval of a majority of the voters voting on the question of issuing the obligations, if a petition requesting a vote on the issuance is signed by voters equal to five percent of the votes cast in the county in the last county general election and is filed with the county auditor within 30 days after the public hearing. If the county elects not to submit the question to the voters, the county shall not propose the issuance of bonds under this section for the same purpose and in the same amount for a period of 365 days from the date of receipt of the petition. If the question of issuing the bonds is submitted and not approved by the voters, the provisions of section 475.58, subdivision 1a, shall apply.\n(a) A county may adopt a capital improvement plan. The plan must cover at least the five-year period beginning with the date of its adoption. The plan must set forth the estimated schedule, timing, and details of specific capital improvements by year, together with the estimated cost, the need for the improvement, and sources of revenues to pay for the improvement. In preparing the capital improvement plan, the county board must consider for each project and for the overall plan:\n(1) the condition of the county's existing infrastructure, including the projected need for repair or replacement;\n(2) the likely demand for the improvement;\n(3) the estimated cost of the improvement;\n(4) the available public resources;\n(5) the level of overlapping debt in the county;\n(6) the relative benefits and costs of alternative uses of the funds;\n(7) operating costs of the proposed improvements; and\n(8) alternatives for providing services more efficiently through shared facilities with other counties or local government units.\n(b) The capital improvement plan and annual amendments to it are not effective until approved by the county board after public hearing.\nA county may not issue bonds under this section if the maximum amount of principal and interest to become due in any year on all the outstanding bonds issued pursuant to this section (including the bonds to be issued) will equal or exceed 0.12 percent of the estimated market value of property in the county. Calculation of the limit must be made using the estimated market value for the taxes payable year in which the obligations are issued and sold. This section does not limit the authority to issue bonds under any other special or general law.\nBonds to finance capital improvements qualifying under this section must be issued under the issuance authority in chapter 475 and the provisions of chapter 475 apply, except as otherwise specifically provided in this section.\nMS 1992 [Repealed, 1994 c 505 art 2 s 7]\nMS 2000 [Repealed, 2001 c 214 s 49]",
	"repealed": false
}