{
	"id": "103D.225",
	"url": "https://www.revisor.mn.gov/statutes/cite/103D.225",
	"title": "103D.225 HEARING AND ORDER TO ESTABLISH.",
	"text": "(a) The board must allow all persons interested in or affected by the proposed watershed district to be given an opportunity to make oral and written statements at the establishment hearing.\n(b) The board may continue the establishment hearing.\nIf the board determines after the establishment hearing that the establishment of the proposed watershed district would benefit the public welfare and public interest, and would advance the purpose of this chapter, the board must, by order, establish the watershed district.\nThe order of the board establishing a watershed district must include:\n(1) the findings of the board supporting its determination to establish the watershed district;\n(2) the official name of the watershed district;\n(3) the location of the principal place of business of the watershed district;\n(4) the boundaries of the watershed district; and\n(5) the names of the managers for the first board of managers selected under subdivision 4.\n(a) The board shall select the first board of managers of a proposed watershed district from the list of nominees in the establishment petition except as provided in paragraph (b). The number of managers may not be less than three nor more than nine, except that a proposed watershed district entirely within the metropolitan area may not have fewer than five managers. A manager may not be a public officer of the county, state, or federal government, except that a soil and water conservation supervisor may be a manager. The term of the first board of managers is for one year and until their successors can be appointed and qualified.\n(b) For a proposed watershed district entirely within the metropolitan area, the board must select managers from a list of persons nominated by one or more of the cities and towns affected by the proposed watershed district. The list must contain at least three nominees for each manager position. The board must select managers to fairly represent the various hydrologic areas within the proposed watershed district according to their residence within an area. If the cities or towns fail to nominate managers under this paragraph, the board shall select managers under paragraph (a).\n(c) In the order establishing a watershed district, the board must prescribe the terms of office for the first board of managers appointed by the county boards as provided in paragraphs (d) to (f).\n(d) If the first board of managers has three members, the term of office for the managers is one for a term of one year, one for a term of two years, and one for a term of three years.\n(e) If the first board of managers has five members, the term of office for the managers is one for a term of one year, two for a term of two years, and two for a term of three years.\n(f) If the first board of managers does not have three or five members, the managers must be appointed so that as nearly as possible one-third serve terms of one year, one-third serve terms of two years, and one-third serve terms of three years.\nThe board must file a certified copy of the findings and order establishing a watershed district with the secretary of state and, at the same time:\n(1) mail a copy of the findings and order to the auditor of each county affected by the watershed district, the commissioner, and the director; and\n(2) have each manager personally served with a copy of the order.\nAfter the establishment order is filed with the secretary of state, the watershed district is a political subdivision of the state with the power, authority, and duties prescribed in this chapter.\nA watershed district established under this chapter exists from the time the order establishing the watershed district is filed with the secretary of state until the watershed district is terminated.",
	"repealed": false
}