{
	"id": "256B.196",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.196",
	"title": "256B.196 INTERGOVERNMENTAL TRANSFERS; HOSPITAL AND PHYSICIAN PAYMENTS.",
	"text": "This section is contingent on federal approval of the intergovernmental transfers and payments authorized under this section. This section is also contingent on current payment by the government entities of the intergovernmental transfers under this section.\n(a) For the purposes of this subdivision and subdivision 3, the commissioner shall determine the fee-for-service outpatient hospital services upper payment limit for nonstate government hospitals. The commissioner shall then determine the amount of a supplemental payment to Hennepin County Medical Center and Regions Hospital for these services that would increase medical assistance spending in this category to the aggregate upper payment limit for all nonstate government hospitals in Minnesota. In making this determination, the commissioner shall allot the available increases between Hennepin County Medical Center and Regions Hospital based on the ratio of medical assistance fee-for-service outpatient hospital payments to the two facilities. The commissioner shall adjust this allotment as necessary based on federal approvals, the amount of intergovernmental transfers received from Hennepin and Ramsey Counties, and other factors, in order to maximize the additional total payments. The commissioner shall inform Hennepin County and Ramsey County of the periodic intergovernmental transfers necessary to match federal Medicaid payments available under this subdivision in order to make supplementary medical assistance payments to Hennepin County Medical Center and Regions Hospital equal to an amount that when combined with existing medical assistance payments to nonstate governmental hospitals would increase total payments to hospitals in this category for outpatient services to the aggregate upper payment limit for all hospitals in this category in Minnesota. Upon receipt of these periodic transfers, the commissioner shall make supplementary payments to Hennepin County Medical Center and Regions Hospital.\n(b) For the purposes of this subdivision and subdivision 3, the commissioner shall determine an upper payment limit for physicians and other billing professionals affiliated with Hennepin County Medical Center and with Regions Hospital. The upper payment limit shall be based on the average commercial rate or be determined using another method acceptable to the Centers for Medicare and Medicaid Services. The commissioner shall inform Hennepin County and Ramsey County of the periodic intergovernmental transfers necessary to match the federal Medicaid payments available under this subdivision in order to make supplementary payments to physicians and other billing professionals affiliated with Hennepin County Medical Center and to make supplementary payments to physicians and other billing professionals affiliated with Regions Hospital through HealthPartners Medical Group equal to the difference between the established medical assistance payment for physician and other billing professional services and the upper payment limit. Upon receipt of these periodic transfers, the commissioner shall make supplementary payments to physicians and other billing professionals affiliated with Hennepin County Medical Center and shall make supplementary payments to physicians and other billing professionals affiliated with Regions Hospital through HealthPartners Medical Group.\n(c) Beginning January 1, 2010, Ramsey County may make monthly voluntary intergovernmental transfers to the commissioner in amounts not to exceed $6,000,000 per year. The commissioner shall increase the medical assistance capitation payments to any licensed health plan under contract with the medical assistance program that agrees to make enhanced payments to Regions Hospital. The increase shall be in an amount equal to the annual value of the monthly transfers plus federal financial participation, with each health plan receiving its pro rata share of the increase based on the pro rata share of medical assistance admissions to Regions Hospital by those plans. For the purposes of this paragraph, \"the base amount\" means the total annual value of increased medical assistance capitation payments, including the voluntary intergovernmental transfers, under this paragraph in calendar year 2017. For managed care contracts beginning on or after January 1, 2018, the commissioner shall reduce the total annual value of increased medical assistance capitation payments under this paragraph by an amount equal to ten percent of the base amount, and by an additional ten percent of the base amount for each subsequent contract year until December 31, 2025. Upon the request of the commissioner, health plans shall submit individual-level cost data for verification purposes. The commissioner may ratably reduce these payments on a pro rata basis in order to satisfy federal requirements for actuarial soundness. If payments are reduced, transfers shall be reduced accordingly. Any licensed health plan that receives increased medical assistance capitation payments under the intergovernmental transfer described in this paragraph shall increase its medical assistance payments to Regions Hospital by the same amount as the increased payments received in the capitation payment described in this paragraph. This paragraph expires January 1, 2026.\n(d) For the purposes of this subdivision and subdivision 3, the commissioner shall determine an upper payment limit for ambulance services affiliated with Hennepin County Medical Center and the city of St. Paul, and ambulance services owned and operated by another governmental entity that chooses to participate by requesting the commissioner to determine an upper payment limit. The upper payment limit shall be based on the average commercial rate or be determined using another method acceptable to the Centers for Medicare and Medicaid Services. The commissioner shall inform Hennepin County, the city of St. Paul, and other participating governmental entities of the periodic intergovernmental transfers necessary to match the federal Medicaid payments available under this subdivision in order to make supplementary payments to Hennepin County Medical Center, the city of St. Paul, and other participating governmental entities equal to the difference between the established medical assistance payment for ambulance services and the upper payment limit. Upon receipt of these periodic transfers, the commissioner shall make supplementary payments to Hennepin County Medical Center, the city of St. Paul, and other participating governmental entities. A tribal government that owns and operates an ambulance service is not eligible to participate under this subdivision.\n(e) For the purposes of this subdivision and subdivision 3, the commissioner shall determine an upper payment limit for physicians, dentists, and other billing professionals affiliated with the University of Minnesota and University of Minnesota Physicians. The upper payment limit shall be based on the average commercial rate or be determined using another method acceptable to the Centers for Medicare and Medicaid Services. The commissioner shall inform the University of Minnesota Medical School and University of Minnesota School of Dentistry of the periodic intergovernmental transfers necessary to match the federal Medicaid payments available under this subdivision in order to make supplementary payments to physicians, dentists, and other billing professionals affiliated with the University of Minnesota and the University of Minnesota Physicians equal to the difference between the established medical assistance payment for physician, dentist, and other billing professional services and the upper payment limit. Upon receipt of these periodic transfers, the commissioner shall make supplementary payments to physicians, dentists, and other billing professionals affiliated with the University of Minnesota and the University of Minnesota Physicians.\n(f) The commissioner shall inform the transferring governmental entities on an ongoing basis of any changes needed in the intergovernmental transfers in order to continue the payments under paragraphs (a) to (e), at their maximum level, including increases in upper payment limits, changes in the federal Medicaid match, and other factors.\n(g) The payments in paragraphs (a) to (e) shall be implemented independently of each other, subject to federal approval and to the receipt of transfers under subdivision 3.\n(h) All of the data and funding transactions related to the payments in paragraphs (a) to (e) shall be between the commissioner and the governmental entities.\n(i) For purposes of this subdivision, billing professionals are limited to physicians, nurse practitioners, nurse midwives, clinical nurse specialists, physician assistants, anesthesiologists, certified registered nurse anesthetists, dentists, dental hygienists, and dental therapists.\nBased on the determination by the commissioner under subdivision 2, Hennepin County and Ramsey County shall make periodic intergovernmental transfers to the commissioner for the purposes of subdivision 2, paragraphs (a) and (b). All of the intergovernmental transfers made by Hennepin County shall be used to match federal payments to Hennepin County Medical Center under subdivision 2, paragraph (a), and to physicians and other billing professionals affiliated with Hennepin County Medical Center under subdivision 2, paragraph (b). All of the intergovernmental transfers made by Ramsey County shall be used to match federal payments to Regions Hospital under subdivision 2, paragraph (a), and to physicians and other billing professionals affiliated with Regions Hospital through HealthPartners Medical Group under subdivision 2, paragraph (b). All of the intergovernmental transfer payments made by the University of Minnesota Medical School and the University of Minnesota School of Dentistry shall be used to match federal payments to the University of Minnesota and the University of Minnesota Physicians under subdivision 2, paragraph (e).\n(a) The commissioner may adjust the intergovernmental transfers under subdivision 3 and the payments under subdivision 2, based on the commissioner's determination of Medicare upper payment limits, hospital-specific charge limits, hospital-specific limitations on disproportionate share payments, medical inflation, actuarial certification, average commercial rates for physician and other professional services as defined in this section, and cost-effectiveness for purposes of federal waivers. Any adjustments must be made on a proportional basis. The commissioner may make adjustments under this subdivision only after consultation with the affected counties, university schools, and hospitals. All payments under subdivision 2 and all intergovernmental transfers under subdivision 3 are limited to amounts available after all other base rates, adjustments, and supplemental payments in chapter 256B are calculated.\n(b) The ratio of medical assistance payments specified in subdivision 2 to the voluntary intergovernmental transfers specified in subdivision 3 shall not be reduced except as provided under paragraph (a).\nEach type of intergovernmental transfer in subdivision 2, paragraphs (a) to (d), for payment periods from October 1, 2008, through June 30, 2013, is voluntary on the part of Hennepin and Ramsey Counties, meaning that the transfer must be agreed to, in writing, by the counties prior to any payments being issued. One agreement on each type of transfer shall cover the entire recession period.",
	"repealed": false
}