{
	"id": "168A.142",
	"url": "https://www.revisor.mn.gov/statutes/cite/168A.142",
	"title": "168A.142 MANUFACTURED HOME UNAFFIXED FROM REALTY.",
	"text": "The department must issue an initial certificate of title or reissue a previously surrendered certificate of title for a manufactured home to an applicant if:\n(1) the owner of the manufactured home, or a previous owner, surrendered the manufacturer's certificate of origin or certificate of title to the department as provided in section 168A.1412, subdivisions 2 and 3;\n(2) the applicant provides the written evidence specified in subdivision 2;\n(3) the owner of the manufactured home fulfills the applicable application requirements of section 168A.04; and\n(4) the application is accompanied by a written statement from the county auditor or county treasurer of the county in which the manufactured home is then located and affixed, stating that all property taxes payable in the current year, as provided under section 273.125, subdivision 8, paragraph (b), have been paid.\n(a) The evidence required under subdivision 1, clause (2), is as follows:\n(1) an affidavit of severance recorded in the office of the county recorder or registrar of titles, which they shall accept, and whichever applies to the real property, of the county where the affidavit of affixation or notice of surrender was recorded as required in section 168A.1412, subdivision 5, and the affidavit of severance contains:\n(i) the name, residence address, and mailing address of the owner or owners of the manufactured home;\n(ii) a description of the manufactured home being severed, including the name of the manufacturer and dimensions, and if available, the make, model year, and manufacturer's serial number of the manufactured home and, such information as may be available from the previously recorded affidavit of affixation or notice of surrender as required in section 168A.1412, subdivision 5; and\n(iii) a statement of any facts or information known to the person executing the affidavit that could affect the validity of the title of the manufactured home, the nonexistence of a security interest in the manufactured home, and a statement that no such facts or information are known to the person executing the affidavit;\n(2) as an attachment to the affidavit of severance, an opinion by an attorney admitted to practice law in this state, stating:\n(i) the nature of the examination of title performed prior to giving this opinion by the person signing the opinion;\n(ii) that the manufactured home and the real property on which it is located is not subject to, or pending completion of a refinance, purchase, or sale transaction, and will not be subject to any recorded mortgages, security interests, liens, or other encumbrances of any kind;\n(iii) that the person signing the opinion knows of no facts or circumstances that could affect the validity of the title of the manufactured home or the existence or nonexistence of any recorded mortgages, security interests, or other encumbrances of any kind, other than property taxes payable in the year the affidavit is signed;\n(iv) the person or persons owning record title to the real property to which the manufactured home has been affixed and the nature and extent of the title owned by each of these persons; and\n(v) that the person signing the opinion has reviewed all provisions of the affidavit of severance and certifies that they are correct and complete to the best of the knowledge of the person signing the opinion;\n(3) the name and address of the person, persons designated by the applicant to file the original affidavit of severance with the county recorder or county registrar of titles, whichever applies to the real property; and\n(4) the signature of the person who executes the affidavit, properly executed before a person authorized to authenticate an affidavit in this state.\n(b) The person designated in paragraph (a), clause (3), must record, or arrange for the recording of, the affidavit of severance as referenced in that item, accompanied by the fees for recording and for issuing a certified copy of the affidavit, including all attachments, showing the recording date.\n(c) Upon obtaining the certified copy under paragraph (b), the person designated in the affidavit must deliver the certified copy to the county auditor of the county in which the real estate to which it was affixed is located.\n(d) The department is not liable for any errors, omissions, misstatements, or other deficiencies or inaccuracies in documents presented to the department under this section, so long as the documents presented appear to satisfy the requirements of this section. The department has no obligation to investigate the accuracy of statements contained in the documents.\nThe affidavit of severance must be in substantially the following form and must contain the following information.\nMANUFACTURED HOME AFFIDAVIT OF SEVERANCE\nPURSUANT TO MINNESOTA STATUTES, SECTION 168A.142\nHomeowner, being duly sworn, on his or her oath, states as follows:\n1. Homeowner owns the manufactured home (\"home\") described as follows:\n2. A copy of the previously surrendered manufacturer's certificate of origin or certificate of title is attached (if available).\n3. A copy of the notice of surrender issued from the Minnesota Department of Public Safety Driver and Vehicle Services is attached (if available).\n4. The home is or will be located at the following \"Property Address\":\n5. The legal description of the property address (\"land\") is as follows or as attached:\n6. The homeowner does not know of any facts or information that could affect the validity of title of the manufactured home, except:\n7. The homeowner does not know of any such security interest in the manufactured home which has not been satisfied or released.\n8. A copy of an opinion by an attorney admitted to practice law in Minnesota is attached, which provides for the required title evidence as set forth in Minnesota Statutes, section 168A.142, subdivision 2, clause (2), items (i) to (v).\n9. A copy of the written statement from the county auditor or county treasurer of the county in which the manufactured home is then located, stating that all property taxes payable in the current year (pursuant to Minnesota Statutes, section 273.125, subdivision 8, paragraph (b)), have been paid, or are not applicable, is attached.\n10. The name and address of the person designated by the homeowner to record the original affidavit of surrender with the county recorder or registrar of titles of the county in which the real estate is located is:\nIN WITNESS WHEREOF, homeowner(s) have executed this affidavit on this ....... day of ......., 20...\nThis instrument was drafted by, and when recorded return to:\nSubscribed and sworn to before me this ....... day of ......., .......\nNotary Stamp or Seal",
	"repealed": false
}