{
	"id": "116.0713",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.0713",
	"title": "116.0713 LIVESTOCK ODOR.",
	"text": "(a) The Pollution Control Agency must:\n(1) monitor and identify potential livestock facility violations of the state ambient air quality standards for hydrogen sulfide, using a protocol for responding to citizen complaints regarding feedlot odor and its hydrogen sulfide component, including the appropriate use of portable monitoring equipment that enables monitoring staff to follow plumes;\n(2) when livestock production facilities are found to be in violation of ambient hydrogen sulfide standards, take appropriate actions necessary to ensure compliance, utilizing appropriate technical assistance and enforcement and penalty authorities provided to the agency by statute and rule.\n(b) Livestock production facilities are exempt from state ambient air quality standards while manure is being removed and for seven days after manure is removed from barns or manure storage facilities.\n(c) For a livestock production facility having greater than 300 animal units, the maximum cumulative exemption in a calendar year under paragraph (b) is 21 days for the removal process.\n(d) The operator of a livestock production facility that claims exemption from state ambient air quality standards under paragraph (b) must provide notice of that claim to either the Pollution Control Agency or the county feedlot officer delegated under section 116.07.\n(e) State ambient air quality standards are applicable at the property boundary of a farm or a parcel of agricultural land on which a livestock production facility is located, except that if the owner or operator of the farm or parcel obtains an air quality easement from the owner of land adjoining the farm or parcel, the air quality standards must be applicable at the property boundary of the adjoining land to which the easement pertains. The air quality easement must be for no more than five years, must be in writing, and must be available upon request by the agency or the county feedlot officer. Notwithstanding the provisions of this paragraph, state ambient air quality standards are applicable at locations to which the general public has access. The \"general public\" does not include employees or other categories of people who have been directly authorized by the property owner to enter or remain on the property for a limited period of time and for a specific purpose, or trespassers.\n(f) The agency may not require air emission modeling for a type of livestock system that has not had a hydrogen sulfide emission violation.",
	"repealed": false
}