{
	"id": "232.22",
	"url": "https://www.revisor.mn.gov/statutes/cite/232.22",
	"title": "232.22 LICENSES, BONDING CLAIMS, DISBURSEMENTS.",
	"text": "An application for a public grain warehouse operator's license must be filed with the commissioner and the license issued before the purchase or storage of grain may be commenced. All grain warehouses located within the same home rule charter or statutory city or town and owned and operated by the same person may be covered by a single license.\nA license must be renewed annually. If a business receives more than one license from the commissioner, the licenses shall be issued at the same time, but only after all conditions for each license are met. The licenses may be combined into one joint license.\n(a) There is created in the agricultural fund an account known as the grain buyers and storage account. The commissioner shall set the fees for examinations, certifications, and licenses under sections 232.20 to 232.24 at levels necessary to pay the costs of administering and enforcing sections 232.20 to 232.24. All money collected pursuant to sections 232.20 to 232.24 shall be paid by the commissioner into the state treasury and credited to the grain buyers and storage account. Money in the account, including interest, is appropriated to the commissioner for the administration and enforcement of sections 232.20 to 232.24.\n(b) All money collected pursuant to chapter 231 shall be paid by the commissioner into the grain buyers and storage account. Money in the account is appropriated to the commissioner for the administration and enforcement of chapter 231.\n(c) The fees for a license to store grain are as follows:\n(1) for a license to store grain, $110 for each home rule charter or statutory city or town in which a public grain warehouse is operated;\n(2) in addition to the license fee required under clause (1), a person with a license to store grain in a public grain warehouse is subject to an examination fee for each licensed location, as follows:\n(3) the fee for supplemental examinations required by the commissioner under section 232.24 is $55 per hour per examiner.\n(d) A penalty amount not to exceed ten percent of the fees due may be imposed by the commissioner for each month for which the fees are delinquent.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\n(a) Every public grain warehouse operator shall keep in a place of safety complete and accurate records and accounts relating to any grain warehouse operated. The records shall reflect each commodity received and shipped daily, the balance remaining in the grain warehouse at the close of each business day, a listing of all unissued grain warehouse receipts in the operator's possession, a record of all grain warehouse receipts issued which remain outstanding and a record of all grain warehouse receipts which have been returned for cancellation. Copies of grain warehouse receipts or other documents evidencing ownership of grain by a depositor, or other liability of the grain warehouse operator, shall be retained as long as the liability exists but must be kept for a minimum of three years.\n(b) Every public grain warehouse operator must maintain in the grain warehouse at all times grain of proper grade and sufficient quantity to meet delivery obligations on all outstanding grain warehouse receipts.\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]\nMS 2022 [Repealed, 2023 c 43 art 2 s 142]",
	"repealed": false
}