{
	"id": "17.696",
	"url": "https://www.revisor.mn.gov/statutes/cite/17.696",
	"title": "17.696 UNFAIR PRACTICES OF HANDLERS AND ASSOCIATIONS.",
	"text": "Producers of agricultural commodities are free to join together voluntarily in associations as authorized by law without interference by handlers. A handler shall not engage in any of the following practices, defined as unfair practices:\n(a) To coerce a producer in the exercise of the right to join and belong to or to refrain from joining or belonging to an association or to refuse to deal with a producer because of the exercise of the right to join and belong to an association.\n(b) To discriminate against a producer with respect to price, quantity, quality or other terms of purchase, acquisition or other handling of agricultural products because of membership in or contract with an association.\n(c) To coerce or intimidate a producer to breach, cancel or terminate a membership agreement or marketing contract with an association or a contract with a handler.\n(d) To pay or loan money, give anything of value or offer any other inducement or reward to a producer for refusing or ceasing to belong to an association.\n(e) To make or circulate unsubstantiated reports about the finances, management or activities of associations or other handlers.\n(f) To conspire, combine, agree or arrange with any other person to do or aid or abet the doing of any practice which is in violation of sections 17.691 to 17.701.\n(g) To refuse to bargain with an association with whom the handler has had prior dealings or with an association whose producers in the bargaining units have had dealings with the handler prior to July 1, 1973.\nAn association shall not engage nor permit an employee or agent to engage in the following practices, defined as unfair practices:\n(1) coerce a producer in the exercise of the right to join and belong to or to refrain from joining or belonging to an association or refuse to deal with a producer because of the exercise of the right to join and belong to or refrain from joining an association;\n(2) enter into a contract which discriminates against a producer represented by that association;\n(3) act in a manner contrary to the bylaws of the association;\n(4) coerce or intimidate a handler to breach, cancel, or terminate an agreement or marketing contract with an association or a contract with a producer;\n(5) make or circulate unsubstantiated reports about the finances, management, or activities of other associations or handlers; or\n(6) conspire, combine, agree, or arrange with another person to do or aid or abet the doing of any practice which is in violation of sections 17.691 to 17.702.",
	"repealed": false
}