{
	"id": "515B.2-1101",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-1101",
	"title": "515B.2-1101 COMMON INTEREST COMMUNITY PLAT (CIC PLAT); CIC CREATED ON OR AFTER AUGUST 1, 2010.",
	"text": "(a) A CIC plat is required for condominiums and planned communities, and cooperatives in which the unit owners' interests are characterized as real estate. The CIC plat is a part of the declaration in condominiums, in planned communities utilizing a CIC plat complying with subsection (c), and in cooperatives in which the unit owners' interests are characterized as real estate, but need not be physically attached to the declaration.\n(1) In a condominium, a planned community not utilizing a subdivision plat or registered land survey under subsection (d), clause (1), or a cooperative in which the unit owners' interests are characterized as real estate, the CIC plat shall comply with subsection (c).\n(2) In a planned community, a CIC plat that does not comply with subsection (c) shall consist of all or part of a subdivision plat or registered land survey complying with subsection (d), or any combination thereof. The CIC subdivision plat or registered land survey need not contain the number of the common interest community and may be recorded at any time before the recording of the declaration; provided that if the CIC plat complies with subsection (c), the number of the common interest community shall be included and the CIC plat shall be recorded at the time of recording of the declaration.\n(3) In a cooperative in which the unit owners' interests are characterized as personal property, a CIC plat shall not be required. In lieu of a CIC plat, the declaration, or any amendment or supplemental declaration creating, converting, or subdividing units shall include an exhibit containing a dimensioned, scale drawing showing (i) the boundaries of the land constituting the cooperative property, (ii) the location and dimensions of the front, rear, and side boundaries of each unit, and (iii) the unit's unit identifier and its location within the cooperative property.\n(b) The CIC plat or supplemental or amended CIC plat for condominiums, for planned communities using a plat complying with subsection (c), and for cooperatives in which the unit owners' interests are characterized as real estate shall contain certifications by a licensed professional land surveyor and licensed professional architect, as to the parts of the CIC plat prepared by each, that (i) the CIC plat accurately depicts all information required by this section, and (ii) the work was undertaken by, or reviewed and approved by, the certifying land surveyor or architect. The portions of the CIC plat depicting the dimensions of the portions of the common interest community described in subsection (c), clauses (8), (9), and (10), may be prepared by either a land surveyor or an architect. The other portions of the CIC plat shall be prepared only by a land surveyor. A certification of the CIC plat or supplemental CIC plat, or an amendment to it, under this subsection by an architect is not required if all parts of the CIC plat, supplemental CIC plat, or amendment are prepared by a land surveyor. Certification by the land surveyor or architect does not constitute a guaranty or warranty of the nature, suitability, or quality of construction of any improvements located or to be located in the common interest community.\n(c) A CIC plat for a condominium, a planned community not utilizing a subdivision plat or registered land survey under subsection (d), clause (1), or a cooperative in which the unit owners' interests are characterized as real estate shall show:\n(1) the number of the common interest community, and the boundaries, dimensions, and a legally sufficient description of the land included therein;\n(2) the dimensions and location of all existing roadways and material structural improvements that are part of the common elements;\n(3) the intended location and dimensions of all roadways and material structural improvements that may be constructed by the declarant within the common elements after the filing of the CIC plat, labeled either \"MUST BE BUILT\" or \"NEED NOT BE BUILT\";\n(4) the location and dimensions of any additional real estate, labeled as such, and a legally sufficient description of the additional real estate;\n(5) the extent of any encroachments by or upon any portion of the common interest community;\n(6) the location and dimensions of all recorded easements within the land included in the common interest community burdening any portion of the land;\n(7) the distance and direction between noncontiguous parcels of real estate;\n(8) the location and dimensions of limited common elements, except that with respect to limited common elements described in section 515B.2-109, subsections (c) and (d), only such material limited common elements as porches, balconies, decks, and patios shall be shown;\n(9) the location and dimensions of the front, rear, and side boundaries of each unit and that unit's unit identifier;\n(10) the location and dimensions of the upper and lower boundaries of each unit with reference to an established or assumed datum and that unit's unit identifier; and\n(11) a legally sufficient description of any real estate in which the unit owners will own only an estate for years, labeled as \"leasehold real estate.\"\n(d) A CIC plat for a planned community either shall comply with subsection (c), or it shall:\n(1) comply with chapter 505, 508, or 508A, as applicable; and\n(2) comply with the applicable subdivision requirements of any governmental authority within whose jurisdiction the planned community is located, subject to the limitations set forth in section 515B.1-106.\n(e) If a declarant adds additional real estate, the declarant shall record a supplemental CIC plat or plats for the real estate being added, conforming to the requirements of this section which apply to the type of common interest community in question. If less than all additional real estate is being added, the supplemental CIC plat complies with subsection (c), or a cooperative in which the unit owners' interests are characterized as real estate, shall also show the location and dimensions of the remaining portion.\n(f) A CIC plat which complies with subsection (c) is not subject to chapter 505.\n(g) This section applies only to common interest communities created on or after August 1, 2010.",
	"repealed": false
}