{
	"id": "332C.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/332C.05",
	"title": "332C.05 ENFORCEMENT.",
	"text": "(a) The attorney general may enforce this chapter under section 8.31.\n(b) A collecting party that violates this chapter is strictly liable to the debtor in question for the sum of:\n(1) actual damage sustained by the debtor as a result of the violation;\n(2) additional damages as the court may allow, but not exceeding $1,000 per violation; and\n(3) in the case of any successful action to enforce the foregoing, the costs of the action, together with a reasonable attorney fee as determined by the court.\n(c) A collecting party that willfully and maliciously violates this chapter is strictly liable to the debtor for three times the sums allowable under paragraph (b), clauses (1) and (2).\n(d) The dollar amount limit under paragraph (b), clause (2), changes on July 1 of each even-numbered year in an amount equal to changes made in the Consumer Price Index, compiled by the United States Bureau of Labor Statistics. The Consumer Price Index for December 2024 is the reference base index. If the Consumer Price Index is revised, the percentage of change made under this section must be calculated on the basis of the revised Consumer Price Index. If a Consumer Price Index revision changes the reference base index, a revised reference base index must be determined by multiplying the reference base index that is effective at the time by the rebasing factor furnished by the Bureau of Labor Statistics.\n(e) If the Consumer Price Index is superseded, the Consumer Price Index referred to in this section is the Consumer Price Index represented by the Bureau of Labor Statistics as most accurately reflecting changes in the prices paid by consumers for consumer goods and services.\n(f) The attorney general must publish the base reference index under paragraph (d) in the State Register no later than September 1, 2024. The attorney general must calculate and publish the revised Consumer Price Index under paragraph (d) in the State Register no later than September 1 each even-numbered year.\n(g) A collecting party must not be held liable in any action brought under this section if the collecting party shows by a preponderance of evidence that the violation:\n(1) was not intentional and resulted from a bona fide error made notwithstanding the maintenance of procedures reasonably adopted to avoid any bona fide error; or\n(2) was the result of inaccurate or incorrect information provided to the collecting party by a health care provider, as defined in section 62J.805, subdivision 4; a health carrier, as defined in section 62A.011, subdivision 2; or another collecting party currently or previously engaged in collection of the medical debt in question.",
	"repealed": false
}