{
	"id": "13.7411",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.7411",
	"title": "13.7411 POLLUTION CONTROL AND ENVIRONMENTAL QUALITY DATA CODED ELSEWHERE.",
	"text": "The sections referred to in subdivisions 2 to 9 are codified outside this chapter. Those sections classify pollution control and environmental quality data as other than public, place restrictions on access to government data, or involve data sharing.\nInformation that is a trade secret and is submitted to the commissioner of the Pollution Control Agency as part of an environmental audit performance schedule is classified under section 114C.23.\nInformation held by the commissioner of the Pollution Control Agency that is trade secret or sales information is governed by section 115A.06, subdivision 13.\n(a) Product stewardship program. Trade secret and sales data information submitted to the Pollution Control Agency under the product stewardship program is classified under section 115A.1415.\n(b) Transfer station data. Data received by a county or district from a transfer station under section 115A.84, subdivision 5, are classified under that section.\n(c) Solid waste records. Records of solid waste facilities received, inspected, or copied by a county pursuant to section 115A.882 are classified pursuant to section 115A.882, subdivision 3.\n(d) Customer lists. Customer lists provided to counties or cities by solid waste collectors are classified under section 115A.93, subdivision 5.\n(a) Responsible persons. Certain data obtained by the Pollution Control Agency from a person who may be responsible for a release are classified in section 115B.17, subdivision 5.\n(b) Harmful substance compensation. Access to data collected and maintained in connection with harmful substance compensation reimbursement is governed by sections 115B.28, subdivision 2; and 115B.35, subdivision 2.\n(c) Dry cleaners environmental account. Disclosure of data collected under section 115B.49, subdivision 4, is governed by chapter 270B.\nCertain data in connection with a petroleum tank release are classified under section 115C.03, subdivision 8.\nToxic pollution prevention plans are classified under section 115D.09.\nInformation provided by hazardous waste generators under section 473.151 and for which confidentiality is claimed is governed by section 116.075, subdivision 2.\n(a) Study data for radioactive waste disposal. Access to data derived from testing or studies for the disposal of radioactive waste is governed by section 116C.724, subdivision 3.\n(b) Low-level radioactive waste. Certain data given to the Pollution Control Agency by persons who generate, transport, or dispose of low-level radioactive waste are classified under section 116C.840.",
	"repealed": false
}