{
	"id": "205.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/205.16",
	"title": "205.16 NOTICE.",
	"text": "In every municipality, the municipal clerk shall, except as otherwise provided in this section, give two weeks' published notice, and may also give ten days' posted notice, of the election, stating the time of the election, the location of each polling place, the offices to be filled, and all propositions or questions to be voted upon at the election. In a city of the fourth class or a town not located within a metropolitan county as defined in section 473.121, the governing body may dispense with publication of the notice of the municipal general election, in which case ten days' posted notice shall be given. The municipal clerk shall also post a copy of the notice in the clerk's office for public inspection.\nFor every municipal election not held in conjunction with a statewide election, the municipal clerk must, at least two weeks before the election, publish a notice to voters pursuant to section 204D.16 in the official newspaper of the municipality, except that the governing body of a fourth class city or a town not located within a metropolitan county as defined in section 473.121 may dispense with publication.\nFor every municipal election, the municipal clerk shall at least two weeks before the election prepare a sample ballot for the municipality, make them available for public inspection in the clerk's office, and post a sample ballot in each polling place on election day.\nAt least 84 days before every municipal election, the municipal clerk shall provide a written notice to the county auditor, including the date of the election, the offices to be voted on at the election, and the title and language for each ballot question to be voted on at the election. At least 84 days before every municipal election, the municipal clerk must provide written notice to the county auditor of any special election canceled under section 205.10, subdivision 6.\nAt least 84 days before every municipal election for which a notice is provided to the county auditor under subdivision 4, the county auditor shall provide a notice of the election to the secretary of state, in a manner and including information prescribed by the secretary of state.",
	"repealed": false
}