{
	"id": "181A.116",
	"url": "https://www.revisor.mn.gov/statutes/cite/181A.116",
	"title": "181A.116 OPERATION OF LAWN CARE EQUIPMENT.",
	"text": "(a) Notwithstanding section 181A.04, subdivision 5, minors of at least 16 years of age may be employed to operate lawn care equipment. For the purposes of this section, \"lawn care equipment\" means lawn trimmers, weed cutters, and machines designed to cut grass and weeds that meet safety specifications of the American National Standards Institute/Outdoor Power Equipment Institute's (ANSI/OPEI) B71.1 2017 definition of pedestrian-controlled mowers and ride-on mowers.\n(b) A 16- or 17-year-old employed under this section must:\n(1) prior to operating lawn care equipment, be trained in the safe operation of each type of lawn care equipment listed in paragraph (a) to be operated by the 16- or 17-year-old; and\n(2) wear personal protective equipment, including, but not limited to, safety glasses, hearing protection, gloves, safety vest, and work boots, as necessary, at all times when operating the lawn care equipment listed in paragraph (a).\n(c) An employer employing a 16- or 17-year-old under this section shall:\n(1) ensure that lawn care equipment operators that are ages 16 or 17 follow all safety rules and instructions provided in the equipment's operator manual, including prohibiting the operation of lawn care equipment on a slope greater than is recommended by the operator's manual; and\n(2) ensure required safety equipment is in place and operational on all lawn care equipment, including roll-over protection, seat belts, operator presence control systems, interlocks, guards, and shields.\n(d) The exception under this section allowing minors 16 and 17 years of age to be employed to operate lawn care equipment is limited to the following:\n(1) minors who are directly employed by a golf course, resort, or municipality to perform lawn care on golf courses, resort grounds, and municipal grounds; and\n(2) minors who are directly employed by a rental property owner and the minor performs lawn care on the owner's rental property.",
	"repealed": false
}