{
	"id": "146B.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.02",
	"title": "146B.02 ESTABLISHMENT LICENSE PROCEDURES.",
	"text": "Beginning January 1, 2011, no person acting individually or jointly with any other person may maintain, own, or operate a body art establishment in the state without an establishment license issued by the commissioner in accordance with this chapter, except as permitted under subdivision 8 or 9.\n(a) Each application for an initial mobile or fixed-site establishment license and for renewal must be submitted to the commissioner on a form provided by the commissioner accompanied with the applicable fee required under section 146B.10. The application must contain:\n(1) the name(s) of the owner(s) and operator(s) of the establishment;\n(2) the location of the establishment;\n(3) verification of compliance with all applicable local and state codes;\n(4) a description of the general nature of the business; and\n(5) any other relevant information deemed necessary by the commissioner.\n(b) If the information submitted is complete and complies with the requirements of this chapter, the commissioner shall issue a provisional establishment license. The provisional license is effective until the commissioner determines, after inspection, that the applicant has met the requirements of this chapter. Upon approval, the commissioner shall issue a body art establishment license.\n(c) An establishment license must be renewed every two years.\n(a) The commissioner must inspect an establishment issued a provisional license within one year of the date the license was issued. Thereafter at least one time during each two-year licensure period, the commissioner shall conduct an inspection of the body art establishment and a review of any records necessary to ensure that the standards required under this chapter are met.\n(b) The commissioner shall have the authority to enter a premises to make an inspection. Refusal to permit an inspection constitutes valid grounds for licensure denial or revocation.\n(c) If the establishment seeking licensure is new construction or if a licensed establishment is remodeling, the establishment must meet all local building and zoning codes.\nNo person may perform a body art procedure at any location other than a body art establishment licensed under this chapter except as permitted under subdivisions 8 and 9.\n(a) A body art establishment license must be issued to a specific person and location and is not transferable. A license must be prominently displayed in a public area of the establishment.\n(b) An owner who has purchased a body art establishment licensed under the previous owner must submit an application to license the establishment within two weeks of the date of sale. Notwithstanding subdivision 1, the new owner may continue to operate for 60 days after the sale while waiting for a new license to be issued.\n(c) An owner of a licensed body art establishment who is relocating the establishment must submit an application for the new location. The owner may request that the new application become effective at a specified date in the future. If the relocation is not accomplished by the date expected, and the license at the existing location expires, the owner may apply for a temporary event permit to continue to operate at the old location. The owner may apply for no more than four temporary event permits to continue operating at the old location.\nThe following information must be kept on file for three years on the premises of the establishment and must be made available for inspection upon request by the commissioner:\n(1) a description of all body art procedures performed by the establishment;\n(2) copies of the spore tests conducted on each sterilizer; and\n(3) the following information for each technician or guest artist employed or performing body art procedures in the establishment:\n(i) name;\n(ii) home address;\n(iii) home telephone number;\n(iv) date of birth;\n(v) copy of an identification photo; and\n(vi) license number or guest artist license number.\nIf the body art establishment is located within a private residence, the space where the body art procedures are performed must:\n(1) be completely partitioned off;\n(2) be exclusively used for body art procedures, except for licensed practices under chapter 155A which must be performed in compliance with the health and safety standards in this chapter;\n(3) be separate from the residential living, eating, and bathroom areas;\n(4) have a separate and secure entrance accessible without entering the residential living, eating, and bathroom areas;\n(5) meet the standards of this chapter; and\n(6) be made available for inspection upon the request of the commissioner.\nMS 2018 [Repealed, 2019 c 29 s 2]\n(a) An applicant for a permit to hold a temporary body art event shall submit an application to the commissioner. The application must be received at least 14 days before the start of the event. The application must include the specific days and hours of operation. An applicant issued a temporary event permit shall comply with the requirements of this chapter.\n(b) Applications received less than 14 days prior to the start of the event may be processed if the commissioner determines it is possible to conduct all required work, including an inspection.\n(c) The temporary event permit must be prominently displayed in a public area at the location.\n(d) The temporary event permit, if approved, is valid for the specified dates and hours listed on the application. No temporary events permit shall be issued for longer than a 21-day period, and may not be extended.\n(e) No individual who does not hold a current body art establishment license may be issued a temporary event permit more than four times within the same calendar year.\n(f) No individual who has been disciplined for a serious violation of this chapter within three years preceding the intended start date of a temporary event may be issued a license for a temporary event. Violations that preclude issuance of a temporary event permit include unlicensed practice; practice in an unlicensed location; any of the conditions listed in section 146B.05, subdivision 1, clauses (1) to (8), (12), or (13); 146B.08, subdivision 3, clauses (4), (5), and (10) to (12); or any other violation that places the health or safety of a client at risk.\n(a) Any body art establishment located within a county or municipal jurisdiction that has enacted an ordinance that establishes licensure for body art establishments operating within the jurisdiction shall be exempt from this chapter if the provisions of the ordinance meet or exceed the provisions of this chapter. Any county or municipal jurisdiction that maintains an ordinance that meets this exception may limit the types of body art procedures that may be performed in body art establishments located within its jurisdiction.\n(b) Any individual performing body art procedures in an establishment that meets an exception under this subdivision must be licensed as a body art technician under this chapter.\n(a) The commissioner may choose to deny a body art establishment license to an applicant who has been disciplined for a serious violation under this chapter. Violations that constitute grounds for denial of license are any of the conditions listed in section 146B.05, subdivision 1, clauses (1) to (8), (12), or (13); 146B.08, subdivision 3, clauses (4), (5), or (10) to (12); or any other violation that places the health or safety of a client at risk.\n(b) In considering whether to grant a license to an applicant who has been disciplined for a violation described in this subdivision, the commissioner shall consider evidence of rehabilitation, including the nature and seriousness of the violation, circumstances relative to the violation, the length of time elapsed since the violation, and evidence that demonstrates that the applicant has maintained safe, ethical, and responsible body art practice since the time of the most recent violation.\nAny person who violates the provisions of subdivision 1 or who performs body art in an unlicensed location is guilty of a gross misdemeanor.",
	"repealed": false
}