{
	"id": "6.495",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.495",
	"title": "6.495 EXAMINATION OF FIRE RELIEF ASSOCIATIONS.",
	"text": "All powers and duties conferred and imposed upon the state auditor with respect to state, county, and first-class city officers, institutions, and property are hereby extended to the various fire relief associations in the state. The state auditor shall annually audit the special and general funds of the relief association or, at the request of the board of trustees or the municipality, the state auditor may contract for an annual audit by a certified public accountant. The state auditor may determine that an annual audit is not necessary, in which case the state auditor shall develop a plan for examination of unaudited relief associations, and shall prescribe suitable systems of accounts and budgeting, and forms, books, and instructions concerning the same.\nCopies of the written report of the state auditor on the financial condition and accounts of the relief association must be filed with the board of trustees of the relief association and the governing body of the municipality associated with the relief association. If the report discloses malfeasance, misfeasance, or nonfeasance with regard to relief association funds, copies thereof must be filed with the city attorney or county attorney in the city or county in which the relief association is located, and these officials of the law shall institute proceedings, civil or criminal, as the law and public interest require.\n[Repealed, 1987 c 404 s 191]\n(a) On or before September 15, November 1, March 1, and June 1, the state auditor must file with the commissioner of revenue a financial compliance report certifying for each relief association:\n(1) the completion of the annual financial report required under section 424A.014 and the auditing or certification of those financial reports under subdivision 1; and\n(2) the receipt of any actuarial valuations required under section 424A.093 or Laws 2013, chapter 111, article 5, sections 31 to 42.\n(b) The commissioner of revenue shall prescribe the content, format, and manner of the financial compliance reports required by paragraph (a), pursuant to section 270C.30.",
	"repealed": false
}