{
	"id": "524.3-806",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.3-806",
	"title": "524.3-806 ALLOWANCE OF CLAIMS.",
	"text": "(a) As to claims presented in the manner described in section 524.3-804 within the time limit prescribed or permitted in section 524.3-803, the personal representative may mail a notice to any claimant stating that the claim has been disallowed. If, after allowing or disallowing a claim, the personal representative changes the decision concerning the claim, the personal representative shall notify the claimant. Without order of the court for cause shown, the personal representative may not change a disallowance of a claim after the time for the claimant to file a petition for allowance or to commence a proceeding on the claim has run and the claim has been barred. Every claim which is disallowed in whole or in part by the personal representative is barred so far as not allowed unless the claimant files a petition for allowance in the court or commences a proceeding against the personal representative not later than two months after the mailing of the notice of disallowance or partial allowance if the notice warns the claimant of the impending bar. Failure of the personal representative to mail notice to a claimant of action on the claim for two months after the time for original presentation of the claim has expired has the effect of a notice of allowance, except that upon petition of the personal representative and upon notice to the claimant, the court at any time before payment of such claim may for cause shown permit the personal representative to disallow such claim. Any claim in excess of $3,000 for personal services rendered by an individual to the decedent including compensation of persons attending the decedent during a last illness, and any claim of the personal representative which arose before the death of the decedent or in which the personal representative has an interest in excess of $3,000 may be allowed only in compliance with subsection (b).\n(b) Upon the petition of the personal representative or of a claimant in a proceeding for the purpose, the court may allow in whole or in part any claim or claims presented to the personal representative or filed with the court administrator in due time and not barred by subsection (a) of this section. Notice in this proceeding shall be given to the claimant, the personal representative and those other persons interested in the estate as the court may direct by order entered at the time the proceeding is commenced.\n(c) A judgment in a proceeding in another court against a personal representative to enforce a claim against a decedent's estate is an allowance of the claim.\n(d) Unless otherwise provided in any judgment in another court entered against the personal representative, allowed claims bear interest at the legal rate for the period commencing 60 days after the time for original presentation of the claim has expired unless based on a contract making a provision for interest, in which case they bear interest in accordance with that provision. Notwithstanding the preceding sentence, claims that have been disallowed pursuant to clause (a) and are subsequently allowed by the personal representative or reduced to judgment shall bear interest at the legal rate from the latter of the following dates:\n(1) 60 days after the time for original presentation of the claim; or\n(2) the date the claim is allowed or the date judgment is entered.",
	"repealed": false
}