{
	"id": "446A.083",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.083",
	"title": "446A.083 METHAMPHETAMINE LABORATORY CLEANUP REVOLVING ACCOUNT.",
	"text": "As used in this section:\n(1) \"clandestine lab site\" has the meaning given in section 152.0275, subdivision 1, paragraph (a);\n(2) \"property\" has the meaning given in section 152.0275, subdivision 2, paragraph (a), but does not include motor vehicles; and\n(3) \"remediate\" has the meaning given to remediation in section 152.0275, subdivision 1, paragraph (a).\nThe authority shall establish a methamphetamine laboratory cleanup revolving account in the public facility authority fund to provide loans to counties and cities to remediate clandestine lab sites. The account must be credited with repayments.\nApplications by a county or city for a loan from the account must be made to the authority on the forms prescribed by the authority. The application must include, but is not limited to:\n(1) the amount of the loan requested and the proposed use of the loan proceeds;\n(2) the source of revenues to repay the loan; and\n(3) certification by the county or city that it meets the loan eligibility requirements of subdivision 4.\nA county or city is eligible for a loan under this section if the county or city:\n(1) identifies a site or sites designated by a local public health department or law enforcement as a clandestine lab site;\n(2) has required the site's property owner to remediate the site at cost, under a local public health nuisance ordinance that addresses clandestine lab remediation;\n(3) certifies that the property owner cannot pay for the remediation immediately;\n(4) certifies that the property owner has not properly remediated the site; and\n(5) issues a revenue bond, secured as provided in subdivision 8, payable to the authority to secure the loan.\n(a) A loan recipient shall use the loan to remediate the clandestine lab site or if this has already been done to reimburse the applicable county or city fund for costs paid by the recipient to remediate the clandestine lab site.\n(b) A loan recipient shall seek reimbursement from the owner of the property containing the clandestine lab site for the costs of the remediation. In addition to other lawful means of seeking reimbursement, the loan recipient may recover its costs through a property tax assessment by following the procedures specified in section 145A.08, subdivision 2, paragraph (c).\n(c) A mortgagee is not responsible for cleanup costs under this section solely because the mortgagee becomes an owner of real property through foreclosure of the mortgage or by receipt of the deed to the mortgaged property in lieu of foreclosure.\nThe authority shall award loans to recipients on a first-come, first-served basis, provided that the recipient is able to comply with the terms and conditions of the authority loan, which must be in conformance with this section. The authority shall make a single disbursement of the loan upon receipt of a payment request that includes a list of remediation expenses and evidence that a second-party sampling was undertaken to ensure that the remediation work was successful or a guarantee that such a sampling will be undertaken.\n(a) When making loans from the revolving account, the authority shall comply with the criteria in paragraphs (b) to (e).\n(b) Loans must be made at a two percent per annum interest rate for terms not to exceed ten years unless the recipient requests a 20-year term due to financial hardship.\n(c) The annual principal and interest payments must begin no later than one year after completion of the cleanup. Loans must be amortized no later than 20 years after completion of the cleanup.\n(d) A loan recipient must identify and establish a source of revenue for repayment of the loan and must undertake whatever steps are necessary to collect payments within one year of receipt of funds from the authority.\n(e) The account must be credited with all payments of principal and interest on all loans, except the costs as permitted under section 446A.04, subdivision 5, paragraph (a).\n(f) Loans must be made only to recipients with clandestine lab ordinances that address remediation.\nCounties and cities may incur debt under this section by resolution of the board or council authorizing issuance of a revenue bond to the authority. The county or city may secure and pay the revenue bond only with proceeds derived from the property containing the clandestine lab site, including assessments and charges under section 145A.08, subdivision 2, paragraph (c); payments by the property owner; or similar revenues.",
	"repealed": false
}