{
	"id": "272.039",
	"url": "https://www.revisor.mn.gov/statutes/cite/272.039",
	"title": "272.039 LEGISLATIVE FINDINGS AND CONCLUSIONS RELATED TO THE TAXATION OF MINERALS OWNED SEPARATELY FROM THE SURFACE.",
	"text": "The legislature finds, for the reasons stated below, that a class of real property has been created which, although not exempt from taxation, is not assessed for tax purposes and does not, therefore, contribute anything toward the cost of supporting the governments which protect and preserve the continued existence of the property. These reasons are as follows: (1) In the case of Washburn v. Gregory, 1914, 125 Minn. 491, 147 N.W. 706, the Minnesota Supreme Court determined that where mineral interests are owned separately from the surface interests in real estate, the mineral interest is a separate interest in land, separately taxable, and does not forfeit if the overlying surface interest forfeits for nonpayment of taxes due on the surface interest; (2) Since this 1914 decision, mineral interests owned separately from the surface have been valued and assessed for tax purposes, as a practical matter, only if the value of the minerals has been determined through drilling and drill core analysis; and (3) The absence of any taxation of mineral interests owned separately from the surface, except where drilling analysis is available, has encouraged the separation of ownership of surface and mineral estates and resulted in the creation of hundreds of thousands of acres of untaxed mineral estate lands which thus are immune from tax forfeiture. The legislature also finds that the province of Ontario in Canada, which has land ownership patterns and mineral characteristics similar to that of Minnesota, has imposed a tax of $.50 an acre on minerals owned separately from the surface since 1968, and $.10 an acre before that. The legislature further finds that the identification of separately owned mineral interests by taxing authorities requires title searches which are extremely burdensome and, where no public tract index is available, prohibitively expensive. This result is caused in part by the decision in Wichelman v. Messner, 1957, 250 Minn. 88, 83 N.W. (2d) 800, where the so called \"40 year law\" was held inapplicable to mineral interests owned separately from surface interests. On the basis of the above findings, and for the purpose of requiring mineral interests owned separately from surface interests to contribute to the cost of government at a time when other interests in real property are heavily burdened with real property taxes, the legislature concludes that the taxation of severed mineral interests as provided in section 273.165, subdivision 1 is necessary and in the public interest, and provides fair taxation of a class of real property which has escaped taxation for many years. The legislature further concludes that such a tax is not prohibited by Minnesota Constitution, article 10, section 2. The legislature concludes finally that the amendments and repeals made by Laws 1973, chapter 650 to sections 93.52 to 93.58, are necessary to provide adequate identification of mineral interests owned separately from the surface and to prevent the continued escape from taxation of obscure and fractionalized severed mineral interests.",
	"repealed": false
}