{
	"id": "53C.083",
	"url": "https://www.revisor.mn.gov/statutes/cite/53C.083",
	"title": "53C.083 CONSUMER REPORT DISCLOSURE.",
	"text": "(a) When a consumer report from a consumer reporting agency has been obtained by a lender or retail seller for use in connection with an application for credit initiated by a buyer for the purchase or lease of a motor vehicle:\n(1) the lender shall provide to the retail seller, upon written request of the buyer, and unless required by federal law to provide the adverse action notice, prior to the sale or lease of the motor vehicle, the name of each credit reporting agency providing a consumer report that was obtained and used by the lender;\n(2) the retail seller shall provide, prior to the sale or lease of the motor vehicle the following notice in at least ten-point boldface type on a document separate from the sale or lease contract, which must also include the name, address, and telephone number of four principal consumer reporting agencies:\n\"NOTICE TO MOTOR VEHICLE CREDIT APPLICANT\nA consumer report from a consumer reporting agency was used in connection with your application to finance the acquisition of a motor vehicle. Consumer reports include data about your credit history and payment patterns. Consumer reports are important because they are used in determining whether to extend credit and may be used to determine the annual percentage rate you may be offered.\nIf you have questions about your consumer report, you are entitled to know the name, address, and telephone number of the consumer reporting agency that provided the consumer report used to evaluate your loan application. You may ask the dealer for this information. You may then contact the consumer reporting agency at the address and telephone number provided. You are entitled under federal law to a free copy annually of your consumer report by calling 1-877-322-8228 or visiting annualcreditreport.com\"; and\n(3) upon written request of the buyer, the retail seller shall obtain from the lender the consumer reporting agency information specified in clause (1) and shall provide that information to the buyer.\n(b) This section does not require a dealer to provide more than one disclosure for each purchase or lease transaction. For purposes of this section, \"consumer report\" and \"consumer reporting agency\" have the meanings given in section 13C.001.",
	"repealed": false
}