{
	"id": "136D.281",
	"url": "https://www.revisor.mn.gov/statutes/cite/136D.281",
	"title": "136D.281 BONDS.",
	"text": "The intermediate school board, acting in its own behalf, may issue bonds for the acquisition and betterment of school facilities or equipment or for the funding or refunding of outstanding bonds, warrants, orders, or certificates of indebtedness.\nChapter 475 shall be applicable in all respects.\nThe purpose and the amount of any borrowing shall first be approved by resolution of the school board of the intermediate school district. When the resolution has been adopted by the intermediate school board it shall be published once in a newspaper of general circulation in said district.\n(a) The intermediate school board shall not sell and issue bonds for acquisition or betterment purposes until the question of their issuance has been submitted to the voters of the intermediate school district at a special election held in and for the intermediate district. The date of the election, the question to be submitted, and all other necessary conduct of the election shall be fixed by the intermediate school board. The election shall be conducted and canvassed under the direction of the intermediate school board in accordance with chapter 205A, insofar as applicable.\n(b) If a majority of the total number of votes cast on the question within the intermediate school district is in favor of the question, the intermediate school board may proceed with the sale and issuance of the bonds.\nThe full faith, credit, and unlimited taxing powers of the intermediate school district shall be pledged to the payment of all bonds and certificates of indebtedness, and none of the obligations shall be included in the net debt of any participating school district as defined by section 475.51, subdivision 4, or any other similar law.\nThe intermediate school board upon awarding a contract for the sale of the bonds shall certify to the county auditor or county auditors the years and amounts of taxes required to be levied for the payment of the bonds as provided by section 475.61. The county auditor shall cause taxes to be spread in each year until bonds and interest have been paid upon all of the assessable, taxable valuation of the intermediate school district.\nIn all other respects chapter 475 shall apply and the bonds shall be deemed authorized securities within the provisions of section 50.14 and shall be deemed instruments of a public governmental agency.\nThe intermediate school board may not issue bonds under this section after July 1, 1994.",
	"repealed": false
}