{
	"id": "168.346",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.346",
	"title": "168.346 PRIVACY OF PERSONAL INFORMATION.",
	"text": "(a) Data on an individual provided to register a vehicle shall be treated as provided by United States Code, title 18, section 2721, as in effect on May 23, 2005, and shall be disclosed as required or permitted by that section. Licensed dealers may obtain data for uses as permitted by United States Code, title 18, section 2721, subsections (b)(2), for use in connection with matters of motor vehicle or driver safety and theft, motor vehicle emissions, or motor vehicle product alterations, recalls, or advisories, (3), and (13). The commissioner shall disclose the data in bulk form to an authorized recipient upon request for any of the permissible uses described in United States Code, title 18, section 2721.\n(b) The registered owner of a vehicle who is an individual may consent in writing to the commissioner to disclose the individual's personal information exempted by United States Code, title 18, section 2721, to any person who makes a written request for the personal information. If the registered owner is an individual and so authorizes disclosure, the commissioner shall implement the request.\n(c) If authorized by the registered owner as indicated in paragraph (b), the registered owner's personal information may be used, rented, or sold solely for bulk distribution by organizations for business purposes including surveys, marketing, or solicitation.\nThe commissioner shall disclose personal information when the use is related to the operation or use of a vehicle or to public safety. The use of personal information is related to public safety if it concerns the physical safety or security of drivers, vehicles, pedestrians, or property. The commissioner may refuse to disclose data under this subdivision when the commissioner concludes that the requester is likely to use the data for illegal, improper, or noninvestigative purposes.\nThe registered owner of a vehicle who is an individual may request, in writing, that the registered owner's residence address or name and residence address be classified as \"private data on individuals,\" as defined in section 13.02, subdivision 12. The commissioner shall grant the classification on receipt of a signed statement by the registered owner that the classification is required for the safety of the registered owner or the registered owner's family, if the statement also provides a valid, existing address where the registered owner consents to receive service of process. The commissioner shall use the service of process mailing address in place of the registered owner's residence address in all documents and notices pertaining to the vehicle. The residence address or name and residence address and any information provided in the classification request, other than the individual's service for process mailing address, are private data on individuals but may be provided to requesting law enforcement agencies, probation and parole agencies, and public authorities, as defined in section 518A.26, subdivision 18.",
	"repealed": false
}