{
	"id": "302A.457",
	"url": "https://www.revisor.mn.gov/statutes/cite/302A.457",
	"title": "302A.457 SHAREHOLDER CONTROL AGREEMENTS.",
	"text": "A written agreement among the shareholders of a corporation and the subscribers for shares to be issued, relating to the control of any phase of the business and affairs of the corporation, its liquidation and dissolution, or the relations among shareholders of or subscribers to shares of the corporation is valid and specifically enforceable as provided in subdivision 2. The agreement may also include as parties persons who are neither shareholders nor subscribers.\n(a) A written agreement as described in subdivision 1 that relates to the control of or the liquidation and dissolution of the corporation, the relations among the shareholders and subscribers, or any phase of the business and affairs of the corporation, including, without limitation, the management of its business, the declaration and payment of distributions, the election of directors or officers, the employment of shareholders and others by the corporation, or the arbitration of disputes, is valid and specifically enforceable, if the agreement is signed by all persons who, on the date the agreement first becomes effective, are then the shareholders of the corporation, whether or not the shareholders all have voting shares, and the subscribers for shares, whether or not voting shares, to be issued. A written agreement as described in subdivision 1 may provide for its amendment through nonunanimous means.\n(b) The agreement is enforceable by the persons who are parties to it and is binding upon and enforceable against only those persons and other persons having knowledge of the existence of the agreement. A copy of the agreement shall be filed with the corporation. The existence and location of a copy of the agreement shall be noted conspicuously on the face or back of each certificate for shares issued by the corporation and included in information sent to the holders of uncertificated shares according to section 302A.417, subdivision 7.\n(c) A shareholder, a beneficial owner of shares, or another person having a security interest in shares has the right upon written demand to obtain a copy of the agreement from the corporation at the expense of the corporation.\nThe effect of an agreement authorized by this section is to relieve the board and the director or directors in their capacities as directors of, and to impose upon the parties to the agreement, the liability for acts or omissions imposed by law upon directors to the extent that and so long as the discretion or powers of the directors in the management of the business and affairs of the corporation are exercised by the shareholders under a provision in the agreement. A shareholder is not liable pursuant to this subdivision by virtue of a shareholder vote, if the shareholder had no right to vote on the action.\nThis section does not apply to, limit, or restrict agreements otherwise valid, nor is the procedure set forth in this section the exclusive method of agreement among shareholders or between the shareholders and the corporation with respect to any of the matters described in this section.",
	"repealed": false
}