{
	"id": "571.913",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.913",
	"title": "571.913 EFFECT OF EXEMPTION NOTICE.",
	"text": "Within two business days after receipt of the garnishment summons, the notice, instructions, and two copies of the exemption notice, the financial institution shall serve upon the debtor the notice, instructions, and two copies of the exemption notice. The financial institution shall serve these forms by first class mail to the last known address of the debtor. If no claim of exemption is received by the financial institution within 14 days after the exemption notices are mailed to the debtor, the funds remain subject to the garnishment summons. If the debtor elects to claim an exemption, the debtor shall complete the exemption notices, sign them under penalty of perjury, and deliver one copy to the financial institution and one copy to the attorney for the creditor within 14 days of the date postmarked on the correspondence mailed to the debtor containing the exemption notices. The debtor is also required to include copies of bank statements for the prior 60 days with the exemption notice delivered to the attorney for the creditor. In the event that there is no attorney for the creditor, then the notice and the bank statements must be sent directly to the creditor. Failure of the debtor to deliver the executed exemption notice or copies of the required bank statements for the prior 60 days does not constitute a waiver of a claimed right to an exemption. Upon timely receipt of a claim of exemption, funds not claimed to be exempt by the debtor remain subject to the garnishment summons. All money claimed to be exempt shall be released to the debtor upon the expiration of six business days after the date postmarked on the envelope containing the executed exemption notice mailed to the financial institution, or the date of personal delivery of the executed exemption notice to the financial institution, unless within that time the creditor interposes an objection to the exemption.",
	"repealed": false
}