{
	"id": "145.8811",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.8811",
	"title": "145.8811 MATERNAL AND CHILD HEALTH ADVISORY TASK FORCE.",
	"text": "The commissioner shall establish and appoint a Maternal and Child Health Advisory Task Force consisting of 15 members who will provide equal representation from:\n(1) professionals with expertise in maternal and child health services;\n(2) representatives of community health boards as defined in section 145A.02, subdivision 5; and\n(3) consumer representatives interested in the health of mothers and children.\nNo members shall be employees of the Minnesota Department of Health. Section 15.059 governs the Maternal and Child Health Advisory Task Force. Notwithstanding section 15.059, the Maternal and Child Health Advisory Task Force does not expire.\nThe advisory task force shall meet on a regular basis to perform the following duties:\n(1) review and report on the health care needs of mothers and children throughout the state of Minnesota;\n(2) review and report on the type, frequency, and impact of maternal and child health care services provided to mothers and children under existing maternal and child health care programs, including programs administered by the commissioner of health;\n(3) establish, review, and report to the commissioner a list of program guidelines and criteria which the advisory task force considers essential to providing an effective maternal and child health care program to low-income populations and high-risk persons and fulfilling the purposes defined in section 145.88;\n(4) make recommendations to the commissioner for the use of other federal and state funds available to meet maternal and child health needs;\n(5) make recommendations to the commissioner of health on priorities for funding the following maternal and child health services:\n(i) prenatal, delivery, and postpartum care;\n(ii) comprehensive health care for children, especially from birth through five years of age;\n(iii) adolescent health services;\n(iv) family planning services;\n(v) preventive dental care;\n(vi) special services for chronically ill and disabled children; and\n(vii) any other services that promote the health of mothers and children; and\n(6) establish in consultation with the commissioner statewide outcomes that will improve the health status of mothers and children.",
	"repealed": false
}