{
	"id": "176.151",
	"url": "https://www.revisor.mn.gov/statutes/cite/176.151",
	"title": "176.151 TIME LIMITATIONS.",
	"text": "The time within which the following acts shall be performed shall be limited to the following periods, respectively:\n(a) Actions or proceedings by an injured employee to determine or recover compensation, three years after the employer has made written report of the injury to the commissioner of the Department of Labor and Industry, but not to exceed six years from the date of the accident.\n(b) Actions or proceedings by dependents to determine or recover compensation, three years after the receipt by the commissioner of the Department of Labor and Industry of written notice of death, given by the employer, but not to exceed six years from the date of injury, provided, however, if the employee was paid compensation for the injury from which the death resulted, such actions or proceedings by dependents must be commenced within three years after the receipt by the commissioner of the Department of Labor and Industry of written notice of death, given by the employer, but not to exceed six years from the date of death. In any such case, if a dependent of the deceased, or any one in the dependent's behalf, gives written notice of such death to the commissioner of the Department of Labor and Industry, the commissioner shall forthwith give written notice to the employer of the time and place of such death. In case the deceased was a native of a foreign country and leaves no known dependent within the United States, the commissioner of the Department of Labor and Industry shall give written notice of the death to the consul or other representative of the foreign country forthwith.\n(c) In case of physical or mental incapacity, other than minority, of the injured person or dependents to perform or cause to be performed any act required within the time specified in this section, the period of limitation in any such case shall be extended for three years from the date when the incapacity ceases.\n(d) In the case of injury caused by x-rays, radium, radioactive substances or machines, ionizing radiation, or any other occupational disease, the time limitations otherwise prescribed by Minnesota Statutes 1961, chapter 176, and acts amendatory thereof, shall not apply, but the employee shall give notice to the employer and commence an action within three years after the employee has knowledge of the cause of such injury and the injury has resulted in disability.",
	"repealed": false
}