{
	"id": "307.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/307.08",
	"title": "307.08 DAMAGES; ILLEGAL MOLESTATION OF HUMAN REMAINS; BURIALS; CEMETERIES; PENALTY; ASSESSMENT.",
	"text": "It is a declaration and statement of legislative intent that all human burials, human remains, and human burial grounds shall be accorded equal treatment and respect for human dignity without reference to their ethnic origins, cultural backgrounds, or religious affiliations. The provisions of this section shall apply to all human burials, human remains, or human burial grounds found on or in all public or private lands or waters in Minnesota. Within the boundaries of Tribal Nation reservations, nothing in this section should be interpreted to conflict with federal law, including the Native American Graves Protection and Repatriation Act (NAGPRA), United States Code, title 25, section 3001 et seq., and its implementing regulations, Code of Federal Regulations, title 43, part 10.\n(a) A person who intentionally, willfully, or knowingly does any of the following is guilty of a felony:\n(1) destroys, mutilates, or injures human burials, human burial grounds, or associated grave goods; or\n(2) without the consent of the appropriate authority, disturbs human burial grounds or removes human remains or associated grave goods.\n(b) A person who, without the consent of the appropriate authority and the landowner, intentionally, willfully, or knowingly does any of the following is guilty of a gross misdemeanor:\n(1) removes any tombstone, monument, or structure placed in any public or private cemetery or assessed human burial ground; or\n(2) removes any fence, railing, natural stone, or other work erected for protection or ornament, or any tree, shrub, or plant within the limits of a public or private cemetery or assessed human burial ground; or\n(3) discharges any firearms upon or over the grounds of any public or private cemetery or assessed burial ground.\n(c) A person who intentionally, willfully, or knowingly fails to comply with any other provision of this section is guilty of a misdemeanor.\nUpon the agreement of the appropriate authority and the landowner, an authenticated or recorded human burial ground may be posted for protective purposes every 75 feet around its perimeter with signs listing the activities prohibited by subdivision 2 and the penalty for violation of it. Posting is at the discretion of the Indian Affairs Council in the case of American Indian burials or at the discretion of the state archaeologist in the case of non-American Indian burials. This subdivision does not require posting of a burial ground. The size, description, location, and information on the signs used for protective posting must be approved by the appropriate authority and the landowner.\n(a) Cemeteries shall be assessed according to this subdivision.\n(b) The state archaeologist shall implement and maintain a system of records identifying the location of known, recorded, or suspected cemeteries. The state archaeologist shall provide access to the records as provided in subdivision 11.\n(c) The cemetery condition assessment of non-American Indian cemeteries is at the discretion of the state archaeologist based on the needs identified in this section or upon request by an agency, a landowner, or other appropriate authority.\n(d) The cemetery condition assessment of American Indian cemeteries is at the discretion of the Indian Affairs Council based on the needs identified in this section or upon request by an agency, a landowner, or other appropriate authority. If the Indian Affairs Council has possession or takes custody of remains they may follow United States Code, title 25, sections 3001 to 3013.\n(e) The cemetery condition assessment of cemeteries that include American Indian and non-American Indian remains or include remains whose ancestry cannot be determined shall be assessed at the discretion of the state archaeologist in collaboration with the Indian Affairs Council based on the needs identified in this section or upon request by an agency, a landowner, or other appropriate authority.\n(f) The state archaeologist and the Indian Affairs Council shall have 90 days from the date a request is received to begin a cemetery condition assessment or provide notice to the requester whether or not a condition assessment of a cemetery is needed.\n(g) The state archaeologist and the Indian Affairs Council may retain the services of a qualified professional archaeologist, a qualified forensic anthropologist, or other appropriate experts for the purpose of gathering information that the state archaeologist or the Indian Affairs Council can use to assess or identify cemeteries. If probable American Indian cemeteries are to be disturbed or probable American Indian remains analyzed, the Indian Affairs Council must approve the professional archaeologist, qualified anthropologist, or other appropriate expert.\n[Repealed by amendment, 2007 c 115 s 1]\nThe cost of condition assessment, recording, surveying, and marking burial grounds and the cost of identification, analysis, rescue, and reburial of human remains on public lands or waters shall be the responsibility of the state or political subdivision controlling the lands or waters. On private lands or waters these costs may be borne by the state, or the landowner upon mutual agreement with the state.\n[Repealed by amendment, 2007 c 115 s 1]\n(a) All unidentified human remains or burials found outside of recorded cemeteries or unplatted graves or burials found within recorded cemeteries and in contexts which indicate antiquity greater than 50 years shall be treated with the utmost respect for all human dignity and dealt with according to the provisions of this section.\n(b) If such burials are not American Indian or their ethnic identity cannot be ascertained, as determined by the state archaeologist, they shall be dealt with in accordance with provisions established by the state archaeologist and other appropriate authority.\n(c) If such burials are American Indian, as determined by the state archaeologist and Indian Affairs Council, efforts shall be made to follow procedures as defined in United States Code, title 25, section 3001 et seq., and its implementing regulations, Code of Federal Regulations, title 43, part 10, within reservation boundaries. For burials outside of reservation boundaries, the procedures defined in United States Code, title 25, section 3001 et seq., and its implementing regulations, Code of Federal Regulations, title 43, part 10, are at the discretion of the Indian Affairs Council.\nApplication by a landowner for permission to develop or disturb nonburial areas within assessed or recorded burial grounds shall be made to:\n(1) the state archaeologist and other appropriate authority in the case of non-American Indian burials; and\n(2) the Indian Affairs Council and other appropriate authority in the case of American Indian burials.\n(b) Landowners with assessed or suspected human burial grounds on their property are obligated to inform prospective buyers of the burial ground.\nNo non-American Indian burial ground may be relocated without the consent of the appropriate authority. No American Indian burial ground may be relocated unless the request to relocate is approved by the Indian Affairs Council. When a burial ground is located on public lands or waters, any burial relocations must be duly licensed under section 138.36 and the cost of removal is the responsibility of and shall be paid by the state or political subdivision controlling the lands or waters. If burial grounds are assessed on private lands, efforts may be made by the state to purchase and protect them instead of removing them to another location.\n(a) The state archaeologist and the Indian Affairs Council shall enter into a memorandum of understanding to coordinate their responsibilities under this section.\n(b) The Department of Natural Resources, the Department of Transportation, and all other state agencies and local governmental units whose activities may be affected, shall cooperate with the state archaeologist and the Indian Affairs Council to carry out the provisions of this section.\nWhen human burials are known or suspected to exist, on public lands or waters, the state or political subdivision controlling the lands or waters or, in the case of private lands, the landowner or developer, shall submit construction and development plans to the state archaeologist for review before plans are finalized and prior to any disturbance within the burial area. If the known or suspected burials are thought to be American Indian, plans shall also be submitted to the Indian Affairs Council. The state archaeologist and the Indian Affairs Council shall review the plans within 45 days of receipt and make recommendations for the preservation in place or removal of the human burials or remains, which may be endangered by construction or development activities.\nBurial sites data under the authority of the Office of the State Archaeologist or Indian Affairs Council are security information for purposes of section 13.37. Persons who gain access to this data are subject to liability under section 13.08 and the penalty established by section 13.09 if they improperly use or further disseminate the data. Use of this information must be approved by the appropriate authority.\nThe state archaeologist or designee may enter on property for the purpose of assessing burial sites. The Indian Affairs Council or a designated representative of the Indian Affairs Council may enter on property for the purpose of assessing or identifying American Indian cemeteries. Only after obtaining permission from the property owner or lessee, descendants of persons buried in burial grounds covered by this section may enter the burial grounds for the purpose of conducting religious or commemorative ceremonies. This right of entry must not unreasonably burden property owners or unnecessarily restrict their use of the property.\nAs used in this section, the following terms have the meanings given.\n(a) \"Abandoned cemetery\" means a cemetery where the cemetery association has disbanded or the cemetery is neglected and contains marked graves older than 50 years.\n(b) \"Appropriate authority\" means:\n(1) the trustees when the trustees have been legally defined to administer burial grounds;\n(2) the Indian Affairs Council in the case of American Indian burial grounds lacking trustees;\n(3) the county board in the case of abandoned cemeteries under section 306.243; and\n(4) the state archaeologist in the case of non-American Indian burial grounds lacking trustees or not officially defined as abandoned.\n(c) \"Artifacts\" means natural or artificial articles, objects, implements, or other items of archaeological interest.\n(d) \"Assess\" means to establish the presence of or high potential of human burials or human skeletal remains being located in a discrete area and attempt to determine the ethnic, cultural, or religious affiliation of individuals interred.\n(e) \"Burial\" means the organic remnants of the human body that were intentionally interred as part of a mortuary process.\n(f) \"Burial ground\" means a discrete location that is known to contain or has high potential to contain human remains based on physical evidence, historical records, or reliable informant accounts.\n(g) \"Cemetery\" means a discrete location that is known to contain or intended to be used for the interment of human remains.\n(h) \"Disturb\" means any activity that harms the physical integrity or setting of a human burial or human burial ground.\n(i) \"Grave goods\" means objects or artifacts directly associated with human burials or human burial grounds that were placed as part of a mortuary ritual at the time of interment.\n(j) \"Human remains\" means the body of a deceased person in whole or in part, regardless of the state of decomposition, not including isolated teeth.\n(k) \"Identification\" means to analyze organic materials to attempt to determine if they represent human remains and to attempt to establish the ethnic, cultural, or religious affiliations of such remains.\n(l) \"Marked\" means a burial that has a recognizable tombstone or obvious grave marker in place or a legible sign identifying an area as a burial ground or cemetery.\n(m) \"Qualified physical anthropologist\" means a specialist in identifying human remains who holds an advanced degree in anthropology or a closely related field.\n(n) \"Qualified professional archaeologist\" means an archaeologist who meets the United States Secretary of the Interior's professional qualification standards in Code of Federal Regulations, title 36, part 61, appendix A, or subsequent revisions.\n(o) \"Recorded cemetery\" means a cemetery that has a surveyed plat filed in a county recorder's office.\n(p) \"State\" or \"the state\" means the state of Minnesota or an agency or official of the state acting in an official capacity.\n(q) \"Trustees\" means the recognized representatives of the original incorporators, board of directors, or cemetery association.\n(r) \"Person\" means a natural person or a business and includes both if the natural person is engaged in a business.\n(s) \"Business\" means a contractor, subcontractor, supplier, consultant, or provider of technical, administrative, or physical services organized as a sole proprietorship, partnership, association, corporation, or other entity formed for the purpose of doing business for profit.",
	"repealed": false
}