{
	"id": "317A.431",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.431",
	"title": "317A.431 ANNUAL MEETINGS OF MEMBERS WITH VOTING RIGHTS.",
	"text": "Unless the articles or bylaws provide otherwise, a corporation with members with voting rights shall hold at least an annual meeting of members with voting rights.\nIf an annual meeting of members with voting rights has not been held during the preceding 15 months, at least 50 members with voting rights or ten percent of the members with voting rights, whichever is less, may demand an annual meeting of members by written notice of demand given to the president or the treasurer of the corporation. Within 30 days after receipt of the demand, the board shall cause a meeting of members to be called and held at the expense of the corporation on notice no later than 90 days after receipt of the demand. If the board fails to cause a meeting to be called and held as required by this subdivision, the members with voting rights making the demand may call the meeting at the expense of the corporation by giving notice as required by section 317A.435.\nAn annual meeting of members must be held at the time and place stated in or fixed in accordance with the articles or bylaws. If a place is not stated or if a demand for a meeting is made under subdivision 2, the meeting must be held in the county where the corporation's registered office is located. To the extent authorized in articles or bylaws, the board of directors may determine that an annual meeting of the members shall be held solely by means of remote communication in accordance with section 317A.450, subdivision 2.\nAt an annual meeting of members:\n(1) there must be an election of successors for directors elected by members and whose terms have expired or whose terms expire at an annual meeting;\n(2) there must be a report on the activities and financial condition of the corporation; and\n(3) the members shall consider and act upon other matters as may be raised consistent with the notice of meeting requirements.\nThe failure to hold a meeting in accordance with a corporation's articles or bylaws does not affect the validity of a corporate action.",
	"repealed": false
}