{
	"id": "299F.77",
	"url": "https://www.revisor.mn.gov/statutes/cite/299F.77",
	"title": "299F.77 ISSUANCE TO CERTAIN PERSONS PROHIBITED.",
	"text": "The following persons shall not be entitled to receive an explosives license or permit:\n(1) a person under the age of 18 years;\n(2) a person who has been convicted in this state or elsewhere of a crime of violence, as defined in section 299F.72, subdivision 1b, unless ten years have elapsed since the person's civil rights have been restored or the sentence has expired, whichever occurs first, and during that time the person has not been convicted of any other crime of violence. For purposes of this section, crime of violence includes crimes in other states or jurisdictions that would have been crimes of violence if they had been committed in this state;\n(3) a person who is or has ever been confined or committed in Minnesota or elsewhere as a person who is mentally ill, developmentally disabled, or mentally ill and dangerous to the public, as defined in section 253B.02, to a treatment facility, unless the person possesses a certificate of a medical doctor or psychiatrist licensed in Minnesota, or other satisfactory proof, that the person is no longer suffering from this disability;\n(4) a person who has been convicted in Minnesota or elsewhere for the unlawful use, possession, or sale of a controlled substance other than conviction for possession of a small amount of marijuana, as defined in section 152.01, subdivision 16, or who is or has ever been hospitalized or committed for treatment for the habitual use of a controlled substance or marijuana, as defined in sections 152.01 and 152.02, unless the person possesses a certificate of a medical doctor or psychiatrist licensed in Minnesota, or other satisfactory proof, that the person has not abused a controlled substance or marijuana during the previous two years; and\n(5) a person who has been confined or committed to a treatment facility in Minnesota or elsewhere as chemically dependent, as defined in section 253B.02, unless the person has completed treatment.\n(a) For licenses issued by the commissioner under section 299F.73, the applicant for licensure must provide the commissioner with all of the information required by Code of Federal Regulations, title 28, section 25.7. The commissioner shall forward the information to the superintendent of the Bureau of Criminal Apprehension so that criminal records, histories, and warrant information on the applicant can be retrieved from the Minnesota Crime Information System and the National Instant Criminal Background Check System, as well as the civil commitment records maintained by the Department of Human Services. The results must be returned to the commissioner to determine if the individual applicant is qualified to receive a license.\n(b) For permits issued by a county sheriff or chief of police under section 299F.75, the applicant for a permit must provide the county sheriff or chief of police with all of the information required by Code of Federal Regulations, title 28, section 25.7. The county sheriff or chief of police must check, by means of electronic data transfer, criminal records, histories, and warrant information on each applicant through the Minnesota Crime Information System and the National Instant Criminal Background Check System, as well as the civil commitment records maintained by the Department of Human Services. The county sheriff or chief of police shall use the results of the query to determine if the individual applicant is qualified to receive a permit.",
	"repealed": false
}