{
	"id": "634.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/634.15",
	"title": "634.15 ADMISSION INTO EVIDENCE OF CERTAIN CERTIFICATES OF ANALYSIS AND BLOOD SAMPLE REPORTS.",
	"text": "(a) In any hearing or trial of a criminal offense or petty misdemeanor or proceeding pursuant to section 169A.53, subdivision 3, or 171.177, the following documents shall be admissible in evidence:\n(1) a report of the facts and results of any laboratory analysis or examination if it is prepared and attested by the person performing the laboratory analysis or examination in any laboratory operated by the Bureau of Criminal Apprehension or authorized by the bureau to conduct an analysis or examination, or in any laboratory of the Federal Bureau of Investigation, the federal Postal Inspection Service, the federal Bureau of Alcohol, Tobacco, Firearms and Explosives, or the federal Drug Enforcement Administration;\n(2) a report of a blood sample withdrawn under the implied consent law under sections 169A.50 to 169A.53 or section 171.177 if:\n(i) the report was prepared by the person who administered the test;\n(ii) the person who withdrew the blood sample was competent to administer the test under section 169A.51, subdivision 7; and\n(iii) the report was prepared consistent with any applicable rules promulgated by the commissioner of public safety; and\n(3) a verified chain of custody of a specimen while under the control of a laboratory described in clause (1).\n(b) A report described in paragraph (a), clause (1), purported to be signed by the person performing the analysis or examination in a laboratory named in that clause, or a blood sample report described in paragraph (a), clause (2), purported to be signed by the person who withdrew the blood sample shall be admissible as evidence without proof of the seal, signature or official character of the person whose name is signed to it. The signature in paragraph (a), clause (1) or (2), can be written or in electronic format.\n(c) At least 20 days before trial, the prosecutor shall submit to the accused person or the accused person's attorney notice of the contents of a report described in paragraph (a) and of the requirements of subdivision 2.\n(a) Except in civil proceedings, including proceedings under section 169A.53, an accused person or the accused person's attorney may request, by notifying the prosecuting attorney at least ten days before the trial, that the following persons testify in person at the trial on behalf of the state:\n(1) a person who performed the laboratory analysis or examination for the report described in subdivision 1, paragraph (a), clause (1); or\n(2) a person who prepared the blood sample report described in subdivision 1, paragraph (a), clause (2).\nIf a petitioner in a proceeding under section 169A.53 subpoenas a person described in clause (1) or (2), to testify at the proceeding, the petitioner is not required to pay the person witness fees under section 357.22 in excess of $100.\n(b) If the accused person or the accused person's attorney does not comply with the ten-day requirement described in paragraph (a), the prosecutor is not required to produce the person who performed the analysis or examination or prepared the report. In this case, the accused person's right to confront that witness is waived and the report shall be admitted into evidence.",
	"repealed": false
}