{
	"id": "219.445",
	"url": "https://www.revisor.mn.gov/statutes/cite/219.445",
	"title": "219.445 SOUTHERN RAIL CORRIDOR IMPROVEMENT PLAN.",
	"text": "The commissioner of transportation shall develop a corridor improvement plan for grade crossings intersecting or crossing the railway right-of-way in the railway corridor that runs east to west across southern Minnesota within all of the counties of Winona, Olmsted, Dodge, Steele, Waseca, Blue Earth, Brown, Redwood, Lyon, and Lincoln.\n(a) The corridor improvement plan must include crossing-by-crossing assessments based on ten-year and 20-year projections of train and vehicle volumes that will identify minimum improvements necessary at crossings with moderate levels of exposure, consistent with rules adopted by the commissioner. The plan must include identification of all crossings that are candidates for grade separations where levels of exposure exceed 300,000, or crossings that meet the criteria identified in the rules adopted by the commissioner. For purposes of this section, \"levels of exposure\" means average daily vehicle traffic multiplied by the number of trains per day at a crossing.\n(b) In cities where the department has identified multiple grade separation candidates, the plan must include a strategy that identifies the appropriate mix of safety improvements at all crossings in the city and that considers optimal locations for grade separations, crossing consolidations, and other grade crossing safety improvements and traffic routing options.\n(c) The department shall consider crossings that are candidates for closure, consistent with rules adopted by the commissioner governing the vacating of a grade crossing.\n(d) When community plans have been developed by the affected railroad company and local governing bodies, the department shall review the community plans for compliance with the department's minimum criteria for necessary crossing improvements at all public crossings as identified in the commissioner's rules. The agreed-to community plans take precedence over the elements of the corridor improvement plan.\n(a) The commissioner shall provide an opportunity for an affected railroad company or local governing body to participate in developing the corridor improvement plan. The commissioner shall allow an affected local governing body the opportunity to review the corridor improvement plan before executing an agreement for grade crossing improvements in the corridor improvement plan between the department and the railroad company and before forwarding the plan to the federal Surface Transportation Board (STB).\n(b) Paragraph (a) does not preclude the department from providing comments or information related to the railway corridor improvement project to the STB or any other governing body related to construction activities or environmental impact statement preparation.\n(a) The final plan must be submitted to any affected area transportation partnership, local unit of government, and railroad company within the corridor area in order to provide future grade crossing safety improvement planning guidance.\n(b) Unless otherwise specifically agreed to as part of the plan, the development of a corridor improvement plan does not bind the state or any local government unit to a specific implementation timetable or to funding the cost of proposed recommended safety upgrades.",
	"repealed": false
}