{
	"id": "13.3805#stat.13.3805.1",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.3805#stat.13.3805.1",
	"title": "13.3805 PUBLIC HEALTH DATA.",
	"text": "(a) Definitions. As used in this subdivision:\n(1) \"Commissioner\" means the commissioner of health.\n(2) \"Health data\" are data on individuals created, collected, received, or maintained by the Department of Health, political subdivisions, or statewide systems relating to the identification, description, prevention, and control of disease or as part of an epidemiologic investigation the commissioner designates as necessary to analyze, describe, or protect the public health.\n(b) Data on individuals. (1) Health data are private data on individuals. Notwithstanding section 13.05, subdivision 9, health data may not be disclosed except as provided in this subdivision and section 13.04.\n(2) The commissioner or a community health board as defined in section 145A.02, subdivision 5, may disclose health data to the data subject's physician as necessary to locate or identify a case, carrier, or suspect case, to establish a diagnosis, to provide treatment, to identify persons at risk of illness, or to conduct an epidemiologic investigation.\n(3) With the approval of the commissioner, health data may be disclosed to the extent necessary to assist the commissioner to locate or identify a case, carrier, or suspect case, to alert persons who may be threatened by illness as evidenced by epidemiologic data, to control or prevent the spread of serious disease, or to diminish an imminent threat to the public health.\nAll data created, collected, received, or maintained by the commissioner of health on individuals relating to genetic counseling services for Huntington's disease provided by the Department of Health are private data on individuals. The data may be permanently transferred from the department to the Hennepin County Medical Center, and once transferred, shall continue to be classified as private data on individuals.\nExcept for investigative data under chapter 260E, all investigative data maintained by the Department of Health's Office of Health Facility Complaints are subject to provisions of and classified pursuant to section 626.557, subdivision 12b, paragraphs (b) to (d). Notwithstanding sections 260E.21, subdivision 1; 260E.35; and 626.557, subdivision 12b, paragraph (b), data identifying an individual substantiated as the perpetrator are public data. For purposes of this subdivision, an individual is substantiated as the perpetrator if the commissioner of health determines that the individual is the perpetrator and the determination of the commissioner is upheld after the individual either exercises applicable administrative appeal rights or fails to exercise these rights within the time allowed by law.\nData maintained by the Department of Health or community public water systems that identify the address of the testing site and the name, address, and telephone number of residential homeowners of each specific site that is tested for lead and copper as required by the federal Safe Drinking Water Act, the United States Environmental Protection Agency's lead and copper rule, and the department's drinking water protection program are private data on individuals or nonpublic data.\nData maintained by the Department of Health that identify the address of a radon testing or mitigation site, and the name, address, email address, and telephone number of residents and residential property owners of a radon testing or mitigation site, are private data on individuals or nonpublic data.",
	"repealed": false
}