{
	"id": "383A.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.39",
	"title": "383A.39 COURTHOUSE AND CITY HALL.",
	"text": "(1) The Saint Paul City Hall and Ramsey County Court House building is in charge of a joint committee of seven members appointed as follows:\n(a) the mayor of the city of Saint Paul is ex officio a member of and the chair of the committee;\n(b) three members of the committee are appointed annually by the president of the Saint Paul City Council from the members of the council, and three members are appointed annually by the chair of the board of county commissioners from the members of the board.\n(2) The committee has entire charge of the building and may appoint the janitor, custodian and other employees that it considers necessary for the proper care and management of the building and at the compensation that the committee determines.\n(3) The expense of keeping the building in repair and the necessary expense of heating and maintaining it shall be paid equally by the city and county; one-half thereof out of the treasury of the city, and one-half out of the treasury of the county.\n(1) Authority. Ramsey County and the city of Saint Paul may jointly, by resolution adopted by both the board of commissioners and the city council, close the building containing the principal offices of the city and the county, known as the city hall and court house, on Saturday.\n(2) Effect of closing. An act authorized, required or permitted by law or contract to be performed at or in the city hall and court house on Saturday may be performed on the next succeeding regular business day and no liability or loss of rights on the part of any person shall result from the closing.\n(3) Open, additional hours. The city hall and court house may be kept open for the transaction of business on the next business day following each Saturday until 9:00 p.m.\nIn Ramsey County, the court house and city hall committee may provide rooms in the court house and city hall for the use of a law library and the committee may install its library therein by purchase, leasing or securing it from an individual or association upon the terms and conditions that to it is for the interest of the people.",
	"repealed": false
}