{
	"id": "116P.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/116P.05",
	"title": "116P.05 LEGISLATIVE-CITIZEN COMMISSION ON MINNESOTA RESOURCES.",
	"text": "(a) A Legislative-Citizen Commission on Minnesota Resources of 17 members is created in the legislative branch, consisting of the chairs of the house of representatives and senate committees on environment and natural resources finance or designees appointed for the terms of the chairs, four members of the senate appointed by the Subcommittee on Committees of the Committee on Rules and Administration, and four members of the house of representatives appointed by the speaker.\n(b) At least two members from the senate and two members from the house of representatives must be from the minority caucus.\n(c) Seven citizens are members of the commission, five appointed by the governor, one appointed by the Senate Subcommittee on Committees of the Committee on Rules and Administration, and one appointed by the speaker of the house. The citizen members are selected and recommended to the appointing authorities according to subdivision 1a and must:\n(1) have experience or expertise in the science, policy, or practice of the protection, conservation, preservation, and enhancement of the state's air, water, land, fish, wildlife, and other natural resources;\n(2) have strong knowledge in the state's environment and natural resource issues around the state;\n(3) have demonstrated ability to work in a collaborative environment; and\n(4) not be a registered lobbyist.\n(d) Members shall develop procedures to elect a chair that rotates between legislative and citizen members each meeting. A citizen member, a senate member, and a house of representatives member shall serve as chairs. The citizen members, senate members, and house of representatives members must select their respective chairs. The chair shall preside and convene meetings as often as necessary to conduct duties prescribed by this chapter.\n(e) Appointed legislative members shall serve on the commission for two-year terms, beginning in January of each odd-numbered year and continuing through the end of December of the next even-numbered year. Appointed citizen members shall serve four-year terms, beginning in January of the first year and continuing through the end of December of the final year. Citizen and legislative members continue to serve until their successors are appointed.\n(f) A citizen member may be removed by an appointing authority for cause. Vacancies occurring on the commission shall not affect the authority of the remaining members of the commission to carry out their duties, and vacancies shall be filled for the remainder of the term in the same manner under paragraphs (a) to (c).\n(g) Legislative members are entitled to reimbursement for per diem expenses plus travel expenses incurred in the services of the commission. Citizen members are entitled to per diem and reimbursement for expenses incurred in the services of the commission, as provided in section 15.059, subdivision 3, except that a citizen member may be compensated at the rate of up to $125 a day.\n(h) The governor's appointments are subject to the advice and consent of the senate. One of the governor's appointments must be a member recommended by the Tribal government representatives of the Indian Affairs Council.\n(i) A citizen member may serve no more than eight years, except as necessary to fill a vacancy. A citizen member may not serve more than ten years if serving additional time to fill a vacancy.\n(a) The governor must appoint a Trust Fund Citizen Selection Committee of five members who come from different regions of the state and who have knowledge and experience of state environment and natural resource issues to provide recommendations for appointments under subdivision 1, paragraph (c).\n(b) The duties of the Trust Fund Citizen Selection Committee are to:\n(1) identify citizen candidates to be members of the commission as part of the open appointments process under section 15.0597;\n(2) request and review citizen candidate applications to be members of the commission; and\n(3) interview the citizen candidates and recommend an adequate pool of candidates to be selected for commission membership by the governor.\n(c) Members serve three-year terms and are entitled to per diem and reimbursement for expenses incurred in the services of the committee, as provided in section 15.059, subdivision 3, except that a citizen selection committee member may be compensated at the rate of up to $125 a day.\n(d) A member appointed under this subdivision may not be a registered lobbyist.\n(a) The commission must recommend an annual or biennial legislative bill for appropriations from the environment and natural resources trust fund and must adopt a strategic plan as provided in section 116P.08. Except as provided under section 116P.09, subdivision 6, paragraph (b), approval of the recommended legislative bill requires an affirmative vote of at least 11 members of the commission.\n(b) It is a condition of acceptance of the appropriations made from the Minnesota environment and natural resources trust fund, and oil overcharge money under section 4.071, subdivision 2, that the agency or entity receiving the appropriation must submit a work plan and annual or semiannual progress reports in the form determined by the Legislative-Citizen Commission on Minnesota Resources, and comply with applicable reporting requirements under section 116P.16. None of the money provided may be spent unless the commission has approved the pertinent work plan. Modifications to the approved work plan and budget expenditures must be made through the amendment process established by the commission. The commission must ensure that the expenditures and outcomes described in the work plan for appropriations funded by the environment and natural resources trust fund are met.\n(c) The peer review procedures created under section 116P.08 must also be used to review, comment, and report to the commission on research proposals applying for an appropriation from the oil overcharge money under section 4.071, subdivision 2.\n(d) The commission may adopt operating procedures to fulfill its duties under this chapter.\n(e) As part of the operating procedures, the commission must:\n(1) ensure that members' expectations are to participate in all meetings related to funding decision recommendations;\n(2) recommend adequate funding for increased citizen outreach and communications for trust fund expenditure planning;\n(3) allow administrative expenses as part of individual project expenditures based on need;\n(4) provide for project outcome evaluation;\n(5) keep the grant application, administration, and review process as simple as possible; and\n(6) define and emphasize the leveraging of additional sources of money that project proposers should consider when making trust fund proposals.\n[Repealed, 2014 c 226 s 4]",
	"repealed": false
}