{
	"id": "136A.1275",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1275",
	"title": "136A.1275 STUDENT TEACHER GRANTS IN SHORTAGE AREAS.",
	"text": "(a) The commissioner of the Office of Higher Education must establish a grant program for student teaching stipends for low-income students who intend to teach in a license shortage area or rural school district after graduating and receiving their teaching license.\n(b) \"License shortage area\" means a licensure area that is identified as a shortage area by the Professional Educator Licensing and Standards Board in coordination with the commissioner using data collected for the teacher supply and demand report under section 122A.091, subdivision 5, provided that only licensure areas within the following fields may be identified as a license shortage area for purposes of this section:\n(1) English as a second language;\n(2) early childhood;\n(3) special education;\n(4) career and technical education;\n(5) science, technology, engineering, arts, and math; and\n(6) world languages.\n(c) \"Rural school district\" means a school district with fewer than 30 resident pupil units under section 126C.05, subdivision 6, per square mile.\nTo be eligible for a grant under this section, a student teacher must:\n(1) be enrolled in a Professional Educator Licensing and Standards Board-approved teacher preparation program that requires at least 12 weeks of student teaching;\n(2) demonstrate financial need based on criteria established by the commissioner under subdivision 3;\n(3) be meeting satisfactory academic progress as defined under section 136A.101, subdivision 10; and\n(4) intend to teach in a rural school district or intend to teach in a license shortage area. Intent to teach in a license shortage area must be verified based on the teacher license field the student is pursuing. To verify intent to teach in a rural school district, the student must submit to the commissioner a completed affidavit, prescribed by the commissioner, affirming the student's intent to teach in a rural district following graduation. Upon obtaining employment after graduating, the teacher shall report to the office the name of the school district in which the teacher is teaching.\n(a) The commissioner must establish an application process and other guidelines for implementing this program. The commissioner must notify grant recipients of their award amounts by the following dates:\n(1) for fall student teaching placements, recipients must be notified by August 15;\n(2) for spring student teaching placements, recipients must be notified by December 1; and\n(3) for summer student teaching placements, recipients must be notified by May 1.\nThese notification deadlines do not apply in cases where grants are awarded to student teachers who applied after application deadlines and funds remained after the initial round of grants were awarded.\n(b) The commissioner must determine each academic year the stipend amount up to $7,500 based on the amount of available funding, the number of eligible applicants, and the financial need of the applicants.\n(c) The commissioner must give equal consideration to all eligible applicants regardless of the order the application was received before the application deadline.\n(d) If there are insufficient funds to provide an award to all eligible applicants, the commissioner shall prioritize the awards to eligible participants based on:\n(1) the financial need of an applicant; and\n(2) whether the applicant intends to teach in both a rural school district and a license shortage area.\n(a) By February 1 of each year, the commissioner must submit a report to the chairs and ranking minority members of the legislative committees with jurisdiction over E-12 and higher education finance and policy. The report must include the following information:\n(1) the total number of awards, the total dollar amount of all awards, and the average award amount;\n(2) the number of eligible applicants and the number of student teachers receiving an award, each broken down by postsecondary institution;\n(3) the licensure areas and school districts in which the student teachers taught; and\n(4) other summary data identified by the commissioner as outcome indicators, including how many student teachers awarded a rural teacher grant were employed in a rural school district after graduation.\n(b) By July 1 of each odd numbered year, the commissioner must update and post on the office's website a list of licensure shortage areas eligible for a grant under this section.",
	"repealed": false
}