{
	"id": "60A.9583",
	"url": "https://www.revisor.mn.gov/statutes/cite/60A.9583",
	"title": "60A.9583 FRAUD PREVENTION AND CONTROL.",
	"text": "(a) A person who commits a fraudulent viatical settlement act commits insurance fraud and may be sentenced under section 609.611, subdivision 3.\n(b) A person shall not knowingly or intentionally interfere with the enforcement of the provisions of sections 60A.957 to 60A.9585 or investigations of suspected or actual violations of sections 60A.957 to 60A.9585.\n(c) A person in the business of viatical settlements shall not knowingly or intentionally permit any person convicted of a felony involving dishonesty or breach of trust to participate in the business of viatical settlements.\n(a) Viatical settlements contracts and purchase agreement forms and applications for viatical settlements, regardless of the form of transmission, shall contain the following statement or a substantially similar statement: \"Any person who knowingly presents false information in an application for insurance or viatical settlement contract or a viatical settlement purchase agreement is guilty of a crime and may be subject to fines and confinement in prison.\"\n(b) The lack of a statement as required in paragraph (a) does not constitute a defense in any prosecution for a fraudulent viatical settlement act.\nAny person engaged in the business of viatical settlements having knowledge or a reasonable suspicion that a fraudulent viatical settlement act is being, will be, or has been committed shall provide to the commissioner such information as required by, and in a manner prescribed by, the commissioner.\n(a) Viatical settlement providers and viatical settlement brokers shall have in place antifraud initiatives reasonably calculated to detect, prosecute, and prevent fraudulent viatical settlement acts. At the discretion of the commissioner, the commissioner may order, or a licensee may request and the commissioner may grant, such modifications of the following required initiatives as necessary to ensure an effective antifraud program. The modifications may be more or less restrictive than the required initiatives so long as the modifications may reasonably be expected to accomplish the purpose of this section.\n(b) Antifraud initiatives shall include:\n(1) fraud investigators, who may be viatical settlement provider or viatical settlement broker employees or independent contractors; and\n(2) an antifraud plan, which shall be submitted to the commissioner. The antifraud plan shall include, but not be limited to:\n(i) a description of the procedures for detecting and investigating possible fraudulent viatical settlement acts and procedures for resolving material inconsistencies between medical records and insurance applications;\n(ii) a description of the procedures for reporting possible fraudulent viatical settlement acts to the commissioner;\n(iii) a description of the plan for antifraud education and training of underwriters and other personnel; and\n(iv) a description or chart outlining the organizational arrangement of the antifraud personnel who are responsible for the investigation and reporting of possible fraudulent viatical settlement acts and investigating unresolved material inconsistencies between medical records and insurance applications.\n(c) Antifraud plans submitted to the commissioner shall be privileged and confidential and shall not be a public record and shall not be subject to discovery or subpoena in a civil or criminal action.",
	"repealed": false
}