{
	"id": "51A.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.23",
	"title": "51A.23 SAVINGS ACCOUNT.",
	"text": "Trust funds received by a real estate broker or the broker's salespersons in trust may be deposited in a savings association. Deposit accounts shall be represented only by the account of each deposit account holder on the books of the association, and the accounts or any interest therein shall be transferable only on the books of the association and upon proper written application by the transferee. The association may treat the holder of record of a savings account as the owner of it for all purposes without being affected by any notice to the contrary unless the association has acknowledged in writing notice of a pledge of the deposit account. Notwithstanding the foregoing, an association or federal association may offer negotiable time deposits.\nAn association may issue deposit accounts to or in the name of a minor, which shall be held for the exclusive right and benefit of the minor, free from the control or lien of all other persons, except creditors, and, together with dividends thereon, shall be paid to the minor, and receipt or acquittance in any form, shall be sufficient release and discharge of the association for withdrawal, until a guardian appointed in this state for the minor shall have delivered a certificate of appointment.\n[Repealed, 1988 c 666 s 75]\n[Repealed, 1988 c 666 s 75]\n[Repealed, 1988 c 666 s 75]\n[Repealed, 1988 c 666 s 75]\nEvery association incorporated pursuant to or operating under the provisions of sections 51A.01 to 51A.57 shall at all times maintain in effect insurance of its savings accounts by the Federal Savings and Loan Insurance Corporation, an agency of this state or other federal agency established for the purpose of insuring savings accounts in associations. An association which fails to meet this requirement for insurance of its savings accounts shall either dissolve, merge or consolidate with another association which is insured by the Federal Savings and Loan Insurance Corporation, an agency of this state or a federal agency established for the purpose of insuring savings accounts in associations.\nNo association shall be issued a certificate of approval by the commissioner of commerce after April 10, 1976, unless such association has obtained a commitment for insurance of its deposits by the Federal Savings and Loan Insurance Corporation or any agency of this state or any federal agency established for the purpose of insuring savings accounts in associations.",
	"repealed": false
}