{
	"id": "383A.294",
	"url": "https://www.revisor.mn.gov/statutes/cite/383A.294",
	"title": "383A.294 GRIEVANCES.",
	"text": "No permanent employee in the classified service shall be discharged, suspended without pay, or reduced in pay or position, except for just cause.\nFor purposes of this section, just cause includes, but is not limited to, failure to perform assigned duties, substandard performance, misconduct, insubordination, and violation of written policies and procedures.\nThe appointing authority shall give a permanent classified employee written notice of the discharge, suspension without pay, or reduction in pay or position. The written notice shall include a statement of the nature of the disciplinary action, the specific reasons for the action, the effective date of the action, and a statement informing the employee of the employee's right to reply within ten working days of receipt of the notice in writing or, upon request, in person, to the appointing authority or the authority's designee. The notice shall also include a statement of the employee's right to appeal to the Personnel Review Board within 30 days of the effective date of the disciplinary action, but an employee who elects to reply to the appointing authority may appeal within ten working days of the receipt of the authority's response to the reply. If the appointing authority has not responded within 30 days of receipt of the employee's reply, the appointing authority shall be deemed to have replied unfavorably to the employee. A copy of the disciplinary action notice and the employee's reply shall be filed with the Human Resources Department.\n(a) Hearing. Within ten days of receipt of the employee's written notice of appeal, the Personnel Review Board shall request the chief administrative law judge to assign an administrative law judge to hear the appeal. The hearing shall be conducted as a contested case and both the employee and appointing authority shall be entitled to present facts at the hearing. The burden of proof shall be on the appointing authority to establish the basis for its disciplinary action by a preponderance of the evidence. A record shall be kept of the hearing at the expense of the Personnel Review Board. The administrative law judge may subpoena and require the attendance of witnesses and the production of any relevant documents and may administer oaths to witnesses.\n(b) Hearing report. Within 30 days after the close of the hearing record, the administrative law judge shall recommend to the Personnel Review Board an appropriate disposition of the grievance which shall be in writing and contain findings of fact and conclusions.\n(c) Decisions of Personnel Review Board. Within 30 days of receipt of the administrative law judge's recommendation, the Personnel Review Board shall act to modify, reject, or accept the recommendation. If the Personnel Review Board fails to act within 30 days after receipt of the recommendation, it shall be deemed to have accepted the recommendation of the administrative law judge recommending final disposition of the grievance. The Personnel Review Board shall not conduct a hearing prior to modifying, accepting, or rejecting the recommendation of the administrative law judge but shall confine its review to the record established before the administrative law judge and no party to the appeal shall have a right to a hearing de novo before the Personnel Review Board.\n(d) Appeal of Personnel Review Board decision. The decision of the Personnel Review Board shall be the final decision regarding the employee's grievance appeal. The decision may be appealed to district court within 30 calendar days after its receipt, by the appointing authority or by the employee. The appeal shall be decided by the court upon the board's record. The decision of the board may be reversed if the hearing record contains no evidence upon which the Personnel Review Board could have reached its decision or if the Personnel Review Board abused its discretion.\n(e) Effect of Personnel Review Board decision. The Personnel Review Board decision shall be binding on both the employee and the appointing authority unless on appeal the decision is stayed, modified, or reversed by the district court.\n(f) Proper party to litigation. Ramsey County and not the Personnel Review Board, shall be a proper party to an appeal or any litigation arising out of sections 383A.281 to 383A.301.\nThe Personnel Review Board shall have no right to sue or be sued under sections 383A.281 to 383A.301. The county attorney shall represent the county in any litigation arising out of sections 383A.281 to 383A.301.\nAn employee may not use both the procedure provided by this section and the grievance procedure provided by chapter 179A.\nProcedures for discipline and discharge of employees covered by collective bargaining agreements shall be governed by the agreements, to the extent that the agreements are inconsistent with sections 383A.281 to 383A.301.\nThe human resources director may make a written request to an employee to produce relevant documents or to a person to appear for the purpose of giving relevant oral statements or testimony relating to a disciplinary action of an employee. An employee who is the subject of a disciplinary action may make a written request to the human resources director for the production of relevant documents or for the appearance of a person to give relevant oral statements or testimony relating to the disciplinary action. The request for the appearance of a person may be to appear and testify at a hearing of the Personnel Review Board or to appear at a specified place to give an oral statement prior to a hearing of the Personnel Review Board. The human resources director, or the employee upon receipt of a request for production of relevant documents, shall furnish the requesting party the documents within ten days of receipt of the written request. A person to whom a request for an appearance has been made shall appear at the time and place designated in the request. If a party to whom a request for relevant documents has been made fails to furnish the documents to the requesting party within ten days of receipt of the request, the requesting party may make an application to the district court for a determination that the refusal to produce the documents was unreasonable. If a person to whom a request for appearance has been made fails to appear at the time and place designated in the request, the party making the request for appearance may make an application to the district court for a determination that the failure to appear was unreasonable. If the district court determines that a failure to produce requested documents or to appear was unreasonable, it may assess costs not exceeding $100 to the requesting party against the refusing party or person.",
	"repealed": false
}