{
	"id": "331A.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/331A.01",
	"title": "331A.01 DEFINITIONS.",
	"text": "As used in sections 331A.01 to 331A.11, the terms defined have the meanings given them except as otherwise expressly provided or indicated by the context.\n\"Known office of issue\" means the newspaper's principal office devoted primarily to business related to the newspaper, whether or not printing or any other operations of the newspaper are conducted at or from the office. A newspaper may have only one known office of issue.\n\"Political subdivision\" means a county, school district, home rule charter and statutory city or town, or any other local political subdivision or local or area district, commission, board, or authority.\nMS 2020 [Repealed, 2022 c 61 s 11]\nMS 2002 [Repealed, 2004 c 182 s 33]\n\"Proceedings\" means the substance of all official actions taken by the governing body of a political subdivision at any regular or special meeting, and at minimum includes the subject matter of a motion, the persons making and seconding a motion, the roll call vote on a motion, the character of resolutions or ordinances offered, including a brief description of their subject matter, and whether defeated or adopted.\n\"Public notice\" means every notice required or authorized by law or by order of a court to be published by a qualified newspaper, and includes:\n(1) every publication of laws, ordinances, resolutions, financial information, and proceedings intended to give notice in a particular area;\n(2) every notice and certificate of election, facsimile ballot, notice of referendum, notice of public hearing before a governmental body, and notice of meetings of private and public bodies required by law;\n(3) every summons, order, citation, notice of sale or other notice which is intended to inform a person that the person may or shall do an act or exercise a right within a designated period or upon or by a designated date; and\n(4) this subdivision contains no independent requirement for the publication of any public notice.\n\"Qualified newspaper\" means a newspaper which complies with all of the provisions of section 331A.02. The following terms, when found in laws referring to the publication of a public notice, shall be taken to mean a qualified newspaper: \"qualified legal newspaper,\" \"legal newspaper,\" \"official newspaper,\" \"newspaper,\" and \"medium of official and legal publication.\"\n\"Secondary office\" means an office established by a newspaper in a community other than that in which its known office of issue is located, in the same or an adjoining county, open on a regular basis to gather news and sell advertisements and subscriptions, whether or not printing or any other operations of the newspaper are conducted at or from the office.\n\"Summary\" means an accurate and intelligible abstract or synopsis of the essential elements of proceedings, ordinances, resolutions, financial statements, and other official actions. It shall be written in a clear and coherent manner, and shall, to the extent possible, avoid the use of technical or legal terms not generally familiar to the public. When a summary is published, the publication shall clearly indicate that the published material is only a summary and that the full text is available for public inspection at a designated location or by standard or electronic mail. A summary published in conformity with this section shall be deemed to fulfill all legal publication requirements as completely as if the entire matter which was summarized had been published. No liability shall be asserted against a political subdivision in connection with the publication of a summary or agenda.\n\"Recognized industry trade journal\" means a printed or digital publication or website that contains building and construction news of interest to contractors in this state, or that publishes project advertisements and bids for review by contractors or other interested bidders in its regular course of business.\n\"Publish\" means dissemination in the print edition of a qualified newspaper, and in the e-edition of the qualified newspaper if applicable.\n\"General circulation\" means that a newspaper distributes more than a nominal percentage of its total print circulation in a particular geographic area.\n\"E-edition\" means a digital facsimile of a newspaper's print edition that is substantially the same in both format and content as the print edition.",
	"repealed": false
}