{
	"id": "260B.175",
	"url": "https://www.revisor.mn.gov/statutes/cite/260B.175",
	"title": "260B.175 TAKING CHILD INTO CUSTODY.",
	"text": "No child may be taken into immediate custody except:\n(a) with an order issued by the court in accordance with the provisions of section 260C.151, subdivision 6, or Laws 1997, chapter 239, article 10, section 10, paragraph (a), clause (3), or 12, paragraph (a), clause (3), or by a warrant issued in accordance with the provisions of section 260B.154;\n(b) in accordance with the laws relating to arrests; or\n(c) by a peace officer or probation or parole officer when it is reasonably believed that the child has violated the terms of probation, parole, or other field supervision.\nThe taking of a child into custody under the provisions of this section shall not be considered an arrest.\nWhenever a peace officer takes a child into custody for shelter care or relative placement pursuant to subdivision 1 or section 260B.154, the officer shall notify the parent or custodian that under section 260B.181, subdivision 2, the parent or custodian may request that the child be placed with a relative or a designated caregiver under chapter 257A instead of in a shelter care facility. The officer also shall give the parent or custodian of the child a list of names, addresses, and telephone numbers of social services agencies that offer child welfare services. If the parent or custodian was not present when the child was removed from the residence, the list shall be left with an adult on the premises or left in a conspicuous place on the premises if no adult is present. If the officer has reason to believe the parent or custodian is not able to read and understand English, the officer must provide a list that is written in the language of the parent or custodian. The list shall be prepared by the commissioner of children, youth, and families. The commissioner shall prepare lists for each county and provide each county with copies of the list without charge. The list shall be reviewed annually by the commissioner and updated if it is no longer accurate. Neither the commissioner nor any peace officer or the officer's employer shall be liable to any person for mistakes or omissions in the list. The list does not constitute a promise that any agency listed will in fact assist the parent or custodian.\n(a) A peace officer who takes a child of any age or gender into custody under the provisions of this section is authorized to perform a protective pat-down search of the child in order to protect the officer's safety.\n(b) A peace officer also may perform a protective pat-down search of a child in order to protect the officer's safety in circumstances where the officer does not intend to take the child into custody, if this section authorizes the officer to take the child into custody.\n(c) Evidence discovered in the course of a lawful search under this section is admissible.",
	"repealed": false
}