{
	"id": "21.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/21.81",
	"title": "21.81 DEFINITIONS.",
	"text": "The terms used in sections 21.80 to 21.92 have the meanings given them in this section.\n\"Address\" means the complete primary mailing address of the labeler or the person or firm selling seed. A complete address includes the street address, post office box, or rural route, and city, state, and zip code or postal code.\n\"Advertisement\" means any representation, other than on a label, disseminated in any manner or by any means, relating to seed within the scope of sections 21.80 to 21.92.\n\"Agricultural seeds\" includes the seeds of grass, forage, cereal, oil, fiber crops, seeds of vegetables grown for processing, and any other kinds of seeds commonly recognized within this state as agricultural or field seeds, lawn seeds, or mixtures of those seeds, and may include noxious weed seed when the commissioner determines that the seed is being used as agricultural seed.\n\"Blend\" means seed consisting of more than one variety of a kind, each in excess of five percent of the whole.\n\"Certified seed\" means certified, registered, or foundation seed, or any other term conveying a similar meaning when referring to seed that has been produced, conditioned, and labeled in compliance with the rules of an officially recognized seed certification agency.\n\"Commissioner\" means the commissioner of agriculture or an authorized agent and may include a county agricultural inspector.\n\"Conditioning\" means cleaning to remove chaff, sterile florets, immature seeds, weed seeds, inert matter, and other crop seeds, scarifying, combining to obtain uniform quality, or any other operation which would change the purity or germination of the seed and require retesting to determine the quality of the seed. Conditioning does not include such operations as packaging, labeling, combining uniform lots of the same kind or variety without cleaning or preparing a mixture without cleaning, if it would not require retesting to determine the quality of the seed.\n\"Dormant\" means viable seed, exclusive of hard seed, that fail to germinate under the specified germination conditions for the kind of seed.\n\"Flower seeds\" includes seeds of herbaceous plants grown for their blooms, ornamental foliage, or other ornamental parts and commonly known and sold under the name of flower seeds in this state. This does not include native or introduced wildflowers.\nA \"genuine grower's declaration\" is a statement signed by the grower which gives for a lot of agricultural seed, the lot number, kind, variety, origin, weight, year of production, date of shipment, and to whom it was sold, shipped, or delivered.\n\"Germination\" means the percentage of seeds other than hard seeds which are capable of producing normal seedlings under favorable growing conditions. Broken, weak, diseased, malformed, or abnormal seedlings shall not be considered as having germinated.\n\"Hard seed\" means seeds that remain hard at the end of the prescribed test period because they have not absorbed water due to an impermeable seed coat.\n\"Hybrid\" when applied to kinds or varieties of seed means the first generation seed of a cross produced by controlling the pollination and by combining (a) two or more inbred lines; (b) one inbred or a single cross with an open pollinated variety; or (c) two selected clones, seed lines, varieties, or species. \"Controlling the pollination\" means to use a method of hybridization which will produce pure seed which is at least 75 percent hybrid seed. The second generation or subsequent generations from these crosses are not hybrids. Hybrid designations shall be treated as variety names.\n\"Inert matter\" means all matter that is not seed, including broken seeds, sterile florets, chaff, fungus bodies, and stones as determined by methods defined by rule.\nMS 2018 [Repealed, 2020 c 89 art 2 s 19]\n\"Kind\" means one or more related species or subspecies which singly or collectively is known by one common name, such as wheat, oats, or sweet clover.\n\"Label\" includes a tag or other device attached to or written, stamped, or printed on any container or accompanying any lot of bulk seeds purporting to set forth the kind of seeds contained, or any other information relating to the labeled seed and includes invoices under which any seed is imported into the state.\n\"Labeler\" means the person whose complete name and address appears on the label of agricultural, vegetable, flower, tree, shrub, or any other seed for sale within this state, or the person identified by the code designation on the label as authorized by Code of Federal Regulations, title 7, section 201.23.\n\"Lot\" means a definite quantity of seed identified by a lot number or other mark, every portion or bag of which is uniform within recognized tolerances for the factors which appear in the labeling.\n\"Mixture\" means seeds consisting of more than one kind, each in excess of five percent of the whole.\n\"Native wildflower\" means a kind, type, or variety of wildflower derived from wildflowers that are indigenous to Minnesota and wildflowers that are defined or designated as native species under chapter 84D.\n\"Noxious weed seeds\" includes prohibited and restricted noxious weed seeds.\n\"Origin,\" for an indigenous stand of trees, means the area on which the trees are growing and, for a nonindigenous stand, the place from which the seed or plants were originally introduced. \"Origin\" for agricultural and vegetable seed is the area where the seed was produced, and for native grasses and forbs, it is the area where the original seed was harvested.\n\"Other crop seed\" means seed of plants grown as crops, other than the variety included in the pure seed, as determined by methods defined by rule.\n\"Person\" means an individual, firm, corporation, partnership, association, trust, joint stock company, or unincorporated organization; the state, a state agency, or a political subdivision.\n[Repealed, 1996 c 310 s 1]\n\"Prohibited noxious weed seeds\" are those weed seeds which are prohibited from being present in any agricultural, vegetable, flower, tree or shrub seed. They are the seeds of weeds which are highly destructive and difficult to control by good cultural practices or by the use of herbicides. They not only reproduce by seed but also may spread by underground reproductive parts such as roots and rootstocks and aboveground reproductive parts such as runners and stolons.\n\"Pure live seed\" means the product of the percent germination multiplied by the percent pure seed divided by 100 percent.\n\"Pure seed\" means seed exclusive of inert matter and all other seeds not of the kind of seed being considered as defined by the rules for testing seeds of the Association of Official Seed Analysts.\n\"Recommended Uniform State Seed Law\" refers to the Association of American Seed Control Officials guidelines for seed law.\n\"Record\" includes all information relating to seed shipments and includes a file sample of each lot of seed. For tree and shrub seed, the record includes all documents regarding statement of origin and elevation where the seed originated.\n\"Restricted noxious weed seeds\" are those weed seeds which, if present in agricultural, vegetable, flower, tree or shrub seed, shall be named on the label together with the number per pound of seed specified and which shall not exceed the legal limit. They are seeds of weeds which are objectionable in fields, lawns, and gardens of this state and can be controlled by good cultural practice and use of herbicides.\n\"Screenings\" means chaff, sterile florets, immature seed, weed seeds, inert matter, and other material removed from seed in any kind of conditioning and which contains less than 25 percent by weight of live agricultural or vegetable seed.\n\"Seizure\" means a legal process carried out by a court order against a definite amount of seed.\n\"Sell,\" when applying to agricultural, vegetable, flower, tree or shrub seed, and seed samples, includes:\n(a) selling or transferring ownership;\n(b) offering and exposing for sale, exchange, distribution, giving away, and transportation in or into this state;\n(c) having in possession with intent to sell, exchange, distribute, give away, or transport in or into this state;\n(d) storing, carrying, and handling in aid of traffic in seeds, whether done in person or through an agent, employee, or other person; and\n(e) receiving, accepting, and holding on consignment for sale.\n\"Stop sale\" means an administrative order restraining the sale, use, disposition, and movement of a definite amount of seed.\n\"Total viable\" means the sum of the germination percentage, plus hard seeds, dormant seeds, or both.\n\"Treated\" means that the seed has received an application of a substance or that it has been subjected to a process for which a claim is made.\n\"Tree and shrub seeds\" includes seeds of woody plants commonly known and sold as tree and shrub seeds in this state.\nA \"tree seed collector's declaration\" is a statement signed by a grower or person having knowledge of the place of collection which gives for a lot of seed: the lot number, common or scientific name of the species, subspecies if appropriate, origin, elevation, and quantity of tree and shrub seed.\n\"Type\" means a group of varieties so nearly similar that individual varieties cannot be clearly differentiated except under special conditions.\n\"Vegetable seeds\" includes the seeds of those crops which are grown in gardens and on truck farms that are generally known and sold under the name of vegetable or herb seeds in this state.\n\"Variety\" means a subdivision of a kind characterized by growth, yield, plant, fruit, seed, or other characteristics by which it can be differentiated from other plants of the same kind.\n\"Weed seeds\" includes the seeds of all plants generally recognized as weeds within this state, including noxious weed seeds.",
	"repealed": false
}