{
	"id": "325F.83",
	"url": "https://www.revisor.mn.gov/statutes/cite/325F.83",
	"title": "325F.83 REGULATION OF AUTOMATIC GARAGE DOOR OPENING SYSTEMS.",
	"text": "No person shall manufacture, sell, offer for sale, purchase, or install in this state an automatic garage door opening system for residential buildings that does not comply with subdivision 3.\nNo person shall service or repair an automatic garage door opening system for residential buildings that does not comply with the automatic reversing requirement. This paragraph does not prevent the servicing or repair of an automatic garage door opening system if the system will be in compliance with the automatic reversing requirement after the repair or service.\nThe person servicing or repairing the automatic garage door opening system shall determine whether or not the system complies with the automatic reversing requirement by conducting an on-site test of the system.\nIf the automatic garage door opening system does not pass the on-site test required by subdivision 1a, the person conducting the test shall complete and conspicuously attach to the automatic garage door opening system, a red label that states the following:\n\"DANGER\nThis garage door opener was tested and does not meet the requirements for a working safety reverse feature. This can be dangerous and may cause serious injury or death. You are advised to disconnect the opener from the door immediately and operate the door manually until the opener has been repaired or replaced with one that meets current safety standards relating to automatic reversal as provided for in Minnesota Statutes, section 325F.83, subdivision 1a.\nThe firm of the agent or employee who attached the red label shall notify within ten working days in writing the occupant of the residence that the system did not comply with subdivision 1a.\nNo residential building shall be designed or built in this state unless all automatic garage door opening systems comply with subdivision 3.\n(a) No later than January 1, 1991, all automatic garage door opening systems subject to subdivision 1, 1a, or 2 must conform to the applicable requirements of Underwriters Laboratories, Inc., Standards for Safety-UL 325, third edition, as revised May 4, 1988.\n(b) No later than January 1, 1993, all automatic garage door opening systems subject to subdivision 1 or 2 must include an attached edge sensor, safety beam, or similar device that when activated causes a closing door to open and prevents an open door from closing. This device is to be designed and built so that a failure of the device prevents the door from closing.\nOn and after January 1, 1991, a manufacturer selling or offering for sale automatic garage door opening systems in this state shall clearly identify on the container and on the system, the month or week and year the system was manufactured, and its conformance with UL 325, as required under subdivision 3, paragraph (a). The display of the UL logo or listing mark and compliance with the date marking requirements of UL 325 on both the container and the system fulfills the manufacturer's labeling requirements specified under this subdivision.\nFor all residential buildings where the occupant is not the owner, the occupant has a duty to inform the owner of a nonfunctioning or malfunctioning reversing device or mechanism in an automatic garage door opening system within 24 hours of discovery of the problem.\nA person who is found to have violated this section is subject to the penalties and remedies, including a private right of action, as provided in section 8.31.\nThe governing body of a local unit of government may adopt, by ordinance, rules for the installation and maintenance of automatic garage door opening systems that are more restrictive than the standards imposed by this section. Rules adopted pursuant to this subdivision may be enforced through a truth-in-housing inspection.\nFor the purposes of section 541.051, an automatic garage door opening device is not an improvement to real property.",
	"repealed": false
}