{
	"id": "353D.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/353D.07",
	"title": "353D.07 BENEFITS.",
	"text": "(a) The plan is a defined contribution plan. A participant's benefit is equal to the value of the individual account established for the participant under section 353D.04, taking into account all contributions credited to the account plus a proportionate share of investment income of the fund credited to the account.\n(b) In the case of ambulance service personnel, eligibility standards must be uniform among all ambulance service personnel of an ambulance service electing to participate.\n(a) A participant is entitled to receive a distribution of the participant's benefit after termination of service for any reason, disability, or death, or on or after attaining age 65 if still employed by a public employer.\n(b) Unless the distribution is required under section 353D.071, no distribution shall be made unless the participant has submitted an application requesting a distribution; a direct rollover; a transfer as permitted under subdivision 3, paragraph (b); or installments as permitted under subdivision 4. If the distribution is an eligible rollover distribution as defined in section 356.633, subdivision 1, paragraph (d), the executive director shall provide notice to the participant or beneficiary, as applicable, of the right to elect a direct rollover.\n(a) Except as provided in subdivision 4 or 6, distribution of a participant's benefit shall be available in the form of a lump sum equal to the value of the participant's account at the date of distribution.\n(b) The participant may elect to (1) receive the lump sum directly, (2) have the lump sum distributed in a direct rollover as described in section 356.633, subdivision 2, or (3) have the lump sum transferred for the purchase of an annuity payable at a designated age to an insurance company of the participant's choice that is licensed to do business in the state.\nIf a participant becomes permanently and totally disabled as defined in section 353.01, subdivision 19, the participant may elect distribution of the participant's benefit in a lump sum equal to the value of the participant's account or in equal monthly installments in an amount designated by the participant in increments of $100. Payments may begin as early as the first day of the month following the month in which the disability occurred or on a later date if elected by the participant. Payments end when the participant's disabled status ends or the account balance is exhausted, whichever occurs first.\nMS 1987 Supp [Repealed, 1988 c 709 art 5 s 42]\nIf a participant dies while employed or before the participant's account is distributed in its entirety, the account must be paid in a lump sum to the designated beneficiary or, if none, the heirs at law of the decedent. If the distribution is an eligible rollover distribution as defined in section 356.633, subdivision 1, paragraph (d), the executive director shall provide an election form and notice of the right to elect a direct rollover.\nIf a participant is employed by a public employer and is at least age 65, the participant may elect a distribution of all or a portion of the participant's account, subject to the application and notice requirements in subdivision 2, paragraph (b). The participant may elect a distribution under this subdivision no more frequently than once each calendar year. The minimum amount of a distribution under this subdivision is $5,000.",
	"repealed": false
}