{
	"id": "103G.201",
	"url": "https://www.revisor.mn.gov/statutes/cite/103G.201",
	"title": "103G.201 PUBLIC WATERS INVENTORY.",
	"text": "(a) The commissioner shall maintain a public waters inventory map of each county that shows the waters of this state that are designated as public waters under the public waters inventory and classification procedures prescribed under Laws 1979, chapter 199, and shall provide access to a copy of the maps. As county public waters inventory maps are revised according to this section, the commissioner shall send a notification or a copy of the maps to the auditor of each affected county.\n(b) The commissioner must revise the map of public waters established under Laws 1979, chapter 199, to reclassify those types 3, 4, and 5 wetlands previously identified as public waters wetlands under Laws 1979, chapter 199, as public waters or as wetlands under section 103G.005, subdivision 19. The commissioner may only reclassify public waters wetlands as public waters if:\n(1) they are assigned a shoreland management classification by the commissioner under sections 103F.201 to 103F.221;\n(2) they are classified as lacustrine wetlands or deepwater habitats according to Classification of Wetlands and Deepwater Habitats of the United States (Cowardin, et al., 1979 edition); or\n(3) the state or federal government has become titleholder to any of the beds or shores of the public waters wetlands, subsequent to the preparation of the public waters inventory map filed with the auditor of the county, pursuant to paragraph (a), and the responsible state or federal agency declares that the water is necessary for the purposes of the public ownership.\n(c) The commissioner must provide notice of the reclassification to the local government unit, the county board, the watershed district, if one exists for the area, and the soil and water conservation district. Within 60 days of receiving notice from the commissioner, a party required to receive the notice may provide a resolution stating objections to the reclassification. If the commissioner receives an objection from a party required to receive the notice, the reclassification is not effective. If the commissioner does not receive an objection from a party required to receive the notice, the reclassification of a wetland under paragraph (b) is effective 60 days after the notice is received by all of the parties.\n(d) The commissioner shall give priority to the reclassification of public waters wetlands that are or have the potential to be affected by public works projects.\n(e) The commissioner may revise the public waters inventory map of each county:\n(1) to reflect the changes authorized in paragraph (b); and\n(2) as needed, to:\n(i) correct errors in the original inventory;\n(ii) add or subtract trout stream tributaries within sections that contain a designated trout stream following written notice to the landowner;\n(iii) add depleted quarries, and sand and gravel pits, when the body of water exceeds 50 acres and the shoreland has been zoned for residential development; and\n(iv) add or subtract public waters that have been created or eliminated as a requirement of a permit authorized by the commissioner under section 103G.245.\n(f) $1,000,000 is appropriated from the general fund each year in fiscal years 2025 through 2032 to the commissioner to update the public water inventory as required in this section. The commissioner must develop and implement a process to update the public water inventory. This paragraph expires June 30, 2032.",
	"repealed": false
}