{
	"id": "144.50",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.50",
	"title": "144.50 HOSPITALS, LICENSES; DEFINITIONS.",
	"text": "(a) No person, partnership, association, or corporation, nor any state, county, or local governmental units, nor any division, department, board, or agency thereof, shall establish, operate, conduct, or maintain in the state any hospital, sanitarium or other institution for the hospitalization or care of human beings without first obtaining a license therefor in the manner provided in sections 144.50 to 144.56. No person or entity shall advertise a facility providing services required to be licensed under sections 144.50 to 144.56 without first obtaining a license.\n(b) A violation of this subdivision is a misdemeanor punishable by a fine of not more than $300. The commissioner may seek an injunction in the district court against the continuing operation of the unlicensed institution. Proceedings for securing an injunction may be brought by the attorney general or by the appropriate county attorney.\n(c) The sanctions in this subdivision do not restrict other available sanctions.\nHospital, sanitarium or other institution for the hospitalization or care of human beings, within the meaning of sections 144.50 to 144.56 shall mean any institution, place, building, or agency, in which any accommodation is maintained, furnished, or offered for five or more persons for: the hospitalization of the sick or injured; the provision of care in a swing bed authorized under section 144.562; elective outpatient surgery for preexamined, prediagnosed low risk patients; emergency medical services offered 24 hours a day, seven days a week, in an ambulatory or outpatient setting in a facility not a part of a licensed hospital; or the institutional care of human beings. Nothing in sections 144.50 to 144.56 shall apply to a clinic; a physician's, advanced practice registered nurse's, or physician assistant's office; or to hotels or other similar places that furnish only board and room, or either, to their guests.\n\"Hospitalization\" means the reception and care of persons for a continuous period longer than 24 hours, for the purpose of diagnosis or treatment bearing on the physical or mental health of such persons.\n[Repealed, 1980 c 357 s 22]\nNothing in sections 144.50 to 144.56 shall authorize any person, partnership, association, or corporation, nor any state, county, or local governmental units, nor any division, department, board, or agency thereof, to engage, in any manner, in the practice of healing, or the practice of medicine, as defined by law.\n(a) The commissioner may license as a supervised living facility a facility seeking medical assistance certification as an intermediate care facility for persons with developmental disability for four or more persons as authorized under section 252.291.\n(b) Class B supervised living facilities shall be classified as follows for purposes of the State Building Code:\n(1) Class B supervised living facilities for six or less persons must meet Group R, Division 3, occupancy requirements; and\n(2) Class B supervised living facilities for seven to 16 persons must meet Group R, Division 1, occupancy requirements.\n(c) Class B facilities classified under paragraph (b), clauses (1) and (2), must meet the fire protection provisions of chapter 21 of the 1985 Life Safety Code, NFPA 101, for facilities housing persons with impractical evacuation capabilities, except that Class B facilities licensed prior to July 1, 1990, need only continue to meet institutional fire safety provisions. Class B supervised living facilities shall provide the necessary physical plant accommodations to meet the needs and functional disabilities of the residents. For Class B supervised living facilities licensed after July 1, 1990, and housing nonambulatory or nonmobile persons, the corridor access to bedrooms, common spaces, and other resident use spaces must be at least five feet in clear width, except that a waiver may be requested in accordance with Minnesota Rules, part 4665.0600.\n(d) The commissioner may license as a Class A supervised living facility a residential program for individuals with substance use disorder that allows children to reside with the parent receiving treatment in the facility. The licensee of the program shall be responsible for the health, safety, and welfare of the children residing in the facility. The facility in which the program is located must be provided with a sprinkler system approved by the state fire marshal. The licensee shall also provide additional space and physical plant accommodations appropriate for the number and age of children residing in the facility. For purposes of license capacity, each child residing in the facility shall be considered to be a resident.\n(a) A supervised living facility must establish and maintain a comprehensive tuberculosis infection control program according to the most current tuberculosis infection control guidelines issued by the United States Centers for Disease Control and Prevention (CDC), Division of Tuberculosis Elimination, as published in CDC's Morbidity and Mortality Weekly Report (MMWR). This program must include a tuberculosis infection control plan that covers all paid and unpaid employees, contractors, students, and volunteers. The Department of Health shall provide technical assistance regarding implementation of the guidelines.\n(b) Written compliance with this subdivision must be maintained by the supervised living facility.\nBoarding care homes and supervised living facilities licensed by the commissioner of health must accept as a resident a person who is infected with the human immunodeficiency virus or the hepatitis B virus unless the facility cannot meet the needs of the person under Minnesota Rules, part 4665.0200, subpart 5, or 4655.1500, subpart 2, or the person is otherwise not eligible for admission to the facility under state laws or rules.",
	"repealed": false
}