{
	"id": "515B.2-108",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-108",
	"title": "515B.2-108 ALLOCATION OF INTERESTS.",
	"text": "(a) The declaration shall allocate to each unit:\n(1) in a condominium, a fraction or percentage of undivided interests in the common elements and in the common expenses of the association and a portion of the votes in the association;\n(2) in a cooperative, an ownership interest in the association, a fraction or percentage of the common expenses of the association and a portion of the votes in the association; and\n(3) in a planned community, a fraction or percentage of the common expenses of the association and a portion of the votes in the association.\n(b) The declaration shall state the formulas used to establish allocations of interests. If the fractions or percentages are all equal the declaration may so state in lieu of stating the fractions or percentages. The declaration need not allocate votes or a share of common expenses to units that are auxiliary to other units, such as garage units or storage units. The allocations shall not discriminate in favor of units owned by the declarant or an affiliate of the declarant, except as provided in sections 515B.2-121 and 515B.3-115.\n(c) If units may be added to the common interest community, the formulas used to reallocate the allocated interests among all units included in the common interest community after the addition shall be the formulas stated in the declaration.\n(d) The declaration may authorize special allocations: (i) of unit owner votes among certain units or classes of units on particular matters specified in the declaration, or (ii) of common expenses among certain units or classes of units on particular matters specified in the declaration. Special allocations may only be used to address operational, physical or administrative differences within the common interest community. A declarant may not utilize special allocations for the purpose of evading any limitation or obligation imposed on declarants by this chapter nor may units constitute a class because they are owned by a declarant.\n(e) The sum of each category of allocated interests allocated at any time to all the units must equal one if stated as a fraction or 100 percent if stated as a percentage. In the event of a discrepancy between an allocated interest and the result derived from application of the pertinent formula, the allocated interest prevails.\n(f) In a condominium or planned community, the common elements are not subject to partition, and any purported conveyance, encumbrance, judicial sale, or other voluntary or involuntary transfer of an undivided interest in the common elements made without the unit to which that interest is allocated is void. The granting of easements, licenses or leases pursuant to section 515B.2-109 or 515B.3-102 shall not constitute a partition.\n(g) In a cooperative, any purported conveyance, encumbrance, judicial sale, or other voluntary or involuntary transfer of an ownership interest in the association made without the possessory interest in the unit to which that interest is related is void.",
	"repealed": false
}