{
	"id": "18.82",
	"url": "https://www.revisor.mn.gov/statutes/cite/18.82",
	"title": "18.82 TRANSPORTATION OF NOXIOUS WEED PROPAGATING PARTS.",
	"text": "Transporting noxious weed propagating parts without a permit is prohibited, except as provided in section 21.74. If a person wants to transport noxious weed propagating parts along a public roadway, including materials or equipment containing the propagating parts of noxious weeds, the person must secure a written permit for transportation from an inspector or county-designated employee. Inspectors or county-designated employees may issue permits to persons residing or operating within their jurisdiction. A permit is not required for the transport of noxious weeds for the purpose of destroying propagating parts at an appropriate disposal site. Anyone transporting noxious weed propagating parts for the purpose of disposal at an appropriate disposal site shall ensure that all materials are contained in a manner that prevents escape during transport and complies with section 115A.931. A person must obtain a permit before possessing noxious weeds with propagating parts for research, education and outreach, or other reasons approved by the commissioner.\nThe following conditions must be met before a permit under subdivision 1 may be issued:\n(1) any material or equipment containing noxious weed propagating parts that is about to be transported along a public roadway must be in a container that is sufficiently tight and closed or otherwise covered to prevent the blowing or scattering of the material along the highway or on other lands or water;\n(2) the destination for unloading and the use of the material or equipment containing noxious weed propagating parts must be stated on the permit along with the method that will be used to destroy the viability of the propagating parts and thereby prevent the material being dumped or scattered upon land or water; and\n(3) the applicant for a permit for possession of noxious weed propagating parts must agree to follow the guidelines listed on the permit by the inspector.\nA permit under subdivision 1 is valid for up to one year after the date it is issued unless otherwise specified by the inspector or county-designated employee issuing the permit. The permit may be revoked if an inspector or county-designated employee determines that the applicant has not complied with this section.",
	"repealed": false
}