{
	"id": "336.9-306A",
	"url": "https://www.revisor.mn.gov/statutes/cite/336.9-306A",
	"title": "336.9-306A LAW GOVERNING PERFECTION AND PRIORITY OF SECURITY INTERESTS IN CHATTEL PAPER.",
	"text": "(a) Chattel paper evidenced by authoritative electronic copy. Except as provided in subsection (d), if chattel paper is evidenced only by an authoritative electronic copy of the chattel paper or is evidenced by an authoritative electronic copy and an authoritative tangible copy, the local law of the chattel paper's jurisdiction governs perfection, the effect of perfection or nonperfection, and the priority of a security interest in the chattel paper, even if the transaction does not bear any relation to the chattel paper's jurisdiction.\n(b) Chattel paper's jurisdiction. The following rules determine the chattel paper's jurisdiction under this section:\n(1) If the authoritative electronic copy of the record evidencing chattel paper, or a record attached to or logically associated with the electronic copy and readily available for review, expressly provides that a particular jurisdiction is the chattel paper's jurisdiction for purposes of this part, this article, or this chapter, that jurisdiction is the chattel paper's jurisdiction.\n(2) If paragraph (1) does not apply and the rules of the system in which the authoritative electronic copy is recorded are readily available for review and expressly provide that a particular jurisdiction is the chattel paper's jurisdiction for purposes of this part, this article, or this chapter, that jurisdiction is the chattel paper's jurisdiction.\n(3) If paragraphs (1) and (2) do not apply and the authoritative electronic copy, or a record attached to or logically associated with the electronic copy and readily available for review, expressly provides that the chattel paper is governed by the law of a particular jurisdiction, that jurisdiction is the chattel paper's jurisdiction.\n(4) If paragraphs (1), (2), and (3) do not apply and the rules of the system in which the authoritative electronic copy is recorded are readily available for review and expressly provide that the chattel paper or the system is governed by the law of a particular jurisdiction, that jurisdiction is the chattel paper's jurisdiction.\n(5) If paragraphs (1) through (4) do not apply, the chattel paper's jurisdiction is the jurisdiction in which the debtor is located.\n(c) Chattel paper evidenced by authoritative tangible copy. If an authoritative tangible copy of a record evidences chattel paper and the chattel paper is not evidenced by an authoritative electronic copy, while the authoritative tangible copy of the record evidencing chattel paper is located in a jurisdiction, the local law of that jurisdiction governs:\n(1) perfection of a security interest in the chattel paper by possession under section 336.9-314A; and\n(2) the effect of perfection or nonperfection and the priority of a security interest in the chattel paper.\n(d) When perfection governed by law of jurisdiction where debtor located. The local law of the jurisdiction in which the debtor is located governs perfection of a security interest in chattel paper by filing.",
	"repealed": false
}