{
	"id": "14.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.18",
	"title": "14.18 PUBLICATION OF ADOPTED RULE; EFFECTIVE DATE.",
	"text": "A rule is effective after it has been subjected to all requirements described in sections 14.131 to 14.20 and five working days after the notice of adoption is published in the State Register unless a later date is required by section 14.126 or other law or specified in the rule. If the rule adopted is the same as the proposed rule, publication may be made by publishing notice in the State Register that the rule has been adopted as proposed and by citing the prior publication. If the rule adopted differs from the proposed rule, the portions of the adopted rule that differ from the proposed rule must be included in the notice of adoption together with a citation to the prior State Register publication of the remainder of the proposed rule. The nature of the modifications must be clear to a reasonable person when the notice of adoption is considered together with the State Register publication of the proposed rule, except that modifications may also be made that comply with the form requirements of section 14.07, subdivision 7.\nIf the agency omitted from the notice of proposed rule adoption the text of the proposed rule, as permitted by section 14.14, subdivision 1a, paragraph (b), the chief administrative law judge may provide that the notice of the adopted rule need not include the text of any changes from the proposed rule. However, the notice of adoption must state in detail the substance of the changes made from the proposed rule, and must state that a free copy of the portion of the adopted rule that was the subject of the rulemaking proceeding, not including any material adopted by reference as permitted by section 14.07, is available upon request to the agency.\nA new fee or fee increase adopted by the Pollution Control Agency is subject to legislative approval during the next biennial budget session following adoption. The commissioner shall submit a report of fee adjustments to the legislature as a supplement to the biennial budget. Any new fee or fee increase remains in effect unless the legislature passes a bill disapproving the new fee or fee increase. A fee or fee increase disapproved by the legislature becomes null and void on July 1 following adjournment.",
	"repealed": false
}