{
	"id": "580.022",
	"url": "https://www.revisor.mn.gov/statutes/cite/580.022",
	"title": "580.022 FORMS.",
	"text": "The notice required under section 580.021, subdivision 2, clause (2), must be printed on colored paper that is other than the color of any other document provided with it and must appear substantially as follows:\n\"PREFORECLOSURE NOTICE\nForeclosure Prevention Counseling\nWhy You Are Getting This Notice\nWe do not want you to lose your home and your equity. Government-approved nonprofit agencies are available to, if possible, help you prevent foreclosure.\nWe have given your contact information to an authorized foreclosure prevention counseling agency to contact you to help you prevent foreclosure.\nWho Are These Foreclosure Prevention Counseling Agencies\nThey are nonprofit agencies who are experts in housing and foreclosure prevention counseling and assistance. They are experienced in dealing with lenders and homeowners who are behind on mortgage payments and can help you understand your options and work with you to address your delinquency. They are approved by either the Minnesota Housing Finance Agency or the United States Department of Housing and Urban Development. They are not connected with us in any way.\nWhich Agency Will Contact You\n[insert name, address, and telephone number of agency]\nYou can also contact them directly.\"\nThe notice required in section 580.021, subdivision 4, must be substantially in the following form:\n\"PREFORECLOSURE NOTICE\nNOTICE OF PROVISION OF FORECLOSURE PREVENTION COUNSELING AND REQUEST FOR MORTGAGEE CONTACT INFORMATION\n[Insert agency name] has been contacted by your customer regarding foreclosure prevention counseling in response to the current foreclosure proceedings involving the customer's real property. Please provide the following contact information pursuant to Minnesota Statutes, section 580.021, subdivision 4, by completing and returning this form via fax [insert fax number] or via email at [insert email address].",
	"repealed": false
}