{
	"id": "524.5-409",
	"url": "https://www.revisor.mn.gov/statutes/cite/524.5-409",
	"title": "524.5-409 FINDINGS; ORDER OF APPOINTMENT.",
	"text": "(a) The court may appoint a limited or unlimited conservator for a respondent only if it finds that:\n(1) by clear and convincing evidence, the individual is unable to manage property and business affairs because of an impairment in the ability to receive and evaluate information or make decisions, even with the use of appropriate technological assistance, or because the individual is missing, detained, or unable to return to the United States;\n(2) by a preponderance of evidence, the individual has property that will be wasted or dissipated unless management is provided or money is needed for the support, care, education, health, and welfare of the individual or of individuals who are entitled to the individual's support and that protection is necessary or desirable to obtain or provide money; and\n(3) the respondent's identified needs cannot be met by less restrictive means, including but not limited to use of appropriate technological assistance, supported decision making, representative payee, trusts, banking or bill paying assistance, or appointment of an attorney-in-fact under section 523.01. The court must make specific findings particular to the respondent why less restrictive alternatives do not work.\n(b) Alternatively, the court, with appropriate findings, may enter any other appropriate order, or dismiss the proceeding.\n(c) The court, whenever feasible, shall grant to a conservator only those powers necessitated by the limitations and demonstrated needs of the person subject to conservatorship and make appointive and other orders that will encourage the development of the maximum self-reliance and independence of the person subject to conservatorship.\n(d) Within 14 days after an appointment, the conservator shall send or deliver to the person subject to conservatorship, if the person subject to conservatorship has attained 14 years of age and is not missing, detained, or unable to return to the United States, and counsel if represented at the hearing, a copy of the order of appointment accompanied by a notice which advises the person subject to conservatorship of the right to appeal the conservatorship appointment in the time and manner provided by the Rules of Appellate Procedure.\n(e) Each year, within 30 days after the anniversary date of an appointment, a conservator shall send or deliver to the person subject to conservatorship and to interested persons of record with the court a notice of the right to request termination or modification of the conservatorship or for any order that is in the best interests of the person subject to conservatorship or for other appropriate relief as well as a copy of the bill of rights for the person subject to conservatorship as provided in section 524.5-120.\n(f) The appointment of a conservator or the entry of another protective order is not a determination of incapacity of the person subject to conservatorship.\n(a) If the court finds that compliance with the procedures of this article will likely result in the immediate loss, waste, or dissipation of the individual's assets or income unless management is provided, or money is needed for the support, care, education, health, and welfare of the individual or of individuals who are entitled to the individual's support and that protection is necessary or desirable to obtain or provide money, and that no other person appears to have authority and willingness to act in the circumstances, the court, on petition by a person interested in the respondent's welfare, may appoint an emergency conservator whose authority may not exceed 60 days and who may exercise only the powers specified in the order. A county that is acting under section 626.557, subdivision 10, by petitioning for appointment of an emergency conservator on behalf of a vulnerable adult may be granted authority to act for a period not to exceed 90 days. An emergency conservator's appointment under this section may be extended once for a period not to exceed 60 days if the court finds good cause for the continuation of the conservatorship. Immediately upon receipt of the petition for an emergency conservatorship, the court shall appoint a lawyer to represent the respondent in the proceeding. Except as otherwise provided in paragraph (b), reasonable notice of the time and place of a hearing on the petition must be given to the respondent and any other persons as the court directs.\n(b) An emergency conservator may be appointed without notice to the respondent and the respondent's lawyer only if the court finds from affidavit or other sworn testimony that the respondent will be substantially harmed before a hearing on the appointment can be held. If the court appoints an emergency conservator without notice to the respondent, the respondent must be given notice of the appointment within 48 hours after the appointment. The court shall hold a hearing on the appropriateness of the appointment within five days after the appointment.\n(c) Appointment of an emergency conservator, with or without notice, is not a determination of the respondent's incapacity.\n(d) The court may remove an emergency conservator at any time. An emergency conservator shall make any report the court requires. In other respects, the provisions of this article concerning conservators apply to an emergency conservator.\n(e) If the court finds that a conservator is not effectively performing the conservator's duties and that the security and preservation of the assets of the person subject to conservatorship requires immediate action, the court may appoint a temporary substitute conservator for the person subject to conservatorship for a specified period not exceeding six months. Except as otherwise ordered by the court, a temporary substitute conservator so appointed has the powers set forth in the previous order of appointment. The authority of any unlimited or limited conservator previously appointed by the court is suspended as long as a temporary substitute conservator has authority. If an appointment is made without previous notice to the person subject to conservatorship or the affected conservator within five days after the appointment, the court shall inform the person subject to conservatorship or conservator of the appointment.\n(f) The court may remove a temporary substitute conservator at any time. A temporary substitute conservator shall make any report the court requires. In other respects, the provisions of this article concerning conservators apply to a temporary substitute conservator.\n(g) Any documents or information disclosing or pertaining to health or financial information shall be filed as confidential documents, consistent with the bill of particulars under section 524.5-121.",
	"repealed": false
}