{
	"id": "515B.2-112",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-112",
	"title": "515B.2-112 SUBDIVISION, COMBINATION, OR CONVERSION OF UNITS.",
	"text": "(a) If the declaration so provides, (i) a unit or units that are not owned exclusively by a declarant or the association may be subdivided into two or more units or combined into a lesser number of units, or (ii) a unit or units owned exclusively by a declarant or the association may be subdivided, combined, or converted into one or more units, limited common elements, common elements, or a combination of units, limited common elements or common elements.\n(b) If the unit or units are not owned exclusively by a declarant or the association, the unit owners of the units to be combined or subdivided shall cause to be prepared and submitted to the association for approval an application for an amendment to the declaration and amended CIC plat, for the purpose of subdividing or combining the unit or units. The application shall contain, at a minimum, a general description of the proposed subdivision or combination, and shall specify in detail the matters required by subsections (d)(2), (3), and (4). The basis for disapproval of the application by the association shall be limited to (i) health or safety considerations, (ii) liability considerations for the association and other unit owners, (iii) aesthetic changes to the common elements or another unit, (iv) any material and adverse impact on the common elements or another unit, or (v) a failure to comply with the declaration, this chapter, or governmental laws, ordinances, or regulations. The association shall give written notice of its decision and required changes to the unit owner or owners who made the application. The association shall establish fair and reasonable procedures and time frames for the submission and prompt processing of the applications. If an application under this subsection is approved, the unit owner shall cause an amendment, and an amended CIC plat if required, to be prepared based upon the approved application.\n(c) If the unit or units are owned exclusively by a declarant or the association, the declarant or the association, as applicable, shall have the authority to unilaterally prepare, execute, and record, at its expense, an amendment to the declaration and an amended CIC plat subdividing, combining, or converting the unit or units. The amendment shall comply with subsection (d)(2), (3), (4), and (5), and shall be limited to those provisions necessary to accomplish the subdivision, combination, or conversion unless the consent of unit owners required to amend the declaration is obtained.\n(d) An amendment approved under subsection (b) shall:\n(1) be executed by the association and each unit owner of each unit to be combined or subdivided, and consented to by each secured party with a security interest in a unit to be combined or subdivided;\n(2) assign a unit identifier to each unit resulting from the subdivision, conversion, or combination;\n(3) reallocate the common element interest, votes in the association, and common expense liability, as applicable, formerly allocated to the unit or units being combined, converted, or subdivided (i) only among the resulting unit or units, or (ii) among all remaining units in the case of a conversion of a unit or units entirely to common elements, as applicable, on the basis of the formula described in the declaration;\n(4) reallocate limited common elements formerly allocated to the unit or units being combined, converted, or subdivided among the resulting unit or units, or designate part or all of the limited common elements as common elements in the case of a conversion of a unit or units; and\n(5) conform to the requirements of the declaration and this chapter.\n(e) If the association determines that the amendment and amended CIC plat conform to the application approved under subsection (b), the declaration, and this chapter, the association shall execute the amendment and cause the amendment and the amended CIC plat to be recorded. The association may require the unit owners executing the amendment to pay all fees and costs for reviewing, preparing, and recording the amendment and the amended CIC plat, and any other fees or costs incurred by the association in connection therewith.\n(f) The amended CIC plat shall show the resulting common elements, limited common elements or units, as subdivided, combined, or converted.\n(g) A secured party's interest and remedies shall be deemed to apply to the unit or units that result from the subdivision or combination of the unit or units in which the secured party held a security interest. If the secured party enforces any remedy, including foreclosure of its lien, against any of the resulting units, all instruments and notices relating to the foreclosure shall describe the subject property as described in the amendment and the amended CIC plat which created the resulting units.",
	"repealed": false
}