{
	"id": "116J.8751",
	"url": "https://www.revisor.mn.gov/statutes/cite/116J.8751",
	"title": "116J.8751 LAUNCH MINNESOTA.",
	"text": "Launch Minnesota is established within the Business and Community Development Division of the Department of Employment and Economic Development to encourage and support the development of new private sector technologies and support the science and technology policies under section 3.222. Launch Minnesota must provide entrepreneurs and emerging technology-based companies business development assistance and financial assistance to spur growth.\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Advisory board\" means the board established under subdivision 10.\n(c) \"Commissioner\" means the commissioner of employment and economic development.\n(d) \"Department\" means the Department of Employment and Economic Development.\n(e) \"Entrepreneur\" means a Minnesota resident who is involved in establishing a business entity and secures resources directed to its growth while bearing the risk of loss.\n(f) \"Greater Minnesota\" means the area of Minnesota located outside of the metropolitan area as defined in section 473.121, subdivision 2.\n(g) \"Innovative technology and business\" means a new novel business model or product; a derivative product incorporating new elements into an existing product; a new use for a product; or a new process or method for the manufacture, use, or assessment of any product or activity, patentability, or scalability. Innovative technology or business model does not include locally based retail, lifestyle, or business services. The business must not be primarily engaged in real estate development, insurance, banking, lending, lobbying, political consulting, information technology consulting, wholesale or retail trade, leisure, hospitality, transportation, construction, ethanol production from corn, or professional services provided by attorneys, accountants, business consultants, physicians, or health care consultants.\n(h) \"Institution of higher education\" has the meaning given in section 136A.28, subdivision 6.\n(i) \"Minority group member\" means a United States citizen or lawful permanent resident who is Asian, Pacific Islander, Black, Hispanic, or Native American.\n(j) \"Research and development\" means any activity that is:\n(1) a systematic, intensive study directed toward greater knowledge or understanding of the subject studies;\n(2) a systematic study directed specifically toward applying new knowledge to meet a recognized need; or\n(3) a systematic application of knowledge toward the production of useful materials, devices, systems and methods, including design, development and improvement of prototypes and new processes to meet specific requirements.\n(k) \"Start-up\" means a business entity that has been in operation for less than ten years, has operations in Minnesota, and is in the development stage defined as devoting substantially all of its efforts to establishing a new business and either of the following conditions exists:\n(1) planned principal operations have not commenced; or\n(2) planned principal operations have commenced, but have raised less than $1,000,000 in equity financing.\n(l) \"Technology-related assistance\" means the application and utilization of technological-information and technologies to assist in the development and production of new technology-related products or services or to increase the productivity or otherwise enhance the production or delivery of existing products or services.\n(m) \"Trade association\" means a nonprofit membership organization organized to promote businesses and business conditions and having an election under Internal Revenue Code, section 501(c)(3) or 501(c)(6).\n(n) \"Veteran\" has the meaning given in section 197.447.\nThe commissioner, by and through Launch Minnesota, shall:\n(1) support innovation and initiatives designed to accelerate the growth of innovative technology and business start-ups in Minnesota;\n(2) in partnership with other organizations, offer classes and instructional sessions on how to start an innovative technology and business start-up;\n(3) promote activities for entrepreneurs and investors regarding the state's growing innovation economy;\n(4) hold events and meetings that gather key stakeholders in the state's innovation sector;\n(5) conduct outreach and education on innovation activities and related financial programs available from the department and other organizations, particularly for underserved communities;\n(6) interact and collaborate with statewide partners including but not limited to businesses, nonprofits, trade associations, and higher education institutions;\n(7) administer an advisory board to assist with direction, grant application review, program evaluation, report development, and partnerships;\n(8) accept grant applications under subdivisions 5, 6, and 7 and work with the advisory board to review and prioritize the applications and provide recommendations to the commissioner; and\n(9) perform other duties at the commissioner's discretion.\n(a) The director shall:\n(1) assist the commissioner and the advisory board in performing the duties of Launch Minnesota; and\n(2) comply with all state and federal program requirements, and all state and federal securities and tax laws and regulations.\n(b) Launch Minnesota may occupy and lease physical space in a private coworking facility that includes office space for staff and space for community engagement for training entrepreneurs. The physical space leased under this paragraph is exempt from the requirements in section 16B.24, subdivision 6.\n(c) At least three times per month, Launch Minnesota staff shall communicate with organizations in greater Minnesota that have received a grant under subdivision 7. To the extent possible, Launch Minnesota shall form partnerships with organizations located throughout the state.\n(d) Launch Minnesota must accept grant applications under this section and provide funding recommendations to the commissioner and the commissioner shall distribute grants based in part on the recommendations.\n(a) The commissioner shall establish the application form and procedures for grants.\n(b) Upon receiving recommendations from Launch Minnesota, the commissioner is responsible for evaluating all applications using evaluation criteria which shall be developed by Launch Minnesota in consultation with the advisory board.\n(c) For grants under subdivision 6, priority shall be given if the applicant is:\n(1) a business or entrepreneur located in greater Minnesota; or\n(2) a business owner, individual with a disability, or entrepreneur who is a woman, veteran, or minority group member.\n(d) For grants under subdivision 7, priority shall be given if the applicant is planning to serve:\n(1) businesses or entrepreneurs located in greater Minnesota; or\n(2) business owners, individuals with disabilities, or entrepreneurs who are women, veterans, or minority group members.\n(e) The department staff, and not Launch Minnesota staff, are responsible for awarding funding, disbursing funds, and monitoring grantee performance for all grants awarded under this section.\n(f) Grantees must provide matching funds by equal expenditures and grant payments must be provided on a reimbursement basis after review of submitted receipts by the department.\n(g) Grant applications must be accepted on a regular periodic basis by Launch Minnesota and must be reviewed by Launch Minnesota and the advisory board before being submitted to the commissioner with their recommendations.\n(a) The commissioner shall distribute innovation grants under this subdivision.\n(b) The commissioner shall provide a grant of up to $35,000 to an eligible business or entrepreneur for research and development expenses, direct business expenses, and the purchase of technical assistance or services from public higher education institutions and nonprofit entities. Research and development expenditures may include but are not limited to proof of concept activities, intellectual property protection, prototype designs and production, and commercial feasibility. Expenditures funded under this subdivision are not eligible for the research and development tax credit under section 290.068. Direct business expenses may include rent, equipment purchases, and supplier invoices. Taxes imposed by federal, state, or local government entities may not be reimbursed under this paragraph. Technical assistance or services must be purchased to assist in the development or commercialization of a product or service to be eligible. Each business or entrepreneur may receive only one grant under this paragraph.\n(c) The commissioner shall provide a grant of up to $35,000 in Phase 1 or $50,000 in Phase 2 to an eligible business or entrepreneur that, as a registered client of the Small Business Innovation Research (SBIR) program, has been awarded a first time Phase 1 or Phase 2 award pursuant to the SBIR or Small Business Technology Transfer (STTR) programs after July 1, 2022. Each business or entrepreneur may receive only one grant per biennium under this paragraph. Grants under this paragraph are not subject to the requirements of subdivision 2, paragraph (k).\n(a) The commissioner shall make entrepreneur education grants to institutions of higher education and other organizations to provide educational programming to entrepreneurs and provide outreach to and collaboration with businesses, federal and state agencies, institutions of higher education, trade associations, and other organizations working to advance innovative technology businesses throughout Minnesota.\n(b) Applications for entrepreneur education grants under this subdivision must be submitted to the commissioner and evaluated by department staff other than Launch Minnesota. The evaluation criteria must be developed by Launch Minnesota, in consultation with the advisory board, and the commissioner, and priority must be given to an applicant who demonstrates activity assisting business owners or entrepreneurs residing in greater Minnesota or who are women, veterans, or minority group members.\n(c) Department staff other than Launch Minnesota staff are responsible for awarding funding, disbursing funds, and monitoring grantee performance under this subdivision.\n(d) Grantees may use the grant funds to deliver the following services:\n(1) development and delivery to innovative technology businesses of industry specific or innovative product or process specific counseling on issues of business formation, market structure, market research and strategies, securing first mover advantage or overcoming barriers to entry, protecting intellectual property, and securing debt or equity capital. This counseling is to be delivered in a classroom setting or using distance media presentations;\n(2) outreach and education to businesses and organizations on the small business investment tax credit program under section 116J.8737, the MNvest crowd-funding program under section 80A.461, and other state programs that support innovative technology business creation especially in underserved communities;\n(3) collaboration with institutions of higher education, local organizations, federal and state agencies, the Small Business Development Center, and the Small Business Assistance Office to create and offer educational programming and ongoing counseling in greater Minnesota that is consistent with those services offered in the metropolitan area; and\n(4) events and meetings with other innovation-related organizations to inform entrepreneurs and potential investors about Minnesota's growing innovation economy.\nLaunch Minnesota shall annually report by December 31 to the chairs and ranking minority members of the committees of the house of representatives and senate having jurisdiction over economic development policy and finance. Each report shall include information on the work completed, including awards made by the department under this section and progress toward transferring the activities of Launch Minnesota to an entity outside of state government.\n(a) The commissioner shall establish an advisory board to advise the director regarding the activities of Launch Minnesota, make the recommendations described in this section, and develop and initiate a strategic plan for transferring some activities of Launch Minnesota to a new or existing public-private partnership or nonprofit organization outside of state government.\n(b) The advisory board shall consist of ten members and is governed by section 15.059. A minimum of seven members must be from the private sector representing business and at least two members but no more than three members must be from government and higher education. At least three of the members of the advisory board shall be from greater Minnesota and at least three members shall be minority group members. Appointees shall represent a range of interests, including entrepreneurs, large businesses, industry organizations, investors, and both public and private small business service providers.\n(c) The advisory board shall select a chair from its private sector members. The director shall provide administrative support to the committee.\n(d) The commissioner, or a designee, shall serve as an ex-officio, nonvoting member of the advisory board.",
	"repealed": false
}