{
	"id": "13C.001",
	"url": "https://www.revisor.mn.gov/statutes/cite/13C.001",
	"title": "13C.001 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Consumer\" means an individual.\n(a) \"Consumer report\" means a written, oral, or other communication of information by a consumer reporting agency bearing on a consumer's credit worthiness, credit standing, credit capacity, character, general reputation, personal characteristics, or mode of living that is used or expected to be used or collected in whole or in part for:\n(1) the purpose of serving as a factor in establishing the consumer's eligibility for credit or insurance to be used primarily for personal, family, or household purposes;\n(2) employment purposes; or\n(3) other purposes authorized under United States Code, title 15, section 1681b.\n(b) Consumer report does not include:\n(1) a report containing information solely as to transactions or experiences between the consumer and the person making the report;\n(2) an authorization or approval of a specific extension of credit directly or indirectly by the issuer of a credit card or similar device; or\n(3) a report in which a person who has been requested by a third party to make a specific extension of credit directly or indirectly to a consumer conveys a decision with respect to the request, if the third party advises the consumer of the name and address of the person to whom the request was made and the person makes the disclosures to the consumer required under United States Code, title 15, section 1681m.\n\"Consumer reporting agency\" means a person that, for monetary fees, dues, or on a cooperative nonprofit basis, regularly engages in whole or in part in the practice of assembling or evaluating consumer credit information or other information on consumers for the purpose of furnishing consumer reports to third parties.\n\"Employment purposes\" means evaluating a consumer for hiring, compensation, promotion, reassignment, retention, or with respect to other terms and conditions of employment.\n\"Investigative consumer report\" means a consumer report in which information on a consumer's character, general reputation, personal characteristics, or mode of living is obtained through personal interviews with neighbors, friends, or associates of the consumer or with others with whom the consumer is acquainted or who may have knowledge concerning the information. \"Investigative consumer report\" does not include specific factual information on a consumer's credit record obtained directly from a creditor of the consumer or from a consumer reporting agency when the information was obtained directly from a creditor of the consumer or from the consumer.",
	"repealed": false
}