{
	"id": "204D.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/204D.16",
	"title": "204D.16 SAMPLE GENERAL ELECTION BALLOTS; POSTING; PUBLICATION.",
	"text": "(a) At least 46 days before the state general election, the county auditor must post sample ballots for each precinct in the auditor's office for public inspection and transmit an electronic copy of these sample ballots to the secretary of state.\n(b) No earlier than 20 days and no later than ten days before the state general election the county auditor must cause a notice to voters to be published in at least one newspaper of general circulation in the county. The secretary of state, in collaboration with stakeholders, must design the notice to be published, including the format and content to be used. The secretary of state, in collaboration with stakeholders, may modify the content or format of the notice to be used by metropolitan counties, as defined in section 473.121, subdivision 4. When published, the notice must be sized so that it comprises a minimum of one full newspaper page.\n(c) The notice required by paragraph (b) must, at minimum, include the following:\n(1) a statement that the voter's official ballot will have the names of all candidates for the voter's precinct;\n(2) the web address where a voter may view the voter's sample ballot based on the voter's address;\n(3) the county's website where a list of sample ballots for each county precinct may be viewed;\n(4) how a voter may obtain a free copy of a sample ballot specific to the voter's address; and\n(5) contact information for the appropriate local election official, including a phone number and email address.\nThe notice may include information about contests on the ballot; names, offices, and party affiliation, if any, of candidates; polling place locations; poll hours; and absentee voting information.\n(d) For purposes of this section, \"stakeholder\" means local government election officials and representatives of the Minnesota Newspaper Association.",
	"repealed": false
}