{
	"id": "462.354",
	"url": "https://www.revisor.mn.gov/statutes/cite/462.354",
	"title": "462.354 ORGANIZATION FOR PLANNING.",
	"text": "A municipality may by charter or ordinance create a planning agency. A planning agency created by ordinance may be abolished by two-thirds vote of all the members of the governing body. The planning agency shall be advisory, except as other powers and duties are imposed on it by sections 462.351 to 462.364, by statute, by charter, or by ordinance consistent with the municipal charter. The planning agency may take the following alternative forms:\n(1) It may consist of a planning commission, which may or may not include municipal officials among its members. The planning commission may be provided with staff which may be a division of the administrative structure of the municipal government. The commission shall be advisory directly to the governing body.\n(2) It may consist of a planning department with a planning commission advisory to it and shall function as a department advisory to the governing body and the municipal administration. The planning department may be provided with an executive director and other staff as in the case of other municipal departments.\nThe governing body of any municipality adopting or having in effect a zoning ordinance or an official map shall provide by ordinance for a board of appeals and adjustments. The board shall have the powers set forth in sections 462.357, subdivision 6 and 462.359, subdivision 4. Except as otherwise provided by charter, the governing body may provide alternatively that there be a separate board of appeals and adjustments or that the governing body or the planning commission or a committee of the planning commission serve as the board of appeals and adjustments, and it may provide an appropriate name for the board. The board may be given such other duties as the governing body may direct.\nIn any municipality where the council does not serve as the board, the governing body may, except as otherwise provided by charter, provide that the decisions of the board on matters within its jurisdiction are final subject to judicial review or are final subject to appeal to the council and the right of later judicial review or are advisory to the council. Hearings by the board of appeals and adjustments shall be held within such time and upon such notice to interested parties as is provided in the ordinance establishing the board. The board shall within a reasonable time make its order deciding the matter and shall serve a copy of such order upon the appellant or petitioner by mail. Any party may appear at the hearing in person or by agent or attorney. Subject to such limitations as may be imposed by the governing body, the board may adopt rules for the conduct of proceedings before it. Such rules may include provisions for the giving of oaths to witnesses and the filing of written briefs by the parties. The board shall provide for a record of its proceedings which shall include the minutes of its meetings, its findings, and the action taken on each matter heard by it, including the final order. In any municipality in which the planning agency does not act as the board of adjustments and appeals, the board shall make no decision on an appeal or petition until the planning agency, if there is one, or a representative authorized by it has had reasonable opportunity, not to exceed 60 days, to review and report to the board of adjustments and appeals upon the appeal or petition.",
	"repealed": false
}