{
	"id": "297G.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/297G.20",
	"title": "297G.20 CONTRABAND.",
	"text": "The following are declared to be contraband and therefore subject to civil and criminal penalties and seizure under this chapter:\n(1) All distilled spirits, wine, and fermented malt beverages possessed or held with intent to sell without payment of an excise tax.\n(2) All distilled spirits, wine, and fermented malt beverages sold without payment of an excise tax.\n(3) All distilled spirits, wine, and fermented malt beverages transported without payment of an excise tax.\n(4) Devices including, but not limited to, motor vehicles, trailers, snowmobiles, airplanes, and boats used with the knowledge of the owner, or of a person operating with the consent of the owner, for the storage or transportation of distilled spirits, wine, and fermented malt beverages which are contraband under this subdivision.\nWhen distilled spirits, wine, and fermented malt beverages are being transported in the course of interstate commerce, or are in movement from either a public warehouse to a wholesaler upon orders from a manufacturer or wholesaler, or from one wholesaler to another, the distilled spirits, wine, and fermented malt beverages are not contraband, notwithstanding the provisions of subdivision 1.\nDistilled spirits, wine, fermented malt beverages, or other property made contraband by subdivision 1 may be seized by the commissioner of revenue or public safety and their authorized agents or by any sheriff or other police officer, with or without process, and are subject to forfeiture as provided in subdivision 4.\n(a) Within ten days after the seizure of alleged contraband, the person making the seizure shall serve by certified mail an inventory of the property seized on the person from whom the property was seized, if known, and on any person known or believed to have any right, title, interest, or lien in the property, at the last known address, and file a copy with both the commissioners of revenue and public safety. The notice must include an explanation of the right to demand a judicial forfeiture determination.\n(b) Within 60 days after the date of service of the inventory, which is the date of mailing, the person from whom the property was seized or any person claiming an interest in the property may file a demand for judicial determination of whether the property was lawfully subject to seizure and forfeiture. The demand must be in the form of a civil complaint and must be filed with the court administrator in the county in which the seizure occurred, together with proof of service of a copy of the complaint on the commissioner of revenue or public safety, and the standard filing fee for civil actions unless the petitioner has the right to sue in forma pauperis under section 563.01. If the value of the seized property or vehicle is $15,000 or less, the claimant may file an action in conciliation court for recovery of the property. If the value of the seized property is less than $500, the claimant does not have to pay the conciliation court filing fee.\n(c) The complaint must be captioned in the name of the claimant as plaintiff and the seized property as defendant, and must state with specificity the grounds on which the claimant alleges the property was improperly seized and the plaintiff's interest in the property seized. No responsive pleading is required of the commissioner of revenue or public safety and no court fees may be charged for either commissioner's appearance in the matter. The proceedings are governed by the Rules of Civil Procedure. Notwithstanding any law to the contrary, an action for the return of property seized under this section may not be maintained by or on behalf of any person who has been served with an inventory unless the person has complied with this subdivision. The court shall hear the action without a jury and determine the issues of fact and law involved.\n(d) If a judgment of forfeiture is entered, the seizing authority may, unless the judgment is stayed pending an appeal, either:\n(1) cause the forfeited property, other than a vehicle, to be destroyed; or\n(2) cause it to be sold at a public auction as provided by law.\nThe person making a sale, after deducting the expense of keeping the property, the fee for seizure, and the costs of the sale, shall pay all liens according to their priority, which are established as being bona fide and as existing without the lienor having any notice or knowledge that the property was being used or was intended to be used for or in connection with the violation. The balance of the proceeds must be paid 75 percent to the seizing authority for deposit as a supplement to its operating fund or similar fund for official use, and 25 percent to the county attorney or other prosecuting agency that handled the court proceeding, if there is one, for deposit as a supplement to its operating fund or similar fund for prosecutorial purposes. If there is no prosecuting authority involved in the forfeiture, the 25 percent of the proceeds otherwise designated for the prosecuting authority must be deposited into the general fund.\n(e) If no demand is made, the property seized is considered forfeited to the seizing authority by operation of law and may be disposed of by the seizing authority as provided for a judgment of forfeiture.\n[Repealed, 1Sp2001 c 5 art 18 s 11]",
	"repealed": false
}