{
	"id": "171.301",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.301",
	"title": "171.301 REINTEGRATION LICENSE.",
	"text": "(a) The commissioner may issue a reintegration driver's license to any person:\n(1) who is 18 years of age or older;\n(2) who has been released from a period of at least 180 consecutive days of confinement or incarceration in:\n(i) an adult correctional facility under the control of the commissioner of corrections or licensed by the commissioner of corrections under section 241.021;\n(ii) a federal correctional facility for adults; or\n(iii) an adult correctional facility operated under the control or supervision of any other state; and\n(3) whose license has been suspended or revoked under the circumstances listed in section 171.30, subdivision 1, paragraph (a), clauses (1) to (4), for a violation that occurred before the individual was incarcerated for the period described in clause (2).\n(b) If the person's driver's license or permit to drive has been revoked under section 169.792 or 169.797, the commissioner may only issue a reintegration driver's license to the person after the person has presented an insurance identification card, policy, or written statement indicating that the driver or owner has insurance coverage satisfactory to the commissioner.\n(c) If the person's driver's license or permit to drive has been suspended under section 171.186, the commissioner may only issue a reintegration driver's license to the person after the commissioner receives notice of a court order provided pursuant to section 518A.65, paragraph (e), showing that the person's driver's license or operating privileges should no longer be suspended.\n(d) If the person's driver's license has been revoked under section 171.17, subdivision 1, paragraph (a), clause (1), the commissioner may only issue a reintegration driver's license to the person after the person has completed the applicable revocation period.\n(e) The commissioner must not issue a reintegration driver's license:\n(1) to any person described in section 171.04, subdivision 1, clause (7), (8), (10), or (11);\n(2) to any person described in section 169A.55, subdivision 5;\n(3) if the person has committed a violation after the person was released from custody that results in the suspension, revocation, or cancellation of a driver's license, including suspension for nonpayment of child support or maintenance payments as described in section 171.186, subdivision 1; or\n(4) if the issuance would conflict with the requirements of the nonresident violator compact.\n(f) The commissioner must not issue a class A, class B, or class C reintegration driver's license.\n(a) Application for a reintegration driver's license must be made in the form and manner approved by the commissioner.\n(b) A person seeking a reintegration driver's license who was released from confinement or incarceration on or after April 1, 2024, must apply for the license within one year of release. A person seeking a reintegration driver's license who was released from confinement or incarceration before April 1, 2024, must apply for the license by April 1, 2025.\n(a) For a reintegration driver's license under this section:\n(1) the commissioner must not impose:\n(i) a fee, surcharge, or filing fee under section 171.06, subdivision 2;\n(ii) a reinstatement fee under sections 171.20, subdivision 4, and 171.29, subdivision 2; or\n(iii) an endorsement fee under section 171.06, subdivision 2a; and\n(2) a driver's license agent must not impose a filing fee under section 171.061, subdivision 4.\n(b) Issuance of a reintegration driver's license does not forgive or otherwise discharge any unpaid fees or fines.\n(a) The commissioner must cancel the reintegration driver's license of any person who commits a violation that would result in the suspension, revocation, or cancellation of a driver's license, including suspension for nonpayment of child support or maintenance payments as described in section 171.186, subdivision 1. The commissioner must not cancel a reintegration driver's license for payment of a fine or resolution of a criminal charge if the underlying incident occurred before the reintegration driver's license was issued, unless the conviction would have made the person ineligible to receive a reintegration driver' s license. Except as described in paragraph (b), a person whose reintegration driver's license is canceled under this subdivision may not be issued another reintegration driver's license and may not operate a motor vehicle for the remainder of the period of suspension or revocation or 30 days, whichever is longer.\n(b) A person whose reintegration driver's license is canceled under paragraph (a) may apply for a new reintegration driver's license if the person is incarcerated or confined for a period of at least 180 consecutive days after the cancellation and the person meets the conditions described in subdivision 1.\n(c) Nothing in this section prohibits cancellation and reinstatement of a reintegration driver's license for any other reason described in section 171.14 provided any factor making the person not eligible for a driver's license under section 171.04 occurred or became known to the commissioner after issuance of the reintegration driver's license.\nA reintegration driver's license expires 15 months from the date of issuance of the license. A reintegration driver's license may not be renewed.\n(a) Notwithstanding any statute or rule to the contrary, the commissioner must issue a REAL ID-compliant or noncompliant license to a person who possesses a reintegration driver's license if:\n(1) the person has possessed the reintegration driver's license for at least one full year;\n(2) the reintegration driver's license has not been canceled under subdivision 4 and has not expired under subdivision 5;\n(3) the person meets the application requirements under section 171.06, including payment of the applicable fees, surcharge, and filing fee under sections 171.06, subdivisions 2 and 2a, and 171.061, subdivision 4; and\n(4) issuance of the license does not conflict with the requirements of the nonresident violator compact.\n(b) The commissioner must forgive any outstanding balance due on a reinstatement fee or surcharge under sections 171.20, subdivision 4, and 171.29, subdivision 2, for a person who is eligible and applies for a license under paragraph (a).",
	"repealed": false
}