{
	"id": "17A.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/17A.05",
	"title": "17A.05 AMOUNT OF BONDS.",
	"text": "The amount of each livestock market agency bond filed with the commissioner shall be not less than $10,000 or such larger amount as required, based on the commissioner's consideration of the principal's financial statement, the volume of business reported, or any other factor the commissioner deems pertinent for the protection of the public. Each such bond shall be executed on a Packers and Stockyards Act form and shall contain the condition clause applicable when the principal sells on commission. A bond equivalent executed in accordance with the Packers and Stockyards Act, 1921, as amended, (United States Code, title 7, section 181 et seq.) is acceptable.\nThe amount of each livestock dealer bond filed with the commissioner shall be not less than $10,000 or such larger amount as required, based on the commissioner's consideration of the principal's financial statement, the volume of business reported, or any other factor the commissioner deems pertinent for the protection of the public. Each such bond shall contain the condition clause applicable when the principal buys on commission or as a dealer. A livestock dealer's bond shall be executed on a form furnished by the commissioner or in accordance with the Packers and Stockyards Act, 1921, as amended (United States Code, title 7, section 181 et seq.).\nWhen a bond is executed on a state form furnished by the commissioner, the bond shall be for the protection of both the buyer and the seller named in the transaction when the principal fails to pay when due for livestock purchased or sold for the principal's own account or the account of others and shall be limited to the protection of claimants whose residence or principal place of livestock business is in the state of Minnesota at the time of the transaction. If the bond is filed on a form in accordance with the Packers and Stockyards Act, the bond shall cover claimants regardless of place of residence.",
	"repealed": false
}