{
	"id": "207A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/207A.15",
	"title": "207A.15 PRESIDENTIAL NOMINATION PRIMARY ELECTION EXPENSES; LOCAL REIMBURSEMENT.",
	"text": "(a) A presidential nomination primary elections account is created in the special revenue fund.\n(b) No later than September 1 of the year preceding a presidential election year, the secretary of state shall certify to the commissioner of management and budget the estimated state and local cost of administering the presidential nomination primary election. The secretary of state may make supplemental certifications to the commissioner of management and budget if new information indicates that the actual costs of conducting the election will exceed the secretary's initial estimate.\n(c) Within 15 days of a certification under paragraph (b), the commissioner of management and budget must transfer an amount equal to the certification from the general fund to the presidential nomination primary elections account. The funds in the presidential nomination primary elections account are appropriated to the secretary of state for:\n(1) state costs associated with administering the presidential nomination primary election; and\n(2) making the reimbursements required by subdivision 2.\nThe commissioner of management and budget must transfer back to the general fund any funds remaining in the presidential nomination primary elections account 120 days after the results of a presidential nomination primary election have been certified by the State Canvassing Board.\n(a) The secretary of state must reimburse the counties and municipalities for expenses incurred in the administration of the presidential nomination primary from money contained in the presidential nomination primary elections account. The following expenses are eligible for reimbursement: preparation and printing of ballots; postage for absentee ballots; publication of notice to voters pursuant to section 204D.16; preparation of polling places in an amount not to exceed $150 per polling place; preparation of electronic voting systems in an amount not to exceed $100 per precinct; compensation for temporary staff or overtime payments; salaries of election judges; compensation of county canvassing board members; and other expenses as approved by the secretary of state.\n(b) Within 60 days after the results of a presidential nomination primary are certified by the State Canvassing Board, the county auditor must submit a request for payment of the costs incurred by the county for conducting the presidential nomination primary, and the municipal clerk must submit a request for payment of the costs incurred by the municipality for conducting the presidential nomination primary. The request for payment must be submitted to the secretary of state, and must be accompanied by an itemized description of actual county or municipal expenditures, including copies of invoices. In addition, the county auditor or municipal clerk must certify that the request for reimbursement is based on actual costs incurred by the county or municipality in the presidential nomination primary.\n(c) The secretary of state must provide each county and municipality with the appropriate forms for requesting payment and certifying expenses under this subdivision. The secretary of state must not reimburse expenses unless the request for payment and certification of costs has been submitted as provided in this subdivision. The secretary of state must complete the issuance of reimbursements to the counties and municipalities no later than 90 days after the results of the presidential nomination primary have been certified by the State Canvassing Board.",
	"repealed": false
}