{
	"id": "270.91",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.91",
	"title": "270.91 CONTAMINATION TAX.",
	"text": "A tax is annually imposed on the contamination value of taxable real property in this state.\nUnless the rates under subdivision 3 or 4 apply, the tax imposed under this section equals 100 percent of the classification rate for the property under section 273.13, multiplied by the contamination value of the property.\nIf neither the owner nor the operator of the taxable real property, in the assessment year, is a responsible person under chapter 115B or a responsible party under chapter 18D for the presence of contaminants on the property, unless subdivision 4 applies, the tax imposed under this section equals 25 percent of the classification rate for the property under section 273.13, multiplied by the contamination value of the property. A determination under section 115B.177 or other similar determination by the commissioner of the Pollution Control Agency or by the commissioner of agriculture for a release of agricultural chemicals is dispositive of whether the owner or operator is not a responsible person under chapter 18D or 115B for purposes of this section. To qualify under this subdivision, the property owner must provide the assessor with a copy of the determination by July 1 of the assessment year.\n(a) The tax imposed under this subdivision applies for the first assessment year that begins after one of the following occurs:\n(1) a response action plan for the property has been approved by the commissioner of the Pollution Control Agency or by the commissioner of agriculture for an agricultural chemical release or incident subject to chapter 18D and work under the plan has begun; or\n(2) the contaminants are asbestos and the property owner has in place an abatement plan for enclosure, removal, or encapsulation of the asbestos. To qualify under this clause, the property owner must (i) have entered into a binding contract with a licensed contractor for completion of the work, or (ii) have obtained a license from the commissioner of health and begun the work. An abatement plan must provide for completion of the work within a reasonable time period, as determined by the assessors.\n(b) To qualify under paragraph (a), the property owner must provide the assessor with a copy of: (1) the approved response action plan; or (2) a copy of the asbestos abatement plan and contract for completion of the work or the owner's license to perform the work. The property owner also must file with the assessor an affidavit indicating when work under the response action plan or asbestos abatement plan began.\n(c) The tax imposed under this subdivision equals 50 percent of the classification rate for the property under section 273.13, multiplied by the contamination value of the property, unless paragraph (d) applies.\n(d) The tax imposed under this subdivision equals 12.5 percent of the classification rate for the property under section 273.13, multiplied by the contamination value of the property, if one of the following conditions is satisfied:\n(1) the contaminants are subject to chapter 115B and neither the owner nor the operator of the taxable real property in the assessment year is a responsible person under chapter 115B;\n(2) the contaminants are subject to chapter 18D and neither the owner nor the operator of the taxable real property in the assessment year is a responsible party under chapter 18D.",
	"repealed": false
}