{
	"id": "18C.541",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.541",
	"title": "18C.541 LICENSE.",
	"text": "Before a person may sell, offer for sale, or dispose of in this state agricultural liming material to be used for the correction of soil acidity or soil fertility, the distributor and producer must obtain a license by filing with the commissioner an acceptable application for a license to sell, together with the license fee, on or before January 1 of each year. The application must state the name of the producer or distributor, the location of the principal office of the producer or distributor, the number and location of each source of production covered by the license, and the name, brand, or trademark under which the agricultural liming material will be sold.\nA license is effective until January 1 following the date of its issuance or approval. A license may not be transferred from one person to another.\nThe license must be posted in a conspicuous place in each location where agricultural liming materials are sold.\nThe commissioner may require a person applying for a license to sell or produce an agricultural liming material for use in this state to submit authentic experimental evidence or university research data to substantiate the claims made for the product. As evidence to substantiate claims, the commissioner may rely on experimental data, evaluations, or advice furnished by experts at the University of Minnesota and may accept or reject additional sources of evidence in evaluating the agricultural liming material. In all cases, the experimental evidence must relate to conditions in this state for which use of the product is intended. The commissioner may also require evidence of value of the product when used as directed or recommended.\nIf the commissioner determines that the evidence submitted under subdivision 4 does not substantiate the product's usefulness in this state, the commissioner may require the applicant to submit samples, conduct tests, or submit additional information, including conditions affecting performance, to evaluate its performance and usefulness.\nIndustrial by-product lime material that is transferred between parties without compensation, except for a fair and reasonable transportation charge, is exempt from fees for licensing and inspection.",
	"repealed": false
}