{
	"id": "122A.187",
	"url": "https://www.revisor.mn.gov/statutes/cite/122A.187",
	"title": "122A.187 EXPIRATION AND RENEWAL.",
	"text": "Each license issued under this chapter must bear the date of issue and the name of the state-approved teacher training provider or alternative teaching program, as applicable. Licenses must expire and be renewed according to rules adopted by the Professional Educator Licensing and Standards Board or the Board of School Administrators. The Board of School Administrators shall establish requirements for renewing the licenses of supervisory personnel except athletic coaches.\nThe Professional Educator Licensing and Standards Board must receive recommendations from local committees as established by the board for the renewal of teaching licenses.\n(a) Applicants for license renewal for a Tier 3 or Tier 4 license under sections 122A.183 and 122A.184, respectively, who have been employed as a teacher during the renewal period of the expiring license, as a condition of license renewal, must present to their local continuing education and relicensure committee or other local relicensure committee evidence of work that demonstrates professional reflection and growth in best teaching practices, including among other things, cultural competence in accordance with section 120B.30, subdivision 8, and practices in meeting the varied needs of English learners, from young children to adults under section 124D.59, subdivisions 2 and 2a. A teacher may satisfy the requirements of this paragraph by submitting the teacher's most recent summative evaluation or improvement plan under section 122A.40, subdivision 8, or 122A.41, subdivision 5.\n(b) The Professional Educator Licensing and Standards Board must ensure that its teacher relicensing requirements include paragraph (a).\nThe Professional Educator Licensing and Standards Board must adopt rules that require all licensed teachers who are renewing a Tier 3 or Tier 4 teaching license under sections 122A.183 and 122A.184, respectively, to include in the renewal requirements further preparation in the areas of using positive behavior interventions and in accommodating, modifying, and adapting curricula, materials, and strategies to appropriately meet the needs of individual students and ensure adequate progress toward the state's graduation rule.\nThe Professional Educator Licensing and Standards Board must adopt rules that require all licensed teachers who are renewing a Tier 3 or Tier 4 teaching license under sections 122A.183 and 122A.184, respectively, to include in the renewal requirements further reading preparation, consistent with sections 120B.118 to 120B.124. The rules do not take effect until they are approved by law. Teachers who do not provide direct instruction including, at least, counselors, school psychologists, school nurses, school social workers, audiovisual directors and coordinators, and recreation personnel are exempt from this section.\nThe Professional Educator Licensing and Standards Board must adopt rules that require all licensed teachers renewing a teaching license under sections 122A.181 to 122A.184 to include in the renewal requirements at least one hour of suicide prevention best practices training in each licensure renewal period based on nationally recognized evidence-based programs and practices, among the continuing education credits required to renew a license under this subdivision. Initial training must include understanding the key warning signs of early-onset mental illness in children and adolescents, and during subsequent licensure renewal periods, training must include a more in-depth understanding of students' mental illness trauma, accommodations for students' mental illness, parents' roles in addressing students' mental illness, Fetal Alcohol Spectrum Disorders, autism, the requirements of section 125A.0942 governing restrictive procedures, and de-escalation methods, among other similar topics.\nThe Professional Educator Licensing and Standards Board must adopt rules that require all licensed teachers renewing their license under sections 122A.181 to 122A.184 to include in the renewal requirements professional development in the cultural heritage and contemporary contributions of American Indians, with particular emphasis on Minnesota Tribal Nations.",
	"repealed": false
}