{
	"id": "270C.445",
	"url": "https://www.revisor.mn.gov/statutes/cite/270C.445",
	"title": "270C.445 TAX PREPARATION SERVICES.",
	"text": "[Repealed, 1Sp2017 c 1 art 22 s 22]\n(a) For purposes of this section and sections 270C.4451 to 270C.447, the following terms have the meanings given.\n(b) \"Advertise\" means to solicit business through any means or medium.\n(c) \"Client\" means a person for whom a tax preparer performs or agrees to perform tax preparation services.\n(d) \"Facilitate\" means to individually or in conjunction or cooperation with another person:\n(1) accept an application for a refund anticipation loan;\n(2) pay to a client the proceeds, through direct deposit, a negotiable instrument, or any other means, of a refund anticipation loan; or\n(3) offer, arrange, process, provide, or in any other manner act to allow the making of, a refund anticipation loan.\n(e) \"Refund anticipation check\" means a negotiable instrument provided to a client by the tax preparer or another person, which is issued from the proceeds of a taxpayer's federal or state income tax refund or both and represents the net of the refund minus the tax preparation fee and any other fees. A refund anticipation check includes a refund transfer.\n(f) \"Refund anticipation loan\" means a loan or any other extension of credit, whether provided by the tax preparer or another entity such as a financial institution, in anticipation of, and whose payment is secured by, a client's federal or state income tax refund or both.\n(g) \"Tax preparation services\" means services provided for compensation to a client to:\n(1) assist with preparing or filing a return;\n(2) assume final responsibility for completed work on a return on which preliminary work has been done by another;\n(3) sign or include on a return the preparer tax identification number required under section 6109(a)(4) of the Internal Revenue Code; or\n(4) facilitate the provision of a refund anticipation loan or a refund anticipation check.\n(h) \"Tax preparer\" or \"preparer\" means a person providing tax preparation services except:\n(1) an employee who prepares their employer's return;\n(2) any fiduciary, or the regular employees of a fiduciary, while acting on behalf of the fiduciary estate, testator, trustor, grantor, or beneficiaries of them;\n(3) nonprofit organizations providing tax preparation services under the Internal Revenue Service Volunteer Income Tax Assistance Program or Tax Counseling for the Elderly Program;\n(4) a person who merely furnishes typing, reproducing, or other mechanical assistance;\n(5) a third-party bulk filer as defined in section 290.92, subdivision 30, that is currently registered with the commissioner; and\n(6) a certified service provider as defined in section 297A.995, subdivision 2, paragraph (c), that provides all of the sales tax functions for a retailer not maintaining a place of business in this state as described in section 297A.66.\n(i) Except as otherwise provided, \"return\" means:\n(1) a return as defined in section 270C.01, subdivision 8;\n(2) a claim for refund of an overpayment;\n(3) a claim filed pursuant to chapter 290A; and\n(4) a claim for a credit filed under section 290.0677, subdivision 1.\nNo tax preparer shall:\n(1) without good cause fail to promptly, diligently, and without unreasonable delay complete a client's return;\n(2) obtain the signature of a client to a return or authorizing document that contains blank spaces to be filled in after it has been signed;\n(3) fail to sign a client's return when compensation for services rendered has been made;\n(4) fail to provide on a client's return the preparer tax identification number when required under section 6109(a)(4) of the Internal Revenue Code or section 289A.60, subdivision 28;\n(5) fail or refuse to give a client a copy of any document requiring the client's signature within a reasonable time after the client signs the document;\n(6) fail to retain for at least four years a copy of a client's returns;\n(7) fail to maintain a confidential relationship with clients or former clients;\n(8) fail to take commercially reasonable measures to safeguard a client's nonpublic personal information;\n(9) make, authorize, publish, disseminate, circulate, or cause to make, either directly or indirectly, any false, deceptive, or misleading statement or representation relating to or in connection with the offering or provision of tax preparation services;\n(10) require a client to enter into a loan arrangement in order to complete a client's return;\n(11) claim credits or deductions on a client's return for which the tax preparer knows or reasonably should know the client does not qualify;\n(12) report a household income on a client's claim filed under chapter 290A that the tax preparer knows or reasonably should know is not accurate;\n(13) engage in any conduct that is subject to a penalty under section 289A.60, subdivision 13, 20, 20a, 26, or 28;\n(14) whether or not acting as a taxpayer representative, fail to conform to the standards of conduct required by Minnesota Rules, part 8052.0300, subpart 4;\n(15) whether or not acting as a taxpayer representative, engage in any conduct that is incompetent conduct under Minnesota Rules, part 8052.0300, subpart 5;\n(16) whether or not acting as a taxpayer representative, engage in any conduct that is disreputable conduct under Minnesota Rules, part 8052.0300, subpart 6;\n(17) charge, offer to accept, or accept a fee based upon a percentage of an anticipated refund for tax preparation services;\n(18) under any circumstances, withhold or fail to return to a client a document provided by the client for use in preparing the client's return;\n(19) take control or ownership of a client's refund by any means, including:\n(i) directly or indirectly endorsing or otherwise negotiating a check or other refund instrument, including an electronic version of a check;\n(ii) directing an electronic or direct deposit of the refund into an account unless the client's name is on the account; and\n(iii) establishing or using an account in the preparer's name to receive a client's refund through a direct deposit or any other instrument unless the client's name is also on the account, except that a taxpayer may assign the portion of a refund representing the Minnesota education credit available under section 290.0674 to a bank account without the client's name, as provided under section 290.0679;\n(20) fail to act in the best interests of the client;\n(21) fail to safeguard and account for any money handled for the client;\n(22) fail to disclose all material facts of which the preparer has knowledge which might reasonably affect the client's rights and interests;\n(23) violate any provision of section 332.37;\n(24) include any of the following in any document provided or signed in connection with the provision of tax preparation services:\n(i) a hold harmless clause;\n(ii) a confession of judgment or a power of attorney to confess judgment against the client or appear as the client in any judicial proceeding;\n(iii) a waiver of the right to a jury trial, if applicable, in any action brought by or against a debtor;\n(iv) an assignment of or an order for payment of wages or other compensation for services;\n(v) a provision in which the client agrees not to assert any claim or defense otherwise available;\n(vi) a waiver of any provision of this section or a release of any obligation required to be performed on the part of the tax preparer; or\n(vii) a waiver of the right to injunctive, declaratory, or other equitable relief or relief on a class basis; or\n(25) if making, providing, or facilitating a refund anticipation loan, fail to provide all disclosures required by the federal Truth in Lending Act, United States Code, title 15, in a form that may be retained by the client.\n[Renumbered 270C.4451, subdivision 1]\n[Renumbered 270C.4451, subd 2]\n[Renumbered 270C.4451, subd 3]\n[Renumbered 270C.4451, subd 4]\nA tax preparer must provide an itemized statement of the charges for services, at least separately stating the charges for:\n(1) return preparation;\n(2) providing or facilitating a refund anticipation loan; and\n(3) each fee associated with the provision of a refund anticipation check.\nA tax preparer must give written notice of the option to contribute to the nongame wildlife management account in section 290.431 to corporate clients that file an income tax return and to individual clients who file an income tax return or claim under chapter 290A. This notification must be included with information sent to the client at the same time as the preliminary worksheets or other documents used in preparing the client's return and must include a line for displaying contributions.\n[Renumbered 270C.4451, subd 5]\n(a) The commissioner may impose an administrative penalty of not more than $1,000 per violation of subdivision 3 or 5, or section 270C.4451, provided that a penalty may not be imposed for any conduct for which a tax preparer penalty is imposed under section 289A.60, subdivision 13. The commissioner may terminate a tax preparer's authority to transmit returns electronically to the state, if the commissioner determines the tax preparer engaged in a pattern and practice of violating this section. Imposition of a penalty under this paragraph is subject to the contested case procedure under chapter 14. The commissioner shall collect the penalty in the same manner as the income tax. There is no right to make a claim for refund under section 289A.50 of the penalty imposed under this paragraph. Penalties imposed under this paragraph are public data.\n(b) In addition to the penalty under paragraph (a), if the commissioner determines that a tax preparer has violated subdivision 3 or 5, or section 270C.4451, the commissioner may issue an administrative order to the tax preparer requiring the tax preparer to cease and desist from committing the violation. The administrative order may include an administrative penalty provided in paragraph (a).\n(c) If the commissioner issues an administrative order under paragraph (b), the commissioner must send the order to the tax preparer addressed to the last known address of the tax preparer.\n(d) A cease and desist order under paragraph (b) must:\n(1) describe the act, conduct, or practice committed and include a reference to the law that the act, conduct, or practice violates; and\n(2) provide notice that the tax preparer may request a hearing as provided in this subdivision.\n(e) Within 30 days after the commissioner issues an administrative order under paragraph (b), the tax preparer may request a hearing to review the commissioner's action. The request for hearing must be made in writing and must be served on the commissioner at the address specified in the order. The hearing request must specifically state the reasons for seeking review of the order. The date on which a request for hearing is served by mail is the postmark date on the envelope in which the request for hearing is mailed.\n(f) If a tax preparer does not timely request a hearing regarding an administrative order issued under paragraph (b), the order becomes a final order of the commissioner and is not subject to review by any court or agency.\n(g) If a tax preparer timely requests a hearing regarding an administrative order issued under paragraph (b), the hearing must be commenced within ten days after the commissioner receives the request for a hearing.\n(h) A hearing timely requested under paragraph (e) is subject to the contested case procedure under chapter 14, as modified by this subdivision. The administrative law judge must issue a report containing findings of fact, conclusions of law, and a recommended order within ten days after the completion of the hearing, the receipt of late-filed exhibits, or the submission of written arguments, whichever is later.\n(i) Within five days of the date of the administrative law judge's report issued under paragraph (h), any party aggrieved by the administrative law judge's report may submit written exceptions and arguments to the commissioner. Within 15 days after receiving the administrative law judge's report, the commissioner must issue an order vacating, modifying, or making final the administrative order.\n(j) The commissioner and the tax preparer requesting a hearing may by agreement lengthen any time periods prescribed in paragraphs (g) to (i).\n(k) An administrative order issued under paragraph (b) is in effect until it is modified or vacated by the commissioner or an appellate court. The administrative hearing provided by paragraphs (e) to (i) and any appellate judicial review as provided in chapter 14 constitute the exclusive remedy for a tax preparer aggrieved by the order.\n(l) The commissioner may impose an administrative penalty, in addition to the penalty under paragraph (a), up to $5,000 per violation of a cease and desist order issued under paragraph (b). Imposition of a penalty under this paragraph is subject to the contested case procedure under chapter 14. Within 30 days after the commissioner imposes a penalty under this paragraph, the tax preparer assessed the penalty may request a hearing to review the penalty order. The request for hearing must be made in writing and must be served on the commissioner at the address specified in the order. The hearing request must specifically state the reasons for seeking review of the order. The cease and desist order issued under paragraph (b) is not subject to review in a proceeding to challenge the penalty order under this paragraph. The date on which a request for hearing is served by mail is the postmark date on the envelope in which the request for hearing is mailed. If the tax preparer does not timely request a hearing, the penalty order becomes a final order of the commissioner and is not subject to review by any court or agency. A penalty imposed by the commissioner under this paragraph may be collected and enforced by the commissioner as an income tax liability. There is no right to make a claim for refund under section 289A.50 of the penalty imposed under this paragraph. A penalty imposed under this paragraph is public data.\n(m) If a tax preparer violates a cease and desist order issued under paragraph (b), the commissioner may terminate the tax preparer's authority to transmit returns electronically to the state. Termination under this paragraph is public data.\n(n) A cease and desist order issued under paragraph (b) is public data when it is a final order.\n(o) Notwithstanding any other law, the commissioner may impose a penalty or take other action under this subdivision against a tax preparer, with respect to a return, within the period to assess tax on that return as provided by sections 289A.38 to 289A.382.\n(p) Notwithstanding any other law, the imposition of a penalty or any other action against a tax preparer under this subdivision, other than with respect to a return, must be taken by the commissioner within five years of the violation of statute.\nThe State Board of Accountancy shall refer to the commissioner complaints it receives about tax preparers who are not subject to the jurisdiction of the State Board of Accountancy and who are alleged to have violated the provisions of this section, except subdivision 5a, or section 270C.4451.\nThe Lawyers Professional Responsibility Board may refer to the commissioner complaints it receives about tax preparers who are not subject to its jurisdiction and who are alleged to have violated the provisions of this section, except subdivision 5a, or section 270C.4451.\nThe commissioner shall refer information and complaints about tax preparers who are alleged to have violated the provisions of this section, except subdivision 5a, or section 270C.4451, to:\n(1) the State Board of Accountancy, if the tax preparer is under its jurisdiction; and\n(2) the Lawyers Professional Responsibility Board, if the tax preparer is under its jurisdiction.\nInformation exchanged on individuals under subdivisions 6a to 6c are private data under section 13.02, subdivision 12, until such time as a penalty is imposed as provided in section 326A.08 or by the Lawyers Professional Responsibility Board.\n(a) Any violation of this section or section 270C.4451 is an unfair, deceptive, and unlawful trade practice within the meaning of section 8.31. An action taken under this section is in the public interest.\n(b) A client may bring a civil action seeking redress for a violation of this section in the conciliation or the district court of the county in which unlawful action is alleged to have been committed or where the respondent resides or has a principal place of business.\n(c) A court finding for the plaintiff must award:\n(1) actual damages;\n(2) incidental and consequential damages;\n(3) statutory damages of twice the sum of: (i) the tax preparation fees; and (ii) if the plaintiff violated section 270C.4451, subdivision 1, 2, or 5, all interest and fees for a refund anticipation loan;\n(4) reasonable attorney fees;\n(5) court costs; and\n(6) any other equitable relief as the court considers appropriate.\n(a) Except as provided in paragraph (b), the provisions of subdivisions 3; 5; 5a; 6, paragraphs (a) to (n); and 7, do not apply to:\n(1) an attorney admitted to practice under section 481.01;\n(2) a registered accounting practitioner, a registered accounting practitioner firm, a certified public accountant, or a certified public accountant firm, licensed in accordance with chapter 326A;\n(3) an enrolled agent who has passed the special enrollment examination administered by the Internal Revenue Service;\n(4) a person who provides, or assists in providing, tax preparation services within the scope of duties as an employee under the direction or supervision of a person who is exempt under this subdivision; or\n(5) a person acting as a supervisor to a tax preparer who is exempt under this subdivision.\n(b) The provisions of subdivisions 3; 6, paragraphs (a) to (n); and 7, apply to a tax preparer who would otherwise be exempt under paragraph (a) if the tax preparer has:\n(1) had a professional license suspended or revoked for cause, not including a failure to pay a professional licensing fee, by any authority of any state, territory, or possession of the United States, including a commonwealth, or the District of Columbia, any federal court of record, or any federal agency, body, or board;\n(2) irrespective of whether an appeal has been taken, been convicted of any crime involving dishonesty or breach of trust;\n(3) been censured, suspended, or disbarred under United States Treasury Department Circular 230;\n(4) been sanctioned by a court of competent jurisdiction, whether in a civil or criminal proceeding, including suits for injunctive relief, relating to any taxpayer's tax liability or the tax preparer's own tax liability, for:\n(i) instituting or maintaining proceedings primarily for delay;\n(ii) advancing frivolous or groundless arguments; or\n(iii) failing to pursue available administrative remedies; or\n(5) demonstrated a pattern of willful disreputable conduct by:\n(i) failing to file a return that the tax preparer was required to file annually for two of the three immediately preceding tax periods; or\n(ii) failing to file a return that the tax preparer was required to file more frequently than annually for three of the six immediately preceding tax periods.\nThe powers and authority granted in this section are in addition to all other powers of the commissioner. The use of the powers granted in this section does not preclude the use of any other power or authority of the commissioner.",
	"repealed": false
}