{
	"id": "297F.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/297F.04",
	"title": "297F.04 LICENSE SUSPENSION, CANCELLATION, NONRENEWAL, OR REVOCATION.",
	"text": "The commissioner may revoke or suspend the license or licenses of any distributor or subjobber for violation of this chapter, any other act applicable to the sale of cigarettes or tobacco products, or any rule promulgated by the commissioner, in furtherance of this chapter.\nThe commissioner must not issue or renew a license under this chapter, and may revoke a license under this chapter, if the applicant or licensee:\n(1) owes $500 or more in delinquent taxes as defined in section 270C.72, subdivision 2;\n(2) after demand, has not filed tax returns required by the commissioner;\n(3) had a cigarette or tobacco license revoked by the commissioner within the past two years;\n(4) had a sales and use tax permit revoked by the commissioner within the past two years; or\n(5) has been convicted of a crime involving cigarettes or tobacco products, including but not limited to: selling stolen cigarettes or tobacco products, receiving stolen cigarettes or tobacco products, or involvement in the smuggling of cigarettes or tobacco products.\nThe commissioner may cancel a license or not renew a license if one of the following conditions occurs:\n(1) the license holder has not filed a cigarette or tobacco products tax return for at least one year;\n(2) the license holder has not reported any cigarette or tobacco products tax liability on the license holder's returns for at least one year; or\n(3) the license holder requests cancellation of the license.\nNo license may be revoked or suspended under this chapter, and no application for a license may be denied under this chapter, except after 20 days' notice. In that notice the commissioner shall specify the allegations against the licensee or applicant, and provide the licensee or applicant the right to request in writing within 20 days a contested case hearing as provided in chapter 14.\nIf a written request for a hearing is received by the Department of Revenue within 20 days of the date of the initial notice, the hearing must be held within 45 days after referral to the Office of Administrative Hearings, and no earlier than 20 days after notice to the licensee or applicant of the hearing time and place. A license is revoked or suspended, and an application is denied, when the commissioner serves notice of revocation, suspension, or denial after 20 days have passed following the initial notice under this paragraph without a request for hearing being made, or if a hearing is held, after the commissioner serves an order of revocation, suspension, or denial under section 14.62, subdivision 1. All notices under this paragraph may be served personally or by mail.",
	"repealed": false
}