{
	"id": "144.699",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.699",
	"title": "144.699 CONTINUING ANALYSIS.",
	"text": "The commissioner of health may:\n(1) undertake analyses and studies relating to acute care costs and to the financial status of any hospital or outpatient surgical center subject to the provisions of sections 144.695 to 144.703; and\n(2) publish and disseminate the information relating to acute care costs.\nThe commissioner of health shall:\n(1) encourage hospitals, outpatient surgical centers, home care providers, and professionals regulated by the health-related licensing boards as defined in section 214.01, subdivision 2, and by the commissioner of health under section 214.13, to publish prices for procedures and services that are representative of the diagnoses and conditions for which citizens of this state seek treatment; and\n(2) analyze and disseminate available price information and analyses so as to foster the development of price competition among hospitals, outpatient surgical centers, home care providers, and health professionals.\nUpon request of the attorney general, the commissioner of health shall make available to the attorney general all requested information provided under sections 144.695 to 144.703 in order to assist the attorney general in discharging the responsibilities of section 8.31.\nThe commissioner of health shall prepare and file summaries and compilations or other supplementary reports based on the information filed with or made available to the commissioner of health, which reports will advance the purposes of sections 144.695 to 144.703.\n(a) For each hospital reporting health care cost information under section 144.698 or 144.702, the commissioner shall report annually on the hospital's community benefit and community care, including detailed information on each component of those costs as defined in this subdivision. The information shall be reported in terms of total dollars and as a percentage of total operating costs for each hospital.\n(b) For purposes of this subdivision, \"community benefit\" means the costs of community care, underpayment for services provided under state health care programs, research costs, community health services costs, financial and in-kind contributions, costs of community building activities, costs of community benefit operations, education costs, and the cost of operating subsidized services. The cost of bad debts and underpayment for Medicare services are not included in the calculation of community benefit.\n(c) For purposes of this subdivision, \"community care\" means the costs for medical care that a hospital has determined is charity care as defined under Minnesota Rules, part 4650.0115, or for which the hospital determines after billing for the services that there is a demonstrated inability to pay. Any costs forgiven under a hospital's community care plan or under section 62J.83 may be counted in the hospital's calculation of community care. Bad debt expenses and discounted charges available to the uninsured shall not be included in the calculation of community care. The amount of community care is the value of costs incurred and not the charges made for services.\n(d) For purposes of this subdivision, \"underpayment for services provided under state health care programs\" means the difference between hospital costs and public program payments.",
	"repealed": false
}