{
	"id": "136G.05",
	"url": "https://www.revisor.mn.gov/statutes/cite/136G.05",
	"title": "136G.05 MINNESOTA OFFICE OF HIGHER EDUCATION.",
	"text": "(a) The commissioner shall establish the rules, terms, and conditions for the plan, subject to the requirements of sections 136G.01 to 136G.14.\n(b) The commissioner shall prescribe the application forms, procedures, and other requirements that apply to the plan.\nThe office must establish the plan and the plan must be operated as an accounts-type plan that permits persons to save for qualified higher education expenses. A separate account must be maintained for each beneficiary for whom contributions are made.\nIn designing and establishing the plan's requirements and in negotiating or entering into contracts with third parties under subdivision 8, the commissioner shall consult with the executive director. The commissioner and the executive director shall establish an annual fee, equal to a percentage of the average daily net assets of the plan, to be imposed on participants to recover the costs of administration, record keeping, and investment management as provided in subdivision 9 and section 136G.07, subdivision 4.\nThe commissioner shall ensure that the plan meets the requirements for a qualified tuition program under section 529(b)(1)(A)(ii) of the Internal Revenue Code. The commissioner may request a private letter ruling or rulings from the Internal Revenue Service or take any other steps to ensure that the plan qualifies under section 529 of the Internal Revenue Code or other relevant provisions of federal law.\nThere cannot be a taxable distribution of matching grant funds and any refund of matching grants must be returned to the office.\nMS 2018 [Repealed, 2020 c 109 art 2 s 17]\nThe commissioner shall make parents and other interested individuals aware of the availability and advantages of the plan as a way to save for higher education costs.\nThe commissioner shall administer the program, including accepting and processing applications, maintaining account records, making payments, and undertaking any other necessary tasks to administer the program. The office may contract with one or more third parties to carry out some or all of these administrative duties, including providing incentives and marketing the program. The office and the board may jointly contract with third-party providers, if the office and board determine that it is desirable to contract with the same entity or entities for administration and investment management.\nThe office may impose annual fees, as provided in subdivision 3, on participants in the plan to recover the costs of administration. The office must use its best efforts to keep these fees as low as possible, consistent with efficient administration, so that the returns on savings invested in the plan will be as high as possible.\nAccount owner data, account data, and data on beneficiaries of accounts are private data on individuals or nonpublic data as defined in section 13.02, except that the names and addresses of the beneficiaries of accounts that receive matching grants are public.",
	"repealed": false
}