{
	"id": "518.191",
	"url": "https://www.revisor.mn.gov/statutes/cite/518.191",
	"title": "518.191 SUMMARY REAL ESTATE DISPOSITION JUDGMENT.",
	"text": "If real estate is described in a judgment and decree of dissolution, the court shall direct either of the parties or their legal counsel to prepare and submit to the court a proposed summary real estate disposition judgment. Upon approval by the court and filing of the summary real estate disposition judgment with the court administrator, the court administrator shall provide to any party upon request certified copies of the summary real estate disposition judgment.\nA summary real estate disposition judgment must contain the following information:\n(1) the full caption and file number of the case and the title \"Summary Real Estate Disposition Judgment\";\n(2) the dates of the parties' marriage and of the entry of the judgment and decree of dissolution;\n(3) the names of the parties' attorneys or if either or both appeared pro se;\n(4) the name of the judge and referee, if any, who signed the order for judgment and decree;\n(5) whether the judgment and decree resulted from a stipulation, a default, or a trial and the appearances at the default or trial;\n(6) if the judgment and decree resulted from a stipulation, whether the real property was described by a legal description;\n(7) if the judgment and decree resulted from a default, whether the petition contained the legal description of the property and whether disposition was made in accordance with the request for relief;\n(8) whether the summons and petition were served personally upon the respondent pursuant to the Rules of Civil Procedure, rule 4.03(a), or section 543.19;\n(9) if the summons and petition were served on the respondent only by publication, the name of each legal newspaper and county in which the summons and petition were published and the dates of publications;\n(10) whether either party changed the party's name through the judgment and decree;\n(11) the legal description of each parcel of real estate;\n(12) the name or names of the persons awarded an interest in each parcel of real estate and a description of the interest awarded;\n(13) liens, mortgages, encumbrances, or other interests in the real estate described in the judgment and decree; and\n(14) triggering or contingent events set forth in the judgment and decree affecting the disposition of each parcel of real estate.\n(a) On the court's own motion or on application by an interested person, the court shall issue an order authorizing the court administrator to issue an amended summary real estate disposition judgment to correct an erroneous legal description of real estate contained in the judgment and decree of dissolution.\n(b) An application to correct a legal description under this subdivision must contain:\n(1) the erroneous legal description contained in the judgment and decree;\n(2) the correct legal description of the real estate;\n(3) written evidence satisfactory to the court to show the correct legal description, or a request for an evidentiary hearing to produce evidence of the correct legal description; and\n(4) a proposed amended summary real estate disposition judgment.\n(c) The court shall consider an application under this subdivision on an expedited basis. The court's order must be based on the evidence provided in the application, the evidence produced at an evidentiary hearing, or the evidence already in the record of the proceeding. If the court is satisfied that an erroneous legal description should be corrected under this subdivision, the court may issue its order without a hearing or notice to any person. A filing fee is not required for an application under this subdivision. The court's order must be treated as an amendment of the court's findings of fact regarding the legal description of the property in question, without the need to amend the original judgment and decree. The court shall issue the order if the court specifically finds that the court had jurisdiction over the respondent in the dissolution proceeding and that the property was sufficiently identified in the original proceedings to prevent prejudice to the rights of either party to the dissolution and that the amendment will not prejudice their rights. The court's order is effective retroactive to the date of entry of the original judgment and decree of dissolution.\n(d) An amended summary real estate disposition judgment must be treated the same as the prior summary real estate disposition judgment for all purposes.\n(e) On request by any interested person, the court administrator shall provide a certified copy of an amended summary real estate disposition judgment showing the correct legal description of the real property affected by the judgment and decree.\n(f) This subdivision may not be used to add omitted property to a judgment and decree of dissolution, unless the court determines that the omitted property is an integral or appurtenant part of real property already properly included in the judgment and decree.\nAn order or provision in a judgment and decree that provides that the judgment and decree must be recorded in the office of the county recorder or filed in the office of the registrar of titles means, if a summary real estate disposition judgment has been approved by the court, that the summary real estate disposition judgment, rather than the judgment and decree, must be recorded in the office of the county recorder or filed in the office of the registrar of titles. The recorder or registrar of titles is not responsible for determining if a summary real estate disposition judgment has been approved by the court.\nThe summary real estate disposition judgment operates as a conveyance and transfer of each interest in the real estate in the manner and to the extent described in the summary real estate disposition judgment. A summary real estate disposition judgment, or an amended summary real estate disposition judgment that supersedes an earlier judgment, is prima facie evidence of the facts stated in the summary real estate disposition judgment. A purchaser for value without notice of any defect in the dissolution proceedings may rely on a summary real estate disposition judgment or a later amended summary real estate disposition judgment to establish the facts stated in the judgment.\nIf a conflict exists between the judgment and decree and the summary real estate disposition judgment, the summary real estate disposition judgment recorded in the office of the county recorder or filed in the office of the registrar of titles controls as to the interest acquired in real estate by any subsequent purchaser in good faith and for a valuable consideration, who is in possession of the interest or whose interest is recorded with the county recorder or registrar of titles, before the recording of the judgment and decree in the same office.",
	"repealed": false
}