{
	"id": "551.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/551.04",
	"title": "551.04 GENERAL PROVISIONS.",
	"text": "Unless this chapter specifically provides otherwise, the Minnesota Rules of Civil Procedure for the District Courts shall apply in all proceedings under this chapter.\nSubject to the exemptions provided by subdivision 3 and section 550.37, and any other applicable statute, the service of a writ of execution under this chapter attaches:\n(a) Except as otherwise provided in paragraph (c), all unpaid nonexempt disposable earnings owing or to be owed by the third party and earned or to be earned by the judgment debtor within the pay period in which the writ of execution is served and within all subsequent pay periods whose paydays occur within the 90 days after the date of service of the writ of execution. \"Payday\" means the day upon which the third party pays earnings to the judgment debtor in the ordinary course of business. If the judgment debtor has no regular paydays, payday means the 15th day and the last day of each month.\n(b) All other nonexempt indebtedness or money due or belonging to the judgment debtor and owing by the third party or in the possession or under the control of the third party at the time of service of the writ of execution, whether or not the same, has become payable. The third party shall not be compelled to pay or deliver the same before the time specified by any agreement unless the agreement was fraudulently contracted to defeat an execution levy or other collection remedy.\n(c) For an execution on a judgment for child support, all unpaid nonexempt disposable earnings owing or to be owed by the third party and earned or to be earned by the judgment debtor within the pay period in which the writ of execution is served and within all subsequent pay periods until the judgment is satisfied if the judgment creditor is a county and the third party is notified by the county when the judgment is satisfied.\nThe following property is not subject to attachment by a writ of execution served pursuant to this chapter:\n(1) any indebtedness or money due to the judgment debtor, unless at the time of the service of the writ of execution the same is due absolutely or does not depend upon any contingency;\n(2) any judgment owing by the third party to the judgment debtor, if the third party or the third party's property is liable on an execution levy upon the judgment;\n(3) any debt owing by the third party to the judgment debtor for which any negotiable instrument has been issued or endorsed by the third party;\n(4) any indebtedness or money due to the judgment debtor where the judgment debtor is a bank, savings bank, trust company, credit union, savings association, or industrial loan and thrift company with deposit liabilities;\n(5) any indebtedness or money due to the judgment debtor with a cumulative value of less than $10; and\n(6) any disposable earnings, indebtedness, or money that is exempt under Minnesota or federal law.\nWhen levying upon money or earnings owed to the judgment debtor by a third party, the attorney for the judgment creditor shall serve a copy of the writ of execution upon the third party either by registered or certified mail, or by personal service. A third-party levy served by registered or certified mail is effective if served at the third party's regular place of business. Along with a copy of the writ of execution, the attorney shall serve upon the third party a notice of third-party levy and disclosure form that must be substantially in the form set forth below. If the levy is upon earnings, the attorney shall serve upon the third party the notice of third party levy and disclosure form as set forth in section 551.06, subdivision 9.\nPLEASE TAKE NOTICE that pursuant to Minnesota Statutes, chapter 551, the undersigned, as attorney for the judgment creditor, hereby makes demand and levies execution upon all money due and owing by you (up to $10,000) to the judgment debtor for the amount of the judgment specified below. A copy of the writ of execution issued by the court is enclosed. The unpaid judgment balance is $.......\nIn responding to this levy, you are to complete the attached disclosure form and mail it to the undersigned attorney for the judgment creditor, together with your check payable to the above-named judgment creditor, for the nonexempt amount owed by you to the judgment debtor or for which you are obligated to the judgment debtor, within the time limits set forth in chapter 551.\nIf you are a financial institution and the judgment debtor is a natural person, two exemption notices are also enclosed pursuant to Minnesota Statutes, section 551.02. Only natural persons are entitled to exemptions under this statute.\nDISCLOSURE\nOn the ..... day of ............., ......., the time of service of the execution levy herein, there was due and owing the judgment debtor from the third party the following:\n(1) Money. Enter on the line below any amounts due and owing the judgment debtor, except earnings, from the third party.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(2) Setoff. Enter on the line below the amount of any setoff, defense, lien, or claim which the third party claims against the amount set forth on line (1). State the facts by which such setoff, defense, lien, or claim is claimed. (Any indebtedness to you incurred by the judgment debtor within ten days prior to the receipt of the first execution levy on a debt may not be claimed as a setoff, defense, lien, or claim against the amount set forth on line (1).)\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(3) Exemption. Enter on the line below any amounts or property claimed by the judgment debtor to be exempt from execution.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(4) Adverse Interest. Enter on the line below any amounts claimed by other persons by reason of ownership or interest in the judgment debtor's property.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(5) Enter on the line below the total of lines (2), (3), and (4).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(6) Enter on the line below the difference obtained (never less than zero when line (5) is subtracted from the amount on line (1)).\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(7) Enter on the line below 100 percent of the amount of the judgment creditor's claim which remains unpaid.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\n(8) Enter on the line below the lesser of line (6) and line (7). You are hereby instructed to remit this amount only if it is $10 or more.\n....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nAFFIRMATION\nI, ....................... (person signing Affirmation), am the third party or I am authorized by the third party to complete this nonearnings disclosure, and have done so truthfully and to the best of my knowledge.\nIf the levy is upon earnings or upon funds at a financial institution, the third party shall be paid a $15 fee at the time of the service of the writ of execution. Failure to pay the fee renders the levy void, and the third party shall take no action. The $15 shall not be paid where the funds being levied on are being held pursuant to a garnishment previously served in compliance with chapter 571. This fee may be recovered by the judgment creditor as an allowable disbursement. If a third party is required to appear and submit to oral examination, the third party shall be tendered, in advance of the examination, fees and mileage for attendance at the rate allowed by law to a witness. These fees may be recovered by the judgment creditor as an allowable disbursement. In extraordinary cases, the third party may be allowed additional sums the court considers reasonable for attorney's fees and other necessary expenses. The court shall then determine which party bears the burden of this expense.\nWithin 15 days after receipt of the writ of execution, unless governed by section 551.05 or 551.06, the third party shall disclose and remit to the judgment creditor's attorney as much of the amount due under section 550.04, but not more than $10,000, as the third party's own debt equals to the judgment debtor. The attorney for the judgment creditor shall proceed in all other respects like the sheriff making a similar execution levy. No more than $10,000 may be recovered by a single execution levy pursuant to this section.\nBefore or after the service of a written disclosure by a third party under subdivision 6, upon a showing by affidavit upon information and belief that an oral examination of the third party would provide a complete disclosure of relevant facts, any party to the execution proceedings may obtain an ex parte order requiring the third party, or a representative of the third party designated by name or by title, to appear for oral examination before the court or a referee appointed by the court. Notice of the examination must be given to all parties.\nIf a third party holds property, money, earnings, or other indebtedness by a title that is void as to the judgment debtor's creditors, the property may be levied on although the judgment debtor would be barred from maintaining an action to recover the property, money, earnings, or other indebtedness. In this and all other cases where the third party denies liability, the judgment creditor may move the court at any time before the third party is discharged, on notice to both the judgment debtor and the third party for an order making the third party a party to the supplemental action and granting the judgment creditor leave to file a supplemental complaint against the third party and the judgment debtor. The supplemental complaint shall set forth the facts upon which the judgment creditor claims to charge the third party. If probable cause is shown, the motion shall be granted. The supplemental complaint shall be served upon the third party and the judgment debtor and any other parties. The parties served shall answer or respond pursuant to the Minnesota Rules of Civil Procedure for the District Courts, and if they fail to do so, judgment by default may be entered against them.\nJudgment may be entered against a third party who has been served with a writ of execution and fails to disclose or remit the levied funds as required in this chapter. Upon order to show cause served on the third party and notice of motion supported by affidavit of facts and affidavit of service upon both the judgment debtor and third party, the court may render judgment against the third party for an amount not exceeding 100 percent of the amount claimed in the execution or $10,000, whichever is less. Judgment against the third party pursuant to this section shall not bar the judgment creditor from further remedies under this chapter as a result of any subsequent defaults by the third party. The court upon good cause shown may remove the default and permit the third party to disclose or remit on just terms.\nExcept as provided for in subdivision 5, neither the judgment creditor nor its attorney shall be allowed costs from any party other than the judgment creditor for a levy in accordance with this section. Upon expiration, the attorney making the execution shall endorse on the writ partial satisfaction by amount or the total satisfaction and return the original writ of execution to the court administrator of that court, pursuant to section 550.051, subdivision 2, for filing without charge.\nNo judgment creditor shall use a form that contains alterations or changes from the statutory forms that mislead judgment debtors as to their rights and the execution procedure generally. If a court finds that a judgment creditor has used a misleading form, the judgment debtor shall be awarded actual damages, costs, reasonable attorney's fees resulting from additional proceedings, and an amount not to exceed $100. All forms must be clearly legible and printed in not less than the equivalent of 10-point type. A form that uses both sides of a sheet must clearly indicate on the front side that there is additional information on the back side of the sheet.\nForms, including the statutory forms, used in executions upon earnings for the satisfaction of judgments for child support must be changed by the creditor to reflect the fact that the 90-day period of effectiveness does not apply to these executions if the judgment creditor is a county and the employer is notified by the county when the judgment is satisfied.\nThe third party is not liable to the judgment debtor, judgment creditor, or other person for wrongful retention if the third party retains or remits disposable earnings, indebtedness, or money of the judgment debtor or any other person, pending the third party's disclosure or consistent with the disclosure the third party makes, if the third party has a good faith belief that the property retained or remitted is subject to the execution. In addition, the third party may, at any time before or after disclosure, proceed under Rule 67 of the Minnesota Rules of Civil Procedure for the District Courts to make deposit into court. No third party is liable for damages if the third party complies with the provisions of this chapter.\nIf, in a proceeding brought under section 551.05, subdivision 8, or a similar proceeding under this chapter to determine a claim of exemption, the claim of exemption is not upheld, and the court finds that it was asserted in bad faith, the judgment creditor shall be awarded actual damages, costs, reasonable attorney fees resulting from the additional proceedings, and an amount not to exceed $100. If the claim of exemption is upheld, and the court finds that the judgment creditor disregarded the claim of exemption in bad faith, the judgment debtor shall be awarded actual damages, costs, reasonable attorney fees resulting from the additional proceedings, and an amount not to exceed $100. The underlying judgment shall be modified to reflect assessment of damages, costs, and attorney fees. However, if the party in whose favor a penalty assessment is made is not actually indebted to that party's attorney for fees, the attorney fee award shall be made directly to the attorney, and if not paid, an appropriate judgment in favor of the attorney shall be entered. Any action by a judgment creditor made in bad faith and in violation of this chapter renders the execution levy void and the judgment creditor liable to the judgment debtor named in the execution levy in the amount of $100, actual damages, and reasonable attorney fees and costs.\nSubject to subdivisions 6 and 15, the third party, after disclosure, shall be discharged of any further obligation to the judgment creditor when one of the following conditions is met:\n(a) The third party discloses that the third party is not indebted to the judgment debtor or does not possess any earnings, property, money, or indebtedness belonging to the judgment debtor that is attachable as defined in subdivision 2. The disclosure is conclusive against the judgment creditor and discharges the third party from any further obligation to the judgment creditor other than to retain and remit all nonexempt disposable earnings, property, indebtedness, or money of the judgment debtor which was disclosed.\n(b) The third party discloses that the third party is indebted to the judgment debtor as indicated on the execution disclosure form. The disclosure is conclusive against the judgment creditor and discharges the third party from any further obligation to the judgment creditor other than to retain and remit all nonexempt disposable earnings, property, indebtedness, or money of the judgment debtor that was disclosed.\n(c) The court may, upon motion of an interested person, discharge the third party as to any disposable earnings, money, property, or indebtedness in excess of the amount that may be required to satisfy the judgment creditor's claim.\nThe third party is not discharged if:\n(a) Within 20 days of the service of the third party's disclosure, an interested person serves a motion relating to the execution levy. The hearing on the motion must be scheduled to be heard within 30 days of the service of the motion.\n(b) The judgment creditor moves the court for leave to file a supplemental complaint against the third party, as provided for in subdivision 8, and the court upon proper showing vacates the discharge of the third party.\nIf it appears that a person, who is not a party to the action, has or claims an interest in any of the disposable earnings, other indebtedness, or money, the court shall permit that person to intervene or join in the execution proceeding under this chapter. If that person does not appear, the court may summon that person to appear or order the claim barred. The person so appearing or summoned shall be joined as a party and be bound by the judgment.\nA party to an execution proceeding aggrieved by an order or final judgment may appeal as in other civil cases.",
	"repealed": false
}