{
	"id": "144E.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/144E.16",
	"title": "144E.16 RULES; LOCAL STANDARDS.",
	"text": "MS 1998 [Repealed, 1999 c 245 art 9 s 66]\nMS 1998 [Repealed, 1999 c 245 art 9 s 66]\nMS 1998 [Repealed, 1999 c 245 art 9 s 66]\nThe director may adopt rules needed to regulate ambulance services in the following areas:\n(1) applications for licensure;\n(2) personnel qualifications and staffing standards;\n(3) quality of life-support treatment;\n(4) restricted treatments and procedures;\n(5) equipment standards;\n(6) ambulance standards;\n(7) communication standards, equipment performance and maintenance, and radio frequency assignments;\n(8) advertising;\n(9) scheduled ambulance services;\n(10) ambulance services in time of disaster;\n(11) basic, intermediate, advanced, and refresher emergency care course programs;\n(12) continuing education requirements;\n(13) trip reports;\n(14) license fees, vehicle fees, and expiration dates; and\n(15) waivers and variances.\n(a) Local units of government may, with the approval of the director, establish standards for ambulance services which impose additional requirements upon such services. Local units of government intending to impose additional requirements shall consider whether any benefit accruing to the public health would outweigh the costs associated with the additional requirements.\n(b) Local units of government that desire to impose additional requirements shall, prior to adoption of relevant ordinances, rules, or regulations, furnish the director with a copy of the proposed ordinances, rules, or regulations, along with information that affirmatively substantiates that the proposed ordinances, rules, or regulations:\n(1) will in no way conflict with the relevant rules of the office;\n(2) will establish additional requirements tending to protect the public health;\n(3) will not diminish public access to ambulance services of acceptable quality; and\n(4) will not interfere with the orderly development of regional systems of emergency medical care.\n(c) The director shall base any decision to approve or disapprove local standards upon whether or not the local unit of government in question has affirmatively substantiated that the proposed ordinances, rules, or regulations meet the criteria specified in paragraph (b).\nMS 1998 [Repealed, 1999 c 245 art 9 s 66]\nRegional emergency medical services programs and any ambulance service licensed under this chapter must develop stroke transport protocols. The protocols must include standards of care for triage and transport of acute stroke patients within a specific time frame from symptom onset until transport to the most appropriate designated acute stroke ready hospital, primary stroke center, thrombectomy-capable stroke center, or comprehensive stroke center.\nRegional and local emergency medical services programs must develop STEMI transport protocols. The protocols must include standards of care for triage and transport of ST segment elevation myocardial infarction patients within a specific time frame from first medical contact until transport to the most appropriate hospital based on the patient's condition, the time of transport, and the hospital's capabilities.",
	"repealed": false
}