{
	"id": "504B.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/504B.241",
	"title": "504B.241 RESIDENTIAL TENANT REPORTS; DISCLOSURE AND CORRECTIONS.",
	"text": "(a) Upon request and proper identification, a residential tenant screening service must disclose the following information to an individual:\n(1) the nature and substance of all information in its files on the individual at the time of the request; and\n(2) the sources of the information.\n(b) A residential tenant screening service must make the disclosures to an individual without charge if information in a residential tenant report has been used within the past 30 days to deny the rental or increase the security deposit or rent of a residential housing unit to the individual. If the residential tenant report has not been used to deny the rental or increase the rent or security deposit of a residential housing unit within the past 30 days, the residential tenant screening service may impose a reasonable charge for making the disclosure required under this section. The residential tenant screening service must notify the residential tenant of the amount of the charge before furnishing the information. The charge may not exceed the amount that the residential tenant screening service would impose on each designated recipient of a residential tenant report, except that no charge may be made for notifying persons of the deletion of information which is found to be inaccurate or which can no longer be verified.\n(c) Files maintained on a residential tenant must be disclosed promptly as established in paragraphs (1) to (4).\n(1) A residential tenant file must be disclosed in person, during normal business hours, at the location where the residential tenant screening service maintains its files, if the residential tenant appears in person and furnishes proper identification at that time.\n(2) A residential tenant file must be disclosed by mail, if the residential tenant makes a written request with proper identification for a copy of the information contained in the residential tenant report and requests that the information be sent to a specified address. A disclosure made under this paragraph shall be deposited in the United States mail, postage prepaid, within five business days after the written request for disclosure is received by the residential tenant screening service. A residential tenant screening service complying with a request for disclosure under this paragraph shall not be liable for disclosures to third parties caused by mishandling mail, provided that the residential tenant file information is mailed to the address specified by the residential tenant in the request.\n(3) A summary of the information in a residential tenant file must be disclosed by telephone, if the residential tenant has made a written request with proper identification for telephone disclosure.\n(4) Information in a residential tenant's file required to be disclosed in writing under this subdivision may be disclosed in any other form including electronic means if authorized by the residential tenant and available from the residential tenant screening service.\nIf the completeness or accuracy of an item of information contained in an individual's file is disputed by the individual, the residential tenant screening service must reinvestigate and record the current status of the information. If the information is found to be inaccurate or can no longer be verified, the residential tenant screening service must delete the information from the individual's file and residential tenant report. At the request of the individual, the residential tenant screening service must give notification of the deletions to persons who have received the residential tenant report within the past six months.\nThe residential tenant screening service must permit an individual to explain any eviction report or any disputed item not resolved by reinvestigation in a residential tenant report. The explanation must be included in the residential tenant report. The residential tenant screening service may limit the explanation to no more than 100 words.\n(a) If a residential tenant screening service includes information from a court file on an individual in a residential tenant report, the report must provide the full name and date of birth of the individual in any case where the court file includes the individual's full name and date of birth, and the outcome of the court proceeding must be accurately recorded in the residential tenant report including the specific basis of the court's decision, when available.\n(b) Every residential tenant screening service has an affirmative duty to update and verify the current status of court files by accessing the Minnesota Court Records Online no more than 24 hours prior to issuing a residential tenant screening report.\n(c) Whenever the court supplies information from a court file on an individual, in whatever form, the court shall include the full name and date of birth of the individual, if that is indicated on the court file or summary, and information on the outcome of the court proceeding, including the specific basis of the court's decision, coded as provided in subdivision 5 for the type of action, when it becomes available.\n(d) The residential tenant screening service is not liable under section 504B.245 if the residential tenant screening service reports complete and accurate information as provided by the court, consistent with paragraph (b).\nThe court shall indicate on the court file or any summary of a court file the specific basis of the court's decision in an eviction action according to codes developed by the court that, at a minimum, indicates if the basis of the court's decision is nonpayment of rent, a violation of the covenants under section 504B.161 or 504B.171, other breach of a lease agreement, or a counterclaim for possession of the premises under section 504B.385.",
	"repealed": false
}