{
	"id": "197.481",
	"url": "https://www.revisor.mn.gov/statutes/cite/197.481",
	"title": "197.481 ENFORCEMENT.",
	"text": "A veteran, as defined by section 197.447, who has been denied rights by the state or any political subdivision, municipality, or other public agency of the state as authorized by the Veterans Preference Act under section 43A.11, 197.46, 197.48, or 197.455 may petition the commissioner of veterans affairs for an order directing the agency to grant the veteran such relief the commissioner finds justified by said statutes.\nThe petition shall be submitted via United States mail and contain:\n(1) the name, address, telephone number, and notarized original signature of the veteran;\n(2) the names, telephone numbers, and addresses of all agencies and persons that will be directly affected if the petition is granted;\n(3) a concise statement of the facts giving rise to the veteran's rights and a concise statement showing the manner in which rights were denied;\n(4) a statement of the relief requested; and\n(5) a copy of the veteran's Form DD214 (Separation or Discharge from Active Duty).\nUpon receipt and authorization verification of a complete petition herein, the commissioner shall serve a copy of same, by certified mail, on all agencies and persons named therein and on such other agencies or persons as in the judgment of the commissioner should in justice be parties to the proceeding. The veteran and all agencies and persons served shall be parties to the proceeding.\nThe commissioner shall have free access to relevant records of all parties and may issue subpoenas for and compel the attendance of witnesses and the giving of testimony and the production of books, records, accounts, documents and papers; and may administer oaths to witnesses. If any person shall fail or refuse to appear or testify regarding that upon which the person may be lawfully interrogated, or produce any books, records, accounts, documents or papers relevant in the matter under consideration, after having been lawfully required by subpoena, any judge of the district court in any county of the state where the subpoena was made returnable, on application of the commissioner, shall compel obedience or punish disobedience as for contempt as in the case of disobedience of a similar subpoena issued by such court.\nThe commissioner shall schedule a hearing on the petition of any party to be held or conducted within 120 days of serving, or being served with the authorized and complete petition. At the hearing, all parties shall have the right to be heard. A hearing hereunder shall be conducted and orders issued in accord with sections 14.57 to 14.60 and 14.62, at the office of the commissioner or at a place the commissioner designates. The commissioner shall notify all parties, by certified mail, of the date, time, and place of the hearing.\nThe commissioner may appoint a hearing officer to act in the commissioner's place and to employ such other personnel as are necessary to investigate facts in cases brought under this section. The affected political subdivision must bear all costs incurred by the commissioner under this section.\nAppeals of orders issued under this section shall be in accordance with chapter 14.\nIf a veteran receives a favorable decision hereunder and (a) a party to the proceeding appeals such decision to the district court or (b) if an action attacking the decision is begun, the commissioner shall become a party in such appeal or action and with the aid of the attorney general represent the veteran therein.\nWhen a party fails or refuses to comply with a final decision of the commissioner, the commissioner may commence an action in Ramsey County District Court requesting the court to order the party to comply with the order of the commissioner. If the commissioner has ordered an award of damages and if the court sustains or modifies the award, it shall enter judgment on the order or modified order in the same manner as in the case of an order of the district court, as provided in section 546.27.",
	"repealed": false
}