{
	"id": "398A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/398A.03",
	"title": "398A.03 ORGANIZATION OF AUTHORITY.",
	"text": "A regional railroad authority may be organized by resolution or joint resolution adopted by the governing body or bodies of one or more counties. The governing body or bodies of a municipality or municipalities within a county or counties may request by resolution that the county or counties organize a railroad authority. If the county or counties do not organize an authority within 90 days of receipt of the request, the municipality or municipalities may organize an authority by resolution or joint resolution. A resolution organizing an authority must state:\n(1) that the authority is organized under the Regional Railroad Authorities Act as a political subdivision and local government unit of Minnesota, to exercise thereunder part of the sovereign power of the state;\n(2) the name of the authority, including the words \"regional railroad authority\";\n(3) the municipality or municipalities adopting the organization resolution;\n(4) the number of commissioners of the authority, not less than five; the number to be appointed by the governing body of each municipality; and the names and addresses of the first board of commissioners;\n(5) the city and county in which the registered office of the authority is to be situated;\n(6) that neither the state of Minnesota, the municipality or municipalities, nor any other political subdivision is liable for obligations of the authority; and\n(7) any other provision for regulating the business of the authority determined by the governing body or bodies adopting the resolution.\nBefore final adoption of an organization resolution, the governing body of each municipality named in it shall provide for a public hearing upon notice published in a newspaper of general circulation in the municipality. The notice of a hearing by the governing body of a county must be mailed to the governing body of each city or town in the county, except cities and towns participating in the organization, at least 30 days before the hearing. The hearing may be adjourned from time to time, to a time and place publicly announced at the hearing, or to a time and place fixed by notice published in a newspaper of general circulation in the municipality at least ten days before the adjourned session. Joint hearing sessions may be held by the governing bodies of all municipalities named, at any convenient public place within any of the municipalities. The resolution may be amended by the governing body or bodies at or after any hearing session at which the amended resolution is proposed and made available to interested citizens. It shall not become effective until adopted in identical form by the governing bodies of all municipalities named in the resolution.\nA copy of the organization resolution, certified by the recording officer of each municipality adopting it, shall be filed with the secretary of state, who shall issue a certificate of incorporation if the resolution conforms to the requirements of this section, stating in the certificate the name of the authority and the date of its incorporation, which shall be the date of acceptance for filing. The certificate of incorporation shall be conclusive evidence of the valid organization and existence of the authority.\nThe organization resolution may be amended by resolution or joint resolution of the governing bodies of all municipalities named in the resolution prior to amendment and the governing body of any additional municipality named in the amendment. Each amendment shall be adopted at or after hearing upon notice as required for the organization resolution. No amendment releasing a municipality from its obligations as a party named in the resolution shall be effective unless all covenants, agreements, mortgage liens, and other security given for bonds of the authority have been discharged and satisfied by payment or otherwise in accordance with their terms. All other amendments shall take effect upon filing with the secretary of state and issuance of an amended certificate of incorporation in the same manner as provided for the organization resolution.\nAll powers granted to an authority shall be exercised by its board of commissioners. Commissioners shall be appointed and vacancies in their office shall be filled by the governing body of each municipality named in the organization resolution, in accordance with the provisions of that resolution. The term of each commissioner shall be one year, or the remainder of the one year term for which a vacancy is filled, and until a successor is appointed. Commissioners shall receive no compensation for services but shall be reimbursed for necessary expenses incurred in the performance of their duties.\nThe board of commissioners shall by resolution establish the time and place or places of its regular meetings and the method and notice required for calling special meetings, all of which shall be open to the public. A majority of the commissioners being present at a meeting, any action may be taken by resolution or motion adopted by recorded vote of a majority of those present, unless a larger majority is required by bylaws adopted by the board.\nThe board of commissioners shall appoint a chair, vice-chair, secretary, and treasurer from its members, each to serve for a term of one year and until a successor is appointed. The offices of secretary and treasurer may be combined, and deputies or assistants may be appointed for either office or the combined office, from members of the board or otherwise. The powers and duties of each office shall be determined by the board, which shall require and pay for a surety bond for each officer handling funds. The board shall provide for the keeping of a full and accurate record of all proceedings and of resolutions, regulations, and orders issued or adopted; the state auditor shall, as time and resources permit, annually audit the books of said regional railroad authority. The board may appoint an executive director and other officers, fix their compensation, and delegate to them the powers and duties, as it may determine. It may also employ, or authorize the executive director to employ, all other employees, consultants, and agents needed to perform its duties and exercise its powers. Chapter 353 shall apply to all salaried employees.",
	"repealed": false
}