{
	"id": "270.072",
	"url": "https://www.revisor.mn.gov/statutes/cite/270.072",
	"title": "270.072 TAXATION AND ASSESSMENT OF FLIGHT PROPERTY.",
	"text": "All real property of an airline company and all personal property thereof except flight property shall be taxed as otherwise provided by law.\nFlight property that is owned by, or is leased, loaned, or otherwise made available to an airline company operating in Minnesota shall be assessed and appraised annually by the commissioner with reference to its value on January 2 of the assessment year in the manner prescribed by sections 270.071 to 270.079.\n(a) Each year, on or before July 1, every airline company engaged in air commerce in this state shall file with the commissioner a report under oath setting forth specifically the information prescribed by the commissioner to enable the commissioner to make the assessment required in sections 270.071 to 270.079, unless the commissioner determines that the airline company is exempt from filing.\n(b) The commissioner shall prescribe the content, format, and manner of the report pursuant to section 270C.30, except that a \"law administered by the commissioner\" includes the property tax laws. If a report is made by electronic means, the taxpayer's signature is defined pursuant to section 270C.304, except that a \"law administered by the commissioner\" includes the property tax laws.\nIf an airline company fails to file a report required by subdivision 3, the commissioner may, from information in the commissioner's possession or obtainable by the commissioner, make and file a report for the airline company, or may issue a notice of net tax capacity and tax under section 270.075, subdivision 2.\nThe commissioner for good cause may extend for not to exceed 30 days the time for making a report.\nMS 1998 [Repealed, 2000 c 490 art 5 s 40]\nThe tax imposed under sections 270.071 to 270.079 is a lien on all real and personal property within this state of the airline company in whose name the property is assessed. The lien attaches on January 2 of each year for the taxes payable in the following year.",
	"repealed": false
}