{
	"id": "62A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.10",
	"title": "62A.10 GROUP INSURANCE.",
	"text": "Group accident and health insurance may be issued to cover groups of not less than two employees nor less than ten members, and which may include the employee's or member's dependents, consisting of spouses, children, and actual dependents residing in the household. The master policy may be issued to any governmental corporation, unit, agency, or department thereof, or to any corporation, copartnership, individual, employer, to a purchasing pool as described in section 62Q.17, to any association as defined by section 60A.02, subdivision 1a, or to a multiple employer trust, or to the trustee of a fund, established or adopted by two or more employers or maintained for the benefit of members of an association, where officers, members, employees, or classes or divisions thereof, may be insured for their individual benefit.\nGroup accidental death insurance and group disability income insurance policies may be issued in connection with first real estate mortgage loans to cover groups of not less than ten debtors of a creditor written under a master policy issued to a creditor to insure its debtors in connection with first real estate mortgage loans, in amounts not to exceed the actual or scheduled amount of their indebtedness. No other accident and health coverages may be issued in connection with first real estate mortgage loans on a group basis to a debtor-creditor group.\nAny insurer authorized to write accident and health insurance in this state shall have power to issue group accident and health policies.\nNo policy or certificate of group accident and health insurance may be issued or delivered in this state unless the same has been approved by the commissioner in accordance with section 62A.02, subdivisions 1 to 6. These forms shall contain the standard provisions relating and applicable to health and accident insurance and shall conform with the other requirements of law relating to the contents and terms of policies of accident and sickness insurance insofar as they may be applicable to group accident and health insurance, and also the following provisions:\n(1) Entire contract. A provision that the policy and the application of the creditor, employer, trustee, or executive officer or trustee of any association, and the individual applications, if any, of the debtors, employees, or members, insured, shall constitute the entire contract between the parties, and that all statements made by the creditor, employer, trustee, or any executive officer or trustee on behalf of the group to be insured, shall, in the absence of fraud, be deemed representations and not warranties, and that no such statement shall be used in defense to a claim under the policy, unless it is contained in the written application;\n(2) Master policy-certificates. A provision that the insurer will issue a master policy to the creditor, employer, trustee, or to the executive officer or trustee of the association; and the insurer shall also issue to the creditor, the employer, trustee, or to the executive officer or trustee of the association, for delivery to the debtor, employee, or member, who is insured under the policy, an individual certificate setting forth a statement as to the insurance protection to which the debtor, employee, or member is entitled and to whom payable, together with a statement as to when and where the master policy, or a copy thereof, may be seen for inspection by the individual insured. The individual certificate may contain the names of, and insure the dependents of, the employee, or member, as provided for herein;\n(3) New insureds. A provision that to the group or class thereof originally insured may be added, from time to time, all new employees of the employer, members of the association, or debtors of the creditor eligible to and applying for insurance in that group or class and covered or to be covered by the master policy;\n(4) Conversion privilege. In the case of accidental death insurance and disability income insurance issued to debtors of a creditor, the policy must contain a conversion privilege permitting an insured debtor to convert, without evidence of insurability, to an individual policy within 30 days of the date the insured debtor's group coverage is terminated, and not replaced with other group coverage, for any reason other than nonpayment of premiums. The individual policy must provide the same amount of insurance and be subject to the same terms and conditions as the group policy and the initial premium for the individual policy must be the same premium the insured debtor was paying under the group policy. This provision does not apply to a group policy which provides that the certificate holder may, upon termination of coverage under the group policy for any reason other than nonpayment of premium, retain coverage provided under the group policy by paying premiums directly to the insurer.",
	"repealed": false
}