{
	"id": "375.771",
	"url": "https://www.revisor.mn.gov/statutes/cite/375.771",
	"title": "375.771 VETERAN-OWNED SMALL BUSINESS CONTRACTS.",
	"text": "(a) The definitions in this subdivision apply to this section.\n(b) \"Award\" means the granting of a contract in accordance with all applicable laws and rules governing competitive bidding, except as otherwise provided in this section.\n(c) \"Contract\" means an agreement entered into between a business entity and the county for procurement of goods and services including both technical and nontechnical goods and services, printing, and construction.\n(d) \"County board\" or \"board\" has the meaning given in section 375.01.\n(e) \"County purchasing department\" has the meaning given in section 375.72.\n(f) \"Director of purchasing\" has the meaning given in section 375.74.\n(g) \"Subcontractor\" means a business entity that enters into a legally binding agreement with another business entity that is a party to a contract as defined in paragraph (c).\n(h) \"Veteran\" has the meaning given in section 197.447.\n(i) \"Veteran-owned small business\" means a business designated under section 16C.16, subdivision 6a.\n(a) A county board may establish a program within the county in accordance with this section to provide a bid preference for awarding contracts to designated veteran-owned small businesses for the procurement of technical and nontechnical goods and services including, but not limited to, printing and construction, broadly defined to include all phases of the construction process.\n(b) The purpose of this program is to facilitate the transition of veterans from military to civilian life, and to help compensate veterans for their sacrifices including, but not limited to, their sacrifice of health and time to the community, state, and nation during their military service, as well as to enhance economic development throughout Minnesota.\n(c) The county board may direct the county director of purchasing, or other designated official within the county purchasing department, to administer this program in accordance with county policy established by the board.\n(a) The county director of purchasing may award up to a six percent preference in the amount bid for procurement of goods and services including, but not limited to, technical and nontechnical goods and services, printing, and construction to veteran-owned small businesses having their principal place of business in Minnesota.\n(b) The board, as a condition of awarding a construction contract, may set goals that require the prime contractor to subcontract a portion of the contract to veteran-owned small businesses. The board must establish a procedure for granting waivers from the subcontracting requirement when qualified veteran-owned small businesses are not reasonably available. The board may establish financial incentives for prime contractors who exceed the goals for use of veteran-owned small business subcontractors and financial penalties for prime contractors who fail to meet goals under this paragraph. The subcontracting requirements of this paragraph do not apply to prime contractors who are veteran-owned small businesses.\nAt least 75 percent of subcontracts awarded to veteran-owned small businesses must be performed by the business to which the subcontract is awarded or another veteran-owned small business.\nContracts awarded under this section are subject to all limitations adopted by the board.\nIf the director is unable to award a contract under subdivisions 3 and 4, the award may be placed under normal solicitation and award statutes and rules.\nThe board is encouraged to purchase from veteran-owned small businesses designated under section 16C.16, subdivision 6a, when making purchases that are not subject to competitive bidding procedures.\nAt the request of the county board, the county treasurer shall report to the board on compliance with this section. The information must be reported at the time and in the manner requested by the board.",
	"repealed": false
}