{
	"id": "90.301#stat.90.301.1",
	"url": "https://www.revisor.mn.gov/statutes/cite/90.301#stat.90.301.1",
	"title": "90.301 TIMBER TRESPASS ON STATE LANDS; UNLAWFUL POSSESSION AND SALE; REWARDS; RECORDS.",
	"text": "Whoever without valid permit shall cut any timber upon lands owned by this state, or held in trust by the state for the counties, or remove or carry away any such timber, or any other property appertaining to these lands, or shall commit any other trespass upon these lands, or shall induce or assist another to do so, shall be liable to the state for treble damages if the trespass is adjudged to have been willful but liable for double damages only if the trespass is adjudged to have been casual and involuntary. Any person found to have acquired possession in any manner of any timber unlawfully cut on lands owned by this state or held in trust by the state for the counties, shall be liable to the state for twice the stumpage value thereof. It shall be no defense to plead or claim a purchase of any state timber from any one other than the commissioner, or a purchase of any timber held in trust by the state for the counties from anyone other than the county auditor, nor may it be claimed that any other person should be joined as defendant; nor may any claim be made for remuneration or allowance for labor or expenses incurred in preparing such timber for market or transporting the same to or toward market. Every such trespass willfully committed shall be a gross misdemeanor.\nThe commissioner may take possession of any timber hereafter unlawfully cut upon or taken from any land owned by the state wherever found and may sell the same informally or at public auction after giving such notice as the commissioner deems reasonable and after deducting all the expenses of such sale the proceeds thereof shall be paid into the state treasury to the credit of the proper fund; and when any timber so unlawfully cut has been intermingled with any other timber or property so that it cannot be identified or plainly separated therefrom the commissioner may so seize and sell the whole quantity so intermingled and, in such case, the whole quantity of such timber shall be conclusively presumed to have been unlawfully taken from state land. When the timber unlawfully cut or removed from state land is so seized and sold, the seizure shall not in any manner relieve the trespasser who cut or removed, or caused the cutting or removal of, any such timber from the full liability imposed by this chapter for the trespass so committed, but the net amount realized from such sale shall be credited on whatever judgment is recovered against such trespasser, if the trespass was deemed to be casual and involuntary.\nIn addition to any other penalty provided by law, any person who shall remove, transport, carry away, conceal, or convert to personal use any timber unlawfully cut on state lands, knowing the same to have been so cut, shall be guilty of theft of the same and prosecuted and punished accordingly in the county where the property was cut or in any county into or through which the property or any part thereof may be removed; and when any corporation is guilty of the acts herein declared to be theft, each officer of the corporation shall, individually and severally, be guilty of such theft.\nThe commissioner may offer a reward to be paid to a person giving to the proper authorities any information that leads to the conviction of a person violating this chapter. The reward is limited to the greater of $100 or ten percent of the single stumpage value of any timber unlawfully cut or removed. The commissioner shall pay the reward from funds appropriated for that purpose or from receipts from the sale of state timber. A reward shall not be paid to salaried forest officers, state appraisers, scalers, conservation officers, or licensed peace officers.\nThe commissioner shall keep a record of all trespasses reported, with the estimates, appraisals and settlements thereof.\nThe commissioner may design and issue a ticket in the form, and having the effect, of a summons and complaint, for use in cases of theft of state timber or other state property, where the value of the property is within the limits established by section 609.52, subdivision 3, clause (5). The ticket shall provide for the name and address of the person charged with the violation, the offense charged, the time and place the person is to appear before a court, and any other necessary information.",
	"repealed": false
}