{
	"id": "259.24",
	"url": "https://www.revisor.mn.gov/statutes/cite/259.24",
	"title": "259.24 CONSENTS.",
	"text": "(a) No child shall be adopted without the consent of the child's parents and the child's guardian, if there is one, except consent is not required of a parent:\n(1) who is not entitled to notice of the proceedings;\n(2) who has abandoned the child and upon whom notice has been served as required by section 259.49; or\n(3) whose parental rights to the child have been terminated by a juvenile court or who has lost custody of a child through a final commitment of the juvenile court or through a decree in a prior adoption proceeding.\n(b) If there is no parent or guardian qualified to consent to the adoption, the agency having authority to place a child for adoption pursuant to section 259.25, subdivision 1, shall have the exclusive right to consent to the adoption of the child. The agency shall make every effort to place siblings together for adoption.\nIf an unmarried parent who consents to the adoption of a child is under 18 years of age, the consent of the minor parent's parents or guardian, if any, also shall be required; if either or both the parents are disqualified for any of the reasons enumerated in subdivision 1, the consent of such parent shall be waived, and the consent of the guardian only shall be sufficient; and, if there be neither parent nor guardian qualified to give such consent, the consent may be given by the commissioner. The agency overseeing the adoption proceedings shall ensure that the minor parent is offered the opportunity to consult with an attorney, a member of the clergy, a physician, an advanced practice registered nurse, or a physician assistant before consenting to adoption of the child. The advice or opinion of the attorney, clergy member, physician, advanced practice registered nurse, or physician assistant shall not be binding on the minor parent. If the minor parent cannot afford the cost of consulting with an attorney, a member of the clergy, a physician, an advanced practice registered nurse, or a physician assistant, the county shall bear that cost.\n(a) Not sooner than 72 hours after the birth of a child and not later than 60 days after the child's placement in a prospective adoptive home, a person whose consent is required under this section shall execute a consent.\n(b) Unless all birth parents from whom consent is required under this section are involved in making the adoptive placement and intend to consent to the adoption, a birth parent who intends to execute a consent to an adoption must give notice to the child's other birth parent of the intent to consent to the adoption prior to or within 72 hours following the placement of the child, if the other birth parent's consent to the adoption is required under subdivision 1. The birth parent who receives notice shall have 60 days after the placement of the child to either consent or refuse to consent to the adoption. If the birth parent who receives notice fails to take either of these actions, that parent shall be deemed to have irrevocably consented to the child's adoption. The notice provisions of chapter 260C and the rules of juvenile protection procedure shall apply to both parents when the consent to adopt is executed under section 260C.515, subdivision 3.\n(c) When notice is required under this subdivision, it shall be provided to the other birth parent according to the Rules of Civil Procedure for service of a summons and complaint.\nWhen the child to be adopted is over 14 years of age, the child's written consent to adoption by a particular person is also necessary.\nIn the adoption of an adult, the adult's written consent only shall be required.\nAll consents to an adoption shall be in writing, executed before two competent witnesses, and acknowledged by the consenting party. All consents by a parent to adoption under this chapter:\n(1) shall contain notice to the parent of the substance of subdivision 6a, providing for the right to withdraw consent unless the parent will not have the right to withdraw consent; and\n(2) shall contain the following written notice in all capital letters at least one-eighth inch high:\n\"The agency responsible for supervising the adoptive placement of the child will submit your consent to adoption to the court. If you are consenting to adoption by the child's stepparent, the consent will be submitted to the court by the petitioner in your child's adoption. The consent itself does not terminate your parental rights. Parental rights to a child may be terminated only by an adoption decree or by a court order terminating parental rights. Unless the child is adopted or your parental rights are terminated, you may be asked to support the child.\"\nConsents shall be filed in the adoption proceedings at any time before the matter is heard provided, however, that a consent executed and acknowledged outside of this state, either in accordance with the law of this state or in accordance with the law of the place where executed, is valid.\n[Repealed, 1980 c 561 s 14]\nA parent's consent to adoption under this chapter may be withdrawn for any reason within ten working days after the consent is executed and acknowledged. No later than the tenth working day after the consent is executed and acknowledged, written notification of withdrawal of consent must be received by: (1) the agency to which the child was surrendered; (2) the agency supervising the adoptive placement of the child; or (3) in the case of adoption by the stepparent or any adoption not involving agency placement or supervision, by the district court where the adopting stepparent or parent resides. On the day following the tenth working day after execution and acknowledgment, the consent shall become irrevocable, except upon order of a court of competent jurisdiction after written findings that consent was obtained by fraud. The proceedings shall be conducted to preserve the confidentiality of the adoption process. There shall be no presumption in the proceedings favoring the birth parents over the adoptive parents.\nConsent to an adoption shall not be unreasonably withheld by a guardian, who is not a parent of the child, or by an agency.\n[Repealed, 2016 c 158 art 1 s 215]",
	"repealed": false
}