{
	"id": "513.76",
	"url": "https://www.revisor.mn.gov/statutes/cite/513.76",
	"title": "513.76 NOTICE REQUIREMENTS FOR EXISTING TRANSFER FEE OBLIGATIONS.",
	"text": "For a private transfer fee obligation imposed prior to May 20, 2010, the receiver of the fee shall record or file, prior to December 31, 2010, against the real property subject to the private transfer fee obligation a separate document with the county recorder or registrar of titles of the county in which the real property is located that meets all of the following requirements:\n(1) the title of the document shall be \"Notice of Private Transfer Fee Obligation\" in at least 14-point boldface type;\n(2) the amount, if the fee is a flat amount, or the percentage of the sales price constituting the cost of the transfer fee, or any other basis by which the transfer fee is to be calculated;\n(3) the date or circumstances under which the private transfer fee obligation expires, if any;\n(4) the purpose for which the funds from the private transfer fee obligation will be used;\n(5) the name of the person or entity to which funds are to be paid and specific contact information regarding where the funds are to be sent;\n(6) the acknowledged signature of the payee; and\n(7) the legal description of the real property burdened by the private transfer fee obligation.\nThe person or entity to which the transfer fee is to be paid may record or file an amendment to the notice of transfer fee containing new contact information, but the amendment must contain the information of the notice of transfer fee that it amends and the legal description of the property burdened by the private transfer fee obligation.\n(a) If the payee fails to comply fully with subdivision 1, the grantor of any real property burdened by the private transfer fee obligation may proceed with the conveyance of any interest in the real property to any grantee. The grantor shall be deemed to have acted in good faith and shall not be subject to any obligations under the private transfer fee obligation, and the real property thereafter shall be conveyed free and clear of the transfer fee and private transfer fee obligation.\n(b) If the payee fails to provide a written statement of the transfer fee payable within 30 days of the date of a written request for the statement sent to the address shown in the notice of transfer fee, then the grantor, on recording or filing of the affidavit required under subdivision 4, may convey any interest in the real property to any grantee without payment of the transfer fee and shall not be subject to any further obligations under the private transfer fee obligation. The real property shall be conveyed free and clear of the transfer fee and private transfer fee obligation.\n(a) An affidavit stating the facts enumerated under paragraph (b) must be recorded or filed with the county recorder or registrar of titles in the county in which the real property is located prior to or simultaneously with a conveyance pursuant to subdivision 3, paragraph (a), of real property unburdened by a private transfer fee obligation. An affidavit filed under this paragraph must state that the affiant has actual knowledge of the facts in the affidavit and must include the legal description of the real property burdened by the private transfer fee obligation, the name of the person appearing by the record to be the owner of the real property at the time of the signing of the affidavit, and a reference by recording or filing information to the instrument of record containing the private transfer fee obligation.\n(b) When recorded or filed, an affidavit as described in paragraph (a) constitutes prima facie evidence that:\n(1) a request for the written statement of the transfer fee payable in order to obtain a release of the fee imposed by the private transfer fee obligation was sent to the address shown in the notification; and\n(2) the entity listed on the notice of transfer fee failed to provide the written statement of the transfer fee payable within 30 days of the date of the notice sent to the address shown in the notification.",
	"repealed": false
}