{
	"id": "216B.164",
	"url": "https://www.revisor.mn.gov/statutes/cite/216B.164",
	"title": "216B.164 COGENERATION AND SMALL POWER PRODUCTION.",
	"text": "This section shall at all times be construed in accordance with its intent to give the maximum possible encouragement to cogeneration and small power production consistent with protection of the ratepayers and the public.\n(a) This section as well as any rules promulgated by the commission to implement this section or the Public Utility Regulatory Policies Act of 1978, Public Law 95-617, Statutes at Large, volume 92, page 3117, as amended, and the Federal Energy Regulatory Commission regulations thereunder, Code of Federal Regulations, title 18, part 292, as amended, shall, unless otherwise provided in this section, apply to all Minnesota electric utilities, including cooperative electric associations and municipal electric utilities.\n(b) Nothing in this section shall be construed to alter the rights and duties of any person pursuant to the Public Utility Regulatory Policies Act of 1978, Public Law 95-617, Statutes at Large, volume 92, page 3117, as amended, and the Federal Energy Regulatory Commission regulations thereunder, Code of Federal Regulations, title 18, part 292, as amended.\n(a) For the purposes of this section, the following terms have the meanings given them.\n(b) \"Aggregated meter\" means a meter located on the premises of a customer's owned or leased property that is contiguous with property containing the customer's designated meter.\n(c) \"Capacity\" means the number of megawatts alternating current (AC) at the point of interconnection between a distributed generation facility and a utility's electric system.\n(d) \"Cogeneration\" means a combined process whereby electrical and useful thermal energy are produced simultaneously.\n(e) \"Contiguous property\" means property owned or leased by the customer sharing a common border, without regard to interruptions in contiguity caused by easements, public thoroughfares, transportation rights-of-way, or utility rights-of-way.\n(f) \"Customer\" means the person who is named on the utility electric bill for the premises.\n(g) \"Designated meter\" means a meter that is physically attached to the customer's facility that the customer-generator designates as the first meter to which net metered credits are to be applied as the primary meter for billing purposes when the customer is serviced by more than one meter.\n(h) \"Distributed generation\" means a facility that:\n(1) has a capacity of ten megawatts or less;\n(2) is interconnected with a utility's distribution system, over which the commission has jurisdiction; and\n(3) generates electricity from natural gas, renewable fuel, or a similarly clean fuel, and may include waste heat, cogeneration, or fuel cell technology.\n(i) \"High-efficiency distributed generation\" means a distributed energy facility that has a minimum efficiency of 40 percent, as calculated under section 272.0211, subdivision 1.\n(j) \"Net metered facility\" means an electric generation facility constructed for the purpose of offsetting energy use through the use of renewable energy or high-efficiency distributed generation sources.\n(k) \"Renewable energy\" has the meaning given in section 216B.2411, subdivision 2.\n(l) \"Standby charge\" means a charge imposed by an electric utility upon a distributed generation facility for the recovery of costs for the provision of standby services, as provided for in a utility's tariffs approved by the commission, necessary to make electricity service available to the distributed generation facility.\n(a) This paragraph applies to cooperative electric associations and municipal utilities. For a qualifying facility having less than 40-kilowatt capacity, the customer shall be billed for the net energy supplied by the utility according to the applicable rate schedule for sales to that class of customer. A cooperative electric association or municipal utility may charge an additional fee to recover the fixed costs not already paid for by the customer through the customer's existing billing arrangement. Any additional charge by the utility must be reasonable and appropriate for that class of customer based on the most recent cost of service study. The cost of service study must be made available for review by a customer of the utility upon request. In the case of net input into the utility system by a qualifying facility having less than 40-kilowatt capacity, compensation to the customer shall be at a per kilowatt-hour rate determined under paragraph (c), (d), or (f).\n(b) This paragraph applies to public utilities. For a qualifying facility having less than 1,000-kilowatt capacity, the customer shall be billed for the net energy supplied by the utility according to the applicable rate schedule for sales to that class of customer. In the case of net input into the utility system by a qualifying facility having: (1) more than 40-kilowatt but less than 1,000-kilowatt capacity, compensation to the customer shall be at a per kilowatt-hour rate determined under paragraph (c); or (2) less than 40-kilowatt capacity, compensation to the customer shall be at a per-kilowatt rate determined under paragraph (c) or (d).\n(c) In setting rates, the commission shall consider the fixed distribution costs to the utility not otherwise accounted for in the basic monthly charge and shall ensure that the costs charged to the qualifying facility are not discriminatory in relation to the costs charged to other customers of the utility. The commission shall set the rates for net input into the utility system based on avoided costs as defined in the Code of Federal Regulations, title 18, section 292.101, paragraph (b)(6), the factors listed in Code of Federal Regulations, title 18, section 292.304, and all other relevant factors.\n(d) Notwithstanding any provision in this chapter to the contrary, a qualifying facility having less than 40-kilowatt capacity may elect that the compensation for net input by the qualifying facility into the utility system shall be at the average retail utility energy rate. \"Average retail utility energy rate\" is defined as the average of the retail energy rates, exclusive of special rates based on income, age, or energy conservation, according to the applicable rate schedule of the utility for sales to that class of customer.\n(e) If the qualifying facility or net metered facility is interconnected with a nongenerating utility which has a sole source contract with a municipal power agency or a generation and transmission utility, the nongenerating utility may elect to treat its purchase of any net input under this subdivision as being made on behalf of its supplier and shall be reimbursed by its supplier for any additional costs incurred in making the purchase. Qualifying facilities or net metered facilities having less than 1,000-kilowatt capacity if interconnected to a public utility, or less than 40-kilowatt capacity if interconnected to a cooperative electric association or municipal utility may, at the customer's option, elect to be governed by the provisions of subdivision 4.\n(f) A customer with a qualifying facility or net metered facility having a capacity below 40 kilowatts that is interconnected to a cooperative electric association or a municipal utility may elect to be compensated for the customer's net input into the utility system in the form of a kilowatt-hour credit on the customer's energy bill carried forward and applied to subsequent energy bills. Any kilowatt-hour credits carried forward by the customer cancel at the end of the calendar year with no additional compensation.\n(a) Except for customers receiving a value of solar rate under subdivision 10, a customer with a net metered facility having a capacity of 40 kilowatts or greater but less than 1,000 kilowatts that is interconnected to a public utility may elect to be compensated for the customer's net input into the utility system in the form of a kilowatt-hour credit on the customer's energy bill carried forward and applied to subsequent energy bills. Any net input supplied by the customer into the utility system that exceeds energy supplied to the customer by the utility during a calendar year must be compensated at the applicable rate.\n(b) A public utility may not impose a standby charge on a net metered or qualifying facility:\n(1) of 100 kilowatts or less capacity; or\n(2) of more than 100 kilowatts capacity, except in accordance with an order of the commission establishing the allowable costs to be recovered through standby charges.\n(a) Except as otherwise provided in paragraph (c), this subdivision shall apply to all qualifying facilities having 40-kilowatt capacity or more as well as qualifying facilities as defined in subdivision 3 and net metered facilities under subdivision 3a, if interconnected to a cooperative electric association or municipal utility, or 1,000-kilowatt capacity or more if interconnected to a public utility, which elect to be governed by its provisions.\n(b) The utility to which the qualifying facility is interconnected shall purchase all energy and capacity made available by the qualifying facility. The qualifying facility shall be paid the utility's full avoided capacity and energy costs as negotiated by the parties, as set by the commission, or as determined through competitive bidding approved by the commission. The full avoided capacity and energy costs to be paid a qualifying facility that generates electric power by means of a renewable energy source are the utility's least cost renewable energy facility or the bid of a competing supplier of a least cost renewable energy facility, whichever is lower, unless the commission's resource plan order, under section 216B.2422, subdivision 2, provides that the use of a renewable resource to meet the identified capacity need is not in the public interest.\n(c) For all qualifying facilities having 30-kilowatt capacity or more, the utility shall, at the qualifying facility's or the utility's request, provide wheeling or exchange agreements wherever practicable to sell the qualifying facility's output to any other Minnesota utility having generation expansion anticipated or planned for the ensuing ten years. The commission shall establish the methods and procedures to insure that except for reasonable wheeling charges and line losses, the qualifying facility receives the full avoided energy and capacity costs of the utility ultimately receiving the output.\n(d) The commission shall set rates for electricity generated by renewable energy.\n(a) For the purpose of measuring electricity under subdivisions 3 and 3a, a public utility must aggregate for billing purposes a customer's designated meter with one or more aggregated meters if a customer requests that it do so. To qualify for aggregation under this subdivision, a meter must be owned by the customer requesting the aggregation, must be located on contiguous property owned by the customer requesting the aggregation, and the total of all aggregated meters must be subject to the size limitation in this section.\n(b) A public utility must comply with a request by a customer-generator to aggregate additional meters within 90 days. The specific meters must be identified at the time of the request. In the event that more than one meter is identified, the customer must designate the rank order for the aggregated meters to which the net metered credits are to be applied. At least 60 days prior to the beginning of the next annual billing period, a customer may amend the rank order of the aggregated meters, subject to this subdivision.\n(c) The aggregation of meters applies only to charges that use kilowatt-hours as the billing determinant. All other charges applicable to each meter account shall be billed to the customer.\n(d) A public utility will first apply the kilowatt-hour credit to the charges for the designated meter and then to the charges for the aggregated meters in the rank order specified by the customer. If the net metered facility supplies more electricity to the public utility than the energy usage recorded by the customer-generator's designated and aggregated meters during a monthly billing period, the public utility shall apply credits to the customer's next monthly bill for the excess kilowatt-hours.\n(e) With the commission's prior approval, a public utility may charge the customer-generator requesting to aggregate meters a reasonable fee to cover the administrative costs incurred in implementing the costs of this subdivision, pursuant to a tariff approved by the commission for a public utility.\nThe commission may limit the cumulative generation of net metered facilities under subdivisions 3 and 3a. A public utility may request the commission to limit the cumulative generation of net metered facilities under subdivisions 3 and 3a upon a showing that such generation has reached four percent of the public utility's annual retail electricity sales. The commission may limit additional net metering obligations under this subdivision only after providing notice and opportunity for public comment. In determining whether to limit additional net metering obligations under this subdivision, the commission shall consider:\n(1) the environmental and other public policy benefits of net metered facilities;\n(2) the impact of net metered facilities on electricity rates for customers without net metered systems;\n(3) the effects of net metering on the reliability of the electric system;\n(4) technical advances or technical concerns; and\n(5) other statutory obligations imposed on the commission or on a utility.\nThe commission may limit additional net metering obligations under clauses (2) to (4) only if it determines that additional net metering obligations would cause significant rate impact, require significant measures to address reliability, or raise significant technical issues.\n(a) A public utility that provides retail electric service may require customers with a facility of 40-kilowatt capacity or more and participating in net metering and net billing to limit the total generation capacity of individual distributed generation systems by either:\n(1) for wind generation systems, limiting the total generation system capacity kilowatt alternating current to 120 percent of the customer's on-site maximum electric demand; or\n(2) for solar photovoltaic and other distributed generation, limiting the total generation system annual energy production kilowatt hours alternating current to 120 percent of the customer's on-site annual electric energy consumption.\n(b) Limits under paragraph (a) must be based on standard 15-minute intervals, measured during the previous 12 calendar months, or on a reasonable estimate of the average monthly maximum demand or average annual consumption if the customer has either:\n(1) less than 12 calendar months of actual electric usage; or\n(2) no demand metering available.\n(a) In the event of disputes between a public utility and a qualifying facility, either party may request a determination of the issue by the commission. In any such determination, the burden of proof shall be on the public utility. The commission in its order resolving each such dispute shall require payments to the prevailing party of the prevailing party's costs, disbursements, and reasonable attorneys' fees, except that the qualifying facility will be required to pay the costs, disbursements, and attorneys' fees of the public utility only if the commission finds that the claims of the qualifying facility in the dispute have been made in bad faith, or are a sham, or are frivolous.\n(b) Notwithstanding subdivisions 9 and 11, a qualifying facility over 20 megawatts may, until December 31, 2022, request that the commission resolve a dispute with any utility, including a cooperative electric association or municipal utility, under paragraph (a).\n(a) The commission shall promulgate rules to implement the provisions of this section. The commission shall also establish a uniform statewide form of contract for use between utilities and a net metered or qualifying facility having less than 1,000-kilowatt capacity if interconnected to a public utility or less than 40-kilowatt capacity if interconnected to a cooperative electric association or municipal utility.\n(b) The commission shall require the qualifying facility to provide the utility with reasonable access to the premises and equipment of the qualifying facility if the particular configuration of the qualifying facility precludes disconnection or testing of the qualifying facility from the utility side of the interconnection with the utility remaining responsible for its personnel.\n(c) The uniform statewide form of contract shall be applied to all new and existing interconnections established between a utility and a net metered or qualifying facility having less than 40-kilowatt capacity, except that existing contracts may remain in force until terminated by mutual agreement between both parties.\n[Repealed, 1994 c 465 art 1 s 27]\n(a) Utilities shall be required to interconnect with a qualifying facility that offers to provide available energy or capacity and that satisfies the requirements of this section.\n(b) Nothing contained in this section shall be construed to excuse the qualifying facility from any obligation for costs of interconnection and wheeling in excess of those normally incurred by the utility for customers with similar load characteristics who are not cogenerators or small power producers, or from any fixed charges normally assessed such nongenerating customers.\nFor purposes of this section only and with respect to municipal electric utilities only, the term \"commission\" means the governing body of each municipal electric utility that adopts and has in effect rules implementing this section which are consistent with the rules adopted by the Minnesota Public Utilities Commission under subdivision 6. As used in this subdivision, the governing body of a municipal electric utility means the city council of that municipality; except that, if another board, commission, or body is empowered by law or resolution of the city council or by its charter to establish and regulate rates and days for the distribution of electric energy within the service area of the city, that board, commission, or body shall be considered the governing body of the municipal electric utility.\n(a) A public utility may apply for commission approval for an alternative tariff that compensates customers through a bill credit mechanism for the value to the utility, its customers, and society for operating distributed solar photovoltaic resources interconnected to the utility system and operated by customers primarily for meeting their own energy needs.\n(b) If approved, the alternative tariff shall apply to customers' interconnections occurring after the date of approval. The alternative tariff is in lieu of the applicable rate under subdivisions 3 and 3a.\n(c) The commission shall after notice and opportunity for public comment approve the alternative tariff provided the utility has demonstrated the alternative tariff:\n(1) appropriately applies the methodology established by the department and approved by the commission under this subdivision;\n(2) includes a mechanism to allow recovery of the cost to serve customers receiving the alternative tariff rate;\n(3) charges the customer for all electricity consumed by the customer at the applicable rate schedule for sales to that class of customer;\n(4) credits the customer for all electricity generated by the solar photovoltaic device at the distributed solar value rate established under this subdivision;\n(5) applies the charges and credits in clauses (3) and (4) to a monthly bill that includes a provision so that the unused portion of the credit in any month or billing period shall be carried forward and credited against all charges. In the event that the customer has a positive balance after the 12-month cycle ending on the last day in February, that balance will be eliminated and the credit cycle will restart the following billing period beginning on March 1;\n(6) complies with the size limits specified in subdivision 3a;\n(7) complies with the interconnection requirements under section 216B.1611; and\n(8) complies with the standby charge requirements in subdivision 3a, paragraph (b).\n(d) A utility must provide to the customer the meter and any other equipment needed to provide service under the alternative tariff.\n(e) The department must establish the distributed solar value methodology in paragraph (c), clause (1), no later than January 31, 2014. The department must submit the methodology to the commission for approval. The commission must approve, modify with the consent of the department, or disapprove the methodology within 60 days of its submission. When developing the distributed solar value methodology, the department shall consult stakeholders with experience and expertise in power systems, solar energy, and electric utility ratemaking regarding the proposed methodology, underlying assumptions, and preliminary data.\n(f) The distributed solar value methodology established by the department must, at a minimum, account for the value of energy and its delivery, generation capacity, transmission capacity, transmission and distribution line losses, and environmental value. The department may, based on known and measurable evidence of the cost or benefit of solar operation to the utility, incorporate other values into the methodology, including credit for locally manufactured or assembled energy systems, systems installed at high-value locations on the distribution grid, or other factors.\n(g) The credit for distributed solar value applied to alternative tariffs approved under this section shall represent the present value of the future revenue streams of the value components identified in paragraph (f).\n(h) The utility shall recalculate the alternative tariff on an annual cycle, and shall file the recalculated alternative tariff with the commission for approval.\n(i) Renewable energy credits for solar energy credited under this subdivision belong to the electric utility providing the credit.\n(j) The commission may not authorize a utility to charge an alternative tariff rate that is lower than the utility's applicable retail rate until three years after the commission approves an alternative tariff for the utility.\n(k) A utility must enter into a contract with an owner of a solar photovoltaic device receiving an alternative tariff rate under this section that has a term of at least 20 years, unless a shorter term is agreed to by the parties.\n(l) An owner of a solar photovoltaic device receiving an alternative tariff rate under this section must be paid the same rate per kilowatt-hour generated each year for the term of the contract.\n(a) For purposes of this section only, the term \"commission\" means the board of directors of a cooperative association that (1) elects, by resolution, to assume the authority delegated to the Public Utilities Commission over cooperative electric associations under this section, and (2) adopts and has in effect rules implementing this section. The rules must provide for a process to resolve disputes that arise under this section, and must include a provision that a request by either party for mediation of the dispute by an independent third party must be implemented in accordance with paragraph (b). A cooperative electric association that has adopted a resolution and rules under this subdivision is exempt from regulation by the Public Utilities Commission under this section.\n(b) In the event of a dispute between a cooperative electric association and one or more of its members, either party may request mediation of the dispute only after all attempts to settle the dispute under the cooperative electric association's dispute resolution process have been exhausted. The parties must mutually agree upon the selection of a mediator, who must be listed on the roster of neutrals for civil matters established by the state court administrator under Rule 114.12 of Minnesota's General Rules of Practice for the District Courts. The cooperative electric association shall pay 90 percent of the cost of mediation, and the member or members who initiated the dispute shall pay ten percent of the cost of mediation.\n(c) Except as provided in paragraph (d), any proceedings concerning the activities of a cooperative electric association under this section that are pending at the Public Utilities Commission on May 31, 2017, are terminated on that date.\n(d) The Public Utilities Commission may complete its investigation in Docket No. 16-512 to assess whether the methodology used by cooperative associations to establish a fee under subdivision 3, paragraph (a), complies with state law if the commission determines that completing the investigation is necessary to protect the public interest, in which case it shall complete the investigation no later than December 31, 2017. A methodology that the commission determines complies with state law may not be challenged in a dispute under this section. If the commission determines that a methodology does not comply with state law, it shall clearly state the changes necessary to bring the methodology into compliance, and a cooperative electric association shall modify its methodology in accordance with the commission's directives.\n(e) For a cooperative electric association that elects to operate under the provisions of paragraph (a), disputes arising under this section subsequent to a cooperative electric association's modification of its methodology under paragraph (d) shall be addressed under the cooperative association's rules and paragraph (b), as applicable.\nA utility must provide a customer's electricity usage data to the customer within ten days of the date the utility receives a request from the customer that is accompanied by evidence that the energy usage data is relevant to the interconnection of a qualifying facility on behalf of the customer. For the purposes of this subdivision, \"electricity usage data\" includes but is not limited to: (1) the total amount of electricity used by a customer monthly; (2) usage by time period if the customer operates under a tariff where costs vary by time of use; and (3) usage data that is used to calculate a customer's demand charge.",
	"repealed": false
}