{
	"id": "142A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/142A.03",
	"title": "142A.03 COMMISSIONER.",
	"text": "The department is under the administrative control of the commissioner. The commissioner is appointed by the governor with the advice and consent of the senate. The commissioner has the general powers provided in section 15.06, subdivision 6. The commissioner's salary must be established according to the procedure in section 15A.0815, subdivision 5, in the same range as specified for the commissioner of management and budget.\n(a) The commissioner may apply for and accept on behalf of the state any grants, bequests, gifts, or contributions for the purpose of carrying out the duties and responsibilities of the commissioner. Any money received under this paragraph is appropriated and dedicated for the purpose for which the money is granted. The commissioner must biennially report to the chairs and ranking minority members of relevant legislative committees and divisions by January 15 of each even-numbered year a list of all grants and gifts received under this subdivision.\n(b) Pursuant to law, the commissioner may apply for and receive money made available from federal sources for the purpose of carrying out the duties and responsibilities of the commissioner.\n(c) The commissioner may make contracts with and grants to Tribal Nations, public and private agencies, for-profit and nonprofit organizations, and individuals using appropriated money.\n(d) The commissioner must develop program objectives and performance measures for evaluating progress toward achieving the objectives. The commissioner must identify the objectives, performance measures, and current status of achieving the measures in a biennial report to the chairs and ranking minority members of relevant legislative committees and divisions. The report is due no later than January 15 each even-numbered year. The report must include, when possible, the following objectives:\n(1) centering and including the lived experiences of children and youth, including those with disabilities and mental illness and their families, in all aspects of the department's work;\n(2) increasing the effectiveness of the department's programs in addressing the needs of children and youth facing racial, economic, or geographic inequities;\n(3) increasing coordination and reducing inefficiencies among the department's programs and the funding sources that support the programs;\n(4) increasing the alignment and coordination of family access to child care and early learning programs and improving systems of support for early childhood and learning providers and services;\n(5) improving the connection between the department's programs and the kindergarten through grade 12 and higher education systems; and\n(6) minimizing and streamlining the effort required of youth and families to receive services to which the youth and families are entitled.\n(e) The commissioner shall administer and supervise the forms of public assistance and other activities or services that are vested in the commissioner. Administration and supervision of activities or services includes but is not limited to assuring timely and accurate distribution of benefits, completeness of service, and quality program management. In addition to administering and supervising activities vested by law in the department, the commissioner has the authority to:\n(1) require county agency participation in training and technical assistance programs to promote compliance with statutes, rules, federal laws, regulations, and policies governing the programs and activities administered by the commissioner;\n(2) monitor, on an ongoing basis, the performance of county agencies in the operation and administration of activities and programs; enforce compliance with statutes, rules, federal laws, regulations, and policies governing welfare services; and promote excellence of administration and program operation;\n(3) develop a quality control program or other monitoring program to review county performance and accuracy of benefit determinations;\n(4) require county agencies to make an adjustment to the public assistance benefits issued to any individual consistent with federal law and regulation and state law and rule and to issue or recover benefits as appropriate;\n(5) delay or deny payment of all or part of the state and federal share of benefits and administrative reimbursement according to the procedures set forth in section 142A.10;\n(6) make contracts with and grants to public and private agencies and organizations, both for-profit and nonprofit, and individuals, using appropriated funds; and\n(7) enter into contractual agreements with federally recognized Indian Tribes with a reservation in Minnesota to the extent necessary for the Tribe to operate a federally approved family assistance program or any other program under the supervision of the commissioner. The commissioner shall consult with the affected county or counties in the contractual agreement negotiations, if the county or counties wish to be included, in order to avoid the duplication of county and Tribal assistance program services. The commissioner may establish necessary accounts for the purposes of receiving and disbursing funds as necessary for the operation of the programs.\nThe commissioner shall work in conjunction with the commissioner of human services to carry out the duties of this paragraph when necessary and feasible.\n(f) The commissioner shall inform county agencies, on a timely basis, of changes in statute, rule, federal law, regulation, and policy necessary to county agency administration of the programs and activities administered by the commissioner.\n(g) The commissioner shall administer and supervise child welfare activities, including promoting the enforcement of laws preventing child maltreatment and protecting children with a disability and children who are in need of protection or services, licensing and supervising child care and child-placing agencies, and supervising the care of children in foster care. The commissioner shall coordinate with the commissioner of human services on activities impacting children overseen by the Department of Human Services, such as disability services, behavioral health, and substance use disorder treatment.\n(h) The commissioner shall assist and cooperate with local, state, and federal departments, agencies, and institutions.\n(i) The commissioner shall establish and maintain any administrative units reasonably necessary for the performance of administrative functions common to all divisions of the department.\n(j) The commissioner shall act as designated guardian of children pursuant to chapter 260C. For children under the guardianship of the commissioner or a Tribe in Minnesota recognized by the Secretary of the Interior whose interests would be best served by adoptive placement, the commissioner may contract with a licensed child-placing agency or a Minnesota Tribal social services agency to provide adoption services. A contract with a licensed child-placing agency must be designed to supplement existing county efforts and may not replace existing county programs or Tribal social services, unless the replacement is agreed to by the county board and the appropriate exclusive bargaining representative, Tribal governing body, or the commissioner has evidence that child placements of the county continue to be substantially below that of other counties. Funds encumbered and obligated under an agreement for a specific child shall remain available until the terms of the agreement are fulfilled or the agreement is terminated.\n(k) The commissioner has the authority to conduct and administer experimental projects to test methods and procedures of administering assistance and services to recipients or potential recipients of public benefits. To carry out the experimental projects, the commissioner may waive the enforcement of existing specific statutory program requirements, rules, and standards in one or more counties. The order establishing the waiver must provide alternative methods and procedures of administration and must not conflict with the basic purposes, coverage, or benefits provided by law. No project under this paragraph shall exceed four years. No order establishing an experimental project as authorized by this paragraph is effective until the following conditions have been met:\n(1) the United States Secretary of Health and Human Services has agreed, for the same project, to waive state plan requirements relative to statewide uniformity; and\n(2) a comprehensive plan, including estimated project costs, has been approved by the Legislative Advisory Commission and filed with the commissioner of administration.\n(l) The commissioner shall, according to federal requirements and in coordination with the commissioner of human services, establish procedures to be followed by local welfare boards in creating citizen advisory committees, including procedures for selection of committee members.\n(m) The commissioner shall allocate federal fiscal disallowances or sanctions that are based on quality control error rates for the aid to families with dependent children (AFDC) program formerly codified in sections 256.72 to 256.87 or the Supplemental Nutrition Assistance Program (SNAP) in the following manner:\n(1) one-half of the total amount of the disallowance shall be borne by the county boards responsible for administering the programs. For AFDC, disallowances shall be shared by each county board in the same proportion as that county's expenditures to the total of all counties' expenditures for AFDC. For SNAP, sanctions shall be shared by each county board, with 50 percent of the sanction being distributed to each county in the same proportion as that county's administrative costs for SNAP benefits are to the total of all SNAP administrative costs for all counties, and 50 percent of the sanctions being distributed to each county in the same proportion as that county's value of SNAP benefits issued are to the total of all benefits issued for all counties. Each county shall pay its share of the disallowance to the state of Minnesota. When a county fails to pay the amount due under this paragraph, the commissioner may deduct the amount from reimbursement otherwise due the county, or the attorney general, upon the request of the commissioner, may institute civil action to recover the amount due; and\n(2) notwithstanding the provisions of clause (1), if the disallowance results from knowing noncompliance by one or more counties with a specific program instruction, and that knowing noncompliance is a matter of official county board record, the commissioner may require payment or recover from the county or counties, in the manner prescribed in clause (1), an amount equal to the portion of the total disallowance that resulted from the noncompliance and may distribute the balance of the disallowance according to clause (1).\n(n) The commissioner shall develop and implement special projects that maximize reimbursements and result in the recovery of money to the state. For the purpose of recovering state money, the commissioner may enter into contracts with third parties. Any recoveries that result from projects or contracts entered into under this paragraph shall be deposited in the state treasury and credited to a special account until the balance in the account reaches $1,000,000. When the balance in the account exceeds $1,000,000, the excess shall be transferred and credited to the general fund. All money in the account is appropriated to the commissioner for the purposes of this paragraph.\n(o) The commissioner has the authority to establish and enforce the following county reporting requirements:\n(1) the commissioner shall establish fiscal and statistical reporting requirements necessary to account for the expenditure of funds allocated to counties for programs administered by the commissioner. When establishing financial and statistical reporting requirements, the commissioner shall evaluate all reports, in consultation with the counties, to determine if the reports can be simplified or the number of reports can be reduced;\n(2) the county board shall submit monthly or quarterly reports to the department as required by the commissioner. Monthly reports are due no later than 15 working days after the end of the month. Quarterly reports are due no later than 30 calendar days after the end of the quarter, unless the commissioner determines that the deadline must be shortened to 20 calendar days to avoid jeopardizing compliance with federal deadlines or risking a loss of federal funding. Only reports that are complete, legible, and in the required format shall be accepted by the commissioner;\n(3) if the required reports are not received by the deadlines established in clause (2), the commissioner may delay payments and withhold funds from the county board until the next reporting period. When the report is needed to account for the use of federal funds and the late report results in a reduction in federal funding, the commissioner shall withhold from the county boards with late reports an amount equal to the reduction in federal funding until full federal funding is received;\n(4) a county board that submits reports that are late, illegible, incomplete, or not in the required format for two out of three consecutive reporting periods is considered noncompliant. When a county board is found to be noncompliant, the commissioner shall notify the county board of the reason the county board is considered noncompliant and request that the county board develop a corrective action plan stating how the county board plans to correct the problem. The corrective action plan must be submitted to the commissioner within 45 days after the date the county board received notice of noncompliance;\n(5) the final deadline for fiscal reports or amendments to fiscal reports is one year after the date the report was originally due. If the commissioner does not receive a report by the final deadline, the county board forfeits the funding associated with the report for that reporting period and the county board must repay any funds associated with the report received for that reporting period;\n(6) the commissioner may not delay payments, withhold funds, or require repayment under clause (3) or (5) if the county demonstrates that the commissioner failed to provide appropriate forms, guidelines, and technical assistance to enable the county to comply with the requirements. If the county board disagrees with an action taken by the commissioner under clause (3) or (5), the county board may appeal the action according to sections 14.57 to 14.69; and\n(7) counties subject to withholding of funds under clause (3) or forfeiture or repayment of funds under clause (5) shall not reduce or withhold benefits or services to clients to cover costs incurred due to actions taken by the commissioner under clause (3) or (5).\n(p) The commissioner shall allocate federal fiscal disallowances or sanctions for audit exceptions when federal fiscal disallowances or sanctions are based on a statewide random sample in direct proportion to each county's claim for that period.\n(q) The commissioner is responsible for ensuring the detection, prevention, investigation, and resolution of fraudulent activities or behavior by applicants, recipients, and other participants in the programs administered by the department. The commissioner shall cooperate with the commissioner of education to enforce the requirements for program integrity and fraud prevention for investigation for child care assistance under chapter 142E.\n(r) The commissioner shall require county agencies to identify overpayments, establish claims, and utilize all available and cost-beneficial methodologies to collect and recover these overpayments in the programs administered by the department.\n(s) The commissioner shall develop recommended standards for child foster care homes that address the components of specialized therapeutic services to be provided by child foster care homes with those services.\n(t) The commissioner shall authorize the method of payment to or from the department as part of the programs administered by the department. This authorization includes the receipt or disbursement of funds held by the department in a fiduciary capacity as part of the programs administered by the department.\n(u) In coordination with the commissioner of human services, the commissioner shall create and provide county and Tribal agencies with blank applications, affidavits, and other forms as necessary for public assistance programs.\n(v) The commissioner shall cooperate with the federal government and its public welfare agencies in any reasonable manner as may be necessary to qualify for federal aid for temporary assistance for needy families and in conformity with Title I of Public Law 104-193, the Personal Responsibility and Work Opportunity Reconciliation Act of 1996 and successor amendments, including making reports that contain information required by the federal Social Security Advisory Board and complying with any provisions the board may find necessary to assure the correctness and verification of the reports.\n(w) On or before January 15 in each even-numbered year, the commissioner shall make a biennial report to the governor concerning the activities of the agency.\n(x) The commissioner shall enter into agreements with other departments of the state as necessary to meet all requirements of the federal government.\n(y) The commissioner may cooperate with other state agencies in establishing reciprocal agreements in instances where a child receiving Minnesota family investment program (MFIP) assistance or its out-of-state equivalent moves or contemplates moving into or out of the state, in order that the child may continue to receive MFIP or equivalent aid from the state moved from until the child has resided for one year in the state moved to.\n(z) The commissioner shall provide appropriate technical assistance to county agencies to develop methods to have county financial workers remind and encourage recipients of aid to families with dependent children, the Minnesota family investment program, the Minnesota family investment plan, family general assistance, or SNAP benefits whose assistance unit includes at least one child under the age of five to have each young child immunized against childhood diseases. The commissioner must examine the feasibility of utilizing the capacity of a statewide computer system to assist county agency financial workers in performing this function at appropriate intervals.\n(aa) The commissioner shall have the power and authority to accept on behalf of the state contributions and gifts for the use and benefit of children under the guardianship or custody of the commissioner. The commissioner may also receive and accept on behalf of such children money due and payable to them as old age and survivors insurance benefits, veterans benefits, pensions, or other such monetary benefits. Gifts, contributions, pensions, and benefits under this paragraph must be deposited in and disbursed from the social welfare fund provided for in sections 256.88 to 256.92.\n(bb) The specific enumeration of powers and duties in this section must not be construed to be a limitation upon the general powers granted to the commissioner.\nThe commissioner must consult with the commissioner of management and budget to create, review, and revise grant program performance measures and to evaluate grant programs administered by the commissioner in accordance with section 16A.055, subdivisions 1a and 1b.\n(a) The commissioner may administer oaths and affirmations, take depositions, certify to official acts, and issue subpoenas to compel the attendance of individuals and the production of documents and other personal property necessary in connection with the administration of programs administered by the Department of Children, Youth, and Families.\n(b) The fees for service of a subpoena in paragraph (a) must be paid in the same manner as prescribed by law for a service of process issued by a district court. Witnesses must receive the same fees and mileage as in civil actions.\n(c) The subpoena in paragraph (a) shall be enforceable through the district court in the district where the subpoena is issued.\n(d) A subpoena issued under this subdivision must state that the person to whom the subpoena is directed may not disclose the fact that the subpoena was issued or the fact that the requested records have been given to law enforcement personnel or agents of the commissioner except:\n(1) insofar as the disclosure is necessary and agreed upon by the commissioner, to find and disclose the records; or\n(2) pursuant to court order.\nThe commissioner may appoint advisory task forces to provide consultation on any of the programs under the commissioner's administration and supervision. A task force shall expire and the compensation, terms of office and removal of members shall be as provided in section 15.059. Notwithstanding section 15.059, the commissioner may pay a per diem of $35 to consumers and family members whose participation is needed in legislatively authorized state-level task forces, and whose participation on the task force is not as a paid representative of any agency, organization, or association.\nThe commissioner may establish a system for the centralized disbursement of benefits administered by the commissioner as well as any related documents. Benefits must be issued by the state or county subject to section 142A.10.\nThe state agency may contract with banks or other financial institutions to provide services associated with the processing of public assistance checks and may pay a service fee for these services, provided the fee charged does not exceed the fee charged to other customers of the institution for similar services.\n(a) The commissioner shall establish a child mortality review panel to review deaths of children in Minnesota, including deaths attributed to maltreatment or in which maltreatment may be a contributing cause and to review near fatalities as defined in section 260E.35. The commissioners of health, education, human services, and public safety and the attorney general shall each designate a representative to the child mortality review panel. Other panel members shall be appointed by the commissioner, including a board-certified pathologist and a physician who is a coroner or a medical examiner. The purpose of the panel shall be to make recommendations to the state and to county agencies for improving the child protection system, including modifications in statute, rule, policy, and procedure.\n(b) The commissioner may require a county agency to establish a local child mortality review panel. The commissioner may establish procedures for conducting local reviews and may require that all professionals with knowledge of a child mortality case participate in the local review. In this section, \"professional\" means a person licensed to perform or a person performing a specific service in the child protective service system. \"Professional\" includes law enforcement personnel, social service agency attorneys, educators, and social service, health care, and mental health care providers.\n(c) If the commissioner of children, youth, and families has reason to believe that a child's death was caused by maltreatment or that maltreatment was a contributing cause, the commissioner has access to not public data under chapter 13 maintained by state agencies, statewide systems, or political subdivisions that are related to the child's death or circumstances surrounding the care of the child. The commissioner shall also have access to records of private hospitals as necessary to carry out the duties prescribed by this section. Access to data under this paragraph is limited to police investigative data; autopsy records and coroner or medical examiner investigative data; hospital, public health, or other medical records of the child; hospital and other medical records of the child's parent that relate to prenatal care; and records created by social service agencies that provided services to the child or family within three years preceding the child's death. A state agency, statewide system, or political subdivision shall provide the data upon request of the commissioner. Not public data may be shared with members of the state or local child mortality review panel in connection with an individual case.\n(d) Notwithstanding the data's classification in the possession of any other agency, data acquired by a local or state child mortality review panel in the exercise of its duties is protected nonpublic or confidential data as defined in section 13.02, but may be disclosed as necessary to carry out the purposes of the review panel. The data is not subject to subpoena or discovery. The commissioner may disclose conclusions of the review panel, but shall not disclose data that was classified as confidential or private data on decedents, under section 13.10, or private, confidential, or protected nonpublic data in the disseminating agency, except that the commissioner may disclose local social service agency data as provided in section 260E.35, on individual cases involving a fatality or near fatality of a person served by the local social service agency prior to the date of death.\n(e) A person attending a child mortality review panel meeting shall not disclose what transpired at the meeting, except to carry out the purposes of the mortality review panel. The proceedings and records of the mortality review panel are protected nonpublic data as defined in section 13.02, subdivision 13, and are not subject to discovery or introduction into evidence in a civil or criminal action against a professional, the state or a county agency, arising out of the matters the panel is reviewing. Information, documents, and records otherwise available from other sources are not immune from discovery or use in a civil or criminal action solely because they were presented during proceedings of the review panel. A person who presented information before the review panel or who is a member of the panel shall not be prevented from testifying about matters within the person's knowledge. However, in a civil or criminal proceeding a person shall not be questioned about the person's presentation of information to the review panel or opinions formed by the person as a result of the review meetings.\n[See Note.]\n(a) The commissioner shall establish a Department of Children, Youth, and Families child fatality and near fatality review team to review child fatalities and near fatalities due to child maltreatment and child fatalities and near fatalities that occur in licensed facilities and are not due to natural causes. The review team shall assess the entire child protection services process from the point of a mandated reporter reporting the alleged maltreatment through the ongoing case management process. Department staff shall lead and conduct on-site local reviews and utilize supervisors from local county and tribal child welfare agencies as peer reviewers. The review process must focus on critical elements of the case and on the involvement of the child and family with the county or tribal child welfare agency. The review team shall identify necessary program improvement planning to address any practice issues identified and training and technical assistance needs of the local agency. Summary reports of each review shall be provided to the state child mortality review panel when completed.\n(b) A member of the child fatality and near fatality review team shall not disclose what transpired during the review, except to carry out the duties of the child fatality and near fatality review team. The proceedings and records of the child fatality and near fatality review team are protected nonpublic data as defined in section 13.02, subdivision 13, and are not subject to discovery or introduction into evidence in a civil or criminal action against a professional, the state, or a county agency arising out of the matters the team is reviewing. Information, documents, and records otherwise available from other sources are not immune from discovery or use in a civil or criminal action solely because they were assessed or presented during proceedings of the review team. A person who presented information before the review team or who is a member of the team shall not be prevented from testifying about matters within the person's knowledge. In a civil or criminal proceeding a person shall not be questioned about the person's presentation of information to the review team or opinions formed by the person as a result of the review.\n[See Note.]\n(a) The commissioner of children, youth, and families may authorize projects to initiate Tribal delivery of child welfare services to American Indian children and their parents and custodians living on the reservation. The commissioner has authority to solicit and determine which Tribes may participate in a project. Grants may be issued to Minnesota Indian Tribes to support the projects. The commissioner may waive existing state rules as needed to accomplish the projects. The commissioner may authorize projects to use alternative methods of (1) screening, investigating, and assessing reports of child maltreatment, and (2) administrative reconsideration, administrative appeal, and judicial appeal of maltreatment determinations, provided the alternative methods used by the projects comply with the provisions of sections 142A.20 and 256.045 and chapter 260E that deal with the rights of individuals who are the subjects of reports or investigations, including notice and appeal rights and data practices requirements. The commissioner shall only authorize alternative methods that comply with the public policy under section 260E.01. The commissioner may seek any federal approval necessary to carry out the projects as well as seek and use any funds available to the commissioner, including use of federal funds, foundation funds, existing grant funds, and other funds. The commissioner is authorized to advance state funds as necessary to operate the projects. Federal reimbursement applicable to the projects is appropriated to the commissioner for the purposes of the projects. The projects must be required to address responsibility for safety, permanency, and well-being of children.\n(b) For the purposes of this section, \"American Indian child\" means a person under 21 years old and who is a Tribal member or eligible for membership in one of the Tribes chosen for a project under this subdivision and who is residing on the reservation of that Tribe.\n(c) In order to qualify for an American Indian child welfare project, a Tribe must:\n(1) be one of the existing Tribes with reservation land in Minnesota;\n(2) have a Tribal court with jurisdiction over child custody proceedings;\n(3) have a substantial number of children for whom determinations of maltreatment have occurred;\n(4)(i) have capacity to respond to reports of abuse and neglect under chapter 260E; or (ii) have codified the Tribe's screening, investigation, and assessment of reports of child maltreatment procedures, if authorized to use an alternative method by the commissioner under paragraph (a);\n(5) provide a wide range of services to families in need of child welfare services;\n(6) have a Tribal-state title IV-E agreement in effect; and\n(7) enter into host Tribal contracts pursuant to section 142A.07, subdivision 6.\n(d) Grants awarded under this section may be used for the nonfederal costs of providing child welfare services to American Indian children on the Tribe's reservation, including costs associated with:\n(1) assessment and prevention of child abuse and neglect;\n(2) family preservation;\n(3) facilitative, supportive, and reunification services;\n(4) out-of-home placement for children removed from the home for child protective purposes; and\n(5) other activities and services approved by the commissioner that further the goals of providing safety, permanency, and well-being of American Indian children.\n(e) When a Tribe has initiated a project and has been approved by the commissioner to assume child welfare responsibilities for American Indian children of that Tribe under this section, the affected county social service agency is relieved of responsibility for responding to reports of abuse and neglect under chapter 260E for those children during the time within which the Tribal project is in effect and funded. The commissioner shall work with Tribes and affected counties to develop procedures for data collection, evaluation, and clarification of ongoing role and financial responsibilities of the county and Tribe for child welfare services prior to initiation of the project. Children who have not been identified by the Tribe as participating in the project shall remain the responsibility of the county. Nothing in this section shall alter responsibilities of the county for law enforcement or court services.\n(f) Participating Tribes may conduct children's mental health screenings under section 245.4874, subdivision 1, paragraph (a), clause (12), for children who are eligible for the initiative and living on the reservation and who meet one of the following criteria:\n(1) the child must be receiving child protective services;\n(2) the child must be in foster care; or\n(3) the child's parents must have had parental rights suspended or terminated.\nTribes may access reimbursement from available state funds for conducting the screenings. Nothing in this section shall alter responsibilities of the county for providing services under section 245.487.\n(g) Participating Tribes may establish a local child mortality review panel. In establishing a local child mortality review panel, the Tribe agrees to conduct local child mortality reviews for child deaths or near-fatalities occurring on the reservation under subdivision 7. Tribes with established child mortality review panels shall have access to nonpublic data and shall protect nonpublic data under subdivision 7, paragraphs (c) to (e). The Tribe shall provide written notice to the commissioner and affected counties when a local child mortality review panel has been established and shall provide data upon request of the commissioner for purposes of sharing nonpublic data with members of the state child mortality review panel in connection to an individual case.\n(h) The commissioner shall collect information on outcomes relating to child safety, permanency, and well-being of American Indian children who are served in the projects. Participating Tribes must provide information to the state in a format and completeness deemed acceptable by the state to meet state and federal reporting requirements.\n(i) In consultation with the White Earth Band, the commissioner shall develop and submit to the chairs and ranking minority members of the legislative committees with jurisdiction over health and human services a plan to transfer legal responsibility for providing child protective services to White Earth Band member children residing in Hennepin County to the White Earth Band. The plan shall include a financing proposal, definitions of key terms, statutory amendments required, and other provisions required to implement the plan.\n(a) The commissioner shall establish a minimum of three citizen review panels to examine the policies and procedures of state and local welfare agencies to evaluate the extent to which the agencies are effectively discharging their child protection responsibilities. Local social service agencies shall cooperate and work with the citizen review panels. Where appropriate, the panels may examine specific cases to evaluate the effectiveness of child protection activities. The panels must examine the extent to which the state and local agencies are meeting the requirements of the federal Child Abuse Prevention and Treatment Act and the Reporting of Maltreatment of Minors Act. The commissioner may authorize mortality review panels or child protection teams to carry out the duties of a citizen review panel if membership meets or is expanded to meet the requirements of this section.\n(b) The panel membership must include volunteers who broadly represent the community in which the panel is established, including members who have expertise in the prevention and treatment of child abuse and neglect, child protection advocates, and representatives of the councils of color and ombudsperson for families.\n(c) A citizen review panel has access to the following data for specific case review under this paragraph: police investigative data; autopsy records and coroner or medical examiner investigative data; hospital, public health, or other medical records of the child; hospital and other medical records of the child's parent that relate to prenatal care; records created by social service agencies that provided services to the child or family; and personnel data related to an employee's performance in discharging child protection responsibilities. A state agency, statewide system, or political subdivision shall provide the data upon request of the commissioner. Not public data may be shared with members of the state or local citizen review panel in connection with an individual case.\n(d) Notwithstanding the data's classification in the possession of any other agency, data acquired by a local or state citizen review panel in the exercise of its duties are protected nonpublic or confidential data as defined in section 13.02, but may be disclosed as necessary to carry out the purposes of the review panel. The data are not subject to subpoena or discovery. The commissioner may disclose conclusions of the review panel, but may not disclose data on individuals that were classified as confidential or private data on individuals in the possession of the state agency, statewide system, or political subdivision from which the data were received, except that the commissioner may disclose local social service agency data as provided in section 260E.35, on individual cases involving a fatality or near fatality of a person served by the local social service agency prior to the date of death.\n(e) A person attending a citizen review panel meeting may not disclose what transpired at the meeting, except to carry out the purposes of the review panel. The proceedings and records of the review panel are protected nonpublic data as defined in section 13.02, subdivision 13, and are not subject to discovery or introduction into evidence in a civil or criminal action against a professional, the state, or county agency arising out of the matters the panel is reviewing. Information, documents, and records otherwise available from other sources are not immune from discovery or use in a civil or criminal action solely because they were presented during proceedings of the review panel. A person who presented information before the review panel or who is a member of the panel is not prevented from testifying about matters within the person's knowledge. However, in a civil or criminal proceeding, a person must not be questioned about the person's presentation of information to the review panel or opinions formed by the person as a result of the review panel meetings.\nThe commissioner shall implement a procedure for public assistance applicants and recipients to identify a language preference other than English in order to receive information pertaining to the public assistance programs in that preferred language.\nWhen the commissioner transfers operational money between programs under section 16A.285, in addition to the requirements of that section the commissioner must provide the chairs of the legislative committees that have jurisdiction over the agency's budget with sufficient detail to identify the account to which the money was originally appropriated, and the account to which the money is being transferred.\n(a) Notwithstanding any waiver of this requirement by the secretary of the United States Department of Health and Human Services, the commissioner shall utilize the Systematic Alien Verification for Entitlements (SAVE) program to conduct immigration status verifications:\n(1) as required under United States Code, title 8, section 1642; and\n(2) for all applicants for food assistance benefits, whether under the federal SNAP, the MFIP or work first program, or the Minnesota food assistance program.\n(b) The commissioner shall comply with the reporting requirements under United States Code, title 42, section 611a, and any federal regulation or guidance adopted under that law.\n(a) The commissioner shall comply with the federal requirements in Public Law 110-379 in implementing the Public Assistance Reporting Information System (PARIS) to determine eligibility for all individuals applying for public benefits under chapter 142E and the Supplemental Nutrition Assistance Program.\n(b) The commissioner shall determine eligibility under paragraph (a) by performing data matches, including matching with medical assistance, cash, child care, and supplemental assistance programs operated by other states.\n(a) The state court administrator shall provide a report every six months by electronic means to the commissioner of children, youth, and families, including the name, address, date of birth, and, if available, driver's license or state identification card number, date of the sentence, effective date of the sentence, and county in which the conviction occurred, of each person convicted of a felony under chapter 152, except for convictions under section 152.0263 or 152.0264, during the previous six months.\n(b) The commissioner shall determine whether the individuals who are the subject of the data reported under paragraph (a) are receiving public assistance under chapter 142F or 142G, and if an individual is receiving assistance under chapter 142F or 142G, the commissioner shall instruct the county to proceed under section 142G.18 or 256D.024, whichever is applicable, for the individual.\n(c) The commissioner shall not retain any data received under paragraph (a) that does not relate to an individual receiving publicly funded assistance under chapter 142F or 142G.\n(a) The commissioner of public safety shall, on a monthly basis, provide the commissioner of children, youth, and families with the first, middle, and last name, the address, date of birth, driver's license or state identification card number, and all photographs or electronically produced images of all applicants and holders whose drivers' licenses and state identification cards have been canceled under section 171.14, paragraph (a), clause (2) or (3), by the commissioner of public safety. After the initial data report has been provided by the commissioner of public safety to the commissioner of children, youth, and families under this paragraph, subsequent reports shall only include cancellations that occurred after the end date of the cancellations represented in the previous data report.\n(b) The commissioner of children, youth, and families shall compare the information provided under paragraph (a) with the commissioner's data regarding recipients of all public assistance programs managed by the Department of Children, Youth, and Families to determine whether any individual with multiple identification cards issued by the Department of Public Safety has illegally or improperly enrolled in any public assistance program managed by the Department of Children, Youth, and Families.\n(c) If the commissioner of children, youth, and families determines that an applicant or recipient has illegally or improperly enrolled in any public assistance program, the commissioner shall provide all due process protections to the individual before terminating the individual from the program according to applicable statute and notifying the county attorney.\n(a) The commissioner of public safety shall, on a monthly basis, provide the commissioner of children, youth, and families with the first, middle, and last name, and address, date of birth, and driver's license or state identification card number of all applicants and holders of drivers' licenses and state identification cards whose temporary legal presence date has expired and as a result the driver's license or identification card has been accordingly canceled under section 171.14 by the commissioner of public safety.\n(b) The commissioner of children, youth, and families shall use the information provided under paragraph (a) to determine whether the eligibility of any recipients of public assistance programs managed by the Department of Children, Youth, and Families has changed as a result of the status change in the Department of Public Safety data.\n(c) If the commissioner of children, youth, and families determines that a recipient has illegally or improperly received benefits from any public assistance program, the commissioner shall provide all due process protections to the individual before terminating the individual from the program according to applicable statute and notifying the county attorney.\nThe commissioner of children, youth, and families may contract directly with nonprofit organizations providing homeless services in two or more counties.\nNotwithstanding sections 16A.013 to 16A.016, the commissioner may accept, on behalf of the state, additional funding from sources other than state funds for the purpose of financing the cost of assistance program grants or nongrant administration. All additional funding is appropriated to the commissioner for use as designated by the grantor of funding.\nIn the event of disruption of technical systems or computer operations, the commissioner may use available grant appropriations to ensure continuity of payments for maintaining the health, safety, and well-being of clients served by programs administered by the Department of Children, Youth, and Families. Grant funds must be used in a manner consistent with the original intent of the appropriation.\nFederal administrative reimbursement resulting from the federal child support grant expenditures authorized under United States Code, title 42, section 1315, is appropriated to the commissioner.\nFederal reimbursement for privatized adoption grant and foster care recruitment grant expenditures is appropriated to the commissioner for adoption grants and foster care and adoption administrative purposes.\nThe commissioner may transfer appropriations to, and account for DCYF receipt center operations in, the special revenue fund.\nThe nonfederal share of activities for which federal administrative reimbursement is appropriated to the commissioner may be transferred to the special revenue fund.\nJob applicants for professional, administrative, or highly technical positions recruited by the commissioner may be reimbursed for necessary travel expenses to and from interviews arranged by the commissioner.\nPrior to implementing any substantial changes to a grant funding formula disbursed through allocations administered by the commissioner, the commissioner must provide a report on the nature of the changes, the effect the changes will have, whether any funding will change, and other relevant information, to the chairs and ranking minority members of the legislative committees with jurisdiction over children, youth, and families. The report must be provided prior to the start of a regular session, and the proposed changes cannot be implemented until after the adjournment of that regular session.\nThe commissioner of children, youth, and families is authorized to enter into contracts with the United States Departments of Health and Human Services, Education, and Interior, and the Bureau of Indian Affairs, for the purpose of receiving federal grants for the support of Minnesota's Indian communities.\n(a) The commissioner, to the extent that state and federal money is available, shall reimburse any county for all benefits costs expended by the county to any Indian who is an enrolled member of the Red Lake Band of Chippewa and resides upon the Red Lake Indian Reservation. The commissioner may advance payments to a county on an estimated basis subject to audit and adjustment at the end of each state fiscal year. Reimbursements shall be prorated if the state appropriation for this purpose is insufficient to provide full reimbursement.\n(b) The commissioner may promulgate rules for the carrying out of the provisions of this subdivision and may negotiate for and accept grants from the United States government for the purposes of this section.\nFor any applicable facility licensed or operated by the commissioner, the commissioner shall abide by and enforce the nonrulemaking provisions of sections 245.825 and 245.8251 and any rules adopted by the commissioner of human services pursuant to those sections. The commissioner shall cooperate with the commissioner of human services in any data collection and reviews of rules related to sections 245.825 and 245.8251.\n(a) The commissioner shall notify the house of representatives Ways and Means and senate Finance Committees of the terms of any contractual arrangement entered into by the commissioner and the attorney general, pursuant to an order of any court of law that provides for the receipt of funds by the commissioner.\n(b) Any funds recovered or received by the commissioner pursuant to an order of any court of law shall be placed in the general fund.\nThe commissioner may accept, on behalf of the state, funds donated from private postsecondary institutions, as the state's share in claiming federal Title IV-E reimbursement, to support the Child Welfare State/University Partnership, consistent with Code of Federal Regulations, title 45, part 235, section 235.66, Sources of State Funds, if the funds:\n(1) are transferred to the state and under the state's administrative control;\n(2) are donated with no restriction that the funds be used for the training of a particular individual or at a particular facility or institution; and\n(3) do not revert to the donor's facility or use.\nIt shall be the duty of the commissioner of children, youth, and families to promote the enforcement of all laws for the protection of children with developmental disabilities and dependent, neglected, and delinquent children, to cooperate to this end with juvenile courts and all reputable child-helping and child-placing agencies of a public or private character, and to take the initiative in all matters involving the interests of such children where adequate provision therefor has not already been made. The commissioner may appoint a chief executive officer and such assistants as shall be necessary to carry out the purposes of this section and section 257.33.\nIt shall be the duty of the commissioner of children, youth, and families to offer appropriate social services to any pregnant woman who is in need of social services under criteria prescribed by rule of the commissioner. The commissioner shall also offer appropriate social services to the woman and her child after the birth of the child.\n(a) Every birth to a minor shall be reported by the hospital where the birth occurs, within three working days after the birth. The hospital shall make the report to the county social services agency in the county in which the minor mother resides and shall notify the minor that the report has been made. The county social services agency shall contact any minor mother who does not have a case manager who resides in the county and determine whether she has a plan for herself and her child. The plan must consider:\n(1) the age of the minor parent;\n(2) the involvement of the minor's parents or of other adults who provide active, ongoing guidance, support, and supervision;\n(3) the involvement of the father of the minor's child, including steps being taken to establish paternity, if appropriate;\n(4) a decision of the minor to keep and raise her child or place the child for adoption;\n(5) completion of high school or a commissioner of education-selected high school equivalency program;\n(6) current economic support of the minor parent and child and plans for economic self-sufficiency;\n(7) parenting skills of the minor parent;\n(8) living arrangement of the minor parent and child;\n(9) child care and transportation needed for education, training, or employment;\n(10) ongoing health care; and\n(11) other services as needed to address personal or family problems or to facilitate the personal growth and development and economic self-sufficiency of the minor parent and child.\n(b) If the minor parent does not have a plan for herself and child, the county social services agency shall work with her to develop a plan and shall provide case management services as needed to assure the resources and services are available to meet the plan requirements.\n(c) If the minor parent refuses to plan for herself and her child or fails, without good cause, to follow through on an agreed-upon plan, the county social services agency may file a petition under section 260C.141 seeking an order for protective supervision under section 260C.201, subdivision 1, clause (a), on the grounds that the minor parent's child is dependent due to the state of immaturity of the minor parent. A contract with a minor parent under section 142G.57, subdivision 2, is an \"agreed-upon plan\" for purposes of this section.",
	"repealed": false
}