{
	"id": "146B.07",
	"url": "https://www.revisor.mn.gov/statutes/cite/146B.07",
	"title": "146B.07 PROFESSIONAL STANDARDS.",
	"text": "(a) A technician shall require proof of age from clients who state they are 18 years of age or older before performing any body art procedure on a client. Proof of age must be established by one of the following methods:\n(1) a valid driver's license or identification card issued by the state of Minnesota or another state that includes a photograph and date of birth of the individual;\n(2) a valid military identification card issued by the United States Department of Defense;\n(3) a valid passport;\n(4) a resident alien card; or\n(5) a tribal identification card.\n(b) Before performing any body art procedure, the technician must provide the client with a disclosure and authorization form that indicates whether the client has:\n(1) diabetes;\n(2) a history of hemophilia;\n(3) a history of skin diseases, skin lesions, or skin sensitivities to soap or disinfectants;\n(4) a history of epilepsy, seizures, fainting, or narcolepsy;\n(5) any condition that requires the client to take medications such as anticoagulants that thin the blood or interfere with blood clotting; or\n(6) any other information that would aid the technician in the body art procedure process evaluation.\n(c) The form must include a statement informing the client that the technician shall not perform a body art procedure if the client fails to complete or sign the disclosure and authorization form, and the technician may decline to perform a body art procedure if the client has any identified health conditions.\n(d) The technician shall ask the client to sign and date the disclosure and authorization form confirming that the information listed on the form is accurate.\n(e) Before performing any body art procedure, the technician shall offer and make available to the client personal draping, as appropriate.\n(a) A technician may perform body piercings on an individual under the age of 18 if:\n(1) the individual's parent or legal guardian is present;\n(2) the individual's parent or legal guardian provides personal identification by using one of the methods described in subdivision 1, paragraph (a), clauses (1) to (5), and provides documentation that reasonably establishes that the individual is the parent or legal guardian of the individual who is seeking the body piercing;\n(3) the individual seeking the body piercing provides proof of identification by using one of the methods described in subdivision 1, paragraph (a), clauses (1) to (5), a current student identification, or another official source that includes the name and a photograph of the individual;\n(4) a consent form and the authorization form under subdivision 1, paragraph (b) is signed by the parent or legal guardian in the presence of the technician; and\n(5) the piercing is not prohibited under paragraph (c).\n(b) Tattooing an individual under the age of 18 is a gross misdemeanor, regardless of parental or guardian consent.\n(c) No nipple or genital piercing, branding, scarification, suspension, subdermal implantation, microdermal, or tongue bifurcation shall be performed by any technician on any individual under the age of 18 regardless of parental or guardian consent.\n(d) No technician shall perform body art procedures on any individual who appears to be under the influence of alcohol, controlled substances as defined in section 152.01, subdivision 4, or hazardous substances as defined in rules adopted under chapter 182.\n(e) No technician shall perform body art procedures while under the influence of alcohol, controlled substances as defined under section 152.01, subdivision 4, or hazardous substances as defined in the rules adopted under chapter 182.\n(f) No technician shall administer anesthetic injections or other medications.\nBefore performing a body art procedure, the technician shall obtain from the client a signed and dated informed consent form. The consent form must disclose:\n(1) that a tattoo is considered permanent and may only be removed with a surgical procedure and that any effective removal may leave scarring; or\n(2) that body piercing may leave scarring.\nFor each client, the body art establishment operator shall maintain proper records of each procedure. The records of the procedure must be kept for three years and must be available for inspection by the commissioner upon request. The record must include the following:\n(1) the date of the procedure;\n(2) the information on the required picture identification showing the name, age, and current address of the client;\n(3) a copy of the authorization form signed and dated by the client required under subdivision 1, paragraph (b);\n(4) a description of the body art procedure performed;\n(5) the name and license number of the technician performing the procedure;\n(6) a copy of the consent form required under subdivision 3; and\n(7) if the client is under the age of 18 years, a copy of the consent form signed by the parent or legal guardian as required under subdivision 2.\nA technician shall provide each client with verbal and written instructions for the care of the tattooed or pierced site upon the completion of the procedure. The written instructions must advise the client of the difference between normal skin or tissue irritation and infection and to consult a health care professional upon indication of infection of the skin or tissue.\nAn operator and technician shall comply with all applicable state, county, and municipal requirements regarding public health.\nThe operator of the body art establishment shall immediately notify the commissioner and local health authority of any reports they receive of a potential bloodborne pathogen transmission.",
	"repealed": false
}