{
	"id": "103B.235",
	"url": "https://www.revisor.mn.gov/statutes/cite/103B.235",
	"title": "103B.235 LOCAL WATER MANAGEMENT PLANS.",
	"text": "(a) After the watershed plan is approved and adopted, or amended, pursuant to section 103B.231, the local government units having land use planning and regulatory responsibility for territory within the watershed shall prepare or cause to be prepared a local water management plan, capital improvement program, and official controls as necessary to bring local water management into conformance with the watershed plan within the time period prescribed in the implementation program of the watershed plan and, as necessary, shall prepare or cause to be prepared amendments to the local comprehensive plan.\n(b) Each town within the counties of Anoka, Carver, Dakota, Scott, and Washington authorized by general or special law to plan and regulate the use of land under sections 462.351 to 462.364 shall by resolution determine whether to prepare the local water management plan itself or to delegate all or part of the preparation of the plan to the county.\n(c) Towns within counties that have adopted comprehensive plans applicable to the town must use county preparation of their plan to the maximum extent possible.\n(a) Each local plan, in the degree of detail required in the watershed plan, shall:\n(1) describe existing and proposed physical environment and land use;\n(2) define drainage areas and the volumes, rates, and paths of stormwater runoff;\n(3) identify areas and elevations for stormwater storage adequate to meet performance standards established in the watershed plan;\n(4) define water quality and water quality protection methods adequate to meet performance standards established in the watershed plan;\n(5) identify regulated areas; and\n(6) set forth an implementation program, including a description of official controls and, as appropriate, a capital improvement program.\n(b) The Board of Water and Soil Resources shall adopt rules establishing minimum local plan standards and a model environmental management ordinance for use by local government units in implementing local water plans. The standards apply to plan amendments made to conform to changes in the watershed plans that are adopted under the board rules required by section 103B.231, subdivision 6.\nAfter consideration but before adoption by the governing body, each local unit shall submit its water management plan to the watershed management organization for review for consistency with the watershed plan adopted pursuant to section 103B.231. If the county or counties having territory within the local unit have a state-approved and locally adopted groundwater plan, the local unit shall submit its plan to the county or counties for review. The county or counties have 45 days to review and comment on the plan. The organization shall approve or disapprove the local plan or parts of the plan. The organization shall have 60 days to complete its review; provided, however, that the watershed management organization shall, as part of its review, take into account the comments submitted to it by the Metropolitan Council pursuant to subdivision 3a. If the organization fails to complete its review within the prescribed period, the local plan shall be deemed approved unless an extension is agreed to by the local unit.\nConcurrently with its submission of its local water management plan to the watershed management organization as provided in subdivision 3, each local unit of government shall submit its water management plan to the Metropolitan Council for review and comment by the council. The council shall have 45 days to review and comment upon the local plan or parts of the plan with respect to consistency with the council's comprehensive development guide for the metropolitan area. The council's 45-day review period shall run concurrently with the 60-day review period by the watershed management organization provided in subdivision 3. The Metropolitan Council shall submit its comments to the watershed management organization and shall send a copy of its comments to the local government unit. If the Metropolitan Council fails to complete its review and make comments to the watershed management organization within the 45-day period, the watershed management organization shall complete its review as provided in subdivision 3.\nAfter approval of the local plan by the organization, the local government unit shall adopt and implement its plan within 120 days and shall amend its official controls accordingly within 180 days.\nTo the extent and in the manner required by the organization, all amendments to local water management plans shall be submitted to the organization for review and approval in accordance with the provisions of subdivisions 3 and 3a for the review of plans.",
	"repealed": false
}