{
	"id": "92.80",
	"url": "https://www.revisor.mn.gov/statutes/cite/92.80",
	"title": "92.80 EXPEDITED EXCHANGE OF LAND WITHIN BOUNDARY WATERS CANOE AREA WILDERNESS FOR FEDERALLY OWNED LANDS.",
	"text": "(a) The purpose of this section is to expedite the exchange of a portion of the state-owned lands located within the Boundary Waters Canoe Area Wilderness. The state owns 116,559 acres of land within the wilderness area, 86,295 acres of which are school trust land.\n(b) Exchange of school trust lands within the Boundary Waters Canoe Area Wilderness for federally owned lands located outside the wilderness area will preserve the spectacular wild areas while producing economic benefits for Minnesota's public schools.\n(c) For land exchanges under this section, sections 94.342 to 94.347 apply only to the extent specified in this section.\nThe classes of state land that may be involved in an expedited exchange under this section are:\n(1) school trust land as defined in section 92.025;\n(2) university land granted to the state by acts of Congress;\n(3) all other lands acquired by the state in any manner and under the control of the commissioner of natural resources; and\n(4) all lands acquired by the state through tax forfeiture, held subject to a trust in favor of the taxing districts, and under the control of county authorities for classification, appraisal, and sale.\nAn exchange of state land under this section shall give priority to exchanges that provide the most opportunity for revenue generation for the permanent school fund, and priority shall be given to lands within the Superior National Forest in the Mesabi Purchase Unit in St. Louis County and in the following townships in St. Louis County:\n(1) Township 59 North, Range 14 West;\n(2) Township 59 North, Range 13 West;\n(3) Township 60 North, Range 13 West; and\n(4) Township 60 North, Range 12 West.\n(a) In an exchange of school trust land, university land, or other land under the control of the commissioner of natural resources for land owned by the United States, the examination and value determination of the land shall be done in a manner as agreed to between the commissioner and the authorized representative of the United States.\n(b) In an exchange of tax-forfeited land for land owned by the United States, the examination and value determination shall be done in a manner as agreed to between the county board and the authorized representative of the United States.\n(c) All lands exchanged under this section shall be exchanged only for lands of at least substantially equal value. For the purposes of this subdivision, \"substantially equal value\" has the meaning given under section 94.343, subdivision 3, paragraph (b). No payment is due either party if the lands are of substantially equal value but are not of the same value.\n(d) The goals of the exchange shall be:\n(1) the state receiving at least as many acres as the number given in exchange by the state; and\n(2) reuniting mineral and surface rights.\nTitle to the land must be examined to the extent necessary for the parties to determine that the title is good, with any encumbrances identified. The parties to the exchange may use title insurance to aid in the determination.\nIn accordance with the Minnesota Constitution, article XI, section 10, all expedited land exchanges under this section require the unanimous approval of the Land Exchange Board.\n(a) Conveyance of school trust land, university land, or other land under the control of the commissioner of natural resources shall be made by deed executed by the commissioner in the name of the state. Conveyance of tax-forfeited land shall be by a deed executed by the commissioner of revenue in the name of the state.\n(b) School trust land, university land, and other land under the control of the commissioner of natural resources and given in exchange is subject to reservations under section 94.343, subdivision 4, and the Minnesota Constitution, article XI, section 10. Tax-forfeited land given in exchange is subject to reservations under section 94.344, subdivision 4, and the Minnesota Constitution, article XI, section 10.\n(c) All deeds shall be recorded or registered in the county in which the lands lie.\nLand received in exchange for school trust land, university land, or other land under the control of the commissioner of natural resources is subject to the same trust, if any, and otherwise has the same status as the land given in exchange. Land received in exchange for tax-forfeited land is subject to a trust in favor of the governmental subdivision in which it lies and all laws relating to tax-forfeited land.",
	"repealed": false
}