{
	"id": "383B.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/383B.81",
	"title": "383B.81 ENVIRONMENTAL RESPONSE FUND.",
	"text": "An environmental response fund is created for the purposes specified in this section. The taxes imposed by section 383B.80 must be deposited in the fund. The board of county commissioners shall administer the fund either as a county board, a housing and redevelopment authority, or a regional rail authority.\n(a) The fund created in subdivision 1 must be used for the following purposes:\n(1) acquisition through purchase or condemnation of lands or property which are polluted or contaminated with hazardous substances;\n(2) paying the costs associated with indemnifying or holding harmless the entity taking title to lands or property from any liability arising out of the ownership, remediation, or use of the land or property;\n(3) paying for the costs of remediating the acquired land or property;\n(4) paying the costs associated with remediating lands or property which are polluted or contaminated with hazardous substances; or\n(5) paying for the costs associated with improving the property for economic development, recreational, housing, transportation or rail traffic.\n(b) No more than three percent of the fund may be used each year for the costs of administration.\nIn expending funds under this section the county shall seek matching funds from contamination cleanup funds administered by the commissioners of the Department of Employment and Economic Development, the Metropolitan Council, the federal government, the private sector and any other source.\nThe county may not expend funds under this section unless the governing body of the city in which the site is located approves the project.\nThe county may pledge the proceeds from the taxes imposed by section 383B.80 to bonds issued under this chapter and chapters 398A, 462, 469, and 475.\nThe first priority for the use of the environmental response fund created in this section is to clean up the site located in the city of St. Louis Park known as NL Industries/Tara Corporation/Golden Auto, EPA I.D. No. MND097891634 and to provide adequate right-of-way for a portion of the rail line to replace the 29th street line in the city of Minneapolis, including making rail improvements, changing the curve of the railroad track and eliminating a switching facility, and improving the land for economic development. No money from the environmental response fund may be expended for remediating the site until the site has been acquired through purchase or condemnation.\nLand or property acquired under this section may be resold at fair market value. Proceeds from the sale of the land must be deposited in the environmental response fund.\nWith respect to the site described in subdivision 6, the commissioner of transportation shall collaborate with the county and any affected municipality by providing technical assistance and support in facilitating the railroad improvement and testing at that portion of the site to be used for the railroad improvement.",
	"repealed": false
}