{
	"id": "245C.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/245C.33",
	"title": "245C.33 ADOPTION AND TRANSFER OF PERMANENT LEGAL AND PHYSICAL CUSTODY BACKGROUND STUDY REQUIREMENTS.",
	"text": "(a) Before placement of a child for purposes of adoption, the commissioner shall conduct a background study on individuals listed in sections 259.41, subdivision 3, and 260C.611, for county agencies and private agencies licensed to place children for adoption. When a prospective adoptive parent is seeking to adopt a child who is currently placed in the prospective adoptive parent's home and is under the guardianship of the commissioner according to section 260C.325, subdivision 1, paragraph (b), and the prospective adoptive parent holds a child foster care license, a new background study is not required when:\n(1) a background study was completed on persons required to be studied under section 245C.03 in connection with the application for child foster care licensure after July 1, 2007;\n(2) the background study included a review of the information in section 245C.08, subdivisions 1, 3, and 4; and\n(3) as a result of the background study, the individual was either not disqualified or, if disqualified, the disqualification was set aside under section 245C.22, or a variance was issued under section 245C.30.\n(b) Before the kinship placement agreement is signed for the purpose of transferring permanent legal and physical custody to a relative under sections 260C.503 to 260C.515, the commissioner shall conduct a background study on each person age 13 or older living in the home. When a prospective relative custodian has a child foster care license, a new background study is not required when:\n(1) a background study was completed on persons required to be studied under section 245C.03 in connection with the application for child foster care licensure after July 1, 2007;\n(2) the background study included a review of the information in section 245C.08, subdivisions 1, 3, and 4; and\n(3) as a result of the background study, the individual was either not disqualified or, if disqualified, the disqualification was set aside under section 245C.22, or a variance was issued under section 245C.30. The commissioner and the county agency shall expedite any request for a set-aside or variance for a background study required under sections 142A.60 to 142A.612.\nThe subject of the background study shall provide the information specified in section 245C.05.\nThe county or private agency shall forward the data collected under subdivision 2 to the commissioner.\n(a) The commissioner shall review the following information regarding the background study subject:\n(1) the information under section 245C.08, subdivisions 1, 3, and 4;\n(2) information from the child abuse and neglect registry for any state in which the subject has resided for the past five years; and\n(3) information from national crime information databases, when required under section 245C.08.\n(b) The commissioner shall provide any information collected under this subdivision to the county or private agency that initiated the background study. The commissioner shall also provide the agency with a notice whether the information collected shows that the subject of the background study has a conviction listed in United States Code, title 42, section 671(a)(20)(A).",
	"repealed": false
}