{
	"id": "136A.1701",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1701",
	"title": "136A.1701 SUPPLEMENTAL AND ADDITIONAL LOANS.",
	"text": "The office may provide for programs of loans which may be made in lieu of or in addition to loans authorized under sections 136A.15 to 136A.1702 and applicable provisions of federal law as provided in this section.\nThe purpose of the loan programs under this section is to provide financial assistance for the postsecondary education of students who are eligible students whether or not such students qualify for a loan or loans under other provisions of sections 136A.15 to 136A.1702.\nLoans granted to students may be used solely for educational purposes.\nThe student loan programs shall be administered in compliance with title VI of the Civil Rights Act of 1964.\n(a) The office may loan money upon such terms and conditions as the office may prescribe.\n(b) The minimum loan amount and a maximum loan amount to students must be determined annually by the office. Loan limits are defined based on the type of program enrollment, such as a certificate, an associate's degree, a bachelor's degree, or a graduate program. The aggregate principal amount of all loans made subject to this paragraph to a student as an undergraduate and graduate student must not exceed $140,000. The amount of the loan must not exceed the cost of attendance as determined by the eligible institution less all other financial aid, including PLUS loans or other similar parent loans borrowed on the student's behalf. A student may borrow up to the maximum amount twice in the same grade level.\n(c) The cumulative borrowing maximums must be determined annually by the office and are defined based on program enrollment. In determining the cumulative borrowing maximums, the office shall, among other considerations, take into consideration the maximum SELF loan amount, student financing needs, funding capacity for the SELF program, delinquency and default loss management, and current financial market conditions.\n[Repealed, 2010 c 215 art 2 s 21]\nThe office shall determine the rate of interest to be charged on loans. The rate of interest on student loans however computed, shall not be subject to any provision of state law limiting the rate of interest to be charged for a loan of money.\nThe office shall establish repayment procedures for loans made under this section in accordance with the policies, rules, and conditions authorized under section 136A.16, subdivision 2. The office will take into consideration the loan limits and current financial market conditions when establishing repayment terms. The office shall not require a minimum annual payment, though the office may require minimum monthly payments.\nThe office may take, hold, and administer for any of its purposes, real or personal property and money, or any interest therein, and the income therefrom, either absolutely or in trust, for any purposes of the office. The office may acquire real or personal property or money for its purposes by purchase or lease and by gift, grant, bequest, devise, or loan, and may enter into contracts with profit or nonprofit corporations or institutions with the same or similar purposes as will benefit and improve the operation of the office and its loan programs.\nThe office may establish variable loan repayment schedules consistent with the need and anticipated income streams of borrowers.\nThe office shall develop an appeals process for recipients of loans made under this section who believe there is an unresolved error in the servicing of the loan. The office shall provide recipients with a description of the appeals process.\nExcept as provided in section 136A.1787, paragraph (a), no money originating from state sources in the state treasury shall be made available for student loans under this section and all student loans shall be made from money originating from nonstate sources.\n(a) An eligible institution whose students are eligible to receive funding under sections 136A.15 to 136A.1795 and licensed or registered under sections 136A.61 to 136A.834 must provide to the office data on student enrollment and federal and state financial aid.\n(b) An institution or its agent must provide to the office aggregate and distributional financial or other data as determined by the commissioner that is directly related to the responsibilities of the office under this chapter. The commissioner may only request aggregate and distributional data after establishing and consulting with a data advisory task force to determine the need, content, and detail of the information. Data provided by nonpublic institutions under this paragraph is considered nonpublic data under chapter 13.\nMS 2018 [Repealed, 2019 c 64 art 2 s 45]",
	"repealed": false
}