{
	"id": "3.8855",
	"url": "https://www.revisor.mn.gov/statutes/cite/3.8855",
	"title": "3.8855 TAX EXPENDITURE REVIEW COMMISSION.",
	"text": "The Tax Expenditure Review Commission is created to review Minnesota's tax expenditures and evaluate their effectiveness and fiscal impact.\nFor the purposes of this section, \"significant tax expenditure,\" \"tax,\" and \"tax expenditure\" have the meanings given in section 270C.11, subdivision 6.\n(a) The commission consists of:\n(1) two senators appointed by the senate majority leader;\n(2) two senators appointed by the senate minority leader;\n(3) two representatives appointed by the speaker of the house;\n(4) two representatives appointed by the minority leader of the house of representatives; and\n(5) the commissioner of revenue or the commissioner's designee.\n(b) Each appointing authority must make appointments by January 31 of the regular legislative session in the odd-numbered year.\n(c) If the chair of the house or senate committee with primary jurisdiction over taxes is not an appointed member, the chair is an ex officio, nonvoting member of the commission.\n(a) For not more than three years after the commission is established, the commission must complete an initial review of the state's tax expenditures. The initial review must identify the purpose of each of the state's tax expenditures, if none was identified in the enacting legislation in accordance with section 3.192. The commission may also identify metrics for evaluating the effectiveness of an expenditure.\n(b) The commission must review and evaluate Minnesota's tax expenditures on a regular, rotating basis. The commission must establish a review schedule that ensures each tax expenditure will be reviewed by the commission at least once every ten years. The commission may review expenditures affecting similar constituencies or policy areas in the same year, but the commission must review a subset of the tax expenditures within each tax type each year. To the extent possible, the commission must review a similar number of tax expenditures within each tax type each year. The commission may decide not to review a tax expenditure that is adopted by reference to federal law.\n(c) Before December 1 of the year a tax expenditure is included in a commission report, the commission must hold a public hearing on the expenditure, including but not limited to a presentation of the review components in subdivision 5.\n(a) When reviewing a tax expenditure, the commission must at a minimum:\n(1) provide an estimate of the annual revenue lost as a result of the expenditure;\n(2) identify the purpose of the tax expenditure if none was identified in the enacting legislation in accordance with section 3.192;\n(3) estimate the measurable impacts and efficiency of the tax expenditure in accomplishing the purpose of the expenditure;\n(4) compare the effectiveness of the tax expenditure and a direct expenditure with the same purpose;\n(5) identify potential modifications to the tax expenditure to increase its efficiency or effectiveness;\n(6) estimate the amount by which the tax rate for the relevant tax could be reduced if the revenue lost due to the tax expenditure were applied to a rate reduction;\n(7) if the tax expenditure is a significant tax expenditure, estimate the incidence of the tax expenditure and the effect of the expenditure on the incidence of the state's tax system;\n(8) consider the cumulative fiscal impacts of other state and federal taxes providing benefits to taxpayers for similar activities; and\n(9) recommend whether the expenditure be continued, repealed, or modified.\n(b) The commission may omit a component in paragraph (a) if the commission determines it is not feasible due to the lack of available data, third-party research, staff resources, or lack of a majority support for a recommendation.\n(a) The research division of the Department of Revenue must provide the commission with the summary data required to complete the review components in subdivision 5, paragraph (a), clauses (1), (6), (7), and (8).\n(b) At the request of the commission, the research division of the Department of Revenue must provide the commission with summary data on a tax expenditure in support of a review.\n(c) Data shared under this section must comply with the rules governing statistical studies under section 270B.04, subdivision 2.\n(a) By December 15 of each year, the commission must submit a written report to the legislative committees with jurisdiction over tax policy. The report must detail the results of the commission's review of tax expenditures for the year, including the review components detailed in subdivision 5.\n(b) Notwithstanding paragraph (a), during the period of initial review under subdivision 4, the report may be limited to the purpose statements and metrics for evaluating the effectiveness of expenditures, as identified by the commission. The report may also include relevant publicly available data on an expenditure.\n(c) The report may include any additional information the commission deems relevant to the review of an expenditure.\n(d) The legislative committees with jurisdiction over tax policy must hold a public hearing on the report during the regular legislative session in the year following the year in which the report was submitted.\n(a) Members of the commission serve a term beginning upon appointment and ending at the beginning of the regular legislative session in the next odd-numbered year. The appropriate appointing authority must fill a vacancy for a seat of a current legislator for the remainder of the unexpired term. Members may be removed or replaced at the pleasure of the appointing authority.\n(b) If a commission member ceases to be a member of the legislative body from which the member was appointed, the member vacates membership on the commission.\nThe commission shall elect a chair and vice-chair as presiding officers. The chair and vice-chair must alternate every two years between members of the house of representatives and senate. The chair and vice-chair may not be from the same legislative chamber.\nLegislative Budget Office staff hired under section 3.8853, subdivision 2, must provide professional and technical assistance to the commission as the commission deems necessary, including assistance with the report under subdivision 7.\nThe members of the commission and its staff shall be reimbursed for all expenses actually and necessarily incurred in the performance of their duties. Reimbursement for expenses incurred shall be made in accordance with policies adopted by the Legislative Coordinating Commission.",
	"repealed": false
}