{
	"id": "473F.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/473F.02",
	"title": "473F.02 DEFINITIONS.",
	"text": "The terms defined in this section shall have the meanings therein ascribed to them for purposes of sections 473F.01 to 473F.13 unless context otherwise requires.\n\"Area\" means the territory included within the metropolitan area as defined in section 473.121, subdivision 2, excluding lands constituting a major or an intermediate airport as defined under section 473.625.\n\"Commercial-industrial property\" means the following categories of property, as defined in section 273.13, excluding that portion of such property which is exempt from taxation under section 272.02:\n(a) That portion of class 3 property defined in Minnesota Statutes 1971, section 273.13, consisting of stocks of merchandise and furniture and fixtures used therewith; manufacturers' materials and manufactured articles; and tools, implements and machinery, whether fixtures or otherwise.\n(b) That portion of class 4 property defined in Minnesota Statutes 1971, section 273.13, which is either used or zoned for use for any commercial or industrial purpose, except for such property which is, or, in the case of property under construction, will when completed be used exclusively for residential occupancy and the provision of services to residential occupants thereof. Property shall be considered as used exclusively for residential occupancy only if each of not less than 80 percent of its occupied residential units is, or, in the case of property under construction, will when completed be occupied under an oral or written agreement for occupancy over a continuous period of not less than 30 days.\nIf the classification of property prescribed by section 273.13 is modified by legislative amendment, the references in this subdivision shall be to such successor class or classes of property, or portions thereof, as embrace the kinds of property designated in this subdivision.\n\"Residential property\" means the following categories of property, as defined in section 273.13, excluding that portion of such property exempt from taxation pursuant to section 272.02:\n(a) class 1, 1b, 2a, 4a, 4b, 4c, and 4d property except resorts and property classified under section 273.13, subdivision 25, paragraph (d), clause (3); and\n(b) that portion of class 3a, 3b, and 5 property used exclusively for residential occupancy.\n\"Governmental unit\" means a county, city, town, school district, or other taxing unit or body which levies ad valorem taxes in whole or in part within the area.\n\"Administrative auditor\" means the person selected pursuant to section 473F.03.\n\"Population\" means the most recent estimate of the population of a municipality made by the Metropolitan Council under section 473.24 and filed with the commissioner of revenue as of July 15 of the year in which a municipality's distribution net tax capacity is calculated.\n\"Municipality\" means a city, town, or township located in whole or part within the area as defined in subdivision 2. If a municipality is located partly within and partly without the area, the references in sections 473F.01 to 473F.13 to property or any portion thereof subject to taxation or taxing jurisdiction within the municipality are to such property or portion thereof as is located in that portion of the municipality within the area, except that the fiscal capacity of such a municipality shall be computed upon the basis of the valuation and population of the entire municipality.\nA municipality shall be excluded from the area if its municipal comprehensive zoning and planning policies conscientiously exclude most commercial-industrial development, for reasons other than preserving an agricultural use. The Metropolitan Council and the commissioner of revenue shall jointly make this determination annually and shall notify those municipalities that are ineligible to participate in the tax base sharing program provided in this chapter for the following year.\nMS 1990 [Repealed, 1991 c 291 art 1 s 63]\n\"County\" means each county in which a governmental unit is located in whole or in part.\nMS 1990 [Repealed, 1991 c 291 art 1 s 63]\n\"Adjusted market value\" of real and personal property within a municipality means the taxable market value, as defined in section 272.03, of all real and personal property, including the value of manufactured housing, within the municipality, adjusted for sales ratios in a manner similar to the adjustments made to city and town net tax capacities under section 273.1325, subdivisions 1 to 6.\nMS 2012 [Repealed, 2013 c 143 art 14 s 111]\n\"Fiscal capacity\" of a municipality means its adjusted market value, determined as of January 2 of any year, divided by its population, determined as of a date in the same year.\n\"Average fiscal capacity\" of municipalities means the sum of the adjusted market values of all municipalities, determined as of January 2 of any year, divided by the sum of their populations, determined as of a date in the same year.\nMS 1990 [Repealed, 1991 c 291 art 1 s 63]\nMS 1990 [Repealed, 1991 c 291 art 1 s 63]\nMS 1990 [Repealed, 1991 c 291 art 1 s 63]\nMS 1990 [Repealed, 1991 c 291 art 1 s 63]\nMS 1990 [Repealed, 1991 c 291 art 1 s 63]\n\"Metropolitan Council\" or \"council\" means the Metropolitan Council created by section 473.123.\n\"Levy\" means the amount certified to the county auditor pursuant to chapter 275, less all reductions made by the auditor pursuant to any provision of law in determining the amount to be spread against taxable property.\n\"Net tax capacity\" means the taxable market value of real and personal property multiplied by its net tax capacity rates in section 273.13.\n\"Local tax rate\" means a governmental unit's levy, including any portion levied against market value under section 126C.17, subdivision 10, divided by its net tax capacity.",
	"repealed": false
}