{
	"id": "360.0655",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.0655",
	"title": "360.0655 AIRPORT ZONING REGULATIONS BASED ON COMMISSIONER'S STANDARDS; SUBMISSION PROCESS.",
	"text": "(a) Except as provided in section 360.0656, prior to adopting zoning regulations, the municipality, county, or joint airport zoning board must submit the proposed regulations to the commissioner for the commissioner to determine whether the regulations conform to the standards prescribed by the commissioner. The municipality, county, or joint airport zoning board may elect to complete custom airport zoning under section 360.0656 instead of using the commissioner's standard, but only after providing written notice to the commissioner.\n(b) Notwithstanding section 15.99, the commissioner must examine the proposed regulations within 90 days of receipt of the regulations and report to the municipality, county, or joint airport zoning board the commissioner's approval or objections, if any. Failure to respond within 90 days is deemed an approval. The commissioner may request additional information from the municipality, county, or joint airport zoning board within the 90-day review period. If the commissioner requests additional information, the 90-day review period is tolled until the commissioner receives information and deems the information satisfactory.\n(c) If the commissioner objects on the grounds that the regulations do not conform to the standards prescribed by the commissioner, the municipality, county, or joint airport zoning board must make amendments necessary to resolve the objections or provide written notice to the commissioner that the municipality, county, or joint airport zoning board will proceed with zoning under section 360.0656.\n(d) If the municipality, county, or joint airport zoning board makes revisions to the proposed regulations after its initial public hearing, the municipality, county, or joint airport zoning board must conduct a second public hearing on the revisions and resubmit the revised proposed regulations to the commissioner for review. The commissioner must examine the revised proposed regulations within 90 days of receipt to determine whether the revised proposed regulations conform to the standards prescribed by the commissioner.\n(e) If, after a second review period, the commissioner determines that the municipality, county, or joint airport zoning board failed to submit proposed regulations that conform to the commissioner's standards, the commissioner must provide a final written decision to the municipality, county, or joint airport zoning board.\n(f) The municipality, county, or joint airport zoning board must not adopt regulations or take other action until the proposed regulations are approved by the commissioner.\n(g) The commissioner may approve local zoning ordinances that are more stringent than the commissioner's standards.\n(h) If the commissioner approves the proposed regulations, the municipality, county, or joint airport zoning board may adopt the regulations.\n(i) A copy of the adopted regulations must be filed with the county recorder in each county that contains a zoned area subject to the regulations.\n(j) Substantive rights that existed and had been exercised prior to August 1, 2019, are not affected by the filing of the regulations.\n(a) In order to ensure minimum disruption of existing land uses, the commissioner's airport zoning standards and local airport zoning ordinances or regulations adopted under this section must distinguish between the creation or establishment of a use and the elimination of an existing use, and must avoid the elimination, removal, or reclassification of existing uses to the extent consistent with reasonable safety standards. The commissioner's standards must include criteria for determining when an existing land use may constitute an airport hazard so severe that public safety considerations outweigh the public interest in preventing disruption to that land use.\n(b) Airport zoning regulations that classify as a nonconforming use or require nonconforming use classification with respect to any existing low-density structure or existing isolated low-density building lots must be adopted under sections 360.061 to 360.074.\n(c) A local airport zoning authority may classify a land use described in paragraph (b) as an airport hazard if the authority finds that the classification is justified by public safety considerations and is consistent with the commissioner's airport zoning standards. Any land use described in paragraph (b) that is classified as an airport hazard must be acquired, altered, or removed at public expense.\n(d) This subdivision must not be construed to affect the classification of any land use under any zoning ordinances or regulations not adopted under sections 360.061 to 360.074.",
	"repealed": false
}