{
	"id": "245.4871",
	"url": "https://www.revisor.mn.gov/statutes/cite/245.4871",
	"title": "245.4871 DEFINITIONS.",
	"text": "The definitions in this section apply to sections 245.487 to 245.4889.\n\"Acute care hospital inpatient treatment\" means short-term medical, nursing, and psychosocial services provided in an acute care hospital licensed under chapter 144.\n\"Case management services\" means activities that are coordinated with the family community support services and are designed to help the child with severe emotional disturbance and the child's family obtain needed mental health services, social services, educational services, health services, vocational services, recreational services, and related services in the areas of volunteer services, advocacy, transportation, and legal services. Case management services include assisting in obtaining a comprehensive diagnostic assessment, developing an individual family community support plan, and assisting the child and the child's family in obtaining needed services by coordination with other agencies and assuring continuity of care. Case managers must assess and reassess the delivery, appropriateness, and effectiveness of services over time.\n(a) \"Case management service provider\" means a case manager or case manager associate employed by the county or other entity authorized by the county board to provide case management services specified in subdivision 3 for the child with severe emotional disturbance and the child's family.\n(b) A case manager must:\n(1) have experience and training in working with children;\n(2) have at least a bachelor's degree in one of the behavioral sciences or a related field including, but not limited to, social work, psychology, or nursing from an accredited college or university or meet the requirements of paragraph (d);\n(3) have experience and training in identifying and assessing a wide range of children's needs;\n(4) be knowledgeable about local community resources and how to use those resources for the benefit of children and their families; and\n(5) meet the supervision and continuing education requirements of paragraphs (e), (f), and (g), as applicable.\n(c) A case manager may be a member of any professional discipline that is part of the local system of care for children established by the county board.\n(d) A case manager without a bachelor's degree must meet one of the requirements in clauses (1) to (3):\n(1) have three or four years of experience as a case manager associate;\n(2) be a registered nurse without a bachelor's degree who has a combination of specialized training in psychiatry and work experience consisting of community interaction and involvement or community discharge planning in a mental health setting totaling three years; or\n(3) be a person who qualified as a case manager under the 1998 Department of Human Services waiver provision and meets the continuing education, supervision, and mentoring requirements in this section.\n(e) A case manager with at least 2,000 hours of supervised experience in the delivery of mental health services to children must receive regular ongoing supervision and clinical supervision totaling 38 hours per year, of which at least one hour per month must be clinical supervision regarding individual service delivery with a case management supervisor. The other 26 hours of supervision may be provided by a case manager with two years of experience. Group supervision may not constitute more than one-half of the required supervision hours.\n(f) A case manager without 2,000 hours of supervised experience in the delivery of mental health services to children with emotional disturbance must:\n(1) begin 40 hours of training approved by the commissioner of human services in case management skills and in the characteristics and needs of children with severe emotional disturbance before beginning to provide case management services; and\n(2) receive clinical supervision regarding individual service delivery from a mental health professional at least one hour each week until the requirement of 2,000 hours of experience is met.\n(g) A case manager who is not licensed, registered, or certified by a health-related licensing board must receive 30 hours of continuing education and training in severe emotional disturbance and mental health services every two years.\n(h) Clinical supervision must be documented in the child's record. When the case manager is not a mental health professional, the county board must provide or contract for needed clinical supervision.\n(i) The county board must ensure that the case manager has the freedom to access and coordinate the services within the local system of care that are needed by the child.\n(j) A case manager associate (CMA) must:\n(1) work under the direction of a case manager or case management supervisor;\n(2) be at least 21 years of age;\n(3) have at least a high school diploma or its equivalent; and\n(4) meet one of the following criteria:\n(i) have an associate of arts degree in one of the behavioral sciences or human services;\n(ii) be a registered nurse without a bachelor's degree;\n(iii) have three years of life experience as a primary caregiver to a child with serious emotional disturbance as defined in subdivision 6 within the previous ten years;\n(iv) have 6,000 hours work experience as a nondegreed state hospital technician; or\n(v) have 6,000 hours of supervised work experience in the delivery of mental health services to children with emotional disturbances; hours worked as a mental health behavioral aide I or II under section 256B.0943, subdivision 7, may count toward the 6,000 hours of supervised work experience.\nIndividuals meeting one of the criteria in items (i) to (iv) may qualify as a case manager after four years of supervised work experience as a case manager associate. Individuals meeting the criteria in item (v) may qualify as a case manager after three years of supervised experience as a case manager associate.\n(k) Case manager associates must meet the following supervision, mentoring, and continuing education requirements;\n(1) have 40 hours of preservice training described under paragraph (f), clause (1);\n(2) receive at least 40 hours of continuing education in severe emotional disturbance and mental health service annually; and\n(3) receive at least five hours of mentoring per week from a case management mentor. A \"case management mentor\" means a qualified, practicing case manager or case management supervisor who teaches or advises and provides intensive training and clinical supervision to one or more case manager associates. Mentoring may occur while providing direct services to consumers in the office or in the field and may be provided to individuals or groups of case manager associates. At least two mentoring hours per week must be individual and face-to-face.\n(l) A case management supervisor must meet the criteria for a mental health professional as specified in subdivision 27.\n(m) An immigrant who does not have the qualifications specified in this subdivision may provide case management services to child immigrants with severe emotional disturbance of the same ethnic group as the immigrant if the person:\n(1) is currently enrolled in and is actively pursuing credits toward the completion of a bachelor's degree in one of the behavioral sciences or related fields at an accredited college or university;\n(2) completes 40 hours of training as specified in this subdivision; and\n(3) receives clinical supervision at least once a week until the requirements of obtaining a bachelor's degree and 2,000 hours of supervised experience are met.\n\"Child\" means a person under 18 years of age.\nFor purposes of eligibility for case management and family community support services, \"child with severe emotional disturbance\" means a child who has an emotional disturbance and who meets one of the following criteria:\n(1) the child has been admitted within the last three years or is at risk of being admitted to inpatient treatment or residential treatment for an emotional disturbance; or\n(2) the child is a Minnesota resident and is receiving inpatient treatment or residential treatment for an emotional disturbance through the interstate compact; or\n(3) the child has one of the following as determined by a mental health professional:\n(i) psychosis or a clinical depression; or\n(ii) risk of harming self or others as a result of an emotional disturbance; or\n(iii) psychopathological symptoms as a result of being a victim of physical or sexual abuse or of psychic trauma within the past year; or\n(4) the child, as a result of an emotional disturbance, has significantly impaired home, school, or community functioning that has lasted at least one year or that, in the written opinion of a mental health professional, presents substantial risk of lasting at least one year.\n[Repealed, 2014 c 262 art 3 s 18]\n\"Commissioner\" means the commissioner of human services.\n\"County board\" means the county board of commissioners or board established under the Joint Powers Act, section 471.59, or the Human Services Act, sections 402.01 to 402.10.\n\"Crisis planning\" means the development of a written plan to assist a child and the child's family in preventing and addressing a potential crisis and is distinct from mobile crisis services defined in section 256B.0624. The plan must address prevention, de-escalation, and intervention strategies to be used in a crisis. The plan identifies factors that might precipitate a crisis, behaviors or symptoms related to the emergence of a crisis, and the resources available to resolve a crisis. The plan must address the following potential needs: (1) acute care; (2) crisis placement; (3) community resources for follow-up; and (4) emotional support to the family during crisis. When appropriate for the child's needs, the plan must include strategies to reduce the child's risk of suicide and self-injurious behavior. Crisis planning does not include services designed to secure the safety of a child who is at risk of abuse or neglect or necessary emergency services.\n\"Day treatment,\" \"day treatment services,\" or \"day treatment program\" means a structured program of treatment and care provided to a child in:\n(1) an outpatient hospital accredited by the Joint Commission on Accreditation of Health Organizations and licensed under sections 144.50 to 144.55;\n(2) a community mental health center under section 245.62;\n(3) an entity that is under contract with the county board to operate a program that meets the requirements of section 245.4884, subdivision 2, and Minnesota Rules, parts 9505.0170 to 9505.0475;\n(4) an entity that operates a program that meets the requirements of section 245.4884, subdivision 2, and Minnesota Rules, parts 9505.0170 to 9505.0475, that is under contract with an entity that is under contract with a county board; or\n(5) a program certified under section 256B.0943.\nDay treatment consists of group psychotherapy and other intensive therapeutic services that are provided for a minimum two-hour time block by a multidisciplinary staff under the treatment supervision of a mental health professional. Day treatment may include education and consultation provided to families and other individuals as an extension of the treatment process. The services are aimed at stabilizing the child's mental health status, and developing and improving the child's daily independent living and socialization skills. Day treatment services are distinguished from day care by their structured therapeutic program of psychotherapy services. Day treatment services are not a part of inpatient hospital or residential treatment services.\nA day treatment service must be available to a child up to 15 hours a week throughout the year and must be coordinated with, integrated with, or part of an education program offered by the child's school.\n[Repealed, 2014 c 262 art 3 s 18]\n\"Diagnostic assessment\" has the meaning given in section 245I.10, subdivisions 4 to 6.\n\"Mental health identification and intervention services\" means services that are designed to identify children who are at risk of needing or who need mental health services and that arrange for intervention and treatment.\n(a) \"Education and prevention services\" means services designed to:\n(1) educate the general public;\n(2) increase the understanding and acceptance of problems associated with emotional disturbances;\n(3) improve people's skills in dealing with high-risk situations known to affect children's mental health and functioning; and\n(4) refer specific children or their families with mental health needs to mental health services.\n(b) The services include distribution to individuals and agencies identified by the county board and the local children's mental health advisory council of information on predictors and symptoms of emotional disturbances, where mental health services are available in the county, and how to access the services.\n\"Emergency services\" means an immediate response service available on a 24-hour, seven-day-a-week basis for each child having a psychiatric crisis, a mental health crisis, or a mental health emergency.\n\"Emotional disturbance\" means an organic disorder of the brain or a clinically significant disorder of thought, mood, perception, orientation, memory, or behavior that:\n(1) is detailed in a diagnostic codes list published by the commissioner; and\n(2) seriously limits a child's capacity to function in primary aspects of daily living such as personal relations, living arrangements, work, school, and recreation.\n\"Emotional disturbance\" is a generic term and is intended to reflect all categories of disorder described in the clinical code list published by the commissioner as \"usually first evident in childhood or adolescence.\"\n\"Family\" means a child and one or more of the following persons whose participation is necessary to accomplish the child's treatment goals: (1) a person related to the child by blood, marriage, or adoption; (2) a person who is the child's foster parent or significant other; (3) a person who is the child's legal representative.\n\"Family community support services\" means services provided under the treatment supervision of a mental health professional and designed to help each child with severe emotional disturbance to function and remain with the child's family in the community. Family community support services do not include acute care hospital inpatient treatment, residential treatment services, or regional treatment center services. Family community support services include:\n(1) client outreach to each child with severe emotional disturbance and the child's family;\n(2) medication monitoring where necessary;\n(3) assistance in developing independent living skills;\n(4) assistance in developing parenting skills necessary to address the needs of the child with severe emotional disturbance;\n(5) assistance with leisure and recreational activities;\n(6) crisis planning, including crisis placement and respite care;\n(7) professional home-based family treatment;\n(8) foster care with therapeutic supports;\n(9) day treatment;\n(10) assistance in locating respite care and special needs day care; and\n(11) assistance in obtaining potential financial resources, including those benefits listed in section 245.4884, subdivision 5.\n[Repealed, 2014 c 262 art 3 s 18]\n\"Functional assessment\" means an assessment by the case manager of the child's:\n(1) mental health symptoms as presented in the child's diagnostic assessment;\n(2) mental health needs as presented in the child's diagnostic assessment;\n(3) use of drugs and alcohol;\n(4) vocational and educational functioning;\n(5) social functioning, including the use of leisure time;\n(6) interpersonal functioning, including relationships with the child's family;\n(7) self-care and independent living capacity;\n(8) medical and dental health;\n(9) financial assistance needs;\n(10) housing and transportation needs; and\n(11) other needs and problems.\n\"Individual family community support plan\" means a written plan developed by a case manager in conjunction with the family and the child with severe emotional disturbance on the basis of a diagnostic assessment and a functional assessment. The plan identifies specific services needed by a child and the child's family to:\n(1) treat the symptoms and dysfunctions determined in the diagnostic assessment;\n(2) relieve conditions leading to emotional disturbance and improve the personal well-being of the child;\n(3) improve family functioning;\n(4) enhance daily living skills;\n(5) improve functioning in education and recreation settings;\n(6) improve interpersonal and family relationships;\n(7) enhance vocational development; and\n(8) assist in obtaining transportation, housing, health services, and employment.\n\"Individual placement agreement\" means a written agreement or supplement to a service contract entered into between the county board and a service provider on behalf of a child to provide residential treatment services.\n(a) \"Individual treatment plan\" means the formulation of planned services that are responsive to the needs and goals of a client. An individual treatment plan must be completed according to section 245I.10, subdivisions 7 and 8.\n(b) A children's residential facility licensed under Minnesota Rules, chapter 2960, is exempt from the requirements of section 245I.10, subdivisions 7 and 8. Instead, the individual treatment plan must:\n(1) include a written plan of intervention, treatment, and services for a child with an emotional disturbance that the service provider develops under the clinical supervision of a mental health professional on the basis of a diagnostic assessment;\n(2) be developed in conjunction with the family unless clinically inappropriate; and\n(3) identify goals and objectives of treatment, treatment strategy, a schedule for accomplishing treatment goals and objectives, and the individuals responsible for providing treatment to the child with an emotional disturbance.\n\"Legal representative\" means a guardian, conservator, or guardian ad litem of a child with an emotional disturbance authorized by the court to make decisions about mental health services for the child.\n[Repealed, 1991 c 94 s 25]\n\"Local system of care\" means services that are locally available to the child and the child's family. The services are mental health, social services, correctional services, education services, health services, and vocational services.\n\"Mental health crisis services\" means crisis assessment, crisis intervention, and crisis stabilization services.\n[Repealed, 2014 c 262 art 3 s 18]\n\"Mental health practitioner\" means a staff person who is qualified according to section 245I.04, subdivision 4.\n\"Mental health professional\" means a staff person who is qualified according to section 245I.04, subdivision 2.\n\"Mental health services\" means at least all of the treatment services and case management activities that are provided to children with emotional disturbances and are described in sections 245.487 to 245.4889.\n\"Outpatient services\" means mental health services, excluding day treatment and community support services programs, provided by or under the treatment supervision of a mental health professional to children with emotional disturbances who live outside a hospital. Outpatient services include clinical activities such as individual, group, and family therapy; individual treatment planning; diagnostic assessments; medication management; and psychological testing.\n\"Parent\" means the birth or adoptive mother or father of a child. This definition does not apply to a person whose parental rights have been terminated in relation to the child.\n\"Professional home-based family treatment\" means intensive mental health services provided to children because of an emotional disturbance (1) who are at risk of out-of-home placement; (2) who are in out-of-home placement; or (3) who are returning from out-of-home placement. Services are provided to the child and the child's family primarily in the child's home environment. Services may also be provided in the child's school, child care setting, or other community setting appropriate to the child. Services must be provided on an individual family basis, must be child-oriented and family-oriented, and must be designed using information from diagnostic and functional assessments to meet the specific mental health needs of the child and the child's family. Examples of services are: (1) individual therapy; (2) family therapy; (3) client outreach; (4) assistance in developing individual living skills; (5) assistance in developing parenting skills necessary to address the needs of the child; (6) assistance with leisure and recreational services; (7) crisis planning, including crisis respite care and arranging for crisis placement; and (8) assistance in locating respite and child care. Services must be coordinated with other services provided to the child and family.\n\"Residential treatment\" means a 24-hour-a-day program under the treatment supervision of a mental health professional, in a community residential setting other than an acute care hospital or regional treatment center inpatient unit, that must be licensed as a residential treatment program for children with emotional disturbances under Minnesota Rules, parts 2960.0580 to 2960.0700, or other rules adopted by the commissioner.\nMS 2020 [Repealed, 1Sp2021 c 7 art 11 s 49]\n\"Service provider\" means either a county board or an entity under contract with the county board that provides children's mental health services funded under sections 245.487 to 245.4889. A contracting entity may be an individual, organization, or agency, including a regional treatment center.\n\"Culturally informed mental health consultant\" is a person who is recognized by the culture as one who has knowledge of a particular culture and its definition of health and mental health; and who is used as necessary to assist the county board and its mental health providers in assessing and providing appropriate mental health services for children from that particular cultural, linguistic, or racial heritage and their families.\n\"Therapeutic support of foster care\" means the mental health training and mental health support services and treatment supervision provided by a mental health professional to foster families caring for children with severe emotional disturbance to provide a therapeutic family environment and support for the child's improved functioning. Therapeutic support of foster care includes services provided under section 256B.0946.\n\"Transition services\" means mental health services, designed within an outcome oriented process that promotes movement from school to postschool activities, including postsecondary education, vocational training, integrated employment including supported employment, continuing and adult education, adult mental health and social services, other adult services, independent living, or community participation.\n\"Treatment supervision\" means the treatment supervision described by section 245I.06.",
	"repealed": false
}