{
	"id": "144.0757",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.0757",
	"title": "144.0757 OFFICE OF AMERICAN INDIAN HEALTH.",
	"text": "The Office of American Indian Health is established to address unique public health needs of American Indian Tribal communities in Minnesota. The office shall:\n(1) coordinate with Minnesota's Tribal Nations and urban American Indian community-based organizations to identify underlying causes of health disparities, address unique health needs of Minnesota's Tribal communities, and develop public health approaches to achieve health equity;\n(2) strengthen capacity of American Indian and community-based organizations and Tribal Nations to address identified health disparities and needs;\n(3) administer state and federal grant funding opportunities targeted to improve the health of American Indians;\n(4) provide overall leadership for targeted development of holistic health and wellness strategies to improve health and to support Tribal and urban American Indian public health leadership and self-sufficiency;\n(5) provide technical assistance to Tribal and American Indian urban community leaders to develop culturally appropriate activities to address public health emergencies;\n(6) develop and administer the department immersion experiences for American Indian students in secondary education and community colleges to improve diversity of the public health workforce and introduce career pathways that contribute to reducing health disparities; and\n(7) identify and promote workforce development strategies for Department of Health staff to work with the American Indian population and Tribal Nations more effectively in Minnesota.\nTo carry out these duties, the office may contract with or provide grants to qualifying entities.\nBy January 15, 2025, and every two years thereafter, the commissioner of health shall report to the chairs and ranking minority members of the legislative committees with primary jurisdiction over health policy and finance on the work accomplished by the Office of American Indian Health during the previous two years and on goals of the office for the upcoming two years.",
	"repealed": false
}