{
	"id": "148E.41",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.41",
	"title": "148E.41 DEFINITIONS.",
	"text": "As used in this Compact, and except as otherwise provided, the following definitions shall apply:\n(1) \"Active military member\" means any individual with full-time duty status in the active armed forces of the United States, including members of the National Guard and Reserve.\n(2) \"Adverse action\" means any administrative, civil, equitable, or criminal action permitted by a state's laws which is imposed by a licensing authority or other authority against a regulated social worker, including actions against an individual's license or multistate authorization to practice such as revocation, suspension, probation, monitoring of the licensee, limitation on the licensee's practice, or any other encumbrance on licensure affecting a regulated social worker's authorization to practice, including issuance of a cease and desist action.\n(3) \"Alternative program\" means a nondisciplinary monitoring or practice remediation process approved by a licensing authority to address practitioners with an impairment.\n(4) \"Charter member states\" means member states who have enacted legislation to adopt this Compact where such legislation predates the effective date of this Compact as described in section 148E.53.\n(5) \"Compact\" means sections 148E.40 to 148E.55.\n(6) \"Compact Commission\" or \"Commission\" means the government agency whose membership consists of all States that have enacted this Compact, which is known as the Social Work Licensure Compact Commission, as described in section 148E.49, and which shall operate as an instrumentality of the member states.\n(7) \"Current significant investigative information\" means:\n(i) investigative information that a licensing authority, after a preliminary inquiry that includes notification and an opportunity for the regulated social worker to respond, has reason to believe is not groundless and, if proved true, would indicate more than a minor infraction as may be defined by the Commission; or\n(ii) investigative information that indicates that the regulated social worker represents an immediate threat to public health and safety, as may be defined by the Commission, regardless of whether the regulated social worker has been notified and has had an opportunity to respond.\n(8) \"Data system\" means a repository of information about licensees, including continuing education, examinations, licensure, current significant investigative information, disqualifying events, multistate licenses, and adverse action information or other information as required by the Commission.\n(9) \"Disqualifying event\" means any adverse action or incident which results in an encumbrance that disqualifies or makes the licensee ineligible to obtain, retain, or renew a multistate license.\n(10) \"Domicile\" means the jurisdiction in which the licensee resides and intends to remain indefinitely.\n(11) \"Encumbrance\" means a revocation or suspension of, or any limitation on, the full and unrestricted practice of social work licensed and regulated by a licensing authority.\n(12) \"Executive Committee\" means a group of delegates elected or appointed to act on behalf of, and within the powers granted to them by, the Compact and Commission.\n(13) \"Home state\" means the member state that is the licensee's primary domicile.\n(14) \"Impairment\" means a condition that may impair a practitioner's ability to engage in full and unrestricted practice as a regulated social worker without some type of intervention and may include alcohol and drug dependence, mental health impairment, and neurological or physical impairments.\n(15) \"Licensee\" means an individual who currently holds a license from a state to practice as a regulated social worker.\n(16) \"Licensing authority\" means the board or agency of a member state, or equivalent, that is responsible for the licensing and regulation of regulated social workers.\n(17) \"Member state\" means a state, commonwealth, district, or territory of the United States of America that has enacted this Compact.\n(18) \"Multistate authorization to practice\" means a legally authorized privilege to practice, which is equivalent to a license, associated with a multistate license permitting the practice of social work in a remote state.\n(19) \"Multistate license\" means a license to practice as a regulated social worker issued by a home state licensing authority that authorizes the regulated social worker to practice in all member states under multistate authorization to practice.\n(20) \"Qualifying national exam\" means a national licensing examination approved by the Commission.\n(21) \"Regulated social worker\" means any clinical, master's, or bachelor's social worker licensed by a member state regardless of the title used by that member state.\n(22) \"Remote state\" means a member state other than the licensee's home state.\n(23) \"Rule\" or \"rule of the Commission\" means a regulation or regulations duly promulgated by the Commission, as authorized by the Compact, that has the force of law.\n(24) \"Single state license\" means a social work license issued by any state that authorizes practice only within the issuing state and does not include multistate authorization to practice in any member state.\n(25) \"Social work\" or \"social work services\" means the application of social work theory, knowledge, methods, ethics, and the professional use of self to restore or enhance social, psychosocial, or biopsychosocial functioning of individuals, couples, families, groups, organizations, and communities through the care and services provided by a regulated social worker as set forth in the member state's statutes and regulations in the state where the services are being provided.\n(26) \"State\" means any state, commonwealth, district, or territory of the United States of America that regulates the practice of social work.\n(27) \"Unencumbered license\" means a license that authorizes a regulated social worker to engage in the full and unrestricted practice of social work.",
	"repealed": false
}