{
	"id": "40A.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/40A.10",
	"title": "40A.10 APPLICATION FOR CREATION OF AGRICULTURAL PRESERVE.",
	"text": "An eligible person may apply to the county in which the land is located for the creation of an agricultural preserve on forms provided by the commissioner. In case a preserve is located in more than one county, the application must be submitted to the county in which the majority of the land is located. The application shall be executed and acknowledged in the manner required by law to execute and acknowledge a deed and must contain at least the following information and other information the commissioner requires:\n(1) legal description of the area to be designated and parcel identification numbers where designated by the county auditor;\n(2) name and address of the owner; and\n(3) a statement by the owner covenanting that the land will be kept in exclusive agricultural use and will be used in accordance with the provisions of this chapter that exist on the date of application and providing that the restrictive covenant will be binding on the owner or the owner's successor or assignee, and will run with the land.\nUpon receipt of an application, the county shall determine if all material required by subdivision 1 has been submitted and, if so, shall determine that the application is complete. When used in this chapter, the term \"date of application\" means the date the application is determined to be complete by the county. The county shall send a copy of the application to the county assessor, the regional development commission, where applicable, and the soil and water conservation district where the land is located. The district shall prepare an advisory statement of existing and potential conservation problems in the zone. The district shall send the statement to the owner of record and to the commissioner. A copy of the application and a legal description of the property must also be sent to the commissioner.\nWithin five days of the date of application, the county shall forward the application to the county recorder for recording, or to the registrar of titles for filing if the land is registered. The county recorder shall record the application containing the restrictive covenant and return it to the applicant. If the land is registered, the registrar of titles shall memorialize the application containing the restrictive covenant upon the certificate of title. The recorder or registrar of titles shall notify the county that the application has been recorded or memorialized.\nThe land is an agricultural preserve and subject to the benefits and restrictions of this chapter commencing 30 days from the date the county determines the application is complete under subdivision 1.\nThe county may require an application fee, not to exceed $50.\nThe commissioner shall maintain agricultural preserve maps illustrating land covenanted as agricultural preserves.",
	"repealed": false
}