{
	"id": "153A.14",
	"url": "https://www.revisor.mn.gov/statutes/cite/153A.14",
	"title": "153A.14 REGULATION.",
	"text": "An applicant must:\n(1) be 21 years of age or older;\n(2) apply to the commissioner for a certificate to dispense prescription hearing aids on application forms provided by the commissioner;\n(3) at a minimum, provide the applicant's name, Social Security number, business address and phone number, employer, and information about the applicant's education, training, and experience in testing human hearing and fitting prescription hearing aids;\n(4) include with the application a statement that the statements in the application are true and correct to the best of the applicant's knowledge and belief;\n(5) include with the application a written and signed authorization that authorizes the commissioner to make inquiries to appropriate regulatory agencies in this or any other state where the applicant has sold prescription hearing aids;\n(6) submit certification to the commissioner that the applicant's audiometric equipment has been calibrated to meet current ANSI standards within 12 months of the date of the application;\n(7) submit evidence of continuing education credits, if required;\n(8) submit all fees as required under section 153A.17; and\n(9) consent to a fingerprint-based criminal history records check required under section 144.0572, pay all required fees, and cooperate with all requests for information. An applicant must complete a new criminal background check if more than one year has elapsed since the applicant last applied for a license.\n(a) The commissioner shall issue a certificate to each dispenser of prescription hearing aids who applies under subdivision 1 if the commissioner determines that the applicant is in compliance with this chapter, has passed an examination administered by the commissioner, has met the continuing education requirements, if required, and has paid the fee set by the commissioner. The commissioner may reject or deny an application for a certificate if there is evidence of a violation or failure to comply with this chapter.\n(b) The commissioner shall not issue a certificate to an applicant who refuses to consent to a criminal history background check as required by section 144.0572 within 90 days after submission of an application or fails to submit fingerprints to the Department of Human Services. Any fees paid by the applicant to the Department of Health shall be forfeited if the applicant refuses to consent to the background study.\n[Repealed, 2005 c 147 art 7 s 20]\nThe commissioner shall act on applications for certification, and applications for renewal of certification, according to paragraphs (a) to (c).\n(a) The commissioner shall determine if the applicant meets the requirements for certification. The commissioner may investigate information provided by an applicant to determine whether the information is accurate and complete.\n(b) The commissioner shall notify each applicant of action taken on the application and of the grounds for denying certification if certification is denied.\n(c) The commissioner shall comply with contested case procedures in chapter 14 when suspending, revoking, or refusing to issue or renew a certificate under this section.\nAfter two years, upon application and evidence that the disqualifying behavior has ceased, the commissioner may restore or approve certification previously denied, rejected, revoked, or suspended, provided that the applicant has met all conditions and terms of any orders to which the applicant is a subject.\nCertification must be renewed annually. The commissioner shall mail a renewal notice to the dispenser's last known address on record with the commissioner by September 1 of each year. A dispenser is not relieved from meeting the renewal deadline on the basis that the dispenser did not receive the renewal notice. In renewing a certificate, a dispenser shall follow the procedures for applying for a certificate specified in subdivision 1.\nA certificate must be renewed effective November 1 of each year. To renew a certificate, an applicant must:\n(1) annually complete a renewal application on a form provided by the commissioner and submit the annual renewal fee by the deadline;\n(2) submit certification to the commissioner that the applicant's audiometric equipment has been calibrated to meet current ANSI standards within 12 months of the date of the application, if the applicant tests hearing;\n(3) submit evidence of completion of continuing education requirements, if required; and\n(4) submit additional information if requested by the commissioner to clarify information presented in the renewal application. The information must be submitted within 30 days of the commissioner's request.\nThe deadline for application to renew certification is October 1 of each year. An application for certification renewal must be received by the Department of Health or postmarked by October 1. An application not received or postmarked by October 1 shall be a late renewal and must be accompanied by a late fee as required in section 153A.17. If the postmark is illegible, the application shall be considered timely if received by October 7.\nCertification shall lapse if not renewed before November 1 of each year. An applicant whose certification has lapsed less than two years must meet all the requirements of this chapter except the certification by examination requirements of subdivision 2h. The application fees to renew certification following a lapse of less than two years must include the late fee. An applicant whose certification has lapsed for two years or more must meet all the requirements of this chapter except the continuing education requirement of subdivision 2i. Certification application fees of applicants whose certification has lapsed for any amount of time shall not be prorated over the time remaining in the annual certification period.\nAn applicant must achieve a passing score, as determined by the commissioner, on an examination according to paragraphs (a) to (c).\n(a) The examination must include, but is not limited to:\n(1) A written examination approved by the commissioner covering the following areas as they pertain to prescription hearing aid selling:\n(i) basic physics of sound;\n(ii) the anatomy and physiology of the ear;\n(iii) the function of prescription hearing aids; and\n(iv) the principles of prescription hearing aid selection.\n(2) Practical tests of proficiency in the following techniques as they pertain to prescription hearing aid selling:\n(i) pure tone audiometry, including air conduction testing and bone conduction testing;\n(ii) live voice or recorded voice speech audiometry including speech recognition (discrimination) testing, most comfortable loudness level, and uncomfortable loudness measurements of tolerance thresholds;\n(iii) masking when indicated;\n(iv) recording and evaluation of audiograms and speech audiometry to determine proper selection and fitting of a prescription hearing aid;\n(v) taking ear mold impressions;\n(vi) using an otoscope for the visual observation of the entire ear canal; and\n(vii) state and federal laws, rules, and regulations.\n(b) The practical examination shall be administered by the commissioner at least twice a year.\n(c) An applicant must achieve a passing score on all portions of the examination within a two-year period. An applicant who does not achieve a passing score on all portions of the examination within a two-year period must retake the entire examination and achieve a passing score on each portion of the examination. An applicant who does not apply for certification within one year of successful completion of the examination must retake the examination and achieve a passing score on each portion of the examination. An applicant may not take any part of the practical examination more than three times in a two-year period.\nOn forms provided by the commissioner, each certified dispenser must submit with the application for renewal of certification evidence of completion of ten course hours of continuing education earned within the 12-month period of November 1 to October 31, between the effective and expiration dates of certification. Continuing education courses must be directly related to prescription hearing aid dispensing and approved by the International Hearing Society, the American Speech-Language-Hearing Association, or the American Academy of Audiology. Evidence of completion of the ten course hours of continuing education must be submitted by December 1 of each year. This requirement does not apply to dispensers certified for less than one year.\nThe certification holder must use the certification number on all contracts, bills of sale, and receipts used in the sale of prescription hearing aids.\nA certificate may not be transferred.\nExcept as provided in subdivisions 4a and 4c, and in sections 148.512 to 148.5198, it is unlawful for any person not holding a valid certificate to dispense a prescription hearing aid as defined in section 153A.13, subdivision 3. A person who dispenses a prescription hearing aid without the certificate required by this section is guilty of a gross misdemeanor.\n(a) A person who is not certified under this section may dispense prescription hearing aids as a trainee for a period not to exceed 12 months if the person:\n(1) submits an application on forms provided by the commissioner;\n(2) is under the supervision of a certified dispenser meeting the requirements of this subdivision;\n(3) meets all requirements for certification except passage of the examination required by this section; and\n(4) uses the title \"dispenser trainee\" in contacts with the patients, clients, or consumers.\n(b) A certified prescription hearing aid dispenser may not supervise more than two trainees at the same time and may not directly supervise more than one trainee at a time. The certified dispenser is responsible for all actions or omissions of a trainee in connection with the dispensing of prescription hearing aids. A certified dispenser may not supervise a trainee if there are any commissioner, court, or other orders, currently in effect or issued within the last five years, that were issued with respect to an action or omission of a certified dispenser or a trainee under the certified dispenser's supervision.\nUntil taking and passing the practical examination testing the techniques described in subdivision 2h, paragraph (a), clause (2), trainees must be directly supervised in all areas described in subdivision 4b, and the activities tested by the practical examination. Thereafter, trainees may dispense prescription hearing aids under indirect supervision until expiration of the trainee period. Under indirect supervision, the trainee must complete two monitored activities a week. Monitored activities may be executed by correspondence, telephone, or other telephonic devices, and include, but are not limited to, evaluation of audiograms, written reports, and contracts. The time spent in supervision must be recorded and the record retained by the supervisor.\nA dispenser when conducting a hearing test for the purpose of prescription hearing aid dispensing must:\n(1) comply with the United States Food and Drug Administration warning regarding potential medical conditions required by Code of Federal Regulations, title 21, section 801.422;\n(2) complete a case history of the client's hearing;\n(3) inspect the client's ears with an otoscope; and\n(4) conduct the following tests on both ears of the client and document the results, and if for any reason one of the following tests cannot be performed pursuant to the United States Food and Drug Administration guidelines, an audiologist shall evaluate the hearing and the need for a prescription hearing aid:\n(i) air conduction at 250, 500, 1,000, 2,000, 4,000, and 8,000 Hertz. When a difference of 20 dB or more occurs between adjacent octave frequencies the interoctave frequency must be tested;\n(ii) bone conduction at 500, 1,000, 2,000, and 4,000 Hertz for any frequency where the air conduction threshold is greater than 15 dB HL;\n(iii) monaural word recognition (discrimination), with a minimum of 25 words presented for each ear; and\n(iv) loudness discomfort level, monaural, for setting a prescription hearing aid's maximum power output; and\n(5) include masking in all tests whenever necessary to ensure accurate results.\n(a) A person who has dispensed prescription hearing aids in another jurisdiction may dispense prescription hearing aids as a trainee under indirect supervision if the person:\n(1) satisfies the provisions of subdivision 4a, paragraph (a);\n(2) submits a signed and dated affidavit stating that the applicant is not the subject of a disciplinary action or past disciplinary action in this or another jurisdiction and is not disqualified on the basis of section 153A.15, subdivision 1; and\n(3) provides a copy of a current credential as a prescription hearing aid dispenser held in the District of Columbia or a state or territory of the United States.\n(b) A person becoming a trainee under this subdivision who fails to take and pass the practical examination described in subdivision 2h, paragraph (a), clause (2), when next offered must cease dispensing prescription hearing aids unless under direct supervision.\nThe trainee period automatically expires two months following notice of passing all examination requirements of subdivision 2h.\nCosts incurred by the Minnesota Department of Health for conducting investigations of unlicensed prescription hearing aid dispensing shall be apportioned between all licensed or credentialed professions that dispense prescription hearing aids.\nMS 2022 [Repealed, 2023 c 70 art 3 s 83]\nThe commissioner shall ensure that prescription hearing aids are dispensed in compliance with state requirements and the requirements of the United States Food and Drug Administration. Failure to comply with state or federal regulations may be grounds for enforcement actions under section 153A.15, subdivision 2.\n[Repealed, 1998 c 317 s 29]\n[Repealed, 2005 c 147 art 7 s 20]\nA prescription hearing aid dispenser shall comply with the requirements of sections 148.5195, subdivision 3, clause (20); 148.5197; and 148.5198.\n[Repealed, 2005 c 147 art 7 s 20]\nA dispenser must notify the commissioner in writing within 30 days of the occurrence of any of the following:\n(1) a change of name, address, home or business telephone number, or business name;\n(2) the occurrence of conduct prohibited by section 153A.15;\n(3) a settlement, conciliation court judgment, or award based on negligence, intentional acts, or contractual violations committed in the dispensing of prescription hearing aids by the dispenser; and\n(4) the cessation of prescription hearing aid dispensing activities as an individual or a business.\nNothing in this chapter shall preclude certified hearing aid dispensers from dispensing or selling over-the-counter hearing aids.",
	"repealed": false
}