{
	"id": "515B.2-122",
	"url": "https://www.revisor.mn.gov/statutes/cite/515B.2-122",
	"title": "515B.2-122 MERGER OR CONSOLIDATION OF COMMON INTEREST COMMUNITIES.",
	"text": "(a) Any two or more common interest communities of the same form of ownership, by agreement of the unit owners as provided in subsection (b), may be merged or consolidated into a single common interest community. The resultant common interest community shall be the legal successor, for all purposes, of all of the preexisting common interest communities, and the operations and activities of the preexisting common interest communities are merged or consolidated into a single common interest community that holds all powers, rights, obligations, assets, and liabilities of the preexisting common interest communities.\n(b) An agreement of two or more common interest communities to merge or consolidate pursuant to subsection (a) shall be evidenced by an agreement executed by the president of the association of each of the preexisting common interest communities following approval by owners of units to which are allocated the votes in each common interest community required to terminate that common interest community.\n(c) Every merger or consolidation agreement shall contain:\n(1) the names of the resultant common interest community and its association;\n(2) the number of the resultant common interest community, which shall be a new common interest community number assigned to the resultant common interest community by the recording officer;\n(3) a requirement that the associations of the common interest communities shall be merged pursuant to the applicable statute;\n(4) a reallocation of the allocated interests in the preexisting common interest communities among the units of the resultant common interest community by stating the reallocations and the formulas upon which they are based;\n(5) a statement that the common interest communities have approved and will, within 90 days after the execution of the merger agreement, record a declaration as provided in subsection (d) or commence an appropriate proceeding to accomplish the recording if necessary.\n(d) A declaration, including a new or amended CIC plat if necessary, complying with this chapter and governing the resultant common interest community shall be recorded in every county in which a portion of each preexisting common interest community is located, and the merger or consolidation is not effective until the declaration is recorded. In addition to other matters required by this chapter, the declaration shall contain:\n(1) a reference to the names and numbers of the preexisting common interest communities, and the names of their associations;\n(2) a statement that the preexisting common interest communities and their associations have been merged or consolidated pursuant to this chapter and the applicable corporate statute; and\n(3) a statement that the declaration supersedes the declarations of the preexisting common interest communities and governs the resultant common interest community.\n(e) Upon approval as provided in subsection (b), the association for the resultant common interest community may execute the declaration, and a new or amended CIC plat if necessary, on behalf of the unit owners of, and all other persons holding an interest in, the units or other property that is a part of the preexisting common interest communities, and to do all other acts necessary to merge or consolidate the common interest communities.\n(f) The declaration and CIC plat for the resultant common interest community may be recorded without the necessity of paying the current or delinquent real estate taxes on any of the units.",
	"repealed": false
}