{
	"id": "351.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/351.16",
	"title": "351.16 PETITION; REVIEW.",
	"text": "Any registered voter may petition the county auditor requesting a removal election and setting forth facts which allege with specificity that an elected county official committed malfeasance or nonfeasance in the performance of official duties during the current or any previous term in the office held by the elected county official, except that a petition may not be submitted during the 180 days immediately preceding a general election for the office which is held by the county official named in the petition. The petitioner must attach to the petition documents which contain the signatures of supporters who are registered voters totaling at least 25 percent of the number of persons who voted in the preceding election for the office which is held by the county official named in the petition. Each page on which signatures are included must clearly identify the purpose of the petition. The registered voters must be residents of the county or, in a removal election involving a county commissioner, of the commissioner district which elected the named county commissioner. The signatures of supporters must be on forms provided by the county auditor.\nThe county auditor shall examine the petition to determine whether it contains the requisite number of valid signatures of registered voters. If so, the county auditor shall forward the petition, but not the signatures, to the clerk of appellate courts within 15 days of receipt of the petition. If the county auditor determines that the petition does not include the requisite number of signatures, the county auditor shall deny the petition within 15 days of receipt of the petition.\nIf the county auditor is the named elected county official, the petition must be submitted to the chair of the county board of commissioners who shall appoint a county official to perform the duties of the county auditor specified in sections 351.14 to 351.23.\nAn elected county official is not subject to a removal election on the ground that misfeasance in the performance of official duties was committed, or on the ground of disagreement with actions taken that were within the lawful discretion of the elected county official.",
	"repealed": false
}