{
	"id": "626.84",
	"url": "https://www.revisor.mn.gov/statutes/cite/626.84",
	"title": "626.84 DEFINITIONS AND SCOPE.",
	"text": "For purposes of sections 626.84 to 626.863, the following terms have the meanings given them:\n(a) \"Board\" means the Board of Peace Officer Standards and Training.\n(b) \"Director\" means the executive director of the board.\n(c) \"Peace officer\" means:\n(1) an employee or an elected or appointed official of a political subdivision or law enforcement agency who is licensed by the board, charged with the prevention and detection of crime and the enforcement of the general criminal laws of the state and who has the full power of arrest, and shall also include the Minnesota State Patrol, agents of the Division of Alcohol and Gambling Enforcement, state conservation officers, Metropolitan Transit police officers, Department of Corrections Fugitive Apprehension Unit officers, Department of Commerce Fraud Bureau Unit officers, the statewide coordinator of the Violent Crime Coordinating Council, and railroad peace officers as authorized by section 219.995 and United States Code, title 49, section 28101; and\n(2) a peace officer who is employed by a law enforcement agency of a federally recognized tribe, as defined in United States Code, title 25, section 450b(e), and who is licensed by the board.\n(d) \"Part-time peace officer\" means an individual licensed by the board whose services are utilized by law enforcement agencies no more than an average of 20 hours per week, not including time spent on call when no call to active duty is received, calculated on an annual basis, who has either full powers of arrest or authorization to carry a firearm while on active duty. The term shall apply even though the individual receives no compensation for time spent on active duty, and shall apply irrespective of the title conferred upon the individual by any law enforcement agency.\n(e) \"Reserve officer\" means an individual whose services are utilized by a law enforcement agency to provide supplementary assistance at special events, traffic or crowd control, and administrative or clerical assistance, and shall include reserve deputies, special deputies, mounted or unmounted patrols, and all other employees or volunteers performing reserve officer functions. A reserve officer's duties do not include enforcement of the general criminal laws of the state, and the officer does not have full powers of arrest or authorization to carry a firearm on duty.\n(f) \"Law enforcement agency\" means:\n(1) a unit of state or local government that is authorized by law to grant full powers of arrest and to charge a person with the duties of preventing and detecting crime and enforcing the general criminal laws of the state;\n(2) subject to the limitations in section 626.93, a law enforcement agency of a federally recognized tribe, as defined in United States Code, title 25, section 450b(e); and\n(3) subject to the limitation of section 219.995, a railroad company.\n(g) \"Professional peace officer education\" means a postsecondary degree program, or a nondegree program for persons who already have a college degree, that is offered by a college or university in Minnesota, designed for persons seeking licensure as a peace officer, and approved by the board.\n(h) \"Railroad peace officer\" means an individual as authorized under United States Code, title 49, section 28101:\n(1) employed by a railroad for the purpose of aiding and supplementing law enforcement agencies in the protection of property owned by or in the care, custody, or control of a railroad and to protect the persons and property of railroad passengers and employees; and\n(2) licensed by the board.\nNotwithstanding sections 12.03, subdivision 4, 12.25, or any other law to the contrary, no individual employed or acting as an agent of any political subdivision shall be authorized to carry a firearm when on duty unless the individual has been licensed under sections 626.84 to 626.863. Nothing herein shall be construed as requiring licensure of a security guard as that term is defined in section 626.88, subdivision 1, paragraph (c).",
	"repealed": false
}