{
	"id": "169.212",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.212",
	"title": "169.212 OPERATION OF ELECTRIC PERSONAL ASSISTIVE MOBILITY DEVICES.",
	"text": "Except as otherwise provided by law, a person operating an electric personal assistive mobility device has the rights and responsibilities of a pedestrian.\n(a) An electric personal assistive mobility device may be operated on a bicycle path.\n(b) No person may operate an electric personal assistive mobility device on a roadway, sidewalk, or bicycle path at a rate of speed that is not reasonable and prudent under the conditions. Every person operating an electric personal assistive mobility device on a roadway, sidewalk, or bicycle path is responsible for becoming and remaining aware of the actual and potential hazards then existing on the roadway or sidewalk and must use due care in operating the device.\n(c) An electric personal assistive mobility device may be operated on a roadway only:\n(1) while making a direct crossing of a roadway in a marked or unmarked crosswalk;\n(2) where no sidewalk is available;\n(3) where a sidewalk is so obstructed as to prevent safe use;\n(4) when so directed by a traffic-control device or by a peace officer; or\n(5) temporarily in order to gain access to a motor vehicle.\n(d) An electric personal assistive mobility device may not be operated at any time on a roadway with a speed limit of more than 35 miles per hour except to make a direct crossing of the roadway in a marked crosswalk.\n(e) An electric personal assistive mobility device may not be operated at any time while carrying more than one person.\n(f) A person operating an electric personal assistive mobility device on a sidewalk must yield the right-of-way to pedestrians at all times. A person operating an electric personal assistive mobility device on a bicycle path must yield the right-of-way to bicycles at all times.\nAn electric personal assistive mobility device may not be operated unless the device bears reflectorized material on the front, back, and wheels, visible at night from 600 feet when illuminated by the lower beams of headlamps of a motor vehicle.\nA local road authority may not further regulate the operation of electric personal assistive mobility devices, except that a local road authority may allow and regulate the operation of these devices on roadways within its jurisdiction that have a speed limit of more than 35 miles per hour.",
	"repealed": false
}