{
	"id": "169.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.57",
	"title": "169.57 VEHICLE SIGNALS.",
	"text": "(a) Any vehicle may be equipped and when required under this chapter, shall be equipped with at least two stop lamps on the rear which shall emit a red or yellow light and which shall be actuated upon application of the service (foot) brake and which may, but need not be, incorporated with the tail lamps and which shall be plainly visible and understandable from a distance of 100 feet to the rear during normal sunlight and at night.\n(b) No person shall sell or offer for sale or operate on the highways any motor vehicle registered in this state and manufactured or assembled after January 1, 1960, unless it is equipped with at least two stop lamps meeting the requirements of this subdivision, except that a motorcycle, motor-driven cycle, or truck-tractor manufactured or assembled after said date shall be equipped with at least one stop lamp meeting the requirements of this subdivision.\n(a) Any vehicle may be equipped, and when required under this chapter shall be equipped, with a lamp or lamps or mechanical signal device of such color as may be approved by the commissioner of public safety and capable of clearly indicating any intention to turn either to the right or to the left and shall be visible and understandable during both daytime and nighttime from a distance of 100 feet both to the front and rear.\n(b) It is unlawful for any person to sell or offer for sale any new motor vehicle, excepting motorcycles, motor scooters, and bicycles with motor attached, unless it is equipped with turn signals meeting the requirements of this chapter.\n(a) When a vehicle is equipped with stop lamps or signal lamps, the lamps must at all times be maintained in good working condition.\n(b) All mechanical signal devices must be self-illumined when in use at the times when lighted lamps on vehicles are required.\nOn a vehicle that must be equipped with a single center high-mounted stop lamp under federal motor vehicle safety standards, and on any other vehicle equipped with a similar stop lamp, a person may not alter the stop lamp by the addition of an overlay or other device, or install a replacement lens, if the alteration or installation alters or obscures any portion of the lamp or affects the intensity of light emitted.",
	"repealed": false
}