{
	"id": "256B.0911",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.0911",
	"title": "256B.0911 LONG-TERM CARE CONSULTATION SERVICES.",
	"text": "(a) The purpose of long-term care consultation services is to assist persons with long-term or chronic care needs in making care decisions and selecting support and service options that meet their needs and reflect their preferences. The availability of, and access to, information and other types of assistance, including long-term care consultation assessment and support planning, is also intended to prevent or delay institutional placements and to provide access to transition assistance after placement. Further, the goal of long-term care consultation services is to contain costs associated with unnecessary institutional admissions. Long-term care consultation services must be available to any person regardless of public program eligibility.\n(b) The commissioner of human services shall seek to maximize use of available federal and state funds and establish the broadest program possible within the funding available.\n(c) Long-term care consultation services must be coordinated with long-term care options counseling, long-term care options counseling for assisted living, the Disability Hub, and preadmission screening.\n(d) A lead agency providing long-term care consultation services shall encourage the use of volunteers from families, religious organizations, social clubs, and similar civic and service organizations to provide community-based services.\nMS 2021 Supp [Repealed, 2022 c 98 art 16 s 31]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\nMS 2021 Supp [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Renumbered 256.975, subd 7e]\nMS 2020 [Renumbered 256.975, subd 7f]\nMS 2020 [Renumbered 256.975, subd 7g]\nMS 2021 Supp [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\n[Repealed, 2013 c 108 art 2 s 45]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\nMS 2020 [Repealed, 2022 c 98 art 16 s 31]\n[Repealed, 2015 c 78 art 6 s 32]\n[Repealed, 2016 c 99 art 1 s 43]\n[Repealed, 2001 c 161 s 58]\n[Repealed, 1Sp2001 c 9 art 4 s 34]\n(a) For purposes of this section, the following definitions apply.\n(b) \"Available service and setting options\" or \"available options,\" with respect to the home and community-based waivers under chapter 256S and sections 256B.092 and 256B.49, means all services and settings defined under the waiver plan for which a waiver applicant or waiver participant is eligible.\n(c) \"Competitive employment\" means work in the competitive labor market that is performed on a full-time or part-time basis in an integrated setting, and for which an individual is compensated at or above the minimum wage, but not less than the customary wage and level of benefits paid by the employer for the same or similar work performed by individuals without disabilities.\n(d) \"Cost-effective\" means community services and living arrangements that cost the same as or less than institutional care. For an individual found to meet eligibility criteria for home and community-based service programs under chapter 256S or section 256B.49, \"cost-effectiveness\" has the meaning found in the federally approved waiver plan for each program.\n(e) \"Independent living\" means living in a setting that is not controlled by a provider.\n(f) \"Informed choice\" has the meaning given in section 256B.4905, subdivision 1a.\n(g) \"Lead agency\" means a county administering or a Tribe or health plan under contract with the commissioner to administer long-term care consultation services.\n(h) \"Long-term care consultation services\" means the activities described in subdivision 11.\n(i) \"Long-term care options counseling\" means the services provided by sections 256.01, subdivision 24, and 256.975, subdivision 7, and also includes telephone assistance and follow-up after a long-term care consultation assessment has been completed.\n(j) \"Long-term care options counseling for assisted living\" means the services provided under section 256.975, subdivisions 7e to 7g.\n(k) \"Minnesota health care programs\" means the medical assistance program under this chapter and the alternative care program under section 256B.0913.\n(l) \"Person-centered planning\" is a process that includes the active participation of a person in the planning of the person's services, including in making meaningful and informed choices about the person's own goals, talents, and objectives, as well as making meaningful and informed choices about the services the person receives, the settings in which the person receives the services, and the setting in which the person lives.\n(m) \"Preadmission screening\" means the services provided under section 256.975, subdivisions 7a to 7c.\nThe following activities are included in long-term care consultation services:\n(1) intake for and access to assistance in identifying services needed to maintain an individual in the most inclusive environment;\n(2) transfer or referral to long-term care options counseling services for telephone assistance and follow-up after a person requests assistance in identifying community supports without participating in a complete long-term care consultation assessment;\n(3) long-term care consultation assessments conducted according to subdivisions 17 to 21, 23, or 24, which may be completed in a hospital, nursing facility, intermediate care facility for persons with developmental disabilities (ICF/DDs), regional treatment center, or the person's current or planned residence;\n(4) providing recommendations for and referrals to cost-effective community services that are available to the individual;\n(5) providing recommendations for institutional placement when there are no cost-effective community services available;\n(6) providing information regarding eligibility for Minnesota health care programs;\n(7) determining service eligibility for the following state plan services:\n(i) personal care assistance services under section 256B.0625, subdivisions 19a and 19c;\n(ii) consumer support grants under section 256.476; or\n(iii) community first services and supports under section 256B.85;\n(8) notwithstanding provisions in Minnesota Rules, parts 9525.0004 to 9525.0024, gaining access to the following services, including obtaining necessary diagnostic information to determine eligibility:\n(i) relocation targeted case management services available under section 256B.0621, subdivision 2, clause (4);\n(ii) case management services targeted to vulnerable adults or people with developmental disabilities under section 256B.0924; and\n(iii) case management services targeted to people with developmental disabilities under Minnesota Rules, part 9525.0016;\n(9) determining eligibility for semi-independent living services under section 252.275, including obtaining necessary diagnostic information;\n(10) determining home and community-based waiver and other service eligibility as required under chapter 256S and sections 256B.0913, 256B.092, and 256B.49, including:\n(i) level of care determination for individuals who need an institutional level of care as determined under subdivision 26;\n(ii) appropriate referrals to obtain necessary diagnostic information; and\n(iii) an eligibility determination for consumer-directed community supports;\n(11) providing information about competitive employment, with or without supports, for school-age youth and working-age adults and referrals to the Disability Hub and Disability Benefits 101 to ensure that an informed choice about competitive employment can be made;\n(12) providing information about independent living to ensure that an informed choice about independent living can be made;\n(13) providing information about self-directed services and supports, including self-directed funding options, to ensure that an informed choice about self-directed options can be made;\n(14) developing an individual's person-centered assessment summary; and\n(15) providing access to assistance to transition people back to community settings after institutional admission.\nA lead agency that has not implemented MnCHOICES assessments and uses contracted assessors as of January 1, 2022, is not subject to the requirements of subdivisions 11, clauses (7) to (9); 13; 14, paragraphs (a) to (c); 16 to 21; 23; 24; and 29 to 31.\n(a) The commissioner shall develop and implement a curriculum and an assessor certification process.\n(b) MnCHOICES certified assessors must:\n(1) either have a bachelor's degree in social work, nursing with a public health nursing certificate, or other closely related field or be a registered nurse; and\n(2) have received training and certification specific to assessment and consultation for long-term care services in the state.\n(c) Certified assessors shall demonstrate best practices in assessment and support planning, including person-centered planning principles, and have a common set of skills that ensures consistency and equitable access to services statewide.\n(d) Certified assessors must be recertified every three years.\n(a) Each lead agency shall use MnCHOICES certified assessors who have completed MnCHOICES training and the certification process determined by the commissioner in subdivision 13.\n(b) Each lead agency must ensure that the lead agency has sufficient numbers of certified assessors to provide long-term consultation assessment and support planning within the timelines and parameters of the service.\n(c) A lead agency may choose, according to departmental policies, to contract with a qualified, certified assessor to conduct assessments and reassessments on behalf of the lead agency.\n(d) Tribes and health plans under contract with the commissioner must provide long-term care consultation services as specified in the contract.\n(e) A lead agency must provide the commissioner with an administrative contact for communication purposes.\n(a) Each county board of commissioners shall establish a long-term care consultation team. Two or more counties may collaborate to establish a joint local long-term care consultation team or teams.\n(b) Each lead agency shall establish and maintain a team of certified assessors qualified under subdivision 13. Each team member is responsible for providing consultation with other team members upon request. The team is responsible for providing long-term care consultation services to all persons located in the county who request the services, regardless of eligibility for Minnesota health care programs. The team of certified assessors must include, at a minimum:\n(1) a social worker; and\n(2) a public health nurse or registered nurse.\n(c) The commissioner shall allow arrangements and make recommendations that encourage counties and Tribes to collaborate to establish joint local long-term care consultation teams to ensure that long-term care consultations are done within the timelines and parameters of the service. This includes coordinated service models as required in subdivision 1, paragraph (c).\n(a) Certified assessors must use person-centered planning principles to conduct an interview that identifies what is important to the person; the person's needs for supports and health and safety concerns; and the person's abilities, interests, and goals.\n(b) Certified assessors are responsible for:\n(1) ensuring persons are offered objective, unbiased access to resources;\n(2) ensuring persons have the needed information to support informed choice, including where and how they choose to live and the opportunity to pursue desired employment;\n(3) determining level of care and eligibility for long-term services and supports;\n(4) using the information gathered from the interview to develop a person-centered assessment summary that reflects identified needs and support options within the context of values, interests, and goals important to the person; and\n(5) providing the person with an assessment summary of findings, support options, and agreed-upon next steps.\n(a) A person requesting long-term care consultation services must be visited by a long-term care consultation team within 20 working days after the date on which an assessment was requested or recommended. Assessments must be conducted according to this subdivision and subdivisions 19 to 21, 23, 24, and 29 to 31.\n(b) Lead agencies shall use certified assessors to conduct the assessment.\n(c) For a person with complex health care needs, a public health or registered nurse from the team must be consulted.\n(d) The lead agency must use the MnCHOICES assessment provided by the commissioner to complete a comprehensive, conversation-based, person-centered assessment. The assessment must include the health, psychological, functional, environmental, and social needs of the individual necessary to develop a person-centered assessment summary that meets the individual's needs and preferences.\n(e) Except as provided in subdivision 24, an assessment must be conducted by a certified assessor in an in-person conversational interview with the person being assessed.\n(a) Until statewide implementation of MnCHOICES assessments, the requirement under subdivision 17, paragraph (a), does not apply to an assessment of a person requesting personal care assistance services. The commissioner shall provide at least a 90-day notice to lead agencies prior to the effective date of statewide implementation.\n(b) This subdivision expires upon statewide implementation of MnCHOICES assessments. The commissioner shall notify the revisor of statutes when statewide implementation has occurred.\n(a) The person's legal representative, if any, must provide input during the assessment process and may do so remotely if requested.\n(b) At the request of the person, other individuals may participate in the assessment to provide information on the needs, strengths, and preferences of the person necessary to complete the assessment and assessment summary. Except for legal representatives or family members invited by the person, a person participating in the assessment may not be a provider of service or have any financial interest in the provision of services.\n(c) For a person assessed for elderly waiver customized living or adult day services under chapter 256S, with the permission of the person being assessed or the person's designated or legal representative, the client's current or proposed provider of services may submit a copy of the provider's nursing assessment or written report outlining its recommendations regarding the client's care needs. The person conducting the assessment must notify the provider of the date by which to submit this information. This information must be provided to the person conducting the assessment prior to the assessment.\n(d) For a person assessed for waiver services under section 256B.092 or 256B.49, with the permission of the person being assessed or the person's designated legal representative, the person's current provider of services may submit a written report outlining recommendations regarding the person's care needs that the person completed in consultation with someone who is known to the person and who has interaction with the person on a regular basis. The provider must submit the report at least 60 days before the end of the person's current service agreement. The certified assessor must consider the content of the submitted report prior to finalizing the person's assessment or reassessment.\n(a) An assessment that is completed as part of an eligibility determination for multiple programs for the alternative care, elderly waiver, developmental disabilities, community access for disability inclusion, community alternative care, and brain injury waiver programs under chapter 256S and sections 256B.0913, 256B.092, and 256B.49 is valid to establish service eligibility for no more than 365 days after the date of the assessment.\n(b) The effective eligibility start date for programs in paragraph (a) can never be prior to the date of assessment. Notwithstanding retroactive medical assistance coverage of state plan services, the effective date of eligibility for programs included in paragraph (a) cannot be prior to the completion date of the most recent updated assessment.\n[See Note.]\n(a) A person receiving home and community-based waiver services under section 256B.0913, 256B.092, or 256B.49 or chapter 256S may return to a community with home and community-based waiver services under the same waiver without being assessed or reassessed under this section if the person temporarily entered one of the following for 121 or fewer days:\n(1) a hospital;\n(2) an institution of mental disease;\n(3) a nursing facility;\n(4) an intensive residential treatment services program;\n(5) a transitional care unit; or\n(6) an inpatient substance use disorder treatment setting.\n(b) Nothing in paragraph (a) changes annual long-term care consultation reassessment requirements, payment for institutional or treatment services, medical assistance financial eligibility, or any other law.\n(a) Prior to a reassessment, the certified assessor must review the person's most recent assessment.\n(b) Reassessments must:\n(1) be tailored using the professional judgment of the assessor to the person's known needs, strengths, preferences, and circumstances;\n(2) provide information to support the person's informed choice and opportunities to express choice regarding activities that contribute to quality of life, as well as information and opportunity to identify goals related to desired employment, community activities, and preferred living environment;\n(3) provide a review of the most recent assessment, the current support plan's effectiveness and monitoring of services, and the development of an updated person-centered assessment summary;\n(4) verify continued eligibility, offer alternatives as warranted, and provide an opportunity for quality assurance of service delivery; and\n(5) be conducted annually or as required by federal and state laws.\n(c) The certified assessor and the individual responsible for developing the support plan must ensure the continuity of care for the person receiving services and complete the updated assessment summary and the updated support plan no more than 60 days after the reassessment visit.\n(d) The commissioner shall develop mechanisms for providers and case managers to share information with the assessor to facilitate a reassessment and support planning process tailored to the person's current needs and preferences.\n(a) At the time of reassessment, the certified assessor shall assess a person receiving waiver residential supports and services and currently residing in a setting listed in clauses (1) to (5) to determine if the person would prefer to be served in a community-living setting as defined in section 256B.492, subdivision 1, paragraph (b), or in a setting not controlled by a provider, or to receive integrated community supports as described in section 245D.03, subdivision 1, paragraph (c), clause (8). The certified assessor shall offer the person through a person-centered planning process the option to receive alternative housing and service options. This paragraph applies to those currently residing in a:\n(1) community residential setting;\n(2) licensed adult foster care home that is either not the primary residence of the license holder or in which the license holder is not the primary caregiver;\n(3) family adult foster care residence;\n(4) customized living setting; or\n(5) supervised living facility.\n(b) At the time of reassessment, the certified assessor shall assess each person receiving waiver day services to determine if that person would prefer to receive employment services as described in section 245D.03, subdivision 1, paragraph (c), clauses (5) to (7). The certified assessor shall describe to the person through a person-centered planning process the option to receive employment services.\n(c) At the time of reassessment, the certified assessor shall assess each person receiving non-self-directed waiver services to determine if that person would prefer an available service and setting option that would permit self-directed services and supports. The certified assessor shall describe to the person through a person-centered planning process the option to receive self-directed services and supports.\n[See Note.]\n(a) Assessments performed according to subdivisions 17 to 20 and 23 must be in person unless the assessment is a reassessment meeting the requirements of this subdivision. Remote reassessments conducted by interactive video or telephone may substitute for in-person reassessments.\n(b) For services provided by the developmental disabilities waiver under section 256B.092, and the community access for disability inclusion, community alternative care, and brain injury waiver programs under section 256B.49, remote reassessments may be substituted for two consecutive reassessments if followed by an in-person reassessment.\n(c) For services provided by alternative care under section 256B.0913, essential community supports under section 256B.0922, and the elderly waiver under chapter 256S, remote reassessments may be substituted for one reassessment if followed by an in-person reassessment.\n(d) For personal care assistance provided under section 256B.0659 and community first services and supports provided under section 256B.85, remote reassessments may be substituted for two consecutive reassessments if followed by an in-person reassessment.\n(e) A remote reassessment is permitted only if the lead agency provides informed choice and the person being reassessed or the person's legal representative provides informed consent for a remote assessment. Lead agencies must document that informed choice was offered.\n(f) The person being reassessed, or the person's legal representative, may refuse a remote reassessment at any time.\n(g) During a remote reassessment, if the certified assessor determines an in-person reassessment is necessary in order to complete the assessment, the lead agency shall schedule an in-person reassessment.\n(h) All other requirements of an in-person reassessment apply to a remote reassessment, including updates to a person's support plan.\n[See Note.]\nUnless otherwise required by federal law, the county agency is not required to conduct or arrange for an annual needs reassessment by a certified assessor for people receiving Rule 185 case management under Minnesota Rules, part 9525.0016. The case manager who works on behalf of the person to identify the person's needs and to minimize the impact of the disability on the person's life must instead develop a person-centered service plan based on the person's assessed needs and preferences. The person-centered service plan must be reviewed annually for persons with developmental disabilities who are receiving only case management services under Minnesota Rules, part 9525.0016, and who make an informed choice to decline an assessment under this section.\n(a) The determination of need for hospital and intermediate care facility levels of care must be made according to criteria developed by the commissioner, and in section 256B.092, using forms developed by the commissioner.\n(b) The determination of need for nursing facility level of care must be made based on criteria in section 144.0724, subdivision 11.\n(a) Lead agency certified assessors shall provide transition assistance to persons residing in a nursing facility, hospital, regional treatment center, or intermediate care facility for persons with developmental disabilities who request or are referred for assistance.\n(b) Transition assistance must include:\n(1) assessment;\n(2) referrals to long-term care options counseling under section 256.975, subdivision 7, for support plan implementation and to Minnesota health care programs, including home and community-based waiver services and consumer-directed options through the waivers; and\n(3) referrals to programs that provide assistance with housing.\n(c) Transition assistance must also include information about the Centers for Independent Living, Disability Hub, and other organizations that can provide assistance with relocation efforts and information about contacting these organizations to obtain their assistance and support.\n(d) The lead agency shall ensure that:\n(1) referrals for in-person assessments are taken from long-term care options counselors as provided for in section 256.975, subdivision 7, paragraph (b), clause (11);\n(2) persons assessed in institutions receive information about available transition assistance;\n(3) the assessment is completed for persons within 20 calendar days of the date of request or recommendation for assessment;\n(4) there is a plan for transition and follow-up for the individual's return to the community, including notification of other local agencies when a person may require assistance from agencies located in another county; and\n(5) relocation targeted case management as defined in section 256B.0621, subdivision 2, clause (4), is authorized for an eligible medical assistance recipient.\n(a) Upon referral from the Senior LinkAge Line, individuals under 65 years of age who are admitted to nursing facilities on an emergency basis with only a telephone screening must receive an in-person assessment from the long-term care consultation team member of the county in which the facility is located within the timeline established by the commissioner based on review of data.\n(b) At the in-person assessment, the long-term care consultation team member or county case manager must:\n(1) perform the activities required under subdivision 27; and\n(2) present information about home and community-based options, including consumer-directed options, so the individual can make informed choices.\n(c) If the individual chooses home and community-based services, the long-term care consultation team member or case manager must complete a written relocation plan within 20 working days of the visit. The plan must describe the services needed to move the individual out of the facility and a timeline for the move that is designed to ensure a smooth transition to the individual's home and community.\n(d) For individuals under 21 years of age, a screening interview that recommends nursing facility admission must be in person and approved by the commissioner before the individual is admitted to the nursing facility.\n(e) An individual under 65 years of age residing in a nursing facility must receive an in-person assessment at least every 12 months to review the person's service choices and available alternatives unless the individual indicates in writing that annual visits are not desired. In this case, the individual must receive an in-person assessment at least once every 36 months for the same purposes.\n(f) Notwithstanding subdivision 33, the commissioner may pay county agencies directly for in-person assessments for individuals under 65 years of age who are being considered for placement or residing in a nursing facility.\n(a) The certified assessor and the individual responsible for developing the support plan must complete the assessment summary and the support plan no more than 60 calendar days after the assessment visit.\n(b) The person or the person's legal representative must be provided with a written assessment summary within the timelines established by the commissioner, regardless of whether the person is eligible for Minnesota health care programs.\n(c) For a person being assessed for elderly waiver services under chapter 256S, a provider who submitted information under subdivision 19, paragraph (c), must receive the final written support plan when available.\n(d) The written support plan must include:\n(1) a summary of assessed needs as defined in subdivision 17, paragraphs (d) and (e);\n(2) the individual's options and choices to meet identified needs, including all available options for:\n(i) case management services and providers;\n(ii) employment services, settings, and providers;\n(iii) living arrangements;\n(iv) self-directed services and supports, including self-directed budget options; and\n(v) service provided in a non-disability-specific setting;\n(3) identification of health and safety risks and how those risks will be addressed, including personal risk management strategies;\n(4) referral information; and\n(5) informal caregiver supports, if applicable.\n(e) For a person determined eligible for state plan home care under subdivision 11, clause (7), the person or person's legal representative must also receive a copy of the home care service plan developed by the certified assessor.\nThe lead agency must give the person receiving long-term care consultation services or the person's legal representative materials and forms supplied by the commissioner containing the following information:\n(1) written recommendations for community-based services and consumer-directed options;\n(2) documentation that the most cost-effective alternatives available were offered to the person;\n(3) the need for and purpose of preadmission screening conducted by long-term care options counselors according to section 256.975, subdivisions 7a to 7c, if the person selects nursing facility placement. If the person selects nursing facility placement, the lead agency shall forward information needed to complete the level of care determinations and screening for developmental disability and mental illness collected during the assessment to the long-term care options counselor using forms provided by the commissioner;\n(4) the role of long-term care consultation assessment and support planning in eligibility determination for waiver and alternative care programs and state plan home care, case management, and other services as defined in subdivision 11, clauses (7) to (10);\n(5) information about Minnesota health care programs;\n(6) the person's freedom to accept or reject the recommendations of the team;\n(7) the person's right to confidentiality under the Minnesota Government Data Practices Act, chapter 13;\n(8) the certified assessor's decision regarding the person's need for institutional level of care as determined under criteria established in subdivision 26 and regarding eligibility for all services and programs as defined in subdivision 11, clauses (7) to (10);\n(9) the person's right to appeal the certified assessor's decision regarding eligibility for all services and programs as defined in subdivision 11, clauses (5), (7) to (10), and (15), and the decision regarding the need for institutional level of care or the lead agency's final decisions regarding public programs eligibility according to section 256.045, subdivision 3. The certified assessor must verbally communicate this appeal right to the person and must visually point out where in the document the right to appeal is stated; and\n(10) documentation that available options for employment services, independent living, and self-directed services and supports were described to the person.\nThe person has the right to make the final decision:\n(1) between institutional placement and community placement after the recommendations have been provided under subdivision 30, clause (1), except as provided in section 256.975, subdivision 7a, paragraph (d);\n(2) between community placement in a setting controlled by a provider and living independently in a setting not controlled by a provider;\n(3) between day services and employment services; and\n(4) regarding available options for self-directed services and supports, including self-directed funding options.\n(a) The commissioner shall:\n(1) streamline the processes, including timelines for when assessments need to be completed;\n(2) provide the services in this section; and\n(3) implement integrated solutions to automate the business processes to the extent necessary for support plan approval, reimbursement, program planning, evaluation, and policy development.\n(b) The commissioner shall work with lead agencies responsible for conducting long-term care consultation services to:\n(1) modify the MnCHOICES application and assessment policies to create efficiencies while ensuring federal compliance with medical assistance and long-term services and supports eligibility criteria; and\n(2) develop a set of measurable benchmarks sufficient to demonstrate quarterly improvement in the average time per assessment and other mutually agreed upon measures of increasing efficiency.\n(c) The commissioner shall collect data on the benchmarks developed under paragraph (b) and provide to the lead agencies an annual trend analysis of the data in order to demonstrate the commissioner's compliance with the requirements of this subdivision.\n(a) Payments for long-term care consultation services are available to the county or counties to cover staff salaries and expenses to provide the services described in subdivision 11. The county shall employ, or contract with other agencies to employ, within the limits of available funding, sufficient personnel to provide long-term care consultation services while meeting the state's long-term care outcomes and objectives as defined in subdivision 1.\n(b) The county is accountable for meeting local objectives as approved by the commissioner in the biennial home and community-based services quality assurance plan. The county must document its compliance with the local objectives on a form provided by the commissioner.\n(c) The state shall pay 81.9 percent of the nonfederal share as reimbursement to the counties.",
	"repealed": false
}