{
	"id": "469.0813",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.0813",
	"title": "469.0813 ROSEMOUNT; PORT AUTHORITY.",
	"text": "The city of Rosemount may, by adoption of an enabling resolution in compliance with the procedural requirements of subdivision 3, establish a port authority commission that, subject to the provisions of subdivision 2, has the same powers as a port authority established under section 469.049 or other law, and a housing and redevelopment authority established under sections 469.001 to 469.047 or other law, and shall constitute an \"agency\" that may administer one or more municipal development districts under section 469.110. If the city establishes a port authority commission under this section, the city shall exercise all the powers relating to a port authority granted to any city by sections 469.048 to 469.068 or other law, and all powers relating to a housing and redevelopment authority granted to any city by sections 469.001 to 469.047 or other law.\n(a) The enabling resolution may impose the following limitations upon the actions of the port authority:\n(1) that the port authority shall not exercise any specified powers contained in sections 469.001 to 469.047 and 469.048 to 469.068 or that the port authority shall not exercise any powers without the prior approval of the city council;\n(2) that, except when previously pledged by the port authority, the city council may, by resolution, require the port authority to transfer any portion of the reserves generated by activities of the port authority which the city council determines is not necessary for the successful operation of the port authority, to the city general fund, to be used for any general purpose of the city;\n(3) that the sale of all bonds or obligations issued by the port authority be approved by the city council before issuance;\n(4) that the port authority follow the budget process for city departments as provided by the city and as implemented by the city council and mayor;\n(5) that all official actions of the port authority must be consistent with the adopted comprehensive plan of the city, and any official controls implementing the comprehensive plan;\n(6) that the port authority submit to the city council for approval by resolution any proposed project as defined in section 469.174, subdivision 8;\n(7) that the port authority submit all planned activities for influencing the action of any other governmental agency, subdivision, or body to the city council for approval;\n(8) that the port authority submit its administrative structure and management practices to the city council for approval; and\n(9) any other limitation or control established by the city council by the enabling resolution.\n(b) The enabling resolution may be modified at any time, subject to paragraph (e), and provided that any modification is made in accordance with the procedural requirements of subdivision 3.\n(c) Without limiting the right of the port authority to petition the city council at any time, each year, within 60 days of the anniversary date of the initial adoption of the enabling resolution, the port authority shall submit to the city council a report stating whether and how the enabling resolution should be modified. Within 30 days of receipt of the recommendation, the city council shall review the enabling resolution, consider the recommendations of the port authority, and make any modifications it considers appropriate; provided that any modification shall be made in accordance with the procedural requirements of subdivision 3.\n(d) A determination by the city council that the limitations imposed under this section have been complied with by the port authority shall be conclusive.\n(e) Limitations imposed under this section must not be applied in a manner that impairs the security of any bonds issued or contracts executed prior to the imposition of the limitation. The city council shall not modify any limitations in effect at the time any bonds or obligations are issued or contracts executed to the detriment of the holder of the bonds or obligations or any contracting party.\n(a) The creation of a port authority by the city of Rosemount must be by written resolution known as the enabling resolution. Prior to adoption of the enabling resolution, the city council shall conduct a public hearing. Notice of the time and place of hearing, a statement of the purpose of the hearing, and a summary of the resolution must be published in a newspaper of general circulation within the city once a week for two consecutive weeks. The first publication must appear not more than 30 days from the date of the public hearing.\n(b) All modifications to the enabling resolution must be by written resolution and must be adopted after notice is given and a public hearing conducted as required for the original adoption of the enabling resolution.\nNotwithstanding any law to the contrary, the city may choose the name of the commission.\nA commissioner of the port authority may be removed by the city council for inefficiency, neglect of duty, or misconduct in office. A commissioner shall be removed only after a hearing. A copy of the charges must be given to the commissioner at least ten days before the hearing. The commissioner must be given an opportunity to be heard in person or by counsel at the hearing. When written charges have been submitted against a commissioner, the city council may temporarily suspend the commissioner. If the city council finds that those charges have not been substantiated, the commissioner shall be immediately reinstated. If a commissioner is removed, a record of the proceedings, together with the charges and findings, shall be filed in the office of the city clerk.\nThis section is effective for the city of Rosemount September 1, 1992.",
	"repealed": false
}