{
	"id": "179.874",
	"url": "https://www.revisor.mn.gov/statutes/cite/179.874",
	"title": "179.874 ENFORCEMENT AND COMPLIANCE.",
	"text": "The commissioner, either on the commissioner's initiative or in response to a complaint, may inspect a meatpacking operation and subpoena records and witnesses as provided in sections 175.20, 177.27, and 182.659. If a meat-processing employer does not comply with the commissioner's inspection, the commissioner may seek relief as provided in this section or chapter 175 or 182.\nThe commissioner may issue a compliance order under section 177.27, subdivision 4, requiring an employer to comply with sections 179.875, paragraphs (b) and (c); 179.876, subdivisions 1 to 3 and 4, paragraphs (f) and (g); and 179.877. The commissioner also has authority, pursuant to section 182.662, subdivision 1, to issue a stop-work or business-closure order when there is a condition or practice that could result in death or serious physical harm.\nIf a meat-processing employer does not comply with a provision in sections 179.87 to 179.877, an aggrieved worker, authorized employee representative, or other person may bring a civil action in a court of competent jurisdiction within three years of an alleged violation and, upon prevailing, must be awarded the relief provided in this section. Pursuing administrative relief is not a prerequisite for bringing a civil action.\nThe attorney general may enforce sections 179.87 to 179.877 under section 8.31.\n(a) In a civil action or administrative proceeding brought to enforce sections 179.87 to 179.877, the court or commissioner must order relief as provided in this subdivision.\n(b) For any violation of sections 179.87 to 179.877:\n(1) an injunction to order compliance and restrain continued violations;\n(2) payment to a prevailing worker by a meat-processing employer of reasonable costs, disbursements, and attorney fees; and\n(3) a civil penalty payable to the state of not less than $100 per day per worker affected by the meat-processing employer's noncompliance with sections 179.87 to 179.877.\n(c) Any worker who brings a complaint under sections 179.87 to 179.877 and suffers retaliation is entitled to treble damages in addition to lost pay and recovery of attorney fees and costs.\n(d) Any company who is found to have retaliated against a meat-processing worker must pay a fine of up to $10,000 to the commissioner, in addition to other penalties available under the law.\n(a) The relief provided in this section may be recovered through a private civil action brought on behalf of the commissioner in a court of competent jurisdiction by another individual, including an authorized employee representative, pursuant to this subdivision.\n(b) The individual must give written notice to the coordinator of the specific provision or provisions of sections 179.87 to 179.877 alleged to have been violated. The individual or representative organization may commence a civil action under this subdivision if no enforcement action is taken by the commissioner within 30 days.\n(c) Civil penalties recovered pursuant to this subdivision must be distributed as follows:\n(1) 70 percent to the commissioner for enforcement of sections 179.87 to 179.877; and\n(2) 30 percent to the individual or authorized employee representative.\n(d) The right to bring an action under this subdivision shall not be impaired by private contract. A public enforcement action must be tried promptly, without regard to concurrent adjudication of a private claim for the same alleged violation.",
	"repealed": false
}