{
	"id": "82.81",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.81",
	"title": "82.81 PROHIBITIONS.",
	"text": "No person shall act as a real estate broker or real estate salesperson unless licensed as provided in this section.\nNo persons shall advertise or represent themselves to be real estate brokers or real estate salespersons unless licensed as provided in this section.\nWhen the owner fails or is unable to consummate a real estate transaction, through no fault of the purchaser, the listing broker may not claim any portion of any trust funds deposited with the broker by the purchaser, absent a separate agreement with the purchaser.\nNo real estate broker, salesperson, or closing agent shall engage or authorize any person, except one licensed as provided herein, to act as a real estate broker, salesperson, or closing agent on the engager's or authorizer's behalf.\nNo purchase agreement, earnest money contract, or similar contract for the purchase, rental, or lease of real property may contain any hold harmless clause or arbitration clause which addresses the rights or liabilities of persons required to be licensed pursuant to this chapter unless the person required to be licensed is a principal in the transaction.\nThis does not prohibit separate and independent written agreements between any of the parties and persons required to be licensed pursuant to this chapter.\n(a) No person licensed pursuant to this chapter or who otherwise acts as a real estate broker or salesperson shall fail to provide at the first substantive contact with a consumer in a residential real property transaction an agency disclosure form as set forth in section 82.67.\n(b) The seller may, in the listing agreement, authorize the seller's broker to disburse part of the broker's compensation to other brokers, including the buyer's brokers solely representing the buyer, as authorized in section 82.70, subdivision 4.\nA license issued under this chapter does not allow a licensee to engage in the business of buying, selling, negotiating, brokering, or otherwise dealing in vendor's interests in contracts for deed, mortgagee's interests in mortgages, or other evidence of indebtedness regarding real estate, except that a licensee may, if there is no compensation in addition to the brokerage commission or fee, and if the licensee represents the seller, buyer, lessor, or lessee in the sale, lease, or exchange of real estate, arrange for the sale of a contract, mortgage, or similar evidence of indebtedness for the subject property.\nNo real estate broker, salesperson, or closing agent shall require a person to use any particular lender, licensed attorney, real estate broker, real estate salesperson, real estate closing agent, or title insurance agent in connection with a residential real estate closing.\n(a) Except as provided in paragraph (c), a licensee shall not negotiate the sale, exchange, lease, or listing of any real property directly with the owner or lessor knowing that the owner or lessor has executed a written contract granting exclusive representation or assistance for the same service in connection with the property to another real estate broker, buyer, or lessee, nor shall a licensee negotiate the purchase, lease, or exchange of real property knowing that the buyer or lessee has executed a written contract granting exclusive representation or assistance for the same service of purchase, lease, or exchange of the real property with another real estate broker.\n(b) A licensee shall not induce any party to a contract of sale, purchase, lease, or option, or to an exclusive listing agreement or buyer's agreement, or facilitator services agreement, to breach the contract, option, or agreement.\n(c) A licensee may discuss the terms upon which a listing or buyer representation contract or a contract for facilitator services may be entered into after expiration of any existing exclusive contract when the inquiry or discussion is initiated by the owner, lessor, buyer, or lessee. The licensee must inquire of the owner, lessor, buyer, or lessee whether such an exclusive contract exists.\nLicensees shall not, with respect to the sale or lease of real property, guarantee or affirmatively encourage another person to guarantee future profits or earnings that may result from the purchase or lease of the real property in question unless the guarantee and the assumptions upon which it is based are fully disclosed and contained in the contract, purchase agreement, or other instrument of sale or lease.\nLicensees shall not discourage prospective parties to a real estate transaction from seeking the services of an attorney.\n(a) Prohibitions. For the purposes of section 82.82, subdivision 1, clause (b), the following acts and practices constitute fraudulent, deceptive, or dishonest practices:\n(1) act on behalf of more than one party to a transaction without the knowledge and consent of all parties;\n(2) act in the dual capacity of licensee and undisclosed principal in any transaction;\n(3) receive funds while acting as principal which funds would constitute trust funds if received by a licensee acting as an agent, unless the funds are placed in a trust account. Funds need not be placed in a trust account if a written agreement signed by all parties to the transaction specifies a different disposition of the funds, in accordance with section 82.82, subdivision 1;\n(4) violate any state or federal law concerning discrimination intended to protect the rights of purchasers or renters of real estate;\n(5) make a material misstatement in an application for a license or in any information furnished to the commissioner;\n(6) procure or attempt to procure a real estate license for the procuring individual or any person by fraud, misrepresentation, or deceit;\n(7) represent membership in any real estate-related organization in which the licensee is not a member;\n(8) advertise in any manner that is misleading or inaccurate with respect to properties, terms, values, policies, or services conducted by the licensee;\n(9) make any material misrepresentation or permit or allow another to make any material misrepresentation;\n(10) make any false or misleading statements, or permit or allow another to make any false or misleading statements, of a character likely to influence, persuade, or induce the consummation of a transaction contemplated by this chapter;\n(11) fail within a reasonable time to account for or remit any money coming into the licensee's possession which belongs to another;\n(12) commingle with the individual's own money or property trust funds or any other money or property of another held by the licensee;\n(13) a demand from a seller for a commission or compensation to which the licensee is not entitled, knowing that the individual is not entitled to the commission or compensation;\n(14) pay or give money or goods of value to an unlicensed person for any assistance or information relating to the procurement by a licensee of a listing of a property or of a prospective buyer of a property (this item does not apply to money or goods paid or given to the parties to the transaction);\n(15) fail to maintain a trust account at all times, as provided by law;\n(16) engage, with respect to the offer, sale, or rental of real estate, in an anticompetitive activity;\n(17) represent on advertisements, cards, signs, circulars, letterheads, or in any other manner, that the individual is engaged in the business of financial planning unless the individual provides a disclosure document to the client. The document must be signed by the client and a copy must be left with the client. The disclosure document must contain the following:\n(i) the basis of fees, commissions, or other compensation received by an individual in connection with rendering of financial planning services or financial counseling or advice in the following language:\n\"My compensation may be based on the following:\n(a) ... commissions generated from the products I sell you;\n(b) ... fees; or\n(c) ... a combination of (a) and (b). [Comments]\";\n(ii) the name and address of any company or firm that supplies the financial services or products offered or sold by an individual in the following language:\n\"I am authorized to offer or sell products and/or services issued by or through the following firm(s):\n[List]\nThe products will be traded, distributed, or placed through the clearing/trading firm(s) of:\n[List]\";\n(iii) the license(s) held by the person under this chapter or chapter 60A or 80A in the following language:\n\"I am licensed in Minnesota as a(n):\n(a) ... insurance agent;\n(b) ... securities agent or broker/dealer;\n(c) ... real estate broker or salesperson;\n(d) ... investment adviser\"; and\n(iv) the specific identity of any financial products or services, by category, for example mutual funds, stocks, or limited partnerships, the person is authorized to offer or sell in the following language:\n\"The license(s) entitles me to offer and sell the following products and/or services:\n(a) ... securities, specifically the following: [List];\n(b) ... real property;\n(c) ... insurance; and\n(d) ... other: [List].\"\n(b) Determining violation. A licensee shall be deemed to have violated this section if the licensee has been found to have violated sections 325D.49 to 325D.66, by a final decision or order of a court of competent jurisdiction.\n(c) Commissioner's authority. Nothing in this section limits the authority of the commissioner to take actions against a licensee for fraudulent, deceptive, or dishonest practices not specifically described in this section.",
	"repealed": false
}