{
	"id": "145A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/145A.03",
	"title": "145A.03 ESTABLISHMENT AND ORGANIZATION.",
	"text": "(a) The governing body of a county must undertake the responsibilities of a community health board by establishing or joining a community health board according to paragraphs (b) to (f) and assigning to it the powers and duties specified under section 145A.04.\n(b) A community health board must include within its jurisdiction a population of 30,000 or more persons or be composed of three or more contiguous counties.\n(c) A county board or city council within the jurisdiction of a community health board operating under sections 145A.11 to 145A.131 is preempted from forming a community health board except as specified in section 145A.131.\n(d) A county board or a joint powers board that establishes a community health board and has or establishes an operational human services board under chapter 402 may assign the powers and duties of a community health board to a human services board. Eligibility for funding from the commissioner will be maintained if all requirements of sections 145A.03 and 145A.04 are met.\n(e) Community health boards established prior to January 1, 2014, including city community health boards, are eligible to maintain their status as community health boards as outlined in this subdivision.\n(f) A community health board may authorize, by resolution, the community health service administrator or other designated agent or agents to act on behalf of the community health board.\nA county may establish a joint community health board by agreement with one or more contiguous counties, or an existing city community health board may establish a joint community health board with one or more contiguous existing city community health boards in the same county in which it is located. The agreements must be established according to section 471.59.\n[Repealed, 2014 c 291 art 7 s 29]\nA community health board must have at least five members, one of whom must be elected by the members as chair and one as vice-chair. The chair, or in the chair's absence, the vice-chair, must preside at meetings of the community health board and sign or authorize an agent to sign contracts and other documents requiring signature on behalf of the community health board.\nA community health board must hold meetings at least twice a year and as determined by its rules of procedure. The board must adopt written procedures for transacting business and must keep a public record of its transactions, findings, and determinations. Members may receive a per diem plus travel and other eligible expenses while engaged in official duties.\n[Repealed, 2014 c 291 art 7 s 29]\nA community health board that meets the requirements of this section is eligible to receive the local public health grant under section 145A.131 and for other funds that the commissioner grants to community health boards to carry out public health activities.",
	"repealed": false
}