{
	"id": "144.1225",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1225",
	"title": "144.1225 ADVANCED DIAGNOSTIC IMAGING SERVICES.",
	"text": "For purposes of this section, \"advanced diagnostic imaging services\" has the meaning given in United States Code, title 42, section 1395M, except that it does not include x-ray, ultrasound, or fluoroscopy.\n(a)(1) Except as otherwise provided in paragraphs (b) and (c), advanced diagnostic imaging services eligible for reimbursement from any source, including, but not limited to, the individual receiving such services and any individual or group insurance contract, plan, or policy delivered in this state, including, but not limited to, private health insurance plans, workers' compensation insurance, motor vehicle insurance, the State Employee Group Insurance Program (SEGIP), and other state health care programs, shall be reimbursed only if the facility at which the service has been conducted and processed is licensed pursuant to sections 144.50 to 144.56 or accredited by one of the following entities:\n(i) American College of Radiology (ACR);\n(ii) Intersocietal Accreditation Commission (IAC);\n(iii) the Joint Commission; or\n(iv) other relevant accreditation organization designated by the Secretary of the United States Department of Health and Human Services pursuant to United States Code, title 42, section 1395M.\n(2) All accreditation standards recognized under this section must include, but are not limited to:\n(i) provisions establishing qualifications of the physician;\n(ii) standards for quality control and routine performance monitoring by a medical physicist;\n(iii) qualifications of the technologist, including minimum standards of supervised clinical experience;\n(iv) guidelines for personnel and patient safety; and\n(v) standards for initial and ongoing quality control using clinical image review and quantitative testing.\n(b) Any facility that performs advanced diagnostic imaging services and is eligible to receive reimbursement for such services from any source in paragraph (a), clause (1), must obtain licensure pursuant to sections 144.50 to 144.56 or accreditation pursuant to paragraph (a) by August 1, 2013. Thereafter, all facilities that provide advanced diagnostic imaging services in the state must obtain licensure or accreditation within six months of commencing operations and must maintain either licensure pursuant to sections 144.50 to 144.56 or accreditation with an accrediting organization as provided in paragraph (a).\n(c) Dental clinics or offices that perform diagnostic imaging through dental cone beam computerized tomography do not need to meet the accreditation or reporting requirements in this section.\n(a) Advanced diagnostic imaging facilities and providers of advanced diagnostic imaging services must annually report to the commissioner demonstration of accreditation as required under this section.\n(b) The commissioner may promulgate any rules necessary to administer the reporting required under paragraph (a).",
	"repealed": false
}