{
	"id": "239.101",
	"url": "https://www.revisor.mn.gov/statutes/cite/239.101",
	"title": "239.101 INSPECTION FEES.",
	"text": "The department shall recover the amount appropriated to the weights and measures program through revenue from two separate fee systems under subdivisions 2 and 3, and according to the fee-setting and cost-recovery requirements in subdivisions 4, 5, and 6.\nThe director shall charge a fee to the owner for inspecting and testing weights and measures, providing metrology services and consultation, and providing petroleum quality assurance tests at the request of a licensed distributor. Money collected by the director must be paid into the state treasury and credited to the state general fund.\n(a) An inspection fee is imposed (1) on petroleum products when received by the first licensed distributor, and (2) on petroleum products received and held for sale or use by any person when the petroleum products have not previously been received by a licensed distributor. The petroleum inspection fee is $1 for every 1,000 gallons received. The commissioner of revenue shall collect the fee. The revenue from 89 cents of the fee is appropriated to the commissioner of commerce for the cost of operations of the Division of Weights and Measures and petroleum supply monitoring. The remainder of the fee must be deposited in the general fund.\n(b) The commissioner of revenue shall credit a person for inspection fees previously paid in error or for any material exported or sold for export from the state upon filing of a report as prescribed by the commissioner of revenue.\n(c) The commissioner of revenue may collect the inspection fee along with any taxes due under chapter 296A.\nMS 2012 [Repealed, 2014 c 222 art 1 s 58]\nWhen the department estimates that inspection costs will exceed the revenue from the fee, the commissioner shall notify the commissioner of management and budget. The commissioner of management and budget shall then request a fee increase from the legislature.\nThe cost of inspection activities and services not specified in subdivisions 2 and 3, including related overhead costs, must be equitably apportioned and recovered by the fees.\n[Repealed, 2007 c 62 s 16]",
	"repealed": false
}