{
	"id": "72C.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/72C.10",
	"title": "72C.10 FILING REQUIREMENTS; DUTIES OF COMMISSIONER.",
	"text": "No insurer shall make, issue, amend, or renew any policy or contract after the dates specified in section 72C.11 for the applicable type of policy unless the contract is in compliance with the requirements of sections 72C.06 to 72C.09 and unless the contract is filed with the commissioner for approval. The contract shall be deemed approved 60 days after filing unless disapproved by the commissioner within the 60-day period. When an insurer, service plan corporation, or the Minnesota Comprehensive Health Association fails to respond to an objection or inquiry within 60 days, the filing is automatically disapproved. A resubmission is required if action by the Department of Commerce is subsequently requested. An additional filing fee is required for the resubmission. The commissioner shall not unreasonably withhold approval. Any disapproval shall be delivered to the insurer in writing, stating the grounds therefor. Any policy filed with the commissioner shall be accompanied by a Flesch scale readability analysis and test score and by the insurer's certification that the policy or contract is in its judgment readable based on the factors specified in sections 72C.06 to 72C.08.\nThe commissioner shall disapprove any contract or policy covered by subdivision 1 if the commissioner finds that:\n(a) it is not accompanied by a certified Flesch scale analysis readability score of more than 40;\n(b) it is not accompanied by the insurer's certification that the policy or contract is in its judgment readable under the standards of sections 72C.01 to 72C.13;\n(c) it does not comply with the readability standards established by section 72C.06;\n(d) it does not comply with the legibility standards established by section 72C.07; or\n(e) it does not comply with the format requirements established by section 72C.08.",
	"repealed": false
}