{
	"id": "136F.20",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.20",
	"title": "136F.20 STUDENT HEALTH.",
	"text": "The board shall offer health services for students at each state university and may offer health services for students at each state college. The health services may be offered either on campus or in the nearby community. The board may charge each student a health service fee set by the board. The fees shall be used to maintain the health service and equip and construct facilities. The fee may be used to contract for health, medical, and hospitalization insurance for students. The fees shall be deposited in an activity fund and are annually appropriated to the board for the purposes of this subdivision. Each state college and university shall provide an annual financial accounting of the health service money to the board.\nThe board may contract for hospital benefits coverage and medical benefits coverage for students in the state colleges and universities in the same manner as authorized by section 43A.23 for state employees.\n(a) The board must contract with one or more independent mental health organizations to provide mental health care, including by use of telehealth, on campus at up to five state colleges. To be eligible to apply for the program, the state college must employ one or more faculty counselors. These grants are designed to build on the current support provided by faculty counselors and are not a replacement for them. Mental health services must be provided without charge to students who are uninsured, who have high co-payments, or whose health insurance does not cover the service provided. A memorandum of understanding shall be developed between the college and the mental health organization outlining the use of space on campus, how the students will be notified of the service, how they will collaborate with faculty counselors, the provision of services, and other items.\n(b) A mental health organization providing mental health care under paragraph (a) must also provide information and guidance to students seeking health insurance.\n(a) The board shall implement a mental health awareness program at each Minnesota state college and university by the start of the 2022-2023 academic year. A mental health awareness program shall include:\n(1) a web page at each institution that includes links to existing self-assessment resources, resources connecting students to campus and community-based resources, and emergency contact information and resources;\n(2) mandatory mental health first aid training, evidence-based suicide prevention training, or other similar mental health training for faculty, staff, and students, giving priority to those who serve in roles that include increased direct contact with students who are experiencing mental health concerns, such as student housing and campus safety employees. Each college and university shall identify the appropriate faculty, staff, and students to receive training based on college or university structure and available funding;\n(3) a session at each student orientation program that includes information about maintaining good mental health, the symptoms of mental health conditions common among college students, and mental health resources and services available to students;\n(4) a messaging strategy to send students information on available mental health resources and services at least once per term, and during periods of high academic stress; and\n(5) distributing the suicide prevention helpline and text line contact information in a way that increases accessibility and awareness of that information to students.\n(b) The board shall create and maintain a mental health community of practice including faculty and staff with subject matter expertise in mental health to identify resources and best practices to inform campus-based strategies to raise awareness of local and state resources and implement appropriate training experiences.\n(c) The board shall make grants to Minnesota State Colleges and Universities to establish a peer support pilot program designed to assist students with a mental health condition. The program shall utilize student peers to support students living with mental health conditions on campus. The peer support program may be housed within the counseling center, wellness center, or resident assistance programs on campus. The peer support program leaders must be trained to facilitate discussions on mental health, identify students who may be in crisis, and refer students to programs for mental health support.",
	"repealed": false
}