{
	"id": "145.924",
	"url": "https://www.revisor.mn.gov/statutes/cite/145.924",
	"title": "145.924 HIV PREVENTION GRANTS.",
	"text": "(a) The commissioner may award grants to community health boards as defined in section 145A.02, subdivision 5, state agencies, state councils, or nonprofit corporations to provide evaluation and counseling services to populations at risk for acquiring human immunodeficiency virus infection, including, but not limited to, communities of color, adolescents, women, people who inject drugs, and gay, bisexual, and transgender individuals.\n(b) The commissioner may award grants to agencies experienced in providing services to communities of color, for the design of innovative outreach and education programs for targeted groups within the community who may be at risk of acquiring the human immunodeficiency virus infection, including people who inject drugs and their partners, adolescents, women, and gay, bisexual, and transgender individuals. Grants shall be awarded on a request for proposal basis and shall include funds for administrative costs. Priority for grants shall be given to agencies or organizations that have experience in providing service to the particular community which the grantee proposes to serve; that have policy makers representative of the targeted population; that have experience in dealing with issues relating to HIV/AIDS; and that have the capacity to deal effectively with persons of differing sexual orientations. For purposes of this paragraph, the \"communities of color\" are: the American-Indian community; the Hispanic community; the African-American community; and the Asian-Pacific Islander community.\n(c) All state grants awarded under this section for programs targeted to adolescents shall include the promotion of abstinence from sexual activity and drug use.\n(d) The commissioner shall administer a grant program to provide funds to organizations, including Tribal health agencies, to assist with HIV outbreaks.",
	"repealed": false
}