{
	"id": "473H.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/473H.02",
	"title": "473H.02 DEFINITIONS.",
	"text": "For purposes of sections 473H.02 to 473H.17 the terms defined in this section shall have the meanings given them.\n\"Agricultural preserve\" or \"preserve\" means a land area created and restricted according to section 473H.05 to remain in agricultural use.\n\"Agricultural use\" means the production for sale of livestock, dairy animals, dairy products, poultry or poultry products, fur-bearing animals, horticultural or nursery stock, fruit, vegetables, forage, grains, or bees and apiary products. Wetlands, pasture and woodlands accompanying land in agricultural use shall be deemed to be in agricultural use.\n\"Authority\" means the unit of government exercising planning and zoning authority for the land specified in an application as provided under section 473H.05 and pursuant to sections 394.21 to 394.37 or 462.351 to 462.364, or Minnesota Statutes 2020, sections 366.10 to 366.181. Where both a county and a township have adopted zoning regulations, the authority shall be the unit of government designated to prepare a comprehensive plan pursuant to section 473.861, subdivision 2.\n\"Certified long-term agricultural land\" means land certified pursuant to section 473H.04 as eligible for designation as agricultural preserves.\n\"Covenant\" means a restrictive covenant initiated by the owner and contained in the application provided for in section 473H.05 whereby the owner places the limitations on specified land and receives the protections and benefits contained in sections 473H.02 to 473H.17.\n\"Long-term agricultural land\" means land in the metropolitan area designated for agricultural use in local or county comprehensive plans adopted and reviewed pursuant to sections 473.175, and 473.851 to 473.871, and which has been zoned specifically for agricultural use permitting a maximum residential density of not more than one unit per quarter/quarter.\n\"Metropolitan area\" has the meaning given it in section 473.121, subdivision 2.\n\"Owner\" means a resident of the United States owning land specified in an application pursuant to section 473H.05, and includes an individual, legal guardian or family farm corporation as defined in section 500.24, having a joint or common interest in the land. Where land is subject to a contract for deed, owner means the vendor in agreement with the vendee.\n\"Quarter/quarter\" means one quarter of one quarter of any section in the rectangular land survey system.\nMS 1998 [Repealed, 1999 c 11 art 1 s 72]",
	"repealed": false
}