{
	"id": "501C.0103",
	"url": "https://www.revisor.mn.gov/statutes/cite/501C.0103",
	"title": "501C.0103 DEFINITIONS.",
	"text": "In this chapter:\n(a) \"Action\" with respect to an act of a trustee includes a failure to act.\n(b) \"Ascertainable standard\" means a standard relating to an individual's health, education, support, or maintenance within the meaning of section 2041(b)(1)(A) or 2514(c)(1) of the Internal Revenue Code of 1986, as in effect on January 1, 2016.\n(c) \"Beneficiary\" means a person that:\n(1) has a present or future beneficial interest in a trust, vested or contingent; or\n(2) in a capacity other than that of trustee, holds a power of appointment over trust property.\n(d) \"Charitable trust\" means a trust, or portion of a trust, created for a charitable purpose described in section 501B.35.\n(e) \"Conservator\" means a person who is appointed by a court to manage the estate of a protected person under sections 524.5-101 to 524.5-903.\n(f) \"Environmental law\" means a federal, state, or local law, rule, regulation, or ordinance relating to protection of the environment.\n(g) \"Guardian\" means a person who has qualified as a guardian of a minor or incapacitated person pursuant to testamentary or court appointment, but excludes one who is a guardian ad litem, under sections 524.5-101 to 524.5-903.\n(h) \"Interests of the beneficiaries\" means the beneficial interests provided in the terms of the trust.\n(i) \"Jurisdiction,\" with respect to a geographic area, includes a state or country.\n(j) \"Person\" means an individual, corporation, business trust, estate, trust, partnership, limited liability company, association, joint venture, government, governmental subdivision, agency, or instrumentality, public corporation, or any other legal or commercial entity.\n(k) \"Power of withdrawal\" means a presently exercisable general power of appointment other than a power:\n(1) exercisable by a trustee and limited by an ascertainable standard; or\n(2) exercisable by another person only upon consent of the trustee or a person holding an adverse interest.\n(l) \"Property\" means anything that may be the subject of ownership, whether real or personal, legal or equitable, or any interest therein.\n(m) \"Qualified beneficiary\" means a beneficiary who, on the date the beneficiary's qualification is determined:\n(1) is a distributee or permissible distributee of trust income or principal;\n(2) would be a distributee or permissible distributee of trust income or principal if the interests of the distributees described in clause (1) terminated on that date without causing the trust to terminate; or\n(3) would be a distributee or permissible distributee of trust income or principal if the trust terminated on that date.\n(n) \"Revocable,\" as applied to a trust, means revocable by the settlor without the consent of the trustee or a person holding an adverse interest.\n(o) \"Settlor\" means a person, including a testator, who creates or contributes property to a trust. If more than one person creates or contributes property to a trust, each person is a settlor of the portion of the trust property attributable to that person's contribution except to the extent another person has the power to revoke or withdraw that portion.\n(p) \"Spendthrift provision\" means a term of a trust which restricts both voluntary and involuntary transfer of a beneficiary's interest.\n(q) \"State\" means a state of the United States, the District of Columbia, Puerto Rico, the United States Virgin Islands, or any territory or insular possession subject to the jurisdiction of the United States. The term includes an Indian tribe or band recognized by federal law or formally acknowledged by a state.\n(r) \"Terms of a trust\" means the manifestation of the settlor's intent regarding a trust's provisions as expressed in the trust instrument or as may be established by other evidence that would be admissible in a judicial proceeding.\n(s) \"Trust instrument\" means an instrument executed by the settlor that contains terms of the trust, including any amendments thereto.\n(t) \"Trustee\" includes an original, additional, and successor trustee, and a cotrustee, whether or not appointed or confirmed by a court.",
	"repealed": false
}