{
	"id": "115A.66",
	"url": "https://www.revisor.mn.gov/statutes/cite/115A.66",
	"title": "115A.66 TERMINATION.",
	"text": "Proceedings for the termination of a district shall be initiated by the filing of a petition with the commissioner. The petition shall be submitted by the governing bodies of not less than one-half of the counties which are wholly or partly in the district. The petition shall state that the existence of the district is no longer in the public interest. The petitioners shall publish notice of the petition in newspapers of general circulation in the district and shall cause to be served upon each political subdivision wholly or partly within the district a copy of the petition, and proof of service shall be attached to the petition filed with the commissioner.\nIf the petition is dismissed or denied, the petitioners shall be required to pay all costs and expenses of the proceeding for termination. At the time of filing the petition, a bond shall be filed by the petitioners with the commissioner in such sum as the commissioner determines to be necessary to ensure payment of costs.\nIf objection is made to the commissioner against the petition for termination, a contested case hearing on the petition shall be held in the waste district pursuant to chapter 14. If the commissioner determines that the termination of the district as proposed in the petition would not be in the public interest, the commissioner shall give notice to the petitioner of intent to deny the petition. If a contested case hearing has not been held, the petitioner may request a hearing within 30 days of the notice of intent to deny the petition. The request shall be granted. Following the hearing and the report of the administrative law judge, the commissioner shall make a final decision on the petition. If the petition is dismissed, all costs of the proceeding shall be assessed against the petitioner. If the commissioner determines that the existence of the district is no longer in the public interest, the commissioner shall by findings and order terminate the district. Upon the filing of a certified copy of the findings and order with the secretary of state, the district shall cease to be a public corporation and a political subdivision of the state.\nThe commissioner shall not entertain a petition for termination of a district within five years from the date of the formation of the district nor shall the commissioner entertain a petition for termination of the same district more often than once in five years.",
	"repealed": false
}