{
	"id": "360.013",
	"url": "https://www.revisor.mn.gov/statutes/cite/360.013",
	"title": "360.013 DEFINITIONS.",
	"text": "For the purposes of laws of this state relating to aeronautics, the following words, terms, and phrases shall have the meanings herein given unless otherwise specifically defined, or unless another intention clearly appears, or the context otherwise requires.\n[Renumbered subd 31]\n[Renumbered subd 37]\n[Renumbered subds 44,54]\n[Renumbered subd 39]\n[Renumbered subd 57]\n[Renumbered subds 46,47,58]\n[Renumbered subd 53]\n[Renumbered subd 34]\n[Renumbered subd 52]\n[Renumbered subd 45]\n[Renumbered subd 38]\n[Renumbered subd 35]\n[Renumbered subd 59]\n[Renumbered subd 51]\n[Renumbered subd 33]\n[Renumbered subd 36]\n[Renumbered subd 48]\n[Renumbered subd 32]\n[Renumbered subd 50]\n[Renumbered subd 49]\n[Renumbered subd 40]\n[Renumbered subd 56]\n[Renumbered subd 42]\n[Renumbered subd 60]\n[Renumbered subd 61]\n\"Administrative agency\" means either a governing body of a municipality or an administrative agency under its jurisdiction to which any powers have been delegated by such governing body.\n[Renumbered subd 41]\n[Renumbered subd 55]\n[Renumbered subd 43]\n\"Aeronautics\" means transportation by aircraft; the operation, construction, repair, or maintenance of aircraft, aircraft power plants, and accessories; the design, establishment, construction, extension, operation, improvement, repair, or maintenance of airports, restricted landing areas, or other air navigation facilities, and air instruction.\n\"Aeronautics instructor\" means any individual engaged in giving instruction, or offering to give instruction, in aeronautics, either in flying or ground subjects, or both, for hire or reward, without advertising such occupation, without calling facilities an \"air school,\" or anything equivalent thereto, and without employing or using other instructors. It does not include any instructor in any public school of this state, the University of Minnesota, or in any institution of higher learning accredited by the North Central Association of Colleges and Secondary Schools and approved for carrying on collegiate work, while engaged in duties as such instructor.\n\"Air instruction\" means the imparting of aeronautical information by any aeronautics instructor or in or by any air school or flying club.\n\"Air navigation\" means the operation or navigation of aircraft in the air space over this state, or upon any airport or restricted landing area within this state.\n\"Air navigation facility\" means any facility other than one owned or controlled by the federal government, used in, available for use in, or designed for use in, aid of air navigation, including airports, restricted landing areas, and any structures, mechanisms, lights, beacons, marks, communicating systems, electronic device, or other instrumentalities or devices used or useful as an aid, or constituting an advantage or convenience, to the safe takeoff, navigation, and landing of aircraft, or the safe and efficient operation or maintenance of an airport or restricted landing area, and any combination of any or all of such facilities.\n\"Air school\" means any person engaged in giving, or offering to give, instruction in aeronautics, either in flying or ground subjects, or both, for or without hire or reward, and advertising, representing, or holding out as giving or offering to give such instructions. It does not include any public school, the University of Minnesota, or any institution of higher learning accredited by the North Central Association of Colleges and Secondary Schools and approved by it for carrying on collegiate work.\n\"Aircraft\" means any contrivance now known or hereafter invented, used, or designed for navigation of or flight in the air, but excluding parachutes.\n\"Airman\" means any individual who engages, as the person in command, or as pilot, mechanic, or member of the crew, in the navigation of aircraft while under way and (excepting individuals employed outside the United States, any individual employed by a manufacturer of aircraft, aircraft engines, propellers, or appliances to perform duties as inspector or mechanic in connection therewith, and any individual performing inspection or mechanical duties in connection with aircraft owned or operated by that individual) any individual who is directly in charge of the inspection, maintenance, overhauling, or repair of aircraft engines, propellers, or appliances; and any individual who serves in the capacity of aircraft dispatcher or air-traffic control tower operator.\n\"Airport\" means any area of land or water, except a restricted landing area, which is designed for the landing and takeoff of aircraft, whether or not facilities are provided for the shelter, surfacing, or repair of aircraft, or for receiving or discharging passengers or cargo, and all appurtenant areas used or suitable for airport buildings or other airport facilities, and all appurtenant rights-of-way, whether heretofore or hereafter established. The operation and maintenance of airports is an essential public service.\n\"Airport hazard\" means any structure, object of natural growth, or use of land, which obstructs the air space required for the flight of aircraft in landing or taking off at any airport or restricted landing area or is otherwise hazardous to such landing or taking off.\n\"Airport hazard area\" means any area of land or water upon which an airport hazard might be established if not prevented as provided in this chapter.\n\"Airport protection privileges\" means easements through or other interest in air space over land or water, interest in airport hazards outside the boundaries of airports or restricted landing areas, and other protection privileges, the acquisition or control of which is necessary to insure safe approaches to the landing areas of airports and restricted landing areas and the safe and efficient operation thereof.\n\"Airport purposes\" means and includes airport, restricted landing area, and other air navigation facility purposes.\n\"Civil aircraft\" means any aircraft other than a public aircraft.\n\"Commercial operations\" means any operations of an aircraft for compensation or hire; or any services performed incidental to the operation of any aircraft for which a fee is charged or compensation received; including, but not limited to, the servicing, maintaining, and repairing of aircraft, the rental or charter of aircraft, the operation of flight or ground schools, the operation of aircraft for the application or distribution of chemicals or other substances, aerial photography and surveys, air shows or expositions, and the operation of aircraft for fishing. \"Commercial operations\" also means brokering or selling of any of the aforesaid services but do not include any operations of aircraft as common carriers certificated (certified) by the federal government or the services incidental thereto.\n\"Commissioner\" means the commissioner of transportation of the state of Minnesota.\n\"Comprehensive plan\" has the meaning given in section 394.22, subdivision 9, or 462.352, subdivision 5.\n\"Department\" means the Minnesota Department of Transportation.\n\"Flying club\" means any person other than an individual, which, neither for profit nor reward, owns, leases, or uses one or more aircraft for the purpose of instruction or pleasure, or both.\n\"Governing body\" means the council, board of trustees, board of commissioners, board of supervisors, or other body, board, commission, or other authority charged with governing any municipality, and in municipalities in which the board of park commissioners or other body in charge of the park system of the municipality controls airports owned by the municipality includes such board or other body.\n\"Municipality\" means a city of any class, including a city organized under a charter framed pursuant to the Constitution of the state of Minnesota, article IV, section 36, article XI, section 4, or article XII, section 5, a county, a town, or a statutory city in this state, the regents of the University of Minnesota, and any other political subdivision, public corporation, authority, or district in this state which is or may be authorized by law to acquire, establish, construct, maintain, improve, and operate airports and other air navigation facilities.\n\"Navigable air space\" means air space above the minimum altitudes of flight prescribed by the laws of this state or by rules of the commissioner consistent therewith.\n\"Operation of aircraft\" or \"operate aircraft\" means the use of aircraft for the purpose of air navigation and includes the navigation or piloting of aircraft. Any person who causes or authorizes the operation of aircraft, whether with or without the right of legal control (in the capacity of owner, lessee, or otherwise) of the aircraft, shall be deemed to be engaged in the operation of aircraft within the meaning of the statutes of this state.\n\"Person\" means any individual, firm, partnership, corporation, company, association, joint stock association, or body politic; and includes any trustee, receiver, assignee, or other similar representative thereof.\n\"Public aircraft\" means an aircraft used exclusively in the service of any government or of any political subdivision thereof, including the government of any state, territory or possession of the United States, or the District of Columbia, but not including any government-owned aircraft engaged in carrying persons or property for commercial purposes.\nWhen used in this chapter with reference to an airport, the term \"public utility class\" means available to the general public for private flying or otherwise as a point of arrival or departure by air.\nAn airport, restricted landing area, or other air navigation facility is \"publicly owned\" if owned by the state or a municipality.\n\"Restricted landing area\" means any area of land, water, or both, which is used or is made available for the landing and takeoff of aircraft, the use of which shall, except in case of emergency, be only as provided from time to time by the commissioner.\n\"Small unmanned aircraft\" means an aircraft, as defined in subdivision 37, that weighs less than 55 pounds and is operated without the possibility of human intervention from within or on the aircraft.\n\"Small unmanned aircraft system\" means a small unmanned aircraft and all of its associated elements, including components and communication links, that are required to control and operate the aircraft.\n\"Roadable aircraft\" has the meaning given in section 169.011, subdivision 67a.\n\"State\" or \"this state\" means the state of Minnesota.\nMS 2012 [Repealed, 2014 c 227 art 1 s 23]\n\"Structure\" means any object constructed or installed, including, but without limitation, buildings, towers, smokestacks, and overhead transmission lines.\n\"Tree\" means any object of natural growth.",
	"repealed": false
}