{
	"id": "116L.667",
	"url": "https://www.revisor.mn.gov/statutes/cite/116L.667",
	"title": "116L.667 RURAL CAREER COUNSELING COORDINATORS.",
	"text": "Each workforce development area located outside of the metropolitan area, as defined in section 473.121, subdivision 2, except for a service area that serves a single city outside of the metropolitan area, must have a career counseling coordinator who is responsible for improving coordination and communication of workforce development programs and services within the workforce development area, with other workforce development areas and career counseling coordinators, and with administering agencies. A career counseling coordinator may serve as the coordinator for up to two service areas.\nA career counseling coordinator is responsible for:\n(1) understanding the needs of existing, new, and prospective service area businesses in regard to workforce development programs, resources, and other services;\n(2) connecting job seekers, secondary and higher education institutions, employers, and other stakeholders and partners;\n(3) providing services to job seekers including career counseling, training, and work experience opportunities;\n(4) assessing and compiling information about all workforce development programs and services offered in the assigned workforce development area, including adult basic education programs and programs and services at higher education institutions and kindergarten through grade 12 schools;\n(5) making recommendations to the commissioner regarding ways to improve career counseling coordination, possible program changes, and new workforce programs or initiatives;\n(6) sharing best practices and collaborating with other career counseling coordinators to promote and enable state-level coordination among workforce development programs and administering agencies including, but not limited to, the Departments of Employment and Economic Development, Education, and Labor and Industry, and the Office of Higher Education; and\n(7) promoting available workforce development and career counseling programs and resources in the workforce development area.\nThe workforce council in each of the workforce development areas having a career counseling coordinator shall submit an annual report to the commissioner that includes, but is not limited to, a narrative of and the number of businesses, job seekers, and other stakeholders served by the career counseling coordinator function, an accounting of workforce development and career counseling programs and services offered in the assigned workforce development area, and any recommendations for changes to workforce development efforts in the workforce development area. Beginning January 15, 2016, and each year thereafter, the commissioner shall consolidate the reports and submit the consolidated report to the legislative committees with jurisdiction over economic development and workforce policy and finance.",
	"repealed": false
}