{
	"id": "174.86",
	"url": "https://www.revisor.mn.gov/statutes/cite/174.86",
	"title": "174.86 COMMUTER RAIL PLAN; REVIEW.",
	"text": "Before a final design plan is prepared for commuter rail facilities, the commissioner must hold a public hearing on the physical design component of the advanced corridor plan. The commissioner must provide appropriate public notice of the hearing and publicity to ensure that affected parties have an opportunity to present their views at the hearing. The commissioner shall summarize the proceedings and testimony and maintain the record of a hearing held under this subdivision, including any written statements submitted.\nAt least 30 days before the hearing under subdivision 1, the commissioner shall submit the physical design component of the advanced corridor plan to the governing body of each statutory and home rule charter city, county, and town in which the route is to be located. Within 45 days after the hearing under subdivision 1, the city, county, or town shall review and comment on the plan. Within 45 days of the hearing, a city or town shall approve or disapprove the location and design of the station to be located in the city or town. A city or town that disapproves shall describe specific amendments to the plan that, if adopted, would cause the city or town to withdraw its disapproval. Failure to comment in writing within 45 days after the hearing is deemed to be accepted unless an extension of time is agreed to by the metropolitan planning organization and the commissioner of transportation.\nAfter the hearing under subdivision 1, and after the receipt of comment under subdivision 2, the commissioner may modify the advanced corridor plan.\nBefore constructing commuter rail facilities, the commissioner shall submit the advanced corridor plan to each metropolitan planning organization in which the route is to be located. The metropolitan planning organization shall hold a hearing on the plan allowing the commissioner, local governmental units, and other persons to present their views as to whether the plan is consistent with the metropolitan planning organization's development guide. Within 60 days after the hearing, the metropolitan planning organization shall review the plan submitted by the commissioner to determine whether it is consistent with the development guide. If the plan is consistent with the development guide, the metropolitan planning organization shall approve it. If the plan is not consistent with the development guide, the metropolitan planning organization shall submit to the commissioner proposed amendments to the plan to make it consistent with the development guide. The commissioner shall incorporate the proposed amendments into the final design plan.\n(a) A Commuter Rail Corridor Coordinating Committee is established to advise the commissioner on issues relating to the alternatives analysis, environmental review, advanced corridor planning, preliminary engineering, final design, implementation method, construction of commuter rail, public involvement, land use, service, and safety. The Commuter Rail Corridor Coordinating Committee shall consist of:\n(1) one member representing each significant funding partner in whose jurisdiction the line or lines are located;\n(2) one member appointed by each county in which the corridors are located;\n(3) one member appointed by each city in which advanced corridor plans indicate that a station may be located;\n(4) two members appointed by the commissioner, one of whom shall be designated by the commissioner as the chair of the committee;\n(5) one member appointed by each metropolitan planning organization through which the commuter rail line may pass;\n(6) one member appointed by the president of the University of Minnesota, if a designated corridor provides direct service to the university; and\n(7) two ex-officio members who are members of labor organizations operating in, and with authority for, trains or rail yards or stations junctioning with freight and commuter rail lines on corridors, with one member appointed by the speaker of the house and the other member appointed by the senate Rules and Administration Subcommittee on Committees.\n(b) A joint powers board existing on April 1, 1999, consisting of local governments along a commuter rail corridor, shall perform the functions set forth in paragraph (a) in place of the committee.\n(c) The committee does not expire.",
	"repealed": false
}