{
	"id": "144.1501",
	"url": "https://www.revisor.mn.gov/statutes/cite/144.1501",
	"title": "144.1501 HEALTH PROFESSIONAL EDUCATION LOAN FORGIVENESS PROGRAM.",
	"text": "(a) For purposes of this section, the following definitions apply.\n(b) \"Advanced dental therapist\" means an individual who is licensed as a dental therapist under section 150A.06, and who is certified as an advanced dental therapist under section 150A.106.\n(c) \"Alcohol and drug counselor\" means an individual who is licensed as an alcohol and drug counselor under chapter 148F.\n(d) \"Dental therapist\" means an individual who is licensed as a dental therapist under section 150A.06.\n(e) \"Dentist\" means an individual who is licensed to practice dentistry.\n(f) \"Designated rural area\" means a statutory and home rule charter city or township that is outside the seven-county metropolitan area as defined in section 473.121, subdivision 2, excluding the cities of Duluth, Mankato, Moorhead, Rochester, and St. Cloud.\n(g) \"Emergency circumstances\" means those conditions that make it impossible for the participant to fulfill the service commitment, including death, total and permanent disability, or temporary disability lasting more than two years.\n(h) \"Hospital nurse\" means an individual who is licensed as a registered nurse and who is providing direct patient care in a nonprofit hospital setting.\n(i) \"Mental health professional\" means an individual providing clinical services in the treatment of mental illness who is qualified in at least one of the ways specified in section 245.462, subdivision 18.\n(j) \"Medical resident\" means an individual participating in a medical residency in family practice, internal medicine, obstetrics and gynecology, pediatrics, or psychiatry.\n(k) \"Midlevel practitioner\" means a nurse practitioner, nurse-midwife, nurse anesthetist, advanced clinical nurse specialist, or physician assistant.\n(l) \"Nurse\" means an individual who has completed training and received all licensing or certification necessary to perform duties as a licensed practical nurse or registered nurse.\n(m) \"Nurse-midwife\" means a registered nurse who has graduated from a program of study designed to prepare registered nurses for advanced practice as nurse-midwives.\n(n) \"Nurse practitioner\" means a registered nurse who has graduated from a program of study designed to prepare registered nurses for advanced practice as nurse practitioners.\n(o) \"Pharmacist\" means an individual with a valid license issued under chapter 151.\n(p) \"Physician\" means an individual who is licensed to practice medicine in the areas of family practice, internal medicine, obstetrics and gynecology, pediatrics, or psychiatry.\n(q) \"Physician assistant\" means a person licensed under chapter 147A.\n(r) \"Public health nurse\" means a registered nurse licensed in Minnesota who has obtained a registration certificate as a public health nurse from the Board of Nursing in accordance with Minnesota Rules, chapter 6316.\n(s) \"Qualified educational loan\" means a government, commercial, or foundation loan for actual costs paid for tuition, reasonable education expenses, and reasonable living expenses related to the graduate or undergraduate education of a health care professional.\n(t) \"Underserved urban community\" means a Minnesota urban area or population included in the list of designated primary medical care health professional shortage areas (HPSAs), medically underserved areas (MUAs), or medically underserved populations (MUPs) maintained and updated by the United States Department of Health and Human Services.\n[See Note.]\n(a) The commissioner of health shall use money appropriated for health professional education loan forgiveness in this section:\n(1) for medical residents, physicians, mental health professionals, and alcohol and drug counselors agreeing to practice in designated rural areas or underserved urban communities or specializing in the area of pediatric psychiatry;\n(2) for midlevel practitioners agreeing to practice in designated rural areas or to teach at least 12 credit hours, or 720 hours per year in the nursing field in a postsecondary program at the undergraduate level or the equivalent at the graduate level;\n(3) for nurses who agree to practice in a Minnesota nursing home; in an intermediate care facility for persons with developmental disability; in a hospital if the hospital owns and operates a Minnesota nursing home and a minimum of 50 percent of the hours worked by the nurse is in the nursing home; in an assisted living facility as defined in section 144G.08, subdivision 7; or for a home care provider as defined in section 144A.43, subdivision 4; or agree to teach at least 12 credit hours, or 720 hours per year in the nursing field in a postsecondary program at the undergraduate level or the equivalent at the graduate level;\n(4) for other health care technicians agreeing to teach at least 12 credit hours, or 720 hours per year in their designated field in a postsecondary program at the undergraduate level or the equivalent at the graduate level. The commissioner, in consultation with the Healthcare Education-Industry Partnership, shall determine the health care fields where the need is the greatest, including, but not limited to, respiratory therapy, clinical laboratory technology, radiologic technology, and surgical technology;\n(5) for pharmacists, advanced dental therapists, dental therapists, and public health nurses who agree to practice in designated rural areas;\n(6) for dentists agreeing to deliver at least 25 percent of the dentist's yearly patient encounters to state public program enrollees or patients receiving sliding fee schedule discounts through a formal sliding fee schedule meeting the standards established by the United States Department of Health and Human Services under Code of Federal Regulations, title 42, section 51c.303; and\n(7) for nurses employed as a hospital nurse by a nonprofit hospital and providing direct care to patients at the nonprofit hospital.\n(b) Appropriations made for health professional education loan forgiveness in this section do not cancel and are available until expended, except that at the end of each biennium, any remaining balance in the account that is not committed by contract and not needed to fulfill existing commitments shall cancel to the fund.\n[See Note.]\n(a) To be eligible to participate in the loan forgiveness program, an individual must:\n(1) be a medical or dental resident; a licensed pharmacist; or be enrolled in a training or education program to become a dentist, dental therapist, advanced dental therapist, mental health professional, alcohol and drug counselor, pharmacist, public health nurse, midlevel practitioner, registered nurse, or a licensed practical nurse. The commissioner may also consider applications submitted by graduates in eligible professions who are licensed and in practice; and\n(2) submit an application to the commissioner of health. A nurse applying under subdivision 2, paragraph (a), clause (7), must also include proof that the applicant is employed as a hospital nurse.\n(b) An applicant selected to participate must sign a contract to agree to serve a minimum three-year full-time service obligation according to subdivision 2, which shall begin no later than March 31 following completion of required training, with the exception of:\n(1) a nurse, who must agree to serve a minimum two-year full-time service obligation according to subdivision 2, which shall begin no later than March 31 following completion of required training;\n(2) a nurse selected under subdivision 2, paragraph (a), clause (7), who must agree to continue as a hospital nurse for a minimum two-year service obligation; and\n(3) a nurse who agrees to teach according to subdivision 2, paragraph (a), clause (3), who must sign a contract to agree to teach for a minimum of two years.\n[See Note.]\n(a) The commissioner of health may select applicants each year for participation in the loan forgiveness program, within the limits of available funding. In considering applications, the commissioner shall give preference to applicants who document diverse cultural competencies. The commissioner shall distribute available funds for loan forgiveness proportionally among the eligible professions according to the vacancy rate for each profession in the required geographic area, facility type, teaching area, patient group, or specialty type specified in subdivision 2, except for hospital nurses. The commissioner shall allocate funds for physician loan forgiveness so that 75 percent of the funds available are used for rural physician loan forgiveness and 25 percent of the funds available are used for underserved urban communities and pediatric psychiatry loan forgiveness. If the commissioner does not receive enough qualified applicants each year to use the entire allocation of funds for any eligible profession, the remaining funds may be allocated proportionally among the other eligible professions according to the vacancy rate for each profession in the required geographic area, patient group, or facility type specified in subdivision 2. Applicants are responsible for securing their own qualified educational loans. The commissioner shall select participants based on their suitability for practice serving the required geographic area or facility type specified in subdivision 2, as indicated by experience or training. The commissioner shall give preference to applicants closest to completing their training. Except as specified in paragraph (c), for each year that a participant meets the service obligation required under subdivision 3, up to a maximum of four years, the commissioner shall make annual disbursements directly to the participant equivalent to 15 percent of the average educational debt for indebted graduates in their profession in the year closest to the applicant's selection for which information is available, not to exceed the balance of the participant's qualifying educational loans. Before receiving loan repayment disbursements and as requested, the participant must complete and return to the commissioner a confirmation of practice form provided by the commissioner verifying that the participant is practicing as required under subdivisions 2 and 3. The participant must provide the commissioner with verification that the full amount of loan repayment disbursement received by the participant has been applied toward the designated loans. After each disbursement, verification must be received by the commissioner and approved before the next loan repayment disbursement is made. Participants who move their practice remain eligible for loan repayment as long as they practice as required under subdivision 2.\n(b) For hospital nurses, the commissioner of health shall select applicants each year for participation in the hospital nursing education loan forgiveness program, within limits of available funding for hospital nurses. Before receiving the annual loan repayment disbursement, the participant must complete and return to the commissioner a confirmation of practice form provided by the commissioner, verifying that the participant continues to meet the eligibility requirements under subdivision 3. The participant must provide the commissioner with verification that the full amount of loan repayment disbursement received by the participant has been applied toward the designated loans.\n(c) For each year that a participant who is a nurse and who has agreed to teach according to subdivision 2 meets the teaching obligation required in subdivision 3, the commissioner shall make annual disbursements directly to the participant equivalent to 15 percent of the average annual educational debt for indebted graduates in the nursing profession in the year closest to the participant's selection for which information is available, not to exceed the balance of the participant's qualifying educational loans.\nIf a participant does not fulfill the required minimum commitment of service according to subdivision 3, the commissioner of health shall collect from the participant the total amount paid to the participant under the loan forgiveness program plus interest at a rate established according to section 270C.40. The commissioner shall deposit the money collected in a dedicated account in the special revenue fund. The balance of the account is appropriated annually to the commissioner for the health professional education loan forgiveness program established in subdivision 2. The commissioner shall allow waivers of all or part of the money owed the commissioner as a result of a nonfulfillment penalty if emergency circumstances prevented fulfillment of the minimum service commitment.\nThe commissioner may adopt rules to implement this section.",
	"repealed": false
}