{
	"id": "154.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/154.11",
	"title": "154.11 EXAMINATION OF NONRESIDENT BARBERS AND INSTRUCTORS OF BARBERING AND TEMPORARY MILITARY PERMITS.",
	"text": "(a) A person who meets all of the requirements for barber registration in sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 and either has a currently active license, certificate of registration, or equivalent as a practicing barber or instructor of barbering as verified from another state or, if presenting foreign country credentials as verified by a board-approved professional credential evaluation provider, which in the discretion of the board has substantially the same requirements for registering barbers and instructors of barbering as required by sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 shall, upon payment of the required fee, be issued a certificate of registration without examination.\n(b) Individuals without a current documented license, certificate of registration, or equivalent, as verified in paragraph (a), must have a minimum of 1,500 hours of barber education as verified by the barber school attended in the other state or if presenting foreign country education as verified by a board-approved professional credential evaluation provider, completed within the previous four years, which, in the discretion of the board, has substantially the same requirements as required in sections 154.001, 154.002, 154.003, 154.01 to 154.162, 154.19 to 154.21, and 154.24 to 154.28 will be eligible for examination.\n(c) Individuals unable to meet the requirements in paragraph (a) or (b) shall be subject to all the requirements of section 154.05.\n[Repealed, 2016 c 189 art 13 s 70]\n(a) In accordance with section 197.4552, the board shall issue a temporary:\n(1) certificate for registered barbers; and\n(2) certificate for registered barber instructors.\n(b) Fees for temporary military permits and certificates of registration under this subdivision are listed under section 154.003.\n(c) Permits or certificates of registration issued under this subdivision are valid for one year from the date of issuance, after which the individual must complete a full application as required by section 197.4552.",
	"repealed": false
}