{
	"id": "589.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/589.04",
	"title": "589.04 STATEMENTS IN PETITION.",
	"text": "A petition for a writ of habeas corpus must contain information set forth in paragraphs (a) to (e):\n(a) It must state that the person on whose behalf the writ is applied for is imprisoned or restrained of liberty, the name of the officer or person by whom the person is imprisoned or restrained, and the place where that person is imprisoned or restrained.\n(b) It must name the restrained and the restraining person if their names are known, or describe them if they are not.\n(c) It must state that the restrained person is not committed or detained under process, judgment, decree, or execution, as specified in section 589.01.\n(d) It must state the basis of the confinement or restraint, according to the knowledge or belief of the party verifying the petition.\n(e) If the confinement or restraint is under warrant, order, or process, the petitioner shall attach a copy of the document authorizing the confinement or restraint to the petition. The petitioner shall also attach copies of all papers which are attached to or accompany the warrant, order, or process to the petition. If the confinement results from conviction of a crime and sentence, the petitioner shall include a transcript of the proceedings taken at the time of arraignment and sentence in the court which imposed the sentence. If the petitioner is unable to attach the documents required by this paragraph, the petitioner shall state the reasons for not doing so. Documentation is not required when:\n(1) the petitioner is removed or concealed before application for a writ was made; or\n(2) a demand for documentation was made but the person to whom the demand was made refused to supply the document requested.\n(f) If the imprisonment is alleged to be illegal, the petition shall state in what the illegality consists.\nIf the imprisonment which is claimed to be illegal is under a district court judgment or sentence, the judge before whom the petition is pending may examine the official files and records of the court issuing the warrant of commitment, including any official transcript of the proceedings taken at the time of the arraignment and sentence. A judge before whom a petition is pending may take judicial notice of official records or transcripts to determine the sufficiency of the petition or the propriety of issuing the writ of habeas corpus.",
	"repealed": false
}