{
	"id": "43A.04",
	"url": "https://www.revisor.mn.gov/statutes/cite/43A.04",
	"title": "43A.04 GENERAL POWERS AND RESPONSIBILITIES OF COMMISSIONER.",
	"text": "(a) The commissioner is the chief personnel and labor relations manager of the civil service in the executive branch.\nWhenever any power or responsibility is given to the commissioner by any provision of this chapter, unless otherwise expressly provided, the power or authority applies to all employees of agencies in the executive branch and to employees in classified positions in the Office of the Legislative Auditor, the Minnesota State Retirement System, the Public Employees Retirement Association, and the Teacher's Retirement Association. Unless otherwise provided by law, the power or authority does not apply to unclassified employees in the legislative and judicial branches.\n(b) The commissioner shall operate an information system from which personnel data, as defined in section 13.43, concerning employees and applicants for positions in the classified service can be retrieved.\nThe commissioner has access to all public and private personnel data kept by appointing authorities that will aid in the discharge of the commissioner's duties.\n(c) The commissioner may consider and investigate any matters concerned with the administration of provisions of this chapter, and may order any remedial actions consistent with law. The commissioner, at the request of an agency, shall provide assistance in employee misconduct investigations. The commissioner shall have the right to assess from the requesting agency, any costs incurred while assisting the agency in the employee misconduct investigation. Money received by the commissioner under this paragraph is appropriated to the commissioner for purposes of this paragraph.\n(d) The commissioner may assess or establish and collect premiums from all state entities to cover the costs of programs under sections 15.46 and 176.603.\nIt is part of the department's mission that within the department's resources the commissioner shall endeavor to:\n(1) prevent the waste or unnecessary spending of public money;\n(2) use innovative fiscal and human resource practices to manage the state's resources and operate the department as efficiently as possible;\n(3) coordinate the department's activities wherever appropriate with the activities of other governmental agencies;\n(4) use technology where appropriate to increase agency productivity, improve customer service, increase public access to information about government, and increase public participation in the business of government;\n(5) ensure that all technology utilized is accessible to employees and provided in a timely manner as described in sections 363A.42 and 363A.43 and the accessibility standards under section 16E.03, subdivisions 2, clause (3), and 9;\n(6) utilize constructive and cooperative labor-management practices to the extent otherwise required by chapters 43A and 179A;\n(7) report to the legislature on the performance of agency operations and the accomplishment of agency goals in the agency's biennial budget according to section 16A.10, subdivision 1;\n(8) recommend to the legislature appropriate changes in law necessary to carry out the mission and improve the performance of the department; and\n(9) endeavor to use equitable and inclusive practices to attract and recruit protected class employees; actively eliminate discrimination against protected group employees; and ensure equitable access to development and training, advancement, and promotional opportunities.\nThe commissioner shall direct all departmental services, appoint employees and may enter into contracts to carry out the provisions of this chapter. The commissioner may appoint one deputy with principal responsibility for employee relations. The deputy shall serve in the unclassified service.\nThe commissioner shall adopt rules under the Administrative Procedure Act to implement the provisions of this chapter that directly affect the rights of or processes available to the general public. The rules have the force and effect of law and may include but are not limited to:\n(1) the processes for determining the extent of competition for filling vacancies, for recruiting applicants, for conducting selection procedures and for making appointments of individuals who are not employees of the civil service;\n(2) the process for effecting noncompetitive and qualifying appointments;\n(3) the process for temporary designation of positions in the unclassified service and for effecting appointments to the unclassified service;\n(4) a statewide affirmative action program to include requirements for agency affirmative action plans, statewide policies and procedures, reporting requirements, accountability and responsibility of employees in the executive branch, and overall objectives of the program;\n(5) conditions under which moving and other expenses may be authorized and paid prior to appointment to persons who have accepted state employment;\n(6) procedures for administration of the code of ethics for employees of the executive branch;\n(7) examination procedures for candidates with disabilities as described in section 43A.15, subdivision 14; and\n(8) procedures or policies that affect the operation of or participation in the public employees insurance program.\nThe commissioner shall develop administrative procedures, which are not subject to the rulemaking provisions of the Administrative Procedure Act, to effect provisions of chapter 43A which do not directly affect the rights of or processes available to the general public. The commissioner may also adopt administrative procedures, not subject to the Administrative Procedure Act, which concern topics affecting the general public if those procedures concern only the internal management of the department or other agencies and if those elements of the topics which affect the general public are the subject of department rules.\nAdministrative procedures shall be reproduced and made available for comment in accessible digital formats under section 16E.03 to agencies, employees, and appropriate exclusive representatives certified pursuant to sections 179A.01 to 179A.25, for at least 15 days prior to implementation and shall include but are not limited to:\n(1) maintenance and administration of a plan of classification for all positions in the classified service and for comparisons of unclassified positions with positions in the classified service;\n(2) procedures for administration of collective bargaining agreements and plans established pursuant to section 43A.18 concerning total compensation and the terms and conditions of employment for employees;\n(3) procedures for effecting all personnel actions internal to the state service such as processes and requirements for agencies to publicize job openings and consider applicants who are referred or nominate themselves, conduct of selection procedures limited to employees, noncompetitive and qualifying appointments of employees and leaves of absence;\n(4) maintenance and administration of employee performance appraisal, training and other programs; and\n(5) procedures for pilots of the reengineered employee selection process. Employment provisions of this chapter, associated personnel rules adopted under subdivision 3, and administrative procedures established under clauses (1) and (3) may be waived for the purposes of these pilots. The pilots may affect the rights of and processes available to members of the general public seeking employment in the classified service. The commissioner will provide public notice of any pilot directly affecting the rights of and processes available to the general public and make the administrative procedures available for comment to the general public, agencies, employees, and appropriate exclusive representatives certified pursuant to sections 179A.01 to 179A.25 for at least 30 days prior to implementation. The commissioner must publish the public notice in an accessible digital format under section 16E.03. The commissioner must provide a comment process that allows the public to submit comments through multiple formats to ensure accessibility. These formats must include telephone, digital content, and email.\nA provision of an agreement entered into by the commissioner pursuant to section 179A.22, subdivision 4, shall supersede the provisions of any rule or administrative procedure or portion thereof which is inconsistent with the agreement unless the provision is found to violate existing law.\nNotwithstanding any other law to the contrary, the commissioner may authorize an appointing authority to pay an employee for hours not worked, pursuant to the resolution of a grievance through a formal grievance procedure established by a collective bargaining agreement or one of the plans established pursuant to section 43A.18.\nThe commissioner shall issue a written report by February 1 and August 1 of each year to the chair of the Legislative Coordinating Commission. The report must list the number of appointments made under each of the categories in section 43A.15, the number made to the classified service other than under section 43A.15, and the number made under section 43A.08, subdivision 2a, during the six-month periods ending June 30 and December 31, respectively. The report must be posted online and must be accessible under section 16E.03. The commissioner shall advertise these reports in multiple formats to ensure broad dissemination.\nNotwithstanding any law to the contrary, the commissioner shall authorize the appointing authority to permit the donation of up to eight hours of accumulated vacation time in each year by each employee who is a member of law enforcement unit number 1 to their union representative for the purpose of carrying out the duties of office.\nThe commissioner may conduct experimental or research projects designed to improve recruitment, selection, referral, or appointment processes for the filling of state classified positions.\nThe commissioner shall meet and confer with the affected exclusive bargaining representative of state employees concerning the design and implementation of experimental and research projects under this subdivision.\nAny provision in section 43A.02, except for subdivisions 33 and 38, sections 43A.07 to 43A.16, associated personnel rules adopted under subdivision 3, or administrative procedures established under subdivision 4, is waived for the purposes of these projects. The commissioner may not use an experimental or research project under this section to transfer positions between the unclassified and the classified service. The number of appointments under this subdivision may not exceed five percent of the total number of appointments in the preceding fiscal year, unless the commissioner authorizes appointments in excess of five percent with the mutual agreement of any affected bargaining unit.\nThe commissioner shall report by September 1 to the joint subcommittee on Employee Relations the results of the experimental research projects conducted in the preceding fiscal year.\nThe commissioner may adopt rules under the Administrative Procedure Act to assure compliance with sections 471.991 to 471.999.\nThe commissioner, in cooperation with the Office of Administrative Hearings, the attorney general, the revisor of statutes, and experienced agency rulemaking staff, shall provide training to agency staff involved in rulemaking, including information about the availability of mediators through the Office of Administrative Hearings.\nThe commissioner may charge agency staff a registration fee for attending this training. The fee must be set at a level that permits the commissioner to recover the costs, excluding costs of staff time for staff positions funded through general fund appropriations, of providing this training.\nThe Office of Administrative Hearings, the attorney general, agencies involved in providing this training, and the revisor of statutes shall not assess the commissioner for the cost of staff time to conduct the training provided under this subdivision.\n(a) The commissioner, in consultation with the commissioner of management and budget, shall report to the governor and the legislature by January 15 each year on executive branch employee salary and benefits. The purpose of the report is to assist in effective long-range planning and to provide data necessary to compute annual and biennial costs related to the state workforce. The report must use data available in the biennial budget system and other necessary sources. The report also must be made available to the public in an electronic format.\n(b) The report must be organized by agency. The report must list the salary or hourly rate of pay for each agency employee. The report may list the employee by name or by an identification number.\n(c) The report must also include an estimate of the average cost to the state of providing insurance and other benefits to a state employee.\n(d) The report must also include the number of employees by agency or department, separated by retirement plan membership, and for each plan, the total compensation, the total employee retirement plan contribution, and the total employer retirement plan contributions.\n(a) The commissioner shall administer the state employee combined charities campaign. This duty includes registration of combined charitable organizations under section 43A.50, and coordination of the process under which state employees contribute to combined charitable organizations.\n(b) The commissioner, in consultation with other commissioners, shall appoint a voluntary board of state employees to oversee the conduct of an annual combined charities campaign. The board must, to the extent possible, represent a cross-section of state employee groups and geographic areas where state employees are located. The board shall provide direction to the commissioner's employee assigned to administer the annual campaign.",
	"repealed": false
}