{
	"id": "260C.607",
	"url": "https://www.revisor.mn.gov/statutes/cite/260C.607",
	"title": "260C.607 REVIEW OF PROGRESS TOWARD ADOPTION.",
	"text": "(a) The court shall conduct a review of the responsible social services agency's reasonable efforts to finalize adoption for any child under the guardianship of the commissioner and of the progress of the case toward adoption at least every 90 days after the court issues an order that the commissioner is the guardian of the child.\n(b) The review of progress toward adoption shall continue notwithstanding that an appeal is made of the order for guardianship or termination of parental rights.\n(c) The agency's reasonable efforts to finalize the adoption must continue during the pendency of the appeal under paragraph (b) or subdivision 6, paragraph (h), and all progress toward adoption shall continue except that the court may not finalize an adoption while the appeal is pending.\nNotice of review hearings shall be given by the court to:\n(1) the responsible social services agency;\n(2) the child, if the child is age ten and older;\n(3) the child's guardian ad litem;\n(4) counsel appointed for the child pursuant to section 260C.163, subdivision 3;\n(5) relatives of the child who have kept the court informed of their whereabouts as required in section 260C.221 and who have responded to the agency's notice under section 260C.221, unless the relative has been previously ruled out by the court as a suitable permanency resource for the child;\n(6) the current foster or adopting parent of the child;\n(7) any foster or adopting parents of siblings of the child; and\n(8) the Indian child's tribe.\nAny individual or entity listed in subdivision 2 may participate in the continuing reviews conducted under this section. No other individual or entity is required to be given notice or to participate in the reviews unless the court specifically orders that notice be given or participation in the reviews be required.\n(a) The court shall review:\n(1) the agency's reasonable efforts under section 260C.605 to finalize an adoption for the child as appropriate to the stage of the case; and\n(2) the child's current out-of-home placement plan required under section 260C.212, subdivision 1, to ensure the child is receiving all services and supports required to meet the child's needs as they relate to the child's:\n(i) placement;\n(ii) visitation and contact with siblings;\n(iii) visitation and contact with relatives;\n(iv) medical, mental, and dental health; and\n(v) education.\n(b) When the child is age 14 and older, and as long as the child continues in foster care, the court shall also review the agency's planning for the child's independent living after leaving foster care including how the agency is meeting the requirements of section 260C.212, subdivision 1, paragraph (c), clause (12). The court shall use the review requirements of section 260C.203 in any review conducted under this paragraph.\n(a) No petition for adoption shall be filed for a child under the guardianship of the commissioner unless the child sought to be adopted has been placed for adoption with the adopting parent by the responsible social services agency as required under section 260C.613, subdivision 1. The court may order the agency to make an adoptive placement using standards and procedures under subdivision 6.\n(b) Any relative or the child's foster parent who believes the responsible agency has not reasonably considered the relative's or foster parent's request to be considered for adoptive placement as required under section 260C.212, subdivision 2, and who wants to be considered for adoptive placement of the child shall bring a request for consideration to the attention of the court during a review required under this section. The child's guardian ad litem and the child may also bring a request for a relative or the child's foster parent to be considered for adoptive placement. After hearing from the agency, the court may order the agency to take appropriate action regarding the relative's or foster parent's request for consideration under section 260C.212, subdivision 2, paragraph (b).\n(a) At any time after the district court orders the child under the guardianship of the commissioner of children, youth, and families, but not later than 30 days after receiving notice required under section 260C.613, subdivision 1, paragraph (c), that the agency has made an adoptive placement, a relative or the child's foster parent may file a motion for an order for adoptive placement of a child who is under the guardianship of the commissioner if the relative or the child's foster parent:\n(1) has an adoption home study under section 259.41 or 260C.611 approving the relative or foster parent for adoption. If the relative or foster parent does not have an adoption home study, an affidavit attesting to efforts to complete an adoption home study may be filed with the motion instead. The affidavit must be signed by the relative or foster parent and the responsible social services agency or licensed child-placing agency completing the adoption home study. The relative or foster parent must also have been a resident of Minnesota for at least six months before filing the motion; the court may waive the residency requirement for the moving party if there is a reasonable basis to do so; or\n(2) is not a resident of Minnesota, but has an approved adoption home study by an agency licensed or approved to complete an adoption home study in the state of the individual's residence and the study is filed with the motion for adoptive placement. If the relative or foster parent does not have an adoption home study in the relative or foster parent's state of residence, an affidavit attesting to efforts to complete an adoption home study may be filed with the motion instead. The affidavit must be signed by the relative or foster parent and the agency completing the adoption home study.\n(b) The motion must be filed with the court conducting reviews of the child's progress toward adoption under this section. The motion and supporting documents must make a prima facie showing that the agency has been unreasonable in failing to make the requested adoptive placement. The motion must be served according to the requirements for motions under the Minnesota Rules of Juvenile Protection Procedure and must be made on all individuals and entities listed in subdivision 2.\n(c) If the motion and supporting documents do not make a prima facie showing for the court to determine whether the agency has been unreasonable in failing to make the requested adoptive placement, the court shall dismiss the motion. If the court determines a prima facie basis is made, the court shall set the matter for evidentiary hearing.\n(d) At the evidentiary hearing, the responsible social services agency shall proceed first with evidence about the reason for not making the adoptive placement proposed by the moving party. When the agency presents evidence regarding the child's current relationship with the identified adoptive placement resource, the court must consider the agency's efforts to support the child's relationship with the moving party consistent with section 260C.221. The moving party then has the burden of proving by a preponderance of the evidence that the agency has been unreasonable in failing to make the adoptive placement.\n(e) The court shall review and enter findings regarding whether the agency, in making an adoptive placement decision for the child:\n(1) considered relatives for adoptive placement in the order specified under section 260C.212, subdivision 2, paragraph (a); and\n(2) assessed how the identified adoptive placement resource and the moving party are each able to meet the child's current and future needs, based on an individualized determination of the child's needs, as required under sections 260C.212, subdivision 2, and 260C.613, subdivision 1, paragraph (b).\n(f) At the conclusion of the evidentiary hearing, if the court finds that the agency has been unreasonable in failing to make the adoptive placement and that the moving party is the most suitable adoptive home to meet the child's needs using the factors in section 260C.212, subdivision 2, paragraph (b), the court may:\n(1) order the responsible social services agency to make an adoptive placement in the home of the moving party if the moving party has an approved adoption home study; or\n(2) order the responsible social services agency to place the child in the home of the moving party upon approval of an adoption home study. The agency must promote and support the child's ongoing visitation and contact with the moving party until the child is placed in the moving party's home. The agency must provide an update to the court after 90 days, including progress and any barriers encountered. If the moving party does not have an approved adoption home study within 180 days, the moving party and the agency must inform the court of any barriers to obtaining the approved adoption home study during a review hearing under this section. If the court finds that the moving party is unable to obtain an approved adoption home study, the court must dismiss the order for adoptive placement under this subdivision and order the agency to continue making reasonable efforts to finalize the adoption of the child as required under section 260C.605.\n(g) If, in order to ensure that a timely adoption may occur, the court orders the responsible social services agency to make an adoptive placement under this subdivision, the agency shall:\n(1) make reasonable efforts to obtain a fully executed adoption placement agreement, including assisting the moving party with the adoption home study process;\n(2) work with the moving party regarding eligibility for adoption assistance as required under sections 142A.60 to 142A.612; and\n(3) if the moving party is not a resident of Minnesota, timely refer the matter for approval of the adoptive placement through the Interstate Compact on the Placement of Children.\n(h) Denial or granting of a motion for an order for adoptive placement after an evidentiary hearing is an order that may be appealed by the responsible social services agency, the moving party, the child, when age ten or over, the child's guardian ad litem, and any individual who had a fully executed adoption placement agreement regarding the child at the time the motion was filed if the court's order has the effect of terminating the adoption placement agreement. An appeal must be conducted according to the requirements of the Rules of Juvenile Protection Procedure. Pursuant to subdivision 1, paragraph (c), the court shall not finalize an adoption while an appeal is pending.\nWhen the child's parent has consented to adoption under section 260C.515, subdivision 3, only the person identified by the parent and agreed to by the agency as the prospective adoptive parent qualifies for adoptive placement of the child until the responsible social services agency has reported to the court and the court has found in a hearing under this section that it is not possible to finalize an adoption by the identified prospective adoptive parent within 12 months of the execution of the consent to adopt under section 260C.515, subdivision 3, unless the responsible social services agency certifies that the failure to finalize is not due to either an action or a failure to act by the prospective adoptive parent.\n(a) The court may review the responsible social services agency's reasonable efforts to finalize an adoption more frequently than every 90 days whenever a more frequent review would assist in finalizing the adoption.\n(b) In appropriate cases, the court may review the responsible social services agency's reasonable efforts to finalize an adoption less frequently than every 90 days. The court shall not find it appropriate to review progress toward adoption less frequently than every 90 days except when:\n(1) the court has approved the agency's reasonable efforts to recruit, identify, and place the child in an adoptive home on a continuing basis for at least 24 months after the court has issued the order for guardianship;\n(2) the child is at least 16 years old; and\n(3) the child's guardian ad litem agrees that review less frequently than every 90 days is in the child's best interests.\n(c) In no event shall the court's review be less frequent than every six months.",
	"repealed": false
}