{
	"id": "297H.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/297H.115",
	"title": "297H.115 USE TAX.",
	"text": "(a) A use tax is imposed on the sales price of mixed municipal solid waste management services received by a residential generator at the rate imposed under section 297H.02, unless the tax imposed under section 297H.02 was paid. The residential generator is liable.\n(b) A use tax is imposed on the sales price of mixed municipal solid waste management services received by a commercial generator at the rate imposed under section 297H.03, unless the tax imposed under section 297H.03 was paid. The commercial generator is liable.\n(c) A use tax is imposed on the volume of nonmixed municipal solid waste that is managed at the rate imposed under section 297H.04, unless the tax imposed under section 297H.04 was paid. The generator is liable.\n(d) A use tax is imposed on the sales price of mixed municipal solid waste management services received by a self-hauler at the rate imposed under section 297H.05, paragraph (a), unless the tax imposed under section 297H.05, paragraph (a), was paid. The self-hauler is liable.\n(e) A use tax is imposed on the volume of nonmixed municipal solid waste managed at the rate imposed under section 297H.05, paragraph (b), unless the tax imposed under section 297H.05, paragraph (b), was paid. The self-hauler is liable.\nA generator or self-hauler that is liable under subdivision 1 shall report the use tax on a return prescribed by the commissioner of revenue, and shall remit the tax with the return. The return and the tax must be filed using the filing cycle and due dates provided for taxes imposed under chapter 297A.\n(a) The commissioner of revenue may not assess the generator or self-hauler a use tax on a transaction for which the waste management service provider has paid the solid waste management tax, except as provided in paragraph (b).\n(b) If the waste management service provider who is an accrual basis taxpayer remits a payment and thereafter offsets the amount as a bad debt under section 297H.09, the commissioner of revenue may assess the generator or self-hauler a use tax for the offset amount.",
	"repealed": false
}