{
	"id": "60E.02",
	"url": "https://www.revisor.mn.gov/statutes/cite/60E.02",
	"title": "60E.02 DEFINITIONS.",
	"text": "For the purposes of sections 60E.01 to 60E.14, the terms defined in this section have the meanings given them.\n\"Commissioner\" means the commissioner of commerce in Minnesota or the commissioner, director, or superintendent of insurance in any other state.\n\"Completed operations liability\" means liability arising out of the installation, maintenance, or repair of a product at a site which is not owned or controlled by a person who performs that work; or a person who hires an independent contractor to perform that work; but includes liability for activities which are completed or abandoned before the date of the occurrence giving rise to the liability.\n\"Domicile,\" for purposes of determining the state in which a purchasing group is domiciled, means for a corporation, the state in which the purchasing group is incorporated; and for an unincorporated entity, the state of its principal place of business.\n\"Hazardous financial condition\" means that, based on its present or reasonably anticipated financial condition, a risk retention group, although not yet financially impaired or insolvent, is unlikely to be able to meet obligations to policyholders with respect to known claims and reasonably anticipated claims; or to pay other obligations in the normal course of business.\n\"Insurance\" means primary insurance, excess insurance, reinsurance, surplus lines insurance, and any other arrangement for shifting and distributing risk which is determined to be insurance under the laws of this state.\n\"Liability\": (1) means legal liability for damages, including costs of defense, legal costs and fees, and other claims expenses, because of injuries to other persons, damage to their property, or other damage or loss to other persons resulting from or arising out of:\n(a) a business (whether profit or nonprofit), trade, product, services (including professional services), premises, or operations; or\n(b) an activity of a state or local government, or an agency or political subdivision of a state or local government; and\n(2) does not include personal risk liability and an employer's liability with respect to its employees other than legal liability under the Federal Employers' Liability Act, United States Code, title 45, section 51, et seq.\n\"Personal risk liability\" means liability for damages because of injury to a person, damage to property, or other loss or damage resulting from personal, familial, or household responsibilities or activities, rather than from responsibilities or activities referred to in subdivision 7.\n\"Plan of operation\" or \"feasibility study\" means an analysis that presents the expected activities and results of a risk retention group including, at a minimum:\n(1) information sufficient to verify that its members are engaged in business or activities similar or related with respect to the liability to which the members are exposed by virtue of any related, similar or common business, trade, product, services, premises, or operations;\n(2) for each state in which it intends to operate, the coverages, deductibles, coverage limits, rates, and rating classification systems for each line of insurance the group intends to offer;\n(3) historical and expected loss experience of the proposed members and national experience of similar exposures to the extent that this experience is reasonably available;\n(4) pro forma financial statements and projections;\n(5) appropriate opinions by a qualified, independent casualty actuary, including a determination of minimum premium or participation levels required to commence operations and to prevent a hazardous financial condition;\n(6) identification of management, underwriting and claims procedures, marketing methods, managerial oversight methods, investment policies, and reinsurance agreements;\n(7) identification of each state in which the risk retention group has obtained, or sought to obtain, a charter and license, and a description of its status in each state; and\n(8) other matters prescribed by the commissioner for liability insurance companies authorized by the insurance laws of the state.\n\"Product liability\" means liability for damages because of personal injury, death, emotional harm, consequential economic damage, or property damage, including damages resulting from the loss of use of property, arising out of the manufacture, design, importation, distribution, packaging, labeling, lease, or sale of a product, but does not include the liability of a person for those damages if the product involved was in the possession of the person when the incident giving rise to the claim occurred.\n\"Purchasing group\" means a group that:\n(1) has as one of its purposes the purchase of liability insurance on a group basis;\n(2) purchases the insurance only for its group members and only to cover their similar or related liability exposure, as described in clause (3);\n(3) is composed of members whose businesses or activities are similar or related with respect to the liability to which members are exposed by virtue of a related, similar, or common business, trade, product, services, premises, or operations; and\n(4) is domiciled in a state.\n\"Risk retention group\" means a corporation or other limited liability association:\n(1) whose primary activity consists of assuming and spreading all, or a portion, of the liability exposure of its group members;\n(2) which is organized for the primary purpose of conducting the activity described under clause (1);\n(3) which:\n(a) is chartered and licensed as a liability insurance company and authorized to engage in the business of insurance under the laws of a state; or\n(b) before January 1, 1985, was chartered or licensed and authorized to engage in the business of insurance under the laws of Bermuda or the Cayman Islands and, before that date, had certified to the insurance commissioner of at least one state that it satisfied the capitalization requirements of the state, except that the group shall be considered to be a risk retention group only if it has been engaged in business continuously since that date and only for the purpose of continuing to provide insurance to cover product liability or completed operations liability, as such terms were defined in the Product Liability Risk Retention Act of 1981 before the date of the enactment of the Risk Retention Act of 1986;\n(4) which does not exclude a person from membership in the group solely to provide for members of the group a competitive advantage over that person;\n(5) which:\n(a) has as its members only persons who have an ownership interest in the group and which has as its owners only persons who are members who are provided insurance by the risk retention group; or\n(b) has as its sole owner an organization which has as its members only persons who comprise the membership of the risk retention group and which has as its owners only persons who comprise the membership of the risk retention group and who are provided insurance by that group;\n(6) whose members are engaged in businesses or activities similar or related with respect to the liability of which the members are exposed by virtue of any related, similar, or common business trade, product, services, premises, or operations;\n(7) whose activities do not include the provision of insurance other than:\n(a) liability insurance for assuming and spreading all or a portion of the liability of its group members; and\n(b) reinsurance with respect to the liability of any other risk retention group, or any members of the other group, which is engaged in businesses or activities so that the group or member meets the requirement described in clause (6) from membership in the risk retention group which provides the reinsurance; and\n(8) the name of which includes the phrase \"risk retention group.\"\n\"State\" means a state of the United States or the District of Columbia.",
	"repealed": false
}