{
	"id": "136A.1465",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.1465",
	"title": "136A.1465 NORTH STAR PROMISE.",
	"text": "The following terms have the meanings given:\n(1) \"eligible student\" means a resident student under section 136A.101, subdivision 8, who is enrolled in any public postsecondary educational institution or Tribal college and who meets the eligibility requirements in subdivision 2;\n(2) \"gift aid\" includes:\n(i) all federal financial aid that is not a loan or pursuant to a work-study program;\n(ii) state financial aid, unless designated for other expenses, that is not a loan or pursuant to a work-study program;\n(iii) institutional financial aid, including a grant, scholarship, tuition waiver, fellowship stipend, or other payment, unless designated for other expenses, that is not a loan or pursuant to a work-study program; and\n(iv) all private financial aid that is not a loan or pursuant to a work-study program.\nFinancial aid from the state, public postsecondary educational institutions, and Tribal colleges that is specifically designated for other expenses is not gift aid for purposes of the North Star Promise scholarship.\n(3) \"other expenses\" includes books, required supplies, child care, emergency assistance, food, and housing;\n(4) \"public postsecondary educational institution\" means an institution operated by this state, or the Board of Regents of the University of Minnesota;\n(5) \"recognized cost of attendance\" has the meaning given in United States Code, title 20, chapter 28, subchapter IV, part F, section 1087ll;\n(6) \"Tribal college\" means a college defined in section 136A.1796, subdivision 1, paragraph (c); and\n(7) \"tuition and fees\" means the actual tuition and mandatory fees charged by an institution.\nA scholarship may be awarded to an eligible student who:\n(1) has completed the Free Application for Federal Student Aid (FAFSA) or the state aid application;\n(2) has a family adjusted gross income below $80,000;\n(3) is a graduate of a secondary school or its equivalent, or is 17 years of age or over and has met all requirements for admission as a student to an eligible college or university;\n(4) has not earned a baccalaureate degree at the time the scholarship is awarded;\n(5) is enrolled in at least one credit per fall, spring, or summer semester;\n(6) is enrolled in a program or course of study that applies to a degree, diploma, or certificate;\n(7) is not in default, as defined by the office, of any federal or state student educational loan;\n(8) is not more than 30 days in arrears in court-ordered child support that is collected or enforced by the public authority responsible for child support enforcement or, if the applicant is more than 30 days in arrears in court-ordered child support that is collected or enforced by the public authority responsible for child support enforcement, but is complying with a written payment agreement under section 518A.69 or order for arrearages;\n(9) has not been convicted of or pled nolo contendere or guilty to a crime involving fraud in obtaining federal Title IV funds within the meaning of Code of Federal Regulations, subtitle B, chapter VI, part 668, subpart C; and\n(10) is meeting satisfactory academic progress as defined in section 136A.101, subdivision 10.\n(a) Beginning in the fall term of the 2024-2025 academic year, scholarships shall be awarded to eligible students in an amount not to exceed 100 percent of tuition and fees after gift aid is deducted.\n(b) For the 2024-2025, 2025-2026, and 2026-2027 academic years, if funds remain after scholarships are awarded under paragraph (a), supplemental grants shall be awarded to eligible students in an amount up to 50 percent of the amount of a Pell grant the student would receive based on household size, family adjusted gross income, and results of the federal needs analysis, not to exceed the student's recognized cost of attendance. The commissioner may adjust the supplemental grant amount based on the availability of funds.\n(a) Commencing with the 2024-2025 academic year, a public postsecondary educational institution or Tribal college shall not reduce the institutional gift aid offered or awarded to a student who is eligible to receive funds under this program unless the student's gift aid exceeds the student's annual recognized cost of attendance.\n(b) The public postsecondary educational institution or Tribal college may reduce the institutional gift aid offer of a student who is eligible to receive funds under this program by no more than the amount of the student's gift aid that is in excess of the student's annual recognized cost of attendance.\n(c) The public postsecondary educational institution or Tribal college shall not consider receipt or anticipated receipt of funds under this program when considering a student for qualification for institutional gift aid.\n(d) To ensure financial aid is maximized, a public postsecondary educational institution or Tribal college is encouraged to implement efforts to avoid scholarship displacement through consultation with the Office of Higher Education.\n(a) Each scholarship is for a period of one semester. A scholarship may be renewed provided that the eligible student continues to meet the conditions of eligibility.\n(b) Scholarships may be provided to an eligible student pursuing the completion of a certificate or an associate degree who has not previously received the scholarship for four full-time semesters or the equivalent. Scholarships may be provided to an eligible student pursuing the completion of a bachelor's degree who has not previously received the scholarship for eight full-time semesters or the equivalent. The maximum for which a student is eligible is a total of eight full-time semesters or the equivalent. Courses taken that qualify as developmental education or below college-level shall be excluded from the limit.\n(c) A student is entitled to an additional semester or the equivalent of grant eligibility if the student withdraws from enrollment:\n(1) for active military service because the student was ordered to active military service as defined in section 190.05, subdivision 5b or 5c;\n(2) for a serious health condition, while under the care of a medical professional, that substantially limits the student's ability to complete the term; or\n(3) while providing care that substantially limits the student's ability to complete the term to the student's spouse, child, or parent who has a serious health condition.\n(d) The scholarship must be paid directly to the eligible institution where the student is enrolled.\nA scholarship is terminated upon occurrence of:\n(1) failure to meet satisfactory academic progress as defined in section 136A.101, subdivision 10; or\n(2) substantial noncompliance by the eligible student with the requirements of the program.\nPublic postsecondary institutions and Tribal colleges administering institutional financial aid programs for students with a family adjusted gross income below $80,000 that provide student awards for up to or more than 100 percent of tuition, 100 percent of tuition and fees, or 100 percent of the cost of attendance, shall provide the Office of Higher Education with student level data on the recipients of those awards and the program funds awarded per term. The information under this subdivision is necessary for the office to accurately complete reporting requirements under section 136A.121, subdivision 19.\nAn account is created in the special revenue fund for receiving money to provide scholarship awards. Money deposited in the account is appropriated to the commissioner of the Office of Higher Education for scholarship awards.\nThe office is authorized to administer the program. If funds are insufficient, the office shall determine the scholarship amount or number of scholarships awarded. If a student withdraws or is no longer enrolled during a semester in which a scholarship was awarded, the office may determine how this will affect the scholarship.\nThe commissioner of higher education shall submit a preliminary report by September 1, 2025, and an annual report beginning February 15, 2026, to the chairs and ranking minority members of the legislative committees with jurisdiction over higher education, on the details of the program, including the:\n(1) status of the scholarship fund; and\n(2) North Star Promise participation data aggregated for each eligible institution to show the:\n(i) number of eligible students who received scholarships in the prior academic year;\n(ii) average and total award amounts;\n(iii) summary demographic data on award recipients;\n(iv) total number of students enrolled in eligible institutions in the prior academic year;\n(v) retention rates of participating students; and\n(vi) number of eligible students who graduated with a degree and, for each eligible student, the number of consecutive semesters and nonconsecutive semesters attended prior to graduation.",
	"repealed": false
}