{
	"id": "6.756",
	"url": "https://www.revisor.mn.gov/statutes/cite/6.756",
	"title": "6.756 SPECIAL DISTRICTS; INFORMATION REQUIRED TO BE FILED WITH STATE AUDITOR; AUDITS.",
	"text": "Each special district must file with the state auditor, within 60 days of adoption, any document relating to the governance of the district, including articles of incorporation, bylaws, or agreements, and any amendment to these documents.\n(a) A special district with total annual revenue greater than the threshold amount for cities under section 412.591, subdivision 3, paragraph (b), must provide for an annual audit of the district's financial affairs by the state auditor or a public accountant in accordance with minimum auditing procedures prescribed by the state auditor.\n(b) A special district with total annual revenue that is equal to or less than the threshold amount for cities under section 412.591, subdivision 3, paragraph (b), must provide for an audit of the district's financial affairs by the state auditor or a public accountant in accordance with minimum audit procedures prescribed by the state auditor at least once every five years. The audit must be for a one-year period to be determined at random by the person conducting the audit. The audited financial statement must be prepared in a form prescribed by the state auditor similar to the reporting requirements for cities under 2,500 in population. For any year in which a special district is not audited, the district must prepare a financial statement in a form prescribed by the state auditor similar to the reporting requirements for cities reporting on a cash basis and file that statement with the state auditor.\n(c) This subdivision does not apply to a special district subject to financial auditing and reporting requirements under other law.\nExcept as provided by other law, financial statements and audits must be completed, presented to the district's governing board, and filed with the state auditor within 180 days after the end of the district's fiscal year.",
	"repealed": false
}