{
	"id": "514.973",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.973",
	"title": "514.973 ENFORCEMENT OF LIEN.",
	"text": "An owner's lien established under sections 514.970 to 514.979 for a claim that has become due must be enforced as provided in this section.\n(a) The owner must notify the occupant and any person who has delivered to the owner a written notice of a claim of an interest in the contents in the storage space when rent and other charges are in default. The notice to the owner of a claim of an interest must comply with any requirements included in the rental agreement. If the property is a registered motor vehicle or watercraft, the notice also must be given to any lienholder or secured party appearing on the document of title or to any lienholder or secured party known to claim an interest in the motor vehicle or watercraft.\n(b) Except as provided in paragraph (c), the notice must be delivered in person or sent by verified mail as provided under section 514.974. Notice sent by verified mail is presumed delivered when it is deposited with the United States Postal Service or private delivery service and properly addressed with postage prepaid.\n(c) The owner may send notices exclusively via electronic mail with the informed, written consent of the occupant. An occupant may withdraw consent at any time. The owner may not notify the occupant of the default by electronic mail unless the rental agreement, or a written change to the rental agreement, contains a written notice in at least 12-point bold type, if printed, which states: \"By choosing the option to receive email communication in this agreement, the owner will provide you notices and other information regarding your account through the email reflected in our records, or in a subsequent written change of email address that has been given according to the facility's procedures. To indicate that you understand and accept the contents of this notice and agree to the option to receive electronic communication, you must check the box that appears next to this paragraph.\"\n(d) The owner must verify that a notice sent by electronic mail has been delivered by obtaining an electronic receipt that establishes delivery of the notice to the occupant's email address. If delivery of the electronic mail notice cannot be verified, the storage facility must deliver the notice in person or send the notice by verified mail. If the notice must be delivered in person or sent by verified mail after delivery by electronic mail has failed, the period specified in subdivision 3 does not begin until the date the notice is delivered in person or by verified mail.\nThe notice must include:\n(1) a statement of the amount owed for rent and other charges and demand for payment within a specified time not less than 14 days after delivery of the notice;\n(2) pursuant to section 514.972, subdivision 4, a notice of denial of access to the storage space, if this denial is permitted under the terms of the rental agreement;\n(3) the date that the occupant will be denied access to the occupant's personal property in the self-service storage facility;\n(4) a statement that access will be denied until the owner's claim has been satisfied;\n(5) a statement that any dispute regarding denial of access can be raised by an occupant beginning legal action in court;\n(6) the name, street address, and telephone number of the owner, or of the owner's designated agent, whom the occupant may contact to respond to the notice;\n(7) a conspicuous statement that unless the claim is paid within the time stated in the notice, the personal property will be advertised for sale. The notice must specify the time and place of the sale; and\n(8) a conspicuous statement of the items that the occupant may remove without charge pursuant to section 514.972, subdivision 5, if the occupant is denied general access to the storage space.\n(a) A sale of personal property may take place no sooner than 45 days after default or, if the personal property is a motor vehicle or watercraft, no sooner than 60 days after default.\n(b) After the expiration of the time given in the notice, the sale must be published once a week for two weeks consecutively in a newspaper of general circulation where the sale is to be held. The sale may take place no sooner than 15 days after the first publication. If the lien is satisfied before the second publication occurs, the second publication is waived. If there is no qualified newspaper under chapter 331A where the sale is to be held, the advertisement may be posted on an independent, publicly accessible website that advertises self-storage lien sales or public notices. The advertisement must include a general description of the goods, the name of the person on whose account the goods are being held, and the time and place of the sale.\n(c) A sale of the personal property must conform to the terms of the notification.\n(d) A sale of the personal property must be public and must be either:\n(1) held via an online auction; or\n(2) held at the storage facility, or at the nearest suitable place at which the personal property is held or stored.\nOwners shall require all bidders, including online bidders, to register and agree to the rules of the sale.\n(e) The sale must be conducted in a commercially reasonable manner. A sale is commercially reasonable if the property is sold in conformity with the practices among dealers in the property sold or sellers of similar distressed property sales.\nBefore any sale pursuant to this section is conducted, the occupant or any other person entitled to notice under subdivision 2, paragraph (a), may redeem the property by paying the amount sufficient to satisfy the lien and the reasonable expenses incurred complying with this section. If sufficient payment is made, the personal property may not be sold.\nA storage facility may satisfy its lien from the proceeds of any sale pursuant to this section, provided that the storage facility must hold any sum obtained from the sale that exceeds the amount sufficient to satisfy the lien and the reasonable expenses incurred complying with this section for delivery on demand to the occupant and give notice to the occupant of the occupant's right to the funds as provided in section 514.974. Any balance remaining unclaimed by the occupant for more than one year after the sale of the goods must be deposited into the state unclaimed property funds account under sections 345.31 to 345.60.\n(a) If the personal property upon which the lien is claimed is a motor vehicle or watercraft, the owner may sell the motor vehicle or watercraft as provided in this section or have the motor vehicle or watercraft towed by a towing company.\n(b) The owner's lien is terminated upon the towing company taking possession of the property.\n(c) If a motor vehicle or watercraft is towed as authorized in this subdivision, the owner:\n(1) shall send, by the method provided under subdivision 2, the name, address, and telephone number of the towing company that will perform the towing and the street address of the storage facility where the towed property may be redeemed; and\n(2) is not liable for the motor vehicle or watercraft or any damages to the motor vehicle or watercraft once the towing company takes possession of the property. Nothing in this section relieves the towing company from liability for damage for which the company would otherwise be liable.\nAn occupant or other person entitled to notice under subdivision 2, paragraph (a), who is injured by a violation of this section may bring a civil action to recover damages.\nThe rights provided under this section are in addition to all other rights allowed by law to a creditor and a debtor.",
	"repealed": false
}