{
	"id": "148E.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/148E.42",
	"title": "148E.42 STATE PARTICIPATION IN THE COMPACT.",
	"text": "(a) To be eligible to participate in the compact, a potential member state must currently meet all of the following criteria:\n(1) license and regulate the practice of social work at either the clinical, master's, or bachelor's category;\n(2) require applicants for licensure to graduate from a program that:\n(i) is operated by a college or university recognized by the licensing authority;\n(ii) is accredited, or in candidacy by an institution that subsequently becomes accredited, by an accrediting agency recognized by either:\n(A) the Council for Higher Education Accreditation, or its successor; or\n(B) the United States Department of Education; and\n(iii) corresponds to the licensure sought as outlined in section 148E.43;\n(3) require applicants for clinical licensure to complete a period of supervised practice; and\n(4) have a mechanism in place for receiving, investigating, and adjudicating complaints about licensees.\n(b) To maintain membership in the Compact, a member state shall:\n(1) require that applicants for a multistate license pass a qualifying national exam for the corresponding category of multistate license sought as outlined in section 148E.43;\n(2) participate fully in the Commission's data system, including using the Commission's unique identifier as defined in rules;\n(3) notify the Commission, in compliance with the terms of the Compact and rules, of any adverse action or the availability of current significant investigative information regarding a licensee;\n(4) implement procedures for considering the criminal history records of applicants for a multistate license. Such procedures shall include the submission of fingerprints or other biometric-based information by applicants for the purpose of obtaining an applicant's criminal history record information from the Federal Bureau of Investigation and the agency responsible for retaining that state's criminal records;\n(5) comply with the rules of the Commission;\n(6) require an applicant to obtain or retain a license in the home state and meet the home state's qualifications for licensure or renewal of licensure, as well as all other applicable home state laws;\n(7) authorize a licensee holding a multistate license in any member state to practice in accordance with the terms of the Compact and rules of the Commission; and\n(8) designate a delegate to participate in the Commission meetings.\n(c) A member state meeting the requirements of paragraphs (a) and (b) shall designate the categories of social work licensure that are eligible for issuance of a multistate license for applicants in such member state. To the extent that any member state does not meet the requirements for participation in the Compact at any particular category of social work licensure, such member state may choose but is not obligated to issue a multistate license to applicants that otherwise meet the requirements of section 148E.43 for issuance of a multistate license in such category or categories of licensure.\n(d) The home state may charge a fee for granting the multistate license.",
	"repealed": false
}