{
	"id": "390.32",
	"url": "https://www.revisor.mn.gov/statutes/cite/390.32",
	"title": "390.32 AUTHORITY TO CONDUCT PROCEEDINGS.",
	"text": "The sheriff shall investigate and may recommend to the medical examiner and the county attorney the conduct of inquests and autopsies in all human deaths of the following types:\n(1) violent deaths, whether apparently homicidal, suicidal, or accidental, including but not limited to deaths due to thermal, chemical, electrical, or radiational injury, and deaths due to criminal abortion, whether apparently self induced or not;\n(2) deaths under unusual or mysterious circumstances;\n(3) deaths of persons whose bodies are to be cremated, dissected, buried at sea, or otherwise disposed of so that the bodies will later be unavailable for examination; and\n(4) deaths of inmates of public institutions who are not hospitalized for organic disease and whose deaths are not of any type referred to in clause (1) or (2).\nThe sheriff shall report all such deaths to the medical examiner and the county attorney.\nSubject to section 390.11, subdivision 2b, the medical examiner may conduct an autopsy in the case of any human death of any type referred to in subdivision 1, clause (1) or (2), or in section 390.11, subdivision 1.\nThe medical examiner shall conduct an autopsy in the case of any human death reported to the medical examiner by the state fire marshal or a chief officer under section 299F.04, subdivision 5, and apparently caused by fire.\nSubject to section 390.11, subdivision 2b, the medical examiner may conduct an autopsy in the case of any human death of any type referred to in subdivision 1, clause (3) or (4), or may exhume any human body and perform an autopsy in the case of any human death of any type referred to in subdivision 1 when in the judgment of the medical examiner the public interest requires an autopsy. No such autopsy on an exhumed body shall be conducted unless the surviving spouse, or next of kin if there is no surviving spouse, consents, or unless the district court of the county where the body is located or buried, upon notice as the court directs, enters its order authorizing an autopsy or an exhumation and autopsy. Application for an order may be made by the medical examiner or the county attorney of the county where the body is located or buried, upon a showing that the court deems appropriate.\nIf the medical examiner finds it advisable to engage the services of medical specialists, including pathologists and toxicologists, the medical examiner shall apply to the judge exercising probate jurisdiction for authorization. If the medical examiner shows reasonable cause, the judge shall authorize the medical examiner to engage medical specialists and provide for payment of their fees and expenses. The costs of the services shall be paid by the county treasurer upon receipt of a certificate from the judge exercising probate jurisdiction.\nThe sheriff shall keep properly indexed records giving the name, if known, of every person whose death is investigated, the place where the body was found, the date, cause, and manner of death, and all other relevant information concerning the death.\n(a) Deaths of the types described in this section must be promptly reported for investigation to the sheriff by the attending physician, mortician, person in charge of the public institutions referred to in subdivision 1, or other person having knowledge of the death.\n(b) For the purposes of this section, health-related records or data on a decedent, except health data as defined in section 13.3805, subdivision 1, whose death is being investigated under this section, whether the records or data are recorded or unrecorded, including but not limited to those concerning medical, surgical, psychiatric, psychological, or any other consultation, diagnosis, or treatment, including medical imaging, shall be made promptly available to the medical examiner, upon the medical examiner's written request, by a person having custody of, possession of, access to, or knowledge of the records or data. The medical examiner shall pay the reasonable costs of copies of records or data provided to the medical examiner under this section. Data collected or created pursuant to this subdivision relating to any psychiatric, psychological, or mental health consultation with, diagnosis of, or treatment of the decedent whose death is being investigated shall remain confidential or protected nonpublic data, except that the medical examiner's report may contain a summary of such data.\nUpon notification of a death subject to this section, the sheriff or deputy shall proceed to the body, take charge of it, and, when necessary, order that there be no interference with the body or the scene of death.\nThe sheriff shall deliver a signed copy of the report of investigation to the county attorney and the medical examiner.\nIf the county attorney elects to conduct an inquest, the county attorney shall promptly notify the judge of the need for an inquest and make all arrangements for it. At the inquest, the judge shall preside and the county attorney shall conduct the inquest on behalf of the state. Upon conclusion of the inquest, the judge shall find the cause of death and sign and file a death record. The judge, upon application of the county attorney, may issue subpoenas for witnesses in the manner provided by section 390.11, subdivision 5, and the judge shall administer the oath to them in the manner provided by section 390.33, subdivision 3.\nIf the county attorney elects not to conduct an inquest, the county attorney shall inform the medical examiner who shall find the cause of death and sign and file a death record.\nThe commissioner of corrections may require that all department-of-corrections-incarcerated deaths be reviewed by an independent, contracted, board-certified forensic pathologist.",
	"repealed": false
}