{
	"id": "142B.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/142B.18",
	"title": "142B.18 SANCTIONS.",
	"text": "(a) In addition to making a license conditional under section 142B.16, the commissioner may suspend or revoke the license, impose a fine, or secure an injunction against the continuing operation of the program of a license holder who:\n(1) does not comply with applicable law or rule;\n(2) has nondisqualifying background study information, as described in section 245C.05, subdivision 4, that reflects on the license holder's ability to safely provide care to foster children; or\n(3) has an individual living in the household where the licensed services are provided or is otherwise subject to a background study, and the individual has nondisqualifying background study information, as described in section 245C.05, subdivision 4, that reflects on the license holder's ability to safely provide care to foster children.\nWhen applying sanctions authorized under this section, the commissioner shall consider the nature, chronicity, or severity of the violation of law or rule and the effect of the violation on the health, safety, or rights of persons served by the program.\n(b) If a license holder appeals the suspension or revocation of a license and the license holder continues to operate the program pending a final order on the appeal, the commissioner shall issue the license holder a temporary provisional license. Unless otherwise specified by the commissioner, variances in effect on the date of the license sanction under appeal continue under the temporary provisional license. The commissioner may include terms the license holder must follow pending a final order on the appeal. If a license holder fails to comply with applicable law or rule while operating under a temporary provisional license, the commissioner may impose additional sanctions under this section and section 142B.16 and may terminate any prior variance. If a temporary provisional license is set to expire, a new temporary provisional license shall be issued to the license holder upon payment of any fee required under section 142B.12. The temporary provisional license shall expire on the date the final order is issued. If the license holder prevails on the appeal, a new nonprovisional license shall be issued for the remainder of the current license period.\n(c) If a license holder is under investigation and the license issued under this chapter is due to expire before completion of the investigation, the program shall be issued a new license upon completion of the reapplication requirements and payment of any applicable license fee. Upon completion of the investigation, a licensing sanction may be imposed against the new license under this section or section 142B.16 or 142B.20.\n(d) Failure to reapply or closure of a license issued under this chapter by the license holder prior to the completion of any investigation shall not preclude the commissioner from issuing a licensing sanction under this section or section 142B.16 at the conclusion of the investigation.\n(a) The commissioner shall act immediately to temporarily suspend a license issued under this chapter if:\n(1) the license holder's actions or failure to comply with applicable law or rule, or the actions of other individuals or conditions in the program, pose an imminent risk of harm to the health, safety, or rights of persons served by the program;\n(2) while the program continues to operate pending an appeal of an order of revocation, the commissioner identifies one or more subsequent violations of law or rule that may adversely affect the health or safety of persons served by the program; or\n(3) the license holder is criminally charged in state or federal court with an offense that involves fraud or theft against a program administered by the commissioner.\n(b) No state funds shall be made available or be expended by any agency or department of state, county, or municipal government for use by a license holder regulated under this chapter while a license issued under this chapter is under immediate suspension. A notice stating the reasons for the immediate suspension and informing the license holder of the right to an expedited hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612, must be delivered by personal service to the address shown on the application or the last known address of the license holder. The license holder may appeal an order immediately suspending a license. The appeal of an order immediately suspending a license must be made in writing by certified mail, personal service, or other means expressly set forth in the commissioner's order. If mailed, the appeal must be postmarked and sent to the commissioner within five calendar days after the license holder receives notice that the license has been immediately suspended. If a request is made by personal service, it must be received by the commissioner within five calendar days after the license holder received the order. A license holder and any controlling individual shall discontinue operation of the program upon receipt of the commissioner's order to immediately suspend the license.\n(a) Within five working days of receipt of the license holder's timely appeal, the commissioner shall request assignment of an administrative law judge. The request must include a proposed date, time, and place of a hearing. A hearing must be conducted by an administrative law judge within 30 calendar days of the request for assignment, unless an extension is requested by either party and granted by the administrative law judge for good cause. The commissioner shall issue a notice of hearing by certified mail or personal service at least ten working days before the hearing. The scope of the hearing shall be limited solely to the issue of whether the temporary immediate suspension should remain in effect pending the commissioner's final order under section 142B.20, regarding a licensing sanction issued under subdivision 4 following the immediate suspension. For suspensions under subdivision 2, paragraph (a), clause (1), the burden of proof in expedited hearings under this subdivision shall be limited to the commissioner's demonstration that reasonable cause exists to believe that the license holder's actions or failure to comply with applicable law or rule poses, or the actions of other individuals or conditions in the program poses an imminent risk of harm to the health, safety, or rights of persons served by the program. \"Reasonable cause\" means there exist specific articulable facts or circumstances that provide the commissioner with a reasonable suspicion that there is an imminent risk of harm to the health, safety, or rights of persons served by the program. When the commissioner has determined there is reasonable cause to order the temporary immediate suspension of a license based on a violation of safe sleep requirements, as defined in section 142B.46, the commissioner is not required to demonstrate that an infant died or was injured as a result of the safe sleep violations. For suspensions under subdivision 2, paragraph (a), clause (2), the burden of proof in expedited hearings under this subdivision shall be limited to the commissioner's demonstration by a preponderance of the evidence that, since the license was revoked, the license holder committed additional violations of law or rule that may adversely affect the health or safety of persons served by the program.\n(b) The administrative law judge shall issue findings of fact, conclusions, and a recommendation within ten working days from the date of hearing. The parties shall have ten calendar days to submit exceptions to the administrative law judge's report. The record shall close at the end of the ten-day period for submission of exceptions. The commissioner's final order shall be issued within ten working days from the close of the record. When an appeal of a temporary immediate suspension is withdrawn or dismissed, the commissioner shall issue a final order affirming the temporary immediate suspension within ten calendar days of the commissioner's receipt of the withdrawal or dismissal. Within 90 calendar days after an immediate suspension has been issued and the license holder has not submitted a timely appeal under subdivision 2, paragraph (b), or within 90 calendar days after a final order affirming an immediate suspension, the commissioner shall determine:\n(1) whether a final licensing sanction shall be issued under subdivision 4, paragraph (a), clauses (1) to (6). The license holder shall continue to be prohibited from operation of the program during this 90-day period; or\n(2) whether the outcome of related, ongoing investigations or judicial proceedings are necessary to determine if a final licensing sanction under subdivision 4, paragraph (a), clauses (1) to (6), will be issued and whether persons served by the program remain at an imminent risk of harm during the investigation period or proceedings. If so, the commissioner shall issue a suspension order under subdivision 4, paragraph (a), clause (7).\n(c) When the final order under paragraph (b) affirms an immediate suspension, or the license holder does not submit a timely appeal of the immediate suspension, and a final licensing sanction is issued under subdivision 4 and the license holder appeals that sanction, the license holder continues to be prohibited from operation of the program pending a final commissioner's order under section 142B.20, subdivision 6, regarding the final licensing sanction.\n(d) The license holder shall continue to be prohibited from operation of the program while a suspension order issued under paragraph (b), clause (2), remains in effect.\n(e) For suspensions under subdivision 2, paragraph (a), clause (3), the burden of proof in expedited hearings under this subdivision shall be limited to the commissioner's demonstration by a preponderance of the evidence that a criminal complaint and warrant or summons was issued for the license holder that was not dismissed, and that the criminal charge is an offense that involves fraud or theft against a program administered by the commissioner.\n(a) The commissioner may suspend or revoke a license, or impose a fine if:\n(1) a license holder fails to comply fully with applicable laws or rules including but not limited to the requirements of this chapter and chapter 245C;\n(2) a license holder, a controlling individual, or an individual living in the household where the licensed services are provided or is otherwise subject to a background study has been disqualified and the disqualification was not set aside and no variance has been granted;\n(3) a license holder knowingly withholds relevant information from or gives false or misleading information to the commissioner in connection with an application for a license, in connection with the background study status of an individual, during an investigation, or regarding compliance with applicable laws or rules;\n(4) a license holder is excluded from any program administered by the commissioner under section 142A.12;\n(5) revocation is required under section 142B.10, subdivision 14, paragraph (d);\n(6) for a family foster setting, a license holder, or an individual living in the household where the licensed services are provided or who is otherwise subject to a background study, has nondisqualifying background study information, as described in section 245C.05, subdivision 4, that reflects on the license holder's ability to safely provide care to foster children; or\n(7) suspension is necessary under subdivision 3, paragraph (b), clause (2).\nA license holder who has had a license issued under this chapter suspended, revoked, or has been ordered to pay a fine must be given notice of the action by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the notice must be mailed to the address shown on the application or the last known address of the license holder. The notice must state in plain language the reasons the license was suspended or revoked, or a fine was ordered.\n(b) If the license was suspended or revoked, the notice must inform the license holder of the right to a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The license holder may appeal an order suspending or revoking a license. The appeal of an order suspending or revoking a license must be made in writing by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the appeal must be postmarked and sent to the commissioner within ten calendar days after the license holder receives notice that the license has been suspended or revoked. If a request is made by personal service, it must be received by the commissioner within ten calendar days after the license holder received the order. If the order is issued through the provider hub, the appeal must be received by the commissioner within ten calendar days from the date the commissioner issued the order through the hub. Except as provided in subdivision 3, paragraph (c), if a license holder submits a timely appeal of an order suspending or revoking a license, the license holder may continue to operate the program as provided under section 142B.10, subdivision 14, paragraphs (i) and (j), until the commissioner issues a final order on the suspension or revocation.\n(c)(1) If the license holder was ordered to pay a fine, the notice must inform the license holder of the responsibility for payment of fines and the right to a contested case hearing under chapter 14 and Minnesota Rules, parts 1400.8505 to 1400.8612. The appeal of an order to pay a fine must be made in writing by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the appeal must be postmarked and sent to the commissioner within ten calendar days after the license holder receives notice that the fine has been ordered. If a request is made by personal service, it must be received by the commissioner within ten calendar days after the license holder received the order. If the order is issued through the provider hub, the appeal must be received by the commissioner within ten calendar days from the date the commissioner issued the order through the hub.\n(2) The license holder shall pay the fines assessed on or before the payment date specified. If the license holder fails to fully comply with the order, the commissioner may issue a second fine or suspend the license until the license holder complies. If the license holder receives state funds, the state, county, or municipal agencies or departments responsible for administering the funds shall withhold payments and recover any payments made while the license is suspended for failure to pay a fine. A timely appeal shall stay payment of the fine until the commissioner issues a final order.\n(3) A license holder shall promptly notify the commissioner of children, youth, and families, in writing, when a violation specified in the order to forfeit a fine is corrected. If upon reinspection the commissioner determines that a violation has not been corrected as indicated by the order to forfeit a fine, the commissioner may issue a second fine. The commissioner shall notify the license holder by certified mail, by personal service, or through the provider licensing and reporting hub that a second fine has been assessed. The license holder may appeal the second fine as provided under this subdivision.\n(4) Fines shall be assessed as follows:\n(i) the license holder shall forfeit $1,000 for each determination of maltreatment of a child under chapter 260E or the maltreatment of a vulnerable adult under section 626.557 for which the license holder is determined responsible for the maltreatment under section 260E.30, subdivision 4, paragraphs (a) and (b), or 626.557, subdivision 9c, paragraph (c);\n(ii) if the commissioner determines that a determination of maltreatment for which the license holder is responsible is the result of maltreatment that meets the definition of serious maltreatment as defined in section 245C.02, subdivision 18, the license holder shall forfeit $5,000;\n(iii) for a program that operates out of the license holder's home and a program licensed under Minnesota Rules, parts 9502.0300 to 9502.0445, the fine assessed against the license holder shall not exceed $1,000 for each determination of maltreatment;\n(iv) the license holder shall forfeit $200 for each occurrence of a violation of law or rule governing matters of health, safety, or supervision, including but not limited to the provision of adequate staff-to-child or adult ratios, and failure to comply with background study requirements under chapter 245C; and\n(v) the license holder shall forfeit $100 for each occurrence of a violation of law or rule other than those subject to a $5,000, $1,000, or $200 fine in items (i) to (iv).\n(5) When a fine has been assessed, the license holder may not avoid payment by closing, selling, or otherwise transferring the licensed program to a third party. In such an event, the license holder will be personally liable for payment. In the case of a corporation, each controlling individual is personally and jointly liable for payment.\n(d) Except for background study violations involving the failure to comply with an order to immediately remove an individual or an order to provide continuous, direct supervision, the commissioner shall not issue a fine under paragraph (c) relating to a background study violation to a license holder who self-corrects a background study violation before the commissioner discovers the violation. A license holder who has previously exercised the provisions of this paragraph to avoid a fine for a background study violation may not avoid a fine for a subsequent background study violation unless at least 365 days have passed since the license holder self-corrected the earlier background study violation.\nIf a license holder licensed to place children for adoption fails to provide services as described in the disclosure form required by section 259.37, subdivision 2, the sanctions under this section may be imposed.\nFor licensed family child care providers and child care centers, upon receipt of any order of license suspension, temporary immediate suspension, fine, or revocation issued by the commissioner under this section, and notwithstanding a pending appeal of the order of license suspension, temporary immediate suspension, fine, or revocation by the license holder, the license holder shall post the order of license suspension, temporary immediate suspension, fine, or revocation in a place that is conspicuous to the people receiving services and all visitors to the facility for two years. When the order of license suspension, temporary immediate suspension, fine, or revocation is accompanied by a maltreatment investigation memorandum prepared under section 626.557 or chapter 260E, the investigation memoranda must be posted with the order of license suspension, temporary immediate suspension, fine, or revocation.\n(a) When the license holder appeals more than one licensing action or sanction that were simultaneously issued by the commissioner, the license holder shall specify the actions or sanctions that are being appealed.\n(b) If there are different timelines prescribed in statutes for the licensing actions or sanctions being appealed, the license holder must submit the appeal within the longest of those timelines specified in statutes.\n(c) The appeal must be made in writing by certified mail, by personal service, or through the provider licensing and reporting hub. If mailed, the appeal must be postmarked and sent to the commissioner within the prescribed timeline with the first day beginning the day after the license holder receives the certified letter. If a request is made by personal service, it must be received by the commissioner within the prescribed timeline with the first day beginning the day after the license holder receives the certified letter. If the appeal is made through the provider hub, the appeal must be received by the commissioner within the prescribed timeline with the first day beginning the day after the commissioner issued the order through the hub.\n(d) When there are different timelines prescribed in statutes for the appeal of licensing actions or sanctions simultaneously issued by the commissioner, the commissioner shall specify in the notice to the license holder the timeline for appeal as specified under paragraph (b).\nWithin 15 working days of receipt of the license holder's timely appeal of a sanction under this section other than a temporary immediate suspension, the commissioner shall request assignment of an administrative law judge. The commissioner's request must include a proposed date, time, and place of a hearing. A hearing must be conducted by an administrative law judge within 90 calendar days of the request for assignment, unless an extension is requested by either party and granted by the administrative law judge for good cause or for purposes of discussing settlement. In no case shall one or more extensions be granted for a total of more than 90 calendar days unless there is a criminal or juvenile court action pending against the license holder or another individual subject to a background study.",
	"repealed": false
}