{
	"id": "123B.79",
	"url": "https://www.revisor.mn.gov/statutes/cite/123B.79",
	"title": "123B.79 PERMANENT FUND TRANSFERS.",
	"text": "Except as provided in this subdivision, sections 123B.51, 123B.80, 475.61, and 475.65, a district may not permanently transfer money from (1) an operating fund to a nonoperating fund; (2) a nonoperating fund to another nonoperating fund; or (3) a nonoperating fund to an operating fund. Permanent transfers may be made from any fund to any other fund to correct for prior fiscal years' errors discovered after the books have been closed for that year. Permanent transfers may be made from the general fund to any other operating funds according to section 142D.093 or if the resources of the other fund are not adequate to finance approved expenditures from that other fund. Permanent transfers may also be made from the general fund to eliminate deficits in another fund when that other fund is being discontinued. When a district discontinues operation of a district-owned bus fleet or a substantial portion of a fleet, the balance shall cancel to the district's general fund.\n[Repealed, 2016 c 189 art 30 s 26]\n(a) Notwithstanding subdivision 1, a district may transfer money from the general fund to the community service fund for the employer contributions for teacher retirement and FICA for employees who are members of a teacher retirement association and who are paid from the community service fund.\n(b) A district must not transfer money under paragraph (a) for employees who are paid with money other than normal operating funds, as defined in section 354.05, subdivision 27.\nAs used in this section, \"operating fund\" and \"nonoperating fund\" have the meanings specified in the uniform financial accounting and reporting standards for Minnesota school districts. Any transfer for a period in excess of one year shall be deemed to be a permanent transfer.\nFor the purposes of this section, a permanent transfer includes creating a deficit in a nonoperating fund for a period past the end of the current fiscal year which is covered by moneys in an operating fund. A deficit in the reserve for operating capital account pursuant to section 123B.78, subdivision 5, does not constitute a permanent transfer.\n[Repealed, 2016 c 189 art 30 s 26]\nA district may separately maintain in a designated for separation and retirement benefit account the amount necessary to meet the obligations for separation and retirement benefits, including compensated absences, termination benefits, pension benefits, and other postemployment benefits, not accounted for elsewhere. The amount necessary must be calculated according to standards established by the department.\nA district that has reorganized according to sections 123A.35 to 123A.43, 123A.46, or 123A.48, or has conducted a successful referendum on the question of combination under section 123A.37, subdivision 2, or consolidation under section 123A.48, subdivision 15, or has been assigned an identification number by the commissioner under section 123A.48, subdivision 16, may make permanent transfers between any of the funds or accounts in the newly created or enlarged district with the exception of the debt redemption fund, building construction fund, food service fund, and long-term facilities maintenance account of the general fund. Fund transfers under this section may be made for up to one year prior to the effective date of combination or consolidation by the consolidating boards and during the year following the effective date of reorganization by the consolidated board. The newly formed board of the combined district may adopt a resolution on or before August 30 of the year of the reorganization authorizing a transfer among accounts or funds of the previous independent school districts which transfer or transfers shall be reported in the affected districts' audited financial statements for the year immediately preceding the consolidation.\nAny balance in the district's reserved account for deferred maintenance as of June 30, 2016, shall be transferred to the reserved account for long-term facilities maintenance in the school district's general fund. Any balance in the district's reserved account for health and safety as of June 30, 2019, shall be transferred to the unassigned fund balance account in the district's general fund. Any balance in the district's reserved account for alternative facilities as of June 30, 2016, shall be transferred to the reserved account for long-term facilities maintenance in the district's building construction fund.",
	"repealed": false
}