{
	"id": "18C.411",
	"url": "https://www.revisor.mn.gov/statutes/cite/18C.411",
	"title": "18C.411 REGISTRATION OF SPECIALTY FERTILIZERS, SOIL AMENDMENTS, AND PLANT AMENDMENTS.",
	"text": "(a) A person may not sell brands or grades of specialty fertilizers, soil amendments, or plant amendments in this state unless they are registered with the commissioner.\n(b) Registration of the materials is not a warranty by the commissioner or the state.\n(c) Specialty fertilizers custom applied are exempt from the registration requirements of this section.\n(d) Custom blend specialty fertilizers are exempt from the registration requirements of this section if the distributor is licensed as required by section 18C.415 and the fertilizer is labeled as required by section 18C.215.\nThe application for registration must include:\n(1) for specialty fertilizers:\n(i) the name and address of the guarantor and registrant;\n(ii) the brand and grade;\n(iii) the guaranteed analysis as required by section 18C.211;\n(iv) the sources from which nitrogen, phosphorus, potassium, or other elements or materials are derived; and\n(v) the amount and formulas of inert ingredients; and\n(2) for soil amendments and plant amendments:\n(i) the name and address of the guarantor and registrant;\n(ii) the brand name;\n(iii) the sources from which the ingredients used in the product are derived; and\n(iv) the guaranteed analysis as required by section 18C.211.\nApplication for registration of a specialty fertilizer, a soil amendment, or a plant amendment must include:\n(1) a label or label facsimile of each product for which registration is requested; and\n(2) a copy of all labeling material used in this state for promotion and sale of each product being registered.\nA registration is effective until January 1 following the date of issuance or approval. A product registration is not transferable from one person to another or from the ownership to whom the registration is issued to another ownership.\nTo ensure complete withdrawal from distribution or further use of a specialty fertilizer, soil amendment, or plant amendment, a person who intends to discontinue a specialty fertilizer, soil amendment, and plant amendment registration must:\n(1) terminate any further distribution of the specialty fertilizer, soil amendment, or plant amendment within the state;\n(2) continue to register the specialty fertilizer, soil amendment, or plant amendment annually for two successive years;\n(3) initiate and complete a total recall of the specialty fertilizer, soil amendment, or plant amendment from all distribution in the state within 60 days from the date of notification to the commissioner of intent to discontinue registration; or\n(4) submit to the commissioner evidence adequate to document that no distribution of the registered specialty fertilizer, soil amendment, or plant amendment has occurred in the state.",
	"repealed": false
}