{
	"id": "171.30",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.30",
	"title": "171.30 LIMITED LICENSE.",
	"text": "(a) The commissioner may issue a limited license to the driver under the conditions in paragraph (b) in any case where a person's license has been:\n(1) suspended under section 171.18, 171.173, 171.186, or 171.187;\n(2) revoked, canceled, or denied under section:\n(i) 169.792;\n(ii) 169.797;\n(iii) 169A.52:\n(A) subdivision 3, paragraph (a), clause (1) or (2); or\n(B) subdivision 4, paragraph (a), clause (1) or (2), if the test results indicate an alcohol concentration of less than twice the legal limit;\n(iv) 171.17; or\n(v) 171.172;\n(3) revoked, canceled, or denied under section 169A.54:\n(i) subdivision 1, clause (1), if the test results indicate an alcohol concentration of less than twice the legal limit;\n(ii) subdivision 1, clause (2); or\n(iii) subdivision 2, if the person does not have a qualified prior impaired driving incident as defined in section 169A.03, subdivision 22, on the person's record, and the test results indicate an alcohol concentration of less than twice the legal limit; or\n(4) revoked, canceled, or denied under section 171.177:\n(i) subdivision 4, paragraph (a), clause (1) or (2); or\n(ii) subdivision 5, paragraph (a), clause (1) or (2), if the test results indicate an alcohol concentration of less than twice the legal limit.\n(b) The following conditions for a limited license under paragraph (a) include:\n(1) if the driver's livelihood or attendance at a substance use disorder treatment or counseling program depends upon the use of the driver's license;\n(2) if the use of a driver's license by a homemaker is necessary to prevent the substantial disruption of the education, medical, or nutritional needs of the family of the homemaker; or\n(3) if attendance at a postsecondary institution of education by an enrolled student of that institution depends upon the use of the driver's license.\n(c) The commissioner in issuing a limited license may impose such conditions and limitations as in the commissioner's judgment are necessary to the interests of the public safety and welfare including reexamination as to the driver's qualifications. The license may be limited to the operation of particular vehicles, to particular classes and times of operation, and to particular conditions of traffic. The commissioner may require that an applicant for a limited license affirmatively demonstrate that use of public transportation or carpooling as an alternative to a limited license would be a significant hardship.\n(d) For purposes of this subdivision:\n(1) \"homemaker\" refers to the person primarily performing the domestic tasks in a household of residents consisting of at least the person and the person's dependent child or other dependents; and\n(2) \"twice the legal limit\" means an alcohol concentration of two times the limit specified in section 169A.20, subdivision 1, clause (5).\n(e) The limited license issued by the commissioner shall clearly indicate the limitations imposed and the driver operating under the limited license shall have the license in possession at all times when operating as a driver.\n(f) In determining whether to issue a limited license, the commissioner shall consider the number and the seriousness of prior convictions and the entire driving record of the driver and shall consider the number of miles driven by the driver annually.\n(g) If the person's driver's license or permit to drive has been revoked under section 169.792 or 169.797, the commissioner may only issue a limited license to the person after the person has presented an insurance identification card, policy, or written statement indicating that the driver or owner has insurance coverage satisfactory to the commissioner of public safety. The commissioner of public safety may require the insurance identification card provided to satisfy this subdivision be certified by the insurance company to be noncancelable for a period not to exceed 12 months.\n(h) The limited license issued by the commissioner to a person under section 171.186, subdivision 4, must expire 90 days after the date it is issued. The commissioner must not issue a limited license to a person who previously has been issued a limited license under section 171.186, subdivision 4.\n(i) The commissioner shall not issue a limited driver's license to any person described in section 171.04, subdivision 1, clause (6), (7), (8), (11), or (14).\n(j) The commissioner shall not issue a class A, class B, or class C limited license.\nA limited license shall not be issued for a period of 60 days to an individual whose license or privilege has been revoked or suspended for commission of the following offenses:\n(1) any felony in the commission of which a motor vehicle was used; or\n(2) failure to stop and disclose identity as required under section 169.09, in the event of a motor vehicle accident resulting in the death or personal injury of another.\nNotwithstanding subdivision 2, a limited license must not be issued for a period of:\n(1) 15 days, to a person whose license or privilege has been revoked or suspended for a first violation of section 169A.20, sections 169A.50 to 169A.53, section 171.177, or a statute or ordinance from another state in conformity with either of those sections; or\n(2) one year, to a person whose license or privilege has been revoked or suspended for:\n(i) committing manslaughter resulting from the operation of a motor vehicle; or\n(ii) committing criminal vehicular operation under section:\n(A) 609.2113, subdivision 1, 2, or 3; or\n(B) 609.2114, subdivision 2.\nIf a person whose driver's license was suspended or revoked for a violation listed under subdivision 2 or 2a is under the age of 18 years at the time of that violation, the commissioner shall not issue a limited license to the person for a period of time that is the longest of: (1) 90 days; or (2) twice the length of the period specified for that violation in subdivision 2 or 2a.\nMS 2010 [Repealed, 2010 c 366 s 17]\n[Repealed, 2002 c 371 art 1 s 64]\nA person who violates a condition or limitation of a limited license issued under subdivision 1 or fails to have the license in immediate possession at all times when operating a motor vehicle is guilty of a misdemeanor. In addition, except as otherwise provided in the ignition interlock program under section 171.306, a person who violates a condition or limitation of a limited license may not operate a motor vehicle for the remainder of the period of suspension or revocation, or 30 days, whichever is longer.\nNotwithstanding subdivision 1, the commissioner may not issue a limited license to a person whose driver's license has been suspended or revoked due to:\n(1) a violation under section:\n(i) 609.2112, subdivision 1, paragraph (a);\n(ii) 609.2114, subdivision 1, paragraph (a); or\n(iii) 169.13, subdivision 1, that contributed to causing death to another; or\n(2) a statute or ordinance from another state in conformity with the offenses under clause (1).",
	"repealed": false
}