{
	"id": "115E.08",
	"url": "https://www.revisor.mn.gov/statutes/cite/115E.08",
	"title": "115E.08 COORDINATION.",
	"text": "The commissioner of public safety shall coordinate state agency preparedness for response to discharges of oil or hazardous substances.\nThe commissioner of public safety shall at least annually assess the preparedness of each state agency for carrying out its responsibilities under sections 115E.01 to 115E.09 and shall chair regular meetings of representatives of each agency to prepare for coordinated response. The commissioner shall develop an incident command system for use by state agency responders in consultation with the affected state agencies. Following each major incident, the commissioner shall review the performance of each responding agency and the adequacy of the overall response and shall report to the agencies involved and the governor. The commissioner shall also identify opportunities for state agencies to coordinate with federal departments and agencies and political subdivisions of the state for preparedness and response actions.\nExcept as otherwise provided, the following agencies have primary responsibility for the specified areas in carrying out the duties and authorities of this chapter:\n(1) the Department of Agriculture, for agricultural chemicals;\n(2) the Department of Public Safety, for public safety and protection of property;\n(3) the Department of Natural Resources, for assessment and rehabilitation of water resources;\n(4) the Pollution Control Agency, for all other matters subject to this chapter; and\n(5) the Department of Transportation, with respect to requirements related to the packaging, labeling, placarding, routing, and written reporting on releases of hazardous materials that are being transported.\nThe Pollution Control Agency shall carry out environmental protection activities related to railroad discharge preparedness. Duties under this subdivision include, but are not limited to:\n(1) assisting local emergency managers and fire officials in understanding the hazards of oil and hazardous substances, as well as general strategies for containment and environmental protection;\n(2) assisting railroads to identify natural resources and sensitive areas, and to devise strategies to contain and recover oil and hazardous substances from land and waters along routes;\n(3) facilitating cooperation between railroads for mutual aid arrangements that provide training, staff, and equipment as required by this chapter;\n(4) participating in drills and training sessions;\n(5) reviewing each railroad's prevention and response plan for compliance with the requirements of this chapter, and assessing each railroad's readiness to protect the environment;\n(6) conducting inspections and drills as necessary to determine the railroad's compliance with the requirements of this chapter and ability to protect the environment;\n(7) conducting follow-up corrective action directives, orders, and enforcement as necessary based on a finding of inadequate environmental protection preparedness; and\n(8) soliciting involvement and advice concerning preparedness activities and requirements from safety representatives of railroad employees governed by the Railway Labor Act.\nThe commissioner of public safety shall carry out public safety protection activities related to railroad and pipeline spill and discharge preparedness. Duties under this subdivision include, but are not limited to:\n(1) assisting local emergency managers and fire officials to understand the hazards of oil and hazardous substances, as well as general strategies for hazard identification, initial isolation, and other actions necessary to ensure public safety;\n(2) assisting railroads and pipeline companies to develop suggested protocols and practices for local first responder use in protecting the public's safety;\n(3) facilitating cooperation between railroads, pipeline companies, county and city emergency managers, and other public safety organizations;\n(4) participating in major exercises and training sessions;\n(5) assisting local units of government to incorporate railroad and pipeline hazard and response information into local emergency operations plans;\n(6) monitoring the public safety-related training and planning requirements of section 115E.03; and\n(7) referring noncompliance with section 115E.03 to the Pollution Control Agency.\nThe commissioner shall annually report to the appropriate committees of the legislature on the readiness of state government to respond appropriately to discharges of oil or hazardous substances.",
	"repealed": false
}