{
	"id": "168.327",
	"url": "https://www.revisor.mn.gov/statutes/cite/168.327",
	"title": "168.327 DRIVER AND VEHICLE RECORD FEES.",
	"text": "(a) Upon request by any person authorized in this section, the commissioner or full-service provider must furnish a certified copy of any driver's license record, instruction permit record, Minnesota identification card record, vehicle registration record, vehicle title record, or accident record.\n(b) Except as provided in subdivisions 4, 5a, and 5b, and other than accident records governed under section 169.09, subdivision 13, the requester must pay a fee of $10 for each certified record specified in paragraph (a) or a fee of $9 for each record that is not certified.\n(c) Except as provided in subdivisions 4, 5a, and 5b, in addition to the record fee in paragraph (b), the fee for a copy of the history of any vehicle title not in electronic format is $1 for each page of the historical record.\n(d) Of the fee collected by the commissioner under paragraphs (b) and (c), 50 cents must be deposited in the general fund, and the remainder must be deposited in the driver and vehicle services operating account under section 299A.705.\n(e) Of the fee collected by a full-service provider under paragraphs (b) and (c), the provider must transmit 50 cents of each fee to the commissioner for deposit in the general fund, and the provider must retain the remainder.\n(f) Except as provided in subdivisions 4, 5a, and 5b, the commissioner must permit a person to inquire into a record by the person's own electronic means for a fee of $4.50 for each inquiry, except that no fee may be charged when the requester is the subject of the data. Of the fee:\n(1) $2.70 must be deposited in the general fund; and\n(2) the remainder must be deposited in the driver and vehicle services operating account under section 299A.705.\n(g) Fees and the deposit of the fees for accident records and reports are governed by section 169.09, subdivision 13.\n(a) Except as otherwise provided in subdivision 3, the commissioner or full-service provider must impose a surcharge of 50 cents on each fee charged under section 13.03, subdivision 3, for copies or electronic transmittals of public information about the registration of a vehicle or an applicant, or holder of a driver's license, instruction permit, or Minnesota identification card.\n(b) The surcharge only applies to a fee imposed in response to a request made in person, by mail, or online. The surcharge does not apply to the request of an individual for information about that individual's driver's license, instruction permit, or Minnesota identification card or about vehicles registered or titled in the individual's name.\n(c) The surcharges collected by the commissioner under this subdivision must be credited to the general fund. The surcharges collected by a full-service provider must be transmitted to the commissioner for deposit in the general fund.\n(a) Notwithstanding subdivision 2 or section 13.03, a fee or surcharge may not be imposed in response to a request for public information about the registration of a vehicle if the commissioner or full-service provider is satisfied that:\n(1) the requester seeks the information on behalf of a community-based, nonprofit organization designated by a local law enforcement agency to be a requester; and\n(2) the information is needed to identify suspected prostitution law violators, controlled substance law violators, or health code violators.\n(b) The commissioner or full-service provider must not require a requester under paragraph (a) to make a minimum number of data requests or limit the requester to a maximum number of data requests.\n(a) The commissioner may implement a driver records subscription service to provide information concerning access to driver license, instruction permit, and identification card records, including regular notice of records that have changed, to subscribers who:\n(1) pay applicable fees; and\n(2) are approved by the commissioner in accordance with sections 168.346 and 171.12, and United States Code, title 18, section 2721.\n(b) If a driver records subscription service is implemented, the commissioner shall establish a fee that does not exceed $3,680 per month for a subscription to the service. Fees collected under this paragraph must be credited to the driver and vehicle services operating account under section 299A.705, and are appropriated to the commissioner for the purposes in paragraph (a) and this paragraph.\n(c) If a driver records subscription service is implemented, the commissioner shall charge a fee of $0.02 per driver record requested. Of the fees collected under this paragraph, 20 percent must be credited to the driver and vehicle services operating account under section 299A.705 and is appropriated to the commissioner for the purposes in this subdivision; 30 percent must be credited to the data security account in the special revenue fund under section 3.9741, subdivision 5; and 50 percent must be credited to the driver and vehicle services technology account under section 299A.705.\nMS 2020 [Repealed, 1Sp2021 c 5 art 4 s 151]\n(a) The commissioner may implement a vehicle records subscription service to provide information concerning access to motor vehicle records, including regular notice of records that have changed, to subscribers who:\n(1) pay applicable fees; and\n(2) are approved by the commissioner in accordance with section 168.346 and United States Code, title 18, section 2721.\n(b) If a vehicle records subscription service is implemented, the commissioner must establish a fee that does not exceed $3,680 per month for a subscription to the service. Fees collected under this paragraph must be credited to the driver and vehicle services operating account under section 299A.705, subdivision 1, and are appropriated to the commissioner for the purposes in this paragraph and paragraph (a).\n(c) If a motor vehicle records subscription service is implemented, the commissioner must charge a fee of $0.02 per motor vehicle record requested. Of the fees collected, 20 percent must be credited to the driver and vehicle services operating account under section 299A.705, subdivision 1, and is appropriated to the commissioner for the purposes of this subdivision; 30 percent must be credited to the data security account in the special revenue fund under section 3.9741, subdivision 5; and 50 percent must be credited to the driver and vehicle services technology account under section 299A.705, subdivision 3.\n(a) For purposes of this subdivision, \"custom data request records\" means a total of 1,000 or more (1) vehicle title records, (2) vehicle registration records, or (3) driver's license records.\n(b) The commissioner must charge a fee of $0.02 per record for custom data request records.\n(c) Of the fees collected for custom data request records:\n(1) 20 percent must be credited to the driver and vehicle services operating account under section 299A.705, subdivision 1, and is appropriated to the commissioner for the purposes of this subdivision;\n(2) 30 percent must be credited to the data security account in the special revenue fund under section 3.9741, subdivision 5; and\n(3) 50 percent must be credited to the driver and vehicle services technology account under section 299A.705, subdivision 3.\n(d) The commissioner may impose an additional fee for technical staff to create a custom set of data under this subdivision.\nEach subscriber under subdivision 4 or 5a must annually engage an independent professional organization to audit its uses of data and its information technology security procedures, including: (1) the methods and practices employed in the processing and use of driver and vehicle services data; and (2) compliance with the certification required under section 171.12, subdivision 7b, paragraph (d). Within 30 days of the date of the audit report, each subscriber must submit each report to the legislative auditor and the commissioner.\nThe commissioner must monitor and audit the furnishing of records by full-service providers under this section to ensure full-service providers are complying with this section, chapter 13, and United States Code, title 18, section 2721, et seq.",
	"repealed": false
}