{
	"id": "142G.42",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.42",
	"title": "142G.42 60-MONTH TIME LIMIT; HARDSHIP EXTENSIONS.",
	"text": "(a) To be eligible for a hardship extension, a participant in an assistance unit subject to the time limit under section 142G.40, subdivision 1, must develop and comply with either an employment plan or a family stabilization services plan, whichever is appropriate.\n(b) If one participant in a two-parent assistance unit is determined to be ineligible for a hardship extension, the county shall give the assistance unit the option of disqualifying the ineligible participant from MFIP. In that case, the assistance unit shall be treated as a one-parent assistance unit.\n[See Note.]\nIf a county grants a hardship extension under this section, a county agency shall review the case every six or 12 months, whichever is appropriate based on the participant's circumstances and the extension category. More frequent reviews shall be required if eligibility for an extension is based on a condition that is subject to change in less than six months.\n(a) An assistance unit subject to the time limit in section 142G.40, subdivision 1, is eligible to receive months of assistance under a hardship extension if the participant who reached the time limit belongs to any of the following groups:\n(1) participants who are suffering from an illness, injury, or incapacity which has been certified by a qualified professional when the illness, injury, or incapacity is expected to continue for more than 30 days and severely limits the person's ability to obtain or maintain suitable employment. These participants must follow the treatment recommendations of the qualified professional certifying the illness, injury, or incapacity;\n(2) participants whose presence in the home is required as a caregiver because of the illness, injury, or incapacity of another member in the assistance unit, a relative in the household, or a foster child in the household when the illness or incapacity and the need for a person to provide assistance in the home has been certified by a qualified professional and is expected to continue for more than 30 days; or\n(3) caregivers with a child or an adult in the household who meets the disability or medical criteria for home care services under section 256B.0651, subdivision 1, paragraph (c), or a home and community-based waiver services program under chapter 256B, or meets the criteria for severe emotional disturbance under section 245.4871, subdivision 6, or for serious and persistent mental illness under section 245.462, subdivision 20, paragraph (c). Caregivers in this category are presumed to be prevented from obtaining or maintaining suitable employment.\n(b) An assistance unit receiving assistance under a hardship extension under this subdivision may continue to receive assistance as long as the participant meets the criteria in paragraph (a), clause (1), (2), or (3).\n(a) An assistance unit subject to the time limit in section 142G.40, subdivision 1, is eligible to receive months of assistance under a hardship extension if the participant who reached the time limit belongs to any of the following groups:\n(1) a person who is diagnosed by a licensed physician, psychological practitioner, or other qualified professional, as developmentally disabled or mentally ill, and the condition severely limits the person's ability to obtain or maintain suitable employment;\n(2) a person who:\n(i) has been assessed by a vocational specialist or the county agency to be unemployable for purposes of this subdivision; or\n(ii) has an IQ below 80 who has been assessed by a vocational specialist or a county agency to be employable, but the condition severely limits the person's ability to obtain or maintain suitable employment. The determination of IQ level must be made by a qualified professional. In the case of a non-English-speaking person: (A) the determination must be made by a qualified professional with experience conducting culturally appropriate assessments, whenever possible; (B) the county may accept reports that identify an IQ range as opposed to a specific score; (C) these reports must include a statement of confidence in the results;\n(3) a person who is determined by a qualified professional to be learning disabled, and the condition severely limits the person's ability to obtain or maintain suitable employment. For purposes of the initial approval of a learning disability extension, the determination must have been made or confirmed within the previous 12 months. In the case of a non-English-speaking person: (i) the determination must be made by a qualified professional with experience conducting culturally appropriate assessments, whenever possible; and (ii) these reports must include a statement of confidence in the results. If a rehabilitation plan for a participant extended as learning disabled is developed or approved by the county agency, the plan must be incorporated into the employment plan. However, a rehabilitation plan does not replace the requirement to develop and comply with an employment plan under section 142G.56; or\n(4) a person who has been granted a family violence waiver, and who is complying with an employment plan under section 142G.56, subdivision 3.\n(b) For purposes of this chapter, \"severely limits the person's ability to obtain or maintain suitable employment\" means:\n(1) that a qualified professional has determined that the person's condition prevents the person from working 20 or more hours per week; or\n(2) for a person who meets the requirements of paragraph (a), clause (2), item (ii), or clause (3), a qualified professional has determined the person's condition:\n(i) significantly restricts the range of employment that the person is able to perform; or\n(ii) significantly interferes with the person's ability to obtain or maintain suitable employment for 20 or more hours per week.\n(a) An assistance unit subject to the time limit under section 142G.40, subdivision 1, is eligible to receive assistance under a hardship extension if the participant who reached the time limit belongs to:\n(1) a one-parent assistance unit in which the participant is participating in work activities for at least 30 hours per week, of which an average of at least 25 hours per week every month are spent participating in employment;\n(2) a two-parent assistance unit in which the participants are participating in work activities for at least 55 hours per week, of which an average of at least 45 hours per week every month are spent participating in employment; or\n(3) an assistance unit in which a participant is participating in employment for fewer hours than those specified in clause (1), and the participant submits verification from a qualified professional, in a form acceptable to the commissioner, stating that the number of hours the participant may work is limited due to illness or disability, as long as the participant is participating in employment for at least the number of hours specified by the qualified professional. The participant must be following the treatment recommendations of the qualified professional providing the verification. The commissioner shall develop a form to be completed and signed by the qualified professional, documenting the diagnosis and any additional information necessary to document the functional limitations of the participant that limit work hours. If the participant is part of a two-parent assistance unit, the other parent must be treated as a one-parent assistance unit for purposes of meeting the work requirements under this subdivision.\n(b) For purposes of this section, employment means:\n(1) unsubsidized employment under section 142G.50, subdivision 11, paragraph (a), clause (1);\n(2) subsidized employment under section 142G.50, subdivision 11, paragraph (a), clause (2);\n(3) on-the-job training under section 142G.50, subdivision 11, paragraph (a), clause (2);\n(4) an apprenticeship under section 142G.50, subdivision 11, paragraph (a), clause (1);\n(5) supported work under section 142G.50, subdivision 11, paragraph (a), clause (2);\n(6) a combination of clauses (1) to (5); or\n(7) child care under section 142G.50, subdivision 11, paragraph (a), clause (7), if it is in combination with paid employment.\n(c) If a participant is complying with a child protection plan under chapter 260C, the number of hours required under the child protection plan count toward the number of hours required under this subdivision.\n(d) The county shall provide the opportunity for subsidized employment to participants needing that type of employment within available appropriations.\n(e) The employment plan developed under section 142G.56, subdivision 2, for participants under this subdivision must contain at least the minimum number of hours specified in paragraph (a) for the purpose of meeting the requirements for an extension under this subdivision. The job counselor and the participant must sign the employment plan to indicate agreement between the job counselor and the participant on the contents of the plan.\n(f) Participants who fail to meet the requirements in paragraph (a), without eligibility for another hardship extension or good cause under section 142G.71, shall be subject to sanction or case closure. Participants must meet all remaining requirements in the approved employment plan or be subject to sanction or case closure.\n(g) If the noncompliance with an employment plan is due to the involuntary loss of employment, the participant is exempt from the hourly employment requirement under this subdivision for one month. Participants must meet all remaining requirements in the approved employment plan or be subject to sanction or case closure if ineligible for another hardship extension.\n[See Note.]\nIf the documentation needed to determine if a participant is eligible for a hardship extension under subdivision 3 or 4 is not available by the 60th month, the county agency may extend the participant pending receipt of the documentation if the county believes the participant is likely to qualify for a hardship extension and the participant is cooperating with efforts to obtain the documentation. If the participant is found to be not eligible for an extension, the participant may be responsible for an overpayment.\n(a) Participants who are not eligible for assistance under a hardship extension under this section shall be eligible for a hardship extension for a period of time equal to the number of months that were counted toward the 60-month time limit while the participant was a caregiver with a child or an adult in the household who meets the disability or medical criteria for home care services under section 256B.0651, subdivision 1, paragraph (c), or a home and community-based waiver services program under chapter 256B, or meets the criteria for severe emotional disturbance under section 245.4871, subdivision 6, or for serious and persistent mental illness under section 245.462, subdivision 20, paragraph (c), and who was subject to the requirements in section 142G.52, subdivision 1.\n(b) A participant who received MFIP assistance that counted toward the 60-month time limit while the participant met the state time limit exemption criteria under section 142G.40, subdivision 3 or 4, is eligible for assistance under a hardship extension for a period of time equal to the number of months that were counted toward the 60-month time limit while the participant met the state time limit exemption criteria under section 142G.40, subdivision 3 or 4.\n(c) After the accrued months have been exhausted, the county agency must determine if the assistance unit is eligible for an extension under another extension category in subdivision 3, 4, or 5.\n(d) At the time of the case review, a county agency must explain to the participant the basis for receiving a hardship extension based on the accrual of exempt months. The participant must provide documentation necessary to enable the county agency to determine whether the participant is eligible to receive a hardship extension based on the accrual of exempt months or authorize a county agency to verify the information.\n[See Note.]\n(a) If one or both participants in an assistance unit receiving assistance under subdivision 4 or 5 are not in compliance with the employment and training service requirements in sections 142G.51 to 142G.53, 142G.56 to 142G.59, and 142G.71, the sanctions under this subdivision apply. For a first occurrence of noncompliance, an assistance unit must be sanctioned under section 142G.70, subdivision 1, paragraph (c), clause (1). For a second or third occurrence of noncompliance, the assistance unit must be sanctioned under section 142G.70, subdivision 1, paragraph (c), clause (2). For a fourth occurrence of noncompliance, the assistance unit is disqualified from MFIP. If a participant is determined to be out of compliance, the participant may claim a good cause exception under section 142G.71.\n(b) If both participants in a two-parent assistance unit are out of compliance at the same time, it is considered one occurrence of noncompliance.\n(c) When a parent in an extended two-parent assistance unit who has not used 60 months of assistance is out of compliance with the employment and training service requirements in sections 142G.51 to 142G.53, 142G.56 to 142G.59, and 142G.71, sanctions must be applied as specified in clauses (1) and (2).\n(1) If the assistance unit is receiving assistance under subdivision 4 or 5, the assistance unit is subject to the sanction policy in this subdivision.\n(2) If the assistance unit is receiving assistance under subdivision 3, the assistance unit is subject to the sanction policy in section 142G.70.\n(d) If a two-parent assistance unit is extended under subdivision 3 or 4, and a parent who has not reached the 60-month time limit is out of compliance with the employment and training services requirements in sections 142G.51 to 142G.53, 142G.56 to 142G.59, and 142G.71, when the case is extended, the sanction in the 61st month is considered the first sanction for the purposes of applying the sanctions in this subdivision, except that the sanction amount shall be 30 percent.\n[See Note.]\n(a) An assistance unit that has its case closed under section 142G.70 may be approved for MFIP if the participant complies with MFIP program requirements and demonstrates compliance for up to one month. No assistance shall be paid during this period.\n(b) An assistance unit that has its case closed under section 142G.70 and that reapplies under paragraph (a) is subject to sanction under section 142G.70, subdivision 1, paragraph (c).\n(c) Prior to a case closure under this subdivision, a county agency must review the participant's case to determine if the employment plan is still appropriate and attempt to meet with the participant face-to-face. If a face-to-face meeting is not conducted, the county agency must send the participant a notice of adverse action as provided in section 142G.21. During the face-to-face meeting, the county agency must:\n(1) determine whether the continued noncompliance can be explained and mitigated by providing a needed preemployment activity, as defined in section 142G.50, subdivision 11, paragraph (a), clause (9);\n(2) determine whether the participant qualifies for a good cause exception under section 142G.71;\n(3) inform the participant of the family violence waiver criteria and make appropriate referrals if the waiver is requested;\n(4) inform the participant of the participant's sanction status and explain the consequences of continuing noncompliance;\n(5) identify other resources that may be available to the participant to meet the needs of the family; and\n(6) inform the participant of the right to appeal under section 142G.45.\n[See Note.]\nA county may make a request to the commissioner, and the commissioner may grant, an extension for a category of participants that are not extended under this section, provided the new category of participants is consistent with the existing extension policy in which an extension is provided to participants whose MFIP requirements conflict with other statutory requirements or obligations. By January 15 of each year, the commissioner must report to the chairs and ranking minority members of the senate and house of representatives committees having jurisdiction over children, youth, and families the extensions that were granted under this section during the previous calendar year. The legislature must act in order for the extensions to continue. If the legislature fails to act by the end of the legislative session in which the extensions were reported, the extensions granted under this section during the previous calendar year expire on June 30 of that year.",
	"repealed": false
}