{
	"id": "253B.23",
	"url": "https://www.revisor.mn.gov/statutes/cite/253B.23",
	"title": "253B.23 GENERAL PROVISIONS.",
	"text": "(a) In each proceeding under this chapter the court shall allow and order paid to each witness subpoenaed the fees and mileage prescribed by law; to each examiner a reasonable sum for services and for travel; to persons conveying the patient to the place of detention, disbursements for the travel, board, and lodging of the patient and of themselves and their authorized assistants; and to the patient's counsel, when appointed by the court, a reasonable sum for travel and for the time spent in court or in preparing for the hearing. Upon the court's order, the county auditor shall issue a warrant on the county treasurer for payment of the amounts allowed, excluding the costs of the court examiner, which must be paid by the state courts.\n(b) Whenever venue of a proceeding has been transferred under this chapter, the costs of the proceedings shall be reimbursed to the county where the proceedings were conducted by the county of financial responsibility.\n[Repealed, 1997 c 217 art 1 s 118]\n(a) The county of financial responsibility is responsible to conduct prepetition screening pursuant to section 253B.07, subdivision 1, and, if statutory conditions for commitment are satisfied, to file a petition pursuant to section 253B.07, subdivision 2, paragraph (a), or 253D.07.\n(b) Except in cases under chapter 253D, if the county of financial responsibility refuses or fails to conduct prepetition screening or file a petition, or if it is unclear which county is the county of financial responsibility, the county where the proposed patient is present is responsible to conduct the prepetition screening and, if statutory conditions for commitment are satisfied, file the petition.\n(c) In cases under chapter 253D, if the county of financial responsibility refuses or fails to file a petition, or if it is unclear which county is the county of financial responsibility, then (1) the county where the conviction for which the person is incarcerated was entered, or (2) the county where the proposed patient is present, if the person is not currently incarcerated based on conviction, is responsible to file the petition if statutory conditions for commitment are satisfied.\n(d) When a proposed patient is an inmate confined to an adult correctional facility under the control of the commissioner of corrections and commitment proceedings are initiated or proposed to be initiated pursuant to section 241.69, the county where the correctional facility is located may agree to perform the responsibilities specified in paragraph (a).\n(e) Any dispute concerning financial responsibility for the costs of the proceedings and treatment will be resolved pursuant to chapter 256G.\n(f) This subdivision and the sections of law cited in this subdivision address venue only. Nothing in this chapter is intended to limit the statewide jurisdiction of district courts over civil commitment matters.\n(a) Except as otherwise provided in this chapter and in sections 246.15 and 246.16, no person by reason of commitment or treatment pursuant to this chapter shall be deprived of any legal right, including but not limited to the right to dispose of property, sue and be sued, execute instruments, make purchases, enter into contractual relationships, vote, and hold a driver's license. Commitment or treatment of any patient pursuant to this chapter is not a judicial determination of legal incompetency except to the extent provided in section 253B.03, subdivision 6.\n(b) Proceedings for determination of legal incompetency and the appointment of a guardian for a person subject to commitment under this chapter may be commenced before, during, or after commitment proceedings have been instituted and may be conducted jointly with the commitment proceedings. The court shall notify the head of the facility or program to which the patient is committed of a finding that the patient is incompetent.\n(c) Where the person to be committed is a minor or owns property of value and it appears to the court that the person is not competent to manage a personal estate, the court shall appoint a general conservator of the person's estate as provided by law.\nAny person who willfully makes, joins in, or advises the making of any false petition or report, or knowingly or willfully makes any false representation for the purpose of causing the petition or report to be made or for the purpose of causing an individual to be improperly committed under this chapter, is guilty of a gross misdemeanor. The attorney general or the attorney general's designee shall prosecute violations of this section.\n(a) Notwithstanding sections 358.07 to 358.09, written statements or documents made within this state in connection with proceedings under this chapter are deemed to be made under oath or affirmation without notarization if the person signing the document attests, at the end of the document, in substantially the following form:\n\"I declare under penalty of perjury under the laws of the state of Minnesota that the foregoing is true and correct.\nExecuted on ............................(date) in the county of ............................(county name) in the state of Minnesota.\n.................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................... (signature)\n.................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................... (signer's address and telephone number).\"\nA document that is sworn to or affirmed under this paragraph without notarization must include a telephone number and address where the signer can be contacted.\n(b) If a document is required to be signed in order to be effective, an electronic document qualifies as a signed document:\n(1) without the person's physical signature, if an entity has an electronic signature system that meets a minimum security standard of two-factor authentication, such as name and password, or biometric identification that is uniquely reconcilable to a single actor and that results in a nonmodifiable document after the electronic signature is affixed, and the document indicates an electronic signature in some manner, such as \"s/........................................(name of signer)\"; or\n(2) with the person's physical signature, if the document is optically scanned into the entity's records.\n(c) Notwithstanding paragraph (b), the committing court may determine that an entity's electronic signature system does not provide sufficient assurance of authenticity of signed documents or that an electronic signature system different from that described in paragraph (b) provides sufficient assurance of authenticity.\n(d) An electronically transmitted facsimile of a document, including a document described in paragraph (a) or (b), may be filed with the committing court and received into evidence in the same manner and with the same effect as the original document.\n(e) Nothing in this subdivision alters any statute, rule, standard, or practice for accepting documents for filing or admitting documents as evidence, except with respect to:\n(1) the manner of making written statements under oath or affirmation;\n(2) the acceptability of electronically transmitted facsimile copies; and\n(3) the acceptability of electronic signatures.\nParagraph (b) addresses only the acceptability of documents obtained from an entity's electronic records system and does not determine whether the committing court is required or permitted to accept electronic filing of documents.\nAll persons acting in good faith, upon either actual knowledge or information thought by them to be reliable, who act pursuant to any provision of this chapter or who procedurally or physically assist in the commitment of any individual, pursuant to this chapter, are not subject to any civil or criminal liability under this chapter. Any privilege otherwise existing between patient and physician, patient and advanced practice registered nurse, patient and registered nurse, patient and physician assistant, patient and psychologist, patient and examiner, or patient and social worker, is waived as to any physician, advanced practice registered nurse, registered nurse, physician assistant, psychologist, examiner, or social worker who provides information with respect to a patient pursuant to any provision of this chapter.\nNothing in this chapter shall be construed to abridge the right of any person to the writ of habeas corpus.\nThe Ramsey County court commissioner may hear and act upon petitions for commitment.\nThe executive board or any other aggrieved party may appeal to the court of appeals from any order entered under this chapter as in other civil cases. Any district court order or judgment under this chapter or related case law may be appealed within 60 days after the date of filing of the order or entry of judgment. A judgment under section 253B.18, subdivision 1, may be appealed within 60 days after the date of the order entered under section 253B.18, subdivision 2.\nUpon perfection of the appeal, the return shall be filed forthwith. The court of appeals shall hear the appeal within 90 days after service of the notice of appeal. This appeal shall not suspend the operation of the order appealed from until the appeal is determined, unless otherwise ordered by the court of appeals.\nFor purposes of taking an appeal or petition for habeas corpus or for a judicial determination of mental competency or need for commitment, transcripts of commitment proceedings, or portions of them, shall be made available to the parties upon written application to the court. Upon a showing by a party that the party is unable to pay the cost of a transcript, it shall be made available at no expense to the party. The state courts shall pay the cost of the transcript.\nUpon a motion by a person who has been the subject of a judicial commitment proceeding, the court may seal all judicial records of the commitment proceedings if it finds that access to the records creates undue hardship for the person. The county attorney shall be notified of the motion and may participate in the hearings. All hearings on the motion shall be in camera. The files and records of the court in proceedings on the motion shall be sealed except to the moving party, the person's attorney, the county attorney, or other persons by court order.",
	"repealed": false
}