{
	"id": "245D.31",
	"url": "https://www.revisor.mn.gov/statutes/cite/245D.31",
	"title": "245D.31 DAY SERVICES FACILITIES; STAFF RATIOS AND FACILITY COVERAGE.",
	"text": "This section applies only to facility-based day services.\n(a) The number of direct support service staff members that a license holder must have on duty at the facility at a given time to meet the minimum staffing requirements established in this section varies according to:\n(1) the number of persons who are enrolled and receiving direct support services at that given time;\n(2) the staff ratio requirement established under subdivision 3 for each person who is present; and\n(3) whether the conditions described in subdivision 9 exist and warrant additional staffing beyond the number determined to be needed under subdivision 7.\n(b) The commissioner must consider the factors in paragraph (a) in determining a license holder's compliance with the staffing requirements and must further consider whether the staff ratio requirement established under subdivision 3 for each person receiving services accurately reflects the person's need for staff time.\nThe case manager, in consultation with the interdisciplinary team, must determine at least once each year which of the ratios in subdivisions 4, 5, and 6 is appropriate for each person receiving services on the basis of the characteristics described in subdivisions 4, 5, and 6. The ratio assigned each person and the documentation of how the ratio was arrived at must be kept in each person's individual service plan. Documentation must include an assessment of the person with respect to the characteristics in subdivisions 4, 5, and 6.\nA person must be assigned a staff ratio requirement of one to four if:\n(1) on a daily basis the person requires total care and monitoring or constant hand-over-hand physical guidance to successfully complete at least three of the following activities: toileting, communicating basic needs, eating, or ambulating; or\n(2) the person engages in conduct that poses an imminent risk of physical harm to self or others at a documented level of frequency, intensity, or duration requiring frequent daily ongoing intervention and monitoring as established in the person's support plan or support plan addendum.\nA person must be assigned a staff ratio requirement of one to eight if:\n(1) the person does not meet the requirements in subdivision 4; and\n(2) on a daily basis the person requires verbal prompts or spot checks and minimal or no physical assistance to successfully complete at least three of the following activities: toileting, communicating basic needs, eating, or ambulating.\nA person who does not have any of the characteristics described in subdivision 4 or 5 must be assigned a staff ratio requirement of one to six.\nThe minimum number of direct support service staff members required at any one time to meet the combined staff ratio requirements of the persons present at that time can be determined by the following steps:\n(1) assign to each person in attendance the three-digit decimal below that corresponds to the staff ratio requirement assigned to that person. A staff ratio requirement of one to four equals 0.250. A staff ratio requirement of one to eight equals 0.125. A staff ratio requirement of one to six equals 0.166. A staff ratio requirement of one to ten equals 0.100;\n(2) add all of the three-digit decimals (one three-digit decimal for every person in attendance) assigned in clause (1);\n(3) when the sum in clause (2) falls between two whole numbers, round off the sum to the larger of the two whole numbers; and\n(4) the larger of the two whole numbers in clause (3) equals the number of direct support service staff members needed to meet the staff ratio requirements of the persons in attendance.\nOnly staff providing direct support must be counted as staff members in calculating the staff-to-participant ratio. A volunteer may be counted as a direct support staff in calculating the staff-to-participant ratio if the volunteer meets the same standards and requirements as paid staff. No person receiving services must be counted as or be substituted for a staff member in calculating the staff-to-participant ratio.\nThe license holder must increase the number of direct support staff members present at any one time beyond the number arrived at in subdivision 4 if necessary when any one or combination of the following circumstances can be documented by the commissioner as existing:\n(1) the health and welfare needs of the persons receiving services cannot be met by the number of staff members available under the staffing pattern in effect even though the number has been accurately calculated under subdivision 7; or\n(2) the person's conduct frequently presents an imminent risk of physical harm to self or others.\n(a) At no time must one direct support staff member be assigned responsibility for supervision and training of more than ten persons receiving supervision and training, except as otherwise stated in each person's support plan or support plan addendum.\n(b) In the temporary absence of the director or a supervisor, a direct support staff member must be designated to supervise the center.\nA multifunctional program may count other employees of the organization besides direct support staff of the day service facility in calculating the staff-to-participant ratio if the employee is assigned to the day services facility for a specified amount of time, during which the employee is not assigned to another organization or program.",
	"repealed": false
}