{
	"id": "340A.26",
	"url": "https://www.revisor.mn.gov/statutes/cite/340A.26",
	"title": "340A.26 BREWER TAPROOMS.",
	"text": "(a) A municipality, including a city with a municipal liquor store, may issue the holder of a brewer's license under section 340A.301, subdivision 6, clause (c), (i), or (j), a brewer taproom license. A brewer taproom license authorizes on-sale of malt liquor produced by the brewer for consumption on the premises of or adjacent to one brewery location owned by the brewer. Nothing in this subdivision precludes the holder of a brewer taproom license from also holding a license to operate a restaurant at the brewery. Section 340A.409 shall apply to a license issued under this subdivision. All provisions of this chapter that apply to a retail liquor license shall apply to a license issued under this subdivision unless the provision is explicitly inconsistent with this subdivision.\n(b) A brewer may only have one taproom license under this subdivision, and may not have an ownership interest in a brew pub.\nA municipality may not issue a brewer taproom license to a brewer if the brewer seeking the license, or any person having an economic interest in the brewer seeking the license or exercising control over the brewer seeking the license, is a brewer that brews more than 250,000 barrels of malt liquor annually or a winery that produces more than 250,000 gallons of wine annually.\nThe municipality shall impose a licensing fee on a brewer holding a brewer taproom license under this subdivision, subject to limitations applicable to license fees under section 340A.408, subdivision 2, paragraph (a).\nA municipality shall, within ten days of the issuance of a license under this subdivision, inform the commissioner of the licensee's name and address and trade name, and the effective date and expiration date of the license. The municipality shall also inform the commissioner of a license transfer, cancellation, suspension, or revocation during the license period.\nNotwithstanding section 340A.504, subdivision 3, a taproom may be open and may conduct on-sale business on Sundays if authorized by the municipality.",
	"repealed": false
}