{
	"id": "469.055",
	"url": "https://www.revisor.mn.gov/statutes/cite/469.055",
	"title": "469.055 POWERS AND DUTIES.",
	"text": "A port authority shall: (1) promote the general welfare of the port district, and of the port as a whole; (2) try to increase the volume of the port's commerce; (3) promote the efficient, safe, and economical handling of the commerce; and (4) provide or promote adequate docks, railroad and terminal facilities open to all on reasonable and equal terms for the handling, storage, care, and shipment of freight and passengers to, from, and through the port. A port authority may carry out its powers and duties under sections 469.048 to 469.068 at any place in the city.\nA port authority shall:\n(1) meet with a neighboring state's port authority that shares a port or harbor with it and try to agree with that authority on a comprehensive plan to regulate, develop, and improve the harbor and port;\n(2) consider and adopt detailed plans for the port district consistent with the comprehensive plan in clause (1);\n(3) meet from time to time with any other state's port authority to try to agree with it on legislation and rules needed to regulate and control the whole port, and recommend the adoption of the legislation and rules to the appropriate legislative and regulatory bodies;\n(4) decide on and recommend legislation and rules needed to regulate and improve navigation and commerce in the port district;\n(5) jointly with a similar body, or separately, recommend to the proper departments of the federal, state, or local government, or to another body, the carrying out of public improvements to benefit the port or port district;\n(6) investigate the practices, rates, and conduct of privately owned or operated dock, terminal and port facilities in the port district, start proceedings, and take steps in the public interest to remedy abuses. To conduct investigations under this clause, a port authority may examine witnesses under oath and to do so have subpoenas issued out of the district court where it is located. The subpoenas may require the attendance of witnesses and the production of books and documents;\n(7) a seaway port authority may also investigate stevedoring and car contractors, ship chandlers, and other organizations that a port depends on for its orderly development and operation;\n(8) if necessary, bring suit for any irregularities before a proper state or federal court; and\n(9) annually by April 1 give a detailed written account to its city council of its activities, its receipts and expenditures during the past calendar year, and other matters and recommendations it finds advisable to advance the commerce and welfare of the port district.\nA port authority operating under this section and also under sections 469.058 to 469.068 may deposit all its money from any source in one bank account.\nTo further an authorized purpose a port authority may (1) join an official, industrial, commercial, or trade association, or another organization concerned with the purpose, (2) have a reception of officials or others who may contribute to advance the port district and its industrial development, and (3) carry out other public relation activities to promote the port district and its industrial development. Activities under this subdivision have a public purpose.\nMS 1998 [Repealed, 2000 c 490 art 11 s 44]\nA port authority may acquire, purchase, construct, lease, or operate bulkheads, jetties, piers, wharves, docks, landing places, warehouses, storehouses, elevators, cold storage plants, terminals, bridges, or other terminal or transportation facilities. The authority may own, hold, lease, or operate real and personal property. A port authority may lease property in or out of its port district if it believes the property is suitable and proper to use to carry out its duties and responsibilities. The facilities and the property must be needed or convenient for storing, handling, or transporting freight, passenger traffic, and establishing rail and water transfer in the port district. The authority may make rules and fix fees for the use of the facilities and for the services it renders. The authority may borrow money and secure the loans by mortgages on property held or to be held by it or by bonds.\nMS 2020 [Repealed, 1Sp2021 c 14 art 10 s 9]\nA port authority may acquire under eminent domain property of any kind within the port district needed by it for public use even if the property was acquired by its owner under eminent domain or even if the property is already devoted to a public use. Property vested in or held by the state or by a city, county, school district, town, or other municipality must not be taken without the holder's consent. The port authority shall adopt a resolution describing the property and stating its intended use and the necessity of the taking.\nA port authority may acquire, operate, and maintain an existing toll bridge for vehicles across boundary water between a city of the first class in the state and another city either in or out of state. The authority may also construct, maintain, and operate another vehicular toll bridge with its approaches across the water at a point suitable to navigation, and may reconstruct, repair, and improve both bridges. The authority may construct, maintain, and operate a tunnel under the water and reconstruct, repair, and improve it.\nA port authority may enter upon lands and acquire, condemn, occupy, possess, and use real estate and other property needed to locate, construct, operate, and maintain the bridge or tunnel and approaches to it. In doing so, the authority shall act in the same manner as a railroad corporation may for railroad purposes, or a bridge corporation may for bridge purposes in the state where the property is after making just compensation for the property as decided and paid under the laws of that state. The proceedings must be the same as for condemnation in that state.\nA port authority may survey or investigate the proper uses, operations, improvement, and development of the port district, the resulting stimulation of employment, and the benefit to the port district's city, county, and state. The port authority may also prepare a plan to construct, develop, and improve the port in the future. The plan may be merged with existing or future plans of any city in the port district. After public hearing, the port authority may adopt a plan as its official plan for the port district. Then the plan may be extended, modified, or amended only after a hearing. When the plan is adopted, all improvements made by the port authority must be consistent with it.\nA seaway port authority may operate its port terminal facilities on its premises as terminal operators. If it does so, the authority may contract with a warehouse operator performing other terminal services to act as its agent. The contract may provide: (1) that the agent will be paid on a monthly basis to operate the facilities; (2) that the agent may hire the necessary personnel to carry out the functions undertaken by the contract; (3) that employees engaged by the agent are employees of the agent and not of the port authority; and (4) that the agent is responsible to pay the employees and to comply with local ordinances and state and federal laws affecting the employees. The seaway port authority may also contract with agents to perform any function that the port authority may do. The seaway port authority may retain power to set rates for a service to be performed in a terminal facility owned, leased, or operated by it.",
	"repealed": false
}