{
	"id": "161.1782",
	"url": "https://www.revisor.mn.gov/statutes/cite/161.1782",
	"title": "161.1782 TRANSPORTATION IMPACT ASSESSMENT; TECHNICAL ADVISORY COMMITTEE.",
	"text": "(a) For purposes of this section, the following terms have the meanings given.\n(b) \"Advisory committee\" means the technical advisory committee established in this section.\n(c) \"Project or portfolio\" is as provided in section 161.178.\nThe commissioner must establish a technical advisory committee to assist in implementation review related to the requirements under section 161.178.\nThe advisory committee is composed of the following members:\n(1) one member from the Department of Transportation, appointed by the commissioner of transportation;\n(2) one member from the Pollution Control Agency, appointed by the commissioner of the Pollution Control Agency;\n(3) one member from the Metropolitan Council, appointed by the chair of the Metropolitan Council;\n(4) one member from the Center for Transportation Studies, appointed by the president of the University of Minnesota;\n(5) one member representing metropolitan planning organizations outside the metropolitan area, as defined in section 473.121, subdivision 2, appointed by the Association of Metropolitan Planning Organizations; and\n(6) up to four members who are not employees of the state, with no more than two who are employees of a political subdivision, appointed by the commissioner of transportation.\n(a) To be eligible for appointment to the advisory committee, an individual must have experience or expertise sufficient to provide assistance in implementation or technical review related to the requirements under section 161.178. Each appointing authority must consider appointment of individuals with expertise in travel demand modeling, emissions modeling, traffic forecasting, land use planning, or transportation-related greenhouse gas emissions assessment and analysis. In appointing the members under subdivision 3, clause (6), the commissioner must also consider technical expertise in other relevant areas, which may include but is not limited to public health or natural systems management.\n(b) Members of the advisory committee serve at the pleasure of the appointing authority. Vacancies must be filled by the appointing authority.\nThe advisory committee must assist the commissioner in implementation of the requirements under section 161.178, including to:\n(1) perform technical review and validation of processes and methodologies used for impact assessment and impact mitigation;\n(2) review and make recommendations on:\n(i) impact assessment requirements;\n(ii) models and tools for impact assessment;\n(iii) methods to determine sufficiency of impact mitigation;\n(iv) procedures for interlinking a project or portfolio to impact mitigation; and\n(v) reporting and data collection;\n(3) advise on the approach used to determine the area of influence for a project or portfolio for a geographic or transportation network area;\n(4) develop recommendations on any clarifications, modifications, or additions to the offset actions authorized under section 161.178, subdivision 4; and\n(5) perform other analyses or activities as requested by the commissioner.\n(a) The commissioner must provide administrative support to the advisory committee. Upon request, the commissioner must provide information and technical support to the advisory committee.\n(b) Members of the advisory committee are not eligible for compensation under this section.\n(c) The advisory committee is subject to the Minnesota Data Practices Act under chapter 13 and to the Minnesota Open Meeting Law under chapter 13D.",
	"repealed": false
}