{
	"id": "84.96",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.96",
	"title": "84.96 NATIVE PRAIRIE BANK.",
	"text": "The commissioner shall establish a native prairie bank, determine where native prairie land is located in the state, and prescribe eligibility requirements for inclusion of land in the native prairie bank.\nFor the purposes of this section, \"native prairie\" means a grassland dominated by original native prairie vegetation, usually occurring where the sod has never been broken.\n(a) The commissioner may acquire native prairie for conservation purposes by entering into easements with landowners or with the land administrator of state school trust lands. Before acquiring easements under this subdivision on school trust lands, the commissioner must receive advice from the school trust lands director according to section 127A.353, subdivision 4. The easements must be conservation easements as defined in section 84C.01, clause (1), except the easements may be made possessory as well as nonpossessory if agreed upon by the landowner or land administrator and the commissioner.\n(b) The easements may be permanent or of limited duration. Highest priority must be given to permanent easements consistent with the purposes of this section. Easements of limited duration must be for at least 20 years, with provision for renewal for at least another 20-year period. For easements of limited duration, the commissioner may reexamine and adjust the payment rates at the beginning of any renewal period after considering current land and crop values.\n(a) In the easement between the commissioner and an owner, the owner must agree:\n(1) to place in the program for the period of the easement eligible native prairie areas designated by the owner, including prairie covered by a federal or state easement that allows agricultural use and desirable land adjacent to the prairie as determined by the commissioner;\n(2) not to alter the native prairie by plowing, heavy grazing, seeding to nonnative grasses or legumes, spraying with large amounts of herbicides, or otherwise destroying the native prairie character of the easement area, except mowing the native prairie tract for wild hay may qualify for easement as determined by the commissioner;\n(3) to implement the native prairie conservation and development plan as provided in the easement agreement, unless a requirement in the easement agreement is waived or modified by the commissioner;\n(4) to forfeit all rights to further payments under the terms of the easement and to refund to the state all payments received under the easement if the easement is violated at any time when the owner has control of the land subject to the easement, if the commissioner determines that the violation warrants termination of the easement, or if the commissioner determines that the violation does not warrant termination of the easement, the commissioner may determine refunds or payment adjustments to be paid by the commissioner;\n(5) not to adopt a practice specified by the commissioner in the easement as a practice that would tend to defeat the purposes of the easement; and\n(6) to additional provisions included in the easement that the commissioner determines are desirable.\n(b) In return for the easement of the owner, the commissioner shall make payments as provided in subdivision 5 and may provide advice on conservation and development practices on the native prairie in the easement and adjacent areas.\n(a) For interests in lands acquired under this section, the commissioner must make payments to the landowner or land administrator according to this subdivision.\n(b) For a permanent easement, the commissioner may pay up to ten percent more than the Board of Water and Soil Resources pays for noncrop easements. If the Board of Water and Soil Resources does not establish a noncrop easement payment rate, the commissioner must establish land value rates for payments considering market factors, such as county-assessed land value and sales ratio studies, along with ecological, biological, and cultural factors that take into consideration the global rarity of native prairie. The rates must be based on the need to protect the extremely small amount of the globally vulnerable and imperiled remaining native prairie in Minnesota.\n(c) For an easement of limited duration, the commissioner may pay up to 65 percent of the permanent prairie bank easement rate for the time period when the application is made.\n(d) To maintain and protect native prairies, the commissioner may enter into easements that allow selected agricultural practices. Payment must be based on paragraph (b) or (c) but may be reduced due to the agricultural practices allowed after negotiation with the landowner or land administrator.\n(e) If a native prairie qualifies for the native prairie bank but the landowner requests that the commissioner acquire the native prairie in fee rather than acquire an easement, the commissioner may acquire it as any outdoor recreation system classification under section 86A.05 with protections equivalent to a native prairie bank easement. For acquisition under this paragraph, the commissioner may pay up to 25 percent more than what the Board of Water and Soil Resources pays for noncrop easements. If the Board of Water and Soil Resources does not establish a noncrop easement payment rate, the commissioner must establish land value rates for payments considering market factors, such as county-assessed land value and sales ratio studies, along with ecological, biological, and cultural factors that take into consideration the global rarity of native prairie.\n(f) For a permanent easement acquired on school trust lands under this section, the commissioner must pay no less than 100 percent of the easement's appraised value at the time of closing.\nA limited-term easement may be converted to a permanent easement or renewed at the end of the easement period by mutual agreement of the commissioner and the owner, subject to any rate redetermination by the commissioner.\nIf during the easement period the owner sells or otherwise disposes of the ownership or right of occupancy of the land, the new owner must continue the easement under the same terms or conditions.\nThe commissioner may terminate an easement by mutual agreement with the owner if the commissioner determines that the termination would be in the public interest. The commissioner may agree to modifications of agreements if the commissioner determines the modification is desirable to implement the native prairie program.\nThe commissioner of natural resources may adopt rules that include the procedures and payment rates to implement this section.",
	"repealed": false
}