{
	"id": "190.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/190.33",
	"title": "190.33 CAMP RIPLEY SENTINEL LANDSCAPE.",
	"text": "(a) Camp Ripley shall be a sentinel landscape. By January 16, 2017, the coordinating committee established under subdivision 2 shall designate certain lands in the vicinity of Camp Ripley to be contained in the sentinel landscape of Camp Ripley. The purpose of this designation shall be to identify lands important to the nation's defense mission in an effort to preserve and enhance the relationship between willing landowners and Camp Ripley and to create incentives to encourage landowners' land management practices consistent with Camp Ripley's military missions.\n(b) Individuals who own land which is deemed part of the sentinel landscape shall be provided the opportunity to participate, on a voluntary basis, in various programs designed to encourage land uses compatible with Camp Ripley's military missions.\n(a) By March 1, 2016, the adjutant general shall establish a coordinating committee to address issues related to technical support services and appropriate financial assistance to landowners who voluntarily participate in the sentinel landscape program in subdivision 1.\n(b) The committee will be comprised of the following individuals:\n(1) the adjutant general or a designee who will serve as the chair of the committee;\n(2) the commissioner of agriculture or a designee;\n(3) the commissioner of natural resources or a designee; and\n(4) the executive director of the Board of Water and Soil Resources or a designee.\nThe committee may also seek input from federal agencies, including but not limited to the Department of Defense, the Department of the Army, the National Guard Bureau, the Department of the Interior, or the Department of Agriculture. The committee may also appoint members from other state agencies, county officials from any county where sentinel landscapes are located, and nongovernmental organizations that participate in land management activities within the sentinel landscape.\nThe chair shall convene meetings as necessary to conduct the duties prescribed in this section. The chair shall convene the first meeting of the committee by March 1, 2016.\nThe committee shall identify sentinel land, and develop recommendations to encourage landowners within the sentinel lands to voluntarily participate in and begin or continue land uses compatible with Camp Ripley's military mission. In designating sentinel lands, the coordinating committee shall include all working or natural lands, wherever located, that the coordinating committee believes contribute to the long-term sustainability of the military missions conducted at Camp Ripley. In determining which lands to designate, the coordinating committee shall seek input from the director of the Department of Defense Readiness and Environmental Protection Integration Program, the chief of the National Guard Bureau, the director of the Army Compatible Use Buffer Program, the commander of the Camp Ripley Training Center, the commissioner of agriculture, the commissioner of natural resources, the executive director of the Board of Water and Soil Resources, appropriate county commissioners from any county where designated lands are located, and any others the adjutant general deems appropriate.\nMembers of the committee will serve without compensation.\nBy January 16, 2017, the adjutant general, with the assistance of the coordinating committee established in subdivision 2, shall submit a report to the governor and to the chairs of the committees in the house of representatives and senate with primary jurisdiction over the Department of Military Affairs. The report must summarize the committee's efforts to encourage landowners within the Camp Ripley sentinel landscape to voluntarily participate in and begin or continue land uses compatible with Camp Ripley's military mission. This report will include a map which geographically defines the boundaries of the sentinel landscape and may also provide recommendations for any further legislation the coordinating committee deems necessary to further the goals of this program.",
	"repealed": false
}