{
	"id": "295.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/295.51",
	"title": "295.51 MINIMUM CONTACTS REQUIRED FOR JURISDICTION TO TAX GROSS REVENUE.",
	"text": "A hospital, surgical center, or health care provider is subject to tax under sections 295.50 to 295.59 if it is \"transacting business in Minnesota.\" A hospital, surgical center, or health care provider is transacting business in Minnesota if it maintains contacts with or presence in the state of Minnesota sufficient to permit taxation of gross revenues received for patient services under the United States Constitution.\n(a) To the extent allowed by the United States Constitution and the laws of the United States, a person who is a wholesale drug distributor, a person subject to tax under section 295.52, subdivision 4, or a person who sells or repairs hearing aids and related equipment or prescription eyewear is subject to the taxes imposed by this chapter if the person:\n(1) has or maintains within this state, directly or by a subsidiary or an affiliate, an office, place of distribution, sales, storage, or sample room or place, warehouse, or other place of business, including the employment of a resident of this state who works from a home office in this state;\n(2) has a representative, including but not limited to an employee, affiliate, agent, salesperson, canvasser, solicitor, independent contractor, or other third party operating in this state under the person's authority or the authority of the person's subsidiary, for any purpose, including the repairing, selling, delivering, installing, facilitating sales, processing sales, or soliciting of orders for the person's goods or services, or the leasing of tangible personal property located in this state, whether the place of business or the agent, representative, affiliate, salesperson, canvasser, or solicitor is located in the state permanently or temporarily, or whether or not the person, subsidiary, or affiliate is authorized to do business in this state;\n(3) owns or leases real property that is located in this state; or\n(4) owns or leases tangible personal property that is present in this state, including but not limited to mobile property.\n(b) To the extent allowed by the United States Constitution and the laws of the United States, a person who is a wholesale drug distributor, or a person who is subject to tax under section 295.52, subdivision 4, is subject to the taxes imposed by this chapter if the person:\n(1) conducts a trade or business not described in paragraph (a) and sells, delivers, or distributes legend drugs from outside this state to a destination within this state by common carrier or otherwise; and\n(2) meets one of the following thresholds:\n(i) makes 200 or more sales, deliveries, or distributions described in clause (1) during any taxable year;\n(ii) the gross revenues of a wholesale drug distributor that sells, delivers, or distributes legend drugs as described in clause (1) totals more than $100,000 during any taxable year; or\n(iii) the price paid by a person who is subject to tax under section 295.52, subdivision 4, totals more than $100,000 for legend drugs that the person sells, delivers, or distributes as described in clause (1) during any taxable year.\n(c) To the extent allowed by the United States Constitution and the laws of the United States, a person who sells or repairs hearing aids and related equipment or prescription eyewear is subject to the taxes imposed by this chapter if the person:\n(1) conducts a trade or business not described in paragraph (a) and:\n(i) sells, delivers, or distributes hearing aids and related equipment or prescription eyewear from outside of this state to a destination within this state by common carrier or otherwise; or\n(ii) repairs hearing aids and related equipment or prescription eyewear outside of this state and delivers or distributes the hearing aids and related equipment or prescription eyewear to a destination within this state by common carrier or otherwise; and\n(2) meets one of the following thresholds:\n(i) makes 200 or more sales, deliveries, distributions, or repairs described in clause (1) during any taxable year; or\n(ii) the gross revenues of the person who sells, delivers, distributes, or repairs hearing aids and related equipment or prescription eyewear described in clause (1) totals more than $100,000 during any taxable year.\n(d) Once a taxpayer has established nexus with Minnesota under paragraph (b) or (c), the taxpayer must continue to file an annual return and remit taxes for subsequent years. A taxpayer who has established nexus under paragraph (b) or (c) is no longer required to file an annual return and remit taxes if the taxpayer:\n(1) ceases to engage in the activities or no longer meets any of the applicable thresholds in paragraph (b) or (c) for an entire taxable year; and\n(2) notifies the commissioner by March 15 of the following calendar year, in a manner prescribed by the commissioner, that the taxpayer no longer engages in any of the activities or no longer meets any of the applicable thresholds in paragraph (b) or (c).\n(e) If, after notifying the commissioner pursuant to paragraph (d), the taxpayer subsequently engages in any of the activities and meets any of the applicable thresholds in paragraph (b) or (c), the taxpayer shall again comply with the applicable requirements of paragraphs (b) to (d).\n[Repealed, 1993 c 345 art 13 s 24]",
	"repealed": false
}