{
	"id": "179A.60",
	"url": "https://www.revisor.mn.gov/statutes/cite/179A.60",
	"title": "179A.60 JOINT POWERS AGREEMENTS.",
	"text": "For purposes of this section, \"entity\" means an operating organization, established by agreement of two or more governmental units for the joint exercise of governmental powers, that has its own governing board with the authority to hire its own employees. For purposes of this section, entity does not include service delivery authorities created under section 402A.35.\nNotwithstanding the provisions of section 179A.12 or any other law, this section governs the initial certification and decertification, if any, of exclusive representatives for an entity. Employees of an entity are public employees and joint powers entities are public employers under section 179A.03. After initial certification and decertification, if any, as provided in this section, this section does not apply.\nFor purposes of determining an appropriate unit, employees hired by, assigned to, or transferred to the joint powers entity shall be presumed to be the appropriate unit for all employees of the newly created joint powers entity, unless the commissioner determines it inappropriate under the standards established in section 179A.09. The commissioner may also approve an alternative bargaining unit structure agreed upon by all parties. The determination shall take effect as soon as practicable after filing of a petition, but not later than the date the joint powers entity is formally created.\nIn certification of exclusive representatives for appropriate units of employees of newly created joint powers entities, the commissioner shall use the criterion set forth in section 179A.102.\n(a) Prior to the effective date of an agreement creating an entity, the commissioner may resolve questions of appropriate unit determination and provide for the certification of exclusive representatives if:\n(1) all the governmental units creating the entity pass a resolution requesting the commissioner to do so; and\n(2) the affected exclusive representatives agree.\n(b) A new collective bargaining agreement may be negotiated under subdivision 7 prior to the effective date of an agreement creating an entity, so long as the collective bargaining agreement is approved by all of the governmental units creating the entity.\n(a) This subdivision only applies if an exclusive representative is certified under subdivision 4.\n(b) Until a successor contract is executed between the new joint powers entity and the exclusive representative of its employees, the board of the joint powers entity and the exclusive representatives of the employees may agree:\n(1) to comply with the contract with the member of the entity that employed the largest portion of the new employees who are assigned to the new joint powers entity with respect to all of the employees assigned to the new joint powers entity; or\n(2) that each of the contracts shall apply to the employees previously subject to the respective contract.\n(c) In the absence of an agreement according to paragraph (b), each of the contracts shall apply to the employees previously subject to the respective contract and shall be binding on the new joint powers entity.\nThe exclusive representative of employees of a new joint powers entity shall upon certification be responsible to negotiate a new collective bargaining agreement, file grievances, and otherwise administer the prior collective bargaining agreement until a new collective bargaining agreement is agreed to, and to receive dues or fair-share fees.\nIf an employee who is transferred from the employment of a member to the employment of a joint powers entity is under investigation by the member of the entity at the time of the transfer and would be subject to discipline by the member of the entity, the new joint powers entity may discipline the employee for just cause, and the employee's union may file a grievance under the collective bargaining agreement the employee was covered by as an employee of a member of the entity or the new collective bargaining agreement after it is agreed to.\nThe governmental units creating an entity may provide the new entity with access to private and confidential data relating to employees of the governmental units who become employees of the entity.\nUpon creation of a new entity, seniority shall be based on the employee's continuous service with a member of the entity and the employee's service with the entity.\nLayoffs and recalls shall be based on seniority as defined herein. Recall rights shall continue to apply until a new collective bargaining agreement is agreed to by the parties.\nThe commissioner may not consider a petition for decertification of an exclusive representative certified under this section for one year after certification. After that time, a petition must be considered under the provisions of section 179A.12.",
	"repealed": false
}