{
	"id": "97A.106",
	"url": "https://www.revisor.mn.gov/statutes/cite/97A.106",
	"title": "97A.106 FUR FARMS.",
	"text": "A person may breed and propagate fur-bearing animals only on privately owned or leased land and after obtaining a license. Any of the permitted animals on a fur farm may be sold to other licensed fur farms. \"Privately owned or leased land\" includes waters that are shallow or marshy, are not actually navigable, and are not of substantial beneficial public use. Before an application for a license is considered, the applicant must enclose the area to sufficiently confine the animals to be raised in a manner approved by the commissioner. A license may be granted only if the commissioner finds the application is made in good faith with intention to actually carry on the business described in the application and the commissioner determines that the facilities are adequate for the business.\n(a) A fur farm license is transferable with the transfer of all or a portion of the title or leasehold of the land if:\n(1) the land transferred complies with the license requirements;\n(2) the land is used for the purposes of the license; and\n(3) a verified written report of the existing and intended land use is made to the commissioner, accompanied by a copy of deed, assignment, lease, or other instrument transferring the corresponding title or leasehold in the enclosed land.\n(b) A transfer of less than the whole interest in the license is not valid. Each bona fide partner or associate in the ownership or operation of a fur farm must obtain a separate license.\nFor each fur farm, the owner must, on or before January 1, pay to the commissioner an annual fee of $250.\nThe fur farm account is established in the game and fish fund. Fees collected under this section and interest attributable to money in the account must be deposited in the account. Money in the account, including interest earned, is appropriated to the commissioner for administration and enforcement of this section.\nAll wild animals and their offspring, of the species identified in the license, that are within the enclosure are the property of the fur farm licensee.\nThe commissioner, in consultation with the Board of Animal Health and the commissioners of agriculture and health, must develop:\n(1) containment and disposal requirements for farmed fur-bearers; and\n(2) farmed fur-bearer disease testing and reporting requirements.\n(a) A sale of live animals from a licensed fur farm is not valid unless the animals are delivered to the purchaser or they are identified and kept separately.\n(b) Live animals sold through auction or through a broker are considered to be sold by the fur farm licensee.\n(c) The sale agreement or contract must be in writing. The licensee must notify a purchaser of the death of an animal within 30 days and of the number of increase before July 20 of each year.\nThe commissioner must prescribe:\n(1) the manner that pelts and products of wild animals raised on fur farms may be sold or transported; and\n(2) the tags or seals to be affixed to the pelts and products.\nFox and mink may not be bought or sold for breeding or propagating unless they have been pen-bred for at least two generations.\nLive beaver may not be transported without a permit from the commissioner.\nA licensee that does not comply with a provision of this section subjects all wild animals on the fur farm to confiscation.\nThe commissioner may adopt rules for:\n(1) issuing fur farm licenses;\n(2) inspecting fur farm facilities;\n(3) acquiring fur farm animals; and\n(4) record keeping and reporting by fur farm licensees, including transactions handled by auction or broker.",
	"repealed": false
}