{
	"id": "246.18",
	"url": "https://www.revisor.mn.gov/statutes/cite/246.18",
	"title": "246.18 DISPOSAL OF FUNDS.",
	"text": "Except as provided in subdivision 4, every officer and employee of the several institutions under the jurisdiction of the executive board who has money belonging to an institution shall pay the money to the chief financial officer or a designee of that institution. At the close of each month, at a minimum, the chief financial officer of every institution shall forward to the executive board a statement of the amount and sources of all money received. On receipt of the statement, the executive board shall transmit the same to the commissioner of management and budget, who shall deliver a draft to the chief financial officer or a designee for the same specifying the money credited to the institution.\nMS 2022 [Repealed, 2023 c 61 art 4 s 28]\nMS 2022 [Repealed, 2023 c 61 art 4 s 28]\n[Repealed, 1991 c 292 art 4 s 79]\n[Repealed, 1991 c 292 art 4 s 79]\nExcept as provided in subdivisions 4a to 6, all receipts from collection efforts for state facilities as defined in section 246.50, subdivision 3, must be deposited in the general fund. From that amount, receipts from collection efforts for the Anoka-Metro Regional Treatment Center and community behavioral health hospitals must be deposited in accordance with subdivision 4a. The executive board shall ensure that the departmental financial reporting systems and internal accounting procedures comply with federal standards for reimbursement for program and administrative expenditures and fulfill the purpose of this subdivision.\nThe mental health innovation account is established in the special revenue fund. $1,000,000 of the revenue generated by collection efforts from the Anoka-Metro Regional Treatment Center and community behavioral health hospitals under section 246.54 each fiscal year must annually be deposited into the mental health innovation account. Money deposited in the mental health innovation account is appropriated to the commissioner of human services for the mental health innovation grant program under section 245.4662.\nSeparate interest-bearing funded depreciation accounts must be established in the state treasury for state-operated, community-based programs serving persons with developmental disabilities meeting the definition of a facility in Minnesota Rules, part 9553.0020, subpart 19, or a vendor in section 252.41, subdivision 9. As payments for state-operated community-based services provided by such intermediate care facilities for persons with developmental disabilities and vendors are received by the executive board, the portion of the payment rate representing allowable depreciation expense and the capital debt reduction allowance must be deposited in the state treasury and credited to the separate interest-bearing accounts as dedicated receipts. Unused money credited to the separate interest-bearing accounts as dedicated receipts carries over to the next fiscal year. Money within these funded depreciation accounts is appropriated to the executive board for the purchase or replacement of capital assets or payment of capitalized repairs for each respective program. These accounts satisfy the requirements of Minnesota Rules, part 9553.0060, subparts 1, item E, and 5.\n(a) Except for state-operated programs funded through a direct appropriation from the legislature, any state-operated program or service established and operated as an enterprise activity retains the revenues earned in an interest-bearing account.\n(b) When the executive board determines the intent to transition from a direct appropriation to enterprise activity for which the executive board has authority, the executive board shall retain and deposit all collections for the targeted state-operated service into an interest-bearing account. At the end of the fiscal year, prior to establishing the enterprise activity, the executive board shall deposit collections up to the amount of the appropriation for the targeted service in the general fund. The executive board shall retain all money in excess of the amount of the appropriation for use by the enterprise activity for cash flow purposes.\n(c) The money equaling the appropriation for the targeted service returned to the general fund must be deposited in the state treasury in a revolving account. Money in the revolving account is appropriated to the executive board to operate the services authorized, and any unexpended balances do not cancel but are available until spent.\n[Repealed, 1Sp2001 c 10 art 2 s 102]\nMS 2018 [Repealed, 1Sp2019 c 9 art 3 s 4]\nMS 2018 [Repealed, 1Sp2019 c 9 art 3 s 4]",
	"repealed": false
}