{
	"id": "256.017",
	"url": "https://www.revisor.mn.gov/statutes/cite/256.017",
	"title": "256.017 COMPLIANCE SYSTEM.",
	"text": "(a) The commissioner of human services shall directly administer the compliance system for general assistance, medical assistance, emergency general assistance, Minnesota supplemental assistance, housing support, preadmission screening, alternative care grants, and all other programs administered by the commissioner or on behalf of the commissioner under the powers and authorities named in section 256.01, subdivision 2.\n(b) The commissioner of children, youth, and families shall administer the compliance system for the Minnesota family investment program, the Supplemental Nutrition Assistance Program (SNAP), the child care assistance program, and all other programs administered by the commissioner or on behalf of the commissioner under the powers and authorities named in section 142A.03, subdivision 2.\n(c) The commissioners of human services and children, youth, and families shall cooperate as necessary to administer compliance systems related to the Minnesota family investment program, the Supplemental Nutrition Assistance Program (SNAP), general assistance, medical assistance, emergency general assistance, Minnesota supplemental assistance, housing support, preadmission screening, alternative care grants, the child care assistance program, and all other programs administered by the commissioner of human services or on behalf of the commissioner of human services under the powers and authorities named in section 256.01, subdivision 2.\n(d) The purpose of the compliance system is to permit the commissioners to supervise the administration of public assistance programs and to enforce timely and accurate distribution of benefits, completeness of service and efficient and effective program management and operations, to increase uniformity and consistency in the administration and delivery of public assistance programs throughout the state, and to reduce the possibility of sanctions and fiscal disallowances for noncompliance with federal regulations and state statutes. The commissioners, or the commissioners' representatives, may issue administrative subpoenas as needed in administering the compliance system.\n(e) The commissioners shall utilize training, technical assistance, and monitoring activities, as specified in sections 142A.03, subdivision 2, and 256.01, subdivision 2, to encourage county agency compliance with written policies and procedures.\nThe following terms have the meanings given for purposes of this section.\n(a) \"Administrative penalty\" means an adjustment against the county agency's state and federal benefit and federal administrative reimbursement when the commissioner determines that the county agency is not in compliance with the policies and procedures established by the commissioner.\n(b) \"Commissioner\" means the commissioner of human services for programs listed in subdivision 1, paragraph (b), and the commissioner of children, youth, and families for programs listed in subdivision 1, paragraph (c).\n(c) \"Quality control case penalty\" means an adjustment against the county agency's federal administrative reimbursement and state and federal benefit reimbursement when the commissioner determines through a quality control review that the county agency has made incorrect payments, terminations, or denials of benefits as determined by state quality control procedures for the aid to families with dependent children program formerly codified in sections 256.72 to 256.87, Minnesota family investment program, SNAP, or medical assistance programs, or any other programs for which the commissioner has developed a quality control system. Quality control case penalties apply only to agency errors as defined by state quality control procedures.\n(d) \"Quality control/quality assurance\" means a review system of a statewide random sample of cases, designed to provide data on program outcomes and the accuracy with which state and federal policies are being applied in issuing benefits and as a fiscal audit to ensure the accuracy of expenditures. The quality control/quality assurance system is administered by the department. For the aid to families with dependent children program formerly codified in sections 256.72 to 256.87, SNAP, and medical assistance, the quality control system is that required by federal regulation, or those developed by the commissioner.\nThe commissioner shall disallow, withhold, or deny state and federal benefit reimbursement and federal administrative reimbursement payment to a county when the commissioner determines that the county has incorrectly issued benefits or incorrectly denied or terminated benefits. These cases shall be identified by state quality control reviews.\n(a) The amount of the quality control case penalty is limited to the amount of the dollar error for the quality control sample month in a reviewed case as determined by the state quality control review procedures for the aid to families with dependent children program formerly codified in sections 256.72 to 256.87, and SNAP or for any other income transfer program for which the commissioner develops a quality control program.\n(b) Payment errors in medical assistance or any other medical services program for which the department develops a quality control program are subject to set rate penalties based on the average cost of the specific quality control error element for a sample review month for that household size and status of institutionalization and as determined from state quality control data in the preceding fiscal year for the corresponding program.\n(c) Errors identified in negative action cases, such as incorrect terminations or denials of assistance are subject to set rate penalties based on the average benefit cost of that household size as determined from state quality control data in the preceding fiscal year for the corresponding program.\nThe commissioner shall disallow or withhold state and federal benefit reimbursement and federal administrative reimbursement from county agencies when the actions performed by the county agency are not in compliance with the written policies and procedures established by the commissioner. The policies and procedures must be previously communicated to the county agency. A county agency shall not be penalized for complying with a written policy or procedure, even if the policy or procedure is found to be erroneous and is subsequently rescinded by the commissioner.\nThe amount of the penalty imposed on any county agency is based on the numbers of public assistance applicants and recipients that may be affected by the county agency's failure to comply with the policies and procedures established by the commissioner, the fiscal impact of the county agency's action, and the duration of the noncompliance as determined by the commissioner. Administrative penalties shall be imposed independent of any quality control case penalties.\n(a)(1) The commissioner shall notify the county agency in writing of all proposed quality control case penalties.\n(2) The county agency may submit a written exception of the quality control error claim and proposed penalty. The exception must be submitted to the commissioner within ten calendar days of the receipt of the penalty notice.\n(3) Within 20 calendar days of receipt of the written exception, the commissioner shall sustain, dismiss, or amend the quality control findings and case penalty and notify the county agency, in writing, of the decision and the amount of any penalty. The commissioner's decision is not subject to judicial review.\n(b)(1) The commissioner shall notify the county agency in writing of any proposed administrative penalty, the date by which the county agency must correct the issues noted in the penalty, and the time period within which the county agency must submit a corrective action plan for compliance.\n(2) If the county agency fails to submit a corrective action plan within the stated time period, or if the corrective action plan does not bring the agency into compliance as determined by the commissioner, or if the county agency fails to meet the commitments in the corrective action plan, the commissioner shall issue the administrative penalty and notify the county agency in writing.\n(3) The county agency may file written exception to the administrative penalty with the commissioner within 30 days of the receipt of the commissioner's notice of issuing the administrative penalty. The county agency must notify the commissioner of its intent to file a written exception within ten days of the delivery of the commissioner's notice of the administrative penalty. If the county agency does not notify the commissioner of its intent to file and does not file a written exception within the prescribed time periods, the department's initial decision shall be final.\n(4) The commissioner shall sustain, dismiss, or amend the administrative penalty findings, and shall issue a written order to the county agency within 30 calendar days after receiving the county agency's written exception.\nA county agency that is aggrieved by the order of the commissioner in an administrative penalty of over $75,000, or 1.5 percent of the total benefit expenditures for the income maintenance programs listed in subdivision 1, for that county, whichever is the lesser amount, may appeal the order to the court of appeals by serving a written copy of a notice of appeal upon the commissioner within 30 days after the date the commissioner issued the administrative penalty order, and by filing the original notice and proof of service with the court administrator of the court of appeals. Service may be made personally or by mail. Service by mail is complete upon mailing. The record of review shall consist of the advance notice of the administrative penalty to the county agency, the county agency corrective action plan if any, the final notice of the administrative penalty, the county agency's written exception to the administrative penalty order, and any other material submitted for the commissioner's consideration, and the commissioner's final written order. The court may affirm the commissioner's decision or remand the case for further proceedings, or it may reverse or modify the decision if the substantial rights of the county agency have been prejudiced because the decision is: (1) in excess of the statutory authority or jurisdiction of the agency; (2) unsupported by substantial evidence in view of the entire record as submitted; (3) arbitrary or capricious; or (4) in violation of constitutional provisions.\nQuality control case penalty and administrative penalty amounts shall be disallowed or withheld from the next regular reimbursement made to the county agency for state and federal benefit reimbursements and federal administrative reimbursements for all programs covered in this section, according to procedures established in statute, but shall not be imposed sooner than 30 calendar days from the date of written notice of such penalties. Except for penalties withheld under the child care assistance program, all penalties must be deposited in the county incentive fund provided in section 256.018. Penalties withheld under the child care assistance program shall be reallocated to counties using the allocation formula under section 142E.04, subdivision 6. All penalties must be imposed according to this provision until a decision is made regarding the status of a written exception. Penalties must be returned to county agencies when a review of a written exception results in a decision in their favor.\nCounties subject to fiscal penalties shall not reduce or withhold benefits from eligible recipients of programs listed in subdivision 1 in order to cover the cost of penalties under this section. County funds shall be used to cover the cost of any penalties.",
	"repealed": false
}