{
	"id": "84.8712",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.8712",
	"title": "84.8712 METAL TRACTION DEVICES; PROHIBITION ON PAVED TRAILS.",
	"text": "A person may not use a snowmobile with metal traction devices on a paved public trail that is designated closed to such use by a local government with jurisdiction over the trail or on a paved state trail or any portion of a paved state trail that is designated closed to such use by the commissioner.\nConservation officers and other licensed peace officers may issue civil citations to a person who operates a snowmobile in violation of this section. The citation must impose a penalty of $50 for the first offense, $200 for the second offense, and $500 for third and subsequent offenses.\nCivil citations for offenses under this section may be appealed under the procedures in section 116.072, subdivision 6, if the recipient of the citation requests a hearing by notifying the commissioner in writing within 15 days after receipt of the citation. For the purposes of the enforcement of this section, the terms \"commissioner\" and \"agency\" as used in section 116.072 mean the commissioner of natural resources. If a hearing is not requested within the 15-day period, the citation becomes a final order not subject to further review.\nCivil citations for offenses under this section may be enforced under section 116.072, subdivision 9. If a person fails to pay a penalty owed under this section, the person may not operate a snowmobile until the penalty is paid. Penalty amounts must be remitted within 30 days of issuance of the penalty citation.\nPenalty amounts collected from civil citations issued under this section are deposited to the unit of government employing the officer that issues the civil citation. The commissioner must deposit penalty amounts received by the state in the snowmobile trails and enforcement account established by section 84.83, subdivision 1. The penalty amounts in the account must be dedicated for the repair of paved public trails.\nA person operating a snowmobile in violation of this section is guilty of a petty misdemeanor punishable by a fine of no more than $50 for the first offense, no more than $300 for the second offense, and no more than $600 for the third and subsequent offenses. A peace officer may not seek both civil and petty misdemeanor penalties for a violation of this section.",
	"repealed": false
}