{
	"id": "214.131",
	"url": "https://www.revisor.mn.gov/statutes/cite/214.131",
	"title": "214.131 COMMISSIONER CEASE AND DESIST AUTHORITY; NONCOMPLIANCE.",
	"text": "The commissioner of health may issue a cease and desist order to stop a person from engaging in an unauthorized practice or violating or threatening to violate a statute, rule, or order that the commissioner of health has issued or is empowered to enforce. The cease and desist order must state the reason for its issuance and give notice of the person's right to request a hearing under sections 14.57 to 14.62. If, within 15 days after service of the order, the subject of the order fails to request a hearing in writing, the cease and desist order becomes final.\nA hearing must be initiated by the commissioner of health not later than 30 days after the date the commissioner receives a written hearing request. Within 30 days after receiving the administrative law judge's report, the commissioner of health shall issue a final order modifying, vacating, or making permanent the cease and desist order as the facts require. The final order remains in effect until modified or vacated by the commissioner of health.\nWhen a request for a stay accompanies a timely hearing request, the commissioner of health may grant the stay. If the commissioner does not grant a requested stay, the commissioner shall refer the request to the Office of Administrative Hearings within three workdays after receiving the request. Within ten days after receiving the request from the commissioner of health, an administrative law judge shall issue a recommendation to grant or deny the stay. The commissioner of health shall grant or deny the stay within five workdays after receiving the administrative law judge's recommendation.\nIn the event of noncompliance with a cease and desist order, the commissioner of health may institute a proceeding in a district court to obtain injunctive relief or other appropriate relief, including a civil penalty payable to the commissioner of health not exceeding $10,000 for each separate violation.\nWhen the commissioner of health finds that a person has violated one or more provisions of any statute, rule, or order that the commissioner of health is empowered to regulate, enforce, or issue, the commissioner of health may impose, for each violation, a civil penalty that deprives the person of any economic advantage gained by the violation, or that reimburses the Department of Health for costs of the investigation and proceeding, or both.\nIn addition to any other remedy provided by law, the commissioner of health may bring an action in district court for injunctive relief to restrain any unauthorized practice or violation of any statute, rule, or order that the commissioner of health is empowered to regulate, enforce, or issue. A temporary restraining order may be granted in the proceeding if continued activity by a person would create a serious risk of harm to others.\nThe issuance of a cease and desist order or injunctive relief granted under this section does not relieve a person from criminal prosecution by any competent authority or from disciplinary action by the commissioner of health. Any violation of any order of the commissioner is a misdemeanor.",
	"repealed": false
}