{
	"id": "142E.10",
	"url": "https://www.revisor.mn.gov/statutes/cite/142E.10",
	"title": "142E.10 FINANCIAL ELIGIBILITY.",
	"text": "(a) Child care services must be available to families who need child care to find or keep employment or to obtain the training or education necessary to find employment and who:\n(1) have household income less than or equal to 67 percent of the state median income, adjusted for family size, at application and redetermination, and meet the requirements of section 142E.08; receive MFIP assistance; and are participating in employment and training services under chapter 142G; or\n(2) have household income less than or equal to 47 percent of the state median income, adjusted for family size, at application and less than or equal to 67 percent of the state median income, adjusted for family size, at redetermination.\n(b) Child care services must be made available as in-kind services.\n(c) All applicants for child care assistance and families currently receiving child care assistance must be assisted and required to cooperate in establishment of paternity and enforcement of child support obligations for all children in the family at application and redetermination as a condition of program eligibility. For purposes of this section, a family is considered to meet the requirement for cooperation when the family complies with the requirements of section 518A.81.\n(d) All applicants for child care assistance and families currently receiving child care assistance must pay the co-payment fee under section 142E.15, subdivision 2, as a condition of eligibility. The co-payment fee may include additional recoupment fees due to a child care assistance program overpayment.\n(e) If a family has one child with a child care authorization and the child reaches 13 years of age or the child has a disability and reaches 15 years of age, the family remains eligible until the redetermination.\nIf a county projects that its child care allocation is insufficient to meet the needs of all eligible families, it may prioritize among the families that remain to be served after the county has complied with the priority requirements of section 142E.04. Counties that have established a priority for families who are not MFIP participants beyond those established under section 142E.04 must submit the policy in the annual child care fund plan.\n(a) Annual income of the applicant family is the current monthly income of the family multiplied by 12 or the income for the 12-month period immediately preceding the date of application, or income calculated by the method which provides the most accurate assessment of income available to the family.\n(b) Self-employment income must be calculated based on section 256P.05, subdivision 2.\n(c) Income changes are processed under section 142E.03, subdivision 4. Included lump sums counted as income under section 256P.06, subdivision 3, must be annualized over 12 months. Income must be verified with documentary evidence. If the applicant does not have sufficient evidence of income, verification must be obtained from the source of the income.\nCounties must reserve a family's position under the child care assistance fund if a family has been receiving child care assistance but is temporarily ineligible for assistance due to increased income from active military service. Activated military personnel may be temporarily ineligible until deactivation. A county must reserve a military family's position on the basic sliding fee waiting list under the child care assistance fund if a family is approved to receive child care assistance and reaches the top of the waiting list but is temporarily ineligible for assistance.\nParents may choose child care providers as defined under section 142E.01, subdivision 22, that best meet the needs of their family. Counties shall make resources available to parents in choosing quality child care services. Counties may require a parent to sign a release stating their knowledge and responsibilities in choosing a legal provider described under section 142E.01, subdivision 22. When a county knows that a particular provider is unsafe, or that the circumstances of the child care arrangement chosen by the parent are unsafe, the county may deny a child care subsidy. A county may not restrict access to a general category of provider allowed under section 142E.01, subdivision 22.\nThe maximum amount of child care assistance a local agency may pay for in a two-week period is 120 hours per child.\n(a) The date of eligibility for child care assistance under this chapter is the later of the date the application was received by the county; the beginning date of employment, education, or training; the date the infant is born for applicants to the at-home infant care program; or the date a determination has been made that the applicant is a participant in employment and training services under Minnesota Rules, part 3400.0080, or chapter 142G.\n(b) Payment ceases for a family under the at-home infant child care program when a family has used a total of 12 months of assistance as specified under section 142E.05. Payment of child care assistance for employed persons on MFIP is effective the date of employment or the date of MFIP eligibility, whichever is later. Payment of child care assistance for MFIP participants in employment and training services is effective the date of commencement of the services or the date of MFIP eligibility, whichever is later. Payment of child care assistance for transition year child care must be made retroactive to the date of eligibility for transition year child care.\n(c) Notwithstanding paragraph (b), payment of child care assistance for participants eligible under section 142E.08 may only be made retroactive for a maximum of three months from the date of application for child care assistance.\n[See Note.]\nReceipt of federal, state, or local funds by a child care provider either directly or through a parent who is a child care assistance recipient does not establish an employee-employer relationship between the child care provider and the county or state.\nThis subdivision applies to any provider providing care in a setting other than a child care center. Licensed and legal nonlicensed family child care providers and their employees are not eligible to receive child care assistance subsidies under this chapter for their own children or children in their family during the hours they are providing child care or being paid to provide child care. Child care providers and their employees are eligible to receive child care assistance subsidies for their children when they are engaged in other activities that meet the requirements of this chapter and for which child care assistance can be paid. The hours for which the provider or their employee receives a child care subsidy for their own children must not overlap with the hours the provider provides child care services.\n(a) A child care center may receive authorizations for 25 or fewer children who are dependents of the center's employees. If a child care center is authorized for more than 25 children who are dependents of center employees, the county cannot authorize additional dependents of an employee until the number of children falls below 25.\n(b) Funds paid to providers during the period of time when a center is authorized for more than 25 children who are dependents of center employees must not be treated as overpayments under section 142E.14, subdivision 2, due to noncompliance with this subdivision.\n(c) Nothing in this subdivision precludes the commissioner from conducting fraud investigations relating to child care assistance, imposing sanctions, and obtaining monetary recovery as otherwise provided by law.\nAll federal, state, and local child care funds must be paid directly to the parent when a provider cares for children in the children's own home. In all other cases, all federal, state, and local child care funds must be paid directly to the child care provider, either licensed or legal nonlicensed, on behalf of the eligible family. Funds distributed under this chapter must not be used for child care services that are provided for a child by a child care provider who resides in the same household or occupies the same residence as the child.\nPayment by a source other than the family, of part or all of a family's child care expenses not payable under this chapter, does not affect the family's eligibility for child care assistance, and the amount paid is excluded from the family's income, if the funds are paid directly to the family's child care provider on behalf of the family. Child care providers who accept third-party payments must maintain family-specific documentation of payment source, amount, type of expenses, and time period covered by the payment.\nChild care services to families must be made available on a sliding fee basis. The commissioner shall convert eligibility requirements in this section and parent fee schedules in section 142E.15 to state median income, based on a family size of three, adjusted for family size.\n(a) Child care assistance must only be authorized in the child's home if:\n(1) the child's parents have authorized activities outside of the home; or\n(2) one parent in a two-parent family is in an authorized activity outside of the home and one parent is unable to care for the child and meets the requirements in Minnesota Rules, part 3400.0040, subpart 5.\n(b) In order for child care assistance to be authorized under paragraph (a), clause (1) or (2), one or more of the following circumstances must be met:\n(1) the authorized activity occurs during times when out-of-home care is not available or when out-of-home care would result in disruption of the child's nighttime sleep schedule. If child care is needed during any period when out-of-home care is not available, in-home care can be approved for the entire time care is needed;\n(2) the family lives in an area where out-of-home care is not available; or\n(3) a child has a verified illness or disability that would place the child or other children in an out-of-home facility at risk or creates a hardship for the child and the family to take the child out of the home to a child care home or center.",
	"repealed": false
}