{
	"id": "169A.51",
	"url": "https://www.revisor.mn.gov/statutes/cite/169A.51",
	"title": "169A.51 CHEMICAL TESTS FOR INTOXICATION.",
	"text": "(a) Any person who drives, operates, or is in physical control of a motor vehicle within this state or on any boundary water of this state consents, subject to the provisions of sections 169A.50 to 169A.53 (implied consent law), and section 169A.20 (driving while impaired), to a chemical test of that person's blood, breath, or urine for the purpose of determining the presence of alcohol; a controlled substance or its metabolite; cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, artificially derived cannabinoids, or tetrahydrocannabinols; or an intoxicating substance. The test must be administered at the direction of a peace officer.\n(b) The test may be required of a person when an officer has probable cause to believe the person was driving, operating, or in physical control of a motor vehicle in violation of section 169A.20 (driving while impaired), and one of the following conditions exist:\n(1) the person has been lawfully placed under arrest for violation of section 169A.20 or an ordinance in conformity with it;\n(2) the person has been involved in a motor vehicle accident or collision resulting in property damage, personal injury, or death;\n(3) the person has refused to take the screening test provided for by section 169A.41 (preliminary screening test); or\n(4) the screening test was administered and indicated an alcohol concentration of 0.08 or more.\n(c) The test may also be required of a person when an officer has probable cause to believe the person was driving, operating, or in physical control of a commercial motor vehicle with the presence of any alcohol.\nAt the time a breath test is requested, the person must be informed:\n(1) that Minnesota law requires the person to take a test:\n(i) to determine if the person is under the influence of alcohol; and\n(ii) if the motor vehicle was a commercial motor vehicle, to determine the presence of alcohol;\n(2) that refusal to submit to a breath test is a crime; and\n(3) that the person has the right to consult with an attorney, but that this right is limited to the extent that it cannot unreasonably delay administration of the test.\n(a) Notwithstanding any contrary provisions in sections 169A.51 to 169A.53, a blood or urine test may be conducted only pursuant to a search warrant or a judicially recognized exception to the search warrant requirement. In addition, blood and urine tests may be conducted only as provided in sections 169A.51 to 169A.53 and 171.177.\n(b) When, under the provisions of section 169A.20, 169A.51, or 171.177, a search warrant is required for a blood or urine test, that requirement is met if a judicially recognized exception to the warrant requirement is applicable.\nA blood or urine test may be required pursuant to a search warrant even after a breath test has been administered if there is probable cause to believe that:\n(1) there is impairment by a controlled substance; an intoxicating substance; or cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, artificially derived cannabinoids, or tetrahydrocannabinols that is not subject to testing by a breath test;\n(2) a controlled substance listed in Schedule I or II or its metabolite, other than cannabis flower, a cannabis product, a lower-potency hemp edible, a hemp-derived consumer product, artificially derived cannabinoids, or tetrahydrocannabinols, is present in the person's body; or\n(3) the person is unconscious or incapacitated to the point that the peace officer providing a breath test advisory, administering a breath test, or serving the search warrant has a good-faith belief that the person is mentally or physically unable to comprehend the breath test advisory or otherwise voluntarily submit to chemical tests.\nAction may be taken against a person who refuses to take a blood test under this subdivision only if a urine test was offered and action may be taken against a person who refuses to take a urine test only if a blood test was offered. This limitation does not apply to an unconscious person under the circumstances described in clause (3).\n(a) In the case of a breath test administered using an infrared or other approved breath-testing instrument, the test must consist of analyses in the following sequence: one adequate breath-sample analysis, one control analysis, and a second, adequate breath-sample analysis.\n(b) In the case of a test administered using an infrared or other approved breath-testing instrument, a sample is adequate if the instrument analyzes the sample and does not indicate the sample is deficient.\n(c) For purposes of section 169A.52 (revocation of license for test failure or refusal), when a test is administered using an infrared or other approved breath-testing instrument, failure of a person to provide two separate, adequate breath samples in the proper sequence constitutes a refusal.\n(d) For purposes of section 169A.52 (revocation of license for test failure or refusal), when a test is administered using an infrared or other approved breath-testing instrument, a breath test consisting of two separate, adequate breath samples within 0.02 alcohol concentration is acceptable. A breath test consisting of two separate, adequate breath samples failing to meet this criterion is deficient.\n(e) If the first breath test is deficient, as defined by paragraph (d), a second breath test must be administered.\n(f) Two deficient breath tests, as defined by paragraph (d), constitute a refusal.\nA person who is unconscious or who is otherwise in a condition rendering the person incapable of refusal is deemed not to have withdrawn the consent provided by subdivision 1 and the test may be given.\n(a) Only a physician, medical technician, emergency medical technician-paramedic, registered nurse, medical technologist, medical laboratory technician, phlebotomist, laboratory assistant, or other qualified person acting at the request of a peace officer may withdraw blood for the purpose of determining the presence of alcohol, a controlled substance or its metabolite, or an intoxicating substance. This limitation does not apply to the taking of a breath or urine sample.\n(b) The person tested has the right to have someone of the person's own choosing administer a chemical test or tests in addition to any administered at the direction of a peace officer; provided, that the additional test sample on behalf of the person is obtained at the place where the person is in custody, after the test administered at the direction of a peace officer, and at no expense to the state. The failure or inability to obtain an additional test or tests by a person does not preclude the admission in evidence of the test taken at the direction of a peace officer unless the additional test was prevented or denied by the peace officer.\n(c) The physician, medical technician, emergency medical technician-paramedic, medical technologist, medical laboratory technician, laboratory assistant, phlebotomist, registered nurse, or other qualified person drawing blood at the request of a peace officer for the purpose of determining the concentration of alcohol, a controlled substance or its metabolite, or an intoxicating substance is in no manner liable in any civil or criminal action except for negligence in drawing the blood. The person administering a breath test must be fully trained in the administration of breath tests pursuant to training given by the commissioner of public safety.\n(d) For purposes of this subdivision, \"qualified person\" means medical personnel trained in a licensed hospital or educational institution to withdraw blood.",
	"repealed": false
}