{
	"id": "299C.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/299C.58",
	"title": "299C.58 COMPACT.",
	"text": "The National Crime Prevention and Privacy Compact is hereby ratified, enacted into law, and entered into by this state with any other states legally joining therein in the form substantially as follows:\nARTICLE I\nDEFINITIONS\nIn this compact:\n(1) Attorney general. The term \"attorney general\" means: the attorney general of the United States.\n(2) Compact officer. The term \"compact officer\" means\n(A) with respect to the federal government, an official so designated by the director of the FBI; and\n(B) with respect to a party state, the chief administrator of the state's criminal history record repository or a designee of the chief administrator who is a regular full-time employee of the repository.\n(3) Council. The term \"council\" means the Compact Council established under article VI.\n(4) Criminal history records. The term \"criminal history records\"\n(A) means information collected by criminal justice agencies on individuals consisting of identifiable descriptions and notations of arrests, detentions, indictments, or other formal criminal charges, and any disposition arising therefrom, including acquittal, sentencing, correctional supervision, or release; and\n(B) does not include identification information such as fingerprint records if such information does not indicate involvement of the individual with the criminal justice system.\n(5) Criminal history record repository. The term \"criminal history record repository\" means the state agency designated by the governor or other appropriate executive official or the legislature of a state to perform centralized record-keeping functions for criminal history records and services in the state.\n(6) Criminal justice. The term \"criminal justice\" includes activities relating to the detection, apprehension, detention, pretrial release, posttrial release, prosecution, adjudication, correctional supervision, or rehabilitation of accused persons or criminal offenders. The administration of criminal justice includes criminal identification activities and the collection, storage, and dissemination of criminal history records.\n(7) Criminal justice agency. The term \"criminal justice agency\"\n(A) means:\n(i) courts; and\n(ii) a governmental agency or any subunit thereof that:\n(I) performs the administration of criminal justice pursuant to a statute or executive order; and\n(II) allocates a substantial part of its annual budget to the administration of criminal justice; and\n(B) includes federal and state inspectors general offices.\n(8) Criminal justice services. The term \"criminal justice services\" means services provided by the FBI to criminal justice agencies in response to a request for information about a particular individual or as an update to information previously provided for criminal justice purposes.\n(9) Criterion offense. The term \"criterion offense\" means any felony or misdemeanor offense not included on the list of nonserious offenses published periodically by the FBI.\n(10) Direct access. The term \"direct access\" means access to the National Identification Index by computer terminal or other automated means not requiring the assistance of or intervention by any other party or agency.\n(11) Executive order. The term \"executive order\" means an order of the president of the United States or the chief executive officer of a state that has the force of law and that is promulgated in accordance with applicable law.\n(12) FBI. The term \"FBI\" means the Federal Bureau of Investigation.\n(13) Interstate Identification Index System. The term \"Interstate Identification Index System\" or \"III System\"\n(A) means the cooperative federal-state system for the exchange of criminal history records; and\n(B) includes the National Identification Index, the National Fingerprint File, and, to the extent of their participation in such system, the criminal history record repositories of the states and the FBI.\n(14) National Fingerprint File. The term \"National Fingerprint File\" means a database of fingerprints, or other uniquely personal identifying information, relating to an arrested or charged individual maintained by the FBI to provide positive identification of record subjects indexed in the III System.\n(15) National Identification Index. The term \"National Identification Index\" means an index maintained by the FBI consisting of names, identifying numbers, and other descriptive information relating to record subjects about whom there are criminal history records in the III System.\n(16) National indexes. The term \"national indexes\" means the National Identification Index and the National Fingerprint File.\n(17) Nonparty state. The term \"nonparty state\" means a state that has not ratified this compact.\n(18) Noncriminal justice purposes. The term \"noncriminal justice purposes\" means uses of criminal history records for purposes authorized by federal or state law other than purposes relating to criminal justice activities, including employment suitability, licensing determinations, immigration and naturalization matters, and national security clearances.\n(19) Party state. The term \"party state\" means a state that has ratified this compact.\n(20) Positive identification. The term \"positive identification\" means a determination, based upon a comparison of fingerprints or other equally reliable biometric identification techniques, that the subject of a record search is the same person as the subject of a criminal history record or records indexed in the III System. Identifications based solely upon a comparison of subjects' names or other nonunique identification characteristics or numbers, or combinations thereof, shall not constitute positive identification.\n(21) Sealed record information. The term \"sealed record information\" means:\n(A) with respect to adults, that portion of a record that is:\n(i) not available for criminal justice uses;\n(ii) not supported by fingerprints or other accepted means of positive identification; or\n(iii) subject to restrictions on dissemination for noncriminal justice purposes pursuant to a court order related to a particular subject or pursuant to a federal or state statute that requires action on a sealing petition filed by a particular record subject; and\n(B) with respect to juveniles, whatever each state determines is a sealed record under its own law and procedure.\n(22) State. The term \"state\" means any state, territory, or possession of the United States, the District of Columbia, and the Commonwealth of Puerto Rico.\nARTICLE II\nPURPOSES\nThe purposes of this compact are to:\n(1) provide a legal framework for the establishment of a cooperative federal-state system for the interstate and federal-state exchange of criminal history records for noncriminal justice uses;\n(2) require the FBI to permit use of the National Identification Index and the National Fingerprint File by each party state, and to provide, in a timely fashion, federal and state criminal history records to requesting states, in accordance with the terms of this compact and with rules, procedures, and standards established by the council under article VI;\n(3) require party states to provide information and records for the National Identification Index and the National Fingerprint File and to provide criminal history records, in a timely fashion, to criminal history record repositories of other states and the federal government for noncriminal justice purposes, in accordance with the terms of this compact and with rules, procedures, and standards established by the council under article VI;\n(4) provide for the establishment of a council to monitor III System operations and to prescribe system rules and procedures for the effective and proper operation of the III System for noncriminal justice purposes; and\n(5) require the FBI and each party state to adhere to III System standards concerning record dissemination and use, response times, system security, data quality, and other duly established standards, including those that enhance the accuracy and privacy of such records.\nARTICLE III\nRESPONSIBILITIES OF COMPACT PARTIES\n(a) FBI responsibilities. The director of the FBI shall:\n(1) appoint an FBI compact officer who shall:\n(A) administer this compact within the Department of Justice and among federal agencies and other agencies and organizations that submit search requests to the FBI pursuant to article V(c);\n(B) ensure that compact provisions and rules, procedures, and standards prescribed by the council under article VI are complied with by the Department of Justice and the federal agencies and other agencies and organizations referred to in article III(1)(A); and\n(C) regulate the use of records received by means of the III System from party states when such records are supplied by the FBI directly to other federal agencies;\n(2) provide to federal agencies and to state criminal history record repositories, criminal history records maintained in its database for the noncriminal justice purposes described in article IV, including:\n(A) information from nonparty states; and\n(B) information from party states that is available from the FBI through the III System, but is not available from the party state through the III System;\n(3) provide a telecommunications network and maintain centralized facilities for the exchange of criminal history records for both criminal justice purposes and the noncriminal justice purposes described in article IV, and ensure that the exchange of such records for criminal justice purposes has priority over exchange for noncriminal justice purposes; and\n(4) modify or enter into user agreements with nonparty state criminal history record repositories to require them to establish record request procedures conforming to those prescribed in article V.\n(b) State responsibilities. Each party state shall:\n(1) appoint a compact officer who shall:\n(A) administer this compact within that state;\n(B) ensure that compact provisions and rules, procedures, and standards established by the council under article VI are complied with in the state; and\n(C) regulate the in-state use of records received by means of the III System from the FBI or from other party states;\n(2) establish and maintain a criminal history record repository, which shall provide:\n(A) information and records for the National Identification Index and the National Fingerprint File; and\n(B) the state's III System-indexed criminal history records for noncriminal justice purposes described in article IV;\n(3) participate in the National Fingerprint File; and\n(4) provide and maintain telecommunications links and related equipment necessary to support the services set forth in this compact.\n(c) Compliance with III System standards. In carrying out their responsibilities under this compact, the FBI and each party state shall comply with III System rules, procedures, and standards duly established by the council concerning record dissemination and use, response times, data quality, system security, accuracy, privacy protection, and other aspects of III System operation.\n(d) Maintenance of record services.\n(1) Use of the III System for noncriminal justice purposes authorized in this compact shall be managed so as not to diminish the level of services provided in support of criminal justice purposes.\n(2) Administration of compact provisions shall not reduce the level of service available to authorized noncriminal justice users on the effective date of this compact.\nARTICLE IV\nAUTHORIZED RECORD DISCLOSURES\n(a) State criminal history record repositories. To the extent authorized by United States Code, title 5, section 552a, commonly known as the \"Privacy Act of 1974,\" the FBI shall provide on request criminal history records (excluding sealed records) to state criminal history record repositories for noncriminal justice purposes allowed by federal statute, federal executive order, or a state statute that has been approved by the attorney general and that authorizes national indexes checks.\n(b) Criminal justice agencies and other governmental or nongovernmental agencies. The FBI, to the extent authorized by United States Code, title 5, section 552a, commonly known as the \"Privacy Act of 1974,\" and state criminal history record repositories shall provide criminal history records (excluding sealed records) to criminal justice agencies and other governmental or nongovernmental agencies for noncriminal justice purposes allowed by federal statute, federal executive order, or a state statute that has been approved by the attorney general, that authorizes national indexes checks.\n(c) Procedures. Any record obtained under this compact may be used only for the official purposes for which the record was requested. Each compact officer shall establish procedures, consistent with this compact, and with rules, procedures, and standards established by the council under article VI, which procedures shall protect the accuracy and privacy of the records, and shall:\n(1) ensure that records obtained under this compact are used only by authorized officials for authorized purposes;\n(2) require that subsequent record checks are requested to obtain current information whenever a new need arises; and\n(3) ensure that record entries that may not legally be used for a particular noncriminal justice purpose are deleted from the response and, if no information authorized for release remains, an appropriate \"no record\" response is communicated to the requesting official.\nARTICLE V\nRECORD REQUEST PROCEDURES\n(a) Positive identification. Subject fingerprints or other approved forms of positive identification shall be submitted with all requests for criminal history record checks for noncriminal justice purposes.\n(b) Submission of state requests. Each request for a criminal history record check utilizing the national indexes made under any approved state statute shall be submitted through that state's criminal history record repository. A state criminal history record repository shall process an interstate request for noncriminal justice purposes through the national indexes only if such request is transmitted through another state criminal history record repository or the FBI.\n(c) Submission of federal requests. Each request for criminal history record checks utilizing the national indexes made under federal authority shall be submitted through the FBI or, if the state criminal history record repository consents to process fingerprint submissions, through the criminal history record repository in the state in which such request originated. Direct access to the National Identification Index by entities other than the FBI and state criminal history records repositories shall not be permitted for noncriminal justice purposes.\n(d) Fees. A state criminal history record repository or the FBI:\n(1) may charge a fee, in accordance with applicable law, for handling a request involving fingerprint processing for noncriminal justice purposes; and\n(2) may not charge a fee for providing criminal history records in response to an electronic request for a record that does not involve a request to process fingerprints.\n(e) Additional search.\n(1) If a state criminal history record repository cannot positively identify the subject of a record request made for noncriminal justice purposes, the request, together with fingerprints or other approved identifying information, shall be forwarded to the FBI for a search of the national indexes.\n(2) If, with respect to a request forwarded by a state criminal history record repository under paragraph (1), the FBI positively identifies the subject as having a III System-indexed record or records:\n(A) the FBI shall so advise the state criminal history record repository; and\n(B) the state criminal history record repository shall be entitled to obtain the additional criminal history record information from the FBI or other state criminal history record repositories.\nARTICLE VI\nESTABLISHMENT OF COMPACT COUNCIL\n(a) Establishment.\n(1) In general. There is established a council to be known as the \"Compact Council,\" which shall have the authority to promulgate rules and procedures governing the use of the III System for noncriminal justice purposes, not to conflict with FBI administration of the III System for criminal justice purposes.\n(2) Organization. The council shall:\n(A) continue in existence as long as this compact remains in effect;\n(B) be located, for administrative purposes, within the FBI; and\n(C) be organized and hold its first meeting as soon as practicable after the effective date of this compact.\n(b) Membership. The council shall be composed of 15 members, each of whom shall be appointed by the attorney general, as follows.\n(1) Nine members, each of whom shall serve a two-year term, who shall be selected from among the compact officers of party states based on the recommendation of the compact officers of all party states, except that, in the absence of the requisite number of compact officers available to serve, the chief administrators of the criminal history record repositories of nonparty states shall be eligible to serve on an interim basis.\n(2) Two at-large members, nominated by the Director of the FBI, each of whom shall serve a three-year term, of whom:\n(A) one shall be a representative of the criminal justice agencies of the federal government and may not be an employee of the FBI; and\n(B) one shall be a representative of the noncriminal justice agencies of the federal government.\n(3) Two at-large members, nominated by the chairman of the council, once the chair is elected pursuant to article VI(c), each of whom shall serve a three-year term, of whom:\n(A) one shall be a representative of state or local criminal justice agencies; and\n(B) one shall be a representative of state or local noncriminal justice agencies.\n(4) One member, who shall serve a three-year term, and who shall simultaneously be a member of the FBI's advisory policy board on criminal justice information services, nominated by the membership of that policy board.\n(5) One member, nominated by the Director of the FBI, who shall serve a three-year term, and who shall be an employee of the FBI.\n(c) Chair and vice-chair.\n(1) In general. From its membership, the council shall elect a chair and a vice-chair of the council, respectively. Both the chair and vice-chair of the council:\n(A) shall be a compact officer, unless there is no compact officer on the council who is willing to serve, in which case the chair may be an at-large member; and\n(B) shall serve a two-year term and may be reelected to only one additional two-year term.\n(2) Duties of vice-chair. The vice-chair of the council shall serve as the chair of the council in the absence of the chair.\n(d) Meetings.\n(1) In general. The council shall meet at least once each year at the call of the chair. Each meeting of the council shall be open to the public. The council shall provide prior public notice in the Federal Register of each meeting of the council, including the matters to be addressed at such meeting.\n(2) Quorum. A majority of the council or any committee of the council shall constitute a quorum of the council or of such committee, respectively, for the conduct of business. A lesser number may meet to hold hearings, take testimony, or conduct any business not requiring a vote.\n(e) Rules, procedures, and standards. The council shall make available for public inspection and copying at the council office within the FBI, and shall publish in the Federal Register, any rules, procedures, or standards established by the council.\n(f) Assistance from FBI. The council may request from the FBI such reports, studies, statistics, or other information or materials as the council determines to be necessary to enable the council to perform its duties under this compact. The FBI, to the extent authorized by law, may provide such assistance or information upon such a request.\n(g) Committees. The chair may establish committees as necessary to carry out this compact and may prescribe their membership, responsibilities, and duration.\nARTICLE VII\nRATIFICATION OF COMPACT\nThis compact shall take effect upon being entered into by two or more states as between those states and the federal government. Upon subsequent entering into this compact by additional states, it shall become effective among those states and the federal government and each party state that has previously ratified it. When ratified, this compact shall have the full force and effect of law within the ratifying jurisdictions. The form of ratification shall be in accordance with the laws of the executing state.\nARTICLE VIII\nMISCELLANEOUS PROVISIONS\n(a) Relation of compact to certain FBI activities. Administration of this compact shall not interfere with the management and control of the Director of the FBI over the FBI's collection and dissemination of criminal history records and the advisory function of the FBI's advisory policy board chartered under the Federal Advisory Committee Act (5 U.S.C. App.) for all purposes other than noncriminal justice.\n(b) No authority for nonappropriated expenditures. Nothing in this compact shall require the FBI to obligate or expend funds beyond those appropriated to the FBI.\n(c) Relating to Public Law 92-544. Nothing in this compact shall diminish or lessen the obligations, responsibilities, and authorities of any state, whether a party state or a nonparty state, or of any criminal history record repository or other subdivision or component thereof, under the Departments of State, Justice, and Commerce, the Judiciary, and Related Agencies Appropriation Act, 1973 (Public Law 92-544), or regulations and guidelines promulgated thereunder, including the rules and procedures promulgated by the council under article VI(a), regarding the use and dissemination of criminal history records and information.\nARTICLE IX\nRENUNCIATION\n(a) In general. This compact shall bind each party state until renounced by the party state.\n(b) Effect. Any renunciation of this compact by a party state shall:\n(1) be effected in the same manner by which the party state ratified this compact; and\n(2) become effective 180 days after written notice of renunciation is provided by the party state to each other party state and to the federal government.\nARTICLE X\nSEVERABILITY\nThe provisions of this compact shall be severable, and if any phrase, clause, sentence, or provision of this compact is declared to be contrary to the constitution of any participating state, or to the Constitution of the United States, or the applicability thereof to any government, agency, person, or circumstance is held invalid, the validity of the remainder of this compact and the applicability thereof to any government, agency, person, or circumstance shall not be affected thereby. If a portion of this compact is held contrary to the constitution of any party state, all other portions of this compact shall remain in full force and effect as to the remaining party states and in full force and effect as to the party state affected, as to all other provisions.\nARTICLE XI\nADJUDICATION OF DISPUTES\n(a) In general. The council shall:\n(1) have initial authority to make determinations with respect to any dispute regarding:\n(A) interpretation of this compact;\n(B) any rule or standard established by the council pursuant to article V; and\n(C) any dispute or controversy between any parties to this compact; and\n(2) hold a hearing concerning any dispute described in paragraph (1) at a regularly scheduled meeting of the council and only render a decision based upon a majority vote of the members of the council. Such decision shall be published pursuant to the requirements of article VI(e).\n(b) Duties of the FBI. The FBI shall exercise immediate and necessary action to preserve the integrity of the III System, maintain system policy and standards, protect the accuracy and privacy of records, and to prevent abuses, until the council holds a hearing on such matters.\n(c) Right of appeal. The FBI or a party state may appeal any decision of the council to the attorney general, and thereafter may file suit in the appropriate district court of the United States, which shall have original jurisdiction of all cases or controversies arising under this compact. Any suit arising under this compact and initiated in a state court shall be removed to the appropriate district court of the United States in the manner provided by United States Code, title 28, section 1446, or other statutory authority.",
	"repealed": false
}