{
	"id": "51A.386",
	"url": "https://www.revisor.mn.gov/statutes/cite/51A.386",
	"title": "51A.386 TERMS AND CONDITIONS OF LOANS, CONTRACTS, AND EXTENSIONS OF CREDIT.",
	"text": "Except as otherwise provided in this section, this section applies to loans made and contracts purchased by federal and state associations, and \"association\" as used in this section applies to federal and state associations.\nA person may enter into a credit sale contract for sale to an association and an association may purchase and enforce a contract evidencing the sale, if the annual percentage rate provided for in the contract does not exceed that permitted in section 47.59 or, in the case of contracts governed by sections 53C.01 to 53C.14, the rates permitted by those sections.\nAn association may make loans and extend credit at the rates and on the terms provided for in section 47.59.\nExtensions of credit, and purchases of extensions of credit, authorized by sections 47.20, subdivision 1, 3, or 4a; 47.204; 47.21; 47.58; 47.60; 47.69; 48.153; 48.185; 48.195; 53C.01 to 53C.14; 59A.01 to 59A.15; 334.01; 334.011; and 334.012 may, but need not, be made according to those sections in lieu of the authority set forth in subdivisions 1 to 3, and if so, are subject to those sections, and not this section, except this subdivision. An association may also charge an organization a rate of interest and any charges agreed to by the organization and may calculate and collect finance and other charges in any manner agreed to by that organization. Except for extensions of credit the association elects to make under section 334.01, 334.011, or 334.012, chapter 334 does not apply to extensions of credit made according to this section or the sections mentioned in this subdivision.\nIn addition to the finance charges permitted by this section, an association, or a person described in subdivision 2, to the extent not otherwise prohibited by law, may contract for and receive the additional charges that may be included in the amount financed provided for in section 47.59.",
	"repealed": false
}