{
	"id": "65B.472",
	"url": "https://www.revisor.mn.gov/statutes/cite/65B.472",
	"title": "65B.472 TRANSPORTATION NETWORK FINANCIAL RESPONSIBILITY.",
	"text": "(a) Unless a different meaning is expressly made applicable, the terms defined in paragraphs (b) through (p) have the meanings given them for the purposes of this section.\n(b) \"Digital network\" means any online-enabled application, software, website, or system offered or utilized by a transportation network company that enables the prearrangement of rides with transportation network company drivers.\n(c) \"Disability and income loss benefits\" has the meaning given in section 65B.44, subdivision 3, subject to the weekly maximum amount and with a maximum time period of 130 weeks after the injury.\n(d) \"P1,\" \"P2,\" and \"P3\" have the meanings given in section 181C.01, subdivision 4.\n(e) \"Funeral and burial expenses\" has the meaning given in section 65B.44, subdivision 4.\n(f) \"Medical expense benefits\" has the meaning given in section 65B.44, subdivision 2, except that payment for rehabilitative services is only required when the services are medically necessary.\n(g) \"Personal injury\" means a physical injury or mental impairment arising out of a physical injury in the course of a prearranged ride. A personal injury is only covered if the injury occurs to a driver during P2 or P3, except as provided under subdivision 2, paragraph (d). A personal injury claimant is subject to the requirements of section 65B.56.\n(h) \"Personal vehicle\" means a vehicle that is used by a TNC driver in connection with providing a prearranged ride and is:\n(1) owned, leased, or otherwise authorized for use by the driver; and\n(2) not a taxicab, limousine, for-hire vehicle, or a private passenger vehicle driven by a volunteer driver.\n(i) \"Prearranged ride\" means the provision of transportation by a driver to a rider, beginning when a driver accepts a ride requested by a rider through a digital network controlled by a transportation network company, continuing while the driver transports a requesting rider, and ending when the last requesting rider departs from the personal vehicle. A prearranged ride does not include transportation provided using a taxicab, limousine, or other for-hire vehicle.\n(j) \"Replacement services loss benefits\" has the meaning given in section 65B.44, subdivision 5, subject to the weekly maximum amount and with a maximum time period of 130 weeks after the injury.\n(k) \"Survivors economic loss benefits\" has the meaning given in section 65B.44, subdivision 6, subject to the weekly maximum amount and with a maximum time period of 130 weeks after death.\n(l) \"Survivors replacement services loss benefits\" has the meaning given in section 65B.44, subdivision 7, subject to the weekly maximum amount and with a maximum time period of 130 weeks after death.\n(m) \"Transportation network company\" or \"TNC\" means a corporation, partnership, sole proprietorship, or other entity that is operating in Minnesota that uses a digital network to connect transportation network company riders to transportation network company drivers who provide prearranged rides.\n(n) \"Transportation network company driver,\" \"TNC driver,\" or \"driver\" means an individual who:\n(1) receives connections to potential riders and related services from a transportation network company in exchange for payment of a fee to the transportation network company; and\n(2) uses a personal vehicle to provide a prearranged ride to riders upon connection through a digital network controlled by a transportation network company in return for compensation or payment of a fee.\n(o) \"Transportation network company rider,\" \"TNC rider,\" or \"rider\" means an individual or persons who use a transportation network company's digital network to connect with a transportation network driver who provides prearranged rides to the rider in the driver's personal vehicle between points chosen by the rider.\n(p) \"Volunteer driver\" means an individual who transports persons or goods on behalf of a nonprofit entity or governmental unit in a private passenger vehicle and receives no compensation for services provided other than the reimbursement of actual expenses.\n(a) A transportation network company driver or transportation network company on the driver's behalf shall maintain primary automobile insurance that recognizes that the driver is a transportation network company driver or otherwise uses a vehicle to transport passengers for compensation and covers the driver during P1, P2, and P3.\n(b) During P1, the following automobile insurance requirements apply:\n(1) primary coverage insuring against loss resulting from liability imposed by law for injury and property damage, including the requirements of section 65B.49, subdivision 3, in the amount of not less than $50,000 because of death or bodily injury to one person in any accident, $100,000 because of death or bodily injury to two or more persons in any accident, and $30,000 for injury to or destruction of property of others in any one accident;\n(2) security for the payment of basic economic loss benefits where required by section 65B.44 pursuant to the priority requirements of section 65B.47. A transportation network company and a driver, during the period set forth in this paragraph, are deemed to be in the business of transporting persons for purposes of section 65B.47, subdivision 1, and the insurance required under this subdivision shall be deemed to cover the vehicle during the period set forth in this paragraph;\n(3) primary uninsured motorist coverage and primary underinsured motorist coverage where required by section 65B.49, subdivisions 3a and 4a; and\n(4) the coverage requirements of this subdivision may be satisfied by any of the following:\n(i) automobile insurance maintained by the transportation network company driver;\n(ii) automobile insurance maintained by the transportation network company; or\n(iii) any combination of items (i) and (ii).\n(c) During P2 and P3, the following automobile insurance requirements apply:\n(1) primary coverage insuring against loss resulting from liability imposed by law for injury and property damage, including the requirements of section 65B.49, in the amount of not less than $1,500,000 for death, injury, or destruction of property of others;\n(2) security for the payment of basic economic loss benefits where required by section 65B.44 pursuant to the priority requirements of section 65B.47. A transportation network company and a transportation network company driver, during the period set forth in this paragraph, are deemed to be in the business of transporting persons for purposes of section 65B.47, subdivision 1, and the insurance required under this subdivision shall be deemed to cover the vehicle during the period set forth in this paragraph;\n(3) primary uninsured motorist coverage and primary underinsured motorist coverage where required by section 65B.49, subdivisions 3a and 4a; and\n(4) the coverage requirements of this subdivision may be satisfied by any of the following:\n(i) automobile insurance maintained by the transportation network company driver;\n(ii) automobile insurance maintained by the transportation network company; or\n(iii) any combination of items (i) and (ii).\n(d) During P2 and P3, a TNC must maintain insurance on behalf of, and at no cost to, the driver that provides reimbursement for all loss suffered through personal injury arising from the driver's work for the TNC that is not otherwise covered by the insurance required under paragraphs (b) and (c). The TNC may purchase the insurance coverage using a portion of the fare or fee paid by the rider or riders. A driver shall not be charged by the TNC or have their compensation lowered because of the insurance. The insurance coverage must be in the amount of not less than $1,000,000 per incident due to personal injury and include the following types of coverage: medical expense benefits, disability and income loss benefits, funeral and burial expenses, replacement services loss benefits, survivors economic loss benefits, and survivors replacement services loss benefits. Insurance coverage under this paragraph includes personal injury sustained while at the drop-off location immediately following the conclusion of a prearranged ride.\n(e) Any insurer authorized to write accident and sickness insurance in this state have the power to issue the blanket accident and sickness policy described in paragraph (d).\n(f) A policy of blanket accident and sickness insurance as described in paragraph (d) must include in substance the provisions required for individual policies that are applicable to blanket accident and sickness insurance and the following provisions:\n(1) a provision that the policy and the application of the policyholder constitutes the entire contract between the parties, and that, in the absence of fraud, all statements made by the policyholder are deemed representations and not warranties, and that a statement made for the purpose of affecting insurance does not avoid insurance or reduce benefits unless the statement is contained in a written instrument signed by the policyholder, a copy of which has been furnished to such policyholder; and\n(2) a provision that to the group or class originally insured be added from time to time all new persons eligible for coverage.\n(g) If an injury is covered by blanket accident and sickness insurance maintained by more than one TNC, the insurer of the TNC against whom a claim is filed is entitled to contribution for the pro rata share of coverage attributable to one or more other TNCs up to the coverages and limits in paragraph (d).\n(h) Notwithstanding any law to the contrary, amounts paid or payable under the coverages required by section 65B.49, subdivisions 3a and 4a, shall be reduced by the total amount of benefits paid or payable under insurance provided pursuant to paragraph (d).\n(i) If insurance maintained by the driver in paragraph (b) or (c) has lapsed or does not provide the required coverage, insurance maintained by a transportation network company shall provide the coverage required by this subdivision beginning with the first dollar of a claim and have the duty to defend the claim.\n(j) Coverage under an automobile insurance policy maintained by the transportation network company shall not be dependent on a personal automobile insurer first denying a claim nor shall a personal automobile insurance policy be required to first deny a claim.\n(k) Insurance required by this subdivision must satisfy the requirements of chapter 60A.\n(l) Insurance satisfying the requirements of this subdivision shall be deemed to satisfy the financial responsibility requirements under the Minnesota No-Fault Automobile Insurance Act, sections 65B.41 to 65B.71.\n(m) A transportation network company driver shall carry proof of coverage satisfying paragraphs (b) and (c) at all times during the driver's use of a vehicle in connection with a transportation network company's digital network. In the event of an accident, a transportation network company driver shall provide this insurance coverage information to the directly interested parties, automobile insurers, and investigating police officers upon request pursuant to section 65B.482, subdivision 1. Upon such request, a transportation network company driver shall also disclose to directly interested parties, automobile insurers, and investigating police officers whether the driver was logged on to the transportation network company's digital network or on a prearranged ride at the time of an accident.\nThe transportation network company shall disclose in writing to transportation network company drivers the following before they are allowed to accept a request for a prearranged ride on the transportation network company's digital network:\n(1) the insurance coverage, including the types of coverage and the limits for each coverage under subdivision 2, paragraphs (b), (c), and (d), that the transportation network company provides while the transportation network company driver uses a personal vehicle in connection with a transportation network company's digital network;\n(2) that the transportation network company driver's own automobile insurance policy might not provide any coverage while the driver is logged on to the transportation network company's digital network and is available to receive transportation requests or is engaged in a prearranged ride depending on its terms; and\n(3) that using a vehicle with a lien against the vehicle to provide prearranged rides may violate the transportation network driver's contract with the lienholder.\n(a) Insurers that write automobile insurance in Minnesota may exclude any and all coverage afforded under the owner's insurance policy for any loss or injury that occurs during P1, P2, and P3. This right to exclude all coverage may apply to any coverage included in an automobile insurance policy including, but not limited to:\n(1) liability coverage for bodily injury and property damage;\n(2) uninsured and underinsured motorist coverage;\n(3) basic economic loss benefits as defined under section 65B.44;\n(4) medical payments coverage;\n(5) comprehensive physical damage coverage; and\n(6) collision physical damage coverage.\nThese exclusions apply notwithstanding any requirement under the Minnesota No-Fault Automobile Insurance Act, sections 65B.41 to 65B.71. Nothing in this section implies or requires that a personal automobile insurance policy provide coverage during P1, P2, or P3, or while the driver otherwise uses a vehicle to transport passengers for compensation.\nNothing in this section shall be deemed to preclude an insurer from providing coverage for the transportation network company driver's vehicle, if it so chooses to do so by contract or endorsement.\n(b) Automobile insurers that exclude coverage as permitted in paragraph (a) shall have no duty to defend or indemnify any claim expressly excluded thereunder. Nothing in this section shall be deemed to invalidate or limit an exclusion contained in a policy, including any policy in use or approved for use in Minnesota prior to May 19, 2015, that excludes coverage for vehicles used to carry persons or property for a charge or available for hire by the public.\n(c) An automobile insurer that defends or indemnifies a claim against a driver that is excluded under the terms of its policy as permitted in paragraph (a) shall have a right of contribution against other insurers that provide automobile insurance to the same driver in satisfaction of the coverage requirements of subdivision 2 at the time of loss.\n(d) In a claims coverage investigation, transportation network companies and any insurer potentially providing coverage under subdivision 2 shall cooperate to facilitate the exchange of relevant information with directly involved parties and any insurer of the transportation network company driver if applicable, including the precise times that a transportation network company driver logged on and off of the transportation network company's digital network in the 12-hour period immediately preceding and in the 12-hour period immediately following the accident and disclose to one another a clear description of the coverage, exclusions, and limits provided under any automobile insurance maintained under subdivision 2.",
	"repealed": false
}