{
	"id": "66A.40",
	"url": "https://www.revisor.mn.gov/statutes/cite/66A.40",
	"title": "66A.40 MUTUAL INSURANCE HOLDING COMPANIES.",
	"text": "(a) A domestic mutual insurance company, upon approval of the commissioner, may reorganize by forming an insurance holding company based upon a mutual plan and continuing the corporate existence of the reorganizing insurance company as a stock insurance company. The commissioner, if satisfied that the interests of the policyholders are properly protected and that the plan of reorganization is fair and equitable to the policyholders, may approve the proposed plan of reorganization and may require as a condition of approval the modifications of the proposed plan of reorganization as the commissioner finds necessary for the protection of the policyholders' interests. The commissioner shall retain jurisdiction over the mutual insurance holding company according to this section and chapter 60D to assure that policyholder and member interests are protected.\n(b) All of the initial voting shares of the capital stock of the reorganized insurance company must be issued to the mutual insurance holding company or to an intermediate stock holding company. The membership interests of the policyholders of the reorganized insurance company become membership interests in the mutual insurance holding company. \"Membership interests\" means those interests described in section 66A.41, subdivision 1, paragraph (m). Policyholders of the reorganized insurance company shall be members of the mutual insurance holding company and their voting rights must be determined in accordance with the articles of incorporation and bylaws of the mutual insurance holding company. Policyholders of any other insurance company subsidiary of a mutual insurance holding company shall not be members of the mutual insurance holding company unless otherwise specified in the articles of incorporation or bylaws of the mutual insurance holding company. For purposes of this paragraph, \"other insurance company subsidiary\" means an insurance company subsidiary of a mutual insurance holding company that has not reorganized under this chapter or chapter 60A or a comparable statute in another jurisdiction. The mutual insurance holding company shall, at all times, directly or through one or more intermediate stock holding companies, control a majority of the voting shares of the capital stock of the reorganized insurance company, taking into account any potential dilution resulting from convertible securities.\n(c) A majority of the board of directors of a mutual insurance holding company must be disinterested directors. For purposes of this section, a director is disinterested if (i) the director is not or has not within the past two years been an officer or employee of the mutual insurance holding company or any subsidiary or predecessor corporation, and (ii) the director does not hold, directly or indirectly, a material ownership interest in any subsidiary of the mutual insurance holding company. An ownership interest is material if it represents more than one-half of one percent of the voting securities of the issuer, or a larger percentage as the commissioner may approve.\n(a) A domestic or foreign mutual insurance company, upon the approval of the commissioner, may reorganize by merging its policyholders' membership interests into a mutual insurance holding company formed according to subdivision 1 and continuing the corporate existence of the reorganizing insurance company as a stock insurance company subsidiary of the mutual insurance holding company or of an intermediate stock holding company. \"Membership interests\" means those interests described in section 66A.41, subdivision 1, paragraph (m). The commissioner, if satisfied that the interests of the policyholders of the reorganizing company and the interests of the existing members of the mutual insurance holding company are properly protected and that the merger is fair and equitable to those parties, may approve the proposed merger and may require as a condition of approval the modifications of the proposed merger as the commissioner finds necessary for the protection of the policyholders' or members' interests. The commissioner shall retain jurisdiction, under chapter 60D, over the mutual insurance holding company organized according to this section to assure that policyholder and member interests are protected.\n(b) All of the initial voting shares of the capital stock of the reorganized insurance company must be issued to the mutual insurance holding company, or to an intermediate stock holding company. The membership interests of the policyholders of the reorganized insurance company become membership interests in the mutual insurance holding company. Policyholders of the reorganized insurance company shall be members of the mutual insurance holding company and their voting rights must be determined according to the articles of incorporation and bylaws of the mutual insurance holding company. The mutual insurance holding company shall, at all times, directly or through one or more intermediate stock holding companies, control a majority of the voting shares of the capital stock of the reorganized insurance company, taking into account any potential dilution resulting from convertible securities.\n(c) A domestic mutual insurance holding company may merge with a domestic or foreign mutual insurance holding company in the manner prescribed for the merger of insurance companies set forth in section 60A.16, with any exceptions or modifications the commissioner may approve.\n(a) A reorganizing or merging insurer or a merging mutual insurance holding company shall, by the affirmative vote of a majority of its board of directors, adopt a plan of reorganization or merger consistent with the requirements of this section and file the plan with the commissioner. At any time before the approval of a plan by the commissioner, the company, by the affirmative vote of a majority of its directors, may amend or withdraw the plan. The plan must provide for the following:\n(1) in the case of a reorganization under subdivision 1, establishing a mutual insurance holding company with at least one stock insurance company subsidiary, or in the case of a reorganization under subdivision 2, a description of the terms and conditions of the proposed merger;\n(2) analyzing the benefits and risks attendant to the proposed reorganization, including the rationale for the reorganization and analysis of the comparative benefits and risks of a demutualization under section 66A.41;\n(3) protecting the immediate and long-term interests of existing policyholders;\n(4) ensuring immediate membership in the mutual insurance holding company of all existing policyholders of the reorganizing domestic insurance company;\n(5) describing a plan providing for membership interests of future policyholders;\n(6) describing the number of members of the board of directors of the mutual insurance holding company required to be policyholders;\n(7) describing the mutual insurance holding company's plan for distributions to members or other uses of accumulated mutual holding company earnings;\n(8) describing the nature and content of the annual report and financial statement to be sent or otherwise made available to each member;\n(9) describing a plan to send or otherwise make available to members the annual report and financial statement;\n(10) a copy of the proposed mutual insurance holding company's articles of incorporation and bylaws specifying all membership rights;\n(11) the names, addresses, and occupational information of all corporate officers and members of the proposed mutual insurance holding company board of directors;\n(12) information sufficient to demonstrate that the financial condition of the reorganizing or merging company will not be materially diminished upon reorganization, including information concerning any subsidiaries of the reorganizing or merging insurers that will become subsidiaries of the mutual insurance holding company or an intermediate holding company as part of the reorganization;\n(13) a copy of the articles of incorporation and bylaws for any proposed insurance company subsidiary or intermediate holding company subsidiary;\n(14) describing any plans for an initial sale or subscription of stock or other securities of the reorganized insurance company or any intermediate holding company; and\n(15) any other information requested by the commissioner or required by rule.\n(b) The commissioner may approve the plan upon finding that the requirements of this section have been fully met and the plan will protect the immediate and long-term interests of policyholders.\n(c) The commissioner may retain, at the reorganizing or merging mutual company's expense, any qualified experts not otherwise a part of the commissioner's staff to assist in reviewing the plan.\n(d) The commissioner may, but need not, conduct a public hearing regarding the proposed plan. The hearing must be held within 30 days after submission of a completed plan of reorganization to the commissioner. The commissioner shall give the reorganizing mutual company at least 20 days' notice of the hearing. At the hearing, the reorganizing mutual company, its policyholders, and any other person whose interest may be affected by the proposed reorganization, may present evidence, examine and cross-examine witnesses, and offer oral and written arguments or comments according to the procedure for contested cases under chapter 14. The persons participating may conduct discovery proceedings in the same manner as prescribed for the district courts of this state. All discovery proceedings must be concluded no later than three days before the scheduled commencement of the public hearing.\nThe plan by order shall be approved, conditionally approved, or disapproved within the later of 30 days from the date of the commissioner's receipt of all required information or 30 days after the conclusion of the public hearing. An approval or conditional approval of a plan of reorganization expires if the reorganization is not completed within 180 days after the approval or conditional approval unless the time period is extended by the commissioner upon a showing of good cause.\nThe plan shall be approved as provided in section 66A.41, subdivision 5, by the eligible members described in paragraphs (a) to (c).\n(a) In the case of a formation under subdivision 1, the plan must be approved by the eligible members of the reorganizing insurance company.\n(b) In the case of a merger under subdivision 2, paragraph (a), the plan must be approved by the eligible members of the merging insurance company and by the eligible members of the mutual insurance holding company into which the policyholders' membership interests are to be merged. The vote of the eligible members of the mutual insurance holding company is not required if the commissioner determines that the merger would not be material to the financial condition of the mutual insurance holding company.\n(c) In the case of a merger of two mutual insurance holding companies under subdivision 2, paragraph (c), the plan must be approved by the eligible members of both companies. The vote of the eligible members of the surviving mutual holding company is not required if the commissioner determines that the merger would not be material to the financial condition of the surviving company.\nA mutual insurance holding company shall be incorporated pursuant to section 60A.07, subdivision 1, and this chapter. The articles of incorporation and any amendments to the articles of the mutual insurance holding company are subject to approval of the commissioner in the same manner as those of an insurance company. Members of a mutual insurance holding company shall be entitled to vote on all matters required to be submitted to domestic mutual insurance company members in accordance with the requirements of this chapter and chapter 302A.\n(a) In the event of the insolvency of a mutual insurance holding company, the mutual insurance holding company is considered to be an insurer subject to chapter 60B. A mutual insurance holding company shall not dissolve or liquidate without the approval of the commissioner or as ordered by a court of competent jurisdiction.\n(b) A mutual insurance holding company is subject to chapter 60D.\n(c) As a condition to approval of the plan, the commissioner may require the mutual insurance holding company to comply with any provision of the insurance laws necessary to protect the interests of the policyholders as if the mutual insurance holding company were a domestic mutual insurance company.\n(d) No person or group of persons other than the chief executive officer of a mutual insurance holding company, or the chief executive officer's designee, shall seek to obtain proxies from the members of the mutual insurance holding company for the purposes of affecting a change of control of the mutual insurance holding company unless that person or persons have filed with the commissioner and have sent to the mutual insurance holding company a statement containing the information required by section 60D.17. Section 60D.17, subdivisions 2 to 7, apply in the event of a proxy solicitation regulated by this paragraph.\n(e) For purposes of this subdivision, the term \"control,\" including the terms \"controlling,\" \"controlled by,\" and \"under common control with,\" means the possession, direct or indirect, of the power to direct or cause the direction of the management and policies of a person, whether through membership voting interests, by contract other than a commercial contract for goods or nonmanagement services, or otherwise, unless the power is the result of an official position with, corporate office held by, or court appointment of, the person. Control is presumed to exist if any person, directly or indirectly, owns, controls, holds with the power to vote, or holds proxies representing, ten percent or more of the membership voting interests of the mutual insurance holding company. This presumption may be rebutted by a showing made in the manner provided by section 60D.19, subdivision 11, that control does not exist in fact. The commissioner may determine after furnishing all persons in interest notice and opportunity to be heard and making specific findings of fact to support the determination, that control exists in fact, notwithstanding the absence of a presumption to that effect.\n(a) Except as otherwise provided, section 66A.41 is not applicable to a reorganization or merger according to this section.\n(b) Section 66A.41 is applicable to demutualization of a mutual insurance holding company as if it were a mutual insurance company.\n(c) Section 66A.41, subdivisions 14 to 16, are applicable to a reorganization or merger under this section.\nA membership interest in a domestic mutual insurance holding company does not constitute a security as defined in section 80A.41(30). No member of a mutual insurance holding company may transfer or pledge membership in the mutual insurance holding company or any right arising from the membership except as attendant to the valid transfer or assignment of the member's policy in any reorganized company that gave rise to the member's membership interest. A member of a mutual insurance holding company is not, as a member, personally liable for the acts, debts, liabilities, or obligations of the company. No assessments of any kind may be imposed upon the members of a mutual insurance holding company by the directors or members, or because of any liability of any company owned or controlled by the mutual insurance holding company or because of any act, debt, or liability of the mutual insurance holding company. A member's interest in the mutual insurance holding company shall automatically terminate upon cancellation, nonrenewal, expiration, or termination of the member's policy in any insurance company that gave rise to the member's membership interest.\n(a) In addition to any items required under chapter 60D, each mutual insurance holding company shall file with the commissioner, by April 1 of each year, an annual statement consisting of the following:\n(1) an income statement, balance sheet, and cash flow statement prepared in accordance with generally accepted accounting principles;\n(2) complete information on the status of any closed block formed as part of a plan of reorganization;\n(3) an investment plan covering all assets; and\n(4) a statement disclosing any intention to pledge, borrow against, alienate, hypothecate, or in any way encumber the assets of the mutual insurance holding company or an intermediate stock holding company.\n(b) The aggregate pledges and encumbrances of a mutual insurance holding company's assets shall not affect more than 49 percent of the stock in ownership of any subsidiary insurance holding company or subsidiary insurance company that resulted from a reorganization or merger.\n(c) At least 50 percent of the generally accepted accounting principles (GAAP) net worth of a mutual insurance holding company must be invested in insurance company subsidiaries.\n(a) A reorganized insurance company and an intermediate stock holding company may issue subscription rights and may issue or grant any other securities, rights, options, and similar items to the same extent as any business corporation organized under chapter 302A. However, except as provided in paragraphs (b) to (d), no sale of common or preferred stock of the reorganized insurance company, or of an intermediate stock holding company that directly or indirectly controls a majority of voting shares of the reorganized insurance company, may be made without the commissioner's prior written approval.\n(b) A registration statement covering securities that has been approved by the commissioner and filed with and declared effective by the Securities and Exchange Commission under the Securities Act of 1933 pursuant to any provision of that statute or rule that allows registration of securities to be sold on a delayed or continuous basis may be sold without further approval.\n(c) Unless the commissioner has granted the mutual insurance holding company a written exemption from the requirements of this paragraph, any securities which are regularly traded on the New York Stock Exchange, the American Stock Exchange, or another exchange approved by the commissioner, or designated on the National Association of Securities Dealers automated quotations (NASDAQ) national market system, shall be sold according to the procedure in this paragraph. If the mutual insurance holding company, an intermediate holding company, or a reorganized insurance company intends to offer securities that are governed by this paragraph, that entity shall deliver to the commissioner, not less than ten days before the offering, a notice of the planned offering and information regarding: (1) the approximate number of shares intended to be offered; (2) the target date of sale; (3) evidence the security is regularly traded on one of the public exchanges noted above; and (4) the recent history of the trading price and trading volume of the security. The commissioner is considered to have approved the sale unless within ten days following receipt of the notice, the commissioner issues an objection to the sale. If the commissioner issues an objection to the sale, the security may not be sold until the commissioner issues an order approving the sale.\n(d) A reorganized insurance company or intermediate holding company that has issued securities that are regularly traded on one of the exchanges or markets described in paragraph (c), may establish stock option, incentive, and share ownership plans customary for publicly traded companies in the same or similar industries. If the reorganized insurance company or intermediate holding company intends to establish a stock option, incentive or share ownership plan, that entity shall deliver to the commissioner, not less than 30 days before the establishment of the plan, a notice of the proposed plan along with any information about the proposed plan the commissioner requires. The commissioner is considered to have approved the plan unless within 30 days following receipt of the notice, the commissioner issues an objection to the proposed plan. If the commissioner issues an objection to the proposed plan, the plan may not be established until the commissioner issues an order approving the plan. If the commissioner approves the establishment of the stock option, incentive, or share ownership plan, the reorganized insurance company or the intermediate holding company that obtained the approval may sell or issue securities according to the approved plan without further approval.\n(e) The total number of shares of capital stock issued by the reorganized insurance company or an intermediate holding company that may be held by directors and officers of the mutual insurance holding company, any intermediate holding company, and of any reorganized insurance company, and acquired according to subscription rights or stock option, incentive, and share ownership plans, may not exceed the percentage limits set forth in section 66A.41, subdivision 11, paragraph (b). Subject to the requirements of subdivision 1, paragraph (c), nothing in this section prohibits the acquisition of any securities of a reorganized insurance company or intermediate stock holding company through a licensed securities broker-dealer by any officer or director of the reorganized company, an intermediate stock holding company, or the mutual insurance holding company.\n(f) Dividends and other distributions to the shareholders of the reorganized stock insurance company or of an intermediate stock holding company must comply with section 60D.20. Any dividends and other distributions to the members of the mutual insurance holding company must comply with section 60D.20 and any other approval requirements contained in the mutual insurance holding company's articles of incorporation.\n(g) Unless previously approved as part of the plan of reorganization, the initial offering of any voting shares to the public by a reorganized company, a stock insurance company subsidiary, or an intermediate holding company which holds a majority of the voting shares of a reorganized insurance company or stock insurance company subsidiary, must be approved by a majority of votes cast at a regular or special meeting of the members of the mutual insurance holding company. Any issuer repurchase program, plan of exchange, recapitalization, or offering of capital securities to the public, shall, in addition to any other approvals required by law or by the issuer's articles of incorporation, be approved by a majority of the board of directors of the mutual insurance holding company and by a majority of the disinterested members of the board of directors of the mutual insurance holding company.\n(a) In the event of any insolvency proceeding involving an insolvent stock subsidiary, the assets of the mutual insurance holding company, together with any assets of any intermediate holding company that directly or indirectly controls the insolvent stock subsidiary, must be available to satisfy the policyholder obligations of the insolvent stock subsidiary in an amount determined by the commissioner, but in no event more than the total amount of nonpolicyholder dividends paid by the insolvent stock subsidiary to the mutual insurance holding company, or any intermediate holding company that controls the insolvent stock subsidiary, during the ten-year period immediately preceding the date of insolvency.\n(b) In determining the required contribution by the mutual insurance holding company or any intermediate stock holding company which controls the insolvent stock subsidiary, the commissioner shall take into account among other factors:\n(1) the possible direct or indirect negative effects of any required contribution on any insurance company affiliate of the insolvent stock subsidiary; and\n(2) the possible direct or indirect, long-term, or short-term negative effects on the members of the mutual insurance holding company, other than those members who, are, or were policyholders of the insolvent stock subsidiary.\nNothing in this subdivision limits the powers of the commissioner or the liquidator under chapter 60B.\n(c) For purposes of this subdivision, the following terms have the meanings given:\n(1) \"date of insolvency\" means, as to an insolvent stock subsidiary, the date established in accordance with chapter 60B or comparable statute of another state governing the rehabilitation or liquidation of a foreign insolvent stock subsidiary;\n(2) \"insolvency proceeding\" means any proceeding under chapter 60B or comparable statute of another state governing the rehabilitation and liquidation of a foreign insolvent stock subsidiary;\n(3) \"insolvent stock subsidiary\" means any stock insurance company subsidiary of a mutual insurance holding company that resulted from the reorganization of a domestic or foreign mutual insurance company according to subdivision 1 or 2, or any other stock insurance company subsidiary that is subject to an insolvency proceeding, which on the date of insolvency has in force policies that have given rise to membership interests in the mutual insurance holding company;\n(4) \"control\" has the meaning given in section 60D.15, subdivision 4; and\n(5) \"dividends\" include distributions of cash or any other assets.\n(a) With the approval of the commissioner, a domestic insurance company that previously reorganized under this section into a stock subsidiary of a mutual insurance holding company may convert back into a mutual insurance company. It shall effect the conversion by merging with its parent mutual insurance holding company (a \"parent mutual\"), but only if the parent mutual owns or controls, directly or indirectly, all of the voting shares of capital stock of the reorganized insurance company. The reorganized subsidiary, as the surviving company, shall continue its corporate existence as a domestic mutual insurance company (a \"remutualized company\"). A conversion under this subdivision may, but need not, occur in connection with the simultaneous or subsequent merger of the remutualized company with a domestic or foreign mutual insurance company. Section 66A.42 is not applicable to a conversion under this subdivision.\n(b) The conversion can be effected by the parent mutual pursuant to a plan of conversion adopted as follows:\n(1) The parent mutual shall, by the affirmative vote of a majority of its board of directors, adopt a plan of conversion consistent with the requirements of this subdivision.\n(2) The parent mutual, by the affirmative vote of a majority of its board of directors, may amend the plan at any time before approval of the plan by the commissioner and may withdraw the plan at any time before the effective date of the plan.\n(3) The duties of the board of directors of the parent mutual, in considering or acting upon a proposed plan of conversion or related transaction, shall be as set forth in section 302A.251 and, to the extent not inconsistent with that section, the parent mutual's articles of incorporation and bylaws.\n(c) The parent mutual shall file with the commissioner an application for approval of, and permission to carry out the reorganization according to, the plan of conversion. The application must include the following:\n(1) the plan of conversion;\n(2) the form of notice of meeting for eligible members to vote on the plan;\n(3) the form of any proxies to be solicited from eligible members;\n(4) the proposed articles of incorporation and bylaws of the remutualized company;\n(5) information required under chapter 60D if the plan results in a change of control of the remutualizing company;\n(6) if required by the commissioner, an independent actuarial opinion on matters affecting the structure or fairness of the plan; and\n(7) other information or documentation required by the commissioner or required by rule.\n(d) The commissioner shall determine, within 30 days of submission of the application, whether the application is complete.\n(e) If the plan of conversion proposes a simultaneous merger of the remutualized company with a foreign or domestic mutual insurance company, the commissioner may conduct concurrent proceedings under this subdivision and section 60A.16.\n(f) The commissioner may retain, at the parent mutual's expense, qualified experts not otherwise a part of the commissioner's staff, including without limitation, actuaries, accountants, investment bankers, and attorneys, to assist in reviewing the plan and supplemental materials and valuations.\n(g) The commissioner may, but need not, conduct a public hearing regarding the proposed plan of conversion. If a hearing is to be held, the commissioner shall designate a date for the public hearing promptly upon determining that the application is complete and that the forms of notice are adequate. The public hearing must be held on one or more days, the first beginning within 90 days after the date on which the commissioner determines the application is complete, unless the parent mutual requests, and the commissioner agrees to, a longer period for the purpose of preparing and distributing the notices required by this paragraph and by paragraph (i), clause (1). The hearing shall be in the nature of a legislative hearing and shall not constitute or be considered a contested case under chapter 14. The hearing may be conducted by the commissioner or by a person designated by the commissioner, which designee may be an administrative law judge. The parent mutual shall provide its eligible members with at least 45 days' notice of the hearing, the notice to be in the form, and provided in a manner, approved by the commissioner. The purpose of the hearing is to receive comments and information for the purpose of aiding the commissioner in making a decision on the plan of conversion. Persons wishing to make comments and submit information may submit written statements before the public hearing and may appear and be heard at the hearing. The commissioner's order or determination must be issued within 45 days after the closing of the record of the hearing by the commissioner or the hearing officer, as applicable, which record must not be closed until the record includes certification of the vote on the plan of conversion by the eligible members of the parent mutual. The commissioner shall issue a written decision detailing the reasons why the parent mutual company's plan of conversion is approved or disapproved.\n(h) The commissioner shall approve the application and permit the conversion according to the plan if the commissioner finds that:\n(1) the provisions of this subdivision have been fully met; and\n(2) the plan is not unfair or inequitable to the members of the parent mutual.\nThe commissioner's order approving or disapproving a plan of conversion is a final agency decision subject to appeal according to sections 14.63 to 14.68.\n(i)(1) No later than 90 days following the date of the public hearing, if any, or the date the commissioner determines the application is complete if no hearing is held, the parent mutual shall give all eligible members notice of a regular or special meeting of the members called for the purpose of considering the plan and any corporate actions that are a part of, or are reasonably attendant to, the accomplishment of the plan, including without limitation, any proposed merger of the remutualizing company with a domestic or foreign mutual insurance company.\n(2) A copy of the plan or a summary of the plan must accompany the notice. The notice must be mailed to each eligible member's last known address, as shown on the parent mutual's records, not less than 45 days before the date of the meeting, unless the commissioner directs a later date for mailing. If the meeting to vote upon the plan is held coincident with the parent mutual's annual meeting of members, only one combined notice of meeting is required. The notice of the meeting of eligible members may be combined with the notice of hearing described in paragraph (g).\n(3) If the parent mutual complies substantially and in good faith with the notice requirements of this section, the parent mutual's failure to give any member or members required notice does not impair the validity of an action taken under this section.\n(j)(1) The plan must be adopted upon receiving the affirmative vote of a majority of the votes cast by eligible members.\n(2) Eligible members may vote in person or by proxy. The form of any proxy must be filed with and approved by the commissioner.\n(k)(1) Following approval by the eligible members, the parent mutual shall file a copy of the converting subsidiary's amended or restated articles of incorporation with the commissioner, together with a certified copy of the minutes of the meeting of the members of the parent mutual at which the plan was adopted and a certified copy of the plan. The commissioner shall review and, if appropriate, approve the amended or restated articles. After approval by the commissioner, the parent mutual shall file the articles with the secretary of state as provided by section 60A.07, subdivision 1d, and chapter 302A.\n(2) The conversion is effective on the date of filing an amendment or restatement of the articles of incorporation with the secretary of state, or on a later date if the plan so specifies.\n(l) Upon the effective date of the conversion in accordance with this subdivision:\n(1) The corporate existence of the parent mutual is continued in the converted subsidiary. All the rights, privileges, powers, franchises, and interests of the parent mutual in and to all property and things in action belonging to the parent company are considered transferred to and vested in the converted subsidiary without any deed or transfer. Simultaneously, the converted subsidiary is considered to have assumed all the obligations and liabilities of the parent mutual.\n(2) The directors and officers of the parent mutual, unless otherwise specified in the plan of conversion, shall serve as directors and officers of the converted subsidiary until new directors and officers of the converted subsidiary are duly elected according to the articles of incorporation and bylaws of the converted subsidiary.\n(3) All policies issued by the converted subsidiary in force on the effective date of the conversion remain in force subject to the terms of those policies, except that the membership interests in the parent mutual shall become membership interests in the converted subsidiary, and member voting rights in the converted subsidiary shall be exclusively governed by the converted subsidiary's articles and bylaws.\n(4) Except as otherwise provided in the plan of conversion, the converted subsidiary is no longer subject to the requirements of subdivisions 1 to 12 or to the terms of the original plan of reorganization.\n(5) At the effective time of the merger, all of the voting shares of capital stock of the converted subsidiary shall be deemed to be redeemed and canceled.\n(6) Any provisions of the original plan of reorganization pertaining to the protection of reasonable policyholder dividend expectations may be continued, modified, or extinguished as provided under the plan of conversion and approved by the commissioner.\n(m) No director, officer, agent, employee of the parent mutual or the converting subsidiary, or any other person shall receive a fee, commission, or other valuable consideration, other than the person's usual regular salary and compensation, for in any manner aiding, promoting, or assisting in the conversion except as set forth in the plan approved by the commissioner. This provision does not prohibit the payment of reasonable fees and compensation to attorneys, accountants, investment bankers, and actuaries for services performed in the independent practice of their professions.\n(n) All the costs and expenses connected with a plan of conversion must be paid for or reimbursed by the parent mutual or converted subsidiary except where the plan provides otherwise.\n(o)(1) An action challenging the validity of or arising out of acts taken or proposed to be taken according to this section must be commenced within 180 days after the effective date of the conversion.\n(2) The parent mutual, the converted subsidiary, or any defendant in an action described in clause (1) may petition the court in the action to order a party to give security for the reasonable attorney fees that may be incurred by a party to the action. The amount of security may be increased or decreased in the discretion of the court having jurisdiction if a showing is made that the security provided is or may become inadequate or excessive.\n(p) For purposes of this subdivision, the following terms have the meanings given.\n(1) \"Eligible member\" means a person who is a member of the parent mutual, as defined by the parent mutual's articles of incorporation and bylaws, determined as of the record date.\n(2) \"Membership interests\" means all rights as members of the parent mutual, including, but not limited to, the rights to vote.\n(3) \"Plan of conversion\" or \"plan\" means a plan adopted by a parent mutual's board of directors under this section.\n(4) \"Record date\" means the date that the parent mutual's board of directors adopts a plan of conversion, unless another date is specified in the plan of conversion and approved by the commissioner.\n(5) \"Converted subsidiary\" means a converting subsidiary that has converted into a mutual insurance company under this subdivision.\n(6) \"Converting subsidiary\" means a Minnesota domestic insurance company that previously reorganized under this section that is seeking to convert back into a mutual insurance company in accordance with this subdivision.",
	"repealed": false
}