{
	"id": "84.777",
	"url": "https://www.revisor.mn.gov/statutes/cite/84.777",
	"title": "84.777 OFF-HIGHWAY VEHICLES AND SNOWMOBILES; USE OF STATE LANDS RESTRICTED.",
	"text": "(a) Except as otherwise allowed by law or rules adopted by the commissioner, effective June 1, 2003, notwithstanding sections 84.787 to 84.804 and 84.92 to 84.928, the use of off-highway vehicles is prohibited on state land administered by the commissioner of natural resources, and on county-administered forest land within the boundaries of a state forest, except on roads and trails specifically designated and posted by the commissioner for use by off-highway vehicles.\n(b) Paragraph (a) does not apply to county-administered land within a state forest if the county board adopts a resolution that modifies restrictions on the use of off-highway vehicles on county-administered land within the forest.\n(a) Except for designated forest roads, a person must not operate an off-highway vehicle or snowmobile on state forest lands during the firearms deer-hunting season in areas of the state where deer may be taken by rifle. This paragraph does not apply to a person in possession of a valid deer-hunting license operating an off-highway vehicle or snowmobile before or after legal shooting hours or from 11:00 a.m. to 2:00 p.m.\n(b) The commissioner may designate and post winter trails on state forest lands for use by off-highway vehicles.\n(c) For the purposes of this subdivision, \"state forest lands\" means forest lands under the authority of the commissioner as defined in section 89.001, subdivision 13, and lands managed by the commissioner under section 282.011.\n(a) Except as provided in sections 84.926 and 84.928, after completion of official department off-highway vehicle maps for the area, a person must not operate an off-highway vehicle on state land that is not mapped for the type of off-highway vehicle. This paragraph does not apply to state forest land north of U.S. Highway 2 until after June 30, 2009.\n(b) This subdivision does not apply to a forest access route in a managed forest north of U.S. Highway 2 that the commissioner has not designated as a road or trail. Forest access routes will not be signed or maintained and will not be included on published user maps of the forest. Off-highway vehicle operation on forest access routes is subject to the prohibitions on causing erosion, rutting, damage to trees or crops, and construction of unauthorized trails contained in Minnesota Rules. Damaged routes are subject to closure to off-highway vehicle use.\nDeterminations of the commissioner under this section may be by written order published in the State Register and are exempt from the rulemaking provisions of chapter 14. Section 14.386 does not apply.",
	"repealed": false
}