{
	"id": "136A.828",
	"url": "https://www.revisor.mn.gov/statutes/cite/136A.828",
	"title": "136A.828 PROHIBITIONS.",
	"text": "Private career schools, agents of private career schools, and solicitors may not advertise or represent in writing or orally that the private career school is approved or accredited by the state of Minnesota, except that any private career school, agent, or solicitor may represent in advertisements and shall disclose in catalogues, applications, and enrollment materials that the private career school is duly licensed by the state by prominently displaying the following statement:\n\"(Name of private career school) is licensed as a private career school with the Minnesota Office of Higher Education pursuant to Minnesota Statutes, sections 136A.821 to 136A.832. Licensure is not an endorsement of the institution. Credits earned at the institution may not transfer to all other institutions.\"\nNo private career school organized after November 15, 1969, shall apply to itself either as a part of its name or in any other manner the designation of \"college\" or \"university.\" Operating private career schools now using such designation may continue use thereof.\n(a) A private career school, agent, or solicitor shall not make, or cause to be made, any statement or representation, oral, written or visual, in connection with the offering or publicizing of a program, if the private career school, agent, or solicitor knows or reasonably should have known the statement or representation to be false, fraudulent, deceptive, substantially inaccurate, or misleading.\n(b) Other than opinion-based statements or puffery, a school shall only make claims that are evidence-based, can be validated, and are based on current conditions and not on conditions that are no longer relevant.\n(c) A school shall not guarantee or imply the guarantee of employment.\n(d) A school shall not guarantee or advertise any certain wage or imply earnings greater than the prevailing wage for entry-level wages in the field of study for the geographic area unless advertised wages are based on verifiable wage information from graduates.\n(e) If placement statistics are used in advertising or other promotional materials, the school must be able to substantiate the statistics with school records. These records must be made available to the office upon request. A school is prohibited from reporting the following in placement statistics:\n(1) a student required to receive a job offer or start a job to be classified as a graduate;\n(2) a graduate if the graduate held a position before enrolling in the program, unless graduating enabled the graduate to maintain the position or the graduate received a promotion or raise upon graduation;\n(3) a graduate who works less than 20 hours per week; and\n(4) a graduate who is not expected to maintain the position for at least 180 days.\n(f) A school shall not use endorsements, commendations, or recommendations by a student in favor of a school except with the consent of the student and without any offer of financial or other material compensation. Endorsements may be used only when they portray current conditions.\n(g) A school may advertise that the school or its programs have been accredited by an accrediting agency recognized by the United States Department of Education or the Council for Higher Education Accreditation, but shall not advertise any other accreditation unless approved by the office. The office may approve an institution's advertising of accreditation that is not recognized by the United States Department of Education or the Council for Higher Education if that accreditation is industry specific. Clear distinction must be made when the school is in candidacy or application status versus full accreditation.\n(h) A school may advertise that financial aid is available, including a listing of the financial aid programs in which the school participates, but federal or state financial aid shall not be used as a primary incentive in advertisement, promotion, or recruitment.\n(i) A school may advertise placement or career assistance, if offered, but shall not use the words \"wanted,\" \"help wanted,\" or \"trainee,\" either in the headline or the body of the advertisement.\n(j) A school shall not be advertised under any \"help wanted,\" \"employment,\" or similar classification.\n(k) A school shall not falsely claim that it is conducting a talent hunt, contest, or similar test.\n(l) A school shall not make a claim that its program qualifies for a national certification if that national certification entity is not accepted or recognized by Minnesota employers. A school may validate that a national certification is accepted or recognized by Minnesota employers by providing three certified letters from employers that the national certification entity is recognized in Minnesota by employers.\n(m) The commissioner, at any time, may require a retraction of a false, misleading, or deceptive claim. To the extent reasonable, the retraction must be published in the same manner as the original claim.\nNo private career school shall accept contracts, enrollment agreements or enrollment applications from an agent or solicitor who does not have a current permit.\nA private career school, agent, or solicitor shall not enroll a prospective student when it is obvious that the prospective student is unlikely to successfully complete a program or is unlikely to qualify for employment in the vocation or field for which the preparation is designed unless this fact is affirmatively disclosed to the prospective student. If a prospective student expresses a desire to enroll after such disclosure, a disclaimer may be obtained by the private career school. The disclaimer shall be signed by the student and shall state substantially one or both of the following: \"I am fully aware that it is unlikely I will be able to successfully complete the program\" and \"I am fully aware of the improbability or impossibility that I will qualify for employment in the vocation or field for which the program was designed.\"\n(a) All private career schools must collect, assess, and distribute funds received from loans or other financial aid as provided in this subdivision.\n(b) Student loans or other financial aid funds received from federal, state, or local governments or administered in accordance with federal student financial assistance programs under title IV of the Higher Education Act of 1965, as amended, United States Code, title 20, chapter 28, must be collected and applied as provided by applicable federal, state, or local law or regulation.\n(c) Student loans or other financial aid assistance received from a bank, finance or credit card company, or other private lender must be collected or disbursed as provided in paragraphs (d) and (e).\n(d) Loans or other financial aid payments for amounts greater than $3,000 must be disbursed:\n(1) in two equal disbursements, if the term length is more than four months. The loan or payment amounts may be disbursed no earlier than the first day the student attends class with the remainder to be disbursed halfway through the term; or\n(2) in three equal disbursements, if the term length is more than six months. The loan or payment amounts may be disbursed no earlier than the first day the student attends class, one-third of the way through the term, and two-thirds of the way through the term.\n(e) Loans or other financial aid payments for amounts less than $3,000 may be disbursed as a single disbursement on the first day a student attends class, regardless of term length.\n(f) No private career school may enter into a contract or agreement with, or receive any money from, a bank, finance or credit card company, or other private lender, unless the private lender follows the requirements for disbursements provided in paragraphs (d) and (e).\n(g) No private career school may withhold an official transcript for arrears or default on any loan made by the private career school to a student if the loan qualifies as an institutional loan under United States Code, title 11, section 523(a)(8)(b).\nNo private career school shall use nondisclosure agreements or other contracts restricting a student's ability to disclose information in connection with school actions or conduct that would be covered under section 136A.8295.",
	"repealed": false
}