{
	"id": "169.444",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.444",
	"title": "169.444 SAFETY OF SCHOOL CHILDREN; DUTIES OF OTHER DRIVERS.",
	"text": "When a school bus is stopped on a street or highway, or other location where signs have been erected under section 169.443, subdivision 2, paragraph (b), and is displaying an extended stop-signal arm and flashing red lights, the driver of a vehicle approaching the bus shall stop the vehicle at least 20 feet away from the bus. The vehicle driver shall not allow the vehicle to move until the school bus stop-signal arm is retracted and the red lights are no longer flashing.\nNo person may pass or attempt to pass a school bus in a motor vehicle on the right-hand, passenger-door side of the bus when the school bus is displaying the prewarning flashing amber signals as required in section 169.443, subdivision 1.\n(a) A person who fails to stop a vehicle or to keep it stopped, as required in subdivision 1, or who violates subdivision 1a, is guilty of a misdemeanor punishable by a fine of not less than $500.\n(b) A person is guilty of a gross misdemeanor if the person fails to stop a motor vehicle or to keep it stopped, as required in subdivision 1, or who violates subdivision 1a, and commits either or both of the following acts:\n(1) passes or attempts to pass the school bus in a motor vehicle on the right-hand, passenger-door side of the bus; or\n(2) passes or attempts to pass the school bus in a motor vehicle when a school child is outside of and on the street or highway used by the school bus or on the adjacent sidewalk.\n(a) The attorney in the jurisdiction in which the violation occurred who is responsible for prosecution of misdemeanor violations of this section shall also be responsible for prosecution of gross misdemeanor violations of this section.\n(b) When an attorney responsible for prosecuting gross misdemeanors under this section requests criminal history information relating to prior convictions under this section from a court, the court must furnish the information without charge.\n(a) A person driving a vehicle on a street or highway with separated roadways is not required to stop the vehicle when approaching or meeting a school bus that is on a different roadway.\n(b) \"Separated roadway\" means a road that is separated from a parallel road by a physical barrier, raised median, or depressed median.\nA peace officer may arrest the driver of a motor vehicle if the peace officer has probable cause to believe that the driver has operated the vehicle in violation of subdivision 1 or 1a within the past four hours.\n(a) If a motor vehicle is operated in violation of subdivision 1 or 1a, the owner of the vehicle, or for a leased motor vehicle the lessee of the vehicle, is guilty of a petty misdemeanor.\n(b) The owner or lessee may not be fined under paragraph (a) if (1) another person is convicted for that violation, or (2) the motor vehicle was stolen at the time of the violation.\n(c) Paragraph (a) does not apply to a lessor of a motor vehicle if the lessor keeps a record of the name and address of the lessee.\n(d) Paragraph (a) does not prohibit or limit the prosecution of a motor vehicle operator for violating subdivision 1 or 1a.\n(e) A violation under paragraph (a) does not constitute grounds for revocation or suspension of the owner's or lessee's driver's license.\n(a) There is a rebuttable presumption that signals described in section 169.442 were in working order and operable when a violation of subdivision 1, 1a, 2, or 5 was allegedly committed, if the signals of the applicable school bus were inspected and visually found to be in working order and operable within 12 hours preceding the incident giving rise to the violation.\n(b) There is a rebuttable presumption that a motor vehicle outwardly equipped and identified as a school bus satisfies all of the identification and equipment requirements of section 169.441 when a violation of subdivision 1, 1a, 2, or 5 was allegedly committed, if the applicable school bus bears a current inspection certificate issued under section 169.451.\nWhen necessary or desirable to ensure that a school bus driver who witnessed or otherwise can provide relevant information concerning a violation of this section is available to be present at a court proceeding held to determine an alleged violation of this section, the court administrator shall schedule the proceeding to be held between the hours of 10:00 a.m. and 2:00 p.m.",
	"repealed": false
}