{
	"id": "471.57",
	"url": "https://www.revisor.mn.gov/statutes/cite/471.57",
	"title": "471.57 PUBLIC WORKS RESERVE FUND.",
	"text": "The council of any city, however organized, may establish by ordinance a public works reserve fund and may annually levy taxes within existing charter limits for the support of such fund. It may, by the ordinance establishing the fund, designate a specific capital improvement or a type of capital improvement for which the fund is to be used. The proceeds of taxes levied for its support shall be paid into the public works reserve fund. There may be paid into such fund any other revenue not required by statute or charter to be paid into some other fund or used for purposes other than those provided in this section for the use of the public works reserve fund.\nExcept as provided in subdivision 3, the public works reserve fund shall be used only for the specific capital improvement or type of capital improvement designated by the ordinance establishing the fund. If not so designated, it shall be used only for capital improvements of a type for which the municipality establishing the fund is authorized to issue bonds. The term \"capital improvement\" does not include the construction or acquisition of any steam heat, telephone, gas or electric plant or system. No expenditures shall be made from the public works reserve fund before the first fiscal year following cessation of hostilities in the present war as declared by proper federal authority.\nThe council of any municipality which has established a public works reserve fund by an ordinance designating the specific improvement or type of capital improvement for which the fund may be used may submit to the voters of the municipality at any regular or special election the question of using the fund for some other purpose. If a majority of the votes cast on the question are in favor of such diversion from the original purpose of the fund, it may be used for any purpose so approved by the voters.",
	"repealed": false
}