{
	"id": "13.585",
	"url": "https://www.revisor.mn.gov/statutes/cite/13.585",
	"title": "13.585 HOUSING AGENCY DATA.",
	"text": "For purposes of this section \"housing agency\" means the public housing agency or housing and redevelopment authority of a political subdivision.\nThe following data on individuals maintained by the housing agency are confidential data: correspondence between the agency and the agency's attorney containing data collected as part of an active investigation undertaken for the purpose of the commencement or defense of potential or actual litigation, including but not limited to: referrals to the Office of the Inspector General or other prosecuting agencies for possible prosecution for fraud; initiation of lease terminations and eviction actions; admission denial hearings concerning prospective tenants; commencement of actions against independent contractors of the agency; and tenant grievance hearings.\nThe following data not on individuals maintained by the housing agency are protected nonpublic data, pursuant to section 13.02, subdivision 13: correspondence between the agency and the agency's attorney containing data collected as part of an active investigation undertaken for the purpose of the commencement or defense of potential or actual litigation, including but not limited to, referrals to the Office of the Inspector General or other prosecuting bodies or agencies for possible prosecution for fraud and commencement of actions against independent contractors of the agency.\nThe following data not on individuals maintained by the housing agency are classified as nonpublic data, pursuant to section 13.02, subdivision 9: all data pertaining to negotiations with property owners regarding the purchase of property. With the exception of the housing agency's evaluation of properties not purchased, all other negotiation data shall be public at the time of the closing of the property sale.\nIncome information on individuals collected and maintained by a housing agency to determine eligibility of property for class 4d under sections 273.128 and 273.13, is private data on individuals as defined in section 13.02, subdivision 12. The data may be disclosed to the county and local assessors responsible for determining eligibility of the property for classification 4d.\nA public housing agency that enters a contract for assistance under United States Code, title 42, sections 1437 to 1440, shall furnish a local, state, or federal law enforcement officer, upon the officer's request, with the current address, Social Security number, and photograph, if available, of a recipient of assistance under United States Code, title 42, sections 1437 to 1440, if the officer:\n(1) provides the name of the recipient to the housing agency; and\n(2) notifies the agency that:\n(i) the recipient:\n(A) is fleeing to avoid prosecution, or custody or confinement after conviction, under the laws of the jurisdiction from which the individual is fleeing, for a crime which is a felony under the laws of that jurisdiction;\n(B) is violating a condition of probation or parole imposed under state or federal law;\n(C) is a person required to register under section 243.166 and is not residing at the address at which the person is registered under section 243.166; or\n(D) has information necessary for the officer to conduct the officer's official duties;\n(ii) the location or apprehension of the individual is within the officer's official duties; and\n(iii) the request is made in writing and in the proper exercise of the officer's official duties.",
	"repealed": false
}