{
	"id": "58.16",
	"url": "https://www.revisor.mn.gov/statutes/cite/58.16",
	"title": "58.16 RESIDENTIAL MORTGAGE ORIGINATORS; STANDARDS OF CONDUCT FOR AGENCY OR ADVANCE FEE TRANSACTIONS.",
	"text": "Residential mortgage originators who solicit or receive an advance fee in exchange for assisting a borrower located in this state in obtaining a loan secured by a lien on residential real estate, or who offer to act as an agent of the borrower located in this state in obtaining a loan secured by a lien on residential real estate shall be considered to have created a fiduciary relationship with the borrower and shall comply with the requirements of subdivisions 2 to 7. This section does not apply to mortgage brokers who do not solicit or receive an advance fee.\n(a) A residential mortgage originator who engages in the activities described in subdivision 1 shall enter into a written contract with each borrower and shall provide a copy of the written contract to each borrower at or before the time of receipt of any fee or valuable consideration paid for mortgage origination services. The written contract must:\n(1) specifically describe the services to be provided by the residential mortgage originator and if the originator collects an advance fee, the dates by which the services will be performed;\n(2) specifically identify whether the residential mortgage originator may receive compensation from sources other than the borrower in connection with the loan transaction;\n(3) state the total amount of commission or compensation that the borrower agrees to pay for the residential mortgage originator's services, or the basis on which the compensation will be computed;\n(4) state the maximum rate of interest to be charged on any residential mortgage loan obtained;\n(5) contain a statement that notifies the borrower of the right to cancel the contract according to subdivision 3 and disclose the cancellation rights and procedures provided in subdivision 3; and\n(6) disclose, with respect to the 12-month period ending ten business days before the date of the contract in question, the percentage of the mortgage originator's customers for whom loans have actually been funded as a result of the residential mortgage originator's services.\n(b) If an advance fee is solicited or received the contract must also:\n(1) identify the trust account into which the fees or consideration will be deposited;\n(2) set forth the circumstances under which the residential mortgage originator will be entitled to disbursement from the trust account; and\n(3) set forth the circumstances under which the borrower will be entitled to a refund of all or part of the fee.\nA borrower who pays an advance fee, or who enters into a contract for residential mortgage services as set forth in subdivisions 1 and 2, has an unconditional right to rescind the contract for residential mortgage origination services at any time until midnight of the third business day after the day on which the contract is signed. Cancellation is evidenced by the borrower giving written notice of cancellation to the residential mortgage originator at the address stated in the contract. Notice of cancellation, if given by mail, is effective upon deposit in a mailbox properly addressed to the originator with postage prepaid. Notice of cancellation need not take a particular form and is sufficient if it indicates by any form of written expression the intention of the borrower not be bound by the contract. No act of a borrower or a residential mortgage originator is effective to waive the right to rescind as provided in this subdivision.\nThe residential mortgage originator shall deposit in a trust account within three business days all fees received before the time a loan is actually funded. The trust account must be in a financial institution located within the state of Minnesota, and, with respect to advance fees, the account must be controlled by an unaffiliated accountant, attorney, or bank.\nThe residential mortgage originator shall maintain a separate record of all fees received for services performed or to be performed as a residential mortgage originator. Each record must set forth the date the funds are received; the person from whom the funds are received; the amount received; the date of deposit in the escrow account, the account number, the date the funds are disbursed and the check number of the disbursement, and a description of each disbursement and the justification for the disbursement.\nThe residential mortgage originator shall provide to each borrower at least monthly a detailed written accounting of all disbursements of the borrower's funds from the trust account.\nThe residential mortgage originator shall provide to each borrower at the expiration of the contract a list of the lenders or loan sources to whom loan applications were submitted on behalf of the borrower.",
	"repealed": false
}