{
	"id": "14.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/14.48",
	"title": "14.48 OFFICE OF ADMINISTRATIVE HEARINGS.",
	"text": "A state Office of Administrative Hearings is created.\n(a) The office shall be under the direction of a chief administrative law judge who shall be learned in the law and appointed by the governor, with the advice and consent of the senate, for a term ending on June 30 of the sixth calendar year after appointment. Senate confirmation of the chief administrative law judge shall be as provided by section 15.066.\n(b) The chief administrative law judge may hear cases and, in accordance with chapter 43A, shall appoint a deputy chief judge and additional administrative law judges and compensation judges to serve in the office as necessary to fulfill the duties of the Office of Administrative Hearings.\n(c) The chief administrative law judge may delegate to a subordinate employee the exercise of a specified statutory power or duty as deemed advisable, subject to the control of the chief administrative law judge. Every delegation must be by written order filed with the secretary of state. The chief administrative law judge is subject to the provisions of the Minnesota Constitution, article VI, section 6, the jurisdiction of the Board on Judicial Standards, and the provisions of the Code of Judicial Conduct.\n(d) If a vacancy in the position of chief administrative law judge occurs, an acting or temporary chief administrative law judge must be named as follows:\n(1) at the end of the term of a chief administrative law judge, the incumbent chief administrative law judge may, at the discretion of the appointing authority, serve as acting chief administrative law judge until a successor is appointed; and\n(2) if at the end of a term of a chief administrative law judge the incumbent chief administrative law judge is not designated as acting chief administrative law judge, or if a vacancy occurs in the position of chief administrative law judge, the deputy chief judge shall immediately become temporary chief administrative law judge without further official action.\n(e) The appointing authority of the chief administrative law judge may appoint a person other than the deputy chief judge to serve as temporary chief administrative law judge and may replace any other acting or temporary chief administrative law judge designated pursuant to paragraph (d), clause (1) or (2).\n(a) All administrative law judges and compensation judges shall be in the classified service except that the chief administrative law judge shall be in the unclassified service, but may be removed only for cause.\n(b) All administrative law judges and workers' compensation judges must be learned in the law and must be free of any political or economic association that would impair their ability to function in a fair and impartial manner. Administrative law judges shall have demonstrated knowledge of administrative procedures and workers' compensation judges shall have demonstrated knowledge of workers' compensation laws.\n(c) Only compensation judges shall conduct administrative conferences, hearings, or other workers' compensation proceedings within the jurisdiction of the Office of Administrative Hearings under chapter 176, unless the proceeding is required to be conducted under chapter 14. Conducting hearings in the administrative law area does not affect a workers' compensation judge's job class established pursuant to section 43A.07 or seniority within that job class. The chief administrative law judge shall annually notify the Department of Management and Budget of the amount of credit payable to the workers' compensation special fund for time spent by workers' compensation judges on noncompensation proceedings.\n(d) Administrative law judges and compensation judges are subject to the provisions of the Code of Judicial Conduct. Administrative law and compensation judges may, however, serve as a member of a governmental board when so directed by the legislature. The chief administrative law judge shall provide training to administrative law and compensation judges about the requirements of the code and shall apply the provisions of the code to their actions. Only administrative law judges serving as temporary judges under a written contract are considered to be part-time judges for purposes of the code. Reports required to be filed by the code must be filed with the chief administrative law judge. The chief administrative law judge shall apply the provisions of the Code of Judicial Conduct, to the extent applicable, to the other administrative law and compensation judges in a manner consistent with interpretations made by the Board on Judicial Standards. The chief administrative law judge shall follow the procedural requirements of the commissioner's plan for state employees if any adverse personnel action is taken based in whole or in part as a violation of the Code of Judicial Conduct.\n(e) In addition to other duties provided by law, workers' compensation and administrative law judges may mediate, arbitrate, or take other appropriate action on matters referred to the Office of Administrative Hearings by any member of the federal or state judicial branch or by the Workers' Compensation Court of Appeals.\nThe chief administrative law judge may appoint a retired administrative law judge or compensation judge to hear any proceeding that is properly assignable to an administrative law judge or compensation judge. When a retired administrative law judge or compensation judge undertakes this service, the retired judge shall receive pay and expenses in the amount payable to temporary administrative law judges or compensation judges serving under section 14.49.",
	"repealed": false
}