{
	"id": "308B.561",
	"url": "https://www.revisor.mn.gov/statutes/cite/308B.561",
	"title": "308B.561 VOTING BY ORGANIZATIONS AND LEGAL REPRESENTATIVES.",
	"text": "Membership interests of a cooperative reflected in the required records as being owned by another domestic or foreign business entity may be voted by the chair, chief executive officer, or another legal representative of that organization.\nExcept as provided in subdivision 3, membership interests of a cooperative reflected in the required records as being owned by a subsidiary are not entitled to be voted on any matter.\nMembership interests of a cooperative in the name of, or under the control of, the cooperative or a subsidiary in a fiduciary capacity are not entitled to be voted on any matter, except to the extent that the settlor or beneficiary possesses and exercises a right to vote or gives the cooperative or, with respect to membership interests in the name of or under control of a subsidiary, the subsidiary, binding instructions on how to vote the membership interests.\nSubject to section 308B.545, membership interests under the control of a person in a capacity as a personal representative, an administrator, executor, guardian, conservator, or the like may be voted by the person, either in person or by proxy, without reflecting in the required records those membership interests in the name of the person.\nMembership interests reflected in the required records in the name of a trustee in bankruptcy or a receiver may be voted by the trustee or receiver either in person or by proxy. Membership interests under the control of a trustee in bankruptcy or a receiver may be voted by the trustee or receiver without reflecting in the required records the name of the trustee or receiver, if authority to do so is contained in an appropriate order of the court by which the trustee or receiver was appointed. The right to vote of trustees in bankruptcy and receivers is subject to section 308B.545.\nMembership interests reflected in the required records in the name of a business entity not described in subdivisions 1 to 5 may be voted either in person or by proxy by the legal representative of that business entity.\nThe grant of a security interest in a membership interest does not entitle the holders of the security interest to vote.",
	"repealed": false
}