{
	"id": "171.2405",
	"url": "https://www.revisor.mn.gov/statutes/cite/171.2405",
	"title": "171.2405 LICENSE REINSTATEMENT DIVERSION PROGRAM.",
	"text": "(a) A city or county may establish a license reinstatement diversion program for holders of class D drivers' licenses who have been charged with violating section 171.24, subdivision 1 or 2. An individual charged with driving after revocation under section 171.24, subdivision 2, is eligible for diversion only if the revocation was due to a violation of section 169.791; 169.797; 169A.52; 169A.54; 171.17, subdivision 1, paragraph (a), clause (6); or 171.177. An individual who is a holder of a commercial driver's license or who has committed an offense in a commercial motor vehicle is not eligible to participate in the diversion program. Nothing in this section authorizes the issuance of a driver's license to a diversion program participant during the underlying suspension or revocation period at issue in the violation of section 171.24, subdivision 1 or 2.\n(b) Notwithstanding any law or ordinance to the contrary, a city or county may contract with a third party to create and administer the diversion program under this section. Any participating city or county, at its own expense, may request an audit of the administrator.\n(c) For purposes of this section, \"administrator\" means the city, county, or administrator of the program.\n(a) A prosecutor for a participating city or county may determine whether to accept an individual for diversion. When making the determination, the prosecutor must consider:\n(1) whether the individual has a record of driving without a valid license or other criminal record, or has previously participated in a diversion program;\n(2) the strength of the evidence against the individual, along with any mitigating factors; and\n(3) the apparent ability and willingness of the individual to participate in the diversion program and comply with program requirements.\n(b) A city or county attorney may request that an individual be reviewed for a diversion program without a formal city or county diversion program being established. The city or county attorney must follow the requirements of this subdivision and subdivision 1 and may submit the individual's application to an administrator for processing in collaboration with DVS to determine if an individual is eligible for approval into the diversion program. The participant must meet the requirements in subdivision 4.\n(c) A judge may submit a request for an individual to apply for entry into a diversion program under this subdivision and subdivision 1. The participant must meet the requirements in subdivision 4.\n(a) Notwithstanding any law to the contrary, the commissioner may issue a diversion driver's license to a person who is a participant in a diversion program, after receiving an application and payment of:\n(1) the reinstatement fee under section 171.20, subdivision 4, by a participant whose driver's license has been suspended;\n(2) the reinstatement fee under section 171.29, subdivision 2, paragraph (a), by a participant whose driver's license has been revoked under section 169.791; 169.797; or 171.17, subdivision 1, paragraph (a), clause (6); or\n(3) the reinstatement fee under section 171.29, subdivision 2, paragraph (a), by a participant whose driver's license has been revoked under section 169A.52, 169A.54, or 171.177. The reinstatement fee and surcharge under section 171.29, subdivision 2, paragraph (b), must also be paid during the course of and as a condition of the diversion program.\n(b) The commissioner may impose restrictions on a diversion driver's license that are suitable to the licensee's driving ability or applicable to the licensee as the commissioner deems appropriate to ensure the safe operation of a motor vehicle by the licensee. The participant must follow all requirements of this section, the requirements set out by DVS and court restrictions.\n(c) Payments made by participants in the diversion program of the reinstatement fee and surcharge under section 171.29, subdivision 2, paragraph (b), must be applied first toward payment of the reinstatement fee and, after the reinstatement fee has been fully paid, toward payment of the surcharge. Each payment that is applied toward the reinstatement fee must be credited as provided in section 171.29, subdivision 2, paragraph (b), and each payment that is applied toward the surcharge must be credited as provided in section 171.29, subdivision 2, paragraphs (c) and (d). After the reinstatement fee and surcharge are satisfied, the participant must pay the program participation fee.\n(d) Notwithstanding any law to the contrary, a diversion driver's license issued to a participant in the program must not be revoked or suspended for convictions entered due to payments made under subdivision 4.\n(a) At a minimum, the diversion program must require individuals to:\n(1) successfully attend and complete, at the individual's expense, educational classes that provide, among other things, information on driver's licensure;\n(2) pay to the administrator, under a schedule approved by the prosecutor, all required related fees, fines, and charges, including applicable statutory license reinstatement fees and costs of participation in the program;\n(3) comply with all traffic laws; and\n(4) demonstrate compliance with motor vehicle insurance requirements.\n(b) Individuals whose underlying citations cost less than $250 shall receive a 60 percent discount on the diversion program fee. Individuals whose underlying citations cost $250 to $500 shall receive a 40 percent discount on the diversion program fee.\n(a) An individual's participation in the diversion program must be terminated if:\n(1) the individual is found guilty of a moving traffic violation;\n(2) the individual fails to provide proof of vehicle insurance; or\n(3) the administrator of the diversion program informs the commissioner that the individual is no longer satisfying the conditions of the diversion program.\n(b) The commissioner must cancel an individual's diversion driver's license upon receiving notice from the administrator that the individual is not complying with the requirements of the program.\n(c) The original charge against the individual of a violation of section 171.24 may be reinstated against an individual whose participation in the diversion program terminates under paragraph (a), clause (1) or (2).\n(d) If an individual satisfies all requirements of the diversion program, including, at a minimum, satisfactory fulfillment of the components under subdivision 4, the administrator must inform the court, the prosecutor, and the commissioner of the individual's satisfactory completion of the diversion program.\n(e) Upon receiving notice under paragraph (d), the commissioner must reinstate the individual's driver's license.\n(f) Upon receiving notice under paragraph (d), the court must dismiss the charge or the prosecutor must decline to prosecute the individual.\n(a) Upon termination of the participant in the program under subdivision 5, where there are any held funds and only after the administrator has made payouts on citations and fees, the third-party administrator shall hold remaining participant fees for 12 months from the date of termination under subdivision 5, paragraph (a), clause (1) or (2).\n(b) A participant who meets DVS requirements to re-enter the diversion program may use held funds to pay fees to be reinstated into the program.\n(c) After 12 months, the administrator shall retain the funds for the work performed during the participant's enrollment period, prior to the participant's termination date in the diversion program.\n(a) By February 1 of each even-numbered year, the administrator must report on each city and county that participated in the diversion program and provide a report to each participating city and county, the commissioner, and the legislative committees with jurisdiction over transportation and the judiciary concerning the results of the program. The report must be made available electronically and, upon request, in print. The report must include, without limitation, the effect of the program on:\n(1) recidivism rates for participants in the diversion program;\n(2) the number of participants who successfully completed the program;\n(3) the amount charged to individuals for program fees;\n(4) payment of the fees and fines collected in the diversion program to cities, counties, and the state;\n(5) the total amount of money collected from participants in the program;\n(6) the total amount of money, by category, paid or applied to reinstatement;\n(7) educational support provided to participants in the diversion program;\n(8) the total number of participants in the diversion program;\n(9) the total number of participants terminated from the program under subdivision 5, paragraph (a), clauses (1) to (3);\n(10) the reimbursement policy for all payments listed under clause (4); and\n(11) the amount of all payments listed under clause (4) retained from participants who were terminated from the program.\n(b) The report must include all recommendations made by cities or counties regarding the future of the program and any necessary or suggested legislative changes.",
	"repealed": false
}