{
	"id": "151.211",
	"url": "https://www.revisor.mn.gov/statutes/cite/151.211",
	"title": "151.211 RECORDS OF PRESCRIPTIONS.",
	"text": "All prescription drug orders shall be kept on file at the location from which dispensing of the ordered drug occurs for a period of at least two years. Prescription drug orders that are electronically prescribed must be kept on file in the format in which they were originally received. Written or printed prescription drug orders and verbal prescription drug orders reduced to writing, must be kept on file as received or transcribed, except that such orders may be kept in an electronic format as allowed by the board. Electronic systems used to process and store prescription drug orders must be compliant with the requirements of this chapter and the rules of the board. Prescription drug orders that are stored in an electronic format, as permitted by this subdivision, may be kept on file at a remote location provided that they are readily and securely accessible from the location at which dispensing of the ordered drug occurred.\nExcept as provided in subdivision 3, a prescription drug order may be refilled only with the written, electronic, or verbal consent of the prescriber and in accordance with the requirements of this chapter, the rules of the board, and where applicable, section 152.11. The date of such refill must be recorded and initialed upon the original prescription drug order, or within the electronically maintained record of the original prescription drug order, by the pharmacist, pharmacist intern, or practitioner who refills the prescription.\n(a) A pharmacist may, using sound professional judgment and in accordance with accepted standards of practice, dispense a legend drug without a current prescription drug order from a licensed practitioner if all of the following conditions are met:\n(1) the patient has been compliant with taking the medication and has consistently had the drug filled or refilled as demonstrated by records maintained by the pharmacy;\n(2) the pharmacy from which the legend drug is dispensed has a record of a prescription drug order for the drug in the name of the patient who is requesting it, but the prescription drug order does not provide for a refill or the time during which the refills were valid has elapsed;\n(3) the pharmacist has tried but is unable to contact the practitioner who issued the prescription drug order, or another practitioner responsible for the patient's care, to obtain authorization to refill the prescription;\n(4) the drug is essential to sustain the life of the patient or to continue therapy for a chronic condition;\n(5) failure to dispense the drug to the patient would result in harm to the health of the patient; and\n(6) the drug is not a controlled substance listed in section 152.02, subdivisions 3 to 6, except for a controlled substance that has been specifically prescribed to treat a seizure disorder, in which case the pharmacist may dispense up to a 72-hour supply.\n(b) If the conditions in paragraph (a) are met, the amount of the drug dispensed by the pharmacist to the patient must not exceed a 30-day supply, or the quantity originally prescribed, whichever is less, except as provided for controlled substances in paragraph (a), clause (6). If the standard unit of dispensing for the drug exceeds a 30-day supply, the amount of the drug dispensed or sold must not exceed the standard unit of dispensing.\n(c) A pharmacist shall not dispense or sell the same drug to the same patient, as provided in this section, more than one time in any 12-month period.\n(d) A pharmacist must notify the practitioner who issued the prescription drug order not later than 72 hours after the drug is sold or dispensed. The pharmacist must request and receive authorization before any additional refills may be dispensed. If the practitioner declines to provide authorization for additional refills, the pharmacist must inform the patient of that fact.\n(e) The record of a drug sold or dispensed under this section shall be maintained in the same manner required for prescription drug orders under this section.",
	"repealed": false
}