{
	"id": "462A.202",
	"url": "https://www.revisor.mn.gov/statutes/cite/462A.202",
	"title": "462A.202 LOCAL GOVERNMENT UNIT HOUSING ACCOUNT.",
	"text": "The local government unit housing account is established as a separate account in the housing development fund. Money in the account is appropriated to the agency for loans to cities for the purposes specified in this section. The agency must take steps to ensure distribution of the funds around the state.\nThe agency may make loans with or without interest to cities and counties to finance the acquisition, improvement, and rehabilitation of existing housing properties or the acquisition, site improvement, and development of new properties for the purposes of providing transitional housing, upon terms and conditions the agency determines. For purposes of this section, \"transitional housing\" means housing that is provided for a limited duration not exceeding 24 months, except that up to one-third of the residents may live in the housing for up to 36 months. Preference must be given to cities that propose to acquire properties being sold by the Resolution Trust Corporation or the Department of Housing and Urban Development. Loans under this subdivision are subject to the restrictions in subdivision 7.\nMS 1990 [Repealed, 1992 c 522 s 48]\nThe agency may make loans, with or without interest, to cities and counties to finance the construction, acquisition, or rehabilitation of affordable, permanent, publicly owned rental housing. Loans made under this subdivision are subject to the restrictions of subdivision 7. In making loans under this subdivision, the agency shall give priority to projects that increase the supply of affordable family housing.\nMS 1990 [Repealed, 1992 c 522 s 48]\nMS 1990 [Repealed, 1992 c 522 s 48]\nThe agency may make loans with or without interest to cities and counties to finance the capital costs of a land trust project undertaken pursuant to sections 462A.30 and 462A.31. Loans under this subdivision are subject to the restrictions in subdivision 7.\n(a) Except as provided in paragraphs (b), (c), (d), (e), and (f), the city must own the property financed with a loan under this section and use the property for the purposes specified in this section:\n(1) the city may sell the property at its fair market value provided it repays the lesser of the net proceeds of the sale or the amount of the loan balance to the agency for deposit in the local government unit housing account; or\n(2) the city may use the property for a different purpose provided that the city repays the amount of the original loan.\nIf the city owns and uses the property for the purposes specified in this section for a 20-year period, the agency shall forgive the loan.\n(b) In cases where the property consists of land only, including land on which buildings acquired with a loan under this section are demolished by the city, the city may lease the property for a term not to exceed 99 years to a nonprofit organization to use for the purposes specified in this section.\n(c) In cases where the property consists of land and buildings, the city may do the following:\n(1) demolish the buildings in whole or in part and use or lease the property under paragraph (b);\n(2) sell the buildings to a nonprofit organization to use for the purposes specified in this section. If sold, the city must sell the buildings for fair market value and repay the proceeds of the sale to the agency for deposit in the local government unit housing account;\n(3) lease the buildings to a nonprofit organization to use for the purposes specified in this section. If leased, except as provided in paragraph (d), the annual rental must equal the amount of the loan attributable to the cost of the buildings, divided by the number of years of useful life of the buildings as determined in accordance with generally accepted accounting principles. For purposes of determining the required rental, the purchase price of land and buildings must be allocated between them based on standard valuation procedures; or\n(4) contract with a nonprofit organization to manage the property.\n(d) A city may lease a building to a nonprofit organization for a nominal amount under the following conditions:\n(1) the lease does not exceed ten years;\n(2) the city must have the option to cancel the lease with or without cause at the end of any three-year period; and\n(3) the city must determine annually that the property is being used for the purposes specified in this section and that the terms of the lease, including any income limits for residents, are being met.\n(e) A city may sell single-family residential housing directly to persons and families of low and moderate income.\n(f) A city may lease the buildings to a partnership consisting of a nonprofit organization and a limited partner if the nonprofit organization is the general partner and the financing for the land trust project includes low-income housing tax credits. All conditions for leasing buildings to a nonprofit organization as provided under this subdivision apply to the lease authorized under this paragraph.\n(g) The statutory lien created under section 16A.695 may be subordinate to liens created by other sources of financing, at the discretion of the agency.",
	"repealed": false
}