{
	"id": "571.912",
	"url": "https://www.revisor.mn.gov/statutes/cite/571.912",
	"title": "571.912 FORM OF NOTICE, INSTRUCTIONS, AND EXEMPTION NOTICE.",
	"text": "The notice, instructions, and exemption notice informing a debtor that a garnishment summons has been used to attach funds of the debtor to satisfy a claim must be a separate notice and must be substantially in the following form:\nIMPORTANT NOTICE\nYOUR FUNDS HAVE BEEN GARNISHED\nThe Creditor has frozen money in your account at your financial institution.\nYour account balance is $.......\nThe amount being held is $.......\nThe amount being held will be frozen for 14 days from the date of this notice.\nSome of your money in your account may be protected (the legal word is exempt). You may be able to get it sooner than 14 days if you act quickly and follow the instructions on the next page.\nThe attached exemption form lists some different sources of money in your account that may be protected. If your money is from one or more of these sources, place a check on the line on the form next to the sources of your money. If it is from one of these sources, the Creditor cannot take it.\nBUT, you must follow the instructions and return the exemption form and copies of your bank statements from the last 60 days to have the bank unfreeze your money. If you do not follow the instructions or your Creditor gets an order from the court or writ of execution, your financial institution will give the money to your Creditor. If that happens and it is protected, you can still get it back from the Creditor later, but that is not as easy to do as filling in the form now.\nSee next pages for instructions and the exemption form.\nThe instructions required must be in a separate form and must be substantially in the following form:\nINSTRUCTIONS\nNote: The creditor is who you owe the money to. You are the debtor.\n1. Fill out both of the attached exemption forms in this packet.\nIf you check one of the lines, you should also give proof that shows that some or all of the money in your account is from one or more of the protected sources. Creditors may ask for a hearing if they question your exemptions.\nTo avoid a hearing:\nCase numbers should be added to the form.\nCopies of documents should be sent with the form.\nNOTICE: YOU MUST SEND TO THE CREDITOR'S ATTORNEY (OR TO THE CREDITOR, IF NO ATTORNEY) COPIES OF YOUR BANK STATEMENTS FOR THE PAST 60 DAYS BEFORE THE GARNISHMENT. Keep a copy of your bank statements in case there are questions about your claim. If you do not send to the creditor's attorney (or to the creditor, if no attorney) bank statements with your exemption claim, the financial institution may release your money to the creditor once the creditor gives the financial institution a court order directing it to turn over the funds.\n2. Sign the exemption forms. Make one copy to keep for yourself.\n3. Mail or deliver the other copies of the form by (insert date).\nBOTH COPIES MUST BE MAILED OR DELIVERED THE SAME DAY.\nOne copy of the form and the copies of your bank statements go to:\nOne copy goes to:\nHOW THE PROCESS WORKS\nIf You Do Not Send in the Exemption Form and Bank Statements:\n14 days after the date of this letter some or all of your money may be turned over to the creditor once they get an order from the court telling the financial institution to do this.\nIf You Send in the Exemption Form and Bank Statements:\nAny money that is NOT protected can be turned over to the creditor once they get an order from the court.\nIf the Creditor Does Not Object:\nThe financial institution will unfreeze your money six business days after the institution gets your completed form.\nIf the Creditor Objects:\nThe money you have said is protected on the form will be held by the bank. The creditor has six business days to object (disagree) and ask the court to hold a hearing. You will receive a Notice of Objection and a Notice of Hearing.\nThe financial institution will hold the money until a court decides whether your money is protected or not. Some reasons a creditor may object are because you did not send copies of your bank statements or other proof of the benefits you received. Be sure to include these when you send your exemption form.\nYou may want to talk to a lawyer for advice about this process. If you are low income you can call Legal Aid.\nPENALTIES:\nIf you claim that your money is protected and a court decides you made that claim in bad faith, the court can order you to pay costs, actual damages, attorney fees, and an additional amount of up to $100. For example, it may be bad faith if you claim you receive government benefits that you do not receive.\nIf the creditor made a bad faith objection to your claim that your money is protected, the court can order them to pay costs, actual damages, attorney fees, and an additional amount of up to $100.\nThe exemption notice must be a separate form and must be in substantially the following form:\nEXEMPTION FORM\nYou may have assistance based on need from another source that is not on the list. If you do, check this box, and fill in the source of your money on the line below:\nSource: ....................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................\nInclude copies of any documents you have that show the source of this money.\nI give permission to any agency that has given me cash benefits to give information about my benefits to the above-named creditor, or its attorney. The information will ONLY concern whether I get benefits or not, or whether I have gotten them in the past six months.\nIf I was an inmate in the last six months, I give my permission to the correctional institution to tell the above-named creditor that I was an inmate there.\nYOU MUST SIGN AND SEND THIS FORM BACK TO THE CREDITOR'S ATTORNEY (OR TO THE CREDITOR, IF NO ATTORNEY) AND THE BANK. REMEMBER TO INCLUDE A COPY OF YOUR BANK STATEMENTS FOR THE PAST 60 DAYS. FILL IN THE BLANKS BELOW AND GO BACK TO THE INSTRUCTIONS TO MAKE SURE YOU DO IT CORRECTLY.\nI have mailed or delivered a copy of this form to:\nI have also mailed or delivered a copy of this exemption form to my bank at the address listed in the instructions.",
	"repealed": false
}