{
	"id": "16A.15",
	"url": "https://www.revisor.mn.gov/statutes/cite/16A.15",
	"title": "16A.15 ACCOUNTING SYSTEM; ALLOTMENT AND ENCUMBRANCE.",
	"text": "[Renumbered 16A.152, subd 4]\nThe commissioner shall keep an accounting system in the department's office showing by fund and item:\n(1) the amounts appropriated for and the estimated revenue of the agency;\n(2) the amount allotted and available for expenditure;\n(3) the amount of expenditures or obligations authorized to be incurred;\n(4) the actual receipts and disbursements;\n(5) actual balances on hand; and\n(6) the unencumbered balances after deduction of all actual and authorized expenditures.\n(a) A payment may not be made without prior obligation. An obligation may not be incurred against any fund, allotment, or appropriation unless the commissioner has certified a sufficient unencumbered balance or the accounting system shows sufficient allotment or encumbrance balance in the fund, allotment, or appropriation to meet it. The commissioner shall determine when the accounting system may be used to incur obligations without the commissioner's certification of a sufficient unencumbered balance. An expenditure or obligation authorized or incurred in violation of this chapter is invalid and ineligible for payment until made valid. A payment made in violation of this chapter is illegal. An employee authorizing or making the payment, or taking part in it, and a person receiving any part of the payment, are jointly and severally liable to the state for the amount paid or received. If an employee knowingly incurs an obligation or authorizes or makes an expenditure in violation of this chapter or takes part in the violation, the violation is just cause for the employee's removal by the appointing authority or by the governor if an appointing authority other than the governor fails to do so. In the latter case, the governor shall give notice of the violation and an opportunity to be heard on it to the employee and to the appointing authority. A claim presented against an appropriation without prior allotment or encumbrance may be made valid on investigation, review, and approval by the agency head in accordance with the commissioner's policy, if the services, materials, or supplies to be paid for were actually furnished in good faith without collusion and without intent to defraud. The commissioner may then pay the claim just as properly allotted and encumbered claims are paid.\n(b) The commissioner may approve payment for materials and supplies in excess of the obligation amount when increases are authorized by section 16C.03, subdivision 3.\n(c) To minimize potential construction delay claims, an agency with a project funded by a building appropriation may allow a consultant or contractor to proceed with supplemental work within the limits of the appropriation before money is encumbered. Under this circumstance, the agency may requisition funds and allow consultants or contractors to expeditiously proceed with services or a construction sequence. While the consultant or contractor is proceeding, the agency shall immediately act to encumber the required funds.\nIn the case of appropriations made for permanent improvements, including acquisition of real property, which appropriations do not lapse until the purposes of the appropriations are accomplished or abandoned, the commissioner may dispense with periodic allotments and shall make rules to ensure the proper application and encumbrance of funds.\n[Renumbered 16A.152, subd 6]\n[Renumbered 16A.152, subdivision 1]\n[Renumbered 16A.152, subd 7]",
	"repealed": false
}