{
	"id": "124D.518",
	"url": "https://www.revisor.mn.gov/statutes/cite/124D.518",
	"title": "124D.518 ADULT BASIC EDUCATION AID DEFINITIONS.",
	"text": "The definitions in this section apply to sections 124D.52 to 124D.531.\n\"Adult basic education consortium\" means a voluntary association of school districts, public agencies, or nonprofit organizations that work together to provide coordinated adult basic education services in a designated geographic area, and that act as a fiscal entity providing adult basic education services.\n(a) \"Contact hours\" means the number of hours during which a student was engaged in learning activities provided by an approved adult education program. Contact hours excludes homework but includes interactive distance learning. The commissioner may only reallocate contact hours among programs to adjust for changes in program membership between the first prior program year and the current program year based on the actual contact hours reported for the first prior program year. The commissioner may adjust a program or consortium's contact hours due to a service disruption according to the process established in section 124D.531, subdivision 10.\n(b) For revenue beginning in fiscal year 2002, contact hours for a provider of adult basic education services funded in fiscal year 2000, but not eligible for basic population aid in fiscal year 2001, is computed by multiplying the provider's contact hours by 1.03.\n(c) For aid in fiscal year 2001, contact hours in fiscal year 2000 equals the number of full-time equivalent learners times the contact hours. A level one full-time equivalent learner is equal to 240 contact hours and a level two full-time learner is equal to 408 contact hours.\n\"First prior program year\" means the specific time period defined by the commissioner that aligns to a program academic year.\n\"Service disruption\" means the loss of student contact time due to a natural disaster including, but not limited to, floods, tornadoes, and fires, or the loss of student contact hours caused by a party other than the adult basic education program or consortium including, but not limited to, building relocations and transportation disruptions. A service disruption occurs only if:\n(1) the loss of contact hours is sufficient to cause the consortium to lose revenue equal to at least ten percent of the aid generated under section 124D.531, subdivision 3, clause (2); or\n(2) the loss of contact hours is sufficient to cause the program to lose revenue equal to at least 15 percent of the aid generated under section 124D.531, subdivision 3, clause (2).\n\"Unreimbursed expenses\" means allowable adult basic education expenses of a program, in the current program year, that are not covered by payments from federal or private for-profit sources.",
	"repealed": false
}