{
	"id": "142G.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/142G.03",
	"title": "142G.03 FEDERAL TANF BLOCK GRANT.",
	"text": "The commissioner of children, youth, and families is authorized to receive, administer, and expend funds available under the TANF block grant authorized under title I of Public Law 104-193, the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, and under Public Law 109-171, the Deficit Reduction Act of 2005.\nState money appropriated for purposes of this section and TANF block grant money must be used for:\n(1) financial assistance to or on behalf of any minor child who is a resident of this state under section 142G.12;\n(2) the health care and human services training and retention program under chapter 116L, for costs associated with families with children with incomes below 200 percent of the federal poverty guidelines;\n(3) the pathways program under section 116L.04, subdivision 1a;\n(4) welfare to work transportation authorized under Public Law 105-178;\n(5) reimbursements for the federal share of child support collections passed through to the custodial parent;\n(6) program administration under this chapter;\n(7) the MFIP consolidated fund under section 142G.76; and\n(8) the Minnesota Department of Health consolidated fund under Laws 2001, First Special Session chapter 9, article 17, section 3, subdivision 2.\n[See Note.]\nSubject to limitations of title I of Public Law 104-193, the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, as amended, and under Public Law 109-171, the Deficit Reduction Act of 2005, the legislature may transfer money from the TANF block grant to the child care fund under chapter 142E, or the Title XX block grant.\nNotwithstanding the provisions of section 16A.127, the statewide and agency indirect cost liability identified as part of the TANF grant for any current fiscal year shall be limited to no more than the amount received in fiscal year 1996.\nAny expenditures from the TANF block grant shall be expended in accordance with the requirements and limitations of part A of Title IV of the Social Security Act, as amended, and any other applicable federal requirement or limitation. Prior to any expenditure of these funds, the commissioner shall ensure that funds are expended in compliance with the requirements and limitations of federal law and that any reporting requirements of federal law are met. It shall be the responsibility of any entity to which these funds are appropriated to implement a memorandum of understanding with the commissioner that provides the necessary assurance of compliance prior to any expenditure of funds. The commissioner shall receipt TANF funds appropriated to other state agencies and coordinate all related interagency accounting transactions necessary to implement these appropriations. Unexpended TANF funds appropriated to any state, local, or nonprofit entity cancel at the end of the state fiscal year unless appropriating or statutory language permits otherwise.",
	"repealed": false
}