{
	"id": "355.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/355.03",
	"title": "355.03 EMPLOYEES AND EMPLOYERS, CONTRIBUTIONS.",
	"text": "Every employee of the state, or of any of its political subdivisions, whose services are covered by the agreement entered into under section 355.02 must pay for the period of the coverage, contributions with respect to wages, equal to the amount of the employee's tax which would be imposed by the Federal Insurance Contributions Act if those services constituted employment within the meaning of that act. This liability arises in consideration of the employee's retention in the service of the state, or any of its political subdivisions, or the employee's entry upon that service, after April 22, 1955.\nThe contribution imposed by this section must be collected by the covered employee's employer by deducting the amount of the contribution from wages as and when paid. The failure to make such deduction does not relieve the employee from liability for such contribution.\n(a) Employer contributions that are required under the agreement must be paid by the applicable employing unit.\n(b) Employer contributions on behalf of St. Paul teachers, Duluth teachers, Minneapolis teachers, or education employees may be paid from normal school operating funds. Employer contributions on behalf of state employees must be paid by the applicable department or agency from its appropriation or other revenue, in the same proportion as salaries are paid, and must be charged as an administrative cost of the state governmental unit.\n(c) Employing units may pay the employer contribution from taxes collected or from other governmental revenue. An employing unit may include in its tax levy the amount necessary to pay its Social Security obligations. If the taxes authorized to be levied cause the total levy amount to exceed any limitation on the power of the employing unit to levy taxes, the unit may still levy the necessary amount. The employing unit, in the event of a deficit, may issue debt obligations, payable in not more than two years, in an amount which may cause its indebtedness to exceed any limitation without holding an election and may levy taxes to amortize the indebtedness. The authorized Social Security expenditures must not be included in computing the cost of government for purposes of any home rule charter or other charter.\n(d) If the required employer contribution for Social Security is increased and, as a result of that increase, there is insufficient money available to a state governmental unit, there is appropriated to the state department or agency from the general fund the amount required to meet the deficiency, based on certifications from the director to the commissioner of management and budget. The transfer of the appropriated amount may only occur after the commissioner of management and budget notifies the chair and ranking minority member of the house of representatives Committee on Ways and Means and the chair and ranking minority member of the senate Finance Committee of the amount to be transferred.\n(e) For members of the general state employees retirement plan of the Minnesota State Retirement System who are employed by the State Horticultural Society, the Department of Minnesota for the Disabled American Veterans organization, the Department of Minnesota of the Veterans of Foreign Wars organization, the Minnesota Crop Improvement Association, the Minnesota Historical Society, the Armory Building Commission, and the Minnesota-Wisconsin-Minneapolis-St. Paul survival plan project, the applicable employing unit must pay the employer contribution from any revenue source that it has.\nIf more or less than the correct amount of the contribution imposed by this section is paid or deducted with respect to any remuneration, proper adjustments, or refund if adjustment is impracticable, must be made, without interest, in such manner and at such times as the director prescribes.\nDelinquent payments that are due under this chapter, with compound interest at the rate of six percent per annum, may be recovered by legal action in a court of competent jurisdiction against an employing unit that is liable for the amount. The director may request that the delinquent payment and interest amount be deducted from any other money that is payable to the applicable employing unit by any department or agency of the state. An action for the recovery of delinquent payments is not subject to any statutory provision that would otherwise limit the time within which an action may be commenced.",
	"repealed": false
}