{
	"id": "136F.581",
	"url": "https://www.revisor.mn.gov/statutes/cite/136F.581",
	"title": "136F.581 PURCHASES AND CONTRACTS.",
	"text": "The board and the colleges and universities are subject to the provisions of section 471.345. In addition to the contracting authority under this chapter, the board may utilize any contracting options available to the commissioner of administration under chapter 16A, 16B, or 16C.\nThe board shall develop policies for purchases and contracts that are consistent with the authority granted in subdivision 1. The policies and procedures shall be developed through the system and campus labor management committees and shall include provisions requiring the system and campuses to determine that they cannot use available staff before contracting with additional outside consultants or services. In addition, each college and university, in consultation with the office of the chancellor, shall develop procedures for those purchases and contracts that can be accomplished by a college and university without board approval. The board policies must allow each college and university the local authority to enter into contracts for construction projects of up to $250,000 and to make other purchases of up to $50,000, without receiving board approval. The board may allow a college or university local authority to make purchases over $50,000 without receiving board approval.\nThe policies and procedures must include provisions for procurement, including construction, from small targeted group businesses and businesses from economically disadvantaged areas designated under section 16C.16. The board, colleges, and universities shall use the methods contained in section 471.345, subdivision 8, for such purchasing, or may develop additional methods in which the cost percentage preferences are consistent with the provision of section 16C.16, subdivisions 6, paragraph (a), and 7, or consistent with the provisions of the University of Minnesota's targeted group business purchasing program.\n(a) The board shall develop policies for entering into contracts for professional or technical services, other than instructional services. The policies must allow each college and university the authority to enter into contracts for professional or technical services up to $15,000 without board approval. The board may allow a college or university authority to enter into contracts for professional or technical services over $15,000 without receiving board approval.\n(b) Each college and university, in consultation with the system office, shall develop procedures to enter into contracts for professional or technical services.\n(c) The policies and procedures developed by the board and by each college and university for professional or technical service contracts must be done in consultation with employees and their exclusive bargaining representatives and must address topics such as employee protections, information availability and reporting, conflict of interest, and renewal restrictions.\nColleges and universities must make a reasonable attempt to identify and purchase food products that are grown within the state.",
	"repealed": false
}