{
	"id": "192A.6011",
	"url": "https://www.revisor.mn.gov/statutes/cite/192A.6011",
	"title": "192A.6011 PROHIBITED ACTIVITIES WITH MILITARY RECRUIT OR TRAINEE BY PERSON IN POSITION OF SPECIAL TRUST.",
	"text": "For purposes of this section, the terms defined in this subdivision have the meanings given them.\n(1) \"Applicant for military service\" means a person who, under regulations prescribed by the secretary concerned, the Minnesota National Guard authority, or designee concerned, is an applicant for original enlistment or appointment in the armed forces.\n(2) \"Military recruiter\" means a person who, under regulations prescribed by the secretary concerned, has the primary duty to recruit persons for military service.\n(3) \"Prohibited sexual activity\" means, as specified in regulations prescribed by the secretary concerned, the Minnesota National Guard authority, or designee concerned, inappropriate physical intimacy under circumstances described in such regulations.\n(4) \"Specially protected junior member of the armed forces\" means:\n(i) a member of the armed forces who is assigned to, or is awaiting assignment to, basic training or other initial active duty for training, including a member who is enlisted under a delayed entry program;\n(ii) a member of the armed forces who is a cadet, an officer candidate, or a student in any other officer qualification program; and\n(iii) a member of the armed forces in any program that, by regulation prescribed by the secretary concerned or a Minnesota National Guard authority, or designee concerned, is identified as a training program for initial career qualification.\n(5) \"Training leadership position\" means, with respect to a specially protected junior member of the armed forces, any of the following:\n(i) any drill instructor position or other leadership position in a basic training program, an officer candidate school, a reserve officers' training corps unit, a training program for entry into the armed forces, or any program that, by regulation prescribed by the secretary concerned, is identified as a training program for initial career qualification; and\n(ii) faculty and staff of the United States Military Academy, the United States Naval Academy, the United States Air Force Academy, the United States Coast Guard Academy, and the Minnesota National Guard Regional Training Institute.\nAny person subject to this code:\n(1) who is an officer or a noncommissioned officer;\n(2) who is in a training leadership position with respect to a specially protected junior member of the armed forces; and\n(3) who engages in prohibited sexual activity with the specially protected junior member of the armed forces;\nshall be punished as a court-martial may direct.\nAny person subject to this code:\n(1) who is a military recruiter and engages in prohibited sexual activity with an applicant for military service; or\n(2) who is a military recruiter and engages in prohibited sexual activity with a specially protected junior member of the armed forces who is enlisted under a delayed entry program;\nshall be punished as a court-martial may direct.\nConsent is not a defense for any conduct at issue in a prosecution under this section.",
	"repealed": false
}