{
	"id": "62A.39",
	"url": "https://www.revisor.mn.gov/statutes/cite/62A.39",
	"title": "62A.39 DISCLOSURE.",
	"text": "No individual Medicare supplement plan shall be delivered or issued in this state and no certificate shall be delivered under a group Medicare supplement plan delivered or issued in this state unless the plan is shown on the cover page and an outline containing at least the following information in no less than 12-point type is delivered to the applicant at the time the application is made:\n(a) A description of the principal benefits and coverage provided in the policy;\n(b) A statement of the exceptions, reductions, and limitations contained in the policy including the following language, as applicable, in bold print: \"THIS POLICY DOES NOT COVER ALL MEDICAL EXPENSES BEYOND THOSE COVERED BY MEDICARE. THIS POLICY DOES NOT COVER ALL SKILLED NURSING HOME CARE EXPENSES AND DOES NOT COVER CUSTODIAL OR RESIDENTIAL NURSING CARE. READ YOUR POLICY CAREFULLY TO DETERMINE WHICH NURSING HOME FACILITIES AND EXPENSES ARE COVERED BY YOUR POLICY.\";\n(c) A statement of the renewal provisions including any reservations by the insurer of a right to change premiums. The premium and manner of payment shall be stated for all plans that are offered to the prospective applicant. All possible premiums for the prospective applicant shall be illustrated;\n(d) Read your policy or certificate very carefully. A statement that the outline of coverage is a summary of the policy issued or applied for and that the policy should be consulted to determine governing contractual provisions. Additionally, it does not give all the details of Medicare coverage. Contact your local Social Security office or consult the Medicare handbook for more details;\n(e) A statement of the policy's loss ratio as follows: \"This policy provides an anticipated loss ratio of (..%). This means that, on the average, policyholders may expect that ($....) of every $100.00 in premium will be returned as benefits to policyholders over the life of the contract.\";\n(f) When the outline of coverage is provided at the time of application and the Medicare supplement policy or certificate is issued on a basis that would require revision of the outline, a substitute outline of coverage properly describing the policy or certificate shall accompany the policy or certificate when it is delivered and contain the following statement, in no less than 12-point type, immediately above the company name:\n\"NOTICE: Read this outline of coverage carefully. It is not identical to the outline of coverage provided upon application, and the coverage originally applied for has not been issued.\";\n(g) Right to return policy or certificate. \"If you find that you are not satisfied with your policy or certificate for any reason, you may return it to (insert issuer's address). If you send the policy or certificate back to us within 30 days after you receive it, we will treat the policy or certificate as if it had never been issued and return all of your payments within ten days.\";\n(h) Policy or certificate replacement. \"If you are replacing another health insurance policy or certificate, do NOT cancel it until you have actually received your new policy or certificate and are sure you want to keep it.\";\n(i) Notice. \"This policy or certificate may not fully cover all of your medical costs.\"\nA. (for agents:)\n\"Neither (insert company's name) nor its agents are connected with Medicare.\"\nB. (for direct response:)\n\"(insert company's name) is not connected with Medicare.\"\n(j) Notice regarding policies or certificates which are not Medicare supplement policies.\nAny accident and sickness insurance policy or certificate, other than a Medicare supplement policy, or a policy or certificate issued pursuant to a contract under the federal Social Security Act, section 1833 or 1876 (United States Code, title 42, section 1395, et seq.), disability income policy; or other policy, issued for delivery in this state to persons eligible for Medicare shall notify insureds under the policy that the policy is not a Medicare supplement policy or certificate. The notice shall either be printed or attached to the first page of the outline of coverage delivered to insureds under the policy, or if no outline of coverage is delivered, to the first page of the policy or certificate delivered to insureds. The notice shall be in no less than 12-point type and shall contain the following language:\n\"THIS (POLICY OR CERTIFICATE) IS NOT A MEDICARE SUPPLEMENT (POLICY OR CONTRACT). If you are eligible for Medicare, review the \"Guide to Health Insurance for People with Medicare\" available from the company.\"\n(k) Complete answers are very important. \"When you fill out the application for the new policy or certificate, be sure to answer truthfully and completely all questions about your medical and health history. The company may cancel your policy or certificate and refuse to pay any claims if you leave out or falsify important medical information.\" If the policy or certificate is guaranteed issue, this paragraph need not appear.\n\"Review the application carefully before you sign it. Be certain that all information has been properly recorded.\"\nInclude for each plan, prominently identified in the cover page, a chart showing the services, Medicare payments, plan payments, and insured payments for each plan, using the same language, in the same order, using uniform layout and format.\nThe outline of coverage provided to applicants pursuant to this section consists of four parts: a cover page, premium information, disclosure pages, and charts displaying the features of each benefit plan offered by the insurer.",
	"repealed": false
}