{
	"id": "60B.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/60B.11",
	"title": "60B.11 COMMISSIONER'S SUMMARY ORDERS.",
	"text": "Whenever the commissioner has reasonable cause to believe, and determines, after a hearing held as prescribed in subdivision 3, that any insurer has committed or engaged in, or is committing or engaging in or is about to commit or engage in any act, practice, or transaction that would subject it to formal delinquency proceedings under sections 60B.01 to 60B.61, the commissioner may make and serve upon the insurer and any other persons involved such orders other than seizure orders under sections 60B.12 and 60B.13 as are reasonably necessary to correct, eliminate, or remedy such conduct, condition, or ground.\nIf the conditions of subdivision 1 are satisfied, and if it appears to the commissioner that irreparable harm to the property or business of the insurer or to the interests of its policyholders, creditors, or the public may occur unless the commissioner issues with immediate effect the orders described in subdivision 1, the commissioner may make and serve such orders without notice and before hearing, simultaneously serving upon the insurer notice of the hearing upon such order.\nThe notice of hearing under subdivision 1 or 2 and the summary order issued under subdivision 1 or 2 shall be served personally or by sending a copy of such notice of order by prepaid certified mail. The notice of hearing under subdivision 1 shall state the time and place of hearing, and the conduct, condition, or ground upon which the commissioner would base an order; the notice of hearing under subdivision 2 shall state the time and place of hearing. Unless mutually agreed between the commissioner and the insurer, the hearing shall occur not less than ten days nor more than 30 days after notice is served and shall be either in Ramsey County or in some other place convenient to the parties to be designated by the commissioner.\nIf the commissioner issues a summary order before hearing under subdivision 2, the insurer may at any time waive the commissioner's hearing and the summary decision shall be treated as a final decision in a contested case under chapter 14, and the insurer may apply for immediate judicial relief by means of any remedy afforded by law without first exhausting administrative remedies. Subsequent to a hearing the insurer or any person whose interests are substantially affected shall be entitled to judicial review in accordance with chapter 14 of any order issued by the commissioner.\nIf any person has violated any order issued under this section which as to that person was then still in effect, that person shall be liable to forfeit a sum not to exceed $10,000. The penalty shall be imposed and collected in an action brought by the attorney general and shall be paid into the state treasury to the credit of the general fund.\nThe commissioner may apply for and any court of general jurisdiction may grant, under the relevant sections of Minnesota Rules of Civil Procedure, such restraining orders, temporary and permanent injunctions, and other orders as are deemed necessary to enforce a summary order.",
	"repealed": false
}