{
	"id": "82.68",
	"url": "https://www.revisor.mn.gov/statutes/cite/82.68",
	"title": "82.68 OTHER DISCLOSURE REQUIREMENTS.",
	"text": "A salesperson shall only conduct business under the licensed name of and on behalf of the broker to whom the salesperson is licensed. An individual broker shall only conduct business under the brokerage's licensed name. A broker licensed to a business entity shall only conduct business under the licensed business entity name. A licensee shall affirmatively disclose, before the negotiation or consummation of any transaction, the licensed name of the brokerage under whom the licensee is authorized to conduct business according to this section.\n(a) Before the negotiation or consummation of any transaction, a licensee shall affirmatively disclose to the owner of real property that the licensee is a real estate broker or agent salesperson, and in what capacity the licensee is acting, if the licensee directly, or indirectly through a third party, purchases for himself or herself or acquires, or intends to acquire, any interest in, or any option to purchase, the owner's property.\n(b) When a principal in the transaction is a licensee or a relative or business associate of the licensee, that fact must be disclosed in writing before negotiating or consummating any transaction.\n(a) A licensee shall disclose to a prospective purchaser all material facts of which the licensee is aware, which could adversely and significantly affect an ordinary purchaser's use or enjoyment of the property, or any intended use of the property of which the licensee is aware.\n(b) It is not a material fact relating to real property offered for sale the fact or suspicion that the property:\n(1) is or was occupied by an owner or occupant who is or was suspected to be infected with human immunodeficiency virus or diagnosed with acquired immunodeficiency syndrome;\n(2) was the site of a suicide, accidental death, natural death, or perceived paranormal activity; or\n(3) is located in a neighborhood containing any adult family home, community-based residential facility, or nursing home.\n(c) A licensee or employee of the licensee has no duty to disclose information regarding an offender who is required to register under section 243.166, or about whom notification is made under that section, if the broker or salesperson, in a timely manner, provides a written notice that information about the predatory offender registry and persons registered with the registry may be obtained by contacting local law enforcement where the property is located or the Department of Corrections.\n(d) A licensee or employee of the licensee has no duty to disclose information regarding airport zoning regulations if the broker or salesperson, in a timely manner, provides a written notice that a copy of the airport zoning regulations as adopted can be reviewed or obtained at the office of the county recorder where the zoned area is located.\n(e) A licensee is not required to disclose, except as otherwise provided in paragraph (f), information relating to the physical condition of the property or any other information relating to the real estate transaction, if a written report that discloses the information has been prepared by a qualified third party and provided to the person. For the purposes of this paragraph, \"qualified third party\" means a federal, state, or local governmental agency, or any person whom the broker, salesperson, or a party to the real estate transaction reasonably believes has the expertise necessary to meet the industry standards of practice for the type of inspection or investigation that has been conducted by the third party in order to prepare the written report and who is acceptable to the person to whom the disclosure is being made.\n(f) A licensee shall disclose to the parties to a real estate transaction any facts known by the broker or salesperson that contradict any information included in a written report described in paragraph (e), if a copy of the report is provided to the licensee.\n(g) The limitation on disclosures in this subdivision shall modify any common law duties with respect to disclosure of material facts.\nIf a licensee is put on notice by a party to a real estate transaction that the party will not perform according to the terms of a purchase agreement or other similar written agreement to convey real estate, the licensee shall immediately disclose the fact of that party's intent not to perform to the other party or parties to the transaction. The licensee shall, if reasonably possible, inform the party who will not perform of the licensee's obligation to disclose this fact to the other party or parties to the transaction before making the disclosure. The obligation required by this section does not apply to notice of a party's inability to keep or fulfill any contingency to which the real estate transaction has been made subject.",
	"repealed": false
}