{
	"id": "414.031",
	"url": "https://www.revisor.mn.gov/statutes/cite/414.031",
	"title": "414.031 ANNEXING UNINCORPORATED PROPERTY; CHIEF ADMINISTRATIVE LAW JUDGE'S ORDER.",
	"text": "(a) A proceeding for the annexation of unincorporated property abutting a municipality may be initiated by submitting to the chief administrative law judge and the affected township one of the following:\n(1) a resolution of the annexing municipality;\n(2) a resolution of the township containing the area proposed for annexation;\n(3) a petition of 20 percent of the property owners or 100 property owners, whichever is less, in the area to be annexed;\n(4) a resolution of the municipal council together with a resolution of the township board stating their desire to have the entire township annexed to the municipality.\n(b) The petition, or resolution shall set forth the boundaries of the territory proposed for annexation, the names of all parties entitled to notice under section 414.09, and the reasons for requesting annexation.\n(c) If the proceeding is initiated by a petition of property owners, the petition shall be accompanied by a resolution of the annexing municipality supporting the petition.\nAt least 30 days before submitting a petition or resolution to the chief administrative law judge under this section, the petitioning municipality or petitioning property owner or supporting municipality must serve the township clerk of the affected township by certified mail a notice of the petitioning municipality's or the petitioning property owner's intent to annex property within the township. The notice must clearly identify the boundaries of the area proposed to be annexed.\nMS 1971 [Repealed, 1973 c 621 s 9]\nUpon receipt of a petition or resolution initiating an annexation, the chief administrative law judge shall designate a time and a place for a hearing in accordance with section 414.09.\nDuring the evidentiary hearing process, the presiding administrative law judge shall tour the proposed annexation area along with at least one representative of each of the affected towns and municipalities. Prior to the tour of the proposed annexation area, the affected towns and municipalities shall agree on the route or the administrative law judge shall determine the route for the affected towns and municipalities and resolve all disputes regarding the tour.\n(a) In arriving at a decision, the presiding administrative law judge shall consider the following sources and factors:\n(1) recordings and public documents from joint informational meetings under section 414.0333 relevant to other factors listed in this subdivision;\n(2) present population and number of households, past population and projected population growth of the annexing municipality and subject area and adjacent units of local government;\n(3) quantity of land within the subject area and adjacent units of local government; and natural terrain including recognizable physical features, general topography, major watersheds, soil conditions and such natural features as rivers, lakes and major bluffs;\n(4) degree of contiguity of the boundaries between the annexing municipality and the subject area;\n(5) present pattern of physical development, planning, and intended land uses in the subject area and the annexing municipality including residential, industrial, commercial, agricultural and institutional land uses and the impact of the proposed action on those land uses;\n(6) the present transportation network and potential transportation issues, including proposed highway development;\n(7) land use controls and planning presently being utilized in the annexing municipality and the subject area, including comprehensive plans for development in the area and plans and policies of the Metropolitan Council, and whether there are inconsistencies between proposed development and existing land use controls and the reasons therefore;\n(8) existing levels of governmental services being provided in the annexing municipality and the subject area, including water and sewer service, fire rating and protection, law enforcement, street improvements and maintenance, administrative services, and recreational facilities and the impact of the proposed action on the delivery of said services;\n(9) the implementation of previous annexation agreements and orders;\n(10) existing or potential environmental problems and whether the proposed action is likely to improve or resolve these problems;\n(11) plans and programs by the annexing municipality for providing needed and enhanced governmental services to the subject area in a cost-effective and feasible manner within a reasonable time from the date of the annexation;\n(12) an analysis of the fiscal impact on the annexing municipality, the subject area, and adjacent units of local government, including net tax capacity and the present bonded indebtedness, and the local tax rates of the county, school district, and township;\n(13) relationship and effect of the proposed action on affected and adjacent school districts and communities;\n(14) adequacy of town government to deliver services to the subject area;\n(15) analysis of whether necessary governmental services can best be provided through the proposed action or another type of boundary adjustment;\n(16) if only a part of a township is annexed, the ability of the remainder of the township to continue or the feasibility of it being incorporated separately or being annexed to another municipality; and\n(17) information received by the presiding administrative law judge from the tour required under subdivision 3a.\n(b) Based upon the factors, the presiding administrative law judge may order the annexation on finding:\n(1) that the subject area is now, or is about to become, urban or suburban in character;\n(2) that municipal government in the area proposed for annexation is required to protect the public health, safety, and welfare; or\n(3) that the annexation would be in the best interest of the subject area.\n(c) If only a part of a township is to be annexed, the presiding administrative law judge shall consider whether the remainder of the township can continue to carry on the functions of government without undue hardship.\n(d) The presiding administrative law judge shall deny the annexation on finding that the increase in revenues for the annexing municipality bears no reasonable relation to the monetary value of benefits conferred upon the annexed area.\n(e) The presiding administrative law judge may deny the annexation on finding:\n(1) that annexation of all or a part of the property to an adjacent municipality would better serve the interests of the residents of the property; or\n(2) that the remainder of the township would suffer undue hardship.\n(f) The presiding administrative law judge may alter the boundaries of the area to be annexed by increasing or decreasing the area so as to include only that property which is now or is about to become urban or suburban in character or to add property of such character abutting the area proposed for annexation in order to preserve or improve the symmetry of the area, or to exclude property that may better be served by another unit of government.\n(g) The presiding administrative law judge may also alter the boundaries of the proposed annexation so as to follow visible, clearly recognizable physical features.\n(h) If the presiding administrative law judge determines that part of the area would be better served by another municipality or township, the presiding administrative law judge may initiate and approve annexation by conducting further hearings and issuing orders pursuant to subdivisions 3 and 4.\n(i) In all cases, the presiding administrative law judge shall set forth the factors which are the basis for the decision.\n(a) Any annexation order under this section for annexation by a single municipality of an entire township shall include a provision for the election of new municipal officers in accordance with section 414.09. The chief administrative law judge, or the chief administrative law judge's designee, may also order an election of new municipal officers in accordance with section 414.09 as part of any other annexation order under this section if the chief administrative law judge or the chief administrative law judge's designee determines that such an election would be equitable.\n(b) The expanded municipality shall be governed by the home rule charter or statutory form which governs the annexing municipality, except that any ward system for the election of council members shall be inoperable.\n(c) The ordinances of both the annexing municipality and the township shall continue in effect within the former boundaries until repealed by the governing body of the new municipality.\n(d) Notwithstanding any other provision of law to the contrary, the chief administrative law judge, or the chief administrative law judge's designee, may provide for election of council members by wards, not less than three nor more than seven in number, whose limits are prescribed in the chief administrative law judge's order, upon a finding that area representation is required to accord proper representation in the municipality because of uneven population density in different parts thereof or the existence of agricultural lands therein which are in the path of suburban development; but after four years from the effective date of an annexation the council of the municipality may by resolution adopted by a four-fifths vote abolish the ward system and provide for the election of all council members at large.\n(e) Until the effective date of the annexation order, the town board and other officers of the town shall continue to exercise their powers and duties under the town laws in that portion of the municipality that was formerly the town, and the council and other officers of the annexing municipality shall continue to exercise their powers and duties in that portion of the expanded municipality that was formerly the municipality. Thereafter the town board and the council of the annexing municipality shall have no jurisdiction within the municipality, and the new municipal council and other new officers shall act in respect to any matters previously undertaken by the town board of supervisors or municipal council within the limits of the expanded municipality, including the making of any improvement and the levying of any special assessments therefor in the same manner and to the same effect as if such improvement had been undertaken by the municipality.\n(f) The new municipal council may continue or discontinue any board that may have previously existed in the town or former municipality.\nMS 1990 [Repealed, 1992 c 556 s 12]\nThe annexation shall be effective as of the date fixed in the annexation order or on a later date fixed in the annexation order.\nA copy of the annexation order must be delivered immediately by the chief administrative law judge to the appropriate county auditors.\nFor the purposes of taxation, if the annexation becomes effective on or before August 1 of a levy year, the municipality may levy on the annexed area beginning with that same levy year. If the annexation becomes effective after August 1 of a levy year, the town may continue to levy on the annexed area for that levy year, and the municipality may not levy on the annexed area until the following levy year.",
	"repealed": false
}