{
	"id": "116.391",
	"url": "https://www.revisor.mn.gov/statutes/cite/116.391",
	"title": "116.391 RESILIENT COMMUNITY ASSISTANCE PROGRAM.",
	"text": "This section may be cited as the \"Minnesota Resilient Community Act.\"\n(a) For purposes of this section, the terms defined in this subdivision have the meanings given.\n(b) \"Commissioner\" means the commissioner of the Pollution Control Agency.\n(c) \"Local government unit\" means any unit of government other than a state or federal unit of government and includes watershed districts established according to chapter 103D, soil and water conservation districts, watershed management organizations, counties, towns, cities, port authorities, housing authorities, regional development commissions, school districts, and the Metropolitan Council.\n(d) \"Tribal government\" means any of the Minnesota Tribal governments defined under section 10.65, subdivision 2, clause (4), and includes Tribal organizations designated by any of the Minnesota Tribal governments.\n(a) The commissioner must establish a resilient community assistance program to:\n(1) assist local government units, Tribal governments, and other relevant organizations as determined by the commissioner in adapting to and developing community resilience to impacts of climate change;\n(2) help coordinate climate adaptation planning, implementation, and evaluation efforts among state agencies, local government units, Tribal governments, and other relevant organizations; and\n(3) address inequities due to social, economic, historical, and political factors that result in some communities having less ability to prepare for, cope with, and recover from impacts of climate change.\n(b) To address inequities under paragraph (a), clause (3), the commissioner must seek input and collaboration from disproportionately impacted communities.\nThe resilient community assistance program may include but is not limited to:\n(1) developing, assembling, and disseminating information on climate adaptation and resilience;\n(2) technical assistance for climate adaptation and resilience;\n(3) financial assistance programs that provide grants or loans for resilience planning and for implementing climate adaptation and resilience actions, coordinated with the Public Facilities Authority, as necessary, for state bond-funded projects;\n(4) outreach, including seminars, workshops, training programs, and other similar activities, designed to provide education and information on climate adaptation and resilience to local government units, Tribal governments, and other relevant organizations as determined by the commissioner;\n(5) coordinating, implementing, and measuring progress on climate adaptation and resilience and measuring local government and Tribal government climate adaptation in Minnesota; and\n(6) other efforts needed to support climate adaptation and community resilience in Minnesota as determined by the commissioner.\n(a) In administering the program, the commissioner may coordinate with administrators of other public and private programs that provide technical and financial assistance to local government units, Tribal governments, and other relevant organizations that receive assistance under this section.\n(b) The commissioner may make grants to or enter into contracts with public or private entities to operate elements of the program. Grantees under this paragraph must provide the commissioner with periodic reports on their efforts to assist in administering the program.\n(c) When operating or participating in elements of the program according to a grant or contract under paragraph (b), a person is an employee of the state who is certified to be acting within the scope of employment for purposes of indemnification under section 3.736, subdivision 9, for claims that arise out of the information, assistance, and recommendations covered by the grant or contract. The state is not obligated to defend or indemnify a grantee or contractor under this subdivision to the extent of the grantee's or contractor's liability insurance. The grantee's or contractor's right to indemnity is not a waiver of limitations, defenses, and immunities available to either the grantee or contractor or the state by law.\nThe governor or commissioner may issue annual awards in the form of a commendation for excellence in climate adaptation and resilience. The commissioner must administer applications for the awards.",
	"repealed": false
}