{
	"id": "628.69",
	"url": "https://www.revisor.mn.gov/statutes/cite/628.69",
	"title": "628.69 PRETRIAL DIVERSION PROGRAM FOR WRITERS OF DISHONORED CHECKS.",
	"text": "As used in this section:\n(1) a person is an \"offender\" if the person is charged with, or probable cause exists to arrest or charge the person with, a violation of section 609.535, but the person has not yet entered a plea in the proceedings;\n(2) \"pretrial diversion\" means the decision of a prosecutor to refer an offender to a diversion program on condition that the criminal charges against the offender will be dismissed after a specified period of time, or the case will not be charged, if the offender successfully completes the program; and\n(3) \"prosecutor\" means a city or county attorney.\nA prosecutor may establish a pretrial diversion program for offenders. The program may be conducted by the prosecutor or by a private entity under contract with the prosecutor.\nIn determining whether to accept an offender for pretrial diversion, the prosecutor shall consider:\n(1) the value of the dishonored check or checks;\n(2) whether the offender has a criminal record or has previously been diverted under this section or any other diversion program;\n(3) the number of dishonored check grievances against the offender previously received by the prosecutor;\n(4) whether there are other dishonored check grievances currently pending against the offender;\n(5) the strength of the evidence, if any, of intent to defraud the victim; and\n(6) the wishes of the victim regarding placement in the program.\n(a) At a minimum, the pretrial diversion program must require offenders to:\n(1) successfully complete an appropriate educational class or classes at their own expense which includes information on writing checks and managing money;\n(2) make full restitution to the victim of the offense; and\n(3) pay appropriate penalties under section 604.113, subdivision 2, paragraph (a).\n(b) If the prosecutor determines that requiring an offender to pay for the educational class described in paragraph (a), clause (1), would result in an economic hardship to the offender or the offender's family, the prosecutor may waive the requirement.\nA victim of an offender who successfully completes a pretrial diversion program under this section may not recover the penalties described in section 604.113, subdivision 2, paragraph (b), if the penalties relate to the offense resulting in completion of the diversion program.\nEvery county attorney who has established a pretrial diversion program under this section shall report the following information to the Bureau of Criminal Apprehension:\n(1) the name and date of birth of each diversion program participant, and any other identifying information the superintendent considers necessary;\n(2) the date on which the individual began to participate in the diversion program;\n(3) the date on which the individual is expected to complete the diversion program;\n(4) the date on which the individual successfully completed the diversion program, where applicable; and\n(5) the date on which the individual was removed from the diversion program for failure to successfully complete the individual's goals, where applicable.\nThe superintendent shall cause the information described in this subdivision to be entered into and maintained in the criminal history file as defined in section 13.87.\nBy January 15 of each odd-numbered year, each prosecutor shall report to the supreme court and the chairs of the senate and house of representatives committees having jurisdiction over criminal justice policy on the operation of any pretrial diversion program established under this section. The report must include a description of the program, the number of offenders participating in the program, the number and characteristics of the offenders who successfully complete the program, the number and characteristics of the offenders who fail to complete the program, and an evaluation of the program's effect on the operation of the criminal justice system within the prosecutor's jurisdiction.",
	"repealed": false
}