{
	"id": "80E.13",
	"url": "https://www.revisor.mn.gov/statutes/cite/80E.13",
	"title": "80E.13 UNFAIR PRACTICES BY MANUFACTURERS, DISTRIBUTORS, FACTORY BRANCHES.",
	"text": "It is unlawful and an unfair practice for a manufacturer, distributor, or factory branch to engage in any of the following practices directly or through an entity that it controls or is controlled by:\n(a) delay, refuse, or fail to deliver new motor vehicles or new motor vehicle parts or accessories in reasonable time and in reasonable quantity relative to the new motor vehicle dealer's facilities and sales potential in the dealer's relevant market area, after having accepted an order from a new motor vehicle dealer having a franchise for the retail sale of any new motor vehicle sold or distributed by the manufacturer or distributor, if the new motor vehicle or new motor vehicle parts or accessories are publicly advertised as being available for delivery or actually being delivered. This clause is not violated, however, if the failure is caused by acts or causes beyond the control of the manufacturer;\n(b) refuse to disclose to any new motor vehicle dealer handling the same line make, the manner and mode of distribution of that line make within the relevant market area;\n(c) obtain money, goods, service, or any other benefit from any other person with whom the dealer does business, on account of, or in relation to, the transaction between the dealer and the other person, other than for compensation for services rendered, unless the benefit is promptly accounted for, and transmitted to, the new motor vehicle dealer;\n(d) increase prices of new motor vehicles which the new motor vehicle dealer had ordered for private retail consumers prior to the dealer's receiving the written official price increase notification. A sales contract signed by a private retail consumer shall constitute evidence of each order if the vehicle is in fact delivered to that customer. In the event of manufacturer price reductions, the amount of any reduction received by a dealer shall be passed on to the private retail consumer by the dealer if the retail price was negotiated on the basis of the previous higher price to the dealer;\n(e) offer any refunds or other types of inducements to any new motor vehicle dealer for the purchase of new motor vehicles of a certain line make without making the same offer to all other new motor vehicle dealers in the same line make within geographic areas reasonably determined by the manufacturer;\n(f) release to any outside party, except under subpoena or in an administrative or judicial proceeding involving the manufacturer or dealer, any business, financial, or personal information which may be provided by the dealer to the manufacturer, without the express written consent of the dealer or unless pertinent to judicial or governmental administrative proceedings or to arbitration proceedings of any kind;\n(g) deny any new motor vehicle dealer the right of free association with any other new motor vehicle dealer for any lawful purpose;\n(h) unfairly discriminate among its new motor vehicle dealers with respect to warranty reimbursement or authority granted its new vehicle dealers to make warranty adjustments with retail customers;\n(i) compete with a new motor vehicle dealer in the same line make operating under an agreement or franchise from the same manufacturer, distributor, or factory branch. A manufacturer, distributor, or factory branch is considered to be competing when it has an ownership interest, other than a passive interest held for investment purposes, in a dealership of its line make in this state, or in a dealership of a competing line make in this state. A manufacturer, distributor, or factory branch shall not, however, be deemed to be competing when operating a dealership, either temporarily or for a reasonable period, which is for sale to any qualified independent person at a fair and reasonable price, or when involved in a bona fide relationship in which an independent person has made a significant investment subject to loss in the dealership and can reasonably expect to acquire full ownership and full management and operational control of the dealership within a reasonable time on reasonable terms and conditions;\n(j) prevent a new motor vehicle dealer from transferring or assigning a new motor vehicle dealership to a qualified transferee. There shall be no transfer, assignment of the franchise, or major change in the executive management of the dealership, except as is otherwise provided in sections 80E.01 to 80E.17, without consent of the manufacturer, which shall not be withheld without good cause. In determining whether good cause exists for withholding consent to a transfer or assignment, the manufacturer, distributor, factory branch, or importer has the burden of proving that the transferee is a person who is not of good moral character or does not meet the franchisor's existing and reasonable capital standards and, considering the volume of sales and service of the new motor vehicle dealer, reasonable business experience standards in the market area. Denial of the request must be in writing and delivered to the new motor vehicle dealer within 60 days after the manufacturer receives the completed application customarily used by the manufacturer, distributor, factory branch, or importer for dealer appointments. If a denial is not sent within this period, the manufacturer shall be deemed to have given its consent to the proposed transfer or change. In the event of a proposed sale or transfer of a franchise, the manufacturer, distributor, factory branch, or importer shall be permitted to exercise a right of first refusal to acquire the franchisee's assets or ownership if:\n(1) the franchise agreement permits the manufacturer, distributor, factory branch, or importer to exercise a right of first refusal to acquire the franchisee's assets or ownership in the event of a proposed sale or transfer;\n(2) the proposed transfer of the dealership or its assets is of more than 50 percent of the ownership or assets;\n(3) the manufacturer, distributor, factory branch, or importer notifies the dealer in writing within 60 days of its receipt of the complete written proposal for the proposed sale or transfer on forms generally utilized by the manufacturer, distributor, factory branch, or importer for such purposes and containing the information required therein and all documents and agreements relating to the proposed sale or transfer;\n(4) the exercise of the right of first refusal will result in the dealer and dealer's owners receiving the same or greater consideration with equivalent terms of sale as is provided in the documents and agreements submitted to the manufacturer, distributor, factory branch, or importer under clause (3);\n(5) the proposed change of 50 percent or more of the ownership or of the dealership assets does not involve the transfer or sale of assets or the transfer or issuance of stock by the dealer or one or more dealer owners to a family member, including a spouse, child, stepchild, grandchild, spouse of a child or grandchild, brother, sister, or parent of the dealer owner; to a manager who has been employed in the dealership for at least four years and is otherwise qualified as a dealer operator; or to a partnership or corporation owned and controlled by one or more of such persons; and\n(6) the manufacturer, distributor, factory branch, or importer agrees to pay the reasonable expenses, including reasonable attorney fees, which do not exceed the usual customary and reasonable fees charged for similar work done for other clients incurred by the proposed new owner and transferee before the manufacturer, distributor, factory branch, or importer exercises its right of first refusal, in negotiating and implementing the contract for the proposed change of ownership or transfer of dealership assets. However, payment of such expenses and attorney fees shall not be required if the dealer has not submitted or caused to be submitted an accounting of those expenses within 20 days after the dealer's receipt of the manufacturer, distributor, factory branch, or importer's written request for such an accounting. The manufacturer, distributor, factory branch, or importer may request such an accounting before exercising its right of first refusal. The obligation created under this clause is enforceable by the transferee;\n(k) threaten to modify or replace or modify or replace a franchise with a succeeding franchise that would adversely alter the rights or obligations of a new motor vehicle dealer under an existing franchise or that substantially impairs the sales or service obligations or investments of the motor vehicle dealer;\n(l) unreasonably deny the right to acquire factory program vehicles to any dealer holding a valid franchise from the manufacturer to sell the same line make of vehicles, provided that the manufacturer may impose reasonable restrictions and limitations on the purchase or resale of program vehicles to be applied equitably to all of its franchised dealers. For the purposes of this paragraph, \"factory program vehicle\" has the meaning given the term in section 80E.06, subdivision 2;\n(m) except as provided in paragraph (n), fail or refuse to offer to its same line make franchised dealers all models manufactured for that line make, including alternative fuel vehicles as defined in section 216C.01, subdivision 1b. Failure to offer a model is not a violation of this section if the failure is not arbitrary and is due to a lack of manufacturing capacity, a strike, labor difficulty, or other cause over which the manufacturer, distributor, or factory branch has no control;\n(n) require a dealer to pay an extra fee, or remodel, renovate, or recondition the dealer's existing facilities, or purchase unreasonable advertising displays, training, tools, or other materials, or to require the dealer to establish exclusive facilities or dedicated personnel as a prerequisite to receiving a model or a series of vehicles. A manufacturer, distributor, or factory branch may require a dealer to comply with reasonable requirements for the sale and service of an alternative fuel vehicle or to serve an alternative fuel vehicle customer;\n(o) require a dealer by program, incentive provision, or otherwise to adhere to performance standards that are not applied uniformly to other similarly situated dealers.\nA performance standard, sales objective, or program for measuring dealership performance that may have a material effect on a dealer, including the dealer's right to payment under any incentive or reimbursement program, and the application of the standard or program by a manufacturer, distributor, or factory branch must be fair, reasonable, equitable, and based on accurate information. Upon written request by any of its franchised dealers located within Minnesota, a manufacturer, distributor, or factory branch must provide the method or formula used by the manufacturer in establishing the sales volumes for receiving a rebate or incentive and the specific calculations for determining the required sales volumes of the inquiring dealer and any of the manufacturer's other Minnesota-franchised new motor vehicle dealers of the same line-make located within 75 miles of the inquiring dealer. Nothing contained in this section requires a manufacturer, distributor, or factory branch to disclose confidential business information of any of its franchised dealers or the required numerical sales volumes that any of its franchised dealers must attain to receive a rebate or incentive. An inquiring dealer may file a civil action as provided in section 80E.17 without a showing of injury if a manufacturer, distributor, or factory branch fails to make the disclosure required by this section.\nA manufacturer, distributor, or factory branch has the burden of proving that the performance standard, sales objective, or program for measuring dealership performance is fair, reasonable, and uniformly applied under this section;\n(p) assign or change a dealer's area of sales effectiveness arbitrarily or without due regard to the present pattern of motor vehicle sales and registrations within the dealer's market. The manufacturer, distributor, or factory branch must provide at least 90 days' notice of the proposed change. The change may not take effect if the dealer commences a civil action within the 90 days' notice period to determine whether the manufacturer, distributor, or factory branch met its obligations under this section. The burden of proof in such an action shall be on the manufacturer or distributor. In determining at the evidentiary hearing whether a manufacturer, distributor, or factory branch has assigned or changed the dealer's area of sales effectiveness or is proposing to assign or change the dealer's area of sales effectiveness arbitrarily or without due regard to the present pattern of motor vehicle sales and registrations within the dealer's market, the court may take into consideration the relevant circumstances, including, but not limited to:\n(1) the traffic patterns between consumers and the same line-make franchised dealers of the affected manufacturer, distributor, or factory branch who are located within the market;\n(2) the pattern of new vehicle sales and registrations of the affected manufacturer, distributor, or factory branch within various portions of the area of sales effectiveness and within the market as a whole;\n(3) the growth or decline in population, density of population, and new car registrations in the market;\n(4) the presence or absence of natural geographical obstacles or boundaries, such as rivers;\n(5) the proximity of census tracts or other geographic units used by the affected manufacturer, factory branch, distributor, or distributor branch in determining the same line-make dealers' respective areas of sales effectiveness; and\n(6) the reasonableness of the change or proposed change to the dealer's area of sales effectiveness, considering the benefits and harm to the petitioning dealer, other same line-make dealers, and the manufacturer, distributor, or factory branch;\n(q) to charge back, withhold payment, deny vehicle allocation, or take any other adverse action against a dealer when a new vehicle sold by the dealer has been exported to a foreign country, unless the manufacturer, distributor, or factory branch can show that at the time of sale, the customer's information was listed on a known or suspected exporter list made available to the dealer, or the dealer knew or reasonably should have known of the purchaser's intention to export or resell the motor vehicle in violation of the manufacturer's export policy. There is a rebuttable presumption that the dealer did not know or should not have reasonably known that the vehicle would be exported or resold in violation of the manufacturer's export policy if the vehicle is titled and registered in any state of the United States;\n(r) to implement a charge back or withhold payment to a dealer that is solely due to an unreasonable delay by the registrar, as defined in section 168.002, subdivision 29, in the transfer or registration of a new motor vehicle. The dealer must give the manufacturer notice of the state's delay in writing. Within 30 days of any notice of a charge back, withholding of payments, or denial of a claim, the dealer must transmit to the manufacturer: (1) documentation to demonstrate the vehicle sale and delivery as reported; and (2) a written attestation signed by the dealer operator or general manager stating that the delay is attributable to the state. This clause expires on June 30, 2022; or\n(s) to require a dealer or prospective dealer by program, incentive provision, or otherwise to construct improvements to its or a predecessor's facilities or to install new signs or other franchisor image elements that replace or substantially alter improvements, signs, or franchisor image elements completed within the preceding ten years that were required and approved by the manufacturer, distributor, or factory branch, including any such improvements, signs, or franchisor image elements that were required as a condition of the dealer or predecessor dealer receiving an incentive or other compensation from the manufacturer, distributor, or factory branch.\nThis paragraph shall not apply to a program or agreement that provides lump sum payments to assist dealers in making facility improvements or to pay for signs or franchisor image elements when such payments are not dependent on the dealer selling or purchasing specific numbers of new vehicles and shall not apply to a program that is in effect with more than one Minnesota dealer on August 1, 2018, nor to any renewal of such program, nor to a modification that is not a substantial modification of a material term or condition of such program.",
	"repealed": false
}