{
	"id": "256B.85",
	"url": "https://www.revisor.mn.gov/statutes/cite/256B.85",
	"title": "256B.85 COMMUNITY FIRST SERVICES AND SUPPORTS.",
	"text": "(a) Upon federal approval, the commissioner shall establish a state plan option for the provision of home and community-based personal assistance service and supports called \"community first services and supports (CFSS).\"\n(b) CFSS is a participant-controlled method of selecting and providing services and supports that allows the participant maximum control of the services and supports. Participants may choose the degree to which they direct and manage their supports by choosing to have a significant and meaningful role in the management of services and supports including by directly employing support workers with the necessary supports to perform that function.\n(c) CFSS is available statewide to eligible people to assist with accomplishing activities of daily living (ADLs), instrumental activities of daily living (IADLs), and health-related procedures and tasks through hands-on assistance to accomplish the task or constant supervision and cueing to accomplish the task; and to assist with acquiring, maintaining, and enhancing the skills necessary to accomplish ADLs, IADLs, and health-related procedures and tasks. CFSS allows payment for the participant for certain supports and goods such as environmental modifications and technology that are intended to replace or decrease the need for human assistance.\n(d) Upon federal approval, CFSS will replace the personal care assistance program under sections 256.476, 256B.0625, subdivisions 19a and 19c, and 256B.0659.\n(e) For the purposes of this section, notwithstanding the provisions of section 144A.43, subdivision 3, supports purchased under CFSS are not considered home care services.\n(a) For the purposes of this section and section 256B.851, the terms defined in this subdivision have the meanings given.\n(b) \"Activities of daily living\" or \"ADLs\" means:\n(1) dressing, including assistance with choosing, applying, and changing clothing and applying special appliances, wraps, or clothing;\n(2) grooming, including assistance with basic hair care, oral care, shaving, applying cosmetics and deodorant, and care of eyeglasses and hearing aids. Grooming includes nail care, except for recipients who are diabetic or have poor circulation;\n(3) bathing, including assistance with basic personal hygiene and skin care;\n(4) eating, including assistance with hand washing and applying orthotics required for eating or feeding;\n(5) transfers, including assistance with transferring the participant from one seating or reclining area to another;\n(6) mobility, including assistance with ambulation and use of a wheelchair. Mobility does not include providing transportation for a participant;\n(7) positioning, including assistance with positioning or turning a participant for necessary care and comfort; and\n(8) toileting, including assistance with bowel or bladder elimination and care, transfers, mobility, positioning, feminine hygiene, use of toileting equipment or supplies, cleansing the perineal area, inspection of the skin, and adjusting clothing.\n(c) \"Agency-provider model\" means a method of CFSS under which a qualified agency provides services and supports through the agency's own employees and policies. The agency must allow the participant to have a significant role in the selection and dismissal of support workers of their choice for the delivery of their specific services and supports.\n(d) \"Behavior\" means a description of a need for services and supports used to determine the home care rating and additional service units. The presence of Level I behavior is used to determine the home care rating.\n(e) \"Budget model\" means a service delivery method of CFSS that allows the use of a service budget and assistance from a financial management services (FMS) provider for a participant to directly employ support workers and purchase supports and goods.\n(f) \"Complex health-related needs\" means an intervention listed in clauses (1) to (8) that has been ordered by a physician, advanced practice registered nurse, or physician's assistant and is specified in an assessment summary, including:\n(1) tube feedings requiring:\n(i) a gastrojejunostomy tube; or\n(ii) continuous tube feeding lasting longer than 12 hours per day;\n(2) wounds described as:\n(i) stage III or stage IV;\n(ii) multiple wounds;\n(iii) requiring sterile or clean dressing changes or a wound vac; or\n(iv) open lesions such as burns, fistulas, tube sites, or ostomy sites that require specialized care;\n(3) parenteral therapy described as:\n(i) IV therapy more than two times per week lasting longer than four hours for each treatment; or\n(ii) total parenteral nutrition (TPN) daily;\n(4) respiratory interventions, including:\n(i) oxygen required more than eight hours per day;\n(ii) respiratory vest more than one time per day;\n(iii) bronchial drainage treatments more than two times per day;\n(iv) sterile or clean suctioning more than six times per day;\n(v) dependence on another to apply respiratory ventilation augmentation devices such as BiPAP and CPAP; and\n(vi) ventilator dependence under section 256B.0651;\n(5) insertion and maintenance of catheter, including:\n(i) sterile catheter changes more than one time per month;\n(ii) clean intermittent catheterization, and including self-catheterization more than six times per day; or\n(iii) bladder irrigations;\n(6) bowel program more than two times per week requiring more than 30 minutes to perform each time;\n(7) neurological intervention, including:\n(i) seizures more than two times per week and requiring significant physical assistance to maintain safety; or\n(ii) swallowing disorders diagnosed by a physician, advanced practice registered nurse, or physician's assistant and requiring specialized assistance from another on a daily basis; and\n(8) other congenital or acquired diseases creating a need for significantly increased direct hands-on assistance and interventions in six to eight activities of daily living.\n(g) \"Community first services and supports\" or \"CFSS\" means the assistance and supports program under this section needed for accomplishing activities of daily living, instrumental activities of daily living, and health-related tasks through hands-on assistance to accomplish the task or constant supervision and cueing to accomplish the task, or the purchase of goods as defined in subdivision 7, clause (3), that replace the need for human assistance.\n(h) \"Community first services and supports service delivery plan\" or \"CFSS service delivery plan\" means a written document detailing the services and supports chosen by the participant to meet assessed needs that are within the approved CFSS service authorization, as determined in subdivision 8. Services and supports are based on the support plan identified in sections 256B.092, subdivision 1b, and 256S.10.\n(i) \"Consultation services\" means a Minnesota health care program enrolled provider organization that provides assistance to the participant in making informed choices about CFSS services in general and self-directed tasks in particular, and in developing a person-centered CFSS service delivery plan to achieve quality service outcomes.\n(j) \"Critical activities of daily living\" means transferring, mobility, eating, and toileting.\n(k) \"Dependency\" in activities of daily living means a person requires hands-on assistance or constant supervision and cueing to accomplish one or more of the activities of daily living every day or on the days during the week that the activity is performed; however, a child must not be found to be dependent in an activity of daily living if, because of the child's age, an adult would either perform the activity for the child or assist the child with the activity and the assistance needed is the assistance appropriate for a typical child of the same age.\n(l) \"Extended CFSS\" means CFSS services and supports provided under CFSS that are included in the CFSS service delivery plan through one of the home and community-based services waivers and as approved and authorized under chapter 256S and sections 256B.092, subdivision 5, and 256B.49, which exceed the amount, duration, and frequency of the state plan CFSS services for participants. Extended CFSS excludes the purchase of goods.\n(m) \"Financial management services provider\" or \"FMS provider\" means a qualified organization required for participants using the budget model under subdivision 13 that is an enrolled provider with the department to provide vendor fiscal/employer agent financial management services (FMS).\n(n) \"Health-related procedures and tasks\" means procedures and tasks related to the specific assessed health needs of a participant that can be taught or assigned by a state-licensed health care or mental health professional and performed by a support worker.\n(o) \"Instrumental activities of daily living\" means activities related to living independently in the community, including but not limited to: meal planning, preparation, and cooking; shopping for food, clothing, or other essential items; laundry; housecleaning; assistance with medications; managing finances; communicating needs and preferences during activities; arranging supports; and assistance with traveling around and participating in the community, including traveling to medical appointments. For purposes of this paragraph, traveling includes driving and accompanying the recipient in the recipient's chosen mode of transportation and according to the individual CFSS service delivery plan.\n(p) \"Lead agency\" has the meaning given in section 256B.0911, subdivision 10.\n(q) \"Legal representative\" means parent of a minor, a court-appointed guardian, or another representative with legal authority to make decisions about services and supports for the participant. Other representatives with legal authority to make decisions include but are not limited to a health care agent or an attorney-in-fact authorized through a health care directive or power of attorney.\n(r) \"Level I behavior\" means physical aggression toward self or others or destruction of property that requires the immediate response of another person.\n(s) \"Medication assistance\" means providing verbal or visual reminders to take regularly scheduled medication, and includes any of the following supports listed in clauses (1) to (3) and other types of assistance, except that a support worker must not determine medication dose or time for medication or inject medications into veins, muscles, or skin:\n(1) under the direction of the participant or the participant's representative, bringing medications to the participant including medications given through a nebulizer, opening a container of previously set-up medications, emptying the container into the participant's hand, opening and giving the medication in the original container to the participant, or bringing to the participant liquids or food to accompany the medication;\n(2) organizing medications as directed by the participant or the participant's representative; and\n(3) providing verbal or visual reminders to perform regularly scheduled medications.\n(t) \"Participant\" means a person who is eligible for CFSS.\n(u) \"Participant's representative\" means a parent, family member, advocate, or other adult authorized by the participant or participant's legal representative, if any, to serve as a representative in connection with the provision of CFSS. If the participant is unable to assist in the selection of a participant's representative, the legal representative shall appoint one.\n(v) \"Person-centered planning process\" means a process that is directed by the participant to plan for CFSS services and supports.\n(w) \"Service budget\" means the authorized dollar amount used for the budget model or for the purchase of goods.\n(x) \"Shared services\" means the provision of CFSS services by the same CFSS support worker to two or three participants who voluntarily enter into a written agreement to receive services at the same time, in the same setting, and through the same agency-provider or FMS provider.\n(y) \"Support worker\" means a qualified and trained employee of the agency-provider as required by subdivision 11b or of the participant employer under the budget model as required by subdivision 14 who has direct contact with the participant and provides services as specified within the participant's CFSS service delivery plan.\n(z) \"Unit\" means the increment of service based on hours or minutes identified in the service agreement.\n(aa) \"Vendor fiscal employer agent\" means an agency that provides financial management services.\n(bb) \"Wages and benefits\" means the hourly wages and salaries, the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, workers' compensation, mileage reimbursement, health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, contributions to employee retirement accounts, or other forms of employee compensation and benefits.\n(cc) \"Worker training and development\" means services provided according to subdivision 18a for developing workers' skills as required by the participant's individual CFSS service delivery plan that are arranged for or provided by the agency-provider or purchased by the participant employer. These services include training, education, direct observation and supervision, and evaluation and coaching of job skills and tasks, including supervision of health-related tasks or behavioral supports.\n[See Note.]\n(a) CFSS is available to a person who:\n(1) is determined eligible for medical assistance under this chapter, excluding those under section 256B.057, subdivisions 3, 3a, 3b, and 4;\n(2) is a participant in the alternative care program under section 256B.0913;\n(3) is a waiver participant as defined under chapter 256S or section 256B.092, 256B.093, or 256B.49; or\n(4) has medical services identified in a person's individualized education program and is eligible for services as determined in section 256B.0625, subdivision 26.\n(b) In addition to meeting the eligibility criteria in paragraph (a), a person must also meet all of the following:\n(1) require assistance and be determined dependent in one activity of daily living or Level I behavior based on assessment under section 256B.0911; and\n(2) is not a participant under a family support grant under section 252.32.\n(c) A pregnant woman eligible for medical assistance under section 256B.055, subdivision 6, is eligible for CFSS without federal financial participation if the woman: (1) is eligible for CFSS under paragraphs (a) and (b); and (2) does not meet institutional level of care, as determined under section 256B.0911.\nSelection of CFSS by a participant must not restrict access to other medically necessary care and services furnished under the state plan benefit or other services available through the alternative care program.\n(a) The assessment of functional need must:\n(1) be conducted by a certified assessor according to the criteria established in section 256B.0911, subdivisions 17 to 21, 23, 24, and 29 to 31;\n(2) be conducted face-to-face, initially and at least annually thereafter, or when there is a significant change in the participant's condition or a change in the need for services and supports, or at the request of the participant when the participant experiences a change in condition or needs a change in the services or supports; and\n(3) be completed using the format established by the commissioner.\n(b) The results of the assessment and any recommendations and authorizations for CFSS must be determined and communicated in writing by the lead agency's assessor as defined in section 256B.0911 to the participant or the participant's representative and chosen CFSS providers within ten business days and must include the participant's right to appeal the assessment under section 256.045, subdivision 3.\n(c) The lead agency assessor may authorize a temporary authorization for CFSS services to be provided under the agency-provider model. The lead agency assessor may authorize a temporary authorization for CFSS services to be provided under the agency-provider model without using the assessment process described in this subdivision. Authorization for a temporary level of CFSS services under the agency-provider model is limited to the time specified by the commissioner, but shall not exceed 45 days. The level of services authorized under this paragraph shall have no bearing on a future authorization. For CFSS services needed beyond the 45-day temporary authorization, the lead agency must conduct an assessment as described in this subdivision and participants must use consultation services to complete their orientation and selection of a service model.\n(a) The CFSS service delivery plan must be developed and evaluated through a person-centered planning process by the participant, or the participant's representative or legal representative who may be assisted by a consultation services provider. The CFSS service delivery plan must reflect the services and supports that are important to the participant and for the participant to meet the needs assessed by the certified assessor and identified in the support plan identified in sections 256B.092, subdivision 1b, and 256S.10. The CFSS service delivery plan must be reviewed by the participant, the consultation services provider, and the agency-provider or FMS provider prior to starting services and at least annually upon reassessment, or when there is a significant change in the participant's condition, or a change in the need for services and supports.\n(b) The commissioner shall establish the format and criteria for the CFSS service delivery plan.\n(c) The CFSS service delivery plan must be person-centered and:\n(1) specify the consultation services provider, agency-provider, or FMS provider selected by the participant;\n(2) reflect the setting in which the participant resides that is chosen by the participant;\n(3) reflect the participant's strengths and preferences;\n(4) include the methods and supports used to address the needs as identified through an assessment of functional needs;\n(5) include the participant's identified goals and desired outcomes;\n(6) reflect the services and supports, paid and unpaid, that will assist the participant to achieve identified goals, including the costs of the services and supports, and the providers of those services and supports, including natural supports;\n(7) identify the amount and frequency of face-to-face supports and amount and frequency of remote supports and technology that will be used;\n(8) identify risk factors and measures in place to minimize them, including individualized backup plans;\n(9) be understandable to the participant and the individuals providing support;\n(10) identify the individual or entity responsible for monitoring the plan;\n(11) be finalized and agreed to in writing by the participant and signed by individuals and providers responsible for its implementation;\n(12) be distributed to the participant and other people involved in the plan;\n(13) prevent the provision of unnecessary or inappropriate care;\n(14) include a detailed budget for expenditures for budget model participants or participants under the agency-provider model if purchasing goods; and\n(15) include a plan for worker training and development provided according to subdivision 18a detailing what service components will be used, when the service components will be used, how they will be provided, and how these service components relate to the participant's individual needs and CFSS support worker services.\n(d) The CFSS service delivery plan must describe the units or dollar amount available to the participant. The total units of agency-provider services or the service budget amount for the budget model include both annual totals and a monthly average amount that cover the number of months of the service agreement. The amount used each month may vary, but additional funds must not be provided above the annual service authorization amount, determined according to subdivision 8, unless a change in condition is assessed and authorized by the certified assessor and documented in the support plan and CFSS service delivery plan.\n(e) In assisting with the development or modification of the CFSS service delivery plan during the authorization time period, the consultation services provider shall:\n(1) consult with the FMS provider on the spending budget when applicable; and\n(2) consult with the participant or participant's representative, agency-provider, and case manager or care coordinator.\n(f) The CFSS service delivery plan must be approved by the lead agency for participants without a case manager or care coordinator who is responsible for authorizing services. A case manager or care coordinator must approve the plan for a waiver or alternative care program participant.\nThe person-centered planning process must:\n(1) include people chosen by the participant;\n(2) provide necessary information and support to ensure that the participant directs the process to the maximum extent possible, and is enabled to make informed choices and decisions;\n(3) be timely and occur at times and locations convenient to the participant;\n(4) reflect cultural considerations of the participant;\n(5) include within the process strategies for solving conflict or disagreement, including clear conflict-of-interest guidelines as identified in Code of Federal Regulations, title 42, section 441.540, for all planning;\n(6) provide the participant choices of the services and supports the participant receives and the staff providing those services and supports;\n(7) include a method for the participant to request updates to the plan; and\n(8) record the alternative home and community-based settings that were considered by the participant.\nServices and supports covered under CFSS include:\n(1) assistance to accomplish activities of daily living (ADLs), instrumental activities of daily living (IADLs), and health-related procedures and tasks through hands-on assistance to accomplish the task or constant supervision and cueing to accomplish the task;\n(2) assistance to acquire, maintain, or enhance the skills necessary for the participant to accomplish activities of daily living, instrumental activities of daily living, or health-related tasks;\n(3) expenditures for items, services, supports, environmental modifications, or goods, including assistive technology. These expenditures must:\n(i) relate to a need identified in a participant's CFSS service delivery plan; and\n(ii) increase independence or substitute for human assistance, to the extent that expenditures would otherwise be made for human assistance for the participant's assessed needs;\n(4) observation and redirection for behavior or symptoms where there is a need for assistance;\n(5) back-up systems or mechanisms, such as the use of pagers or other electronic devices, to ensure continuity of the participant's services and supports;\n(6) services provided by a consultation services provider as defined under subdivision 17, that is under contract with the department and enrolled as a Minnesota health care program provider;\n(7) services provided by an FMS provider as defined under subdivision 13a, that is an enrolled provider with the department;\n(8) CFSS services provided by a support worker who is a parent, stepparent, or legal guardian of a participant under age 18, or who is the participant's spouse. Covered services under this clause are subject to the limitations described in subdivision 7b; and\n(9) worker training and development services as described in subdivision 18a.\n[See Note.]\n(a) An enhanced rate of 107.5 percent of the rate paid for CFSS must be paid for services provided to persons who qualify for ten or more hours of CFSS per day when provided by a support worker who meets the requirements of subdivision 16, paragraph (e).\n(b) An agency provider must use all additional revenue attributable to the rate enhancements under this subdivision for the wages and wage-related costs of the support workers, including any corresponding increase in the employer's share of FICA taxes, Medicare taxes, state and federal unemployment taxes, and workers' compensation premiums. The agency provider must not use the additional revenue attributable to any enhanced rate under this subdivision to pay for mileage reimbursement, health and dental insurance, life insurance, disability insurance, long-term care insurance, uniform allowance, contributions to employee retirement accounts, or any other employee benefits.\n(c) Any change in the eligibility criteria for the enhanced rate for CFSS as described in this subdivision and referenced in subdivision 16, paragraph (e), does not constitute a change in a term or condition for individual providers as defined in section 256B.0711, and is not subject to the state's obligation to meet and negotiate under chapter 179A.\n[See Note.]\n(a) This subdivision applies to services and supports described in subdivision 7, clause (8).\n(b) If multiple parents are support workers providing CFSS services to their minor child or children, each parent may provide up to 40 hours of medical assistance home and community-based services in any seven-day period regardless of the number of children served. The total number of hours of medical assistance home and community-based services provided by all of the parents must not exceed 80 hours in a seven-day period regardless of the number of children served.\n(c) If only one parent is a support worker providing CFSS services to the parent's minor child or children, the parent may provide up to 60 hours of medical assistance home and community-based services in a seven-day period regardless of the number of children served.\n(d) If a participant's spouse is a support worker providing CFSS services, the spouse may provide up to 60 hours of medical assistance home and community-based services in a seven-day period.\n(e) Paragraphs (b) to (d) must not be construed to permit an increase in either the total authorized service budget for an individual or the total number of authorized service units.\n(f) A parent or participant's spouse must not receive a wage that exceeds the current rate for a CFSS support worker, including wages, benefits, and payroll taxes.\n[See Note.]\n(a) All community first services and supports must be authorized by the commissioner or the commissioner's designee before services begin. The authorization for CFSS must be completed as soon as possible following an assessment but no later than 40 calendar days from the date of the assessment.\n(b) The amount of CFSS authorized must be based on the participant's home care rating described in paragraphs (d) and (e) and any additional service units for which the participant qualifies as described in paragraph (f).\n(c) The home care rating shall be determined by the commissioner or the commissioner's designee based on information submitted to the commissioner identifying the following for a participant:\n(1) the total number of dependencies of activities of daily living;\n(2) the presence of complex health-related needs; and\n(3) the presence of Level I behavior.\n(d) The methodology to determine the total service units for CFSS for each home care rating is based on the median paid units per day for each home care rating from fiscal year 2007 data for the PCA program.\n(e) Each home care rating is designated by the letters P through Z and EN and has the following base number of service units assigned:\n(1) P home care rating requires Level I behavior or one to three dependencies in ADLs and qualifies the person for five service units;\n(2) Q home care rating requires Level I behavior and one to three dependencies in ADLs and qualifies the person for six service units;\n(3) R home care rating requires a complex health-related need and one to three dependencies in ADLs and qualifies the person for seven service units;\n(4) S home care rating requires four to six dependencies in ADLs and qualifies the person for ten service units;\n(5) T home care rating requires four to six dependencies in ADLs and Level I behavior and qualifies the person for 11 service units;\n(6) U home care rating requires four to six dependencies in ADLs and a complex health-related need and qualifies the person for 14 service units;\n(7) V home care rating requires seven to eight dependencies in ADLs and qualifies the person for 17 service units;\n(8) W home care rating requires seven to eight dependencies in ADLs and Level I behavior and qualifies the person for 20 service units;\n(9) Z home care rating requires seven to eight dependencies in ADLs and a complex health-related need and qualifies the person for 30 service units; and\n(10) EN home care rating includes ventilator dependency as defined in section 256B.0651, subdivision 1, paragraph (g). A person who meets the definition of ventilator-dependent and the EN home care rating and utilize a combination of CFSS and home care nursing services is limited to a total of 96 service units per day for those services in combination. Additional units may be authorized when a person's assessment indicates a need for two staff to perform activities. Additional time is limited to 16 service units per day.\n(f) Additional service units are provided through the assessment and identification of the following:\n(1) 30 additional minutes per day for a dependency in each critical activity of daily living;\n(2) 30 additional minutes per day for each complex health-related need; and\n(3) 30 additional minutes per day for each behavior under this clause that requires assistance at least four times per week:\n(i) level I behavior that requires the immediate response of another person;\n(ii) increased vulnerability due to cognitive deficits or socially inappropriate behavior; or\n(iii) increased need for assistance for participants who are verbally aggressive or resistive to care so that the time needed to perform activities of daily living is increased.\n(g) The service budget for budget model participants shall be based on:\n(1) assessed units as determined by the home care rating; and\n(2) an adjustment needed for administrative expenses.\nAll CFSS services must be authorized by the commissioner or the commissioner's designee as described in subdivision 8 except when:\n(1) the lead agency temporarily authorizes services in the agency-provider model as described in subdivision 5, paragraph (c);\n(2) CFSS services in the agency-provider model were required to treat an emergency medical condition that if not immediately treated could cause a participant serious physical or mental disability, continuation of severe pain, or death. The CFSS agency provider must request retroactive authorization from the lead agency no later than five working days after providing the initial emergency service. The CFSS agency provider must be able to substantiate the emergency through documentation such as reports, notes, and admission or discharge histories. A lead agency must follow the authorization process in subdivision 5 after the lead agency receives the request for authorization from the agency provider;\n(3) the lead agency authorizes a temporary increase to the amount of services authorized in the agency or budget model to accommodate the participant's temporary higher need for services. Authorization for a temporary level of CFSS services is limited to the time specified by the commissioner, but shall not exceed 45 days. The level of services authorized under this clause shall have no bearing on a future authorization;\n(4) a participant's medical assistance eligibility has lapsed, is then retroactively reinstated, and an authorization for CFSS services is completed based on the date of a current assessment, eligibility, and request for authorization;\n(5) a third-party payer for CFSS services has denied or adjusted a payment. Authorization requests must be submitted by the provider within 20 working days of the notice of denial or adjustment. A copy of the notice must be included with the request;\n(6) the commissioner has determined that a lead agency or state human services agency has made an error; or\n(7) a participant enrolled in managed care experiences a temporary disenrollment from a health plan, in which case the commissioner shall accept the current health plan authorization for CFSS services for up to 60 days. The request must be received within the first 30 days of the disenrollment. If the recipient's reenrollment in managed care is after the 60 days and before 90 days, the provider shall request an additional 30-day extension of the current health plan authorization, for a total limit of 90 days from the time of disenrollment.\n(a) Services or supports that are not eligible for payment under this section include those that:\n(1) are not authorized by the certified assessor or included in the CFSS service delivery plan;\n(2) are provided prior to the authorization of services and the approval of the CFSS service delivery plan;\n(3) are duplicative of other paid services in the CFSS service delivery plan;\n(4) supplant natural unpaid supports that appropriately meet a need in the CFSS service delivery plan, are provided voluntarily to the participant, and are selected by the participant in lieu of other services and supports;\n(5) are not effective means to meet the participant's needs; and\n(6) are available through other funding sources, including but not limited to funding through title IV-E of the Social Security Act.\n(b) Additional services, goods, or supports that are not covered include:\n(1) those that are not for the direct benefit of the participant, except that services for caregivers such as training to improve the ability to provide CFSS are considered to directly benefit the participant if chosen by the participant and approved in the support plan;\n(2) any fees incurred by the participant, such as Minnesota health care programs fees and co-pays, legal fees, or costs related to advocate agencies;\n(3) insurance, except for insurance costs related to employee coverage;\n(4) room and board costs for the participant;\n(5) services, supports, or goods that are not related to the assessed needs;\n(6) special education and related services provided under the Individuals with Disabilities Education Act and vocational rehabilitation services provided under the Rehabilitation Act of 1973;\n(7) assistive technology devices and assistive technology services other than those for back-up systems or mechanisms to ensure continuity of service and supports listed in subdivision 7;\n(8) medical supplies and equipment covered under medical assistance;\n(9) environmental modifications, except as specified in subdivision 7;\n(10) expenses for travel, lodging, or meals related to training the participant or the participant's representative or legal representative;\n(11) experimental treatments;\n(12) any service or good covered by other state plan services, including prescription and over-the-counter medications, compounds, and solutions and related fees, including premiums and co-payments;\n(13) membership dues or costs, except when the service is necessary and appropriate to treat a health condition or to improve or maintain the adult participant's health condition. The condition must be identified in the participant's CFSS service delivery plan and monitored by a Minnesota health care program enrolled physician, advanced practice registered nurse, or physician's assistant;\n(14) vacation expenses other than the cost of direct services;\n(15) vehicle maintenance or modifications not related to the disability, health condition, or physical need;\n(16) tickets and related costs to attend sporting or other recreational or entertainment events;\n(17) services provided and billed by a provider who is not an enrolled CFSS provider;\n(18) CFSS provided by a participant's representative or paid legal guardian;\n(19) services that are used solely as a child care or babysitting service;\n(20) services that are the responsibility or in the daily rate of a residential or program license holder under the terms of a service agreement and administrative rules;\n(21) sterile procedures;\n(22) giving of injections into veins, muscles, or skin;\n(23) homemaker services that are not an integral part of the assessed CFSS service;\n(24) home maintenance or chore services;\n(25) home care services, including hospice services if elected by the participant, covered by Medicare or any other insurance held by the participant;\n(26) services to other members of the participant's household;\n(27) services not specified as covered under medical assistance as CFSS;\n(28) application of restraints or implementation of deprivation procedures;\n(29) assessments by CFSS provider organizations or by independently enrolled registered nurses;\n(30) services provided in lieu of legally required staffing in a residential or child care setting;\n(31) services provided by a foster care license holder except when the home of the person receiving services is the licensed foster care provider's primary residence;\n(32) services that are the responsibility of the foster care provider under the terms of the foster care placement agreement, assessment under sections 142A.607 and 260C.4411, and administrative rules under sections 142A.607 and 260C.4411;\n(33) services in a setting that has a licensed capacity greater than six, unless all conditions for a variance under section 142B.10, subdivision 17, are satisfied for a sibling, as defined in section 260C.007, subdivision 32;\n(34) services from a provider who owns or otherwise controls the living arrangement, except when the provider of services is related by blood, marriage, or adoption or when the provider is a licensed foster care provider who is not prohibited from providing services under clauses (31) to (33);\n(35) instrumental activities of daily living for children younger than 18 years of age, except when immediate attention is needed for health or hygiene reasons integral to an assessed need for assistance with activities of daily living, health-related procedures, and tasks or behaviors; or\n(36) services provided to a resident of a nursing facility, hospital, intermediate care facility, or health care facility licensed by the commissioner of health.\n(a) Agency-providers identified in subdivision 11 and FMS providers identified in subdivision 13a shall:\n(1) enroll as a medical assistance Minnesota health care programs provider and meet all applicable provider standards and requirements including completion of required provider training as determined by the commissioner;\n(2) demonstrate compliance with federal and state laws and policies for CFSS as determined by the commissioner;\n(3) comply with background study requirements under chapter 245C and maintain documentation of background study requests and results;\n(4) verify and maintain records of all services and expenditures by the participant, including hours worked by support workers;\n(5) not engage in any agency-initiated direct contact or marketing in person, by telephone, or other electronic means to potential participants, guardians, family members, or participants' representatives;\n(6) directly provide services and not use a subcontractor or reporting agent;\n(7) meet the financial requirements established by the commissioner for financial solvency;\n(8) have never had a lead agency contract or provider agreement discontinued due to fraud, or have never had an owner, board member, or manager fail a state or FBI-based criminal background check while enrolled or seeking enrollment as a Minnesota health care programs provider; and\n(9) have an office located in Minnesota.\n(b) In conducting general duties, agency-providers and FMS providers shall:\n(1) pay support workers based upon actual hours of services provided;\n(2) pay for worker training and development services based upon actual hours of services provided or the unit cost of the training session purchased;\n(3) withhold and pay all applicable federal and state payroll taxes;\n(4) make arrangements and pay unemployment insurance, taxes, workers' compensation, liability insurance, and other benefits, if any;\n(5) enter into a written agreement with the participant, participant's representative, or legal representative that assigns roles and responsibilities to be performed before services, supports, or goods are provided and that meets the requirements of subdivisions 20a, 20b, and 20c for agency-providers;\n(6) report maltreatment as required under section 626.557 and chapter 260E;\n(7) comply with the labor market reporting requirements described in section 256B.4912, subdivision 1a;\n(8) comply with any data requests from the department consistent with the Minnesota Government Data Practices Act under chapter 13;\n(9) maintain documentation for the requirements under subdivision 16, paragraph (e), clause (2), to qualify for an enhanced rate under this section; and\n(10) request reassessments 60 days before the end of the current authorization for CFSS on forms provided by the commissioner.\n(a) The agency-provider model includes services provided by support workers and staff providing worker training and development services who are employed by an agency-provider that meets the criteria established by the commissioner, including required training.\n(b) The agency-provider shall allow the participant to have a significant role in the selection and dismissal of the support workers for the delivery of the services and supports specified in the participant's CFSS service delivery plan. The agency must make a reasonable effort to fulfill the participant's request for the participant's preferred support worker.\n(c) A participant may use authorized units of CFSS services as needed within a service agreement that is not greater than 12 months. Using authorized units in a flexible manner in either the agency-provider model or the budget model does not increase the total amount of services and supports authorized for a participant or included in the participant's CFSS service delivery plan.\n(d) A participant may share CFSS services. Two or three CFSS participants may share services at the same time provided by the same support worker.\n(e) The agency-provider must use a minimum of 72.5 percent of the revenue generated by the medical assistance payment for CFSS for support worker wages and benefits, except all of the revenue generated by a medical assistance rate increase due to a collective bargaining agreement under section 179A.54 must be used for support worker wages and benefits. The agency-provider must document how this requirement is being met. The revenue generated by the worker training and development services and the reasonable costs associated with the worker training and development services must not be used in making this calculation.\n(f) The agency-provider model must be used by participants who are restricted by the Minnesota restricted recipient program under Minnesota Rules, parts 9505.2160 to 9505.2245.\n(g) Participants purchasing goods under this model, along with support worker services, must:\n(1) specify the goods in the CFSS service delivery plan and detailed budget for expenditures that must be approved by the lead agency, case manager, or care coordinator; and\n(2) use the FMS provider for the billing and payment of such goods.\n(h) The agency provider is responsible for ensuring that any worker driving a participant under subdivision 2, paragraph (o), has a valid driver's license and the vehicle used is registered and insured according to Minnesota law.\n(a) The agency-provider is responsible to work with the participant and the participant's representative, if any, in the evaluation of the CFSS goals and CFSS service delivery plan. The agency-provider must complete an evaluation of CFSS services within 90 days of service initiation and at least quarterly thereafter. Quarterly evaluations during the first year must be completed in person. Following the first year of service, at least one quarterly evaluation each year must be completed in person. An in-person evaluation must also be completed within 30 calendar days of the discovery or receipt of information of any changes in the participant's condition for which CFSS is provided.\n(b) Each CFSS evaluation required in paragraph (a) must evaluate and document the required elements in clauses (1) to (5):\n(1) whether the CFSS service delivery plan accurately identifies the participant's current service needs;\n(2) whether services are supporting accomplishment of the goals identified in the CFSS service delivery plan;\n(3) whether workers are competent in providing services identified in the CFSS service delivery plan;\n(4) whether the agency-provider, the participant, or the participant's representative, if any, has any additional concerns with the CFSS service delivery plan, goals, service delivery, or worker competency not identified in clauses (1) to (3); and\n(5) based on the evaluation required in clauses (1) to (4), whether revisions are needed to the CFSS service delivery plan or goals or how CFSS is used or delivered, whether there is a need for additional worker training, or whether any other actions are needed to support the participant's use of CFSS and who will take the action.\nIf changes are needed based on the results of the evaluation, a revised CFSS service delivery plan must be completed and provided to the participant or participant's representative, if any, within 30 calendar days of the evaluation.\n(a) The agency-provider must ensure that support workers are competent to meet the participant's assessed needs, goals, and additional requirements as written in the CFSS service delivery plan. The agency-provider must evaluate the competency of the support worker through direct observation of the support worker's performance of the job functions in a setting where the participant is using CFSS within 30 days of:\n(1) any support worker beginning to provide services for a participant; or\n(2) any support worker beginning to provide shared services.\n(b) The agency-provider must verify and maintain evidence of support worker competency, including documentation of the support worker's:\n(1) education and experience relevant to the job responsibilities assigned to the support worker and the needs of the participant;\n(2) relevant training received from sources other than the agency-provider;\n(3) orientation and instruction to implement services and supports to participant needs and preferences as identified in the CFSS service delivery plan;\n(4) orientation and instruction delivered by an individual competent to perform, teach, or assign the health-related tasks for tracheostomy suctioning and services to participants on ventilator support, including equipment operation and maintenance; and\n(5) periodic performance reviews completed by the agency-provider at least annually, including any evaluations required under subdivision 11a, paragraph (a). If a support worker is a minor, all evaluations of worker competency must be completed in person and in a setting where the participant is using CFSS.\n(c) The agency-provider must develop a worker training and development plan with the participant to ensure support worker competency. The worker training and development plan must be updated when:\n(1) the support worker begins providing services;\n(2) the support worker begins providing shared services;\n(3) there is any change in condition or a modification to the CFSS service delivery plan; or\n(4) a performance review indicates that additional training is needed.\n(a) All CFSS agency-providers must provide, at the time of enrollment, reenrollment, and revalidation as a CFSS agency-provider in a format determined by the commissioner, information and documentation that includes but is not limited to the following:\n(1) the CFSS agency-provider's current contact information including address, telephone number, and email address;\n(2) proof of surety bond coverage. Upon new enrollment, or if the agency-provider's Medicaid revenue in the previous calendar year is less than or equal to $300,000, the agency-provider must purchase a surety bond of $50,000. If the agency-provider's Medicaid revenue in the previous calendar year is greater than $300,000, the agency-provider must purchase a surety bond of $100,000. The surety bond must be in a form approved by the commissioner, must be renewed annually, and must allow for recovery of costs and fees in pursuing a claim on the bond;\n(3) proof of fidelity bond coverage in the amount of $20,000 per provider location;\n(4) proof of workers' compensation insurance coverage;\n(5) proof of liability insurance;\n(6) a copy of the CFSS agency-provider's organizational chart identifying the names and roles of all owners, managing employees, staff, board of directors, and additional documentation reporting any affiliations of the directors and owners to other service providers;\n(7) proof that the CFSS agency-provider has written policies and procedures including: hiring of employees; training requirements; service delivery; and employee and consumer safety, including the process for notification and resolution of participant grievances, incident response, identification and prevention of communicable diseases, and employee misconduct;\n(8) proof that the CFSS agency-provider has all of the following forms and documents:\n(i) a copy of the CFSS agency-provider's time sheet; and\n(ii) a copy of the participant's individual CFSS service delivery plan;\n(9) a list of all training and classes that the CFSS agency-provider requires of its staff providing CFSS services;\n(10) documentation that the CFSS agency-provider and staff have successfully completed all the training required by this section;\n(11) documentation of the agency-provider's marketing practices;\n(12) disclosure of ownership, leasing, or management of all residential properties that are used or could be used for providing home care services;\n(13) documentation that the agency-provider will use at least the following percentages of revenue generated from the medical assistance rate paid for CFSS services for CFSS support worker wages and benefits: 72.5 percent of revenue from CFSS providers, except 100 percent of the revenue generated by a medical assistance rate increase due to a collective bargaining agreement under section 179A.54 must be used for support worker wages and benefits. The revenue generated by the worker training and development services and the reasonable costs associated with the worker training and development services shall not be used in making this calculation; and\n(14) documentation that the agency-provider does not burden participants' free exercise of their right to choose service providers by requiring CFSS support workers to sign an agreement not to work with any particular CFSS participant or for another CFSS agency-provider after leaving the agency and that the agency is not taking action on any such agreements or requirements regardless of the date signed.\n(b) CFSS agency-providers shall provide to the commissioner the information specified in paragraph (a).\n(c) All CFSS agency-providers shall require all employees in management and supervisory positions and owners of the agency who are active in the day-to-day management and operations of the agency to complete mandatory training as determined by the commissioner. Employees in management and supervisory positions and owners who are active in the day-to-day operations of an agency who have completed the required training as an employee with a CFSS agency-provider do not need to repeat the required training if they are hired by another agency and they have completed the training within the past three years. CFSS agency-provider billing staff shall complete training about CFSS program financial management. Any new owners or employees in management and supervisory positions involved in the day-to-day operations are required to complete mandatory training as a requisite of working for the agency.\n(d) Agency-providers shall submit all required documentation in this section within 30 days of notification from the commissioner. If an agency-provider fails to submit all the required documentation, the commissioner may take action under subdivision 23a.\n(a) The CFSS agency-provider must establish policies and procedures that promote service recipient rights by providing a simple complaint process for participants served by the program and their authorized representatives to bring a grievance. The complaint process must:\n(1) provide staff assistance with the complaint process when requested;\n(2) allow the participant to bring the complaint to the highest level of authority in the program if the grievance cannot be resolved by other staff members, and provide the name, address, and telephone number of that person;\n(3) provide the addresses and telephone numbers of outside agencies to assist the participant;\n(4) require a prompt response to all complaints affecting a participant's health and safety and a timely response to all other complaints;\n(5) require an evaluation of whether:\n(i) related policies and procedures were followed and adequate;\n(ii) there is a need for additional staff training;\n(iii) the complaint is similar to past complaints with the persons, staff, or services involved; and\n(iv) there is a need for corrective action by the agency-provider to protect the health and safety of participants receiving services;\n(6) provide a written summary of the complaint and a notice of the complaint resolution to the participant and, if applicable, case manager or care coordinator; and\n(7) require that the complaint summary and resolution notice be maintained in the participant's service record.\n(b) The CFSS agency-provider must establish policies and procedures for responding to incidents that occur while services are being provided. When a participant has a legal representative or a participant's representative, incidents must be reported to these representatives. For the purposes of this paragraph, \"incident\" means an occurrence that involves a participant and requires a response that is not a part of the ordinary provision of the services to that participant, and includes:\n(1) serious injury of a participant as determined by section 245.91, subdivision 6;\n(2) a participant's death;\n(3) any medical emergency, unexpected serious illness, or significant unexpected change in a participant's illness or medical condition that requires a call to 911, physician treatment, or hospitalization;\n(4) any mental health crisis that requires a call to 911 or a mental health crisis intervention team;\n(5) an act or situation involving a participant that requires a call to 911, law enforcement, or the fire department;\n(6) a participant's unexplained absence;\n(7) behavior that creates an imminent risk of harm to the participant or another; and\n(8) a report of alleged or suspected child or vulnerable adult maltreatment under section 626.557 or chapter 260E.\n(a) An agency-provider must provide written notice when it intends to terminate services with a participant at least 30 calendar days before the proposed service termination is to become effective, except in cases where:\n(1) the participant engages in conduct that significantly alters the terms of the CFSS service delivery plan with the agency-provider;\n(2) the participant or other persons at the setting where services are being provided engage in conduct that creates an imminent risk of harm to the support worker or other agency-provider staff; or\n(3) an emergency or a significant change in the participant's condition occurs within a 24-hour period that results in the participant's service needs exceeding the participant's identified needs in the current CFSS service delivery plan so that the agency-provider cannot safely meet the participant's needs.\n(b) When a participant initiates a request to terminate CFSS services with the agency-provider, the agency-provider must give the participant a written acknowledgment of the participant's service termination request that includes the date the request was received by the agency-provider and the requested date of termination.\n(c) The agency-provider must participate in a coordinated transfer of the participant to a new agency-provider to ensure continuity of care.\nA community first services and supports agency provider must ensure that travel and driving, as described in subdivision 2, paragraph (o), is documented. The documentation must include:\n(1) start and stop times with a.m. and p.m. designation;\n(2) the origination site; and\n(3) the destination site.\n(a) Under the budget model participants exercise responsibility and control over the services and supports described and budgeted within the CFSS service delivery plan. Participants must use services specified in subdivision 13a provided by an FMS provider. Under this model, participants may use their approved service budget allocation to:\n(1) directly employ support workers, and pay wages, federal and state payroll taxes, and premiums for workers' compensation, liability, family and medical benefit insurance, and health insurance coverage; and\n(2) obtain supports and goods as defined in subdivision 7.\n(b) Participants who are unable to fulfill any of the functions listed in paragraph (a) may authorize a legal representative or participant's representative to do so on their behalf.\n(c) If two or more participants using the budget model live in the same household and have the same support worker, the participants must use the same FMS provider.\n(d) If the FMS provider advises that there is a joint employer in the budget model, all participants associated with that joint employer must use the same FMS provider.\n(e) The commissioner shall disenroll or exclude participants from the budget model and transfer them to the agency-provider model under, but not limited to, the following circumstances:\n(1) when a participant has been restricted by the Minnesota restricted recipient program, in which case the participant may be excluded for a specified time period under Minnesota Rules, parts 9505.2160 to 9505.2245;\n(2) when a participant exits the budget model during the participant's service plan year. Upon transfer, the participant shall not access the budget model for the remainder of that service plan year; or\n(3) when the department determines that the participant or participant's representative or legal representative is unable to fulfill the responsibilities under the budget model, as specified in subdivision 14.\n(f) A participant may appeal in writing to the department under section 256.045, subdivision 3, to contest the department's decision under paragraph (e), clause (3), to disenroll or exclude the participant from the budget model.\n(a) Services provided by an FMS provider include but are not limited to: filing and payment of federal and state payroll taxes and premiums on behalf of the participant; initiating and complying with background study requirements under chapter 245C and maintaining documentation of background study requests and results; billing for approved CFSS services with authorized funds; monitoring expenditures; accounting for and disbursing CFSS funds; providing assistance in obtaining and filing for liability, workers' compensation, family and medical benefit insurance, and unemployment coverage; and providing participant instruction and technical assistance to the participant in fulfilling employer-related requirements in accordance with section 3504 of the Internal Revenue Code and related regulations and interpretations, including Code of Federal Regulations, title 26, section 31.3504-1.\n(b) Agency-provider services shall not be provided by the FMS provider.\n(c) The FMS provider shall provide service functions as determined by the commissioner for budget model participants that include but are not limited to:\n(1) assistance with the development of the detailed budget for expenditures portion of the CFSS service delivery plan as requested by the consultation services provider or participant;\n(2) data recording and reporting of participant spending;\n(3) other duties established by the department, including with respect to providing assistance to the participant, participant's representative, or legal representative in performing employer responsibilities regarding support workers. The support worker shall not be considered the employee of the FMS provider; and\n(4) billing, payment, and accounting of approved expenditures for goods.\n(d) The FMS provider shall obtain an assurance statement from the participant employer agreeing to follow state and federal regulations and CFSS policies regarding employment of support workers.\n(e) The FMS provider shall:\n(1) not limit or restrict the participant's choice of service or support providers or service delivery models consistent with any applicable state and federal requirements;\n(2) provide the participant, consultation services provider, and case manager or care coordinator, if applicable, with a monthly written summary of the spending for services and supports that were billed against the spending budget;\n(3) be knowledgeable of state and federal employment regulations, including those under the Fair Labor Standards Act of 1938, and comply with the requirements under chapter 268B and section 3504 of the Internal Revenue Code and related regulations and interpretations, including Code of Federal Regulations, title 26, section 31.3504-1, regarding agency employer tax liability for vendor fiscal/employer agent, and any requirements necessary to process employer and employee deductions, provide appropriate and timely submission of employer tax liabilities, and maintain documentation to support medical assistance claims;\n(4) have current and adequate liability insurance and bonding and sufficient cash flow as determined by the commissioner and have on staff or under contract a certified public accountant or an individual with a baccalaureate degree in accounting;\n(5) assume fiscal accountability for state funds designated for the program and be held liable for any overpayments or violations of applicable statutes or rules, including but not limited to the Minnesota False Claims Act, chapter 15C;\n(6) maintain documentation of receipts, invoices, and bills to track all services and supports expenditures for any goods purchased and maintain time records of support workers. The documentation and time records must be maintained for a minimum of five years from the claim date and be available for audit or review upon request by the commissioner. Claims submitted by the FMS provider to the commissioner for payment must correspond with services, amounts, and time periods as authorized in the participant's service budget and service plan and must contain specific identifying information as determined by the commissioner; and\n(7) provide written notice to the participant or the participant's representative at least 30 calendar days before a proposed service termination becomes effective, except in cases where:\n(i) the participant engages in conduct that significantly alters the terms of the CFSS service delivery plan with the FMS;\n(ii) the participant or other persons at the setting where services are being provided engage in conduct that creates an imminent risk of harm to the support worker or other staff; or\n(iii) an emergency or a significant change in the participant's condition occurs within a 24-hour period that results in the participant's service needs exceeding the participant's identified needs in the current CFSS service delivery plan so that the plan cannot safely meet the participant's needs.\n(f) The commissioner shall:\n(1) establish rates and payment methodology for the FMS provider;\n(2) identify a process to ensure quality and performance standards for the FMS provider and ensure statewide access to FMS providers; and\n(3) establish a uniform protocol for delivering and administering CFSS services to be used by eligible FMS providers.\n(a) The participant or participant's representative is responsible for:\n(1) orienting support workers to individual needs and preferences and providing direction during the delivery of services;\n(2) tracking the services provided and all expenditures for goods or other supports;\n(3) preparing, verifying, and submitting time sheets according to the requirements in subdivision 15;\n(4) reporting any problems resulting from the failure of the CFSS service delivery plan to be implemented or the quality of services rendered by the support worker to the agency-provider, consultation services provider, FMS provider, and case manager or care coordinator if applicable;\n(5) notifying the agency-provider or the FMS provider within ten days of any changes in circumstances affecting the CFSS service delivery plan, including but not limited to changes in the participant's place of residence or hospitalization; and\n(6) under the agency-provider model, participating in the evaluation of CFSS services and support workers according to subdivision 11a.\n(b) For a participant using the budget model, the participant or participant's representative is responsible for:\n(1) using an FMS provider that is enrolled with the department. Upon a determination of eligibility and completion of the assessment and support plan, the participant shall choose an FMS provider from a list of eligible providers maintained by the department;\n(2) complying with policies and procedures of the FMS provider as required to meet state and federal regulations for CFSS and the employment of support workers;\n(3) the hiring and supervision of the support worker, including but not limited to recruiting, interviewing, training, scheduling, and discharging the support worker consistent with federal and state laws and regulations;\n(4) notifying the FMS provider of any changes in the employment status of each support worker;\n(5) ensuring that support workers are competent to meet the participant's assessed needs and additional requirements as written in the CFSS service delivery plan;\n(6) determining the competency of the support worker through evaluation within 30 days of any support worker beginning to provide services and with any change in the participant's condition or modification to the CFSS service delivery plan;\n(7) verifying and maintaining evidence of support worker competency, including documentation of the support worker's:\n(i) education and experience relevant to the job responsibilities assigned to the support worker and the needs of the participant;\n(ii) training received from sources other than the participant;\n(iii) orientation and instruction to implement defined services and supports to meet participant needs and preferences as detailed in the CFSS service delivery plan; and\n(iv) periodic written performance reviews completed by the participant at least annually based on the direct observation of the support worker's ability to perform the job functions;\n(8) developing and communicating to each support worker a worker training and development plan to ensure the support worker is competent when:\n(i) the support worker begins providing services;\n(ii) there is any change in the participant's condition or modification to the CFSS service delivery plan; or\n(iii) a performance review indicates that additional training is needed;\n(9) participating in the evaluation of CFSS services; and\n(10) ensuring that a worker driving the participant under subdivision 2, paragraph (o), has a valid driver's license and the vehicle used is registered and insured according to Minnesota law.\n(a) If a participant is unable to direct the participant's own care, the participant must use a participant's representative to receive CFSS services. A participant's representative is required if:\n(1) the person is under 18 years of age;\n(2) the person has a court-appointed guardian; or\n(3) an assessment according to section 256B.0659, subdivision 3a, determines that the participant is in need of a participant's representative.\n(b) A participant's representative must:\n(1) be at least 18 years of age;\n(2) actively participate in planning and directing CFSS services;\n(3) have sufficient knowledge of the participant's circumstances to use CFSS services consistent with the participant's health and safety needs identified in the participant's service delivery plan;\n(4) not have a financial interest in the provision of any services included in the participant's CFSS service delivery plan; and\n(5) be capable of providing the support necessary to assist the participant in the use of CFSS services.\n(c) A participant's representative must not be the:\n(1) support worker;\n(2) worker training and development service provider;\n(3) agency-provider staff, unless related to the participant by blood, marriage, or adoption;\n(4) consultation service provider, unless related to the participant by blood, marriage, or adoption;\n(5) FMS staff, unless related to the participant by blood, marriage, or adoption;\n(6) FMS owner or manager; or\n(7) lead agency staff acting as part of employment.\n(d) A licensed family foster parent who lives with the participant may be the participant's representative if the family foster parent meets the other participant's representative requirements.\n(e) There may be two persons designated as the participant's representative, including instances of divided households and court-ordered custodies. Each person named as the participant's representative must meet the program criteria and responsibilities.\n(f) The participant or the participant's legal representative shall appoint a participant's representative. The participant's representative must be identified at the time of assessment and listed on the participant's service agreement and CFSS service delivery plan.\n(g) A participant's representative must enter into a written agreement with an agency-provider or FMS on a form determined by the commissioner and maintained in the participant's file, to:\n(1) be available while care is provided using a method agreed upon by the participant or the participant's legal representative and documented in the participant's service delivery plan;\n(2) monitor CFSS services to ensure the participant's service delivery plan is followed;\n(3) review and sign support worker time sheets after services are provided to verify the provision of services;\n(4) review and sign vendor paperwork to verify receipt of goods; and\n(5) in the budget model, review and sign documentation to verify worker training and development expenditures.\n(h) A participant's representative may delegate responsibility to another adult who is not the support worker during a temporary absence of at least 24 hours but not more than six months. To delegate responsibility, the participant's representative must:\n(1) ensure that the delegate serving as the participant's representative satisfies the requirements of the participant's representative;\n(2) ensure that the delegate performs the functions of the participant's representative;\n(3) communicate to the CFSS agency-provider or FMS provider about the need for a delegate by updating the written agreement to include the name of the delegate and the delegate's contact information; and\n(4) ensure that the delegate protects the participant's privacy according to federal and state data privacy laws.\n(i) The designation of a participant's representative remains in place until:\n(1) the participant revokes the designation;\n(2) the participant's representative withdraws the designation or becomes unable to fulfill the duties;\n(3) the legal authority to act as a participant's representative changes; or\n(4) the participant's representative is disqualified.\n(j) A lead agency may disqualify a participant's representative who engages in conduct that creates an imminent risk of harm to the participant, the support workers, or other staff. A participant's representative who fails to provide support required by the participant must be referred to the common entry point.\n(a) CFSS services provided to a participant by a support worker employed by either an agency-provider or the participant employer must be documented daily by each support worker, on a time sheet. Time sheets may be created, submitted, and maintained electronically. Time sheets must be submitted by the support worker at least once per month to the:\n(1) agency-provider when the participant is using the agency-provider model. The agency-provider must maintain a record of the time sheet and provide a copy of the time sheet to the participant; or\n(2) participant and the participant's FMS provider when the participant is using the budget model. The participant and the FMS provider must maintain a record of the time sheet.\n(b) The documentation on the time sheet must correspond to the participant's assessed needs within the scope of CFSS covered services. The accuracy of the time sheets must be verified by the:\n(1) agency-provider when the participant is using the agency-provider model; or\n(2) participant employer and the participant's FMS provider when the participant is using the budget model.\n(c) The time sheet must document the time the support worker provides services to the participant. The following elements must be included in the time sheet:\n(1) the support worker's full name and individual provider number;\n(2) the agency-provider's name and telephone numbers, when responsible for the CFSS service delivery plan;\n(3) the participant's full name;\n(4) the dates within the pay period established by the agency-provider or FMS provider, including month, day, and year, and arrival and departure times with a.m. or p.m. notations for days worked within the established pay period;\n(5) the covered services provided to the participant on each date of service;\n(6) the signature of the participant or the participant's representative and a statement that the participant's or participant's representative's signature is verification of the time sheet's accuracy;\n(7) the signature of the support worker;\n(8) any shared care provided, if applicable;\n(9) a statement that it is a federal crime to provide false information on CFSS billings for medical assistance payments; and\n(10) dates and location of participant stays in a hospital, care facility, or incarceration occurring within the established pay period.\n(a) Support workers shall:\n(1) enroll with the department as a support worker after a background study under chapter 245C has been completed and the support worker has received a notice from the commissioner that the support worker:\n(i) is not disqualified under section 245C.14; or\n(ii) is disqualified, but has received a set-aside of the disqualification under section 245C.22;\n(2) have the ability to effectively communicate with the participant or the participant's representative;\n(3) have the skills and ability to provide the services and supports according to the participant's CFSS service delivery plan and respond appropriately to the participant's needs;\n(4) complete the basic standardized CFSS training as determined by the commissioner before completing enrollment. The training must be available in languages other than English and to those who need accommodations due to disabilities. CFSS support worker training must include successful completion of the following training components: basic first aid, vulnerable adult, child maltreatment, OSHA universal precautions, basic roles and responsibilities of support workers including information about basic body mechanics, emergency preparedness, orientation to positive behavioral practices, orientation to responding to a mental health crisis, fraud issues, time cards and documentation, and an overview of person-centered planning and self-direction. Upon completion of the training components, the support worker must pass the certification test to provide assistance to participants;\n(5) complete employer-directed training and orientation on the participant's individual needs;\n(6) maintain the privacy and confidentiality of the participant; and\n(7) not independently determine the medication dose or time for medications for the participant.\n(b) The commissioner may deny or terminate a support worker's provider enrollment and provider number if the support worker:\n(1) does not meet the requirements in paragraph (a);\n(2) fails to provide the authorized services required by the employer;\n(3) has been intoxicated by alcohol or drugs while providing authorized services to the participant or while in the participant's home;\n(4) has manufactured or distributed drugs while providing authorized services to the participant or while in the participant's home; or\n(5) has been excluded as a provider by the commissioner of human services, or by the United States Department of Health and Human Services, Office of Inspector General, from participation in Medicaid, Medicare, or any other federal health care program.\n(c) A support worker may appeal in writing to the commissioner to contest the decision to terminate the support worker's provider enrollment and provider number.\n(d) A support worker must not provide or be paid for more than 310 hours of CFSS per month, regardless of the number of participants the support worker serves or the number of agency-providers or participant employers by which the support worker is employed. The department shall not disallow the number of hours per day a support worker works unless it violates other law.\n(e) CFSS qualify for an enhanced rate if the support worker providing the services:\n(1) provides services, within the scope of CFSS described in subdivision 7, to a participant who qualifies for ten or more hours per day of CFSS; and\n(2) satisfies the current requirements of Medicare for training and competency or competency evaluation of home health aides or nursing assistants, as provided in the Code of Federal Regulations, title 42, section 483.151 or 484.36, or alternative state-approved training or competency requirements.\n[See Note.]\nThe support worker for a participant may be allowed to enroll with a different CFSS agency-provider or FMS provider upon initiation, rather than completion, of a new background study according to chapter 245C, if the following conditions are met:\n(1) the commissioner determines that the support worker's change in enrollment or affiliation is needed to ensure continuity of services and protect the health and safety of the participant;\n(2) the chosen agency-provider or FMS provider has been continuously enrolled as a CFSS agency-provider or FMS provider for at least two years or since the inception of the CFSS program, whichever is shorter;\n(3) the participant served by the support worker chooses to transfer to the CFSS agency-provider or the FMS provider to which the support worker is transferring;\n(4) the support worker has been continuously enrolled with the former CFSS agency-provider or FMS provider since the support worker's last background study was completed; and\n(5) the support worker continues to meet requirements of subdivision 16, excluding paragraph (a), clause (1).\nConsultation services is a required service that includes:\n(1) entering into a written agreement with the participant, participant's representative, or legal representative that includes but is not limited to the details of services, service delivery methods, dates of services, and contact information;\n(2) providing an initial and annual orientation to CFSS information and policies, including selecting a service model;\n(3) assisting with accessing FMS providers or agency-providers;\n(4) providing assistance with the development, implementation, management, documentation, and evaluation of the person-centered CFSS service delivery plan;\n(5) maintaining documentation of the approved CFSS service delivery plan;\n(6) distributing copies of the final CFSS service delivery plan to the participant and to the agency-provider or FMS provider, case manager or care coordinator, and other designated parties;\n(7) assisting to fulfill responsibilities and requirements of CFSS, including modifying CFSS service delivery plans and changing service models;\n(8) if requested, providing consultation on recruiting, selecting, training, managing, directing, supervising, and evaluating support workers;\n(9) evaluating services upon receiving information from an FMS provider indicating spending or participant employer concerns;\n(10) reviewing the use of and access to informal and community supports, goods, or resources;\n(11) a semiannual review of services if the participant does not have a case manager or care coordinator and when the support worker is a paid parent of a minor participant or the participant's spouse;\n(12) collecting and reporting of data as required by the department;\n(13) providing the participant with a copy of the participant protections under subdivision 20 at the start of consultation services;\n(14) providing assistance to resolve issues of noncompliance with the requirements of CFSS;\n(15) providing recommendations to the commissioner for changes to services when support to participants to resolve issues of noncompliance have been unsuccessful; and\n(16) other duties as assigned by the commissioner.\nConsultation services providers must meet the following qualifications and requirements:\n(1) meet the requirements under subdivision 10, paragraph (a), excluding clauses (4) and (5);\n(2) are under contract with the department;\n(3) are not the FMS provider, the lead agency, or the CFSS or home and community-based services waiver vendor or agency-provider to the participant;\n(4) meet the service standards as established by the commissioner;\n(5) have proof of surety bond coverage. Upon new enrollment, or if the consultation service provider's Medicaid revenue in the previous calendar year is less than or equal to $300,000, the consultation service provider must purchase a surety bond of $50,000. If the agency-provider's Medicaid revenue in the previous calendar year is greater than $300,000, the consultation service provider must purchase a surety bond of $100,000. The surety bond must be in a form approved by the commissioner, must be renewed annually, and must allow for recovery of costs and fees in pursuing a claim on the bond;\n(6) employ lead professional staff with a minimum of two years of experience in providing services such as support planning, support broker, case management or care coordination, or consultation services and consumer education to participants using a self-directed program using FMS under medical assistance;\n(7) report maltreatment as required under chapter 260E and section 626.557;\n(8) comply with medical assistance provider requirements;\n(9) understand the CFSS program and its policies;\n(10) are knowledgeable about self-directed principles and the application of the person-centered planning process;\n(11) have general knowledge of the FMS provider duties and the vendor fiscal/employer agent model, including all applicable federal, state, and local laws and regulations regarding tax, labor, employment, and liability and workers' compensation coverage for household workers; and\n(12) have all employees, including lead professional staff, staff in management and supervisory positions, and owners of the agency who are active in the day-to-day management and operations of the agency, complete training as specified in the contract with the department.\n(a) For the agency-provider model, services are authorized in units of service. The total service unit amount must be established based upon the assessed need for CFSS services, and must not exceed the maximum number of units available as determined under subdivision 8.\n(b) For the budget model, the service budget allocation allowed for services and supports is defined in subdivision 8, paragraph (g).\n(a) The commissioner shall develop the scope of tasks and functions, service standards, and service limits for worker training and development services.\n(b) Worker training and development costs are in addition to the participant's assessed service units or service budget. Services provided according to this subdivision must:\n(1) help support workers obtain and expand the skills and knowledge necessary to ensure competency in providing quality services as needed and defined in the participant's CFSS service delivery plan and as required under subdivisions 11b and 14;\n(2) be provided or arranged for by the agency-provider under subdivision 11, or purchased by the participant employer under the budget model as identified in subdivision 13;\n(3) be delivered by an individual competent to perform, teach, or assign the tasks, including health-related tasks, identified in the plan through education, training, and work experience relevant to the person's assessed needs; and\n(4) be described in the participant's CFSS service delivery plan and documented in the participant's file.\n(c) Services covered under worker training and development shall include:\n(1) support worker training on the participant's individual assessed needs and condition, provided individually or in a group setting by a skilled and knowledgeable trainer beyond any training the participant or participant's representative provides;\n(2) tuition for professional classes and workshops for the participant's support workers that relate to the participant's assessed needs and condition;\n(3) direct observation, monitoring, coaching, and documentation of support worker job skills and tasks, beyond any training the participant or participant's representative provides, including supervision of health-related tasks or behavioral supports that is conducted by an appropriate professional based on the participant's assessed needs. These services must be provided at the start of services or the start of a new support worker except as provided in paragraph (d) and must be specified in the participant's CFSS service delivery plan; and\n(4) the activities to evaluate CFSS services and ensure support worker competency described in subdivisions 11a and 11b.\n(d) The services in paragraph (c), clause (3), are not required to be provided for a new support worker providing services for a participant due to staffing failures, unless the support worker is expected to provide ongoing backup staffing coverage.\n(e) Worker training and development services shall not include:\n(1) general agency training, worker orientation, or training on CFSS self-directed models;\n(2) payment for preparation or development time for the trainer or presenter;\n(3) payment of the support worker's salary or compensation during the training;\n(4) training or supervision provided by the participant, the participant's support worker, or the participant's informal supports, including the participant's representative; or\n(5) services in excess of the limit set by the commissioner per annual service agreement, unless approved by the department.\n(a) Except as provided in paragraph (b), the worker training and development services specified in subdivision 18a, paragraph (c), clauses (3) and (4), may be provided to recipients with chronic health conditions or severely compromised immune systems via two-way interactive audio and visual telecommunications if, at the recipient's request, the recipient's primary health care provider:\n(1) determines that remote worker training and development services are appropriate; and\n(2) documents the determination under clause (1) in a statement of need or other document that is subsequently included in the recipient's CFSS service delivery plan.\n(b) The worker training and development services specified in subdivision 18a, paragraph (c), clause (3), provided at the start of services or the start of employment of a new support worker must not be conducted via two-way interactive audio and visual telecommunications.\n(c) Notwithstanding any other provision of law, a CFSS service delivery plan developed or amended via remote worker training and development services may be executed by electronic signature.\n(d) A recipient may request to return to in-person worker training and development services at any time.\n[See Note.]\n[Repealed by amendment, 2015 c 78 art 6 s 22]\n(a) All CFSS participants have the protections identified in this subdivision.\n(b) Participants or participant's representatives must be provided with adequate information, counseling, training, and assistance, as needed, to ensure that the participant is able to choose and manage services, models, and budgets. This information must be provided by the consultation services provider at the time of the initial or annual orientation to CFSS, at the time of reassessment, or when requested by the participant or participant's representative. This information must explain:\n(1) person-centered planning;\n(2) the range and scope of participant choices, including the differences between the agency-provider model and the budget model, available CFSS providers, and other services available in the community to meet the participant's needs;\n(3) the process for changing plans, services, and budgets;\n(4) identifying and assessing appropriate services; and\n(5) risks to and responsibilities of the participant under the budget model.\n(c) The consultation services provider must ensure that the participant chooses freely between the agency-provider model and the budget model and among available agency-providers and that the participant may change agency-providers after services have begun.\n(d) A participant who appeals a reduction in previously authorized CFSS services may continue previously authorized services pending an appeal in accordance with section 256.045.\n(e) If the units of service or budget allocation for CFSS are reduced, denied, or terminated, the commissioner must provide notice of the reasons for the reduction in the participant's notice of denial, termination, or reduction.\n(f) If all or part of a CFSS service delivery plan is denied approval by the lead agency, the lead agency must provide a notice that describes the basis of the denial.\nA participant receiving CFSS from an agency-provider has the rights identified in this subdivision and in subdivisions 20b and 20c. The agency-provider must:\n(1) within five working days of service initiation and annually thereafter, provide each participant or participant's representative with a written notice that identifies the service recipient rights in subdivisions 20b and 20c, and an explanation of those rights;\n(2) make reasonable accommodations to provide this information in other formats or languages as needed to facilitate understanding of the rights by the participant and the participant's legal representative, if any;\n(3) maintain documentation of the receipt of a copy and an explanation of the rights by the participant or participant's representative; and\n(4) ensure the exercise and protection of the participant's rights in the services provided by the agency-provider and as authorized in the CFSS service delivery plan.\nA participant receiving CFSS from an agency-provider has service-related rights to:\n(1) participate in and approve the initial development and ongoing modification and evaluation of CFSS services provided to the participant;\n(2) refuse or terminate services and be informed of the consequences of refusing or terminating services;\n(3) before services are initiated, be told the limits to the services available from the agency-provider, including the agency-provider's knowledge, skill, and ability to meet the participant's needs identified in the CFSS service delivery plan;\n(4) a coordinated transfer of services when there will be a change in the agency-provider;\n(5) before services are initiated, be told what the agency-provider charges for the services;\n(6) before services are initiated, be told to what extent payment may be expected from health insurance, public programs, or other sources, if known; and what charges the participant may be responsible for paying;\n(7) receive services from an individual who is competent and trained, who has professional certification or licensure, as required, and who meets additional qualifications identified in the participant's CFSS service delivery plan;\n(8) have the participant's preferences for support workers identified and documented, and have those preferences met when possible; and\n(9) before services are initiated, be told the choices that are available from the agency-provider for meeting the participant's assessed needs identified in the CFSS service delivery plan, including but not limited to which support worker staff will be providing services, the proposed frequency and schedule of visits, and any agreements for shared services.\nA participant receiving CFSS from an agency-provider or through an FMS provider has protection-related rights to:\n(1) access records and recorded information about the participant in accordance with applicable state and federal law, regulation, or rule;\n(2) know how to contact an individual associated with the agency-provider or FMS provider who is responsible for handling problems, know the agency-provider's or FMS provider's policies and procedures for resolving grievances, and have the agency-provider or FMS provider investigate and attempt to resolve the grievance or complaint;\n(3) know the name, telephone number, and address of the state or county agency, the Office of the Ombudsman for Long-Term Care, and the state protection and advocacy service to contact for additional information or assistance;\n(4) have personal, financial, and medical information kept private, and be advised of disclosure of this information by the agency-provider or FMS provider and the agency-provider's or FMS provider's policies and procedures regarding data privacy;\n(5) be treated with courtesy and respect, and have the participant's property treated with respect;\n(6) be free from maltreatment; and\n(7) assert these rights personally, or have them asserted by the participant's representative or by anyone authorized by the participant to act on behalf of the participant, without retaliation.\nThe commissioner shall establish a Development and Implementation Council of which the majority of members are participants with disabilities, elderly participants, and their representatives. The commissioner shall consult and collaborate with the council when developing and implementing this section for at least the first five years of operation.\n(a) The commissioner shall establish quality assurance and risk management measures for use in developing and implementing CFSS, including those that:\n(1) recognize the roles and responsibilities of those involved in obtaining CFSS; and\n(2) ensure the appropriateness of such plans and budgets based upon a recipient's resources and capabilities.\nRisk management measures must include background studies and backup and emergency plans, including disaster planning.\n(b) The commissioner shall provide ongoing technical assistance and resource and educational materials for CFSS participants.\n(c) The commissioner shall develop performance measures and data reporting requirements in consultation with the council established in subdivision 21.\n(a) When the commissioner is investigating a possible overpayment of Medicaid funds, the commissioner must be given immediate access without prior notice to the agency-provider, consultation services provider, or FMS provider's office during regular business hours and to documentation and records related to services provided and submission of claims for services provided. If the agency-provider, FMS provider, or consultation services provider denies the commissioner access to records, the provider's payment may be immediately suspended or the provider's enrollment may be terminated according to section 256B.064.\n(b) The commissioner has the authority to request proof of compliance with laws, rules, and policies from agency-providers, consultation services providers, FMS providers, and participants.\n(c) When relevant to an investigation conducted by the commissioner, the commissioner must be given access to the business office, documents, and records of the agency-provider, consultation services provider, or FMS provider, including records maintained in electronic format; participants served by the program; and staff during regular business hours. The commissioner must be given access without prior notice and as often as the commissioner considers necessary if the commissioner is investigating an alleged violation of applicable laws or rules. The commissioner may request and shall receive assistance from lead agencies and other state, county, and municipal agencies and departments. The commissioner's access includes being allowed to photocopy, photograph, and make audio and video recordings at the commissioner's expense.\n(a) The commissioner may withhold payment from the provider or suspend or terminate the provider enrollment number if the provider fails to comply fully with applicable laws or rules. The provider has the right to appeal the decision of the commissioner under section 256B.064.\n(b) Notwithstanding subdivision 13, paragraph (e), if a participant employer fails to comply fully with applicable laws or rules, the commissioner may disenroll the participant from the budget model. A participant may appeal in writing to the department under section 256.045, subdivision 3, to contest the department's decision to disenroll the participant from the budget model.\n(c) Agency-providers of CFSS services or FMS providers must provide each participant with a copy of participant protections in subdivision 20c at least 30 days prior to terminating services to a participant, if the termination results from sanctions under this subdivision or section 256B.064, such as a payment withhold or a suspension or termination of the provider enrollment number. If a CFSS agency-provider, FMS provider, or consultation services provider determines it is unable to continue providing services to a participant because of an action under this subdivision or section 256B.064, the agency-provider, FMS provider, or consultation services provider must notify the participant, the participant's representative, and the commissioner 30 days prior to terminating services to the participant, and must assist the commissioner and lead agency in supporting the participant in transitioning to another CFSS agency-provider, FMS provider, or consultation services provider of the participant's choice.\n(d) In the event the commissioner withholds payment from a CFSS agency-provider, FMS provider, or consultation services provider, or suspends or terminates a provider enrollment number of a CFSS agency-provider, FMS provider, or consultation services provider under this subdivision or section 256B.064, the commissioner may inform the Office of Ombudsman for Long-Term Care and the lead agencies for all participants with active service agreements with the agency-provider, FMS provider, or consultation services provider. At the commissioner's request, the lead agencies must contact participants to ensure that the participants are continuing to receive needed care, and that the participants have been given free choice of agency-provider, FMS provider, or consultation services provider if they transfer to another CFSS agency-provider, FMS provider, or consultation services provider. In addition, the commissioner or the commissioner's delegate may directly notify participants who receive care from the agency-provider, FMS provider, or consultation services provider that payments have been or will be withheld or that the provider's participation in medical assistance has been or will be suspended or terminated, if the commissioner determines that the notification is necessary to protect the welfare of the participants.\nCFSS agency-providers and FMS providers enrolled to provide CFSS services under the medical assistance program shall comply with the following:\n(1) owners who have a five percent interest or more and all managing employees are subject to a background study as provided in chapter 245C. This applies to currently enrolled providers and those agencies seeking enrollment. \"Managing employee\" has the meaning given in Code of Federal Regulations, title 42, section 455.101. An organization is barred from enrollment if:\n(i) the organization has not initiated background studies on owners and managing employees; or\n(ii) the organization has initiated background studies on owners and managing employees, but the commissioner has sent the organization a notice that an owner or managing employee of the organization has been disqualified under section 245C.14, and the owner or managing employee has not received a set-aside of the disqualification under section 245C.22;\n(2) a background study must be initiated and completed for all staff who will have direct contact with the participant to provide worker training and development; and\n(3) a background study must be initiated and completed for all support workers.\n[Repealed by amendment, 2015 c 78 art 6 s 22]\nIn consultation with the Development and Implementation Council described in subdivision 21 and other stakeholders, the commissioner shall develop recommendations for the oversight of CFSS.",
	"repealed": false
}