{
	"id": "297A.815",
	"url": "https://www.revisor.mn.gov/statutes/cite/297A.815",
	"title": "297A.815 MOTOR VEHICLE LEASES.",
	"text": "(a) In the case of a lease of a motor vehicle as provided in section 297A.61, subdivision 4, paragraph (k), clause (2), the tax is imposed on the total amount to be paid by the lessee under the lease agreement. The lessor shall collect the tax in full at the time the lease is executed or, if the tax is included in the lease and the lease is assigned, the tax is due from the original lessor at the time the lease is assigned. The total amount to be paid by the lessee under the lease agreement equals the agreed-upon value of the vehicle less manufacturer's rebates, the stated residual value of the leased vehicle, and the total value allowed for a vehicle owned by the lessee taken in trade by the lessor, plus the price of any taxable goods and services included in the lease and the rent charge as provided by Code of Federal Regulations, title 12, section 213.4, excluding any rent charge related to the capitalization of the tax.\n(b) If the total amount paid by the lessee for use of the leased vehicle includes amounts that are not calculated at the time the lease is executed, the tax is imposed and must be collected by the lessor at the time the amounts are paid by the lessee. In the case of a lease which by its terms may be renewed, the sales tax is due and payable on the total amount to be paid during the initial term of the lease, and then for each subsequent renewal period on the total amount to be paid during the renewal period.\n(c) If a lease is canceled or rescinded on or before 90 days of its execution or if a vehicle is returned to the manufacturer under section 325F.665, the lessor may file a claim for a refund of the total tax paid minus the amount of tax due for the period the vehicle is used by the lessee.\n(d) If a lessee's obligation to make payments on a lease is canceled more than 90 days after its execution, a credit is allowed against sales tax or motor vehicles sales tax due on a subsequent lease or purchase of a motor vehicle if that lease or purchase is consummated within 30 days of the date the prior lease was canceled. The amount of the credit is equal to (1) the sales tax paid at the inception of the lease, multiplied by (2) the ratio of the number of full months remaining in the lease at the time of termination compared to the term of the lease used in calculating sales tax paid at the inception of the lease. The credit or any part of it cannot be assigned or transferred to another person.\nWhen the lease of a motor vehicle as defined in section 297A.61, subdivision 4, paragraph (k), clause (2), originates in another state, the sales tax under subdivision 1 shall be calculated by the lessor on the total amount that is due under the lease agreement after the vehicle is required to be registered in Minnesota. If the total amount to be paid by the lessee under the lease agreement has already been subjected to tax by another state, a credit for taxes paid in the other state is allowed as provided in section 297A.80.\n(a) On or before June 30 of each fiscal year, the commissioner of revenue must estimate the revenues, including interest and penalties and minus refunds, collected under this section for the current fiscal year.\n(b) By July 15 of the subsequent fiscal year, the commissioner of management and budget must transfer the revenues estimated under paragraph (a) from the general fund as follows:\n(1) 38 percent to the county state-aid highway fund;\n(2) 38 percent to the greater Minnesota transit account;\n(3) 13 percent to the local bridge program account in the special revenue fund, which is hereby created; and\n(4) 11 percent to the highway user tax distribution fund.\n(c) Notwithstanding any other law to the contrary, the commissioner of transportation must allocate the funds transferred under paragraph (b), clause (1), to the counties in the metropolitan area, as defined in section 473.121, subdivision 4, excluding the counties of Hennepin and Ramsey, so that each county receives the percentage that its population, as defined in section 477A.011, subdivision 3, estimated or established by July 15 of the year prior to the current calendar year, bears to the total population of the counties receiving funds under this paragraph.\n(d) Money in the local bridge program account under paragraph (b), clause (3), is appropriated to the commissioner of transportation for the local bridge program under section 174.50, subdivisions 6 to 7.\n(e) The revenues under this subdivision do not include the revenues, including interest and penalties and minus refunds, generated by the sales tax imposed under section 297A.62, subdivision 1a, which must be deposited as provided under the Minnesota Constitution, article XI, section 15.",
	"repealed": false
}