{
	"id": "274.014",
	"url": "https://www.revisor.mn.gov/statutes/cite/274.014",
	"title": "274.014 LOCAL BOARDS; APPEALS AND EQUALIZATION COURSE AND MEETING REQUIREMENTS.",
	"text": "By no later than January 1, 2005, the commissioner of revenue must develop a handbook detailing procedures, responsibilities, and requirements for local boards of appeal and equalization. The handbook must include, but need not be limited to, the role of the local board in the assessment process, the legal and policy reasons for fair and impartial appeal and equalization hearings, local board meeting procedures that foster fair and impartial assessment reviews and other best practices recommendations, quorum requirements for local boards, and explanations of alternate methods of appeal.\nBeginning in 2006, and each year thereafter, there must be at least one member at each meeting of a local board of appeal and equalization who has attended an appeals and equalization course developed or approved by the commissioner within the last four years, as certified by the commissioner. The course may be offered in conjunction with a meeting of the Minnesota League of Cities or the Minnesota Association of Townships. The course content must include, but need not be limited to, a review of the handbook developed by the commissioner under subdivision 1.\n(a) Any city or town that conducts local boards of appeal and equalization meetings must comply with the training requirements of subdivision 2 by February 1, by having at least one member who has attended an appeals and equalization course described in subdivision 2 within the last four years. A city or town that does not comply with these requirements is deemed to have transferred its board of appeal and equalization powers to the county for a minimum of two assessment years, beginning with the current year's assessment and continuing thereafter unless the powers are reinstated under paragraph (c).\n(b) The county shall notify the taxpayers when the board of appeal and equalization for a city or town has been transferred to the county under this subdivision and, prior to the meeting time of the county board of equalization, the county shall make available to those taxpayers a procedure for a review of the assessments, including, but not limited to, open book meetings. This alternate review process shall take place in April and May.\n(c) A local board whose powers are transferred to the county under this subdivision may be reinstated by resolution of the governing body of the city or town and upon proof of compliance with the requirements of subdivision 2. The resolution and proofs must be provided to the county assessor by February 1 in order to be effective for the following year's assessment.\n(d) A local board whose powers are transferred to the county under this subdivision may continue to employ a local assessor and is not deemed to have transferred its powers to make assessments.",
	"repealed": false
}