{
	"id": "144A.72",
	"url": "https://www.revisor.mn.gov/statutes/cite/144A.72",
	"title": "144A.72 REGISTRATION REQUIREMENTS; PENALTIES.",
	"text": "(a) The commissioner shall require that, as a condition of registration:\n(1) all owners and controlling persons must complete a background study under section 144.057 and receive a clearance or set aside of any disqualification;\n(2) the supplemental nursing services agency shall document that each temporary employee provided to health care facilities currently meets the minimum licensing, training, and continuing education standards for the position in which the employee will be working and verifies competency for the position. A supplemental nursing services agency that violates this clause may be subject to a fine of $3,000;\n(3) the supplemental nursing services agency shall comply with all pertinent requirements relating to the health and other qualifications of personnel employed in health care facilities;\n(4) the supplemental nursing services agency must not restrict in any manner the employment opportunities of its employees. A supplemental nursing services agency that violates this clause may be subject to a fine of $3,000;\n(5) the supplemental nursing services agency must not, in any contract with any employee or health care facility, require the payment of liquidated damages, employment fees, or other compensation should the employee be hired as a permanent employee of a health care facility. A supplemental nursing services agency that violates this clause may be subject to a fine of $3,000;\n(6) the supplemental nursing services agency shall document that each temporary employee provided to health care facilities is an employee of the agency and is not an independent contractor; and\n(7) the supplemental nursing services agency shall retain all records for five calendar years. All records of the supplemental nursing services agency must be immediately available to the department.\n(b) In order to retain registration, the supplemental nursing services agency must provide services to a health care facility in Minnesota within the past 12 months preceding the supplemental nursing services agency's registration renewal date.\nFailure to comply with this section shall subject the supplemental nursing services agency to revocation or nonrenewal of its registration. Violations of section 144A.74 are subject to a fine equal to 200 percent of the amount billed or received in excess of the maximum permitted under that section.\nNotwithstanding subdivision 2, the registration of a supplemental nursing services agency that knowingly supplies to a health care facility a person with an illegally or fraudulently obtained or issued diploma, registration, license, certificate, or background study shall be revoked by the commissioner. The commissioner shall notify the supplemental nursing services agency 15 days in advance of the date of revocation.\n(a) No supplemental nursing services agency's registration may be revoked without a hearing held as a contested case in accordance with section 144A.475, subdivisions 3a and 7, except the hearing must be conducted by an administrative law judge within 60 calendar days of the request for assignment.\n(b) If a controlling person has been notified by the commissioner of health that the supplemental nursing services agency will not receive an initial registration or that a renewal of the registration has been denied, the controlling person or a legal representative on behalf of the supplemental nursing services agency may request and receive a hearing on the denial. The hearing shall be a contested case in accordance with section 144A.475, subdivisions 3a and 7, except the hearing must be conducted by an administrative law judge within 60 calendar days of the request for assignment.\n(a) The controlling person of a supplemental nursing services agency whose registration has not been renewed or has been revoked because of noncompliance with the provisions of sections 144A.70 to 144A.74 shall not be eligible to apply for nor will be granted a registration for five years following the effective date of the nonrenewal or revocation.\n(b) The commissioner shall not issue or renew a registration to a supplemental nursing services agency if a controlling person includes any individual or entity who was a controlling person of a supplemental nursing services agency whose registration was not renewed or was revoked as described in paragraph (a) for five years following the effective date of nonrenewal or revocation.",
	"repealed": false
}