{
	"id": "222.58",
	"url": "https://www.revisor.mn.gov/statutes/cite/222.58",
	"title": "222.58 INSURANCE OF LOAN.",
	"text": "The commissioner is authorized, upon application by the lender, to insure any eligible loan as provided in this section and, under such terms as the commissioner may prescribe by rule, to make commitments for insuring such loans prior to the date of their execution or disbursement.\nA loan is eligible for insurance under this section under the following conditions:\n(a) The loan shall be in an original principal amount, bear an interest rate, contain complete amortization provisions, and have a maturity satisfactory under such terms as the commissioner may prescribe by rule.\n(b) The proceeds of the loan shall be used solely for:\n(1) participation in contracts for capital investment loans for rail line rehabilitation, acquisition, or installation;\n(2) capital improvement projects designed to improve rail service or reduce the economic impact of discontinuance of rail service, and may include but are not limited to construction or improvement of short segments of rail line such as side track, team track, and connections between existing lines; and construction and improvement of loading, unloading, storage, and transfer facilities, and rail facilities of the rail users or rail carriers;\n(3) rehabilitation of locomotives owned by rail carriers primarily in operation on railroad lines within the state;\n(4) rehabilitation or acquisition of rolling stock owned or acquired by rail users or rail carriers operating or doing business primarily within the state; or\n(5) costs of technical and inspection services related to the rehabilitation of locomotives or acquisition or rehabilitation of rolling stock.\n(c) The loan agreement shall contain such terms and provisions with respect to any other matters as the commissioner may prescribe.\n(d) The borrower provides a guarantee and collateral for the loan which is acceptable to the commissioner as sufficient security to protect the interests of the state.\nAny contract of insurance executed by the commissioner under this section shall be conclusive evidence of the eligibility of the loan for insurance, and the validity of any such contract of insurance properly executed and in the hands of any approved lender shall not be contestable, except for fraud or misrepresentation on the part of the lender.\nExcept as provided in subdivision 5, the provisions of this subdivision shall apply upon default. Within 90 days of a default on a loan, the lender shall send notice to the borrower stating that the commissioner must be notified if the default continues for another 90 days, and the consequences of that default. The lender shall send a copy of the notice to the commissioner. The lender and the borrower may agree to take any steps reasonable to assure the fulfillment of the loan obligation.\nAfter 180 days from the initial default, if the borrower has not made arrangements to meet the obligation, the lender shall file a claim with the commissioner, identifying the loan and the nature of the default. Upon the lender's assignment, transfer, and delivery to the commissioner, within 210 days of the initial default, all rights and interests arising under the loan and any other security interests securing the loan, the commissioner shall pay to the lender from the account an amount equal to the outstanding unpaid principal indebtedness at the time of default less ten percent, plus interest at six percent per annum from the date of default. The failure of the borrower to make any payment under or as provided by any loan insured under this section shall be considered a default under the loan.\nIf the loan money is obtained by the lender through the issuance of revenue bonds under chapter 469 the provisions of this subdivision shall apply upon default. If the borrower fails to make any payment under or as provided by the loan agreement and remains in default for a period of 15 days, the trustee designated by the lender shall send a notice of the default to the commissioner and to the borrower. After 90 days from the initial default if the borrower remains in default under the loan agreement, the trustee shall file a claim with the commissioner, identifying the loan and the nature of the default. Within ten days of the assignment, transfer, and delivery to the commissioner of all the lender's rights and interests arising under the loan and any other security interests securing the loan, the commissioner shall pay to the trustee from the account an amount equal to the outstanding unpaid principal indebtedness at the time of the default less ten percent, plus interest at six percent per annum from the date of default.\nA loan insured under this section that is amortized over a term of not more than ten years with equal annual installments of principal and interest and that has an interest rate exceeding seven percent per annum is eligible for an interest adjustment under this subdivision. The commissioner may pay annually to the lender a percentage of the outstanding balance due on an eligible loan at the beginning of the year equal to the difference between the interest rate on the loan and an interest rate of seven percent per annum. The percentage paid by the commissioner shall not exceed four percent. The borrower shall reimburse the commissioner for any amounts paid pursuant to this subdivision the year after the last payment is due on the loan. The obligation to reimburse the commissioner shall be a lien against any property of the borrower in which the proceeds of the loan have been invested. As a condition of receiving an interest adjustment the commissioner may require the borrower to demonstrate inability to obtain similar assistance or a low interest loan from other available sources. The commissioner may adopt by rule additional reasonable conditions or qualifications for payment of interest adjustments under this subdivision.\n[Repealed, 1994 c 635 art 1 s 41]",
	"repealed": false
}