{
	"id": "446A.03",
	"url": "https://www.revisor.mn.gov/statutes/cite/446A.03",
	"title": "446A.03 MINNESOTA PUBLIC FACILITIES AUTHORITY.",
	"text": "The Minnesota Public Facilities Authority consists of the commissioner of employment and economic development, the commissioner of management and budget, the commissioner of the Pollution Control Agency, the commissioner of agriculture, the commissioner of health, and the commissioner of transportation.\nThe commissioner of employment and economic development shall serve as the chair and chief executive officer of the authority. The authority shall have the position of vice-chair rotate annually among its members. In the absence of the chair or vice-chair at meetings of the authority members may elect a chair for the meeting, and may elect other officers as necessary from its members.\nMS 1992 [Repealed, 1994 c 632 art 2 s 67]\nIn addition to any powers to delegate that members of the authority have as commissioners, they may delegate to the chair, vice-chair, or executive director their responsibilities as members of the authority for reviewing and approving financing of eligible projects that have been certified to the authority by another department or agency, projects that have been authorized by law, or programs specifically authorized by resolution of the authority.\n(a) A majority of the authority, excluding vacancies, constitutes a quorum to conduct its business, to exercise its powers, and for all other purposes.\n(b) The board may conduct its business by any technological means available, including teleconference calls or interactive video, that allows for an interaction between members. If a meeting is conducted under this paragraph, a specific location must be available for the public to attend the meeting and at least one member must be present at that location.\n(a) The authority shall employ and the chair shall appoint, with the concurrence of the authority, an executive director in the unclassified service.\n(b) The executive director may employ a deputy director and chief financial officer.\n(c) The executive director shall:\n(1) perform duties that the authority may require in carrying out its responsibilities to manage and implement the funds and programs in this chapter, implementation of debt issuance authorized by the authority, compliance with all state and federal program requirements, and state and federal securities and tax laws and regulations;\n(2) employ officers, employees, and agents that the executive director considers necessary to discharge the functions of the executive director; and\n(3) define the duties of officers, employees, and agents, and delegate to them any of the powers, duties, and responsibilities, subject to the executive director's control and under conditions prescribed by the executive director.\nThe authority shall enter into agreements for administrative and professional services, and technical support.\nMS 2006 [Repealed by amendment, 2007 c 96 art 1 s 2]",
	"repealed": false
}