{
	"id": "514.99",
	"url": "https://www.revisor.mn.gov/statutes/cite/514.99",
	"title": "514.99 NONCONSENSUAL COMMON LAW LIENS.",
	"text": "(a) \"Public official or employee\" means:\n(1) an elected or appointed official or an employee of a state; a department, agency, or public instrumentality of a state; or a political subdivision of a state; or\n(2) an employee of the federal government or a federal agency as defined for purposes of the Federal Tort Claims Act, United States Code, title 28, section 2671.\n(b) \"Lien\" means an encumbrance on property as security for the payment of debt. \"Lien\" does not include a nonconsensual common law lien.\n(c) \"Nonconsensual common law lien\" means a purported lien that:\n(1) is not provided for by a specific state or federal statute;\n(2) is not consented to by the owner of the property affected; and\n(3) is not a court-imposed equitable or constructive lien. For purposes of this clause, \"court\" means a federal district court, Minnesota district court, or the Minnesota Tax Court.\n(a) No person has a duty to accept for filing or recording a claim of nonconsensual common law lien unless:\n(1) the claim is accompanied by a specific order from a court of competent jurisdiction authorizing the filing of the lien;\n(2) the lien statement is accompanied by an affidavit of personal service or service by certified mail of notice of the proposed lien on the subject of the lien; and\n(3) the lien statement includes the mailing address of the lien claimant.\n(b) No recording officer, recording office, or governmental entity is liable for the acceptance or rejection for filing or recording of a claim of nonconsensual common law lien or a notice invalid lien.\n(a) A person having an interest in real or personal property subject to a recorded claim of a nonconsensual common law lien, who believes the claim of lien is invalid, may petition the district court of the county in which the claim of lien has been recorded for an order, which may be granted ex parte, directing the lien claimant to appear before the court at a time no earlier than six nor later than 21 days following the date of service of the petition and order on the lien claimant, and show cause, if any, why the claim of lien should not be held invalid. The petition must state the grounds upon which relief is requested and must be supported by the affidavit of the petitioner or petitioner's attorney setting forth a concise statement of the facts upon which the petition is based. The clerk of the court shall assign a case number on the miscellaneous docket to the petition. No filing fee is required. The proceeding must be expedited, and the Rules of Civil Procedure need not apply.\n(b) The order to show cause must be served upon the lien claimant by personal service or by mailing copies of the petition and order to the lien claimant at the claimant's last known address or any other address determined by the court to be likely to give actual notice, or as the court may determine is appropriate, including by publication. If service is by mail, service is deemed complete three days after mailing. The envelopes must bear the return address of the sender. If service is allowed by publication, it must be made at least once a week for not less than two consecutive weeks in a newspaper of general circulation in the county in which the claim of lien has been recorded as designated by the court, with a copy of the last notice mailed first class, postage prepaid to the lien claimant.\n(c) The order to show cause must clearly state that if the lien claimant fails to appear at the time and place noted, the claimed lien shall be stricken and released and that the lien claimant may be ordered to pay actual damages and the costs incurred by the petitioner, including reasonable attorney fees.\n(d) If, following a hearing on the matter, the court determines that the claimed lien is invalid, the court shall issue an order striking and releasing the claim of lien and shall award actual damages, costs, and reasonable attorney fees to the petitioner to be paid by the lien claimant. If the court determines that the claim of lien is valid, the court shall issue an order so stating and may award costs and reasonable attorney fees to the lien claimant to be paid by the petitioner.\nA claim of lien against a public official or employee based on the performance or nonperformance of that official's or employee's duties is invalid unless accompanied by a specific order from a court of competent jurisdiction authorizing the filing of the lien or unless a specific statute authorizes the filing of the lien.\nA person who submits or is responsible for submitting for recording or filing any document purporting to create a nonconsensual common law lien against real property, knowing or having reason to know that the document is forged or groundless, contains a material misstatement or false claim, or is otherwise invalid, is liable to the owner of the real property for not less than $5,000 or for actual damages caused thereby, whichever is greater, together with costs and reasonable attorney fees. Additional punitive damages may be assessed by the court. A grantee or other person purportedly benefited by a recorded document that creates a nonconsensual common law lien against real property and is forged or groundless, contains a material misstatement or false claim, or is otherwise invalid, who willfully refuses to release the document or record upon request of the owner of the real property affected, is liable to the owner for the damages and attorney fees provided in this section.\nMS 2000 [Repealed, 2002 c 403 s 7]",
	"repealed": false
}