{
	"id": "317A.241",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.241",
	"title": "317A.241 COMMITTEES.",
	"text": "A resolution approved by the affirmative vote of a majority of the board may establish committees having the authority of the board in the management of the business of the corporation only to the extent provided in the resolution. Committees may include a special litigation committee consisting of one or more independent directors or other independent persons to consider legal rights or remedies of the corporation and whether those rights and remedies should be pursued. Committees other than special litigation committees are subject at all times to the direction and control of the board.\nCommittee members must be natural persons. Unless the articles or bylaws provide otherwise, a committee must consist of one or more persons, who need not be directors, appointed by the affirmative vote of a majority of the directors present.\nSections 317A.231 to 317A.239 apply to committees and members of committees to the same extent as those sections apply to the board.\nMinutes, if any, of committee meetings must be made available upon request to members of the committee and to a director.\nThe establishment of, delegation of authority to, and action by a committee does not alone constitute compliance by a director with the standard of conduct set forth in section 317A.251.\nCommittee members are considered to be directors for purposes of sections 317A.251, 317A.255, and 317A.521.\nUnless otherwise provided in the articles, the bylaws, or the resolution of the board establishing the committee, a committee may create one or more subcommittees and may delegate to a subcommittee any or all of the authority of the committee. In this chapter, unless the language or context clearly indicates that a different meaning is intended, any reference to a committee is deemed to include a subcommittee, and any reference to a committee member is deemed to include a subcommittee member.",
	"repealed": false
}