{
	"id": "134A.09",
	"url": "https://www.revisor.mn.gov/statutes/cite/134A.09",
	"title": "134A.09 HENNEPIN AND RAMSEY COUNTIES; FEES FOR LAW LIBRARIES.",
	"text": "In Hennepin and Ramsey Counties, the district administrator or a designee shall collect in each civil suit, action or proceeding filed in the district, municipal and conciliation courts of the district, in the manner in which other fees are collected, a law library fee from:\n(a) The plaintiff, petitioner or other person instituting the suit, action or proceeding, at the time of the filing of the first paper; and\n(b) Each defendant, respondent, intervenor or other party who appears, either separately or jointly, to be collected at the time of the filing of the first paper by the defendant, respondent, intervenor or other party, or at the time when the party's appearance is entered in the case.\nThe district administrator or a designee shall collect a law library fee from the petitioner instituting proceedings for supervised and unsupervised guardianship, conservatorship, descent, formal and informal probate, trusts and summary assignments at the time of the filing of the petition. The disbursement shall be an item of expense of administration of the estate, entitling the petitioner to reimbursement out of the estate.\n(a) In Hennepin County and Ramsey County, the district court administrator or a designee may, upon the recommendation of the board of trustees and by standing order of the judges of the district court, include in the costs or disbursements assessed against a defendant convicted in the district court of the violation of a statute or municipal ordinance, a county law library fee. This fee may be collected in all petty misdemeanor cases and criminal prosecutions in which, upon conviction, the defendant may be subject to the payment of the costs or disbursements in addition to a fine or other penalty. When a defendant is convicted of more than one offense in a case, the county law library fee shall be imposed only once in that case.\n(b) Beginning August 1, 2025, the law library fee does not apply to a citation issued pursuant to sections 169.06, subdivision 10, and 169.14, subdivision 13.\nThe law library board of trustees shall, with the approval of the board of commissioners, set the amount of the law library fee in the district, municipal, and conciliation courts of the judicial district. All law library fees shall be published in the State Register.",
	"repealed": false
}