{
	"id": "93.193",
	"url": "https://www.revisor.mn.gov/statutes/cite/93.193",
	"title": "93.193 TACONITE IRON ORE MINING LEASE; EXTENSION.",
	"text": "Upon written application by the holder of any mining lease heretofore issued, or hereafter issued upon a prospecting permit heretofore issued, which has been designated as a taconite iron ore mining lease pursuant to Minnesota Statutes 1998, section 93.19 or 93.191, the commissioner of natural resources, with the approval of the Executive Council, may extend the term of the lease for an additional period of 25 years beyond the term specified in the lease, upon the terms and conditions prescribed under this section. The additional period of 25 years for which the lease is extended shall be the extended period as the term is used in this section.\nAs a condition of receiving such extended period the applicant therefor shall agree that during the extended period the royalty rates specified in the lease for ores other than taconite or taconite concentrates shall not be applicable, and no such other ores or concentrates shall be removed except after the royalties and rentals to be paid therefor shall have been negotiated with and agreed to by the commissioner of natural resources, with the approval of the Executive Council. Until such royalty is agreed upon the lessee may mine and stockpile such other ores upon the leased premises, or other lands, pursuant to section 93.20, subdivision 28, if such mining is necessary or desirable in connection with the mining and removal of taconite.\nAll applications for the extension of the term of such taconite iron mining leases shall be made within 18 months from April 27, 1957, and shall be in such form and contain such information as the commissioner may prescribe. Upon such application the commissioner and the applicant shall negotiate, and, with the approval of the Executive Council, shall determine the rentals and royalties to be paid for taconite or taconite concentrates or both during the extended period. Upon such determination the commissioner shall enter into an agreement providing for such rentals and royalties, and containing the other provisions required by this section, which agreement, upon due execution by the commissioner and the holder of such lease, shall be effective to extend the lease for the period hereinbefore specified.",
	"repealed": false
}