{
	"id": "169.73",
	"url": "https://www.revisor.mn.gov/statutes/cite/169.73",
	"title": "169.73 BUMPERS, SAFEGUARDS.",
	"text": "(a) As used in this section, \"private passenger vehicle\" means a four-wheeled passenger automobile as defined in section 168.002, subdivision 24; a van as defined in section 168.002, subdivision 40; a pickup truck as defined in section 168.002, subdivision 26; and a jeep-type automobile or other multipurpose vehicle. \"Private passenger vehicle\" does not include a collector vehicle or collector military vehicle as defined in section 168.10.\n(b) \"Suspension system\" includes both the front and rear wheels and tires of a vehicle as specified in subdivision 3.\nAll private passenger vehicles shall be equipped with front and rear bumpers, except that pickup trucks and vans shall be equipped with front bumpers and with either rear bumpers or reflectors.\nMS 1978 [Repealed, 1980 c 498 s 7]\nNo person shall operate a private passenger vehicle that: (a) was originally equipped with bumpers as standard equipment, unless the vehicle is equipped with bumpers equal to the original equipment; or (b) has a suspension system or body so modified that the height of the vehicle or any bumpers varies more than six inches from the original manufactured height for the vehicle.\nMS 1978 [Repealed, 1980 c 498 s 7]\n(a) Notwithstanding the restrictions contained in subdivision 3, bumpers required under this section shall not exceed a height of (1) 20 inches on any passenger automobile or station wagon or (2) 25 inches on any four-wheel drive multipurpose type vehicle, van as defined in section 168.002, subdivision 40, or pickup truck as defined in section 168.002, subdivision 26, when the vehicle is being operated on a public highway. The height of the bumper shall be determined by measuring from the bottom of the bumper, excluding any vertical bumper attachments, to the ground. A vehicle which has an original bumper which does not exceed a height of 30 inches may be modified by attaching a full width bumper to the regular bumper to meet the height requirement. The attached bumper must be at least 4.5 inches in vertical height, be centered on the vehicle's centerline, extend at least ten inches on either side of the frame, and be attached to the frame in at least four places with angle braces at no less than 45 degrees so that it effectively transfers impact to an extent equal to or greater than the original bumper.\n(b) Competent evidence that a vehicle was originally manufactured with bumpers higher than prescribed in this subdivision shall be an affirmative defense in any action under this section.\n(a) Vehicles other than private passenger vehicles, collector vehicles, collector military vehicles, and other vehicles specifically exempted by law from such requirements must meet the rear-end protection requirements of federal motor carrier regulations, Code of Federal Regulations, title 49, section 393.86.\n(b) Notwithstanding contrary regulations cited in paragraph (a), a truck-tractor and semitrailer combination with a semitrailer length longer than 50 feet whose frame or body extends more than 36 inches beyond the rear of its rearmost axle must not be operated on the highways of this state unless equipped with a bumper or underride guard on the extreme rear of the frame or body. The bumper or underride guard must:\n(1) provide a continuous horizontal beam having a maximum ground clearance of 22 inches, as measured with the vehicle empty and on level ground; and\n(2) extend to within four inches of the lateral extremities of the semitrailer on both left and right sides.\nMS 1978 [Repealed, 1980 c 498 s 7]\nAny person who violates this section is guilty of a misdemeanor.",
	"repealed": false
}