{
	"id": "280.33",
	"url": "https://www.revisor.mn.gov/statutes/cite/280.33",
	"title": "280.33 CERTIFICATES AND DEEDS AS EVIDENCE; GROUNDS FOR SETTING ASIDE.",
	"text": "The certificates and deeds issued pursuant to sections 280.03 and 280.11, or the record thereof, shall be prima facie evidence that the parcel described therein was subject to taxation for the year or years therein stated; that such parcel was listed and assessed at the time and in the manner required by law; that the taxes were levied according to law; that the judgment pursuant to which the sale was made was duly entered, and that the court had jurisdiction to enter the same; that all requirements of law with respect to the sale had been complied with; that such parcel had not been redeemed from the sale; and of title in the grantee therein after the time for redemption has expired; provided, that when any such certificate or deed embraces university, school, or other state lands, the title whereof is in the state, no other or greater interest shall be held to be thereby conveyed than that acquired under the certificate of the commissioner of management and budget. No sale shall be set aside or held invalid by reason of any misrecitals in such certificate or deed; nor unless the party objecting to the same prove either that the taxes were paid before the judgment was rendered, or that such parcel was exempt from taxation, or that the court rendering the judgment pursuant to which the sale was made had not jurisdiction to render the same, or that after the judgment and before the sale such judgment had been satisfied, or that notice of sale as required by this chapter was not given, or that such parcel was not offered at such sale to the bidder who would pay the amount for which the parcel was to be sold at the lowest rate of interest, as provided in this chapter; provided, that every judgment rendered against any parcel for a tax which was paid before the entry thereof, or when the land was exempt from taxation, shall be void, and all sales made under any such judgment or under a judgment which has been paid shall be void, and no title or interest in any parcel sold under such judgment shall pass or be conveyed to any purchaser at such sale. In any action brought to set aside or to cancel such sale, or in which the validity of such sale may arise, the tax receipt, or the treasurer's duplicate thereof, or other record of the payment of such tax in the office of the county auditor or the county treasurer, shall be prima facie evidence of such payment; but such payment shall not be established by parol testimony only. In such action, the county in which the land is situated, or the state, if either claim any interest in the land sold under such judgment, may be made a party defendant, in which case the county attorney shall appear in behalf of such county or state, or both.",
	"repealed": false
}