{
	"id": "147E.01",
	"url": "https://www.revisor.mn.gov/statutes/cite/147E.01",
	"title": "147E.01 DEFINITIONS.",
	"text": "The definitions in this section apply to this chapter.\n\"Advisory council\" means the Registered Naturopathic Doctor Advisory Council established under section 147E.35.\n\"Approved naturopathic medical education program\" means a naturopathic medical education program in the United States or Canada that meets the requirements for accreditation by the Council on Naturopathic Medical Education (CNME) or an equivalent federally recognized accrediting body for the naturopathic medical profession recognized by the board. This program must offer graduate-level full-time didactic and supervised clinical training leading to the degree of Doctor of Naturopathy or Doctor of Naturopathic Medicine. The program must be an institution, or part of an institution, of higher education that at the time the student completes the program is:\n(1) either accredited or is a candidate for accreditation by a regional institution accrediting agency recognized by the United States Secretary of Education; or\n(2) a degree granting college or university that prior to the existence of CNME offered a full-time structured curriculum in basic sciences and supervised patient care comprising a doctoral naturopathic medical education that is at least 132 weeks in duration, must be completed in at least 35 months, and is reputable and in good standing in the judgment of the board.\n\"Board\" means the Board of Medical Practice or its designee.\n\"Contact hour\" means an instructional session of 50 consecutive minutes, excluding coffee breaks, registration, meals without a speaker, and social activities.\n\"Homeopathic preparations\" means medicines prepared according to the Homeopathic Pharmacopoeia of the United States.\n\"Registered naturopathic doctor\" means an individual registered under this chapter.\n\"Minor office procedures\" means the use of operative, electrical, or other methods for the repair and care incidental to superficial lacerations and abrasions, superficial lesions, and the removal of foreign bodies located in the superficial tissues and the use of antiseptics and local topical anesthetics in connection with such methods.\n\"Naturopathic licensing examination\" means the Naturopathic Physicians Licensing Examination or its successor administered by the North American Board of Naturopathic Examiners or its successor as recognized by the board.\n\"Naturopathic medicine\" means a system of primary health care for the prevention, assessment, and treatment of human health conditions, injuries, and diseases that uses:\n(1) services, procedures, and treatments as described in section 147E.05; and\n(2) natural health procedures and treatments in section 146A.01, subdivision 4.\n\"Naturopathic physical medicine\" includes, but is not limited to, the therapeutic use of the physical agents of air, water, heat, cold, sound, light, and electromagnetic nonionizing radiation and the physical modalities of electrotherapy, diathermy, ultraviolet light, hydrotherapy, massage, stretching, colon hydrotherapy, frequency specific microcurrent, electrical muscle stimulation, transcutaneous electrical nerve stimulation, and therapeutic exercise.",
	"repealed": false
}