{
	"id": "115B.421",
	"url": "https://www.revisor.mn.gov/statutes/cite/115B.421",
	"title": "115B.421 CLOSED LANDFILL INVESTMENT FUND.",
	"text": "(a) The closed landfill investment fund is established in the state treasury. The fund consists of money credited to the fund and interest and other earnings on money in the fund. Funds must be deposited as described in section 115B.445. The fund must be managed to maximize long-term gain through the State Board of Investment.\n(b) Each fiscal year, up to $4,500,000 is appropriated from the closed landfill investment fund to the commissioner for the purposes of sections 115B.39 to 115B.444.\n(c) If the commissioner determines that a release or threatened release from a qualified facility for which the commissioner has assumed obligations for environmental response actions under section 115B.40 or 115B.406 constitutes an emergency requiring immediate action to prevent, minimize, or mitigate damage either to the public health or welfare or the environment or to a system designed to protect the public health or welfare or the environment, up to $9,000,000 in addition to the amount appropriated under paragraph (b) is appropriated to the commissioner in the first year of the biennium and may be spent by the commissioner to take reasonable and necessary emergency response actions. Money not spent in the first year of the biennium may be spent in the second year. If money is appropriated under this paragraph, the commissioner must notify the chairs of the senate and house of representatives committees having jurisdiction over environment policy and finance as soon as possible. The commissioner must maintain the fund balance to ensure long-term viability of the fund and reflect the responsibility of the landfill cleanup program in perpetuity.\n(d) Paragraphs (b) and (c) expire June 30, 2025.\nIf money in the closed landfill investment fund is spent or transferred for purposes other than the purposes provided under sections 115B.39 to 115B.444, the commissioner must provide written notification to each county with a qualified facility within 30 days of the transfer or expenditure that includes the amount, purpose, and authority used to spend or transfer the money.",
	"repealed": false
}