{
	"id": "374.11",
	"url": "https://www.revisor.mn.gov/statutes/cite/374.11",
	"title": "374.11 DUTY OF COMMISSION.",
	"text": "As soon as practicable after the appointment of the members of the commission, it shall select a site or sites for the building and may contract with the owners to acquire the site or sites by gift or purchase. The contract or contracts shall be subject to ratification by the city council and board of county commissioners; provided, that if the site selected is not the site of an existing courthouse and city hall building, then the site selected must be a site located within one city block of the site of an existing courthouse and city hall building. The commission shall not recommend constructing the courthouse and city hall on a new site, unless two-thirds of the commission members are in favor. The commission's report shall state that the proposed new site is more advantageous to the city and county than the site of the existing courthouse and city hall and the facts upon which this conclusion is based. The new site must not be finally selected until the report has been published in the daily newspapers of the city and an opportunity given for the public to present its objections, at a hearing held at least 30 days after the publication. As soon as practicable after the selection of a site or sites, the commission shall report to the city council and the board of county commissioners, describing the property selected as a site for the building, and the price at which the properties can be acquired. When the report is filed, the county board and the city council shall consider the report and may either reject or ratify the action taken by the commission. If either or both of these bodies rejects the commission's report, the matter must be resubmitted to the commission for further action. If the city council and the county board approves the site selected by the commission, but does not approve the price at which the site or sites can be acquired, the city council and the county board shall acquire the property by eminent domain. The proceedings in eminent domain to acquire the property may be instituted and carried to completion in the name of either the city or the county, as may be determined by the city council and county board. The proceedings may be instituted and completed either under the laws governing the condemnation of land by counties or under the provisions of the city charter relating to the acquisition of land by eminent domain, or under state law relating to the acquisition by cities of land by eminent domain.\nThe cost of acquiring this land, whether acquired by purchase or eminent domain, shall be paid one-half by the county and one-half by the city. If the property is acquired by eminent domain in proceedings instituted and completed by the city, the county shall reimburse it for one-half of the cost and expense of acquiring the land. If the proceedings are instituted and completed by the county, the city shall reimburse the county in the same manner. All land acquired as a site for the courthouse and city hall building shall be owned jointly by the county and the city. If the entire tract is acquired by either the city or the county, an undivided one-half interest shall be conveyed to the other upon reimbursement for one-half of the cost of acquiring the land.",
	"repealed": false
}