{
	"id": "317A.115",
	"url": "https://www.revisor.mn.gov/statutes/cite/317A.115",
	"title": "317A.115 CORPORATE NAME.",
	"text": "(a) The corporate name must be in the English language or in another language expressed in English letters or characters.\n(b) A corporate name may not contain a word or phrase that shows or implies that it may not be incorporated under this chapter.\n(c) A corporate name need not contain the word \"corporation,\" \"incorporated,\" \"company,\" or \"limited,\" or an abbreviation of one of these words.\n(a) A corporate name must be distinguishable upon the records in the Office of the Secretary of State from the name of a domestic corporation or limited partnership, a foreign corporation or limited partnership, whether profit or nonprofit, a limited liability company, whether domestic or foreign, on file, authorized to do business in this state at the time of filing, a limited liability partnership, whether domestic or foreign, or a name the right to which is, at the time of incorporation, reserved, registered, or provided for in section 5.35, 317A.117, 302A.117, 321.0109, or 322C.0109, or sections 333.001 to 333.54, unless one of the following is filed with the articles:\n(1) the written consent of the organization having the name that is not distinguishable;\n(2) a certified copy of a final decree of a court in this state establishing the prior right of the applicant to use its corporate name in this state; or\n(3) an affidavit of nonuse of the kind required by section 302A.115, subdivision 1, paragraph (d), clause (3).\n(b) The secretary of state shall determine whether a name is distinguishable from another name for purposes of this section and section 317A.117.\n(c) This subdivision does not affect the right of a corporation existing on January 1, 1991, or a foreign corporation authorized to do business in this state on that date, to use its corporate name.\nThis section and sections 317A.117 and 317A.823, subdivision 2, do not abrogate or limit the law of unfair competition or unfair practices, sections 333.001 to 333.54, the laws of the United States with respect to the right to acquire and protect copyrights, trade names, trademarks, service names, service marks, or other rights to the exclusive use of names or symbols, nor derogate the common law or the principles of equity.\nA corporation that is merged with another domestic or foreign corporation, that is incorporated by the reorganization of one or more domestic or foreign corporations, or that acquires by sale, lease, or other disposition to or exchange with a domestic corporation all or substantially all of the assets of another domestic or foreign corporation, including its name, may have the same name as that used in this state by any of the other corporations, if the other corporation was incorporated under the laws of, or is authorized to transact business in, this state.\nThe use of a name by a corporation in violation of this section does not affect or impair its corporate existence, but a court in this state may, upon application of the state or of an interested or affected person, enjoin the corporation from doing business under a name assumed in violation of this section, although its articles may have been filed with the secretary of state and a certificate of incorporation issued.\n[Repealed, 2008 c 203 s 14]",
	"repealed": false
}