{
	"id": "116A.17",
	"url": "https://www.revisor.mn.gov/statutes/cite/116A.17",
	"title": "116A.17 ASSESSMENT PROCEDURE AND FINAL HEARING.",
	"text": "At any time after the expense incurred and to be incurred in the completion of a water or sewer or combined system, or of any subsequent improvement or extension thereof, has been calculated under the direction of the board or court the county auditor or auditors, with the assistance of the engineer or another qualified person shall calculate the proper amount to be specially assessed for the improvement against every assessable lot, piece or parcel of land, without regard to cash valuation. The proposed assessment roll shall be filed with the county auditor and open to public inspection. In a judicial proceeding the assessment roll shall be filed with the county auditor in each county wherein assessments are to be levied. The auditor or court administrator shall then, under the board's or court's direction, publish notice of a hearing in the official papers covering the area of the improvement to consider the proposed assessment. The notice shall be published in the newspaper at least once and shall be mailed to the owner of each parcel described in the assessment roll. For the purpose of giving mailed notice under this subdivision, owners shall be those shown to be such on the records of the county auditor or, in any county where tax statements are mailed by the county treasurer, on the records of the county treasurer; but other appropriate records may be used for this purpose. Publication and mailing shall be no less than two weeks prior to the hearing. Except as to the owners of tax-exempt property or property taxed on a gross earnings basis, every property owner whose name does not appear on the records of the county auditor or the county treasurer shall be deemed to have waived the mailed notice unless that owner has requested in writing that the county auditor or county treasurer, as the case may be, include that owner's name on the records for such purpose. The notice shall state the date, time, and place of the meeting, the general nature of the improvement, the area proposed to be assessed, that the proposed assessment roll is on file with the auditor, and that written or oral objections thereto by any property owner will be considered.\nAt the hearing or at any adjournment thereof the board or court shall hear and pass upon all objections to the proposed assessment, whether presented orally or in writing. The board or court may amend the proposed assessment as to any parcel and by resolution adopt the same as the special assessment against the lands named in the assessment roll. Notice of any adjournment of the hearing shall be adequate if the minutes of the meeting so adjourned show the time and place when and where the hearing is to be continued, or if three days' notice thereof be published in the newspaper. The assessment, with accruing interest, shall be a lien upon all private and public property included therein, from the date of the resolution adopting the assessment, concurrent with general taxes; but the lien shall not be enforceable against public property as long as it is publicly owned, and during such period the assessment shall be recoverable from the owner of such property only in the manner and to the extent provided in section 435.19. All assessments shall be payable in equal annual installments extending over such period, not exceeding 30 years, as the board or court may direct. The first installment shall be payable on the first Monday in January next following the adoption of the assessment and its extension on the tax rolls, which shall be completed as soon as practicable; except that the board or court may direct the payment of the assessment on one or more lots, pieces, and parcels of land to be deferred for a specified period, or until it is connected to the system, or to be extended over a longer period not exceeding 50 years, if it finds that such method of payment in any case will be more commensurate with the benefits to be received by the property and that the net revenues of the system will be sufficient to meet any deficiency in funds available to pay principal and interest when due on bonds to be issued to finance the system, resulting from deferment or extension of such assessment payments. All assessments not paid in full within 30 days from the date of confirmation of the assessments shall bear interest at the rate fixed by the board or court, but not exceeding eight percent per annum. To the first installment shall be added interest on the entire assessment from the date of levying the assessment until December 31 of the year in which the first installment is payable; provided that the board or court, if payment of the first installment on any property is deferred, may provide that interest during the period of the deferment shall be paid annually, or shall be forgiven in whole or in part, or, if not paid or forgiven, shall be added to the principal amount of the special assessment payable in annual installments after the expiration of the period of deferment. To each installment after the first one there shall be added interest for one year on all unpaid installments. In lieu of the method of payment provided above, special assessments may be made payable in equal annual installments including both principal and interest, each in the amount annually required to pay the principal over such period with interest at such rate as previously determined not exceeding the maximum period and rate specified. In this event no prepayment shall be accepted without payment of all installments due to and including December 31 of the year of prepayment, and the original principal amount reduced only by the amounts of principal included in such installments, computed on an annual amortization basis. No special assessments levied under the provisions of section 116A.12 or this section shall be subject to deferment under the provisions of section 273.111, subdivision 11, or of any other law except this subdivision.\nAfter the adoption of the assessment the auditor shall prepare a final assessment roll with each installment of the assessment, and interest thereon, set forth separately, and shall extend same on the proper tax lists of the county. All assessments and interest thereon shall be collected and paid over in the same manner as other county taxes. The owner of any property so assessed may, at any time before the assessment has been extended on the tax lists pay the whole of the assessment on such property, with interest accrued to the date of payment, except that no interest shall be charged if the entire assessment is paid within 30 days from the adoption thereof; and, except as hereinafter provided, that owner may at any time prior to November 15 of any year prepay the whole assessment remaining due with interest accrued to December 31 of the year in which said prepayment is made.\nOn the confirmation of any assessments the auditor shall notify the county board of commissioners of the amount payable by any county and shall mail a notice to the clerk or recorder of any other political subdivision specifying the amount payable by the political subdivision, and to the owner of any right-of-way at its principal office in the state, a notice specifying the amount payable on account of any right-of-way. The amount payable on account of any right-of-way or public property or by any city connected to the system shall be payable to the water or sewer system's special fund and shall be payable in like installments and with like interest and penalties as provided for in reference to installments payable on account of assessable real property, except that interest accruing shall not begin to run until the notice provided in this subdivision has been properly given and 30 days thereafter have elapsed. The governing body of any such political subdivision shall provide for the payment of these amounts and shall take appropriate action to that end. If the assessment is not paid in a single installment, the auditor shall annually mail to each connected city, to the owner of any right-of-way and, as long as the property is publicly owned, to the owner of any public property a notice stating that an installment is due and should be paid to the water or sewer district's special fund. The auditor may collect the amount due on account of the right-of-way of any railroad or privately owned public utility by distress and sale of personal property in the manner provided by law in case of taxes levied upon personal property or by suit brought to enforce the collection of this indebtedness unless a different method of collecting such amounts is provided for by any contract between the owner of any right-of-way and the board or court. Any amount payable by any city connected to the system, if not paid when due, may be extended by the auditor as a tax upon all taxable property within the city for collection with other taxes in the following year.",
	"repealed": false
}