{
	"id": "216C.48",
	"url": "https://www.revisor.mn.gov/statutes/cite/216C.48",
	"title": "216C.48 STANDARDIZED SOLAR PLAN REVIEW SOFTWARE; TECHNICAL ASSISTANCE; FINANCIAL INCENTIVE.",
	"text": "(a) For the purposes of this section, the following terms have the meanings given.\n(b) \"Energy storage system\" has the meaning given in section 216B.2422, subdivision 1.\n(c) \"Permitting authority\" means a unit of local government in Minnesota that has authority to review and issue permits to install residential solar projects and solar plus energy storage system projects within the unit of local government's jurisdiction.\n(d) \"Photovoltaic device\" has the meaning given in section 216C.06, subdivision 16.\n(e) \"Residential solar project\" means the installation of a photovoltaic device at a residence located in Minnesota.\n(f) \"SolarAPP+\" means the most recent version of the Solar Automated Permit Processing Plus software, developed by the National Renewable Energy Laboratory and available free to permitting authorities from the United States Department of Energy, that uses a web-based portal to automate the solar project plan review and permit issuance processes for residential solar projects that are compliant with applicable building and electrical codes.\n(g) \"Solar plus energy storage system project\" means a residential solar project installed in conjunction with an energy storage system at the same residence.\nA program is established in the department to provide technical assistance and financial incentives to local units of government that issue permits for residential solar projects and solar plus energy storage system projects in order to incentivize a permitting authority to adopt the SolarAPP+ software to standardize, automate, and streamline the review and permitting process.\nAn incentive may be awarded under this section to a permitting authority that has deployed SolarAPP+ and made SolarAPP+ available on the permitting authority's website.\n(a) A permitting authority must submit an application for a financial incentive under this section to the commissioner on a form developed by the commissioner.\n(b) An application may be submitted for a financial incentive under this section after SolarAPP+ has become operational in the permitting authority's jurisdiction.\nThe commissioner must develop administrative procedures to govern the application review and incentive award process under this section.\nBeginning no later than March 1, 2025, the commissioner may award a financial incentive to a permitting authority under this section only if the commissioner has determined that the permitting authority meets verification requirements established by the commissioner that ensure a permitting authority has made SolarAPP+ operational within the permitting authority's jurisdiction and that SolarAPP+ is available on the permitting authority's website.\n(a) An incentive awarded under this section must be no less than $5,000 and no greater than $20,000.\n(b) The commissioner may vary the amount of an incentive awarded under this section by considering the following factors:\n(1) the population of the permitting authority;\n(2) the number of permits for solar projects issued by the permitting authority using conventional review processes;\n(3) whether the SolarAPP+ software has been adopted on a stand-alone basis or has been integrated with other permit management software utilized by the permitting authority; and\n(4) whether the permitting jurisdiction has participated in other sustainability programs, including but not limited to GreenStep Cities and the United States Department of Energy's SolSmart and Charging Smart programs.\nThe department must provide technical assistance to eligible permitting authorities seeking to apply for an incentive under this section.\nThe department must develop an education and outreach program to make permitting authorities aware of the incentive offered under this section, including by convening workshops, producing educational materials, and using other mechanisms to promote the program, including but not limited to utilizing the efforts of the League of Minnesota Cities, the Association of Minnesota Counties, the Community Energy Resource Teams established under section 216C.385, and similar organizations to reach permitting authorities.\n(a) The SolarAPP+ program account is established in the special revenue account in the state treasury. The commissioner must credit to the account appropriations and transfers to the account. Earnings, including interest, dividends, and any other earnings arising from assets of the account, must be credited to the account. Money remaining in the account at the end of a fiscal year does not cancel to the general fund but remains in the account until June 30, 2028. The commissioner must manage the account.\n(b) Money in the account is appropriated to the commissioner for the purposes of this section and to reimburse the reasonable costs incurred by the department to administer this section.",
	"repealed": false
}